{"reviewTitle":"Good design,works perfect","reviewDescription":"As an individual who wants to be aware of every situation in my home, I wanted all fire and carbon monoxide alarms to communicate with my mobile phone.Since I often go abroad, my mind was staying at home.Since I use the Ring products with trust, I chose the product from the same brand.The box, product design is very successful as always.It is easy to install and I have not seen a error in its operation so far.I dont know about battery life yet.Connectivity is good too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Ring system smoke-fire detector","reviewDescription":"This smoke detector works amazing and it was easy to set up and works great with my current ring cameras and alarm system. I highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Do your research on this product before buying.","reviewDescription":"First let me say that some people write bad reviews for their own wrong doings for ordering wrong product like this one  thinking it can do something that it cannot do. A lot of people state this is not a detector. Well of course it’s not. It states write in the details it is not. It is a ‘Listener’. Meaning it listens for your already installed detectors alarms. Now I have only battery detectors. Two of them. One on my first floor one in the basement.  Now they are battery and do not ‘talk’ to each other.  So if basement smoke detector goes off. It will not trigger the upstairs to alarm. So then I would need this product at every smoke detector!  So I removed it. I ordered ‘First Alert smoke\/CO Z wave. So they directly go to ring Alarm system. I got them on google store from Costco. A 3 pack for $80. So if you have a hardwire ‘interconnected’ system now that you recently purchased your alarms.  Then I would say this product is awesome. You will only need one because with a hardwired ‘interconnected’ system if one goes off they all go off.  So no matter what detector you put it near Ring will get the alarm notification. So know what your system is now will help in your purchase. Also people state they have to rip the wall off to remove is a lie. When you unscrew the top after you ‘remove’ the device from your system then you see next to the battery there is a clip that you depress down and slide the listener off it’s bracket. Very easy.Hope this helps some people.","isVerified":true,"ratingScore":5,"reviewReaction":"103 people found this helpful","country":"United States","date":1578787200000}
{"reviewTitle":"Must have addition to the Ring Alarm system","reviewDescription":"Easy install and sync up with existing Ring alarm system. This fire \/ smoke and CO listening devise is a must if you want additional saving on your house insurance as it does provide you with Fire Alarm monitoring certification if registered with Ring alarm hub.  But you need to have a paid subscription.BTW… if you worry about false alarm then make sure it is deactivated if you home, etc. And only set it active when you travel or a night.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Great","reviewDescription":"This is one of the best things i have ever purchased","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Ring","reviewDescription":"I have been using ring for years. It's a great product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Exceptional","reviewDescription":"Very good reliable great value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"IMPORTANT: READ FIRST","reviewDescription":"I accidentally triggered the fire dept to come to my house within minutes of installing this thing. Here’s what happened:1. I installed the device next to my smoke\/CO detector per the instructions.2.  The instructions say to test the listener in the Ring app3. I go to do so, but end up accidentally going into the **wrong** test menu (turns out there are two different test menus, one just for base station connectivity and one to bypass monitoring, and they both say Test Listener)4. I press the test button on my actual smoke detector thinking my new Ring listener is just in test mode and won’t trigger the fire dept5. I get two separate immediate alerts from Ring monitoring that fire and CO respectively are detected in my house. And I dismiss them both within literally 2 seconds. No big deal I thought since I dismissed them quickly.6. Ring monitoring calls 30 seconds later. I tell them who I am and I just set it up and was just doing the testing (per instructions). They said, ‘oh well with CO we dispatch first and then call the home.’***SHOCK*** (That’s not how the Ring alarm monitoring usually works!) I asked if they can cancel the dispatch and they cannot.7. I try calling fire dept to cancel but no answer probably because they’re rushing to my house.8. So, fire engine with crew shows up with sirens and lights and horns, and I have to explain how this accident happened. I apologized profusely and fortunately the firefighter was cool about it, but not all departments will be like that, especially because this may cause them to miss another real emergency.TLDR; The instructions tell you to test the device in the ring app. There are two separate test menus for this listener in the Ring app. One disables monitoring and dispatching for 15 mins so you can test your detector, the other just tests the Ring listener’s connection to base station without disabling monitoring. They both say Test! Don’t mix them up! The one inside of Advanced Settings will not prevent Ring from dispatching the fire department immediately!","isVerified":true,"ratingScore":5,"reviewReaction":"136 people found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"Works As Advertised!","reviewDescription":"Fire\/Smoke\/Carbon Monoxide Listener consistently function as designed.  This is my second unit installed to cover the interconnected Smoke and Carbon monoxide alarm in my two main bedrooms. All weekly recommended tests of the listener detected the fire alarms and carbon monoxide detector’s distinct sounds. Received instant notifications via mobile app and local key pads and main alarm base stations. At one time, I made a mistake while testing, due to the rule of not able to cancel carbon monoxide alarm notifications, one company of our local fire department brigade showed up within 10 minutes of the accidental carbon monoxide alarm. This Ring Listeners works!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Initially had problems, support was fantastic. Problems SOLVED!","reviewDescription":"I bought this kit to replace my LifeShield system. When I ordered I got enough kit to replace sensor for sensor. All of the kit arrived and I started the process of setting it up. The base connected to my network without a hitch but I wasn't unable to get ANY of the other devices to connect to the base. I had keypads, contact sensors, motion sensors, water and fire sensors and NONE of them would connect. So I reached out to support via email. In hind sight I should have just called but I was hoping for a short, quick answer that would solve all of my problems. That didn't happen and I got pretty frustrated. After several hours over several days of finding other reports online and trying what they had tried I was ready to throw in the towel. Then Danielle contacted me. She put me in touch with Nick in tech support and he tried for over an hour with me to get something, anything to connect. He had me disconnect other stuff in my house that could be causing interference with no luck. Finally I gave up out of frustration. I really wanted this kit to work because I already have Ring cameras and wanted an all-in-one solution.I waited a couple of days for Danielle to get back to me. In the mean time I spent time here and there trying to see if I could get something to connect, but with no success. Until today. Today I literally shut off the power to every single thing in my house except for my internet connection gear and I started over. Base station came right up. Plugged in the keypad and it looked like it was going to fail like it always has, until it CONNECTED! Contact sensor? CONNECTED! Motion? Water? Fire? Other keypads? All CONNECTED!My existing alarm is from LifeShield. Turns out I had two repeaters I did not remember installing that were causing interference and preventing the sensors from communicating with the base. Once those were off I had no issues connecting up the rest of the kit.I still have not installed this as my active alarm but I will get that done soon. Bottom line is that my initial review and bad experience with this alarm were all caused by other kit in my house. The support I got from Ring, even when I wasn't kind, was great. For that they get 5 stars and I will come back and update this review once I have some experience with the system.","isVerified":true,"ratingScore":5,"reviewReaction":"33 people found this helpful","country":"United States","date":1556755200000}
{"reviewTitle":"Nice idea, buy buy a new First Alert Z-wave instead","reviewDescription":"This was a good idea to tie in existing smoke\/co devices but the execution makes it worthless.  The instructions say it needs to be 3-6\" away and I found that it wouldn't work more than an arms length away and even then it needed to be pointed directly at the alarm.  This means you can't really use it with more than one alarm even though the FAQ suggests you could do it.  So why would anyone get this instead of just buying a brand new First Alert Z-wave combo alarm for the same money?  The only good reason is if you live somewhere you can't replace your alarm but even then it makes more sense to buy a new Z-wave and stick it somewhere so you have twice the protection.The setup of this device is surprisingly tricky.  You have to press a small button on the side to get it into test mode but while it lights up initially there's no indication you're in test mode.  I held it apparently for too long and it won't enter test mode.  The app doesn't give any indication of what should happen next but if you press it SHORT then it will go to the next screen to register any alarms.  The app won't let you \"reset\" the alarm so you can test multiple alarms of the same type - you have to repeat the whole test!  Finally even removing the alarm was tricky.  You have to time the clicking of remove in the app with removal & reinserting the batteries in some combination that didn't work the first two times and again there's no indication of what's supposed to be happening or what happens next.This listens for the 3 or 4 tones produced by devices in the last 10 years.  They should tell you it flashes red when it hears any loud sound - so you can see it flash for each beep by your Smoke\/CO detector.  But I wanted to use my old alarm system which has smoke \/ heat detectors which don't have a siren built-in and rely upon the system to alert the user.  That system makes a continuous on\/off siren and was not identified as T3 or T4 so it didn't detect it.  There should be a way to hook alarm outputs directly to this thing so you can tie in an old alarm system or a fire sprinkler sensor.Overall I can't figure out what they were thinking.  It's overpriced vs the First Alert Z-wave combo alarm and won't let you use other sensors or your old alarm system.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1601856000000}
{"reviewTitle":"Smoke and CO monitoring is not available for business addresses.","reviewDescription":"NOTE: RING ALARM SMOKE AND CO MONITORING IS NOT AVAILABLE FOR BUSNIESSES. INTENDED FOR RESIDENTIAL USE.It is not mentioned in the device details on the Amazon product page or in the setup instructions, but this cannot not be used at a business address!Reviewed Ring Alarm Smoke and CO Listener product on Amazon website and placed a purchase. Received the device and attempted to link it to Ring Alarm system used at local business. Device could not be connected with the provided step-by-step instructions. Check Ring support site and called Ring support, issue still could not be resolved.Was able to connect the device to the alarm system by selecting \"Flood & Freeze Sensor\". It was not until completing all the instructions for setup which included mounting the device to the wall, that I received a notification that the device was not supported. Once again, no mention of this on Amazon or Ring's product pages, in the device instructions, or during a phone conversation with Ring support.Cannot provide any opinion on the product itself, but there is a problem with product documentation and technical support.Email message received from Amazon after device setup:\"Due to strict regulations, Ring cannot provide smoke and CO monitoring at business locations.Why can’t Ring provide smoke or carbon monoxide monitoring?If you use this device and smoke or CO is detected, Ring Alarm is required to send the smoke or CO signal to the monitoring center, and the monitoring center must request dispatch from local authorities. However, depending on your local laws, your local authorities may not show up, and you may incur serious penalties and\/or large fines. To avoid these consequences, remove this smoke\/CO monitoring device.What should I do?We are asking you to remove this device from your Ring Alarm. Adding and using a professionally monitored smoke or CO device to a Ring Alarm at your business violates our Terms of Service. If you do not remove this device, you are solely responsible for any fines, fees, or penalties that result from installing and using these devices on your business property.\"","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1620086400000}
{"reviewTitle":"Must be close!","reviewDescription":"The way this is designed it Hass to be within 3 inches of your alarm and smoke detector. Otherwise it will not hear the alarm go off. This requires you to purchase one for every single smoke detector and CO detector in your home. I don’t understand why they couldn’t design one that listened throughout the entire house for a specific noise especially when during set up it listens for your alarm. So it would know what your alarm would sound like And only could listen to that specific noise. But I guess Ring wanted their $30 for every single alarm in your home guess that makes financial sense. However the difference of $60 versus 300 is a little ridiculous, especially with today’s codes requiring a CO detector on each level and a fire detector in each bedroom, living room and hallway.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Ring smoke and carbon monoxide listener..","reviewDescription":"I bought it without doing some research about it. When I find out about it, it’s was too late for me. My guest is, it should work great if you have the main station that you have to buy it separately. The Ring Station for the alarms for your home. It will not work without it..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Unable to set mode in app","reviewDescription":"Set up was alright except for the testing. Button needs to be more prominently displayed. It definitely picks up smoke and sounds loudly.  The reason I will not be purchasing again and will be removing it from my system is because there is no option to disable it when the system is disarmed.  Switching back and forth between self-monitoring and professional monitoring is not an option I care to use nor a solution to what appears to be a common problem with many users.  Ring overlooked this option for the listener which is available for their other devices.  Would not recommend unless you do not live where it is placed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658707200000}
{"reviewTitle":"User Can't Cancel False Smoke Alarm Using Keypad or Ring App!","reviewDescription":"In case of a false smoke alarm, the current Ring smoke monitoring protocols mean that if the first contact can't be reached, the fire department will be dispatched! This is obviously not acceptable when multiple family members use a kitchen.ANY AUTHORIZED USER  should be able to cancel the smoke alarm using the Ring key pad or Ring app.In other words, if I (first contact) am away and unreachable and my husband  (second contact) accidentally sets off the alarm cooking some bacon, he can't use the app on his phone or the keypad to cancel the alarm! The fire department will be dispatched and my husband will be informed that they have been dispatched.  THIS IS UNACCEPTABLE!!!","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1617321600000}
{"reviewTitle":"This device is not cost effective","reviewDescription":"This is just a smoke alarm listener, it doesn’t detect smoke or co alarm. Many of the smoke and co alarms are now voice alarm. This thing simply doesn’t work for voice alarm.It is very expensive as well, you can easily get a smart co and smoke detector with a similar prices. Ring itself actually has such device. No point to spend money on this.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1660953600000}
{"reviewTitle":"Can't be disabled from app no matter alarm status","reviewDescription":"Start by saying it does work, it hears smoke alarms. But....but. it can't be disarmed from the app. So if you have an alarm that beeps for low batteries, or cooking and something smokes a little, then your screwed. It needs an disarmed mode in the app. I get that it's a safety device, but I don't need it when I'm home and awake. Let me set it like the other sensors Ring. Come on.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1636761600000}
{"reviewTitle":"Buyer beware","reviewDescription":"First: MUST HAVE A BASE STATION.  That is not necessarily easy to spot if you, like I, ass u me'd that because I have other ring products that connect to my phone, this would as well. I wish they named things according to necessary system components.Second: This has a MUCH  narrower \"listening\" area than I assumed. You need to mount it near your regular alarm.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614384000000}
{"reviewTitle":"Ring is amazing, these are not!","reviewDescription":"I have loved all of my many ring products, these however are junk.  They do not test, or even have adequate direction in the app to know if you are testing them correctly.  I even screwed the second one right next to the detector, as in touching.  The first was 4 inches.  It says 3-6.  I can not test them to use them.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1599177600000}
{"reviewTitle":"Picks up either smoke or CO alarm in my case","reviewDescription":"Bought. Installed as instructed. Picks up only CO alarm but not smoke detertor(s). On the phone with ring support for an hour and a half. Tried to connect sensor, reset it, tested it more than 3 times. Disconnected and reconnected to the system. Escalated to advanced technical team but they are hard to reach and long waiting time. It's very unpleasant and far from simple as should be.Update a day later - ring support called and troubleshot the issue. turns out it some cases it can serve as both CO and smoke. In other cases, if you have 5 smoke and one CO detectors, you may need 6 listeners. That's smth to bear in mind. In my case ring told me I need 2 more and promised to send extra 2 as my detectors are interconnected. Bottom line, it was the hardest component to install and configure but the solution ring offered and the peace of mind from having this issue resolved and covered are well worth it.Just be prepared to spend more time and $ and frustration installing it, hence the 4 stars review not 5.  Like the rest of the system, once installed it should be straight forward.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Works well but not in a hot environment","reviewDescription":"These work well inside your house & stuff but if you decide to put one in a outside storage type of environment without A\/C just be warned the batteries will drain quickly ( like 1 week or less quickly in the AZ 110F+ heat)","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Decided to not use it (Updated Feb 8, 2020)","reviewDescription":"I was looking forward to being able to use this because it would integrate with the interconnected smoke detector system in my house, but still give me the bonus of being alerted in the event of fire or carbon monoxide.However, I decided not to use it because there is no way to cancel a false alarm and I don't want the fire department showing up every time steam from a shower or burned food sets off my smoke detectors.I suppose it's a liability issue where Ring wants to err on the side of caution instead of waiting to call emergency services.I really wish that there was an option to send you an alert so you can opt to NOT contact the fire department...** Update **After posting my review, I received an email response from a Ring representative and I’m updating my review to reflect my new understanding of how Ring Professional Monitoring handles these alarms.  I DO still wish the app gave you more choice to control this which would also make it more clear as to what’ll happen in the event of an alarm detection.Apparently, I misunderstood how\/when the Ring professional monitoring contacts emergency services.  I guess when a fire is detected, they WILL attempt to call the listed contacts before calling emergency services.I’m posting that response here as it may be useful information for other potential buyers:“ Hello Aaron,Please allow me to introduce myself. My name is Jamila and I am an Amazon Executive Community Support Representative specialized in Ring Alarm devices.I came across your review \"Decided to not use it\"on Amazon for the Ring Alarm Smoke and Co Listener. I want to thank you for sharing your experience with us. I understand that you are having some concerns with your smoke and co listener and I would like to provide you with some information.If a fire is detected the monitoring station will call the first contact before dispatching police. If the first contact does not answer\/requests dispatch, then a dispatch request will be made. The remaining contacts on your list are called, and if anyone can be reached, they are notified of the emergency and may be given the opportunity to try to cancel if it's a false alarm.In the event that CO is detected, it will dispatch the fire department first and then your emergency contacts are given a call. Please click here ​to see our help center article titled - Getting a Call from Ring’s Professional Monitoring Center for more information.If you’d like to work together over email, please reply directly to this email. If you’d prefer a phone call, please let me know the best contact number to reach you, along with the best days and times to call you.I want to thank you for taking the time to write a review on Amazon, and I look forward to hearing from you. “","isVerified":true,"ratingScore":4,"reviewReaction":"41 people found this helpful","country":"United States","date":1580947200000}
{"reviewTitle":"Support was good (Was: Whoever did the setup instructions messed up)","reviewDescription":"EDIT: I finally had a call with the person from Ring support. She was very knowledgeable, and she totally understood my feedback about how the instructions and the feedback given by the app and the device were misleading. Original review below:I tried to give this feedback on the Ring site, but that thing seems almost designed to frustrate that sort of thing, so here goes here. The instructions for doing the \"learning mode\" seem clear, if as the writer, you're a bit of a slacker, but a key part of it isn't thought through. Judging by some of the negative reviews, many others are having problems because of this. The key part is this: It's not clear when the device is and isn't in \"test\/learning\" mode! Since the setup screens have this one picture with a big black arrow pointing at a button, they will press it. This puts the device into \"test\/learn\" mode. THEN, when they are subsequently prompted to press the button, they are taking the device out of \"test\/learn\" mode! Such users will then dutifully go through the test, and see the red light reacting to the sounds, but the test will never successfully complete.I finally figured this out. This tells me that the setup instructions for this product were not thoroughly tested by genuine users unfamiliar with the device. On the surface, it looks like ok instructions. However, there needs to be more and earlier explanation, combined with better feedback from the device and app when things aren't going the correct way. The app should be getting a signal about the sound detection without the alarm detection, so it can warn the user the device is in the wrong state. Instead, the reacting lights fool the user into think the device is in the test\/learn state.I hope someone at Ring gets this feedback, looks at some of the negative reviews, and thinks a little more deeply about this.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1663545600000}
{"reviewTitle":"Good addition to a Ring Alarm System.","reviewDescription":"I installed this sensor to detect and report when my smoke detector\/CO alarm triggers.  I would have preferred a dedicated sensor from Ring for those conditions, but I guess this will have to do.  I sleep with my bedroom door closed, and my hearing aids out for the night, so I'm counting on this device to trigger the loud alarm in my bedside keypad - which it claims to do.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Easy set up - works great","reviewDescription":"The set up is very simple and straightforward on the Ring App.  Includes everything necessary to mount it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"NOT A SMOKE ALARM - A LISTENER","reviewDescription":"I made the mistake of thinking this was an actual smoke alarm.  When I received the unit I was surprised to see that is a listener that you place beside an existing smoke alarm.  When your smoke alarm activates, the listener hears it and alerts your Ring Security System. The listener has to be placed inches away from the existing smoke alarm, so you need one set beside each of your existing smoke alarms.  Ring Customer Service helped me with a return and I was able to purchase First Alert Z Wave Smoke alarms that can link directly with my Ring Security System without a listener. The Ring Security System recognizes the First Alert Z Wave Smoke \/ CO alarm with no problem. This option eliminated purchasing regular smoke alarms and then a Ring Listener to install beside each smoke alarm.  The First Alert Z Wave alarms saved me $$$ and installation time.  Also saved with maintenance on so many units and batteries. Ring Customer Service and Support were very helpful to resolve my issue.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1664841600000}
{"reviewTitle":"Ok so far, but can't turn down or off the alarm.","reviewDescription":"After a few frustrating attempts to set this up and connect it to my ring system, the biggest issue I have is that you can't turn down or off the additional alarm sound that this emits. So, in our case we had a brand new oven that set off the nearest smoke alarm every time you opened it. In addition to the super load regular alarm, this \"listener\" is also alarming super loudly and adding to the stress of making the sounds go away. I guess it would be good to have in an actual fire situation, but if your alarms are like mine, there is no chance you are not going to hear them. The added noise just isn't needed. At a minimum you should be able to control the alarm volume through the app.","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1672963200000}
{"reviewTitle":"Doesn’t Work, And ring won’t respond to help!","reviewDescription":"I bought a full ring system (base, contact sensors, flood\/freeze sensors, lights, motion detectors) and had zero issues with anything EXCEPT for the smoke\/CO listener. It repeatedly fails the ‘listening test’. I follow the instructions for starting over by removing the cover\/battery, it still failed. I tried again, the it stopped even being able to connect to the network! I tried to chat with ring, email ring to RMA out this obviously-defective sensor and for zero response (their chat doesn’t work and the email must have went into an abyss because that was weeks ago and I’ve heard nothing). Funny how the one sensor that your life could actually depend on doesn’t work...in all fairness technology isn’t without its fails, my real issue is the lack of support. Very concerning. I can’t recommend this product or really any of them is this is what happens when you have an issue.***EDIT*** after writing this review I was contacted by Amazon\/Ring customer service within 1 day to resolve the issue and they replaced the defective sensor. It’s a shame this is the only way I was able to get assistance for this issue but they did make it right so changed from 1 star to 4 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1602028800000}
{"reviewTitle":"Ring has now enabled some features to where it plays a short sound on the base station.","reviewDescription":"The flood and freeze sensor came as part of our alarm kit. Honestly living in Florida away from the water I figured it was kind of a throwaway extra. The only place I could think to put it was in the garage between our hot water heater and our extra freezer figuring it’d catch if one of them leaked. To my great surprise I woke up to a robo call at 8am about two weeks later saying water was detected. Sure enough I went into the garage to find the sensor in a small puddle of water. It was not the water heater or the freezer though. Apparently there was a crack in our exterior wall letting our neighbors’ sprinkler water seep through the wall. The puddle was in the corner of my garage just by chance where I put the sensor and I never would have caught it without this sensor. This thing works and saved us from a bigger issue had we not caught this unexpected problem. I’m so happy we got it!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1626220800000}
{"reviewTitle":"Love it","reviewDescription":"I love this notification smoke alarm. It is not a detector but it works perfectly next to my hard wired smoke and CO detectors and alerts me on my phone which requires you to press the disarm button","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Another great Ring product","reviewDescription":"Fast shipping.  Easy to install.  Interacts with alarm system perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Very nice product","reviewDescription":"Like the rest of the ring alarm system, this adapter was very easy to install, easy to set up, and an attractive compliment to the existing smoke detector.The lights are sufficiently bright without being intrusive. And it has a nice appearance.Testing the product was easy. It performed exactly as expected. Like the rest of the Ring system, highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"A requirement for any home","reviewDescription":"So my family and I suffered a house fire so we’re a little sensitive to the idea of a house fire or not knowing for certain that there isn’t a fire. Well we purchased this and it helped the anxiety we had. The install is fairly simple just make sure you follow the directions and put it close to a smoke detector. After install we tested it to make sure it really would work. Ring called me in under 1 minute when it went off. It was extremely reassuring that the response was that quick and that it works the way it’s designed to work.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Updated review — Doesn’t work as per instructions","reviewDescription":"Doesn’t work to setup as per instructions wasted my money since the return window is closed..New update —- Ring customer reached out and well coordinated and sent a replacement device and it worked . First one might be device issue.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"It does its job and does it perfect.","reviewDescription":"Installation and setup is just like any other ring device, simple.Now, having a bit of piece of mind while I'm away is what I was looking for and keeping the reliable detectors I have already instead of a half baked \"smart\" detector was the goal. This makes it.The profile is small and you cannot even notice it next to the detectors, I have high ceiling so I'd never notice it.Unfortunately\/fortunately I had a night one smoke detector went off randomly, likely dust (you should vacuum out smoke detectors periodically to help prevent false alarms, which i failed to do), of course at 330 in the morning. However, the listener did its job perfectly, it activated the smoke alarm on the ring base station, which sounds exactly like the standard NFPA required series of 3 beeps, like all detectors that are NFPA compliant do. Wasnt even out if bed fast enough and my phone was already ringing from the alarm company. I was able to deactivate the alarm and cancel without a big deal.Wasn't exactly the way I wanted my morning to go but it gave me confidence that the listener works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1604534400000}
{"reviewTitle":"Works great so far","reviewDescription":"This notifies you through the Ring application that your home smoke detector has gone off. It isn't a detector for smoke but for sound. When your smoke detector goes off this alarm detects the loud sound and them the notification comes through. My trial test worked so let's hope if I have a fire I'm notified.  I will test it when I check and change the battery in my smoke detector through yearly.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Such a clever solution","reviewDescription":"The house has a wired and interconnected fire\/CO alarm system. While it would be tempting to replace all the sensors, it is much easier just to put this listener next to one of them. If there is a fire or CO leak, it will alert Ring. Nice!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Easy to install and setup","reviewDescription":"The directions were easy to follow for installation and setup. Great addition to my Ring family of products.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Wrapped up my alarm set perfectly.","reviewDescription":"Feeling safe now that I know if my smoke detector goes off I can rely on Ring to send help if it’s needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Could not use it","reviewDescription":"When my son went to install this item, he realized that it would not work because I do not have a Ring Alarm. The 30 day return time has just expired so now I have something I cannot use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Please change the feature to not set off the entire ring alarm!","reviewDescription":"There isn’t a way for the listener to only notify you that it hears a smoke alarm, but not set off your entire ring alarm system separately.I like to monitor my apartment remotely, but do not need the ring alarm going off anytime a neighbor sets off their smoke alarm.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"They are only listeners that work with your RING ALARM, they are not CO and SMOKE ALARMS.","reviewDescription":"They are only listeners that work with your RING ALARM, they are not CO and SMOKE ALARMS.First Alert makes one that works with RING ALARM SYSTEM.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Installation instructions are wrong","reviewDescription":"I installed this according to directions, six inches away from my second generation Nest Protect.  It did not detect the Nest when the smoke detector alarmed.After a lenghy support call with someone who had difficulty speaking english, and following a script, we finally got it working by moving it closer to the smoke alarm - about four to five inches.  I now have to go to the hardware store and buy additional drywall mounting adapters.1) The directions should be changed to less than six inches away.2) Test the listener before installing the mounting screws!Other than that, it's a good device.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Works fine but not worth the money","reviewDescription":"Works fine, easy install.However, for the same 35 bucks you can get a zWave first alert wired smoke and CO detector which has a much longer battery life (10 years vs 3 years for this listener).","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Tips to improve your installation","reviewDescription":"3 Tips from my listening install:  1)  Grab some earplugs for alarm test if you can, 2) Test the listener with the smoke alarm before drilling holes to avoid excess holes in your ceiling \/ wall, and 3) Install the listener as close to the smoke alarm as possible (arrow on the mounting bracket pointing towards the smoke alarm).  Background: I have a kiddie combo smoke\/CO alarm that I wanted to put the listener next to.  The instructions say to put it within 6 inches and the arrow on the mounting bracket pointing towards the smoke alarm. My listener paired with the ring base station successfully.  Then I installed as instructed, at 6 inches using their template.  During the test the listener blinks red in unison with the smoke alarm chimes (which is a good thing) so it seemed like it heard the alarm ok. But the Ring App didn't recognize a successful test.  So I spent an hour on the phone with the Ring tech (he was very patient :)  ).  We finally figured out that I have to put the listener right next to the smoke alarm (again with the arrow pointing towards the alarm) in order for the listener test to show success in the ring app. Unfortunately, now I need to remove the mounting bracket, fill the holes, drill new holes immediately next to the smoke, and remount.  Grrr  And hopefully my hearing will recover from all the testing of the alarm.  Aside from that, I love not having to replace all my relatively new, wired, functioning smoke alarms with smart alarms...  and just using a listener instead.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1550448000000}
{"reviewTitle":"Does Not Work As Advertised","reviewDescription":"Updated:03\/26\/2020After communication with Ring Customer support who recommended removing the Z-Wave device (Ring Alarm Smoke and CO Listener) from the Base Station, then re-install, the Ring Alarm Smoke and CO Listener finally completed the install successfully and it is able to identify the Smoke and CO signals from the Smoke and CO Alarm.Updating the rating to 3 stars since there is the issue where out of the box brand new the install did not work; only after removing the Z-Wave device then re-install did the Ring Alarm Smoke and CO Listener work.Original review 1 star -  03\/24\/2020The Ring Alarm Smoke and CO Listener is unable to detect alarm signals from latest UL listed Smoke and CO Alarm.The Ring Ring Alarm Smoke and CO Listener was unable to complete installation since it was not able to detect alarm signals from Smoke and CO Alarm that is UL listed and manufactured in 2019.Even after re-installing the Ring Alarm Smoke and CO Listener a second time it still could not successfully detect alarm signals from a UL Listed Smoke and CO Alarm  with manufacturing date in 2019. Neither could it detect the alarm signals from other UL listed Smoke and CO Alarms that are a couple years older than 2019.The unit is either defective or it just does not work as advertised. I would not recommend this item.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1585008000000}
{"reviewTitle":"Missing features and some duds out of the box","reviewDescription":"First off, know what you’re buying. These aren’t smoke detectors. They sit next to the smoke detectors you already have and listen for the smoke detectors to go off. They generally work well in that regard, but a) they don’t work with Ring chimes, so if you have a Ring chime, don’t expect it to alert you when a detector is triggered b) one of the four in the box didn’t connect to my Ring system even after a lot of troubleshooting, which I considered to be a dud. Kind of a disappointment, but I think I’d rather have these things than not have them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681603200000}
{"reviewTitle":"This is only a listener.  Unless you have a hardwired system, why not buy a z-wave detector?","reviewDescription":"I really don't see any reason to buy this unless you have a new detector that you want it to listen to.  You install this 3 to 6 inches from a late model smoke detector or CO detector.  For about the same price, you can buy a combination DETECTOR (not a listener), such as the Ring-compatible First Alert Z-Wave Smoke & Carbon Monoxide Detector.After reading Ring's customer service response below, I changed my rating from one star to three stars.  I decided to order a First Alert Z-Wave detector for the application that I originally intended and set up the Ring listener in a different room.  I get Ring's point about their device being intended for a hard wired detector, but didn't see that stated in the Amazon product description before I bought it.  Two points off for not stating the design purpose in the product description.  I'm setting up a new Ring security system, am happy with it, and customer support has been fantastic.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1570838400000}
{"reviewTitle":"Don't buy more than 1","reviewDescription":"If you plan to get more than 1 of these devices for your house. You will waste your money.Because, if one of your detectors gives the alarm, the others will alarm at the same time and you will never know where is the actual alarming location. So this device is useless for determining the alarm location.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1661040000000}
{"reviewTitle":"WORKS","reviewDescription":"It works buy i dont understand what happens if my alarms go off.I did put it next to my fire alarm and when i pushed the test buttons the alarm sounded and the ring device did light up so it is hearing just fine...There isnt much config settings for the device but i think ring will send some updates soon","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577836800000}
{"reviewTitle":"Set up was difficult","reviewDescription":"Set up took forever and had a lot of trouble setting this up to my ring alarm system. I assume it works though but I haven’t had my smoke detectors or CO alarm go off so I don’t know how effective this product is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1619568000000}
{"reviewTitle":"Good idea, lots of room for improvement.","reviewDescription":"Added this to a whole house of Nest Protects. The listener can’t tell the difference between a test and a real alarm so you’ll have to put it into test mode whenever you want to test your smoke alarms. I had to turn the automatic monthly sound check on the Protects off as it’s not possible to coordinate test times with the listener automatically.","isVerified":true,"ratingScore":4,"reviewReaction":"101 people found this helpful","country":"United States","date":1547510400000}
{"reviewTitle":"Read","reviewDescription":"I bought this product thinking it would tell me if something is burning but it doesn't.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1639958400000}
{"reviewTitle":"Just buy a real alarm instead of a listener.","reviewDescription":"Listener works as advertised but I would recommend simply buying the first alert z wave smoke and Co alarm. It will also pair with Ring and doesn't require two things mounted on your wall. Also, it's about the same price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1566864000000}
{"reviewTitle":"Excellent Idea","reviewDescription":"Excellent idea. I already had alarms and didn't want to purchase new ones,  so i got this instead. My alarm sounds for smoke and carbon monoxide,  and it detects the sound and notified Ring IMMEDIATELY.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Meh... Good but not necessary","reviewDescription":"Had a slightly difficult time connecting this to my fire alarm but it is now on successfully. Didn't really care about getting this in my kit but since I have it I'll use it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1571443200000}
{"reviewTitle":"Works as expected","reviewDescription":"I had issues trying to make it work, (sound test with my smoke alarm) that is the only reason for the 4 starts, the product itself is solid and works fine, once tested.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1560643200000}
{"reviewTitle":"Great idea","reviewDescription":"I did not need it. My home is new and already has this installed. I did not know","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1557446400000}
{"reviewTitle":"Great ALARM system!!","reviewDescription":"The ring ALARM system is very good and well worth the money!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581552000000}
{"reviewTitle":"Very impressed","reviewDescription":"Alright this thing would’ve saved my house if it had been a real alarm. My smoke detector went off in the kitchen when I was cooking and it immediately set off the Ring listener. Within a few seconds, Ring support called me to confirm a real emergency or not.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1606608000000}
{"reviewTitle":"Added to monitored system...Great response time","reviewDescription":"Added this to my monitored system in February 2019. When I recently changed out the smoke detector I forgot to disable the listener. I tested the new detector which within seconds set off the ring system...less than a minute later I got a call from RING to make sure everything was ok. I'm very satisfied with this device and especially with the monitoring service and would recommend it to everyone with the Ring system.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1555891200000}
{"reviewTitle":"It definitely works","reviewDescription":"My brother burned bacon and the alarm started going off and it was so loud we didn’t hear when ring was calling to make sure we were ok. I thought I deactivated the alarm on time but 5-7 minutes later the firefighters showed up. This definitely worked so just be careful.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1603152000000}
{"reviewTitle":"Alarm listener works great","reviewDescription":"Another great product from the Ring team. This device is installed inches next to one of your smoke\/CO detectors inside your house. Our detectors are hard wired, so if one goes off they all go off. Upon testing this device will activate when the smoke detector is activated alerting the monitoring company of the fire. This is a must to add fire detection to your ring security system.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1560643200000}
{"reviewTitle":"Works well","reviewDescription":"A+++","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Small and easy to install sensor","reviewDescription":"Turns your smoke alarm into a smart a sensor. It’s half the size of my First Alert smoke detector and very easy to install. It detected the alarm going off quickly when testing. I’m very happy with it and don’t feel the need to spend a lot more on a direct wire system that is Ring controllable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Ring is awesome!!!!!!","reviewDescription":"Update!!!! Ring's customer service is incredible.  Sent me a replacement after my first review.  The new one seems to be working great.  Thanks Ring.  It's nice to know that they stand behind their products.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1604966400000}
{"reviewTitle":"You only need 1 if your smoke detectors are connected","reviewDescription":"The detector works great.  I was able to get the notification through the app when I tested the alarm.  If your smoke detectors are connected (meaning when one goes off, they all go off), you only need to put this next to one of them.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1594684800000}
{"reviewTitle":"Only one to consider","reviewDescription":"Very easy to set up. Had the whole system running in less than an hour. One sensor wasn’t communicating but a quick call to ring and I’m am 100% percent. Easy controls for the user and can customize with minimal effort. Monitoring costs are the cheapest in the industry so one more reason to buy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1577059200000}
{"reviewTitle":"You'll be notified promptly, and loudly!","reviewDescription":"I accidentally set the smoke alarm off by cooking, err, burning some food on the stove and WOWZERS. This thing will sound off like nobody's business, I'm talking alerts directly to your cell phone and the whole nine yards. We're already users and fans of Ring alarm and camera components, so this was a no brainer.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1572998400000}
{"reviewTitle":"not useful","reviewDescription":"its just a listener","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1555977600000}
{"reviewTitle":"Restrictive","reviewDescription":"One of the biggest issue is not giving customers ability to control the fire alarm. Its pretty common to have false alarms when cooking. Trradtionally i used to open my windows and stop the alarm. Ring gives you only 30 seconds to get your act together. If you are unable to stop thr alarm. Emergency gets disptaces.If ring would have given option to control peofessional monitoring for smoke it woudl have been awesome. For now, this is lot to ask!","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"It won’t listen to your alarms in entire house, it only listens to one or two nearby alarms","reviewDescription":"If you think this listener will listen smoke\/CO alarms of your entire house like I did, you are totally wrong. In the installation instruction, it asks you to place it 3 to 6 inch near your existing smoke\/CO detector, and it asks you to point the listener (several holes on the listener) towards your existing alarm. Obviously it won’t listen to far away alarms in other rooms. Then I thought alright it at least would listen to both my smoke and CO detector in the hallway which are not far away from each other. I was wrong again. When testing, it only respond to the nearest smoke alarm but won’t respond to a nearby CO alarm. So I end up with moving the CO alarm close to the listener until the listener can respond. So I end up with placing three devices on the wall — my existing smoke alarm, existing CO alarm, and the listener. I would rather buy the First Alert z-wave smoke and CO detector instead, which will detector smoke and CO as well as send signals to ring base station. And it will be only one device on the wall - nice and simple. I will return the listener if it’s not a part of the ring home security bundle.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1564012800000}
{"reviewTitle":"Not a great Ring product.","reviewDescription":"I purchased a Ring Alarm system during 2020\/Dec, and was therefore more of less forced to buy this sensor add fire detection monitoring.  Getting the Ring app to detect this zwave device was pretty difficult, however, just like the Ring Flood\/Freeze Sensor.My biggest issue was that I was unaware that this device must be mounted extremely close to my fire alarm (six inches!).  I find that extremely surprising, because my $25 Wyze Cam 2 cameras can both detect the fire alarm siren and they are both far away from my fire alarms.  So what about my $ 60 Ring Indoor camera?  It can't detect fire alarm sirens.During the initial siren test, I had to hold my Ring Smoke\/CO2 sensor adjacent to my fire alarm in order for the sensor to \"hear\" the siren.  Because of that, I'd say this sensor certainly needs an upgrade.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611878400000}
{"reviewTitle":"If your smoke alarm goes off, the monitoring center will be notified even your alarm is disarmed","reviewDescription":"Easy to install and reasonable price. No option for user to choose to monitor or not as other sensors. If your smoke or CO alarm goes off, the listener will alert monitoring center no matter what mode your alarm is in. You cannot choose what mode to monitor or not like other sensors. Even you are home, disarm your alarm, and your smoke alarm goes off from your cooking, they will call you or dispath the police. This sounds like a big headache to me. Not sure why Ring does not allow users to customize this sensor like other sensors so they can choose to self monitor or alert the monitoring center.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1567382400000}
{"reviewTitle":"No configuration for preventing dispatch during false alarm","reviewDescription":"Before you purchase, please be aware that there is no option to not have this monitored ALL the time. This means any false alarm will dispatch fire to your house. Ring should allow the configuration of call verification before dispatching or allow the device alerts to be suppressed temporarily from the app. We have a smoke detector in the kitchen (which is not ideal but it is hard wired this way) which goes off from time to time. I don't want the fire department showing up whenever something gets burned a bit in the oven.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1564617600000}
{"reviewTitle":"Expensive","reviewDescription":"These have to be mounted close to each your existing decetors to work. I bought one thinking I could mount it in a central location in the home and it would alert if any one of my smoke detectors went off. Couldn't justify the cost. Returned this and ordered a wireless z wave that worked great. I have a ring system and love it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1576886400000}
{"reviewTitle":"You need a Ring Alarm base station to use this","reviewDescription":"I didn't realize you need a Ring Alarm Base Station to use this. No thank you, I'm not invested in the Ring ecosystem.Will find another solution, like Wyze","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Ring Listener","reviewDescription":"Not easy to install.  Took second level to get it to work....Installed two listeners both an issue to get working.  Took more that one person to get it to work.  Instruction not clear to install.  Take support to get them to install.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1555372800000}
{"reviewTitle":"Products is good, App sucks!","reviewDescription":"Ring has nice products, too bad the App sucks so bad (keeps crashing, impossible to check past events without it crashing, etc.)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Doesn’t work as expected","reviewDescription":"Installed as instructed, tested and worked. But, among about 10 alarms, this listener only ring 4 times. Not trustable and not worth the cost.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1583539200000}
{"reviewTitle":"Battery issues","reviewDescription":"Seems to work fine - but I am now receiving a low battery notice...  It was installed less than two months ago.  Not good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1575331200000}
{"reviewTitle":"Battery Life Not Good","reviewDescription":"It worked great, but after 30 days the 3V battery went dead! That’s a $10 3 year battery! They sent me a new battery but 2 months later the battery is dead again!","isVerified":true,"ratingScore":2,"reviewReaction":"44 people found this helpful","country":"United States","date":1550880000000}
{"reviewTitle":"Quality issues, don’t buy Nest","reviewDescription":"1\/2 the fire listeners don’t even work, they won’t connect, waste of money. Do not use nest. Shi*t manufacturing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1571529600000}
{"reviewTitle":"Not very convenient","reviewDescription":"Has to be mounted close to 2 to 3 inches from the alarm.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1583280000000}
{"reviewTitle":"Good so far, battery lasted 3 days","reviewDescription":"Setup was simple and seems to work fine.  Battery lasted three days after the strip was removed during installation.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1557446400000}
{"reviewTitle":"Install this if you want Fire Department Called Even if you Press Test","reviewDescription":"This thing says in the ad when I bought it and still says it today, that it does not detect anything. It does not detect fire, smoke, or CO. Therefore, all it does is listens to your in home detectors and has no way of knowing anything about the particular issue itself. Here is what happened with me...My in home detectors aggravated the heck out of me with the dreaded low battery chirp. So I go buy a 9volt, get on the ladder and change it. While I am there, I decided let me test my detectors. Forgetting to put that ring listener in test mode. 5 seconds later, Ring alarm is alarming, 5 seconds later I cancel via the app, 5 seconds later, the monitoring people call me and ask if everything is ok. I say yes, i was just testing and forgot to put it in test mode. They then say well we will send the fire department no matter what. I am like why, they said because its CO alert. I said no its not, because i was just testing and a listener doesnt detect anything. They said oh well we are sending them anyway because that's our policy and no matter what you say that's what we are doing. And they did, the fire department was at my door within 3 minutes. All great responses if it was an actual emergency. The said part is Ring is basically randomly deciding to flag everything at CO level even when the device doesnt know the difference and then they do not allow you to cancel that type of alarm and will send the fire department no matter what you say. This device fraudulently flags things as CO when it doesnt know the difference. I want my money back!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"60 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"SKIP INSTALLING THE LISTENER","reviewDescription":"We live in a rural area with a volunteer fire department. If the fire alarm goes off, the \"listener\" picks it up and trips the alarm, causing the monitoring company to automatically call the fire department and dispatch them. The volunteer fire department is not free. If they are dispatched it is an automatic $800.00, fire or not. It was about 10:00 p.m. inthe evening, we were home. The fire alarm beeped.....a warning that the battery needed replacing. The \"listener\" heard that, tripped the alarm, and instantly the monitoring company dispatched the fire department. In the meanwhile we frantically disarmed the system and called the monitoring company to cancel the alarm. The lady REFUSED to cancel the alarm! We BEGGED her, PLEADED with her, explaining repeatedly that the alarm was just a battery notification. She absolutely refused to cancel the alarm and HUNG UP ON US! What? HUNG UP? The fire department showed up. We apologized and sent them back home to their families. We paid the $800.00 bill when it came a week later. We threw the \"listener\" in the garbage. Now our system has no fire alarm except the generic ones on the walls that are useless unless we are home. I imagine the same thing would happen with alarms connected to the house electricity if the electric was interrupted. We notified Ring by email and phone message to tell them of the glitch in the \"listener\" and the stupidity and rudeness of the lady at the monitoring company. No one returned either communication.  Way to go RING.","isVerified":true,"ratingScore":1,"reviewReaction":"549 people found this helpful","country":"United States","date":1564531200000}
{"reviewTitle":"Doesn't work with all smoke detectors","reviewDescription":"I bought this Ring detector along with X-Sense smoke\/CO detectors from Amazon. Obviously, the X-Sense are brand new and recent vintage. I spent over an hour on the phone with a Ring representative trying to get it to test OK on my cell phone, and they finally gave up and shipped me a new one. The same thing happened with the second one. Finally, the second Ring representative I talked with said that unless the smoke alarm emits a certain type of signal, it is not compatible with the Ring sensor, and probably the X-Sense are not compatible. The representative said there is something on the Ring website about this, but all the Amazon website (where I bought it from) says is that this is compatible with \"an existing smoke and\/or carbon monoxide detector 10 years old or less that complies with all applicable standards\". I purchased the smoke detector brand new from Amazon and it is apparently not compatible with this Ring sensor. This is frustrating as I spend over two hours trying to get this to work, and the first Ring representative I talked with did not know about the incompatibility.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Completely useless","reviewDescription":"Shame on me, I didn’t realize this wasn’t a smoke detector but rather a detector listener (meaning it needs a separate non Ring device to detect smoke first). That said, when I bought actual smoke detectors, this device, which is supposed to “listen” for the alarms, could not hear when the detector when off! Meanwhile my neighbors can hear these smoke detection alarms.We have a number of Ring devices we’re generally pleased with. This one has the limited functionality of listening to real detectors, and it cannot even do that! Avoid.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"**** USELESS PRODUCT ****","reviewDescription":"Don't buy this sensor unless you fully understand the requirements.  At the time, the Amazon smartphone app failed to mention you need the Ring Alarm Kit for another $200 in order for this to work.  You simply cannot add it as another sensor to your Ring subscription (like I have done so with numerous cameras).  Now that the return window has passed, I'm stuck with the sensor and wasted money.  Spending over 45 minutes with Amazon Chat attempting a return was a complete waste of time.  It's too bad you can't select a zero star review.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Stressful","reviewDescription":"This smoke alarm listener does what it is intended to do - it listens for your smoke alarm and alarms the Ring system.  The problem is that there is no time to then disarm the alarm to prevent the fire department from being dispatched.  In the middle of cooking (and perhaps lightly charring something on the stove, the air fryer or in the oven) my extremely sensitive fire alarms start going off, the Ring system starts alarming and then my phone rings - all at the same time.  I attempt to use the Ring app to disarm the alarm but so far it has never worked.  I have to step outside to speak with the Ring dispatcher while it is absolute chaos in my house.  (Luckily I have been able to find my phone each time but one of these days my phone may be in another room.)  I guess this is the way that it is supposed to work if your home is really on fire but...I set my very sensitive fire alarms off at least once or twice a month.  Anyway, the process is very stressful so we are uninstalling the listener for now unless Ring updates the system to allow for a self-monitoring option.  We would like the ability to have at least 5 minutes to disarm the system before the Ring monitoring center dispatches the fire department.  That is an option that could be easily added to this system.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1619308800000}
{"reviewTitle":"Couldn’t get past testing","reviewDescription":"Despite detecting the signal chirp from my smoke detector (as in the device turns red during testing), the ring app states that the listener isn’t detecting a signal, and will not finish setup. The testing is stressing my dogs out, so I’m exchanging this for a bonafide ring smoke detector, since it looks like I need a specific kind of smoke detector with this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"False alarm, do not buy","reviewDescription":"Caused a false alarm.  Fire dept showed up (Thank you guys and very sorry for the trouble!) and a relative was inconvenienced by having to go to my house since I was away that night.NO RESPOSNSE AT ALL FROM RING after several attempts to get a rebate\/redund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Don't Buy Ring!","reviewDescription":"There is a known issue where the devices show \"tampered\" non-stop. I'm talking 100 notifications in 10 minutes. I purchased 2 months ago but was a little late in setting it up. Amazon is refusing a replacement because it's outside the return window. There's no support for damaged products and they wanted to offer me a one time exception of a return while paying a restocking fee?? for a product that doesn't work? Why would they go and restock that?I paid over 1k on my full system and they can't be bothered to replace a $60 piece.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Waste of money","reviewDescription":"I take some of the blame because I bought these assuming they were regular smoke and carbon monoxide detectors without reading the fine print. That being said, it says smoke alarm and carbon monoxide detector by ring. I thought it would be a nice addition to the ring family of products in my house. I just started installing them after purchasing them in October and realize that they just listen to the smoke alarms. You already have in your house! You can buy something that connects to your ring system for the same price. I don’t want to stupid devices in my house next to each other. I guess I’m stuck with these.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"A good product but a serious problem","reviewDescription":"A good idea to interface ring to an existing smoke alarm system, easy to install and use. But if there is a problem with this unit, so that it reports alarms that never happened, the fire department will be called. And this device cannot be disabled remotely, even if it is known to be defective and generating regular false reports.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"Unistalled for false alrms on monitored Ring","reviewDescription":"Installed easily, added easily, but my smoke detector had a low battery (changed yearly) it chirped and the monitored system activated the Fire department with no ability to stop it.The friendly staff did call and let me know, but I can't have false alarms. If there was a way to be certain it would not cause false alarms, I would use it. Some form of verification that it is indeed a true alarm.Until then I have purchased Nest Protects, disabled this detector and will active the alarm myself if needed, doesn't help for CO if I were unconscious, but smoke alarms chirp, they always have, and they always will.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1571011200000}
{"reviewTitle":"CONTINUAL OFF LINE WARNING!","reviewDescription":"WE HAVE THE COMPLETE RING SYSTEM WITH WINDOWS, MOTION AND SMOKE DETECTORS PLUS A PRO DOOR BELL.  AT FIRST I THOUGHT I HAD HIT THE MOTHER LOAD IT WORKED VERY WELL.  THEN THREE OR FOUR MONTHS IN I STARTED GETTING NOTICES THAT THIS ONE OR THAT ONE WAS OFF LINE.  WE HAVE TWO HOMES AND SO IT WAS CONCERNING TO HAVE ONE OFF LINE ALMOST EVERY DAY.  WE WOULD UP BY PASSING ON OCCASIONS.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1581206400000}
{"reviewTitle":"Maybe this is a good product","reviewDescription":"I hope I never have to find out if this product will work as advertised, but the install was not as easy as I thought. It is directional and the testing is temperamental. I continue to have \"tamper\" status because I had to open and reset several times to get the device to setup normally.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630454400000}
{"reviewTitle":"This in not a fire alarm. You have to buy that separately.","reviewDescription":"This only listens to your fire alarm, as you must purchase a fire alarm separately. It listens great, but its an additional charge on top of the purchase of a fire alarm, so its value seems a bit low. It really should be a lot cheaper or cost a bit more and have a built in fire alarm.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1570233600000}
{"reviewTitle":"Needs security system base station","reviewDescription":"Not clear when I bought it that this requires the rest of the security system. I installed Device on ceiling... and spent about 2 hours trying to debug.I looked online for support and found this requires security system- now to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584662400000}
{"reviewTitle":"Needs a better design.","reviewDescription":"There is no reason at all these can’t listen for multiple smoke alarms. Instead Ring has them configured to hear only the one that it’s sitting right next to (6”), thus you have to buy one for literally every detector in your house.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1583798400000}
{"reviewTitle":"Skip it, not worth it","reviewDescription":"This device cannot pick up SPOKEN\/VERBAL CO and fire alarms. Other customers who report that once this alarm is triggered, it automatically causes a fire dispatch that you can't cancel which results in large fines and makes this a very risky install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576800000000}
{"reviewTitle":"Not useful u need system hub","reviewDescription":"Does not work without ring hub","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"this is not the actual sensor but just a data cop","reviewDescription":"need to get the sensor that works with Z wave","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627948800000}
{"reviewTitle":"Missing one smoke detector","reviewDescription":"Receiving 4 PC's of  smok detector not 5 as requested","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1569024000000}
{"reviewTitle":"Easy setup","reviewDescription":"Works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Must have Smoke\/CO detector","reviewDescription":"Easy to install. FYI you must have a smoke\/co detector for it to be useful.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1568937600000}
{"reviewTitle":"Smoke Alarm Sound Listener that effectively augments your Ring Alarm System with Smoke Detection","reviewDescription":"The Ring Alarm System Sensor Smoke and Carbon Monoxide listener works effectively as a device that listens to the audible alarms from a smoke detector that is within 6 inches of the device.  I have tested it with a Nest Protect smoke alarm mounted 3 inches away from this device and it functioned correctly.  The setup was not as easy as I thought it would be since placement is critical for the listener to detect your smoke alarm sounds.  I used double sided tape to mount it on clean wiped down area versus included mounting screws.  Need to be at least 3 inches from the Nest Protect and no closer and not much farther away.  I held listener on ceiling before mounting at less than 3 inches and it did not detect the smoke alarm sounding which was odd.  The sound from a Nest Protect is loud.  Once it detected smoke alarm I marked location and installed it.  You know it is detecting each sound from your smoke alarm when a red ring is displayed on the listener.  Quite expensive for what it is but works and enables professional monitoring service to monitor smoke and carbon monoxide detection in your home.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605398400000}
{"reviewTitle":"So easy to install","reviewDescription":"Easy to install but not very easy to setup. Took a good hour to finally link it to my wifi. had to reset the device 5 times before it connected. Other than that works pretty well. Already had the fire department called twice. ( baking cookies on parchment paper. )","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"adds smoke detectors to ring monitoring","reviewDescription":"Our insurance company wanted to know if our smoke detectors were remotely monitored...answer, no. But with this, it's easy to add it to our remotely monitored Ring security system. Insurance company is now happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1661731200000}
{"reviewTitle":"Easy install","reviewDescription":"Set was quick, tested it, works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Super easy item to install!","reviewDescription":"Super easy to install and to configure...highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1683849600000}
{"reviewTitle":"Added Peace of Mind","reviewDescription":"Exactly what we needed to add to my grandma’s Ring system for our peace of mind. She lives alone, and now, if her smoke alarms go off we can receive a notification and check in on her and\/or take necessary action. It helps us feel a little more secure and helps her stay her in her home safely for a little longer. Thanks, Ring!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1624492800000}
{"reviewTitle":"Works great","reviewDescription":"Easy to install works as described","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1688688000000}
{"reviewTitle":"This is NOT a smoke or CO detector!!!!!!","reviewDescription":"This is NOT a smoke or CO detector!!!!!! I’m seeing a lot of reviews from people that are disappointed that they thought that they were ordering a detector and did not read the product description before purchasing. It works with the Ring home security system and alerts Ring (and possibly your local police and\/or fire department, depending on where you live) if one of your detectors has gone off in your home. That way the proper authorities are informed if you’re not home.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Works as advertised","reviewDescription":"I paired this with a wireless, Interconnected smoke \/ CO alarm system for a fraction of the ring stand alone combo detectors. No issues. Works as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"Easy installation","reviewDescription":"Nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Works perfectly for the ring system","reviewDescription":"Works perfectly.  Make sure you read the instructions for installing it. It is not a smoke or CO detector.  It listens for the sound of your smoke detector when it goes off, then alerts your ring system. Very easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1625875200000}
{"reviewTitle":"Easy to use","reviewDescription":"Easy to mount on the ceiling and test. This is a great way to keep piece of mind about any possibility of a fire while away from home.Was somewhat disappointed that within one hour of installation it signaled that the battery was almost dead. It had the paper strip in it that I pulled out, but apparently the battery was losing power or not good before I received it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1564876800000}
{"reviewTitle":"If you cook do not buy","reviewDescription":"No option to put the listener in pause mode while cooking. Had more than a few calls, interrupted cooking, for false cooking alarms on smoke detectors. DO NOT BUY IF YOU COOK and your smoke detector has gone off. I have complained to Ring. Need an app pause button for listeners. Otherwise the benefits are not worth the hassle. Do not buy. I will need to deinstall mine, the only viable option, bummer.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1640736000000}
{"reviewTitle":"False alarm","reviewDescription":"If you enjoy getting woken up at 2 am for a false alarm this is the product for you. I am not talking about a false alarm in which my smoke detector actually went off inappropriately and my ring listener set off the alarm appropriately — I am talking about a situation in which my smoke alarm did NOT go off and yet my ring listener still set off the alarm.I have removed the listener and won’t be using it again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1629763200000}
{"reviewTitle":"Does not work with all smoke detectors!  Few older or hardwired ones!","reviewDescription":"Only after buying this, installing, and testing multiple times, with my super loud hardwired smoke detection system, did I see the very fine print that this only works on certain sounds from detectors. So chances are if you have a cheap alarm that chirps it might work. You also must install within 5” of the alarm, which seems odd. If it’s so loud why doesn’t it work from 1’ away or more???","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1655510400000}
{"reviewTitle":"They don’t pear up to the base Station","reviewDescription":"Can’t get them to pair up to the base station even with tech-support on the phone. Musta wasted at least two hours on these things not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Headache","reviewDescription":"The idea of it is great! If you can figure out how to get Ring to recognize it. I can't find any mention of it other than to how to buy it on Amazon. Scanning it repeatedly didn't make Ring acknowledge it. I tried to get information from the Ring community, seems others are having the same or similar issues.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1629417600000}
{"reviewTitle":"False alarmed in middle of the night, triggering fire department.  Mine is junk.","reviewDescription":"I would not recommend.  Went off about a month after install in the middle of the night for no reason.  Didn’t answer my phone in time and Ring monitoring called the fire department.  Met them in my underwear to tell them it was a false alarm.  Ended up removing from my Ring system and removing the battery.  Maybe a quality control issue, but mine is junk.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1622592000000}
{"reviewTitle":"This is a bad design","reviewDescription":"The ring co\/smoke listening device is not a stellar design. Not even a \"one stellar.\" Battery life is very poor - I was prompted to write a review after my 6th battery in less than 2 years.  Other ring devices are still operating on the initial battery.  Plus, a chirp out of your smoke detector can set it off, and good luck trying to restore it to normal.  Ring should redesign this POS, and replace all existing units.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1627776000000}
{"reviewTitle":"Doesn't work properly","reviewDescription":"As others have mentioned, it doesn't recognize my smoke detector sound (even though the light on the sensor lights up red). I'm using it in a recently bought condo with what appears to be brand new detectors. It does recognize my CO detector on the first try, however. It also costs about the same as the First Alert combination CO\/Smoke detector that has Z-wave built in. It also only has a 30 day return window, so that's money down the drain in my case.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1585872000000}
{"reviewTitle":"Do not buy. Is is listening? Mine doesn't.","reviewDescription":"Ok, so after having this \"listening\" for the last 4 months I realized it doesnt work. Im very frustrated that it is 1 inch from my smoke detector in a 7 year old house, and it doesn't work at all. Wow. Cool, not really, at all. I put my trust in the hands of this unit, and that was a bad idea. All in all, not really liking anything about this security system. I would not recommend, nor have I since owing it.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1585008000000}
{"reviewTitle":"Can’t use without ring alarm system","reviewDescription":"I was super excited about this product, but disappointed to find out I didn’t read the details enough to realize I have to also have a ring security system in order to use this device. No wonder it seemed like such a good price! I wasn’t interested in purchasing a security system too so I just returned the product","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1627257600000}
{"reviewTitle":"Missing info","reviewDescription":"Does not tell you, you have to already have the ring security system for this to work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Does not work with X-Sense smoke alarms!","reviewDescription":"Worked with Ring tech support to install this device. It was the second try. Ring has confirmed the sound pattern of these alarms are not compatible with the ring listener. There is no fix for now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Works well while battery lasts","reviewDescription":"The device looks good and works well and it was easy to do initial setup. However, less than one month after setup the device went offline without any warning or message about why. Give that the device wasn’t responding, I guessed the battery was depleted. Replaced the battery and basically had to setup all over again, for some reason. Another month has passed, the device is offline again and not responding. It seems to consume one battery per month and gives no warning of low battery level. Very disappointing…","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1638489600000}
{"reviewTitle":"MUST HAVE RING BASE STATION - Will not work with APP","reviewDescription":"This product will NOT work through the app, you must have the ring base station to get this work. That is total BS since all the other cameras and doorbells work thru the app!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"RING SECURITY BASE REQUIRED","reviewDescription":"Listing does not specify that you need to purchase a ring home base in order to use this product. So you must buy into their whole ecosystem if you just want to use this listener.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Only works with certain smoke detectors","reviewDescription":"Like all ring security devices, they don’t tell you that it is incompatible with many smoke detectors until you’ve already screwed it into the wall and then need to call them because it won’t connect.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"not a smoke detector or carbon dioxide detector","reviewDescription":"Had no idea this was not a smoke detector or carbon dioxide detector. Kind of dumb to have something titled smoke\/carbon dioxide listener. Just make a smoke detector shaking my head. I’m outside of the return window, so can’t even return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Another potential faulty component","reviewDescription":"Instead of integrating the smoke or carbon monoxide sensor directly as a component into the system, Ring, instead offers this listening device that has the potential to stop working and not detect the CO alarm.  Ring system does not work reliably.  There are better, safer options!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1668124800000}
{"reviewTitle":"Can’t get this to work, at all.","reviewDescription":"I’ve been through The instructions dozens of times. I have it installed right next to a carbon monoxide alarm and I can get this monitor hooked up to my alarm system I get it in test mode and it never hears the carbon monoxide alarm even though I am going deaf now because of all the testing! One day I’ll have to reach out to Ring Support but this is ridiculous. I also cannot send it back because I am outside of the window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1630281600000}
{"reviewTitle":"U need a $300 base station","reviewDescription":"It would be nice if they told you right there with the main info but I’m sure it’s five star with the base","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"It is NOT a smoke detector!","reviewDescription":"I sent mine back once I realized what I had.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Useless piece of plastic","reviewDescription":"Unbelievable.If you buy this. You’re just buying a useless piece of plastic.I called them after spending 30 minutes trying set it up on the app. And I was informed what I bought was useless and couldn’t be connected to the app unless I buy a base station from them.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1605657600000}
{"reviewTitle":"Piece of crap","reviewDescription":"If this gets triggered, you can’t cancel the alarm. So any time you test your system, get a false fire alarm on a detector, etc.So buy this if you enjoy explaining false alarms to fire crews with full lights and sirens ready to bust down on your front door.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1633392000000}
{"reviewTitle":"Poor battery life","reviewDescription":"Smoke detector consumes battery a lot. I have replaced battery thrice within 3 months. In the end I had to purchase a rechargeable battery which gets depleted within two weeks. I cannot rely it to be working if I go out on a vacation.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"The battery dies and three weeks","reviewDescription":"Easy to install nothing to it but you have to replace the battery every three weeks not good not happy with us at all went through eight batteries in A month and a half","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650758400000}
{"reviewTitle":"have to have ring alarm system for this to work","reviewDescription":"you have to have a Ring alarm system if you want to be able to set this up. If you just have a camera\/security system this product is useless. you have to spend a bunch more money and buy the alarm system too.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1638144000000}
{"reviewTitle":"Home Assistant does not support it","reviewDescription":"Home Assistant does not support it, even though it uses the z-wave protocol.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683849600000}
{"reviewTitle":"Just doesn't work","reviewDescription":"This device was fairly simple to install but it fails to detect the smoke or CO2 detector alarm.  This unit has been tested at least 6 times and nothing.  I am really starting to question the quality of Ring security products. Unfortunately the return window at Amazon is already closed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1583193600000}
{"reviewTitle":"Horrible","reviewDescription":"Not at all what I wanted it for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"Would not detect alarm","reviewDescription":"Purchased three of these with Ring system.  Could not get any of them to work with any of my alarms -- some old, some new.  Two were within the return period so I returned them but having to eat one.  Purchased two alarms which connect directly into Ring system.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1567641600000}
{"reviewTitle":"Great","reviewDescription":"All good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1665360000000}
{"reviewTitle":"Seems to work great.","reviewDescription":"I did not use the one I got because I rather have a full operating alarm rather than a \"listener\" but from what I can see before I returned it is that it's a great little;e device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1586736000000}
{"reviewTitle":"Amazing!","reviewDescription":"Love it! very easy to setup and install!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1650585600000}
{"reviewTitle":"Successfully detected a smoke alarm sounding about two meters away","reviewDescription":"I misunderstood how this works. I incorrectly believed that it listens for alarms in a general area but in fact it is only listening to a single detector that is positioned within inches of the listener.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1577750400000}
{"reviewTitle":"Easy way to upgrade your dumb detectors","reviewDescription":"Easy install and set up. Saved me lots of money not having to replace all the smoke detectors with smart WiFi capable detectors.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1627171200000}
{"reviewTitle":"Works as intended","reviewDescription":"The product is great and works as intended. I didn't see where it said that this wasn't really an alarm though. It's just a listener that listens for your already installed alarms.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1589241600000}
{"reviewTitle":"Great addition","reviewDescription":"Added this to an existing smoke, fire and Co system to listen in the event of a fire. Although skepticle about how it would work, upon adding it to the system, I tested this devise several times. It work perfectly every time.","isVerified":true,"ratingScore":5,"reviewReaction":"22 people found this helpful","country":"United States","date":1552089600000}
{"reviewTitle":"Does the job","reviewDescription":"Not sure why ring uses a listener instead of a whole detector but it works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1628899200000}
{"reviewTitle":"Works with Nest","reviewDescription":"This item was added to work along side my Nest Fire Alarm. Works as intended and triggers an alert when my fire alarm goes off.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1604275200000}
{"reviewTitle":"Ring smoke detector","reviewDescription":"Easy install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"I should have thought these over a bit more- new wireless detectors make more sense than these.","reviewDescription":"I admit, I didn't read the specs before buying this and after installing it- I think the money would be better spent on just buying new smoke alarms that interface directly with my Ring alarm. My fault for not understanding that each of these have to mount just inches from existing smoke alarms to listen... I assumed one of these could cover at least a couple rooms- but nope, it mounts just inches from the alarm. My experience with \"listeners\" for alarms in the past was much different and they were able to pick up smoke alarms or glass breakage from up to 20 feet away.If you have NICE smoke alarms- these make sense, but networked smoke alarms aren't much more than these, and a newer smoke alarm is usually never a bad idea. We'll be switching to all wireless networked alarms, which is a significant task in a house that has a dozen smoke and CO detectors.I assume it works because it passed the test at installation, but honestly I hope we never actually NEED it.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1570406400000}
{"reviewTitle":"Do you have Nest Protect smoke alarms? Here's a tip to get it set up...","reviewDescription":"Here's a tip if you have Nest Protects. When setting up the listener, go to one of your other Protects to start the test rather than the one next to the listener. It will do its talking and countdown there before sounding the alarm on all of them, including the one with the listener next to it. This helps you get a clean, uninterrupted smoke alarm sound at the listener. No talking or countdown.The app must report it successfully learned the sounds.Anything that the app or Ring customer service tells you supersedes this review. This is how I did it but I can't guarantee it will work for you. Use the app to walk you through it.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1653091200000}
{"reviewTitle":"Finally connected to new Kidde alarm","reviewDescription":"A frustrating time ... Linked fine to base station but wouldn't complete test: ignored the alarm blaring 4 inches away. However, Colin tech support clarified that you merely TAP the test button on the listener, don't hold it down. CLARIFY THE SETUP INSTRUCTIONS PLEASE RING. Tap lights the listeners blue ring AND microphone. Then push test on the alarm nearby and after the first set of 3 or 4 chirps, the listener will pulse red at each of the next set. I found prompts much easier to follow on the laptop vs phone app. Now working well. -1 star for ambiguous doc.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1647388800000}
{"reviewTitle":"Ring is great","reviewDescription":"Don’t like the fact that with this you need an entire network of Ring products.  I thought it can work independently of that.  I like the idea to be alerted if a distance alarm goes off so I’ll look for another brand if available","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1678924800000}
{"reviewTitle":"Buyer beward: By design, this does not detect smoke or CO2!","reviewDescription":"I missed it in the description so I want to add a review to be very clear: These devices do not detect smoke or CO2 at all. They  listen for the beep of your existing smoke alarm and that is it. By itself, this device does nothing. Without a working smoke alarm you can't even set up the device.I suggest buying a zwave compatible smoke\/co2 alarm instead of this device. It is cheaper, and far more reliable than this  device.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639785600000}
{"reviewTitle":"NOTE: Smoke \/ CO2 detecter required","reviewDescription":"Bought this without looking into detail that it works next to a smoke or CO2 detector next to it. Which is kinda thinking about how much you pay for it just to listen. Good thing i had an existing detector. It does work properly and ring alerts you and the fire department (if you have paid subscription $100 per year)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631664000000}
{"reviewTitle":"Can't use with business","reviewDescription":"Disclaimer on the box you can't use for your business smoke detector. I find that strange. Will use in my home, but bought for shop.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1667692800000}
{"reviewTitle":"Works As Expected But Install Wasn't Smooth","reviewDescription":"I installed the listener within 6\" of my smoke detector (see photo) as directed.  It took about 15 minutes and multiple tries to have the unit \"listen\" to my alarm before it was finally successful and completed installation in the Ring app.  I bought two of these units.  The second one is installed next to an older smoke detector that buzzes rather than beeps or has a siren.  The Ring unit did not recognize the buzzer, so I'll need to replace the smoke detector.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576022400000}
{"reviewTitle":"Awesome idea, but battery life is NOT GREAT","reviewDescription":"I was really excited to get this because I'm always scared to loose my house due to a fire. Unfortunately the battery life is SHORT!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1657756800000}
{"reviewTitle":"Works okay, but the same price as a new alarm","reviewDescription":"Works okay, easy to set up, but the price for a new z-wave Ring compatible alarm is the same as the \"listener\". I'll use this for several hardwired alarms I have, but I'll transition my old battery alarms to the Ring compatible alarm, which was very easy to set up also.Thank being said, I like the whole Ring system and give it 5 stars. Hopefully Ring keeps adding compatible devices. I would especially like a key fob alarm disabler like t=some other brands have,","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1557532800000}
{"reviewTitle":"Works great","reviewDescription":"Very happy with purchase worked well with existing smoke alarm","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"Defective after 3-months, but service is amazing","reviewDescription":"Stopped listening, new smoke alarm installed as part of troubleshooting, new battery, factory reset, not able to communicate.Update 8\/5\/22: after a phone call with Melissa, Executive Customer Support - Ring,  I am again a happy Ring customer. We worked through the issues to a satisfactory outcome.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1659225600000}
{"reviewTitle":"Works great after I figure it out with really terrific tech support.","reviewDescription":"I initially had difficult time with the install.  I finally gave in and called tech support and they were awesome to work with.  They walked me through the install until the install was done.  Really cannot say enough good things about Ring tech support.  The included instructions could maybe use some tuning up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1646611200000}
{"reviewTitle":"Sensible, Easy Integration with Existing Smoke\/CO Alarms","reviewDescription":"This product is a great example of how the Ring Alarm System provides a very inexpensive device whose purpose is to \"listen\" for  one of your existing Smoke\/CO alarms to go off, and automatically signals the professional monitoring center to dispatch the Fire Department.  It installed very easily and worked flawlessly in the post-install test step.  How nice that my sizable investment in brand new FireX Smoke\/CO Alarms was simply enhanced by the smooth integration into the Ring Alarm System.  I would highly recommend this product!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1601337600000}
{"reviewTitle":"Listener not a smoke sensor.","reviewDescription":"Listener device listening for your existing smoke and Co devices in you home.Basically you teach sensor when your existing sensors alarming and then ring sensor send you alarm.Actually I was surprised when realize that ))) but so far I have my other old smoke sensors it works anyway for me.But if you don't have smoke and co sensorsThen you have to buy them first to able receive notification. Waiste of money for new house( must be all in one).","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"does exactly what it should do","reviewDescription":"mount it right next to your existing smoke \/ CO detector and set it up using the app.  easy to use and mount, just follow the directions on spacing.  highly recommend instead of getting expensive connected smoke\/CO all throughout your home.  peace of mind knowing if an alarm goes off I can get the alert on my phone.  10\/10 would highly recommend this and the entire ring security system, ease of use is second to none and their support is good as well.  thanks ring, looking forward to installing some cameras soon.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1562544000000}
{"reviewTitle":"Great Product...Fantastic Tech Support","reviewDescription":"I bought two of these to use with my existing smoke detectors. I had trouble setting these up with the Ring alarm. I was on the phone with Tech Support for a long time. It was worth it though. The developers had me email a video of how I was trying to set the listeners up. After they viewed the video, they got right back to me with instructions on how to set them up. I followed the instructions and the listeners set up immediately. Now I don’t have to install new fire detectors. Five stars for both the product and five stars for Ring Tech Support.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1548806400000}
{"reviewTitle":"Tested okay, seems to work.","reviewDescription":"Haven't had a real-time alarm but test seemed to work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"Works well!","reviewDescription":"Does exactly what I wanted it to do.  Easy setup and install.  I’m glad that I added it to my Ring Security system.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"just make sure your in place detectors are for fire and CO","reviewDescription":"These just listen.  You place them next to existing detectors.  The detector goes off, this thing alerts the ring alarm and it dials out to the central station.THEY DO NOT DETECT CO OR SMOKE, THEY JUST LISTEN.Having said that, they work great, are easy to install.But, do not buy these to detect a fire, you buy these to listen for your fire alarm.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1624233600000}
{"reviewTitle":"good if you have ring alarm system","reviewDescription":"good add on to my Ring home alarm system. one thing to keep in mind is that this device does not actually detect smoke or CO2, it is a LISTENER. Which means you have to install this Ring device right next to your actual home CO2 \/ smoke detector and if the alarm of your detector goes on, then your Ring CO2 listener will listen to the alarm and will alert you. Overall does the job that I want: letting me know if there is CO2\/smoke in my home while I am away.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1561852800000}
{"reviewTitle":"Can’t use for commercial","reviewDescription":"I bought an entire security system for my small business.  After everything was purchased and installed I was told that I can’t have this detector for a commercial property.  I sure wish I was told that prior to purchase! It’s not that big of a deal but a hassle.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1636156800000}
{"reviewTitle":"Great Sensor with added bonus","reviewDescription":"I have the full Ring Alarm in my house and was surprised that adding this one piece of hardware next to my smoke detector significantly reduced the price of my insurance. Professional monitoring is required. The cost reduction was actually more then the sensor, so I am very happy with the end result. Only thing I did was instead of putting holes in the ceiling, I put mine on heavy duty command strips.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1599350400000}
{"reviewTitle":"Great concept and price!  Read my review for why","reviewDescription":"I love this.  Very easy to install since it is so light weight.The concept behind this is great, and here is why.Most newer houses are wired for smoke alarms. When one goes off, they all go off. So by buying just one of these and putting it by the smoke alarm for your choice, your whole house is monitored. That is awesome!  Overall, I am very pleased with all of my Ring products.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1573862400000}
{"reviewTitle":"Great value","reviewDescription":"Am happy to have this within the house","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1687132800000}
{"reviewTitle":"Works fine.","reviewDescription":"Nice looking, works fine, we had some issues with the water heater, and oven. CO were detected and when alarm sounded worked very well.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Good option since First Alert detectors are interconnected.","reviewDescription":"If you could interconnect the First Alert detectors I would've got those. The fact they can't be is baffling. All of my smoke and CO detectors in the house are hard wired and interconnected. Why can't FA use existing wiring to achieve the same thing with an adapter? In any event. The device works as it should. It detects both signals...now if Ring could just release a glass breakage detector.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1620086400000}
{"reviewTitle":"Love it","reviewDescription":"A little buggy on getting it set up.  But I finally did, and works like a charm.  Needed tech support.  They have always given excellent service when I called.  I am using this listener on a First Alert BRK9120b.  Have seven wired interconnected smokies.  I placed this Ring listener bout 4 \" away from the alarm.  Had to.call Ring for definitive set up, but no issues.  Quick and easy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1579132800000}
{"reviewTitle":"Does what it says it does and very affordable","reviewDescription":"The device listens to the sound your smoke detectors make  and alerts the base station thereby alerting you of smoke and or fire. It works in conjunction with your current smoke detectors. Install is fairly easy, you will need to place the unit close to your detector. If your detectors are interconnect as mine are you may only need one.  Check with your insurance carrier as they do have discounts for homes that use a central station to monitor fire and burglary.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1585094400000}
{"reviewTitle":"It's great","reviewDescription":"Managed to burn some bacon and ... This thing worked. Immediately after smoke detector went off, our Ring alarm did. I received a call from the dispatcher and let them know I don't need the fire department for my burnt breakfast. Couldn't ask for anything more.  The best part is that I didn't have to replace the smoke detectors. I just installed this unit next to one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1612396800000}
{"reviewTitle":"DOES NOT WORK.","reviewDescription":"We had a house fire yesterday and we were not home. This device did not work!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1643500800000}
{"reviewTitle":"I hate my ring system","reviewDescription":"The only thing that works well for Ring is the door detector. The rest I'd stay away from it. Expensive and not reliable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1589932800000}
{"reviewTitle":"Another useless product from ring.","reviewDescription":"It won't mate or setup even after 4 attempts. I couldn't get this piece of crap any closer to the smoke detector unless I duct taped it to the smoke detector.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1554249600000}
{"reviewTitle":"Run away","reviewDescription":"Piece of s__t..4 times I've tried to sync this thing and 4 times it's said ready to use only to disappear from the ring app","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1564704000000}
{"reviewTitle":"Does not work for my existing fire alarm system","reviewDescription":"I returned it, because could not make it working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660694400000}
{"reviewTitle":"False alarms","reviewDescription":"Terrible. False alarms all the time that wake us up in the middle of the night.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1594771200000}
{"reviewTitle":"A working product","reviewDescription":"I received my product and the product does not work I cannot set it up in my app","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1587686400000}
{"reviewTitle":"More info","reviewDescription":"Did not know it needed something else in order to work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1600992000000}
{"reviewTitle":"crap","reviewDescription":"has to be placed within 6\" of current alarm.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1605052800000}
{"reviewTitle":"Not necessary","reviewDescription":"No sense for this item you can buy another cow and amook detector with ring service and for me is better","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1560384000000}
{"reviewTitle":"Why not just get a CO and Smoke alarm at this price!?","reviewDescription":"Cost more than the Fire and CO2 device and battery and false alarms are constant! I made the monumental mistake of purchasing two of these. I have now received the final FALSE alarm (this time the fire dept. arrived before I was even notified!). I removed them permanently!  I get constantly berated about the batteries being low and then they are really fine an hour later. Support was useless and completely unhelpful in solving my problems. The only real solution is to throw these away. So, I have done that, and now my problem is solved. DO NOT be like me and waste you time, money, and sanity by purchasing this garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Always armed for dispatch, no choice","reviewDescription":"Sad to say one cannot control when this is active (like all the other sensors!). It always causes a dispatch event (yes I know they call first, but I do not always carry my phone at home).  I need it to follow the normal rules for other sensors in that I can set it up to only trigger if I am away.  Rest of the system seems fine.  (Interestingly the support person claimed it was for my neighbors safety.  If their company would cover the cost of a false dispatch then I would be more interested in that argument, given that 99% of the smoke detectors in my city are not set up to auto dispatch ). In esscence they have chosen that I should bear the cost and embarrassment of a false dispatch over an infinitesimal, unmeasured theoretical reduction of risk to my neighbors.  Since when does someone else get to make that choice for me?","isVerified":true,"ratingScore":1,"reviewReaction":"254 people found this helpful","country":"United States","date":1553644800000}
{"reviewTitle":"Low battery issue with at least two units","reviewDescription":"I've had a Ring smoke alarm listener for over a year, and it has generally performed well. However, it recently began displaying a \"low battery\" warning. Replacing the battery seemed to fix the issue temporarily, but the warning reappeared within a day. Oddly enough, the problem seemed to resolve itself when left alone, only to recur the next day. Suspecting a defective unit, I purchased a new one, only to encounter the exact same issue. I plan to return the new unit as well. This experience suggests a significant flaw in either the hardware or software of these listeners. I'll hold off on repurchasing until the issue is resolved.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Not useful without subscription and home base","reviewDescription":"Not useful without subscription and home base.  can i pay you money every month for no reason please?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Ring doesn’t stand behind their warranty","reviewDescription":"You effectively have only the 30 day return policy from Amazon to protect you from product failures.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Hilariously inadequate listening range","reviewDescription":"This thing works great if you install it right next to the alarm it's supposed to be listening to.  But even a few feet away, it won't pick up the alarm.  So forget about one listener covering several alarms.  For this to cover all of your alarms, you'd need to purchase one of these for every alarm in your house.  And for this price, you might as well just buy all new Z-Wave enabled actual smoke and CO detecting alarms (rather than just 'listeners') for your house (they're about the same price).  First Alert makes them, and some other companies too, I think.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"This is junk","reviewDescription":"We just installed this and it was a pain in the butt and does NOT work. It's junk, and we can't even get a refund for it apparently.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"I will file a lawsuit","reviewDescription":"I will be taking legal action against Ring.I live in a rural area with private fire department. Dispatch can be hundreds of dollars.I installed the device today and had it in test mode, the Ring device somehow came out of test mode and I got a call within seconds telling me that fire was being dispatched. I told the woman from ring that I JUST installed the device and that it came out of test mode on its own, I said “cancel the call this is a false alarm” I was told “ we cannot cancel the alarm.  This is a violation of my rights and upon getting a bill from the fire department, I’ll will take legal action against Ring and sue for Monetary and other damages. I see others had this happen to them as well, they should sue too.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1639180800000}
{"reviewTitle":"Must have entire Ring Alarm system to work","reviewDescription":"The description, instructions, nor box tell you that you must have the entire Ring Alarm system (around $300). It does mention you need to have a Ring Protect subscription, which I do have, but without the entire alarm system, this Smoke\/CO Listener cannot be set up on your Ring app. It took me several calls to Ring support to figure this out which put me past the Amazon return date. It wasn't until today that a rep told me about the Alarm System requirement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1682035200000}
{"reviewTitle":"Poor product design - Avoid!","reviewDescription":"I’ve been very satisfied with the Ring alarm overall, but the smoke detector listeners are terrible. Had difficulty getting the first two to hear my existing smoke detectors, and the third one, shown in the attached picture, would never hear it. I tried multiple locations from touching the smoke detector to all around it on every side. My family didn’t have a problem hearing the detector on the other side of the house, but the Ring sensor never would hear it. I would stay away from these devices and this poor design.Another brand makes a true smoke detector that works with Ring. Going to try that next.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1659744000000}
{"reviewTitle":"Great Product","reviewDescription":"All of my \"Ring\" products have been exemplary and easily used.  They also seem to be of the highest of quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1645488000000}
{"reviewTitle":"works well","reviewDescription":"had a problem with smoke in the kitchen and the smoke alarms went off - the listener picked up the sound and ring was calling me about the incident.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1622332800000}
{"reviewTitle":"Worked as advertised","reviewDescription":"Easy to install and set-up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1663286400000}
{"reviewTitle":"noticed almost any smoke which makes me feel safe","reviewDescription":"after having my house burnt down due to a fire, this was a must. if im cooking, and it is too smokey, the alarm will go off which makes me feel safe knowing it will always alert me of ANY possible fire to avoid any other catastrophe.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1577664000000}
{"reviewTitle":"Worked with my 18 year old smoke detectors","reviewDescription":"Setup was 9\/10. It worked with my old detectors, so that was nice not having to buy newer detectors for it to hear them. I’m sold on the ring stuff. $10 a month and it’s covers all devices including home security system. Most companies make you pay extra per device.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1566691200000}
{"reviewTitle":"Must have for ring alarm systems","reviewDescription":"The magic here is that if your existing smoke alarms are connected you only need one of this and you’re all set. One goes off, they all go off, and this listens to it and connects to ring. Ring will trigger necessary emergency services (if you have the subscription plan).","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1562025600000}
{"reviewTitle":"Its good but mount bracket and screws are missing for me","reviewDescription":"I ordered two of these and they are pretty easy to install loving them too. However 1 out of two came without mounting bracket and screws !!!! How am I suppose to mount it ? Second one was all good with all the parts","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1581292800000}
{"reviewTitle":"Great affordable product.","reviewDescription":"At first I thought this thing had to be a joke. That is until I accidently set the smoke detectors off and Ring Security Monitoring called me about 20 seconds after it went off. Very impressed with these products and how simple they are to install. I will be buying more products.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1554940800000}
{"reviewTitle":"Works surprisingly well!","reviewDescription":"We accidentally put the listener to the test by burning some food. As soon as our smoke detector went off, Ring app was notifying us  We cancelled the alarm but Ring monitoring was already on the line making sure we were okay! Very quick response time.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1564444800000}
{"reviewTitle":"Easily Pairs with Ring Alarm System.","reviewDescription":"This sensor can be easily added to extend your Ring Alarm System.  It is very easy to pair and setup\/install.  Since my house smoke\/C02 sensors are all interconnected, I only installed one Ring Smoke\/C02 listening sensor close to one of house sensors.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1572307200000}
{"reviewTitle":"Could be great if it worked","reviewDescription":"I placed it 6”, then 2” from smoke detector and it does not pick it up. Worked during test mode, worked 1 time when I practiced. I have to call in to see about replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1585526400000}
{"reviewTitle":"Ring Alarm Smoke and CO Listener","reviewDescription":"Would not allow for last 2 tests in app, connection problem, returned or reordered another thought maybe problem was with first sensor but second sensor same issue so returned both for refund...!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1579910400000}
{"reviewTitle":"Not easy to instAll.","reviewDescription":"Item is not easy to install. In fact I had no directions in the box. I purchased this item for a friend and we have no idea how to play with it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1586044800000}
{"reviewTitle":"Don't waste your money.","reviewDescription":"2-6 inches from a brand new smoke detector and it does not work at all. Save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647129600000}
{"reviewTitle":"Avois this crap...Fire department comes...and couldnt cancel it","reviewDescription":"This one is so bad. My co2 doctor didnt even go off and somehow the co2 listener triggered and couldnt cancel the dispatch. Do not buy this crap.....u will regret it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1586563200000}
{"reviewTitle":"Careful, if these things throw an error....","reviewDescription":"Careful, if these things throw an error, the fire dept is going to show up and be pissed. Why can’t ring just make a smoke detector like the nest one?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1575936000000}
{"reviewTitle":"It doesn’t sync up to phone","reviewDescription":"I tried everything and no matter what there was no option to sync this to my phone. 😢","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658188800000}
{"reviewTitle":"Not for business purposes. Sorry but I was not aware.","reviewDescription":"Not for business purposes. Sorry but I was not aware that it was only applied to resideial use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643155200000}
{"reviewTitle":"Works WITH not in place of other detectors","reviewDescription":"I was hoping for a replacement (with notifications), not a unit linked to current detector","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1623456000000}
{"reviewTitle":"Be careful","reviewDescription":"Only works if you buy ring alarm system separately.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664582400000}
{"reviewTitle":"Have to have panel","reviewDescription":"Unlike the cameras. Have to have panel. Description not clear when purchasing. Waste of my time. Have to print return label.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Doesn’t work with ALL CO\/smoke detectors","reviewDescription":"Bought this CO\/smoke listener because I have dogs in my house who wouldn’t be able to get out of the house if a fire erupted and I was at work. Installed it, tested it repeatedly, then found out it doesn’t work with Kidde detectors. Can’t return it because I can’t get it off of my wall without tearing the wall out so this was a waste of money. Note: this is now the second Ring product that I’ve purchased that I’ll never use and can’t get my money back for. The first was a motion sensor light without a camera (who knew they made those and who would pay $90 for a motion light?). My $10 motion light works better and doesn’t require a bridge (an extra $50).","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1578355200000}
{"reviewTitle":"Bad name, bad Amazon customer service","reviewDescription":"Most importantly this is confusingly named. It’s not a smoke or CO listener as in it doesn’t “listen” or “detect” smoke or carbon monoxide. It simply listens for a signal or an alarm from an EXISTING detector.  Also: after being on hold for a long time, poor customer service from Amazon. They “allowed” me to return this WITH a greedy restocking fee - so tacky.  Do you really need to recoup costs during the virus situation? Doubt it. You can’t always install these household devices if you have construction going on. That’s why I couldn’t install it within 30 days. Very unhappy and disappointed with Ring and Amazon - after all they are essentially the same company now.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1598659200000}
{"reviewTitle":"Terrible customer service","reviewDescription":"Ring can't replace a simple malfunctioning unit after it stopped working. I already spent 1.5 hours with support. They want to keep troubleshooting and won't send a new unit. Spend hundreds of dollars on ring items, buy a yearly Ring Protect subscription, and this is what you get. What a scam. Stay away.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Never got it to work correctly","reviewDescription":"After talking g with tech support never could get it to talk to other detectors, this is a joke of a sensor. Why not just have a smoke detector with your system? Sent back for refund at ups store then got charged for it when Amazon said they never got it back. Rest if alarm is great, this part is a waste of time and money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674259200000}
{"reviewTitle":"This product should be recalled","reviewDescription":"If your smoke alarm emits any beep, such as low battery or a warning when you lose power, it alarms and ring dispatches the fire dept.  Every damn time we lose power I have a nightmare to deal with trying to get it disabled before the fire truck shows up.  It may be helpful when you really need it, but it’s a such a nuisance that I need to get rid of it. The design is broken and Ring needs to fix this or take the product off the market.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658361600000}
{"reviewTitle":"Beware! You must have the Ring Alarm base station","reviewDescription":"If you don’t already have the Ring Alarm base station, then either get it (meaning buy the whole alarm system), or don’t buy this product. I read all of the details before buying this product, and nowhere did it say that Ring Alarm is required in order to make it work. Extremely disappointing. Even more so because there is no option to return it in the order details even though the sales listing states that it’s eligible for returns within 30 days. Just another disappointment in the long line of them from 2020 onward. But I digress…","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1649203200000}
{"reviewTitle":"Dead Battery","reviewDescription":"Showed up with a dead CR123A battery that can't be charged.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Does not work","reviewDescription":"Cannot finish setup as the device cannot detect the sound of my smoke detectors.  Then while not working the battery died in about a month.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Not what I thought it was","reviewDescription":"Maybe I just didn’t do enough research, but I was not aware until purchasing and reading the instructions that you need one of these within 6 inches of your current alarm. This does not work with multiple alarms and it needs to be in extremely close proximity.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Good for Whole House Smoke\/CO Systems","reviewDescription":"With Ring, you have two choices when it comes to alerting you and others that smoke or CO is in the house:  a First Alert smoke\/CO detector with Z-wave technology or this listener.  The first actually detects a problem, and this listener waits for other detectors to go off before reporting the problem.  Because I have a hard-wired system where every alarm goes off when one does, the listener was the most cost-effective.  I need only one listener instead of several detectors placed throughout the house.  If we didn't have a whole-house system, then I would have gotten one listener for each floor since it still would have been fewer devices than if I placed new detectors in every bedroom and hallway.As with all Ring security devices, this listener was a breeze to install and activate.  Just follow the instructions on the app, and it's added to your list within minutes.  The most time consuming part is installing it 6\" or less from an existing detector.  That is as difficult as drilling holes and screwing the base in.  If you have a hard-wired, whole-house system, you can select any alarm to place it next to, even in an out-of-the-way location.  Note:  If you are connected to Ring's service, make sure you follow the instructions to put it in test mode so that it doesn't trigger a response.I love my Ring security system, and this listener add functionality that I didn't expect when I first bought into the system.-- Debbie Lee Wesselmann","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1564185600000}
{"reviewTitle":"Ring is a great system","reviewDescription":"Works perfectly and a breeze to set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Saved my Son's and Daughter-in-Law's Lives!","reviewDescription":"One night when my son and daughter-in-law were at a wedding reception they called us to say their Ring Listener was going off and the fire department was on their way to their (fairly new) house.  We thought it might have been a false alarm as there were a couple due to us taking it off the ceiling when we were painting (not a good idea).  By the time we got to the house the two fire fighters said they had a headache and the CO readings were very high.  We opened up the house and figured out that the CO was coming in through an area under the deck were the fumes were trapped.  Anyhow, if it hadn't been for the Ring calling the fire department, and if the CO detectors turned off, the kids might have come home, gone to bed and who knows if they would have ever woken back up.  I am very thankful I bought the Ring Listeners and for the fire department people!","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Great product to add to a great alarm","reviewDescription":"So far the Ring alarm has been fantastic.  We are still learning all its in and outs, but we have been with Ring since the begging.  A company that we stand by, that has stood by us with any problems and helped us to figure out issues.  There is so much you can do with it, we have learned from friends and family, and the YouTube videos.....Great products, Great company..... highly recommend.....👍👍👍","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Extremely Fast Battery Drain FIXED.","reviewDescription":"It connected fine and was installed appropriately, however it has gone through two batteries within a week. I’m not interested in having to constantly maintain.I’m also a little concerned with the immediate fire department notification whether it’s an accidental alarm or not.UPDATE: 3\/20202 star to 5Ring costumer service reached out to me immediately and has completely resolved the battery problem and answered my concerns regarding the C02 \/ Fire listener.First of all, I may have had a faulty listener, which was replaced with a new one quite quickly. However, with a larger number of sensors I had going on in my house, there were also some connection issues \/ low signal issues which seem to drain the batteries faster than expected. With the addition of multiple range extenders, problems with far away motion sensors and door sensors seem to be resolved.Now, I'm not saying this system is flawless, it may take some trouble shooting and working with your system and home to determine how the system itself best fits your environment, but all in all, I think RING is a pretty good DIY home alarm system.Big props to the RING costumer service... very helpful and easy to deal with through email.As for C02 \/ Fire alarm listener....If fire alarm is tripped, whether it's a fire or smokey kitchen oven, the alarm company will call contacts, just as they would for a break-in alarm. If no answer, they will then call emergency.If the C02 alarm is tripped, dispatch will automatically call emergency services being that c02 leak is immediate and life threatening.(FYI,  the listener knows the difference in beeps from each detector)","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1581552000000}
{"reviewTitle":"It's different but it works!","reviewDescription":"I hope at some point Ring makes its own smoke\/CO detectors but in the meantime, these \"listeners\" will do. I paired mine with First Alert monitors and in testing, the listener was able to tell me whether the alarm was smoke or CO. Since I have pro monitoring for my Ring system, it provides ease of mind if something happens while I am not at home. Easy to install and test and set up.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Loving it","reviewDescription":"I purchased this product to get peace of mind when we are not home. With having a busy lifestyle out of my house having this product helps me know how to better respond to any emergencies when I am not home. Not to mention that I have fur babies that are left home alone this thing helps me have peace of mind in case anything were to happen. Definitely happy with this purchase. It is easy to install, and so small it doesn't take up space. Keep in mind you do need to already have other ring products to have this work such as the base system, etc.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Quality product","reviewDescription":"Looks nice, just hope I never need it but a great addition to my ring security system.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"Nice addition to the Ring system","reviewDescription":"Works for my need.I tested this sensor on multiple smoke alarms and smoke\\CO alarms. To test the alarms, I unplugged its interconnect wire so only the one alarm would signal an alarm at a time.  The Ring listener seemed to work fine with the following Kidde Smoke Alarms or Combination Carbon Monoxide & Smoke Alarms:KN-COSM-IBAKN-COPE-ICP12040I12060I12080I4618PI2010And First Alert ZCOMBO-GI did find placement of the senor was key. You may need to move the sensor around the alarm for optimized performance. With the sensors facing away from the alarm it was hit or miss if the sensor recognized the alarm signal.  And place the sensor within 3 inches.I know my setup may be a little over kill. My house has interconnected alarms in each room. I am using two Ring listeners one on the main floor and one in the basement.  If an alarm goes off all device signal an alarm. I figure if one listen fails the other one should trigger. In addition, I can enable Amazon Guard on several Echo’s and Dot’s throughout the house.  Plus, a sort of backup I have several First Alert ZCOMBO-G’s installed too.  My main goal is to make sure all family members get out in case of a fire.  If we do have a fire, I am pretty sure the house will be a complete loss, 20 miles to the nearest fire department.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1570233600000}
{"reviewTitle":"Fantastic","reviewDescription":"I hesitated on purchasing this for some time, despite having subscribed to the premium security plan with Ring for a while. This was because all of the reviews stating false alarms could not be cancelled, and essentially that the fire department would show up no matter what. Having a very sensitive fire alarm, this wasn’t going to work.I saw that there was an update, and decided to give it a try. It is great so far. There have been a couple of false alarms since I installed it, and I simply told the Ring personnel that called me that everything was okay, and that was the end of it.The peace of mind is 100% worth the cost of this product, especially if you already subscribe to Ring’s professional monitoring service (which I highly recommend as well).","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1673827200000}
{"reviewTitle":"Too many false alarms. Don’t buy","reviewDescription":"DO NOT BUY THIS POS!!! Steam from my shower set it off when I opened the bathroom door.  I bought two.  They both ended up in the trash bin!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1643760000000}
{"reviewTitle":"Couldn't get it to work","reviewDescription":"This is the one  ring product that I just can't get to work and the troubleshooting guide is inadequate.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"REQUIRES EXISTING RING SYSTEM","reviewDescription":"I already have the ring doorbell and I thought this would be an easy add-on via the app. I realized afterwards that you need the whole ring security system for this to even work.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1641081600000}
{"reviewTitle":"Does not work alone","reviewDescription":"Please state and highlight an alarm required","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Why?","reviewDescription":"They make smoke alarms that are z-wave compatible, this just listens, for about the same price you can have a full detector.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1653004800000}
{"reviewTitle":"IT IS NOT EXPLAIN THAT YOU NEED TO BUY THE SECURITY SYSTEM IN ORDER TO INSTALL THIS DEVICE....","reviewDescription":"Did not get around working with this device until now and then I found out that you cant install it unless you add it as part of the Ring security system.  Meaning, I am screwed and lost $37...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1599609600000}
{"reviewTitle":"This and $250","reviewDescription":"Requires $250 Alarm Station.NO THANK YOU!My mailbox sensor works with Alexa, why not this?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657411200000}
{"reviewTitle":"Not supported","reviewDescription":"This is no longer in the ring app","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1663200000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"First Alert that’s supposed to connect won’t, so bought the listener and it can’t hear the first alert.  Waste on both","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Does not work with Nest smoke detectors.","reviewDescription":"Product does not work. Could not get this device to hear my current smoke detector. My current system is the Nest and I have three connected smoke\/Cabon Monoxide detectors. I tried all three and this Ring device could not detect any of the Nest devices.","isVerified":true,"ratingScore":1,"reviewReaction":"35 people found this helpful","country":"United States","date":1551657600000}
{"reviewTitle":"worked great","reviewDescription":"now were safe","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Easy to set up, wear hearing protection during setup.","reviewDescription":"Overall not too hard of a setup, just go into the app and pair it with the base station, the app then asks for you to test to enable the sensor. Just mount it near a fire alarm (read the instructions for how far it needs to be) and press the test button the fire alarm. While it is chiming look at the app and make sure it recognizes that the sensor heard the signal and you're done (and can turn off the test mode on the fire alarm).Just note, if you're standing right next to the fire alarm.. you may want some hearing protection. My ears were definitely ringing for a little bit after being right next to the fire alarm during the test.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1625616000000}
{"reviewTitle":"Finally Got It Working","reviewDescription":"I thought the directions were pretty clear, but it took me a while to actually get it working. It’s a pretty slick product though, and it’s really easy to operate after you get it dialed in. You only need to put it in one room in your house and then if the fire alarm rings it will go off. It’s a pretty fabulous addition to the ring alarm system.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1668902400000}
{"reviewTitle":"Ring is great and response time awesome","reviewDescription":"Was cooking bacon in an air fryer and I didn't empty grease from the other day doing bacon so my house started getting smoke from air fryer the ring listener 3\" away from fire alarm heard alarm it notified ring and in 30 second people from ring were calling me to make sure everything was OK.  This product is worth every penny. Ring is awesome for your home and the monthly charge for ten dollars is great. Thank you ring for protecting my home.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"Quick and easy to install. Did lower my homeowners insurance premium.","reviewDescription":"1\/6\/2022Just installed the Ring alarm smoke\/CO listener. Installation and set-up was quick and easy. When testing it, it was able to recognize the difference between the smoke and CO alarm tones.If you plan to buy this to try and lower your home insurance premium for having a \"fire alarm with professional monitoring\", then you should know that it will actually raise your coverages (depending on your insurance company), but also give an additional discount. For me, this listener did lower my insurance premium.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1641600000000}
{"reviewTitle":"Great Product!","reviewDescription":"I wrote a review about this product last week stating that one of the listeners didn’t work for me. I am here to tell you that my issue got fixed. I had problems with the setup. It’s been working like a champion ever since. I will definitely recommend this , because ,this month , my wife was cooking and forgot about that. She was upstairs and got a call from ring but she didn’t pick up the phone: she didn’t know who it was. At that time she noticed that the alarm went off. She ran downstairs , turned off the stove, and deactivated the alarm. Then Ring Team called again.This time she answered and was told that Firefighters were on their way.Great job! Keep it up!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1598227200000}
{"reviewTitle":"100% Recommend","reviewDescription":"I wasn’t sure if this device worked for the past 2 years, but this morning when my CO detectors went off at 5:45am it recognized the alert from my First Alert talking detector that was about 10 feet away and Ring, through the professional monitoring, dispatched the fire department and called me to make sure I was okay. It was a false alarm but it gives me peace of mind in case there ever is a true emergency. I would 100% recommend this with the professional monitoring.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1639699200000}
{"reviewTitle":"Could not finish setup REVISED REVIEW","reviewDescription":"Followed setup instructions carefully. Device would never finish 15 min. test cycle -- never joined my Ring Alarm system. Removed. Tried again. No joy. Help file on listener is poor. Nothing listed for my problem. I give up. Returning to Amazon. Will try First Alert ZWare Ring-compatible smoke\/CO alarm instead.Update: Upon posting the above review, Ring contacted me and offered a high level of support if I would consider trying the Listener again. I am now a happy camper. It's working perfectly. Ring's support was top notch. I am a refugee from the failed Lowe's by Iris platform and am very glad I chose Ring Alarm.Update...after several days of frequent testing the Listener works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1562198400000}
{"reviewTitle":"Saved my commercial building during a power AND internet blackout","reviewDescription":"This little guy gave its life to save my office. Worked exactly as advertised. See pic.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Smoke LISTENER","reviewDescription":"Works, too bad it is not a true detector","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"Very upset","reviewDescription":"Horrible device. Has to be very close to smoke detector. My Alexa echo picked up the alarm first. These devices do not work with carbon dioxide or gas alarms!!! Only smoke alarms. Tested it 7 times. Waste of money. Updated. Both batteries have been changed twice and dead within a week. The first two had to be replaced because they stopped working after two days and wouldn't pick up the smoke alarm even thou they tested as \"working\"","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1593043200000}
{"reviewTitle":"Better options available","reviewDescription":"I purchased a ring security system and a bunch of accessories to go with it. I am a network engineer, so I would like to think I am pretty efficient with setting devices like these up. Every device was a major PIA to set up. I have since started replacing all my ring devices with Nest devices. A little bit more money but night and day difference in quality, materials, and over all ease of use. Not to mention the ring app UI is very clunky.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1563753600000}
{"reviewTitle":"DID NOT WORK for my existing fire alarms","reviewDescription":"This is supposed to be a microphone can listen to any standard fire\/smoke alarm and converts it to z-wave. I installed it properly. In fact, the microphone side was side-by-side with my existing alarm--less than an inch away.  I put it in test mode (set it off) and nothing happened.  It did not trigger the base station (yes it was paired correctly).  I returned the device. It may work for others, but it did nothing when I used it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1576195200000}
{"reviewTitle":"Not what I expected","reviewDescription":"I ended up getting not what I expected.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"Worst product ever designed by Amazon","reviewDescription":"I like my Ring Alarm. Everything functions as it should and as an Engineer I appreciate a cleverly designed system. However, this Ring Alarm Smoke and CO Listener is a whole different story. Arguably the worst product ever put together by Amazon in my opinion. It was part of my Ring Alarm package so no point returning. Expect a $40 battery operated paper weight.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1591920000000}
{"reviewTitle":"Only will listen to one device and wouldn't hear any of the newer ones we have","reviewDescription":"I bought 2 of these thinking they were combined units that would listen for both CO and smoke.  That is not the case, apparently it only listens for one sound.  If it is a combined unit it might work.  However, it would not hear the 3 year old combined unit I have.  It also would not hear a ~7 year old smoke detector.  Sorry I bought them now.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1568073600000}
{"reviewTitle":"Crap","reviewDescription":"It's not an alarm. It just listens for an alarm.. Wish I knew that before buying it..","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Wont send signal to Alarm Base","reviewDescription":"When installing and testing the light flashes red visually indicating it detects the smoke alarm going off, but it wont show up on the app.  Spent an hour with tech support and they finally agreed to send me another.  I have a contact switch that keeps going offline also.  I have no faith in the reliability of the  zwave system used by Ring.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1567036800000}
{"reviewTitle":"Alarm went off but ring didn't.","reviewDescription":"Don't trust this thing...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"Tried one. Dud. Tried two. Dud. Pass on the third. All returned.","reviewDescription":"Seemed like a good idea. Only problem is they just don't work. My Echo Dot detects the smoke alarm and notifies me. My Wyze cams detect the smoke alarm and notify me. This listener does absolutely nothing. Experience with Ring products is usually good. Not this one. Waste of time and money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1635984000000}
{"reviewTitle":"I refitted my house with Co2 and fire by first alert and works with ring.","reviewDescription":"Just not impressed when I found that you need one for every smoke detector, not cost effective when first alert will connect to my ring alarm so easily.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1568419200000}
{"reviewTitle":"Works ok after install","reviewDescription":"Works well once attached but was difficult to get connected to ring system at first.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1554681600000}
{"reviewTitle":"It doesn't work alone.","reviewDescription":"It doesn't work alone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578787200000}
{"reviewTitle":"It’s ok","reviewDescription":"It’s ok not that impress with it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1561766400000}
{"reviewTitle":"Fine","reviewDescription":"Works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1565308800000}
{"reviewTitle":"Peace of Mind, Respond to a Fire Faster or While You Are Away, But Not Perfect","reviewDescription":"This Ring Alarm device is far from perfect, but is a great way to add fire\/CO alerting and response to your home monitoring and existing Ring Alarm service.  Where properly installed with working fire detection systems and tested, and with monitoring, it should alert emergency response much faster than a neighbor noticing an externally visible fire while you are away, or you getting out and then calling the fire department after it is safe to do so.  I'd still call anyway, not blindly expect that alerting worked.LISTENER NOT DETECTOR:The key difference here is that it is just a \"listener\", not a detector.  It does not do any detection of smoke, fire, or CO levels itself.  Otherwise I suspect it would have to comply with a lot more testing and regulation, 10-year battery life requirements (which this does not have), and would have to be completely replaced every 10 years or so (see current advice & regulations for smoke & CO detectors).  So this one just buddies up to existing detectors that do comply, and listens for the alarm from that device.  It can tell whether it is next to a Fire\/Smoke or CO detector by the technically unique sound each make.  Supposedly \"temporal 3\" is used by fire alarm, and \"temporal 4\" is used by CO gas alarms, and it can tell the difference, and respond with different emergency protocols (but not that you can control).INSTALLATION:There is a simple back plate to mount on a wall with screws.  It doesn't come with double-sided tape for alternative easier installation (not sure why not), but is easy enough to make a mark with the back plate and drill 2 holes.  It can only be installed in one direction facing your existing detector, has an arrow on the back plate itself, and must be placed 3 to 6 inches from your existing detector and pointed towards the right direction to listen for it.  Just add to your ring service through the Ring app as usual, scan the QR code, and put it into test mode to make sure it recognizes the detector sounding, and then mark it done.  It comes with an easy to replace Panasonic CR123A Industrial Lithium battery, comes fully charged, and the Ring app will tell you when the battery gets low or sensor goes offline.DRAWBACKS:(1) They can only be placed within 3-6 inches of your existing detectors, and facing a certain way.  Thsi might not be ideal on some surfaces that you might not want to disturb.  I wish it would just listen like all the Echo devices that have a setting that can alert you if a smoke or CO alarm goes off in your house.  I'd prefer it to hear high pitched sirens from anywhere in the house and alert me to look into it.(2) Unless your existing detectors are networked together so that when one sounds then all sound, you would have to have one of these listeners for every single smoke or CO detector that you want to be alerted for.(3) With monitoring, you have only one chance to avoid a false alarm for smoke, and none for CO.  I really want them to call my home and my emergency contacts first like they would do for a break-in sensed by the other alarm sensors.  For their response protocol, look up their topic \"Getting a Call from Ring’s Professional Monitoring Center\" that details their procedure.  As of this review, for smoke, they call your 1st contact with a chance to cancel, then emergency response, then your 2nd & 3rd contacts.  For CO they dispatch emergency response first, then your emergency contacts.(4) I really worry about false alarms for the smoke detector near the kitchen when something accidentally burns on the stove but is taken care of, yet the smoke detector goes off.  I have my 1st contact as my home phone so I have a reasonable chance to intercept, but it still worries me being my only chance.  My alternative is to put listeners only in places that aren't likely to have false alarms, which adds risk.(5) To test any of your existing smoke or CO detectors, you must either remove batteries from all your listeners or put them into test mode.  I think it will be easy to forget while testing them once in a while to make sure they still work.  Or someone else who doesn't know my Ring system could test it and not know.  CO test accident will trigger a false alarm.  So I worry a bit.(6) Although combined Smoke & CO detectors exist, if you look into it, their ideal locations are very different (where smoke gathers versus where CO gathers) and so you are more likely to have separate units, doubling your need for these.SUMMARY:Certainly better than having no monitoring, and gives me peace of mind.  I just think it could be more flexible, and have a high tolerance protocol to avoid false alarms.","isVerified":false,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1567900800000}
{"reviewTitle":"A little twitchy - makes me nervous","reviewDescription":"I have First Alert interconnected smoke and CO detectors. I was told by Ring support that they would give me a call first if the fire alarm signal was detected, but they would immediately dispatch fire department if CO alarm is detected. False smoke alarms happen from time to time, so it is nice to know that I could cancel it. However, during test mode I noticed that it falsely detected a CO alarm when my talking detector shouts \"EVACUATE!\" (4 syllables -> 4 tones -> CO alarm). I had to spin the speaker of the alarm a little further away from the sensor until this stopped happening. This means that if I wasn't careful about placement, it could have immediately dispatched fire department on the first false smoke alarm. Also pressing the test button on any smoke alarm will trigger both fire alarm and CO alarm. If you're not careful about first putting the sensor in test mode, that could also cause a visit from the fire department. I feel a little nervous using this device. That's a shame because this detector was the main reason why I bought into the Ring system in the first place. All I really wanted was to be notified of issues if I am away from home.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1605571200000}
{"reviewTitle":"Does not work with Apple HomeKit","reviewDescription":"Nice design, good features. But sadly does not work with Apple HomeKit.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1574553600000}
