{"reviewTitle":"Purchased this for  streaming video services. The  set up is easy. Great device and great price","reviewDescription":"Purchased this for  streaming video services. The  set up is easy. Great device and great price","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Works great","reviewDescription":"Works great and easy set up!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"They work great and are saving me a fortune.","reviewDescription":"I no longer need to pay way too much to AT&T for Direct TV. 225 channels and I watched 5-7 programs. I now get numerous channels by streaming; Amazon Prime, Hulu, and Netflix all for about $25\/mo. I installed 3 Amazon Fire Sticks and we are 100% satisfied. Thank you.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Firestick","reviewDescription":"I don't like this particular  firestick. There is no power on button and I can't turn the tv volume up. I don't use Alex like that. It is a great remote but I want to be able to choose to turn on my tv myself. Right now there are no fees associated with Alexa but someday there might be. I am old school and want to do this for myself.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"\"A Beacon in the Alexa Ecosystem: Fire Stick Lite Shines Bright - 5 Stars!\"","reviewDescription":"Navigating the vast universe of streaming devices, the Amazon Fire Stick Lite emerges not just as a mere gadget, but as a guiding light within the Alexa ecosystem. It's akin to finding that one true companion in the digital age, one that understands your commands, anticipates your needs, and delivers a world of entertainment right to your fingertips. For those of us who have pledged allegiance to Alexa, this device is a testament to the growing prowess of AI, making the journey not just smarter, but more seamless.Indeed, the modern landscape of tech giants often feels like a tale of divided kingdoms, each with its own rules and realms. In this age of ecosystems, where cooperation often takes a backseat to competition, the Fire Stick Lite stands out as a beacon of integration for those of us nestled comfortably in the embrace of Alexa's realm. It's a reminder of the potential harmony in the digital domain, should the titans of tech ever decide to join forces.The Fire Stick Lite, with its intuitive interface and vast library, is a herald of convenience. However, it's worth noting that to unlock the full spectrum of its magic, one must bear the insignia of Prime membership. It's a small price to pay for the keys to the kingdom, offering not just content, but a suite of perks that enrich the overall experience.As AI continues to evolve, weaving ever more closely into the fabric of our daily lives, Alexa's capabilities burgeon with potential. The Fire Stick Lite, in this context, is not just a device but a companion evolving in tandem with our digital desires. It's a glimpse into a future where our voices command more than just devices—they shape our very experiences.In bestowing upon this device a resounding 5 stars, I do so with the recognition of its place within the grander tapestry of the Alexa ecosystem. The Amazon Fire Stick Lite is more than just a streaming device; it's a piece of the puzzle in our interconnected digital lives, offering a seamless, user-friendly bridge to the vast expanse of digital content. For those of us committed to the Alexa ecosystem, it's not just an accessory; it's an essential.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Turn Your TV into a Party Machine with Amazon Fire TV Stick Lite!","reviewDescription":"Okay, buckle up, because we're about to take your TV-watching experience to a whole new level of awesome with the Amazon Fire TV Stick Lite! This little device is like having a magic wand for your entertainment center - just plug it into your TV, and voila! You've got access to a world of free and live TV, all at your fingertips. And with the Alexa Voice Remote Lite, you can control everything with just the sound of your voice. Want to binge-watch your favorite shows? Done. Need to check the weather? Easy peasy. Plus, with smart home controls, you can even dim the lights or adjust the thermostat without ever leaving the couch (cue the applause). So if you're ready to turn your living room into the ultimate party zone, do yourself a favor and grab the Amazon Fire TV Stick Lite. Your TV (and your friends) will thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Lots of channels","reviewDescription":"After our Cable rates continued to go higher, we finally decided to get rid of cable.  I bought a fire stick a few years ago but never installed it until after we switched.  The channels are so easy to use that I purchased one for the living room so my husband can watch what he wants.  The firestick is extremely easy to use, and you have access to thousands of shows and movies without additional costs.  You gave the option to subscribe to channels for an additional fee, but so far we have so much available that we don’t plan on purchasing add ons.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"I’m entertained!!!","reviewDescription":"This product is a game changer. I resisted using it for years. I purchased a smart tv it got me hooked. The other TVs needed to be upgraded to take advantage of the streaming apps, this is an economical way to do it. Now I have several. I haven’t used the Alexa feature yet but I’m sure it will be useful to use.It’s a game changer to say the least. Not only do I get to watch shows of my youth, but new programs as well. It’s great to binge watch series I didn't have time to watch when they first aired. I like the variety of genres offered and how it’s easy to follow an entertainers work you’re interested in. I have come across many hidden jewels. Movies the may not have been box office smashes but were great stories, nonetheless.The best part is choosing what to watch when I want to watch it. I can tap into my cable subscriptions or look through other options. With this product I can live my life and be entertained when I have time for it!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Amazon Fire TV Stick Lite, free and live TV, Alexa Voice Remote Lite, smart home controls","reviewDescription":"This was a great price for it and I couldnt pass it up. Will let me watch all my amazon programs and will be easy to take with me when I travel. I couldn't be happier with this item. Arrives quickly and is just as advertised. For a good price make sure you get one too.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Back to basics","reviewDescription":"I recently tried another off brand replica as was very disappointed.. I saw This for $20 and decided to grab this and return the other one.. this one is quick and reliable.. good buy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"YALL READ THE REVIEWS BEFORE U BUY","reviewDescription":"YALL tell me why i wasn’t thinking?!! so I have a roku but it’s literally 10 years old, so I bought this to replace it. IT DONT HAVE NO, ON OR OFF BUTTON OR NO VOLUME BUTTON ON THE DAMN REMOTE!! i’m so upset. i didn’t know! 🥲🥲 i already set it up and everything (or i would return it) so yeah honestly don’t recommend it because my big ass is too lazy to get up and turn off the Tv everytime! like why couldn’t yall just put the buttons on the remote. jeff didn’t slay on this one yall🫣","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"UGH!!","reviewDescription":"If I could figure it out, I’d possibly give it more stars. The only reason I gave it the stars I did is because it initially came with a faulty remote. I contacted seller and received great customer service and a new remote in just a couple days. However, I’m internet, WiFi, computer, anything technical illiterate and I can’t seem to figure it out.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Planned lifespan?","reviewDescription":"From other comments and our own experience, it seems these have a built-in lifetime of about 6 years. All electronics will work virtually forever if they make it past the first few months. (I have work experience in the I.C. industry.) But many of these seem to die after a limited lifespan. Otherwise, they'd be great for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"no tv volume or power","reviewDescription":"I should have read this better.. a few years ago the tv stick actually controlled the tv... this one does not. good thing I saved my old control, because the amazon stick went wrong after a year or two.I don't have much use for the Alexa stuff.... just want to watch tv until I fall asleep.... no frills.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Remote control stopped working after three months","reviewDescription":"Not having a smart TV I was in need of a streaming stick. I had always wanted to try a fire stick, having bought Roku only before. I was very disappointed with the quality of the remote control. It just stopped working altogether about three months after purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"It's called LITE for a reason Buyer Beware","reviewDescription":"My fault for not looking at it closely, but you cannot control the tv power or volume with this remote. I purchased it a month ago but just opened it and realized its limitations. However, it's too late for me to return it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Cheap but cheap","reviewDescription":"I've had Rokus but wanted to see how Amazon's offering stacked up. The three main negatives with this specific configuration are: no power button, no volume buttons, and SO. MANY.ADS. Also for tv shows the next episode will automatically start before the actual end of the current episode and there's NO WAY TO TURN IT OFF IN THE APP. You have to log onto the Amazon web page, go into Amazon Prime Settings, and then disable it there. Quite ridiculous. You can turn off auto-play previews in the app, but it still plays previews of many shows, such as Thursday night football when on the home page or prime home page, so you can't fully disable these things. I would give this 2 stars but raising it to 3 to account for the low price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Good price but has issues","reviewDescription":"We have owned and used fire-sticks probably since their inception and have rarely experienced any problems. With that being said this particular fire stick just turns off or shuts down out of the blue for some unknown reasonOther than that it performs as its supposed to","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"easy installation","reviewDescription":"I could cast from my android phone but I could not cast\/mirror from my chrome browser.  It kept saying something, this site does support casting.  It happened on every site I visited.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"The remote","reviewDescription":"Functionality was fine, but the remote control felt so flimsy and light, it was kind of uncomfortable and fragile as if it could break any minute if buttons were pushed too hard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Way too many ads!","reviewDescription":"We got 2 Amazon Firesticks because they were on sale for $17 during the holidays. Now that I’ve had them for a month I can say I would not recommend buying one. I wish I would have just waited to get a Roku. There are a ton of ads. The second you turn it on and click on your profile, it plays 2 ads. Then you click on an app like YouTube, and it plays 2 more ads before you’ve even selected a video or scrolled through recommendations… then once you’ve picked a video and started watching it, about 5 minutes in YouTube is going to run their ads. Then when it’s playing an ad it has an option to send a link to your phone for the product and I don’t know why but that creeps me out even though it sounds like it should be convenient. We bought the Firestick to replace our Roku we broke during a move. It serves its purpose, it’s a smart stick but I just feel like it’s one big ad for Amazon. A Chromecast or a Roku would be a better option. We’ll use it for now because we have it, but I can see myself going back to a Roku eventually. The only other complaint I have is there’s no way to control volume from the Firestick remote, you have to control the volume with your tv remote or from your tv itself. It’s a little frustrating when you need to quickly turn down or turn up the volume.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"The last update put both, my first ick lite and my firestick out of commission.","reviewDescription":"I really liked the firestick. So easy to use. Plug it in and start streaming. It was great to have the availability of every streaming service out there. My Samsung Smart TV doesn't get hardly anything. Loved it so much that when my grandsons were staying all the time, I got tired of switching it from the living room to their bedroom so I bought the lite for their room. As soon as I did, they started unprogramming and interfering with each other. I had to fix them every time I wanted them to switch rooms. They were both working fine though before the last update. When the boys got up there was no tv. Tried everything. Even called Amazon. One person said there was nothing I could do but buy a new one. The next guy helped me but the only way one will work is if I connect it to my phones hotspot. I have Wifi, why would I want to burn up my phones data? And what if I'm not home? Plus, the other one won't work at all. I don't know what that update did, but I think it's pretty foul to put the devices that they sold me out of service. I would hope that this gets rectified. Otherwise, people... Watch out. I guess they will have a diminishing item they can sell us over and over and over. Does anyone know how good Roku is?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Hopefully, We Could Get Help with This","reviewDescription":"We had the first Fire Stick which was having trouble. Then we bought a 4k Fire Stick, but it wasn't working properly like there was dust in it making the screen flash and static. Once in a while it disconnect and reconnect. When the old one stopped working, we bought the lite and it just came in today. However on start-up... or should I say, \"What start-up?\" It came up with the HDMI screen when things are not connected. We switched the plug out, unplugged it and replugged it back in and blow out any dust if there was any to see if it'll work... again nothing. So we switched back to the 4k one to watch on there even though we had the flashing and static. Mind you, it worked this morning. It turned on, but the controller stopped working. We did what the fire stick told us to do since the controller wasn't connecting. I quote from Space Balls, \"Even in the Future nothing works.\" Out of curiosity, we plugged the old Fire Stick in and it's working, but buffering. Well, send the Lite back and hopefully we can get a new one or go one step up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Glitchy","reviewDescription":"Great idea.  More convenient than using my laptop to access my favorite streaming services.  Takes up zero space.  I wish I’d gotten the version with power and volume control.  The main problem I am having is that it glitches, almost constantly.  Press a button and you can hear it “click,” so the system got the message, but it takes so long to respond that I’ve clicked it several times before it decides to.  Also will quit and go back to the home screen without warning.  Often a movie will abruptly stop and an error code will pop up.  Trying to fast forward is so glitchy, it takes less time to simply watch what you’re trying to skip.I’ve replaced the batteries with new and my internet service is solid.  I’ve asked several others, and most have expressed the same problems.Maybe I got a lemon?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"No volume control","reviewDescription":"I completely missed that this remote does not allow volume control or TV power. You have to use 2 remotes and that's a bummer. I just got ot and am returning to repurchase the model that has those things on the remote so that I don't have to use 2 separate remotes. I'm not sure why anyone would purposely buy a streaming remote that doesn't have those features. When For about $3 more, you get all of the convenient features on one remote. It was totally my error because I just assumed I would only need one remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Different remote control","reviewDescription":"From the reviews, I was under the impression that I would be receiving a remote with prime, Netflix, Hulu, and Disney on it. Which are my go to streaming services. However I got one that has directv and peacock on it, which I will never use. Are they picking and choosing who gets what remote or is there another one I can purchase with those on it?With that aside, I am extremely happy to be able to use Crunchyroll on my tv now at least.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Be Sure You Want the Lite","reviewDescription":"I tried purchasing 2 remotes as replacement firesticks because the last two died on me which is a whole other story.I always had the firesticks with a a power button and volume control, but when trying to purchase, I received a prompt limiting me to one purchase at a time unless you create a business accountNot sure why someone would buy the LITE remote since you will still need the regular television remote to turn on\/off your tv or to control the volume.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Slow, lags and glitches","reviewDescription":"This firestick is ok. I used the extender to try to get more length from my power chord, and the Internet app did not work well at all. Then I moved the firestick to another TV, no extender, and it still glitches and shuts off Netflix and Pluto. It has a major lag, and seems to be subpar compared to like, a Roku. The only issue I ever had with a Roku was that it was a bit outdated so YouTube would glitch out. So....one glitch versus 3 glitches is obviously the way I would prefer.  And for only a 3$ difference, I would get the Roku.  Don't waste your stress on this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Fire stick","reviewDescription":"Had to have it replaced two times. I feel I should have not gotten a Refurbished one I should have gotten a new one.  The one I Purchased was new.It did not work correctly. So I should have gotten a new one.For a replacement.  Instead of getting.Refurbished ones, and it took 2 before.One worked","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Eh, wouldn’t buy another one.","reviewDescription":"I kinda knew I didn’t like fire sticks from hearing my sisters issues with not having storage but I bought this while I was on sale so I could have YouTube playing while I paint. My personal experience is skip this device. I have a Roku downstairs and I LOVE it, but this fire stick makes watching YouTube annoying. It not only triples the amount of commercial breaks but they make them unstoppable and much longer. I would NOT buy another one. I’ll go back to a dvd player and dvds if needed.(2 stars because it was easy to set up and it at least plays.)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Firestick","reviewDescription":"Works great!  Cut the chord","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Awesome","reviewDescription":"Bought one of these a while ago hooked it up at home went on vacation and forgot to bring it with me so bought another one for travel trailer. Get a lot of free TV well worth the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Easy set up","reviewDescription":"This was already connected to my Amazon account upon arrival, which may set up so easy love this so much!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Live my firesticks","reviewDescription":"I'm always watching something so a firestick or two always gets me through my day..","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Chulísimo","reviewDescription":"Ahora tengo muchas cosas que ver.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Perfect","reviewDescription":"We bought this to take to Florida so we could enjoy our programs! We also got one for our summer cabin!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"I have four","reviewDescription":"works well even in the garage","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great for older smart TV","reviewDescription":"Great for older smart TVs that do not support new downloads for streaming. Super easy to use, comes with step by step instruction. Also has the ablity to use QR codese to log into exixsting acccount thereby avoinding all that annoying clicking to type","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Good for turning an old TV into a Smart TV","reviewDescription":"Good for turning an old TV into a Smart TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Alexa","reviewDescription":"When I got this device I didn’t see the button for turn on or off I was really concerned but after maybe two weeks I get they you can turned on or off the tv with Alexa voice instruction this was amazing I don’t know if that can help son one for have a better experience with this device","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Right on time","reviewDescription":"I needed a new fire stick for my television and it came quickly and I liked the new simplicity of it and it works well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Cannot turn off sleep mode","reviewDescription":"Amazon FireTB LiteAlthough these were super easy to set up and very affordable, they didn’t work for my purpose. I purchased four of these units in hopes of running a constant channel display on my monitors, like the weather channel in a waiting room type scenario, but these will go to sleep after 20 minutes of streaming. I’ve searched everywhere on how to turn this feature off but, like the 80,000 other complaints about this unwanted feature, it can’t be turned off.Unless someone can help me turn this feature off, they will be returned.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"What’s missing?","reviewDescription":"There is no volume control or on\/off. Why? I still have to use another remote for just that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Good But","reviewDescription":"This is the second Fire Stick we've purchased. Never had a problem with the first one and installation was easy with both of them.  However, everytime we turn on our TV the new Fire Stick has to do an update.  Even updates if you've watched something earlier and turned off the TV.  The updates take anywhere from 5 min and up to an hour. Now we have to preplan and allow extra time for the updating. Not sure we will continue to use the Fire Stick!  Annoying!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Difficult to sync","reviewDescription":"This remote does not have a on\/off button…..  still having trouble syncing it to the Firestick, ordered as a set.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Can not install apps","reviewDescription":"I was trying to download some apps from App Store but couldn’t","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Lacking features","reviewDescription":"Remote Doesn’t control tv. Past generations always did. Downgrade in functionality. Boo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Had to return","reviewDescription":"Could not get it to work. Went with on which did work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"It’s a fine product, but there are no volume buttons","reviewDescription":"Keep your tv remote this model does not have volume or power buttons","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"People need to look closer to what they are buying.","reviewDescription":"I did not realize this fire stick does not have volume control nor does it have a power on control. I have to use my tv to make this work.Would not recommend this at all. Very inconvenient.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Works well","reviewDescription":"After securing good Internet signal, we were ready to watch more variety of shows. Firestick was economicalpromptly delivered, easy to set up and user friendly. I especially like the ability to search using voice commands. One slight complaint is that there are frequent updates that delay any TV connection. Although most delays are 1-2 minutes as promised, I find it frustrating when they last 5+ minutes.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Gets the job done","reviewDescription":"What can I say. It works. May be just me but at first it only had limited apps. Then one day it changed..I think.. then had multiple apps to choose from than at first. Had to delete everything I really didn't want to make room for other apps so I'm not so sure it has a lot of storage memory. It's for an outdoor tv and stays outside under plenty of cover. I don't know if it was the cool temps but a couple of times it seemed the remote wasn't responding. It's the lite version of sticks so maybe that is a part of any limitations but again it was for outside only which is limited viewing. For the black Friday sale price it was worth it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"It works but","reviewDescription":"It works well but i have the 4K version in my living room that I like a lot better. The lite doesn't have volume buttons like the 4K does, I wish I had just paid the extra for those when I bought 2 of these for my bedroom and my daughters bedroom . The 4K version is more convenient for me to use, with the lite in have to keep 2 remotes close instead of just 1.u","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Best decision ever!","reviewDescription":"I’m so glad I made this purchase. It has allowed me to begin using my older model tv which is quite bigger than my new model tv, so I’m thrilled about that!The only downfall just seems to be that I constantly run out of storage, but it’s not the worst thing that could happen!Also, would rather have a power button or restart button on the remote to be able to restart it for a refresh rather than needing to dig through the settings to restart it.Otherwise, it’s a great purchase and would totally recommend!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"good deal","reviewDescription":"at less than $20 i had to buy it. couldnt freevee or espn to the miracast; this is more like a super cable box. and still be able to cast from phone.once set up, runs fine on tv usb until it (updates?) then reboots 3 or 4 times. settings adjustments seem to be scattered among the stick itself, the amazon app, and amazon online. took a while to find where to change the name the world sees. still stuck with b\/w captions in freevee and only use voice for the time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Warning for wall mounted TVs","reviewDescription":"The stick is great, the apps are great, setup is simple.  The USB\/Outlet power port REQUIRES AT LEAST THREE INCHES OF CLEARANCE from the outlet.  Super stupid.  If your TV is wall mounted and your outlet is hidden behind your TV you will also need to purchase (if you don't already own) a thin \/ flat \/ low profile USB\/Outlet charger.  My Kindle came with one, so I don't understand why the Firestick bundle is so much less intelligent.  It is also a shame that I can't plug it into the USB port on the TV to draw power.  That is dumb on the TV engineering side.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Slow","reviewDescription":"Find it running very slow compared to my regular fire stick that isn’t a lite. I don’t have too much on the stick so idk why it’s running so slow my internet is pretty fast","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Easy to install","reviewDescription":"I have had several fire stick through the years and they work great but have to purchase new ones to update not liking this !","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Works great. Remote is lite.","reviewDescription":"Works great. Remote lacks power, mute or volume controls. Was able to match old Fire remote to new Fire TV easily","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Works great","reviewDescription":"does just what it advertised!my sony was just short amazon recognition app so this cures it and i can take to use on most tvs that are not smart enough....brilliant!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Works great","reviewDescription":"My son bought it and works well for him","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Great alternative to expensive Cable.","reviewDescription":"All around great product for what we need!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Fire stick","reviewDescription":"Works as planned no issue with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"All Good","reviewDescription":"Easy setup and works like a charm.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Great gift","reviewDescription":"I use mine all the time. I gave them as gifts for Christmas. Everyone loves them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Lo que ocupaba para para mi nieta","reviewDescription":"Para la televisión que mira mi nieta","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great Product At A Great Price","reviewDescription":"I like this product, I bought one several years ago and it went out so i had to buy another one. The one I ordered is more up to date than my old was and I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Really good","reviewDescription":"I like these new fire stick control has more storage space and I can store more apps","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Recommend it!","reviewDescription":"I like the speed of this newer firestick versus the older version of firesticks. Totally recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Bueno","reviewDescription":"Era lo que necesitabamosFunciona muy bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Perfect","reviewDescription":"Makes our TV a smart tv. The only thing is the cord is a little short. You have to purchase membership to netflix, hulu, ect. but still it’s nice to ha e","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"A little tricky with my older Visio TV, but FAST!","reviewDescription":"Just upgraded to this from a first generation FireTV Stick that could no longer handle all of the software updates that Amazon has been pushing recently. I love the speed of the new stick, but almost wasted $300-400 on a new television set because of a weird compatibility issue with my older Visio TV. Problem is now solved and I'll summarize it below in case it helps anyone else.My new stick worked fine for almost a week. Then, in the middle of watching a show, my screen would start to dim and then ultimately fade out completely, leaving the audio still playing. At some point the video would come back, usually within ten minutes. Then after a while it would happen again. I first blamed the new stick, and tried rebooting it, powering off and rebooting, switching it from wi-fi to wired Ethernet connection - nothing worked. Then I switched over to my old Apple TV device just to make sure the problem wasn't my 10-year-old television. To my horror, I was getting video dropout on the Apple TV too.Before pulling the trigger on a new TV purchase, I decided to try one more time to find an answer through an internet search. Thank goodness I came across a forum post from 2014 in which someone had to disable their Vizio television's Backlight Control and Advanced Adaptive Luma settings because they were getting screen fadeouts when they hooked up their new Xbox. As soon as I disabled those two functions, my new FireTV Stick Lite started working again. I can't imagine why I didn't run into this problem the first week I was using it, and what changed that also affected my Apple TV. Will update this review if the situation changes.My only other annoyance is the Bluetooth audio connection. I have an Oontz Angle external speaker that was paired to my first-gen FireTV stick, and would automatically reconnect itself when I turned it on. My speaker easily paired with the new FireTV Stick Lite, but it won't reconnect when the stick goes to sleep and is then woken up. I have to manually unpair and re-pair it each time I watch TV. So far my browsing suggests this is because the new stick's Bluetooth audio setting may be \"off\" by default. If that's the case, I'd like to know how to change the default setting.","isVerified":true,"ratingScore":4,"reviewReaction":"76 people found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Amazing!","reviewDescription":"I bought one of the first smart tvs, and now find that much of the content on the many streaming services I pay for cannot be “viewed on this device”. I assumed I would have to invest in a new smart tv, which I was reluctant to do. Our electronics have become ‘use and toss’ due to constant upgrades. I’d heard for years about Roku and then Fire stick, but didn’t really understand what it was all about. Luckily I found an article and after reading decided to give the Firestick a try, since if it didn’t work, I wouldn’t be out much. I am happy to report I can now watch everything. It’s truly amazing! With just this little low cost attachment, my tv is new again. I am thrilled! I even bought a Roku for my other tv to see which one works best. Each has different pluses and minuses. Regarding the Firestick, I love the remote. It is small and slim and fits in my hand and easy to use. Love the big button. I like the on screen layout as well, but strangely, it doesn’t always work quite right. Now and then a show I am currently watching will not show up when I select the service. For instance, every time I want to watch an episode of “1923” I have to search for it, rather than it appearing under “Continue Watching.” Other than that, it works great. Another plus for this particular package, is it came with an HDMI extender, which is handy, since the sticks themselves can be about 3.5 inches long, if your HDMI is in a tight place you will need one. The Roku cost more and did not include an extender.","isVerified":true,"ratingScore":4,"reviewReaction":"38 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Not as many apps as i expected","reviewDescription":"Once I figured it out it was pretty easy to set up. I just noticed that a few apps were missing that I have on my other ones. But I'm sure I'll find those eventually. Customer service was great. When there was something missing from my settings they immediately answered and assisted me to get it fixed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Third One","reviewDescription":"I love this firestick although the updates seem to brick them and they hang at the logo screen for days... Then I buy a new one 🙄","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Great add on","reviewDescription":"Kids all have their own shows now","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"It works","reviewDescription":"I like it so far. Easy installation","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Perfect!","reviewDescription":"Works great!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Functionality iffy","reviewDescription":"It’s functioning oddly. Where sometimes it won’t perform the action I want. So, I have to take the battery cover off and roll the batteries to get it to wok.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Who doesn’t love a fire stick #3","reviewDescription":"I love my fire stick but wondering if there have been any recent recalls. Had to buy a 3rd as my recent replacement of a very old one quit working all of a sudden. Remote was faulty and I am certain we took good care of it. But  uying another because I use it so much🤷🏼‍♀️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"No volume control","reviewDescription":"If you only want one remote, do not purchase the Fire Stick Lite. There is no volume control with this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Volume Control?","reviewDescription":"I have 7 Firesticks. I LOVE them. Our entire house lives and dies by them. We have three Roku TV's and 2 Smart TV's and we just bypass all the built in software and use Firesticks on them all. I bought one of these for the TV in the garage, not realizing that it was the 'lite' version. It feels like a half baked product to me. No power button for the TV or volume control - and if I am corrected on this - then I would counter with - it is confusing and 'hidden' if they exist. I have been an I.T. guy for 30 years. I deal in virtual concepts and complicated networks, no reason I should be confused by a remote. Just go with the regular Firestick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Volume","reviewDescription":"how do you turn off the TV and has no  volume control button!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Looks to work as it should","reviewDescription":"Bought this so I could use Playon app and take advantage of both the playon server and the adskip function for my home library after Roku discontinued allowing the channel. Not the most user friendly when you're used to Roku, but works. Just gotta figure out how to remove\/hide the preloaded channels that I don't use.Update after 2 months:Had to revise to 2 stars. It works, but frequently freezes and I have to restart it before each use for it to work and usually have to restart after each episode or movie or it freezes. When running another streaming app on my Roku, no such problems. In all cases it is streaming from a local server on same network. Wired or wireless makes no difference","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664755200000}
{"reviewTitle":"Horrible Remote Battery Life","reviewDescription":"Great fire stick except the remote is hiring through batteries.  I have to replace them every 2-3 days!  I’ve tried several brands (including Amazon brand) and have had the same results.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Don't get hacked!","reviewDescription":"Be very careful when setting up your new Firestick. I mistakenly clicked on a link I thought was part of Amazon as it was connected to the Amazon site, but it turned our to be a fraudulent site and my credit card was compromised.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Can’t Get Volume to Turn Down","reviewDescription":"This fire stick worked great for about a year. We brought it with us on all of our trips and had no problem hooking it up to different tvs. Then one day the volume went to 100 and I couldn’t get it to turn down. When I switched it back to the tv the volume was low. When I put the fire stick in, it jumps to 100. Voice control tells me it cannot adjust volume (prob because I’m using a hotel tv and not my own). I googled how to adjust the volume, I’ve watched numerous YouTube videos and cannot get the volume below 100 when I plug in the fire stick. So now it is useless.Do Not Buy This! Pay the extra and get one that has a volume control button.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662768000000}
{"reviewTitle":"Does not compare to Roku","reviewDescription":"Had a problem over and over to connect the remote to my wifi. I redid and redid the batteries, the passwords etc. etc. Finally, not sure what I did but it connected to the remote. I had to redo the password to my internet a few times.I have a Roku and expected to get the same channels. I was wrong. I didn't see a place to check what was available on the Fire Stick so that is my fault. Having to get apps every time from Amazon was something you don't do with Roku.It was Prime deal and not worth returning. I will keep it and maybe someone can have it or use it on a TV that we don't use often.Not worth my time or effort setting up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657843200000}
{"reviewTitle":"It is so slow","reviewDescription":"The Firestick freezes and has to be reset every time we use it at least once. It restarts its self all the time also. Very slow","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Goes bad quick","reviewDescription":"I purchased 2 for 2 tvs, and they were great. One just went bad and not a year old. A little disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Amazon support helped to resolve HDR issue","reviewDescription":"After 1 week, Amazon customer support suggested to turn on the Ultra Deep Color setting on my LG 2020 model 65\" TV. After I followed this suggestion and tested the HDR, It now the HDR works. Now, im not sure why the audio from my soundbar is low...Updated review to 3 stars because of this and because it took almost 2 weeks to resolve the HDR issue....ORIGINAL REVIEW‐-------------This version(2023) of the 4k max is just as fast, but not any better than the previous. I have notice that some apps are slow to start-up. It has more storage, however, the (HDR)high dynamic range does not work while watching Netflix or Hulu, etc. This version seems to be a step backwards in terms of picture quality... It's disappointingthat Amazon releases these new devices with so much haste and without ensuring the quality of them. Not worth the $59.00 I paid for this firestick. I may return to my previous firestick 4k max until Amazon fixes the bugs. I recommend others to also wait until Amazon decides to fix the reported bugs....","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Worked as should","reviewDescription":"This fire stick didn’t have the hulu button. Need to depend on alexa to find it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Works as it should","reviewDescription":"No issues. Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"No volume button","reviewDescription":"Easy to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Good","reviewDescription":"Good item","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"I like it","reviewDescription":"I like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"No on\/off\/volumn","reviewDescription":"I love my firesticks …. I have 4. But, the newest one I ordered (a month ago) doesn’t have on\/off or volume. So we have to use the remote that came with the tv foe that","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Slow and jumps ahead but other than that ok","reviewDescription":"Ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Easy","reviewDescription":"Was easy to set up, I have it on tv in living room.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Conforme con el equipo","reviewDescription":"Funcionando correctamente","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"As expected","reviewDescription":"Haven't used yet but arrived on time, nicely packaged and ready to use. Came with🔋batteries,  the adapter, USB cable and hdmi extender cable. Don't believe you can control the volume. My last one worked with all my apps.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Ver you tube en tv","reviewDescription":"Lo estoy usando hace poco veremos ver más adelante su calidad con la voz se busca contenido","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Works as advertised","reviewDescription":"Does the job good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Fire stick","reviewDescription":"Didn't know it was refurbished, thought it was new!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Voice control works good","reviewDescription":"Using the remote to manually move through the apps seems a little slow but the voice control works really good. Simple commands work best “ resume Friends on Max” it will go right to it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"👍👍","reviewDescription":"👍 working fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Everything in box","reviewDescription":"Works very good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Very good","reviewDescription":"Very good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Not the fastest or smoothest","reviewDescription":"For the price it's really good. I think for whoever wants to buy a firestick should spend the extra on the better options.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Want the basics? Buy this","reviewDescription":"All the same features at the lowest price. Only thing I dislike is the remote doesn’t have a power button. But you can buy a fire stick remote that has one separately.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Easy to set up","reviewDescription":"The only thing I didn't like was that you can't control the TV with it, like turning it on and off. So you still need to use 2 remote controls. I have other Firesticks that have this feature, so I missed that this did not, until after I set it up.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Actualizado","reviewDescription":"Bastante veloz","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Great price","reviewDescription":"Product Quality was ok lookof item was too. Only thing was it didn't have up and down volume like the other one I had purchased.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Working great","reviewDescription":"Easy to install and no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Updated  Tv firestick","reviewDescription":"It’s was much easier to setup","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Quality","reviewDescription":"Ordered wrong fire stick remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"nice","reviewDescription":"siempre exelente y mas en ofertas","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Developer options now hidden but can still be accessed","reviewDescription":"Amazon has started to hide access to the Developer options but they are still availabe once you know how to access them.1. Go to Settings > My Fire tv > About2. Select the name of your Fire TV seven times in a row3. Exit Settings and then go back into them4. You should see Developer Options listed on the About screen","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"I have used this item for a week.","reviewDescription":"I have used this item for a week, but I didn't upload YouTube.com, I use browser for YouTube connection, and sometimes there is a slowly problem. Price is OK.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Fire stick remote","reviewDescription":"There is no button to turn the tv on","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Does screen size matter?","reviewDescription":"I have been an Android user for a long time, my car prompted me to get an IPhone.My RAV4 only has CarPlay so I was contemplating getting a new RAV4 with Android Auto in it. My wife remarked that it would be much cheaper to buy an IPhone than a new Car, it was NOT a suggestion.iPhones are expensive and SMALL, size was a major consideration, the IPhone 11 was GREAT but too SMALL. I now have an IPhone XS MAX, larger but still SMALL. We shall see.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"its slower","reviewDescription":"mostly my fault for being in a hurry and didn't realize it was the lite model. It works just fine but its slow. I have the model that has the volume control and its so much quicker and I got spoiled.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"No on\/off or volume control on the remote. I didn’t pay attention. Using the tv remote","reviewDescription":"Not really what was expected. My fault for not paying close attention","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Cannot register 2 accounts without a major hassle","reviewDescription":"Me and my wife both have Prime. We have both purchased separate subscriptions. However the Firestick is registered under mine preventing her from accessing her subscriptions. From what I can tell from the AMZ Forum, we have to go thru the time consuming process to deregister and re-register each time we want to switch.The AMZ forum is useless and is just and endless loop of signing in, re navigating to the forum and having to login in, preventing anyone from asking a question or leaving a reply.She can only access her paid content on her tablet.There is also no way to leave a channel on all night or all weekend. It will eventually go to sleep.The remote is quite small and awkward to use even after 2 monthsThe Firestick app and lack of support is not to the level as Amazon shopping. It actually is quite poor. I am writing here because of lack of support.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Fire stick","reviewDescription":"Every thing works like magic","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Works well, but (...).","reviewDescription":"Works well, but there is no volume control on the remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"works surprisingly well","reviewDescription":"Wasn't sure if this was going to be the solution to streaming but found it to be superior to many other apps that are built into TVs and VCRs.  It's faster and has a cleaner interface.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Bare bones","reviewDescription":"It does work, just wish it would control the volume for the tv too. You still need the other remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Much better than older versions","reviewDescription":"Works like a champ","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Excelente","reviewDescription":"Entrega exacta.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Excelente producto","reviewDescription":"Muy satisfecho, me encanta.Últimamente ha sido casi imposible crear una cuenta Amazon nueva porque pide un código por sms que nunca llega.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"No volume control","reviewDescription":"I have other sticks, that have a volume control, this one doesn’t. It could be the generation, it just requires multiple remotes to use the tv, minor issue, but you asked for my opinion","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Good product","reviewDescription":"Easy to set up works well occasionally stop working as give wrong commands instructions easy to understand","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Very good, but...","reviewDescription":"I have two fire sticks, each used on a quality Samsung TV.  In recent months I've had the same problem with both:  When viewing a movie on Prime, the subtitles run 20 seconds ahead of the action.  It does not occur on any other streaming service.  I have tried every possible way to get help with this, and the automated answers, or simple googling has done no good whatsoever.  If you need a real human to help with a problem, you are out of luck.  I can still watch prime properly on my with my Comcast Xfinity remote, but it's not without other issues.  SO---  I love my firesticks except for this problem which only started occurring in the last couple of months.  It would be nice if a real human would read this and get back to me.","isVerified":true,"ratingScore":4,"reviewReaction":"32 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Dumb remote","reviewDescription":"The remote has no volume button or power button. I have to use an old remote for those functions","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Fire stick","reviewDescription":"This is a great product. But wish it had voice control. If I could order a new changer for it  I would give a 5 star","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Fire Stick","reviewDescription":"Very slow.  No on\/off button.  Have Fire Stick 4k which works great...wish I would have gotten another one instead of what I got.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Did the job.","reviewDescription":"Only reason I didn't give a 5-star rating is because Amazon will not let me download Spectrum TV App and I had to switch to Roku so I could stream my local channels.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"There is no power button like the other ones have","reviewDescription":"So just beware, I just was the information that it is not on this one but the Fire TV Stick 3rd generation,,,,it is more so I am too cheap to buy another one,,,,,so 2 remotes for me","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Firestick Upgrade","reviewDescription":"I am enjoying my new Firestick. I was able upload previous channels & apps. I have more memory. And. I have some new apps thanks to the additional memory. SD3","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Not what I expected","reviewDescription":"I purchased expecting the voice command would work for my blind mother but it's very limited and isn't useful for the blind.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Prime went out after a few weeks. Waiting on a replacement.","reviewDescription":"Enjoyed it while it worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"no volume or on\/off controls.","reviewDescription":"no volume or on\/off controls.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Quit working after 2 months","reviewDescription":"This was a replacement after my 1st Fire stick quit working, it was 4 years old. Thought that it would last longer. So I purchased the fire stick lite, 2 months later it died, guessing they are just throw a ways. Very concerned on purchasing another, will I be just throwing away another Fire stick along with my money?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679097600000}
{"reviewTitle":"No Volume Control! Seriously??","reviewDescription":"I was so excited to get this great Prime Day deal for a tv we don’t use often but when we do the fire stick we have requires the tv remote for on, off, and volume. NEVER thought to see if this newer one had Volume. Description does say you don’t need your tv remote. Easy peasy! Right? Not if you want to change the volume. I just can’t believe it. No where on the box or description does it say this. Seems kinda important to me… so, it’s going back as fast as I got it…. Guess I have to pay the big bucks now for this tv. Egh! Just disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Need a separate remote to control TV","reviewDescription":"Kinda ridiculous that I have to have a separate remote to turn my TV on and off and control the volume. My Tv remote broke which is why I bought the Fire Stick a few years back so I’d have to go out an buy a universal remote just to get everything to work. Currently using an older Fire remote that has volume and a power button with my new purchase just so I don’t have to buy a remote for my TV. Plus the last thing I want is another remote laying around the house.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670112000000}
{"reviewTitle":"Firestick","reviewDescription":"Great timing but this Firestick does not have the up\/down volume button on remote. You may have to use remote that came with TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"Remote issues","reviewDescription":"Remote did not work right out of the box.  Did all the battery swapping, remote resetting and all the other leaps and bounds to try and get it to work and it still would not pair.  Sending it back just to see if the first one was just a dud.  If second one has issues that will go back also and that will be the last fire stick I buy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674604800000}
{"reviewTitle":"There is NO power button or volume button.","reviewDescription":"This was for a family member, she wants 1 remote to use. There was no volume or power button. She was not please with this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688515200000}
{"reviewTitle":"No Memory","reviewDescription":"Only buy this if you don't us a lot of apps.  It has very little memory and it with only 8 apps on it it is completely used up.  I can't even update Netflix due to memory requirements.  This does not have a volume control either and no power button.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677715200000}
{"reviewTitle":"Great…except…No volume buttons.","reviewDescription":"Received this new fire-stick within 24 hours of placing the order. Set was easy, be sure to have your cell phone with you. The ONLY complaint I have is there are no volume buttons! Seriously, in 2023! Our old stick had the volume capabilities. As you see in the photo there are quick access buttons for four popular apps. Those are easy to find in the home button. I am unhappy about the zero ability to control the volume from one remote.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1684540800000}
{"reviewTitle":"The Lite is “Okay”","reviewDescription":"I honestly didn’t recognize this difference between the Lite Firestick and regular one until after I installed these. I purchased 2 for my mother, who has older TVs.. the Lite doe NOT have a power button.. so if she’s watching tv in bed, she will have to either “ask Alexa to Turn it off” through voice or get out of bed and do it manually.. since she doesn’t have a remote control for the tv. The other problem is that the voice control only works on 1 of the two TV’s, so she has to manually turn off the other one each time. Ironically, they both power on by hitting the center button.. but does not power off. This was an oversight with selecting the Lite over the regular one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"It's great for the garage","reviewDescription":"After having used the Fire TV Stick Lite, free and live TV, Alexa Voice Remote Lite, smart home controls, and HD streaming for a while now, I can confidently say that this product is worth its price. While it does not have perfect sync with Alexa on voice commands as I initially thought when giving it four stars out of five, the lack of perfect sync is mitigated by the fact that it has a good app which works well with the TV Fire Stick. On top of that, its small size and ease of use make it worth every penny. I highly recommend this product for anyone looking for quality streaming at an affordable price. It really is a great bargain!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"It needs to have a remote button to turn on and off","reviewDescription":"Okay but needs a remote button to turn on and off other words you have to use your TV remote","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"This remote sucks","reviewDescription":"The firestick on my television is working great but i dont know who made these remotes. Its missing the volume and on\/off buttons.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Get the fire max when its on offer.","reviewDescription":"I got this to use for vpn. However its very slow and if it like that out of the box its only gonna get worse. So i returned it and got the fire max which was on offer and only $5 more than this at normal price. They are on offer all the time. Ive had no issues with the fire max. Its fast and reliable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679961600000}
{"reviewTitle":"Product is great! Amazon pricing all over","reviewDescription":"Product is amazing.  Bought it wanted to make sure it worked before I bought for all my TV's.  Went to buy 3 more and price doubled.  AMAZON WOULD NOT HONOR THE PRICE 3 DAYS LATER, 2 OF WHICH WAS DELIVERY!!!Voice remote works fine just dont think it will integrate with any apps other than Amazon only.  This isn't an Amazon issue but just dont think it will work on anything but Amazon specific products.  It would be nice if they would partner up with a TV streaming platform.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"could not make it work on a lap top","reviewDescription":"could not make it work on a lap top","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Easy install","reviewDescription":"Doesn’t get very loud","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Remote stopped working","reviewDescription":"Like less than a 2 months after I got it. I tried all the trouble shooting bs they posted but end up just letting my son use his phone for it in his room but it still works sooo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683676800000}
{"reviewTitle":"Suggest you pay a little more and get the one with volume control","reviewDescription":"Used this product to hook to my projector enjoy it but suggest the one that has volume control unless you can keep up with various remotes","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Works Great with My Vizio Smart TV","reviewDescription":"I have a new 4K 50\" Vizio Smart TV in our bedroom that has an Ethernet connection to my home network where I have a large collection of stored media (music and videos).  I had hoped the Vizio would have a built in DLNA\/UpNP client that would directly stream movies or videos using one of the Vizio apps, but Vizio does not have this type of app.  (I can make it work if I use a mobile device and it mirror it to the Vizio, but that is a hassle.)  My easy and inexpensive solution was to purchase this least expensive lite version Fire TV Stick and it works fine.  I also purchased Amazon's inexpensive Ethernet adapter for the stick.  While this lite version lacks some Alexa functionality (like other device control which I do not need for this application), I use the same DLNA\/UpNP client media player apps as my other Alexa devices (VLC player, Nova player, Synology DS Video, etc.).","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Love my Firestick!","reviewDescription":"Works like a charm with all my streaming services!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Christmas Gift","reviewDescription":"Bought this for my aunt at Christmas and she loves it. She's enjoying it so much that she plans to buy another one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Love it.","reviewDescription":"My 78 yr old husband even learned how to use it. And he doesn't like learning things like this. Totally recommend getting one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Ordered for a friend","reviewDescription":"He's happy with it, he lives in assisted living and now he can get more to watch.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"perfectos para el streaming","reviewDescription":"¡¡¡La calidad y precio son perfectos, los recomiendo!! pronto comprare la versión normal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Es muy bueno  se vez nítidos","reviewDescription":"Puedo ver todo atrave  de la tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Firesticks","reviewDescription":"Soon ro be cable free I hope. Like the way it works but have to learn it perfectly. Will keep you updated.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Amazing!","reviewDescription":"Loved it, well definitely buy another one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Buy the more expensive one","reviewDescription":"I thought heck why would I buy a more expensive fire stick when this does the same thing? It doesn’t. It crashes all the time, the remote works about have the time and the delay is insane. Just skip it and stop being cheap.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Closed caption doesn't sync with dialogue","reviewDescription":"I was replacing another brand of streaming stick with the Firestick and am very unhappy with the product. First, there is no volume button on the remote and the sound fluctuates so you have to use another remote and constantly get the sound level correct.I am in my middle 80s so need to have closed caption but the Firestick closed caption lags behind the dialogue. I am thinking of returning the product and purchasing the brand I had previously used.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Set up","reviewDescription":"2 of the 4 will not connect,was working for short period, now not working at all. Waiting for response from tech support","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"No HBO","reviewDescription":"It doesn't work with HBO. First I had to pay another subscription for MAX in order to download the app (even though I already had an HBO Max account). I decided to pay it anyways because the point of buying the firestick was to be able to stream HBO (I dont use netflix)... Once the app was downloaded it didn't work. I tried reinstalling and other tips I found on google and I still can't stream Max\/HBO Max.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"You get what you pay for","reviewDescription":"I am too used to having the functionality of the 4k and 4k max versions of the fire stick.  The lite version is just that. You cannot control your television with it, is my biggest complaint. I guess if you don't mind using two different remotes to watch television it's okay. But for me I will be returning them and coughing up a bit more for the 4k fire stick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Disappointed","reviewDescription":"Remote stopped working after 2 weeks. Didn’t drop or spill anything on it , even tried switching batteries.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Slow and glitchy","reviewDescription":"I would recommend purchasing a higher tier fire stick or just getting a Roku. Purchased this for occasional use watching YouTube when I can’t sleep. I’ve had it for a year. I’ve used it maybe 30 times. The last 3 days the YouTube app has been frozen when I open it. I uninstalled the app and reinstalled it. Signed in to my account and now it won’t play the video I selected. Tired of messing with it. Shouldn’t be difficult to play a simple YouTube video in 2023. I had similar issues with my last fire stick but at least it took 4 years last time.  not less than 1. Probably going to try a Roku","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"volume control","reviewDescription":"i am disappointed that it did not have volume control for the cost it was!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Buffers constantly","reviewDescription":"Not good for streaming which is the only reason I bought it. Clearing the cache on your apps to makes room to limit buffering but it’s extremely inconvenient. Otherwise it’s very easy to install and use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Terrible device","reviewDescription":"This thing barely functions. The UI is awful. I have used or owned many of the competitors and this is definitely the worst. It can barely handle pressing backwards if you are watching a show. The Alexa function works roughly 25% of the time. It is super cheap so if you have an extra TV that is used very infrequently, it could suffice.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Remote stopped working","reviewDescription":"Remote stopped working have tried changing the batteries 4 times no different","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Remote","reviewDescription":"Hate that the remote doesn’t have volume control!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Did NOT work.","reviewDescription":"had trouble connecting to internet, kept doing a boot loop, then kept trying to update, now it will not power on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Remote stopped working very early","reviewDescription":"Remote stopped working after a week.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"No todas las aplicaciones funcionan","reviewDescription":"Dice que tiene acceso a HBO MAX y cuando lo vas a descargar dice que no está disponible","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"No power or volume control","reviewDescription":"If I knew there was no volume or power control on Firestick Lite, I would NOT have ordered it.  Very disappointing, as this was a replacement for my old Firestick.  Just assumed volume and power would be obvious features.  Love Amazon, but this sucks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Better Than Roku","reviewDescription":"After realizing I had the batteries in backward (it's very difficult to see the labeling) which caused the languages to keep scrolling; after reversing the batteries I was able to set the language. The pairing with my router went much better than the Roku I returned the previous week. The reason I returned this Fire Stick was I couldn't get it to accept my Amazon password, which I know was correct  because I logged into my Amazon account using my laptop entering the same p\/w.  Roku has no support other than an artifical intelligence question and answer tab. From my experience with the Amazon Fire Stick it wasn't much better; I didn't find an 800 number readily available for either the Roku Express or the Amazon Fire Stick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676246400000}
{"reviewTitle":"It’s not what it suspected be","reviewDescription":"I’m kinda like it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Bad!","reviewDescription":"The remote doesn’t work. I have changed batteries and it just doesn’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"New fire stick is MUCH more balky than the one I was forced to replace.","reviewDescription":"The previous fire stick was doing fine until I was forced to replace it (planned obsolescence?) The new one is balky. Buffers often. Refuses to stream music.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Pretty alright","reviewDescription":"It's pretty alright. I don't like that you can't control the volume with it but I didn't want to spend $50 on the 4K one. I already have the 4K one for my bedroom and neither is a 4K TV","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Wrong One","reviewDescription":"I didn’t realize I bought this low of quality one when I purchased. It doesn’t control the volume which makes it useless for my needs. Wish I’d noticed but that’s my fault","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Worse than the First","reviewDescription":"Recently the Fire Stick made an upgrade.The original worked well, but the upgrade is a mess.There are frequent buffeting issues.Cannot pause when viewing programs live, cannot forward or reverse.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"But the normal version not lite","reviewDescription":"Would pay the more and not get the lite.  I dislike the no volume button like the rest of my firestick.  Luckily this one is for backyard so it’ll do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Compré 2 y uno vino dañado. No enciende","reviewDescription":"Compré dos, uno vino dañado. No puedo devolverlo porque fue enviado a Panamá y sale más caro solicitar un cambio o devolucion por el precio de envío Panamá - Florida","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Not a fan of lite","reviewDescription":"I should have just gone with the regular fire stick. This one doesn't contr the TV so you need 2 remotes which is annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"No volume button","reviewDescription":"Don’t like at all I can’t return now, no volume button no back to previous channel, don’t really do much","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"No universal remote.","reviewDescription":"I bought this mostly because I thought it had tv controls. Unfortunately this model doesn’t have them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Looking to upgrade","reviewDescription":"I was looking to upgrade. It did not work. There seems to be an issue with the Sony Brava TV. It updated the software and has not worked since. I have followed all of the instructions and recommendations, and it is still not working with the tv. I have searched the internet for the answer with no luck. I will hold on to it for the day when I purchase a new tv and try again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Slow","reviewDescription":"Works and is not expensive but very slow to respond.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Everything u need!","reviewDescription":"Even came with everything you need to set up even the batteries for the remote and charger for it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Fire stick Lite for 1080 HD TVs","reviewDescription":"Fire stick Lite works with older 1080 HD just as Fire stick and Fire Cube work with 4K TVs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"New fire stick.","reviewDescription":"I'm so happy with the results of being able to watch any Chanel with my tv fire stick. No more cable! 100% recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Very different","reviewDescription":"I mainly have Rokus in my home but this is my first fire stick!! It took a little time to figure it out but definitely worth it I love it more than the roku","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Smart.","reviewDescription":"Este producto como todo lo que he comprado de la marca Amazon es muy bueno. Nos ha ayudado a lograr usar nuestra TV. De manera inteligente y para no tener que desecharla.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Bought it for our tv","reviewDescription":"I canceled the cable for my TV and got the fire stick to be able to use it for all of my subscriptions. I get Amazon prime Netflix, Hulu obviously I have to pay but it’s nice to have it all in one place and other options as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Me encanta","reviewDescription":"Buenas condiciones es la tercera ves que lo compro y estoy muy feliz con este producto 🥰","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Firestick","reviewDescription":"It works perfectly. I love it. No bad reviews on this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Pedido Fire Stick TV","reviewDescription":"Mi Fire Stick llego don ningún problema ni atraso, muchas gracias.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Amazing","reviewDescription":"I like how u can find almonds of things to watch","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Barato y útil","reviewDescription":"Funciona bien, no es tan rápido como los modelos más caros, pero cumple con su cometido","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Easy to install 1","reviewDescription":"Love the variety of movies and the old programs are fun to watch easy use last one lasted 10 years","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Issues","reviewDescription":"I can't say that I'm having issues except for my own network connection. My wi-fi is a bit unreliable sometimes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"¡Encantada!","reviewDescription":"Hace unos días me compre un proyector sin darme cuenta que le faltaba un cable, buscándolo encontré este producto, la instalación es la cosa más fácil del mundo, solo lo sacas de la caja y lo conectar a la entrada HDMI, trae para muchos idiomas, y el resto es solo descargar las aplicaciones que ya están previamente descargadas, solo necesitan actualizarse.Me ha gustado mucho, la pantalla principal es como si tuvieras cable de pago o tv de paga, muchas aplicaciones como Netflix, Youtube, Disney, las puedes usar con esto, yo estoy fascinada.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"I love it!!","reviewDescription":"Opened a whole new 🌎 for us. So many options and free. I had Amazon Prime but it took so long to load and shut off mid show and we'd have to reopen it. This Firesick makes Prime come up quick and easy, no more issues. Now I have HULU too on my TV which I couldn't download that app before.All you need is an outlet to plug in, that's it. Then an HDMI 1 or 2 or 3 on the back of your TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"nice for streaming","reviewDescription":"bought to use with our outdoor projector.  Easy to use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Excelente producto","reviewDescription":"Se conecta fácilmente con Alexa y solicitar la búsqueda.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Firestick","reviewDescription":"This is just what I needed to cut cable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Ms","reviewDescription":"Best item I could have bought for my tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Great for streaming","reviewDescription":"Works well once set up. Good for TV or computer","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Very slow to respond vs Roku","reviewDescription":"Wanted to try this vs all the Roku devises I have.  Had an original first generation stick that I replaced with this. The interface is ok, but the problem I have is just how sloooooow this thing is.  Switching on the Roku is fast compared to this.  Maybe its because its a basic model and not advanced.  I would not buy again, stick with Roku","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"No sound","reviewDescription":"No volume control button.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Lags a bit","reviewDescription":"I have great internet (5g Xfinity) and the stick tends to lag more often than not. I eliminated any useless apps I could and even then the remote tends to lag a bit. Would have been nice if there was a volume button too, but I do like how I can power the TV on and off with my Alexa echo dot.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Faster than old one. Know what you're buying.","reviewDescription":"I was forced to buy a new Firestick because the old one told me it would no longer support an app I use. I find that ridiculous but what am I going to do? Seems like they could update it, but instead would rather sell you a new one.That said, Amazon DID give me a discount on a new one even though the old Firestick told me I was eligible for a free new one.I WILL say the new one operates much faster. The old one's I have are really sluggish and have a lag after a click.Be sure you know what you are buying. In the situation where I was on the phone with Amazon about this, I didn't know the remote for this didn't have a volume control. I would have bought the next stick up with volume control had I realized that. It is what it is, and this particular stick doesn't get used much anyway.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Broke on original update","reviewDescription":"***Edit*** Amazon sent me a replacement and it works great.Plugged it in, set up remote and update started. Screen went black mid update and after giving it some time, trying it on different TVs, and different plugs(from original fire sticks) reached out to support and they deemed it broken. They are sending me a new one. Hopefully it works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Deceiving","reviewDescription":"The remote looks as is but has volume capabilities, but it doesn’t so basically it’s worthless to me because I have to use two remotes now","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Cheaper Alternative","reviewDescription":"The specs are good; however spend the extra bucks to get the volume with the same controller so you don't need the TV remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Powered from TV USB slot","reviewDescription":"I have some reservations about this product.  It intermittently takes a very long time to boot or gets stuck at the login screen. I have tried to power it from an independent AC receptacle and the problem remains.  I have two of these and they both exhibit the same problem.  To be able to watch what I want, I will switch to the Smart  TV's Andriod function for a while and then return to the Fire Stick.  It also takes a very long time to log onto HULU but that may be a HULU problem.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"El control remoto de este dispositivo no tiene los botones de subir y bajar el volumen.","reviewDescription":"No me agradó de este dispositivo que el control remoto no tiene los botones de subir y bajar el volumen.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"does not let you use Dish anywhere","reviewDescription":"rasy to set up but will mot let u add or use dish anywhere or other apps","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"It doesn't work and Amazon CS couldn't care less","reviewDescription":"The stick has a few apps glitched (I can download them but they don't open or give error) and the Alexa feature is faulty since I got it. I contacted Amazon customer support and I kid you not, they had me literally 8 hours, a full work shift, talking with 9 different agents and not even one of them offered a solution. They treated me as if I was dumb implying I didn't know how to use the thing, and never recognized the item is faulty. Buy it at your own risk knowing they don't give a fudge if your device works or not. They only made me lose my money and way more important, my precious time. A FULL WORK SHIFT FOR CHRIST SAKE!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Horrible device and slow","reviewDescription":"Firetv 4K - First off, the ‘Live TV’ channels for not match up with the app channels. IE there are only 66 Pluto TV Channels listed in the ‘Live TV’, even though there are 150+ on Pluto TV. Second, there is no audio on about half of the Freevee channels when using the ‘Live TV’ to, yet when switching directly to the app, ALL channels have audio. This has been happening for over three weeks channels and I tried deleting data and cache, and even totally uninstalling\/reinstalling the Pluto app without success in restoring all the channels. So six times, I called Amazon support, oh what a waste of 5+ hrs of my time. The biggest issue was finding someone that could understand English enough to craps the issue. Then my not being able to understand them. WOW.  Six calls and not one was close to being fluent in English. But one of them was very fluent in Hindi (or some Indian language) and on two occasions started speaking in it. I could deal with it if this fixed the issue, but not even close. One tier 2 support said that he was opening a support ticket with the developers and it would be fixed in 24 days. That was 9 days ago. After I called the sixth time, Amazon said that they would replace the two FireTV sticks. Got the replacements in today, and guess what? Exact  issue with the news ones. So Googled the issue and see notes from December 21, 2019 (3 years ago) with the EXACT same issue and still no respo0nce from Amazon. Pathetic!Also, I have to restart the device 2 out of three times I turn it on.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Sluggish, glitchy, and ad-ridden. All because I didn't need 4k.","reviewDescription":"This is the slowest and buggiest smart tv device I have ever used. Frankly it's more unstable than a cheap built-in Roku tv. At first I thought this was because I had the USB plugged into the tv, but after switching to a dedicated brick outlet nothing has changed. To my understanding the Lite also has more ads than the regular Fire stick, but dang is it bad. Only buy this if you're okay with seeing near-full screen ads on the home menu and screensavers constantly. Roku feels like it has an adblocker in comparison. I do not have a 4k tv, so I bought this thinking the only drawback was the resolution. But no, I have to put up with terrible performance, constant crashes and glitches, and endless ads for it. If I could still get a refund on this I would have.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"complicated with no reason","reviewDescription":"Infinite number of viewing selection renders this device unusable. UX is complicated and non-intuitive. Lacks ability of connecting to local TV programming without additional digital antenna - just the news.Comparing to basic Roku this device is way inferior in usability. Requires Amazon account login where your activity is definitely tracked. All privacy options are set to \"share\" by default. Unless proactively reset, your data is shared (probably shared anyways). Popular Apps have to be added manually and it takes very long time. This is not \"turn on and use right away\" type of a device. Basic Roku is much easier for seniors.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"The remote doesn’t EVER pair or work, don’t bother","reviewDescription":"HONEST REVIEW: The product came on time for delivery. AND, the fire stick itself works like a charm, BUT the actually remote to the stick does not work. I tried to even use my own batteries rather than the ones given, in case that was the issue. Still doesn’t work…. After almost an hour of frustratingly trying to get this to pair, I attempted to reach out to the seller to see if they could send me a replacement remote... BUT, COME TO FIND OUT there is only a return option on this item which doesn’t really do me much good at all. I guess I will need to just go out and purchase a whole new remote too. But when I think about doing that, I figure I might as well just send the whole thing back. I’m super disappointed in this product.I don’t recommend buying this from a seller on Amazon. Unless your cool with paying full price for this, then possibly spending more money on a replacement fire stick remote.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"This thing sucks so much","reviewDescription":"I never write reviews but I hate this thing so much. Got this fire stick because my tv isn't a smart tv, and you can't chromecast AppleTV+. This fire stick sucks. It's so incredibly slow to load. And even if it weren't loading at a glacial pace, you need to scroll past 5 different Amazon branded recommendations on the homepage to get to your apps. And because the interface is so slow scrolling past all these recommendations takes 5 minutes. The apps (particularly Hulu) crash all the time in the middle of an episode. The voice recognition is kind of cool, but it can't bypass selecting the profile in an app so it doesn't actually save any time, you have to wait for the slow ass interface to load anyway.Save your money. Get a Roku plug in instead.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Always needs updating!","reviewDescription":"Don’t waste your money, buy a Roku. This device always needs updating. I’ve never gone to use it and the device itself or the app needs updating. My Roku never does this. It also is always optimizing storage, which says can take up to 10 min. But it takes hours as it acts like it is finished and then just restarts optimizing again. I have nothing good to say about the fire stick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"No volume control!!! no stars","reviewDescription":"You have to scroll past  the buy now and add to cart buttons to be informed that the device does not have a volume button! What a waste of my time. Why even produce this device? If I’m missing something here , please let me know!  BUYER BEWARE. Only option for me is to return and reorder one that has a volume control, or makes me think I should opt out of Amazon all together. We have 3 tvs with fire sticks and we have 4 Alexa devices.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"New Firestick replacement Does NOT work with DishAnywhere APP","reviewDescription":"We had 4 Fire sticks that we used for years primarily to use with DishAnywhere on TVs in the US and the UK.  Worked brilliantly.  Then Dish decided to “upgrade their DishAnywhere App”. They only would offer a replacement for one.  I received this Firestick Lite and it would work somewhat on live TV but absolutely would not work in playback of DVR.  It goes into endless spin on the screen then the screen goes black and locks up.  Amazon was very good and replaced the first one.  The second one does the same thing.  Talks with Dish is that they have no idea when they will get this fixed.  By the way, streaming Netflix movies or Prime Movies works fine.  Download speed from the home internet is 49mb\/s.  So, don’t bother at the moment Firesticks won’t work for DishAnywhere and I have no idea what to do about watching TV.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Works good, setup instructions could be better","reviewDescription":"Almost returned, could not get to work.  I chose option to link to Prime account.  Does not tell you in setup instructions that a linked device must be turned on and connected to network for this to work.Update 12\/10\/2023;Got this for spare bedroom.  Decided to finish setup and enter passwords for streaming services.  Device not working again, just get a black screen.  I followed all of Amazon's troubleshooting procedures and nothing worked.  I got a defective device and Amazon did not offer me the option of a replacement.  I am forced to return.  I got this on a  Black Friday deal and am not happy with return only option.This is not the first time I have received defective Amazon devices, but it will be the last.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Remote is very low quality.","reviewDescription":"I have had this product since June.  The Fire Stick itself works fine.  Does what it is supposed to do when the remote works.  From day one the back of the remote did not stay on.  The back of the remote slid off all the time exposing the batteries.  We thought about duct taping it in place just because it was so annoying (we didn't).  Now the remote will not work fully.  Some buttons do not work no matter what we do.  We have changed the batteries several times just to make sure.  I would have liked the remote to last longer than 5 months.  Not sure what to do at this point.  I may have to purchase another fire stick if replacing the remote itself can't be done.  I ordered another one for a different TV last month before this remote stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Can get scammed when getting the Amazon fire stick programmed","reviewDescription":"We bought the Amazon’s fire stick to be able to display apps on and older 89 in tv.When we were following the instructions a screen came up offing a streaming service that we did not want. The only problem was you couldn’t move on without completing the screen. They wanted cc info but said it wouldn’t be charged at the time. You could needed to cancel within a week not to be charged. After I gave them the info unwilling the fire stick loaded fine.Then I went to cancel the streaming subscription service and it was no where to be found. I called Amazon and their rep said it was for a free app load and there would not be a charge. Today we got a call from the fraud alert on our phone and it for for a charge from this streaming service, which they denied. $49.95.We had to cancel the card and now we have to update all out normal auto charges with a new card.I am real disappointed with Amazon letting this happen on their fire stick applications and for not educating there people on what to do if they call in.The company that originated this makes it impossible to cancel this but of no accessBuyer Beware","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"Clunky connection and constantly disconnecting","reviewDescription":"I regret purchasing one of these instead of a Roku. I've never had an issue with the Roku I use for my other TV, and I bought this stick because it was on sale and I can see why. Frequently I try to navigate to an app on the fire stick, but it will take me to another app. It takes long time to register where the control says. And hulu doesn't work on it. Constantly crashing, and I've tried everything to clear cache and make it run smoother.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Does not have volume control or on\/off button","reviewDescription":"Wish I had known what “lite” meant before going through the set-up process. I’ve set up two previous versions with no problems but this one took me hours. And then to find out I have to use my TV remote as well? I would have spent the additional $10 or whatever to get the regular version but I’ve already spent too much time setting this one up to start over. Came close to throwing the remote at the TV by the end of the day. Read the fine print!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Slow","reviewDescription":"Slow response when using it. Takes forever to load apps and movies. My Roku runs faster than this. It I turn off the TV and turn it back on. The sound does not work. I have to reboot the TV like 10 times for it to work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Firestick","reviewDescription":"Bought this November 25th and it quit working today February 13th. I loved it till then , replaced batteries with new ones and still remote doesn't do anything not even Alexa , shame I really liked it when it worked","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"New update is horribly annoying","reviewDescription":"I’ve had fire sticks for years. Since this new one, as soon as I turn it on it automatically starts playing obnoxious ads from the featured Home Screen. Have to exit out of them before even using tv. Some of the ads are not child appropriate \/ rated R too! Kids in the room! Can’t figure out how to make it stop doing that.All else pretty good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Awful product…hangs and requires constant restarts","reviewDescription":"This is one of the most frustrating electronic products I have ever used in my life. I am 55 and have used a lot of them.  I literally have to restart this fire stick lite about every 10 to 15 minutes just to get it to play video after constant hanging. It is an absolutely horrible experience. I would not recommend it to anyone. I primarily use it to watch prime video as well as dish network anywhere and It is equally bad at both. I really cannot understand how it can’t be good at playing Prime Video since they both come from Amazon. This product is just abysmal.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Pay attention","reviewDescription":"I did not realize there’s no power button or volume button this remote Never would have bought this one That’s what I get for being cheap","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Does not work correctly","reviewDescription":"Only works about half the time. We couldn’t watch the Super Bowl because it looked like it was still trying to update or something like that. Very frustrating!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"No volume control.","reviewDescription":"The new fire stick lite hooks up easier than any I’ve had in the past BUT. No volume control. No on\/off control. I will be returning it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Doesn’t work Good..","reviewDescription":"Cheaper quality and a worse remote control! Low storage!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"No volume controls or power button","reviewDescription":"Not sure how this Fire TV stick is supposed to work without a volume control or power button","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Just doesn’t work anymore?","reviewDescription":"Got this fire stick April 13, 2022 a couple months ago my daughter had said it stopped working which had happened a couple months after we got it but i was able to figure it out with product support. my replacement window just ended april 2023 so this time i’m unable to get product support. i’ve replaced the batteries, unplugged & re-plugged both the fire stick & power chord, tried different outlets & hdmi ports and nothing, the remote doesn’t even light up with brand new batteries, the tv just says no signal. this is the second fire stick we purchased don’t know if i will purchase another one with the chance of this happening a 3rd time","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Doesn’t have a volume control or a power button","reviewDescription":"I don’t like that it doesn’t have a power button or a volume control. Terrible design.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Lite firestick","reviewDescription":"No volume on remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Películas","reviewDescription":"Dice más 1.5 millones de películas pero todas hay que pagar , no soy billonario","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Won't control tv without using Alexa","reviewDescription":"I don't mind the Amazon fire stick but I upgraded to a newer one and it won't let me control my tv without installing Alexa, which I don't want to do at this time. I am using onn boxes on my other TVs and they set up fine, might go back to purchasing a onn box and replacing the fire stick,","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Amazon fire stick","reviewDescription":"I received two loose dead, AAA batteries. I have never received an item from Amazon with loose batteries.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"No power button","reviewDescription":"Didn't know it didn't have a power or volume button on it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Better Than Cable!","reviewDescription":"Works great! Took some getting used to, but it's great. So much better than cable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Disconnect from Internet","reviewDescription":"At least once a day the fire stick disconnects from my internet. It’s very frustrating especially when it’s in the middle of a show. I also don’t like the fact that their is no way to turn it off","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Easiest remote to set up ever, does things that most remotes wish they could","reviewDescription":"For one thing it set itself up, I had very little to do with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Easy set up","reviewDescription":"I used this on a second TV in a house that already has one Firestick fed TV. Plugged it in and it did everything automatically, even connected to my wifi without needing password and copied all the info from the existing Firestick.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"No volumn adjuster or voice command.","reviewDescription":"Only difference with the light fire stick is this one doesn't have the voice command or the volume adjuster, other than that it's the same'","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Is not what it claims to be","reviewDescription":"Fire stick worked great when I got it , sometimes it doesn’t work, it sticks sometimes","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Works great but definitely slower than new models","reviewDescription":"Works as expected but seems to be slower than the newer model that I have in my cabin.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Read the specs..!!","reviewDescription":"Make sure you read ,it doesn’t turn your tv on or off and it doesn’t have a volume button.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Hard to beat for the price","reviewDescription":"It works.  It's a bit laggy sometimes when navigating the menus in most apps but it streams just fine.  Don't bother trying the gaming Luna with this one.  The lite doesn't have a lot of power.  It was 15 when I got it and the current price of 30 is a bit much.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"easy setup","reviewDescription":"5 minutes from box to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"BROKE LESS THAN 2 MONTH , AMAZON JUST GOE XROUMD IN CIRCLES","reviewDescription":"It Worked,  now it doesn't! , have for less than 2 months! Amazon makes you jump threw hoops first to fix it  and then you still can't get a new one or your money back","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Hacked","reviewDescription":"Waste of money we are hacked trying to register and pair this product. They provided telephone number when my husband called they asked all information including his bank account, unsuspectingly he had given it to them.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Never worked","reviewDescription":"The item was defective which happens I suppose but I've been waiting to get my postage (which I paid for)and now I am waiting for my refund which I'm told could be another two weeks this really pisses me off just saying the whole process has been far more difficult than it has to be 🙄","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Firetv stick lite is the worst product e er on amazon","reviewDescription":"TV stick lite is junk compared to the original TV stick, no TV control I hate it. I am trying to watch a recorded program on dish anywhere, in the last 20 minutes it has been buffering 15 of those minutes, impossible to watch any thing recorded still buffering, I’m going to take a nap now the little red circle is quite hypnotic, I’ll let you know if it is still buffering when I wake up, must have stopped buffering program ended had to start over or ff to where I stopped what a nightmare, fire stick lite and dish anywhere is a bad combination.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Frankincense not real","reviewDescription":"The product didn't melt like real resin on a charcoal disk that burnt all the way out! Burnt the sides, let off a smell, and stayed whole. Highly dissatisfied.  Save ur money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"pointless","reviewDescription":"my mistake for not looking at the details. This stick has no on-off switch. No volume control. Why do they even make it. You have to have the TV remote along with it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Do not buy!","reviewDescription":"Extremely slow out of the box. It worked (with great frustration) fir less than a month. Pain in the arse to return so I think I will discard it and order a Roku.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"The controls do not work properly","reviewDescription":"We had a control that the “up” function did not work so we purchased another one. The new control doesn’t “go back”. So now we’re stuck using both of them ….","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Defective","reviewDescription":"Item does not workTried unplugging and replugging inChanging batteriesAnd holding the home button to reconnect device.Support does not help just tells you to send the item back for refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Epic fail - 2nd fail in 3 months","reviewDescription":"I've bought this Fire Stick Lite to go with a small kitchen TV.  I choose the LITE version over the regular because the TV is not high quality and thought I'd save a few bucks.  What a disappointment.  The Lite version has failed me twice now in just 3 months. The first one Amazon replaced and now the current one does not even power up!  What a waste of time and money.  I DO NOT recommend this product, epic fail!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"You need to pay extra for power and volume","reviewDescription":"\"Volume control\" is a feature when creating this review. The Lite version does not have power or volume control on the remote. You have to pay extra for those features. Had I known, I would of paid for it but now I'll be annoyed until I either return or buy a new one. Not sure which one is more of a hassle. It should be more obvious what the difference between Lite and the other versions are. It is not and now I have two remotes to control my TV.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Muy mal","reviewDescription":"Me siento realmente molesto, anteriormente he comprado Fire stick pero esta compra me resulto malisima, en cuanto empece a actualizar el fire stick terminado de actualizar se apago y no encendio más, al conectarlo en la entrada no sale imagen en absoluto, el control sirve ya que puedo encender el Tv con el, sin embargo no sale imagen al conectar el Fire stick en ningún puerto HDMI e hice la prueba en Tv's diferentes. Si van  poner algo en oferta por lo menos verifiquen que funcione correctamente.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Stopped working after 2 months of use","reviewDescription":"I ordered this for Christmas, we have used it for 2 months and now it keeps rebooting. We tried a different outlet, since it says this in the troubleshooting. Still same issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"No power or volume ??","reviewDescription":"Why would they make this. I don’t understand. One of the main reasons I buy a smart tv remote is for it to function as my entire remote? Fork over the ten extra dollars and buy the full Amazon fire stick instead to save you the hassle","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"You get what you pay for!","reviewDescription":"I was so excited to get this Amazon fire stick lite especially since I just order another Amazon fire stick days before and it worked without any issues. But this lite wasn’t the fit. I tried to hook it up just like the non- lite I purchased and nothing happened. I went on three tv’s in my home and still didn’t work on neither one. Which is truly unfortunate because we are cutting ties with cable and now I’m leaving my father with one tv to stream on.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Firer stick","reviewDescription":"Prime is ripping customers off billing for service that wasn't requested under the firer stick my daughter  contacted prime telling them my didn't request that i owns that dvd ask them to block their prime out do to error they didnt they just continue to bill for service not requested they did that to me  with capital one credit card it was about to get lawsiut legal then too. They seem to be desperate  for memebership I said your not worth it then and now and because I contacted my bank credit card about prime ripp off I filed a fraud report to remove charges  as of right now they turned off my firerstick service so amazon need to send me a return label for firer stick I'll find something elsewhere  amazon your losing a customer.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"No volume button","reviewDescription":"Why does this not have a volume button? IWasn’t paying attention and didn’t know the lite version means you can’t turn the volume down or up argh","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Lasted 3 months and then died","reviewDescription":"I keep buying these things and they keep dying.  This one died after only 3 1\/2 months so they are getting worse. I followed the instruction to reboot it, changed batteries, etc and still it’s dead.  Waste of money and I’m planning to cancel my prime membership.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"ONLY WORKED FOR ONE MONTH","reviewDescription":"Not worth it, do NOT buy. This product worked perfectly for the first month. THEN out of nowhere, the remote slowly started not working properly. Within 2 weeks, the remote completely stopped working. It would not even light up with fresh batteries. I went through the process of spending money on a new remote since there was no indication that it was the firestick itself. The new Firestick remote didn't work with the Firestick either, which now concluded it was the actual Firestick itself that was the issue.  I went and bought a ROKU instead. Works much better and I was able to get a protection plan for it incase something happens.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Garbage","reviewDescription":"Performance is so slow it’s unusable after 1 month and it’s just beyond the return window. Complete rip off and will not be buying another fire stick after this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"SO DISGUSTING ABOUT THIS FIRESTICK","reviewDescription":"I WAS WAITING FOR THIS FIRESTICK AND FOR ME WAS SO DISSAPOINTING BECAUSE WHEN IT FINALLY CAME I REALIZED THAT THE REMOTE CONTROL DOES NOT WORK WITH THE TV.  ANOTHER THING WAS THAT I FOUND A BETTER PRICE FOR THE EXACTLY ITEM JUST 3 DAYS AFTER MY PURCHASE.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Couldn't link it","reviewDescription":"I tried everything I knew to set it up. A friend who has set up many for other people could not do it either. Returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"These devices fail with regularity","reviewDescription":"I've purchased four fire sticks, one would never power on after a power outage, a second one just randomly stopped working and a third will not reboot after restarting.  I'm done with this product.  Moving to Roku.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Does not support streaming platforms not included in Amazon prime","reviewDescription":"I bought this device with the idea of ​​watching statz, hbo and to my surprise this device does not support applications that are not included in amazon prime so be careful with that because you will not be able to see this type of streaming on this device. I wouldn't have bothered it if I had known that little detail.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"No sirve!","reviewDescription":"No compren esta versión del fire stick. Lo conseguí en descuento pero no funciona y lo peor es que amazon no se quiere hacer responsable. He sido un excelente cliente y aún así no me quieren reemplazar este artículo. Que mal.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"This item will not connect to your WiFi","reviewDescription":"I have been trying for hours trying all kinds of methods to connect to the WiFi ,first it said it’s connected but then it’s gonna automatically loses connection from then it will never connect back to your network and it will never work I’m sending this item back it’s a scam totally unacceptable waist of time and my money","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Amazon will not back up their products!","reviewDescription":"I got this as a gift on sale and for the most part it does ok. It's slow, and the remote has always had issues. But I haven't even had it 6 months and already the remote is dead. I have my old fire stick from almost a decade ago which the remote still works fine, but this one is dead in ) months. So I call up today to get a replacement, as the order says I can still get a replacement through July 2023, and they denied me. They said that it's only got a 3 month warranty, yet ON THE ORDER it says that I can replace it until July 2023. Why are they saying one thing and not backing it up? So do not get this. Because it is basically useless without the remote and to replace the remote would cost more than what I paid for the whole thing. Thankfully I can use the app, but there's a severe delay when using that, so if I have to pause something, it takes a second or two.Just awful customer service and shame on you Amazon for not backing up your products.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1674086400000}
{"reviewTitle":"Stunk","reviewDescription":"Received this unit today and it absolutely freaked of some strange odor I am not even bringing this thing into my house!!! Buyer beware!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Buggy pos","reviewDescription":"I bought this to replace a 5 year old fire stick that was starting to perform poorly. This one has been buggy since brand new. It gets very laggy and often crashes in the middle of a show.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"1.) the remote doesn’t have a volume or a power button. So I had to buy a universal remote.2.) this thing freezes and “updates” more than anything I’ve ever seen.3.) it crashes all the time!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Unbelievably slow and FULL of ads","reviewDescription":"DO NOT WASTE YOUR MONEY ON THIS PIECE OF CRAP! It's slower than ants in molasses, I'm talking windows 95 56k modem slow and if you don't know that reference then you don't really know what slow is. Just spend the extra $10 and get a Roku 4k, it's so much faster and never freezes up. Also, the second this thing starts up, it immediately starts playing ads so you have to hit the home button get back to the home screen which causes it to start lagging. Bottom line, get the Roku 4k, you won't regret that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Will kick you out.","reviewDescription":"When ever I am watching it resets. Boots up and start watching something and screen goes black and you see the Amazon logo. So tired of this doing it. Changed ports and is still doing it. This is like the 4th total fire stick I've bought now in the last 4 years","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Seriously, who thought this was a good idea?!?!","reviewDescription":"Was trying to find a Firestick that my 86 year old mother-in-law could operate.  Has easy access to her DirectTV, but . . Totally useless since she can’t adjust the volume or turn the TV off without having the TV remote. She can’t hear Alexa & Alexa can’t understand her. Grrrrrrr","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Will not work","reviewDescription":"I opened this fire stick this morning and cannot get it to work on any of my TVs. It is stuck on the logo “firestick”. We thought maybe it was our TV or internet…. But our other three firesticks work just fine on the tv that we are trying to plug our new one into.I have followed the trouble shooting instructions without any luck.  I will continue to try but if it does not begin to work, I will be returning.If it begins working, I will change\/update my review.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Remote is not user friendly","reviewDescription":"If you need to go to your T.V. to adjust the volume and power on\/ off, Does this not defeat the purpose of a remote?This purchase was my fault I needed to read the description more closely before buying! I tried to live with my decision for  4 months and hated it more every day So I replaced it with the fire stick I have come to know and love  My lite fire stick made my give-away box a little heavier with no regrets","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"doesn't work","reviewDescription":"Bought for my daughter's birthday present but had to get a new tv so held onto it for Christmas. So she just opened it for Christmas and it didn't work right out of the box, tried on multiple TVs, factory reset and customer service has been no help. It's obviously a programing issue with the stick. Since we're unfortunately out of the return window they say buy a new one. I would not recommend buying one of these as a gift, give you're loved one the cash instead","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"No extended storage","reviewDescription":"Fire STick's only comes with 8 gb of storage and only 6 gb are available for apps. This does not give alot of choices for the apps.  Hulu required an update which made me delete several apps.I tried to extend the storage with a OTG adapter and it did not accept the USB drive.I think the Fire Stick is defective but the 90 DAY! warranty is expired.  You need to spend another $4.00 for the extended warranty!!!!!!!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Not like previous fire stick","reviewDescription":"We had a fire stick that stopped working so we bought this as a replacement. I’m so disappointed. The remote does not have volume control buttons or a power button. In order to change the volume or turn off the tv we now have to physically get up and use the buttons on the tv. Very annoying. The last model was way better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Ch1knees junk do not buy!","reviewDescription":"Had a fire stick for about 5 years and it suddenly went dead. Bought this to replace it. Set it all up and now it resets about every 15 seconds. Can’t click on anything fast enough before it goes back to the Home Screen. Should’ve went Roku!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"difficult to set up","reviewDescription":"I have several Roku sticks and they were each very easy to set up. I wanted to try the FIre Stick since I have an Alexa and thought since I have an Amazon account it would be easy to install. The Fire Stick is extremely difficult to set up additional apps beyond the ones pre-loaded. I have Xfinity TV programming and it took multiple attempts to find and install the app. Once I got uploaded it was still difficult to get it to work with the Fire remote. Ended up taking the Fire stick out and put the Roku back in, It works perfectly and so easy to use!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"I am not using 'Alexa', unit does not have volume controls","reviewDescription":"Unit has had two updates sent to it, but I still have issues with no volume from tv after selecting a channel to watch. I must turn the tv off, then back on. Unit also can not always locate the remote, though it is only 10 feet away. Plus the invariable \"Are you still watching\" I assume the more tricked out units would have the same issues. I am not going to the expenice to test that.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"Fire Stick and remote lite","reviewDescription":"I am happy with the fire stick.The remote I am very disappointed with. There is no on and off button or volume. Why put a remote out like that. I want the stick or else I would return it. I bought an app for volume but it doesn’t work.So I bought another remote that has everything on it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Wait for the 4K to go on sale","reviewDescription":"The 4K sale price is lower than this version’s regular price. The difference between the two is subtle, but definitely worth waiting for the 4K to go on sale.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"No volume or mute","reviewDescription":"I got this and didn't realize it doesn't connect to your tv for functions like volume or mute. It's best to buy the regular version.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Okay","reviewDescription":"Came with everything. It works but freezes on a screen and gets stuck I have to use the voice control to get to another.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Fire Stick","reviewDescription":"It was more complicated than the normal one ( not the lite one). It was difficult to manage","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"No volume control","reviewDescription":"I miss the volume control that was on the previous one I had.  This latest Firestick  now has buttons for Prime, Netflix, Direct TV & Peacock instead of the volume control. The buttons are totally useless to me!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"It's okay","reviewDescription":"I'm a little disappointed with the product, the back light is great and all but the main feature which is remote finding doesn't work well. If the remote is inactive for a long time the finder doesn't work. It's like it can't reach it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Not happy","reviewDescription":"Doesn’t work as easy as older ones","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"reconnect","reviewDescription":"I accidentally hit “forgot this WiFi” and I can’t recast my firestick to the tv. Love the product but sucks I can’t get it to work anymore","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Broke already","reviewDescription":"Worked great for the first month then it just shut off and won't go passed the loading screen.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"why can't i get my remote to work for this","reviewDescription":"the remote was lost and i cant use my fire stick tv remote app.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"did not work","reviewDescription":"had to what for frontier took time not my fault just to return...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Okay","reviewDescription":"This firestick has a lag in it after selecting option with remote, my Roku works better","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Read the directions","reviewDescription":"Works well just plug it in and set it up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"App bottoms programmed wrong","reviewDescription":"It’s fine for what it is- except the app buttons. The Direct TV app button brings up Disney +, and the peacock button brings up Hulu. Wish there were stickers I could put on them to make them accurate at the very least. It does seem to load pretty slow which is annoying, and trying to get to the apps in the Home Screen can be a pain. I did the parental controls but it wants to bring up everything instead of just kids stuff. Created a kids profile, and then can’t access the apps at all (PBS KIDS, Disney, Hulu etc that have kids programming) Overall it’s meh.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"Torn with this device","reviewDescription":"I ordered one last week, and right out of the box it was great. The next day it slowed down so much that it didn't move much. The device was updated without my knowledge nor permission.I don't like it when devices do that. I normally never update due to the slowing down and taking up more space in the device. It says 8 GB but it's 5 GB and after 4 apps it's 2GB. I can run a Firestick lite with 4 apps easy. I looked at the processor speed it was 1.8 GHz. I can never put this on my 5 GHz WiFi to stream faster.The Memory was 1 GB, where am I going with 1 GB. This was designed for people who know nothing about streaming devices. This would drive me crazy, reading how slow it is, is driving me crazy. My Akita moves fast than this device even when she is sleeping all day. SLOW, due something about the speed and give more GB space or stop upgrading the device automatically.Be careful when you turn off Automic updates, it turns back on somehow. Give the option to downgrade back if the update is not ideal.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657497600000}
{"reviewTitle":"I can't find the channel I subscribed to","reviewDescription":"Overall, I really enjoy using the Amazon Fire TV stick. My only beef with it is that since I subscribed to the Kundalini Yoga TV channel through Prime, I have a lot of difficulty finding it when I go into the Prime app. Shouldn't it be under \"My Stuff\"? When I click on \"My Channels\" none of the content from the Kundalini Yoga TV app shows up. I can basically only access this channel if I do a search and type in the words \"Kundalini Yoga\" and then it finally shows up as a search result. It's just a pain to have to do that every time, since you have to type in one letter at a time using the remote control. It's just very klunky and annoying. Would it be possible for Prime to boost your paid subscriptions to the home screen, say at the top of the screen next to the \"Continue Watching\" list? Or just someplace obvious and super easy to find.  Thanks in advance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"Not the same","reviewDescription":"The other Firestick I had for two years stopped working. I thought they were all the same but the Lite don’t have a power button or column button. Had I known the remote didn’t have those options I’d of ordered a different Firestick. My fault I should have read all the details. Just weird it doesn’t have them.Since I had a Firestick it was super quick and easy to set up as it paired my previous settings.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Be aware of the remote model differences","reviewDescription":"I previously purchased the remote with On\/Off and Volume control on the remote (Right).  This remote lacks those features and requires the use of a TV remote for those features.  I'd recommend spending a few extra dollars and getting the higher-end remote.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"didn't work for me","reviewDescription":"after inserting it it began to update etc but went black like it was rebooting but never did anything more...i left it for a bit thinkin it jus needed time but it never came BK on n it didn't show up on my HDMI list even after was plugged in. returned for prompt refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Firestick is Junk","reviewDescription":"This item is defective, and you can't return it, It drains the batteries in the remote in 2 days.Not recommended at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"The WORST","reviewDescription":"This firestick is horrible Connect when it wants to skips,freeze,and sound goes in& out only from what I watch on firestick.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Horrible","reviewDescription":"Had for month and it done stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Get a Roku","reviewDescription":"This device is so crappy. Laggy does not respond stop in the middle of shows to take me to Amazon home page to play non stop commercials. Yeah Amazon I’m totally sold on interrupting my shows to display commercials to things Idgaf about. Only think you can count on working properly is Amazon app and commercials","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"No on\/off or volume buttons","reviewDescription":"Didn’t notice the missing buttons until i unboxed it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"NO TV CONTROLS OR VOLUME CONTROLS","reviewDescription":"Read the fine print.  We had owned a previous firestick that no longer works.  My husband ordered this one thinking it was the same as our previous firestick not realizing there were so many options.  It does not have TV buttons for on\/off or volume.  This was a desired feature for us because we did not want to have more than one remote for this TV.  I wish Amazon would make it clear in the Name of the product that it does not have these controls, but it is our mistake that we did not read the fine print.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"There’ no volume","reviewDescription":"The volume is important. I was not aware there’s no volume on it. That’s why I have to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"RETURNING DEFECTIVE","reviewDescription":"I HAVEN'T MADE IT,JUST GOT MY LABELS THE DAY BEFORE,WILL TAKE BACK 2 DEFECTIVE ITEMS FOR REFUND.THANKS","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"No volume\/mute buttons","reviewDescription":"My old Amazon fire stick stopped working as it should. I went to Amazon and got the first fire stick I found. I would’ve never assumed that it would not have a volume option. I’m going to have to send this back. I really can’t understand why anyone would buy this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"My parents loved it!","reviewDescription":"I bought this for my parents as a christmas gift and they loved it.I set it up for them and it was a bit time consuming but super easy, everything is self explanatory with it.Mom and dad have no problem using it, they are happy because it's so much better than the old smart tv they have.10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Perfect for my car","reviewDescription":"I was bummed when my new car didn’t have DVD headrests. This was a great replacement. We can plug and play, and the kiddos have their normal shows and access to movies or the internet for streaming.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Old people approved","reviewDescription":"These are user friendly and simple","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"My second fire stick","reviewDescription":"Had the original one for four years until it didn’t work right anymore, this one seems just a bit better.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"works fine","reviewDescription":"Works fine, stream quality not as smooth as Roku, wish Roku had a browser.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Works as advertised.","reviewDescription":"Easy to set-up and sync with my existing account.  Works as advertised!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"I love it","reviewDescription":"My tv it works wonderfully","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"These have gotten so muct better","reviewDescription":"There were too many pieces and couldn't figure out what some were but gave one to a deserving friend was able to get TV on an old tv and she was delighted. I already had fire tv but didn't know. I guess I'm old school","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Works Great!","reviewDescription":"The fire stick works great in our house. We are able to get Netflix and movies. We love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Gran compra","reviewDescription":"La recomiendo mucho, facilito de usar, económico y muy bueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Love this","reviewDescription":"But this one for my spare bedroom so when my grandson comes in and visits, he can have it it’s very easy. It was easy to hook up my grandson loved it got to watch all his programs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Love them !","reviewDescription":"I purchased 1 although I need another one 😂😂 I can talk to it, I can use it to control the volume and I can turn off my TV without using my other remote control. It’s just unbelievable 💖","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Easy to install","reviewDescription":"Our previous Fire Stick failed. We purchased this as a replacement. If you follow the directions, it is very easy to install and seamless to upgrade the old Fire Stick.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Great product","reviewDescription":"Love love love love this watching tv has never been this enjoyable before but now I’ve so much option so glad I bought this","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Old fire stick lost","reviewDescription":"Couldn't find the fire stick on a spare tv for months. Was having company staying over so needed to replace so they could use the TV. Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"I enjoy no fuss 📺.","reviewDescription":"WE have TV's in every room , and it's good to have a stick on each one. 📺  3\/8\/24","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Awesome!","reviewDescription":"I used to Roku tvs and so I was nervous to by this for my other tv that my son had just bought me. The set up was easy, the features are great AND I can use it as my other Alexa devices, to control my lights, blinds and a\/c. It’s totally cool","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Caught this on sale","reviewDescription":"I love my fire stick and if you have any questions you can always call Amazon and they will help you without any problems","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Love","reviewDescription":"I love this it’s small if it’s in the back of the TV and hides I have an apple box that is always bulky and has too many wires. I absolutely love this.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Really like fire stick","reviewDescription":"There is so much free stuff to do with fire stick way better than Roku got one for a family member as well and they are switching the other TV's to fire stick and it even has a web browser and live TV option with several channels to pick from free","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Interesting how there's no on\/off button or volume control.","reviewDescription":"If I didn't have another remote I have to use to go to the firestick, I wouldn't be able to turn the tv on\/off or  control the volume. It might work if you have Alexa voice command, but I don't have Alexa. It seems quite ridiculous that you can't control the remote. 🤦‍♀️","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Read Description First","reviewDescription":"This product is a disappointment since it doesn't have the full function of the original fire stick. My bad, I didn't read the description thoroughly before purchasing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"NO VOLUME CONTROLS!","reviewDescription":"Not what I was looking for with no volume control!..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"no on and off","reviewDescription":"good thing i saved my older one or I would have no way to turn tv on and off, also no volume control.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Todo bien pero la fuente de alimentación no funciona","reviewDescription":"Me parece muy buenos, pero cosas como estas tienen que tener mas en cuenta que no puede llegar con fallas.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"There's No Power Button on this over $30 Remote ...","reviewDescription":"How is this a firestick but has no power button let alone volume buttons?? I saw I can upgrade for another $15...thanks for nothing Jeff Bezos!! I might return it just for this.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"NO VOLUME CONTROL","reviewDescription":"If you want one remote to the tv don’t buy this one. This doesn’t have volume….","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Fire tv","reviewDescription":"I ordered 2 for my bedrooms but we couldn’t get the Fire tv sticks to work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"broken after a year","reviewDescription":"Countless issues with this device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Constantly locks up","reviewDescription":"Since I have echo dots, I bought this to compliment those and to replace my Chromecast.The setup was easy. I like the interface and the general design.However, now that I've been using it for a few days, it freezes up a LOT. Sometimes while I'm just navigating the UI, sometimes in the middle of a show I'm watching. It doesn't seem to matter which app I'm using. And it does not recover on it's own usually.I have to physically unplug it from the wall and plug it back in to restart it.I then have to wait for it to rediscover the Alexa Home Theater. So far, it's been more of a pain in the rear, just to be able to control it with my voice.I'll give it more time, but I may just go back to using the Chromecast.Big disappointment Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"Spring for best Firestick","reviewDescription":"This is basic Fire-stick, while less $$, does not turn on\/off tv so you need 2 remotes. It doesn’t control volume either","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"No power or volume button","reviewDescription":"It doesn’t have have a power button or volume button so I don’t like it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Can turn tv on","reviewDescription":"It doesn't have a power on\/off button but the product is still pretty good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Will need an additional tv remote control","reviewDescription":"No volume or tv buttons, unlike the other FireSticks we have. Easy to set up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"It doesn't have volume or a power button.","reviewDescription":"This is garbage without a universal remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Remote control","reviewDescription":"Remote control not working and will not pair","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"No power or volume buttons on this version","reviewDescription":"I have other Fire sticks and like them, so I thought I’d buy another for a new tv we have. Come to find out, the version I received is the “Lite” version with no power button or volume buttons. If that doesn’t bother you, then great, order this.  Personally I don’t like juggling multiple remotes, so I am disappointed that the desciption of this product was not clear that it did not have this feature.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Just ok","reviewDescription":"For me, ROKU is a better option ... especially with volume control and how the channels are placed ... biggest drawback for both ( unless I am unaware ) FS \/ Roku voice control, is that if you have a cable provider ( Xfinity ) ... I could not find a way to change channels within the xfinity stream app by voice \/\/\/","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Works pretty good, but.....","reviewDescription":"Works pretty good but there is no power button to turn off TV. I didn't notice this until I received it, I have 3 different fire sticks and they all have a power button on them. Now I have to use 2 remotes to work this fire stick. Come on Amazon why would you make a remote with no power button?","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"annoying low storage warning","reviewDescription":"If you google \"amazon fire stick low storage warning\" the first thing the search brings up is \"critically low storage error can persist even after you've cleared up some room\". Okay I guess if you like constantly having to clear the cache.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Amazon Fire TV Stick Lite","reviewDescription":"I absolutely love this. even though it's the very basic, it has everything I need","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Good for price","reviewDescription":"It's a nifty streaming device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"works","reviewDescription":"same as any other fire stick without all the features","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Install","reviewDescription":"Great value easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Works","reviewDescription":"After a few minutes bam I had hundreds of channels and free movies love it well worth the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Good","reviewDescription":"Working good it worth it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"As advertised","reviewDescription":"Works great and shipped quickly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Awesome product!","reviewDescription":"Firestick works well. Love it! Easy to connect and use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Muy útil","reviewDescription":"Me encanta, es bastante útil","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Firestick","reviewDescription":"Good for wifi show movies","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Ok for a tv that already has a remote","reviewDescription":"Had no volume button on it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Firestick TV","reviewDescription":"This must actually be reconditioned. Audio not functioning properly","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Great price","reviewDescription":"Great price but didn’t look close enough. This unit does not have a volume control.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Amazon Fire","reviewDescription":"This series are not good becasue you can't control your TV and it is only for Anazon control","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Okay","reviewDescription":"Works like any other fire stick, has all the apps.  My BIGGEST issue with this is the fact that it seems to have absolutely NO space.  You have 4 apps, low on memory and nothing works.  Have to clear the stick (cache for every app, even if they're unused) like once a week.  ALSO you can't get rid of the preloaded apps, like amazon shopping and games.  This should be able to be deleted, it takes up SO MUCH SPACE.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673395200000}
{"reviewTitle":"If You Want Fire TV - It's A Good Value Option","reviewDescription":"The product is easy to install and works great. For Fire TV fans, I'd recommend it as a low cost way to access the service.We already have Roku and Samsung smart televisions and I wanted to try Fire.  I rated this at 3 stars because after trying Fire for a month and comparing it to the other operating systems, it would be my third choice out of the three. The others have apps that allow viewing of our Spectrum cable without needing a cable box.  Fire doesn't offer this application.  I also find navigation on Fire to be less intuitive than Roku and about equal to Samsung.  This might just be a matter of preference as they all work alright.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654560000000}
{"reviewTitle":"Less control for the tv","reviewDescription":"It doesn't control the volume like my other firestick","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Newest version .....","reviewDescription":"It has a delay in buttons? I'm not sure why. No volume buttons?","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Had to send the 1st on back.","reviewDescription":"Remote wouldnt work. Sent it back for an exchange.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"Not a fan of streaming.","reviewDescription":"Now that I am off a dish, my option with this is not great (other than saving me $50 a month!).  Too many issues with streaming.  First off after install found I had to use my 5G internet connection (other was no good at all).  After a month of usage have numerous issues that only seem to be solved with a re-power of the Fire Stick...probably have to do this about once a week.I don't watch that much TV and no movies at all, so all this new stuff may be ok for someone else...but me, I am not impressed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"The fire stick is garbage","reviewDescription":"At first this was working really good tgen a couple months later this thing starts malfunctioning I can’t even watch a program for more than 20 minutes before it starts blinking out maybe it was a faulty stick but since it was past the thirty days with no protection plan I’m stuck . I mean the streaming stick is becoming obsolete these day since every tv is a smart tv now days . But I think the fire stick just don’t have a long life for everyone I know who has one is nt working now now it’s a streaming device that does work reliably but I won’t disclose the name","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"It keeps rebooting","reviewDescription":"I really like it, but after some time it started rebooting at least 4 times before it actually started to work properly. Also it freezes a lot. I don’t think I’d buy it again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Disappointed","reviewDescription":"Bought this thinking it was the one with a power button and volume buttons but alas it had neither. I thought lite meant that the software was not as good as the other remotes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Do t waste your money","reviewDescription":"This was given to me by amozon to replace  my stick that worked fine for five years. They changed something so my stick would not work for dish anywhere app. The new one buffs constantly. Sometimes will not stream at all I decided to unplug it then plug back in this fixes it for a few hours.Amazon rep said do a Factory reset or buy a fire cube. I had issues understanding him to do a factory reset and am not crazy about spending 150$ to fix an issue they caused.I expected better from Amazon guess I  was wrong","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"It’s eh","reviewDescription":"Remote has issue connecting to the fire stick. It’s always updating, it’s ok. Roku streaming device probably would’ve been better choice but I thought this would’ve been different.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Doesn’t have all features","reviewDescription":"This model doesn’t have power button, mute and volume control","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Remote","reviewDescription":"No on off button or volume button.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"It stop working shortly after I  received it","reviewDescription":"And I was unable to return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Meh","reviewDescription":"Dear Amazon:Some of us are using Bluetooth speakers that don't have a remote on a monitor that doesn't have built in volume. It's cool this works on monitors and not just TV's, but still. It would be nice if your video players offered a VOLUME BUTTON to control the volume from the fire stick rather than picking up another remote or going to an external device to turn things down that play on the firestick. Very upset about this missing feature.Set up was easy and it all worked but I really REALLY want a volume feature controllable within a firestick streaming service video player. So far I've only tested Amazon videos, so I can't speak on such a feature from other apps, but ya. Get it together, Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Likes to buffer","reviewDescription":"If you like watching the little circle in the middle of your tv screen this is the one to get!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Constant buffering issues.","reviewDescription":"Being an Amazon product  Amazon prime should play well.  My internet speeds vary from 50 MB to 10 MB.  I already know my internet in the sticks is not the best, but my Roku works 100x better running Amazon Prime and Netflix.If you live in the country or don't have Premium internet service, get a Roku.My brother in law lives in the city has great internet 100mb or more.  And still has minor buffering issues.  Not as bad as mine.  I took my Roku to his house, and over the course of Sunday Fooball games, his didn't buffer once.Definitely not what I thought.  All my friends are switching to Roku now.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"A laggy, buggy nightmare","reviewDescription":"After putting up with years of poor responsiveness from my 2nd gen Firestick, I finally decided to upgrade to the latest version. It had gotten so slow, I simply prefered not using my TV at all. To my regret, the new Firestick is almost as agonizingly slow, jittery, and laggy as the old one. I'm constantly tapping two or three times because I don't see a response to the first tap. The actual animations on the main page, loading screens, menus, etc lag like they're on a slow computer. When exiting an app playing a video, the sound will continue playing in the background for several seconds until it catches up.This is not an internet speed issue. My internet is fast, and once a movie is on, it plays smoothly without issue on most apps. It's the actual UI of the Firestick that is a slow, bloated, not to mention ugly, mess.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"The new Amazon fires sticks do not allow apps from unknow sources","reviewDescription":"All of the Amazon fire sticks I've used over the years have worked great but the last two news ones I've purchased are almost useless to me.  I've used a TV streaming app for the last 5-6 years with no problem using the Amazon fire stick and I have a tv that has the Amazon system built in but now Amazon thinks that my current tv app is too much of a security risk it appears to continue using it.  I will just have to make my old ones last as long as possible and return the new one like I did the last one.  Is there a remedy for my issue?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Beware","reviewDescription":"Mine came with a broken remote. I was never able to set up my fire stick due to this major inconvenience. I tried for an hour to get it to work, tried three different sets of batteries (which all worked in other remotes) before contacting customer support…. They “sent me a new remote” except, when it arrived…. It was just another (useless)  fire stick! When I contacted them being patient although I was extremely frustrated, they told me that I had to purchase a new fire stick before they could give me a refund & that was my only option because “they can only create one return per item” even though THEY made a mistake and sent me the wrong replacement item. I did not need another fire stick. I could not use the first one due to a faulty remote, so how am I going to use a second one? Now I just have two useless pieces of garbage taking up space in my house, as well as a WASTE OF MONEY. No, I’m not going to buy another one just so I can get a refund? They should have sent me a working remote to begin with, but as far as I’m concerned they should have sent me a working remote as well as a refund considering the amount of times I’ve been inconvenienced by this and still not had my problem resolved. Not a good purchase. Waste of money for me.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"Hasn’t worked since the day I bought it.","reviewDescription":"This is the biggest piece of garbage I have ever used. It is CONSTANTLY crashing in the middle of watching something and then will just get stuck on the opening logo replaying it over and over again. That noise haunts my dreams. I’m so sick of it. I have like 3 apps and it still is always telling me there is no storage. I tried to get a replacement because of the crashing but they wouldn’t send me one. Yeah it was cheap but not even worth that price. Just spend a little more and get something that actually works. Don’t waste your time or money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Worked one year and died","reviewDescription":"Worked fine for a year...then black screen. Starts reboot and then just goes to black screen. Have tried all the noted problem solving issues. This is our 3rd fire stick, lost one in move, the other died after 2 years, but I can't justify buying another one if they only last 1-2 years and die randomly.Love Amazon and typically products are good (love my kindle etc) just been very disappointed in Fire Stick Lite","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Pos","reviewDescription":"Decided as a piece of s*** works fine for 6 months and then 2 minutes into a program and knocked you back to the main page you can't get to your settings you can't get to anything and trying to return it is impossible even though you have a year to replace it I have been trying for an hour to get through this replacement and it just knocks me back into another part just like the TV","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Unbelievable!","reviewDescription":"This is the 1st remote I've ever seen with OUT a Volume or MUTE BUTTON!I dont need a button for Netflix or prime Video or Direct tv.  Just give me the basics.Don't buy this unless you like using 2 remotes to watch tv.This is Not the remote I ordered in the 1st place.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Pure trash!","reviewDescription":"I had firestick 4K version for several years, it worked really well. One day I received a notification from Amazon that if I wanted to continue to receive updates on the DISH app, I would have to switch to the lite version, it was free for the first one, but apparently I had to pay for the other two. Since receiving the lite version, I have had constant buffering issues and phantom remote updates that never seem to update and go away. I can’t even watch a show that is 30 minutes long without it buffering. When that starts I have to stop the stream and start all over because it will buffer for hours. I have 1T internet with my provider and I think it’s just too much for this little firestick to handle.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Missing some functions","reviewDescription":"Ok so i love the previous firestick i have. Orderd this one and the remote doesn’t have volume button and turning tv on and off button. Now i have to keep too remotes which is really stupid. I can’t return it since I took it out of country with me.👎🏻👎🏻👎🏻. The previous one i orderd had all these function and it was only for 15$. This one is expensive and missing some functions 🤦‍♀️","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"No Power Button","reviewDescription":"This remote does not have a power button so you have to have a second remote for power.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"No power or volume buttons!","reviewDescription":"I would not recommend this one, because there is no power or volume buttons. If you want to mute you will have to pause your show. You will have to still use the remote that came with your TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Remote stopped working (batteries replaced multiple times)","reviewDescription":"Remote doesn't work anymore even after replacing with new batteries and trying to re-pair the device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Does not sync to the tv!!","reviewDescription":"The product worked fine, however, it does not sync to the tv controls. You will need a separate remote to control your tv power and volume. Not what I was looking for so I made the return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Slow to respond to remote commands","reviewDescription":"This fire stick replaced one that was about 8 years old. I’m not happy that it lags really bad when responding to the remote. I can press a button to move through the apps and it will take 2-3 seconds for the fire stick to respond. My old fire stick was faster than this new one. You would figure that with an upgraded processor it would respond faster.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Don't settle","reviewDescription":"So I purchased the regular fire stick a few months ago, it was great, I moved that one to another room in my house and got the lite for my bedroom because it was on sale. This remote does not have a power button or volume buttons so you have to use your t.v remote for that, not that bug a deal. What kills it for me is the lag on this one is terrible, I end up only watching Amazon shows because I can't get to any of the other apps, I have to use the voice controls for just about everything ans have to do it multiple times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"When it works is great but the remote SUCKS and very slow to load some things","reviewDescription":"When it works is great but the remote SUCKS and very slow to load some thingsThe biggest con is the remote absolutely sucks. Sometimes it doesn’t work and it honestly takes forever to load some options like settings . Good product when it works, but the faultiness of the remote almost renders it useless. I’ve spent hours trying to get remote to work, and Bluetooth to pair. But the remote just doesn’t work. I had to pair my echo dot to navagate to all the streaming services and other things, but there are things fire stick doesn’t even let Alexa do, like control Bluetooth. Frustrating","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Glitch","reviewDescription":"Would not work on my TV. Ended up getting a Roku.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Not as nice as my other Firesticks","reviewDescription":"This particular model doesn’t have an on\/off button nor does it have volume control. So, now I have to keep the original tv remote out to use those functions. My other Firestick has it all and just replaced the tv remote, therefore I only have to keep up with 1 instead of 2 remotes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"It's okay....","reviewDescription":"I would say compared to the roku  this is not as antiquit. It freezes up at times and is very slow sometimes I have to completely reset  everything.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"No volume control","reviewDescription":"My bad, I didn't realize there was no volume control. Otherwise it works well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Its ok","reviewDescription":"Don’t like how it moves slow and doesn’t have a volume button","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Hotdogg","reviewDescription":"No volume or power button didn't order this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Not what I expected","reviewDescription":"Using Alexa for volume control is a pain","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"There's no power or volume buttons","reviewDescription":"There's no power or volume buttons","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"Ahí, ahí.","reviewDescription":"Más o menos","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"was difficult to set up. Not like a plug n play","reviewDescription":"the lite has no volume control which I did not realize when I purchased it.  It was difficult to get it set up for weeks off and on. I tried online help again and finally got better results on Amazon help.  It works great ow. Very happy in the long run. Thankful for online help","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Not a fan of the fire stick","reviewDescription":"not a fan of the fire stick the controller is the most glitchy of it all. It freezes and some buttons simply don't work until you unplug to reset the Firestick device, not sure if it is low powered but that is what i have been experiencing","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Missing a key feature","reviewDescription":"I bought a Fire TV stick Lite to replace a Sony streaming DVD player after finally getting fed up with the Sony's unreliable operation.I found the Fire stick's setup, operation, and performance to be very good, and am happy with those.  I did not plug it into my TV, but into my AV receiver, which allows me switch between audio\/video sources, and provides greater control of the audio.However, I gave the Fire TV stick 3 stars because there is no way to turn it off other than removing power.  Who wants to get up, walk over to the equipment and reach behind to pull the plug when you want to turn it off?Now the Fire TV stick may operate acceptably if plugged directly into a TV's HDMI port; I don't know, I have not tried that.  But in doing so one looses the superior sound quality of playing it through a good AV receiver.  And my particular issue with not being able to turn the Fire TV stick off is that the AV receiver continues to switch back to the HDMI port the Fire TV is plugged into whenever I select a different source, including Bluetooth.  I'll admit that this could be an issue with my particular AV receiver (a Yamaha), but I have never experienced this issue with any other source, so I'm pretty sure it is the Fire TV stick.Putting the Fire TV stick \"to sleep\" does not help this issue, BTW.  So Amazon, if you're listening, add a power button to future models of Fire TV sticks.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1646438400000}
{"reviewTitle":"It does not control your TV on\/off.  It will not control the TV volume.","reviewDescription":"I do not like the fact it will not turn your TV on or off.  It will not control the volume on the TV.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"No era lo que esperaba","reviewDescription":"Lo compré solo para usar la App de HBO MAX y no la permite descargar !Tiene una opción que es la nueva MAX pero solo sirve en Norte America, en definitiva no me sirvió, yo estoy en Colombia","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Does everything needed...except","reviewDescription":"Great for streaming all the streaming channels.I wish the Screensaver was easier to use. Easier to add new pix, set how long it shows them, how long the ss displays. I know it's not a screen saver primarily, but that's my feedback. Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"good quality.","reviewDescription":"I had it for over a year but barely used it (maybe 5-10 times).It stopped working a little while back. I replaced the battery but still did not work.Would not recommend this product.---Update a few months later =>I read about the remote and had to have it reset.  Once I did that it is working fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Great but no volume control","reviewDescription":"Ease of set up.  Would have liked volume control","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Came quick and works well","reviewDescription":"It was a little weird to get the remote to connect at first and we actually thought we were going to have to send it back. After about 30 minutes and eventually downloading the app on my phone to try to use a remote it decided to connect. No issues since then. Works great. The Alexa feature is east to use. Runs pretty fast. Overall worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Closed captions","reviewDescription":"My major complaint is closed captioning does not work along with the words. I can’t find where cc is even in the setting. I need cc to work or the stick is of no use to me.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"works but you will miss your volume buttons","reviewDescription":"make sure you have your TV remote close by as we won't be able to change the volume with this basic remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Good","reviewDescription":"It's ok it works but it doesn't have a volume button nor a power button","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Okay Product","reviewDescription":"Interface is a little slow and the product could use a little bit more in way of features and customization.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"works great!","reviewDescription":"Works great but you cant adjust the volume with the remote or turn the tv off or on.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Rarely works","reviewDescription":"Half the time it won’t load and is just a black screen. Severe lag in response time from remote. Constantly having to reboot. And no it’s not my Internet or tv. Everything else works fine and have used multiple hdmi connections in same port and no issues. Seems to be a fire stick issue. Guess I’ll be shopping for Roku.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Do not buy this. It's a piece of junk.","reviewDescription":"Not sure why Amazon created this. It's trash. Apps don't work properly. Hulu crashes repeatedly. NBA TV crashes repeatedly. I cannot watch anything for longer than 30 minutes before it crashes to the firestick homepage. The reason this is $20 is because it literally does not work lmao. Save your money and buy a ROKU. I have 2 of these firestick lites I have to now replace because they DON'T work. If you don't believe me just Google everything I complained about. You'll see. I don't ever leave reviews I came here just to tell you how trash this item seriously is wish I could get a refund lol.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Terrible","reviewDescription":"We were torn between the Roku Stick and a fire stick. We went with the fire stick because it was on sale but man I wish we had spent more and gone with the Roku. This thing sucks, it's always shutting off, we turn something on and less than five mins later it stops what we are watching. It isn't the Internet connection or anything else. We will be going with a Roku and throwing this in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Item Defective","reviewDescription":"Remote never responded to batteries and fire stick didn't respond to tv. Got this on a lightning deal last year and it never worked. It says eligible for return through July 24, 2024 but doesn't give the option to return at all only troubleshoot. Can't trouble shoot if the remote or fire stick doesn't even work. Money wasted and be aware of mass production of these with those lightning deals. Waste of hard earned money once again!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"NOT compatible with Google Play Store","reviewDescription":"Yep! You heard me right. Bought this stick to install the \"Jawa\" camera app so I could monitor some IP camsI've had for years. Couldn't put the \"Google Play Store\" app on the stick in order to download the \"Jawa\" app.The internet says they are no longer compatible. Go figure. Google it yourself BEFORE you purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Don't bother if you don't want to use Alexa","reviewDescription":"I hate this stupid thing. It keeps trying to make me use Alexa and I ABSOLUTELY REFUSE TO TALK TO A DEVICE. Every time I try to use a button I get blocked and the message about using Alexa pops up. It's beyond obnoxious. It won't let me go to the home page when I first turn it on, I have to wait till the Firsestick decides to let me go to the home screen, often taking several minutes.I feel like I'm being punished for not using Alexa. I really really hate this thing and may eventually replace it with a Roku.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Creates so much waste","reviewDescription":"Always dies after a couple years and they make you buy a new one. This product just creates so much waste that is so unnecessary. A product that doesn’t last isn’t a good product, just trash","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"I'm unable to get product to work","reviewDescription":"This is the 4th firestick I've tried to get to work. It has been installed.It played for about 20 minutes and then blacked out like the previous 4 .I would like a full refund. Thank you.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"IT BURNED UP MY TV","reviewDescription":"After receiving this product I was excited to use it after I decided to let my husband keep the one for our bedroom in his game room and I purchased this one to replace the one for our room. After I plugged in this fire stick and completed the setup it made a popping noise and starting burning and smoking. My Samsung tv is not even two years old so no it wasn’t the tv and I didn’t have any issues with my other Fire stick with this tv I am absolutely upset with this purchase please do not buy if you want to keep your tv. This fire stick has cost me more than what it’s worth because now I have to purchase a brand brew TV this is just sad!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"No volume controls","reviewDescription":"If you buy make sure you have two remotes. This remote no longer has volume controls. But they made sure to put quick button controls for peacock...... so dumb. This product sucks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Major disappointment","reviewDescription":"I am a longtime Amazon customer and like the company and its services. But for me, the Firestick was a major disappointment.The setup was straightforward and easy.  However, I quickly noticed that my audio was only playing through the small crappy speaker on my TV. I spent many hours trying to get the sound to come through my external audio system.I'm pretty sure that most people don't simply use the tiny mediocre speaker that is on their TV and (like me) they use an external sound system.Good luck getting your sound system to work with this device. I can't believe it doesn't simply play sound through your sound system, without any problems.When I used my PlayStation console to access Amazon, sound was never a problem at all.But after many hours, I've given up on the Firestick. It was a major disappointment and a huge waste of time.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"Didn't work.","reviewDescription":"I couldn't set it up. I tried to get help and nothing worked and no solutions were being offered. I've seen many other things about this issue. I tried and tried to set it up and I had problems with the code, my network, and it wouldn't update.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"keeps loosing connection","reviewDescription":"I have one I got earlier  and it works great. This one keeps loosing connection.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"ABSOLUTELY TERRIBLE!!!","reviewDescription":"I'm wondering if this Fire Stick Lite was such a failure that Amazon \/ DISH began giving them away free. The remote doesn't control the TV as previous Fire Sticks did, so now I am back to using the TV remote as well. There is no volume control on the Lite remote either. It is difficult to use the search feature.  This Fire Stick is reminiscent of ancient technology, not \"new and improved.\" Bottom line this Fire Stick is worthless. DON'T BUY!!!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"If I could give it 0 stars I would. It seemed to worked when first plugged it in & went thru set up process. Then it said it needed to “update.” Once it went thru update & automatic shutdown, it wouldn’t turn back on. I’ve tried EVERY “fix” there is & nothing works. After reading reviews online etc its seems to be a common issue….frustrating","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"THIS IS NOT A GOOD FIRE STICK","reviewDescription":".. I WOULD CHOSE ANOTHER SELECTION... THIS ON SEEMS LIKE ITS DEFECTED SKIPPING AND LAGGIN","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Opps","reviewDescription":"My fault.When I ordered the fire stick light didn't realize it didn't have a on and off switch or a sound volume switch kept it anyway using my TV remote.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Useless","reviewDescription":"I bought this Fire Stick Lite 7\/13\/2022 and it has been nothing but trouble.  Last straw, RECENTLY WATCHED disappeared!  I tried all settings to figure out what happened to my recently watched programming.  Without this feature, the Fire Stick is useless to me.  Forums had similar issues and suggested downloading the RECENTLY WATCHED APP, which I did.  This worked, sort of, for about a month and then that disappeared too! In desperation I removed the newer Fire Stick Lite and reinstalled my older Fire Stick 4K (purchased 5\/03\/2021).  After a quick update and the usual installation process, my OLDER Fire Stick is working better than my newer Fire Stick Lite ever did.  I wish I had never bought it!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"I hate it","reviewDescription":"I was forced to get a new fire stick since my old one just kept loading over and over without ever filling turning on, and my back up just kept updating Netflix and never opened it. The \"discount\" I got for having to get a new one was $3 and entirely not work the pain of contacting customer support. I have to contact them a third time to get it applied since the first person didn't do it correctly and the second couldn't fix it. All this and I now don't have volume control like my old remote. I refuse to spend ten extra dollars for the volume buttons when I didn't want a new fire stick to begin with. It's bs we have to pay to replace one when it's clearing a malfunction caused by Amazon.Update: this is trash. Don't get it. It doesn't have room to add even two apps and you can't delete the 20 Amazon apps to make more space to update apps.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"Firestick and Spectrum TV","reviewDescription":"Do not buy a firestick if you want to use the Spectrum TV App. This should be clear on the purchase page. I got this thing and now it is useless for me as far as watching content from Spectrum cable company. Extremely annoying!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Me gusta","reviewDescription":"Me gusta y me sirve para lo que yo necesito ya he comprado 4 en total","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Love it","reviewDescription":"Wish I would have bought it sooner","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Works for what I need it for","reviewDescription":"Works for what I need it for","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Problem solved","reviewDescription":"Brought this for a ridiculous low price and it seems like I got a new TV.  I'm so glad I did a great improvement and I'm very happy 😁","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Bought for projector","reviewDescription":"We have Apple TVs in our household, and it was cumbersome unplugging one of them any time we wanted to use our projector. This fire stick is super handy and convenient for the price. Black Friday brought the price to $18, so definitely worth it. Still trying to figure out how to download all of our streaming apps, but so far Netflix and prime are fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"perfect","reviewDescription":"I didn't have any problems connecting fire stick directions were so easy.  Thanks for fast delivery","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Just as good as Apple","reviewDescription":"I normally like apple TV, but tried this as a cheaper version. Works fine, and save lots of money. Get it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Perfect","reviewDescription":"I ordered this remote for my mom and when she received it, she said it was extremely easy to set up and is very user friendly. She has no complaints and truly loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Nu firestick","reviewDescription":"Easiest Firestick for to download EVER!  Attached immediately, quick changing stations (remote), more stations than \"old one (3?year old),'.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Makes any TV smart.  HDMI & WiFi required","reviewDescription":"I purchased this basic Fire TV model 6 months ago.  Set up was very easy, within 10 minutes I had access to all of my streaming content via the TV.  My flatscreen is about 11 years old bottom on the line, but I had no problems at all with using the fire stick.Customization of the Home Screen was easy, and I am impressed by the range of streaming media sources you can add.  Of course a subscription service streaming still requires that you have the subscription.It is alexa enabled and you can also use a remote interface on your smartphone.  I opted not to get that fancy though and just use the basic remote.As long as you have WiFi and a television with a HDMI port, you can use the fire stick to make it smart and top of the line.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"No way to watch privately","reviewDescription":"Requires an Amazon account to use, which means that Amazon can spy on what your are watching and use this data to advertise to you.  I tried creating a 2nd Amazon account for use just with the fire stick but they require a phone number.  I'm not interested in having Amazon spy on what I'm watching so I'm returning the device.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Not  what I thought it would be.","reviewDescription":"This product is not a good by. You have to pay and subscribe for old and new movies through prime. You should not be paying for. I would not suggest this to anyone. Try another type of fire stick, this one stinks.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"Very disappointed","reviewDescription":"Very slow getting anything to start on my tv with this fire stick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Terrible product","reviewDescription":"Never been able to get it to work, looked up on internet tons of comments saying firestick had to b almost right next to tv to get it to work & if u wanted to work u need to buy high price wifi booster, so I got stuck with a cheap wifi extender which doesn't work & have had fire stick which haven't been able to use at all in 4 months.  If amazon can't sell better product than this then they need to get out of prime tv business, huge ripoff makes me even more want to cancel my prime & start buying from walmart online","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"Disappointing","reviewDescription":"We had several Fire Sticks that worked almost flawlessly.  We received a message that we had to upgrade as the old Fire Sticks would no longer work with outer Dish Network.  The new Sticks are so bad we cannot even watch a half-hour show without many (many!) streaming interruptions.  They have to be reset and we miss\/lose so much of the show we're trying to watch.  What a waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"fire stick","reviewDescription":"I realize the return date has passed, but due to doing home renovations, we were not able to use this product until now.  But upon trying to set it up, we have found that the firestick does not work. we changed batteries, but it will not work.  I even had someone else with more knowledge that me try it, but still no success.  I would like to return it and receive a new one.  I have always been pleased with your products and service in the past, so I would really like help with this problem","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Keeps exiting programs or apps","reviewDescription":"Fire sticks are getting worse.  Bought this August 13 and it gets worse every day exiting programs. I have been trying to watch a show and every 5 minutes it exits the program.  I am tired of buying these things only to replace them again in 4 months.  What a rip off.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Worst amazon product ever!!","reviewDescription":"Tried to resolve through Amazon and they wouldn't replace my item. Do yourself a favor and buy the full remote not the lite!! Item doesn't work!! Won't play any app longer than 30 minutes. Won't load home screen half the time. Alexa voice command opens the wrong app every single time. I hate this remote.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"Exceptional slow and glitchy","reviewDescription":"Loads apps slow or errors and does not load at all.  And very annoying it stutters during streaming. My Hulu never did this. Think I should go back to Hulu!! I have super high internet speed as I work from home for a prominent healthcare company. This happens when I’m not working and it is the only thing streaming. Should not be a thing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"it is not a reliable product","reviewDescription":"this is the third fire stick that I boughtdo not waste your time and money this product stop working after 6 or 10 monthvery bad product not reliableI will try now roku","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Works great","reviewDescription":"So glad to have all my apps in one place and I can travel with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Nice*","reviewDescription":"I should have looked for whether this had volume control.  It does not.  Not a huge problem, and my fault.  Just be aware you will be using the TV remote as well as the fire stick remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"I'm a Roku fan but I want to try the fire stick","reviewDescription":"I've had Roku for a couple years now and really like it I did buy this fire stick because I got a good price and I had an extra TV I wanted to put it on. I hooked it up with one of my Alexa echo dots. You have to command it to turn the volume up and down.  It did hook up very easy but I think I'm going to just stick with the Roku and put this one in the guest room.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"It's Amazon products and services","reviewDescription":"So far it's great no problems at this time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Easy to Install","reviewDescription":"Very easy set up and integration for old TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Seems same as last fire stick","reviewDescription":"It did have more selections on the remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Good but..","reviewDescription":"The only reason I give 4 instead of 5 star is because I have lost TWO of these remotes forever and I'm tired of buying new sets. The remotes are too easy to lose I wish it had a string handle on it","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"No issues setting up","reviewDescription":"Once I navigated the remote I had no issues setting up the Fire Stick.  There really are a good variety of shows to choose from.  Just be aware that even though most are free I accidentally paid for one of them and letting you know ahead of time if money is an issue. I'm enjoying it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"Acceptable","reviewDescription":"It doesn't have a power control feature.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"No complaints So far, except for one","reviewDescription":"I really like this. It does what's intended. However I don't like the lack of volume control (I need to use my TV remote, which isn't too bad ). I also don't like how when I cast I need to have my TV up really high but when I stop casting it's WAY too loud.Connectivity is good. My Amazon account says it was weak however I didn't see a difference and it worked fine.Image quality is picture perfect , even casting isn't too bad but there is a slight delay which isn't too bad.If I could rate it specifically it would be a 4.5! But Amazon won't let me so I'm rating it 4","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1699488000000}
