{"reviewTitle":"Super Fast Cell Phone with Great Camera","reviewDescription":"⭐️⭐️⭐️⭐️⭐️The SAMSUNG Galaxy S24 Ultra is an absolute powerhouse of a smartphone! From the moment I started using this device, it was clear that Samsung has truly outdone itself with this model. The 256GB of storage is more than ample for all my apps, photos, and videos, and the performance is lightning fast thanks to the latest AI technology and powerful processing.The display is simply stunning—vivid colors, sharp details, and deep blacks make everything from streaming videos to scrolling through social media a visually immersive experience. The build quality is top-notch, and the design is sleek and premium, giving it a luxurious feel in the hand.One of the standout features for me is the advanced camera system. The images are incredibly detailed, even in low-light conditions, and the array of shooting modes allows for creative flexibility. The battery life is impressive as well, easily lasting through a full day of heavy use without a hitch.Being unlocked and Android-based means I have full control over my device and can switch carriers or customize settings without hassle. The software experience is smooth, with Samsung’s enhancements adding value without overwhelming the core Android experience.Overall, the SAMSUNG Galaxy S24 Ultra is a fantastic investment for anyone looking for a high-performance, feature-packed smartphone. It’s reliable, powerful, and offers an exceptional user experience. Highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"In love with this phone!!","reviewDescription":"This is my second day using it...and I love, love this phone. It is truly like a mini-computer on your hands. I had been going back and forth with it because of its high price, but not regretting a penny thus far. The battery life will last about a day and a half (with all my apps running), the screen is unbelievable, it is super quick, and easy to get around. I'm amazed with the camera, the sound, and the things it can actually do. My only complaint is: No external memory card, but I can even overlook that because it's perfect in every other way. Really much better than the Apple 15. My advice, save a little longer and get this baby; it is worth the extra wait time.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"SAMSUNG Galaxy S24 Ultra Cell Phone, 512GB","reviewDescription":"The Samsung Galaxy S24 Ultra, with its impressive 512GB storage capacity, sets a high bar in the smartphone market, offering a blend of cutting-edge technology, sleek design, and robust performance. Here’s a detailed review of this flagship device:### Design and BuildThe Galaxy S24 Ultra features a premium design with a sleek glass front and back, complemented by a sturdy metal frame. Its large, edge-to-edge display is visually stunning, providing an immersive viewing experience. The phone feels solid and well-balanced in hand, though its size might be unwieldy for users with smaller hands.### DisplaySamsung has long been known for its exceptional displays, and the Galaxy S24 Ultra is no exception. The 6.8-inch Dynamic AMOLED screen offers vibrant colors, deep blacks, and excellent brightness levels, making it perfect for everything from streaming videos to gaming. The 120Hz refresh rate ensures smooth scrolling and responsiveness, enhancing the overall user experience.### PerformanceUnder the hood, the Galaxy S24 Ultra is powered by the latest Snapdragon 8 Gen 2 processor (or Exynos equivalent in some regions), coupled with a generous 12GB of RAM. This combination ensures that the phone can handle intensive tasks, multitasking, and high-end gaming with ease. The 512GB of internal storage provides ample space for apps, media, and files, making it ideal for power users.### CameraOne of the standout features of the S24 Ultra is its camera system. The quad-camera setup includes a 200MP main sensor, ultra-wide, telephoto, and periscope lenses. The camera delivers exceptional photo and video quality, with sharp details, accurate colors, and impressive low-light performance. The zoom capabilities, up to 100x, allow for capturing distant subjects with surprising clarity.### Battery LifeThe phone boasts a 5000mAh battery, which comfortably lasts a full day of heavy usage. The inclusion of fast charging, both wired and wireless, means you can quickly top up the battery when needed. Additionally, the S24 Ultra supports reverse wireless charging, allowing you to charge other devices on the go.### SoftwareRunning on Samsung’s One UI over Android 14, the Galaxy S24 Ultra provides a smooth and intuitive user interface. Samsung’s software suite offers plenty of customization options and useful features, although some users might find the pre-installed apps and bloatware unnecessary.### Connectivity and ExtrasThe S24 Ultra supports 5G connectivity, ensuring fast data speeds and future-proofing your device. It also includes other high-end features like an under-display fingerprint scanner, facial recognition, and IP68 water and dust resistance. The lack of a headphone jack might be a downside for some, but it’s a common trend in modern smartphones.### PriceAs a flagship device, the Galaxy S24 Ultra comes with a premium price tag. The 512GB model, in particular, is an investment, but it justifies the cost with its high-end specifications and features. It’s an excellent choice for those who demand the best in performance, camera quality, and storage capacity.### ConclusionThe Samsung Galaxy S24 Ultra 512GB is a powerhouse smartphone that excels in nearly every aspect. From its stunning display and powerful performance to its versatile camera system and ample storage, it’s designed to meet the needs of demanding users. While the price is high and the size may not suit everyone, it stands out as one of the best smartphones available in 2024.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"The perfect phone that doesn't come cheap","reviewDescription":"PLEEEEEASE people, stop complaining about the display and things like that, the display is just AMAZING!!By looking at the low rating of the item, I was really impatient to recieve my device and finally write the review about it. I pre-ordered the S24 Ultra in Violet color, 512Gb version, and want to note that everything was fair as expected - I got the 512Gb version at the price of 256Gb one, and also 200$ Amazon Gift, which is a non-redeemable gift that works as a single time -200$ to your purchases FROM AMAZON, that you can use within approximately 5 or 6 months.Next about the device - it's really beautiful! I really love everything about it, the size, the flat screen, the back cover and cameras - design-wise this is a beauty.It has lot's of nice and fun features to play with, it's my second day of usage and I still have AI features to test, camera capabilities to check out, etc. And the S Pen - this is my first ever Samsung phone, and I really got used to it, and to be honest - it's sometimes a lot more comfortable to use the S Pen instead of your fingers. Some things in life are really designed to be accomplished with a pen and paper, this phone covers that need!The sound and speakers are veeery loud, I mean my whole office can hear my incoming notifications lol, and the quality of music listening, video watching, etc. - really nice.I still have to find out all of the capabilities of the camera, this is a separate big topic, but so far I can confirm what lot's of reviewers have already talked about - the normal photo taking is great, selfies look really amazing for a front camera, the zoom is fantastic with really good details, night mode results in bright as day photos (although a bit noisy) and video shooting is also nice with different mods.The OS is very nice and really sophisticated to say the least, I mean you can connect the device to a monitor, mouse and keyboard via some 5-in-1 Anker for example, and here you just got yourself a laptop with the size of a phone. OneUI is really the most rich software I've used so far, and before using it I was skeptical if I'd like it or not, but I'm really getting used to it, and the features like multitasking in a true desktop way on the phone - this is something else (not the Dex, just phone multi window usage, that's AWESOME).The battery is nice, maybe I expected something more by viewing some reviews with almost 20 hours of screen time or so, but really it's fine for a day of usage with QHD resolution, adaptive brightness, and app and AI usage during the whole day.The only disadvantages I want to mention are the price tag that is high (let's be honest) and the box contents, I mean why copy bad stuff from Apple and not include at least a small charging brick in the box? This is really uncool, especially within that price.I started with the display, but want to finish talking about it as well, it's HUGE, and I really like it, the corners are sharp-ended, but that gives you the advantage of viewing a non-cropped-out content, the resolution, the brightness, refresh rate... The display is a killer really, I really don't get the people that complain about the color, or perform some tests on the device, etc.... no need.Overall I'm really happy with my purchase, this is a great phone I can recommend to any software and hardware enthusiasts like me, and maybe to iPhone users as well, to come out of the box and see that there are other great phones out there in the world that can totally kill any iPhone with all the features and stuff you get.","isVerified":true,"ratingScore":5,"reviewReaction":"515 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"No more cheap phones","reviewDescription":"This phone is durable. Buy a good screen protector, non flimsy case, landyard and your good. I love the s pen, it's very convenient.  *charging is fast and last all day if not longer Unless ur heavily using your phone. I love the reminder to take breaks, it's bed time.* the cam quality is brilliant, I can see words on objects when I zoom in from a distance.* learn to use the features to get the most out of your phone , like bixby. You won't be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Awesome","reviewDescription":"I think its a bit overpriced at full price but I got it on a prime-day sale.  Its an incredible phone and understandable why its not cheap.  Its feels very premium and solid. The UI is snappy.  The only real complaint I might have is that I wish it had better battery management and faster charging.  Charging speed and battery life is still behind other brands like OnePlus, Oppo, and Xiaomi phones.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Camera is Excellent","reviewDescription":"I was agonizing about upgrading already from my S-22 Ultra. Technical research and reviews sounded like the S-24 Ultra camera was worth the upgrade (at least at Prime Day prices). I found this to be true. The camera handles colors significantly better than the S-22 Ultra (and the S-22 Ultra was quite good). The resolution is also a cut above. The excellent increase in night shot quality was truly surprising and very much anticipated.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Wow, I mean honestly, wow.","reviewDescription":"I heard all the hype, watched all the videos and decided to purchase the Samsung S24 Ultra from Amazon, (Shipped & Sold by Amazon) or rather my FB community purchased this for me through gift certificates. I'm blessed to have them. Regardless, the whole thing started when I decided to purchase something to advance the FB page through the use of video and such. I haven't been disappointed. Everything and I mean EVERYTHING about this phone is phenomenal. I also run a Radar Omega, a weather radar app on this puppy and it just hums along. I haven't been this happy with a smartphone in years, it's incredible. It's a beast though, know that. It's big and unless you fiddle with the settings, not a one handed phone for most. Teamed with an Otterbox Defender case it's well protected. There's no point in spending this kind of cash on a smartphone and cheaping out on the case. Don't hesitate purchasing this monster, well worth the ducats. Everything about it is screaming your name, treat yourself.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"A monster phone","reviewDescription":"The Samsung Galaxy S24 Ultra is an impressive device that offers exceptional battery life, lasting approximately four days. It supports 45-watt super-fast charging, which can fully charge the device in about an hour, depending on the initial battery level. The speakers provide excellent sound quality for a device of its size, comparable to a dedicated speaker. The device has a large screen with thin bezels, inspired by Samsung's Odyssey OLED monitors. The cameras are remarkable, capable of recording 4K videos at 120 frames per second and capturing photos with a resolution of up to 200 megapixels. The phone exudes a premium feel, although it comes at a substantial cost. Despite its price, it is a worthwhile investment for those seeking a high-quality smartphone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Big and beautiful","reviewDescription":"Phone is big and beautiful. OS is super quick. Camera is fantastic. Google phones have always put out the best camera software, but the S24 ultra might compete. The anti-glare screen is a feature I never knew I needed. Even in broad daylight with the phone in dark mode it's perfectly readable. The pen works very well and is a nice little add-on.Some don't like the square edges, but I actually do. Doesn't feel clunky at all to me. Phone is easy to hold and the button layout is the same as my previous phone (S21 ultra). Really happy I made the switch.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"top of the line","reviewDescription":"I upgraded from my Note20.  I really like having the pen which is the main reason I got it.  It has  a cool feature that I use quite a bit where you can hold down the home button and it will analyze whatever is on the screen or whatever you are pointing your camera at and then show you web results.  Or you can circle something on the screen and it will search for that.  Or it will translate text on the screen which can be really useful.  I am particular about how my home screen looks so I really like the feature that can generate an ai picture and use the color palette from the picture to use for the phone theme colors and it can also automatically redo those gawdy standard android icons to ones that look nice with the current wallpaper.  I like the new messages app that works better with those pesky iphone users :). The camera is of course awesome as well as the zoom.  Speakers sound better than my old phone and the battery life is better too.What I dislike most is the sharp corners, they are uncomfortable even with a phone case on.  Also the weight is only about 1\/2 ounce more than my old phone but it is noticeable.  If those issues were fixed then it would be a five star phone.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Bought it \"Used\" got lucky, came with box looked brand new","reviewDescription":"I've only owned every version of the Note series (now Ultra) since Note 4 (did not own the bendy screen one, just regular). So this is old hat, you either love this phone for its S Pen or just go with something else. I use my phone and the pen to make grocery lists, to do lists, draw, edit photos, etc.Pros:-FLAT SCREEN IS BACK. HOLY COW, how I've hated those stupid curved edges, glad that flat is back. Just bring back MicroSD expansion as well. I would say bring back headphones but apparently Android 10 or later killed external mic support via the combo jack. So, that's useless. This was the MAJOR reason why I upgraded my S23 Ultra, no joke, now I can put actual screen protectors on it, don't have to worry about optical glue-on glass that you then cure with UV.Cons:-Love that you can't turn off really annoying unnecessary notifications like the DAILYWELLNESS nonsense, weekly usage reports, \"hey we turned these apps off since you're not using them\".-Love that the galaxy store now has push notification ads that you can't turn off in settings or in app. That's super cool. Save that crap for your GALAXY A lines that are budget oriented, not your professional S lines.-New S Pen, now most of the time, the S-Pens that come with these are SERVICEABLE at best, but for whatever reason, this year's is painful to use, could be old age kicking in at 36 or just a bad design. It's too thin and too square. Last year's was slightly wider. NEVER MIND, just compared them, they're basically the same, it's the fact that last years had a rubberized texture on it, where this year's is just plastic, that's why it hurts to use.Meh:-A lot of this is more the same incremental improvements; cpu is beefier, display is brighter and more betterer, s pen is faster, touch is faster, etc. THE BORING STUFF.Overall:You always take a gamble with Amazon's \"USED\" stuff, and was worried that I was going to get a bad one. I bought, USED VERY GOOD, which usually means cosmetic damage somewhere on the device, and then it was \"USED VERY GOOD, potentially without box\". Mine looked pristine, slapped a screen protector and case on it right away to keep it that way, and it came with a box. You buy this phone if Samsung and styluses are your jam. OTHERWISE there's no real reason to get this. When there are a lot of companies with the 8 Gen 3 out there for a lot cheaper and in smaller more manageable body sizes. Like the S23 Plus or S23 standard. The Titanium Gray color has a slight champagne\/earthen quality to the gray that I kind of dig that's subtle and sort of classy.","isVerified":true,"ratingScore":4,"reviewReaction":"42 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"limited language packs as of August 2024","reviewDescription":"Bought this for my wife to replace her aging s20.  First thing is, the \"titanium yellow\" color is definitely more yellow than gold-ish looking.  A relatively minor thing, since most people use covers that are not clear.My wife is Filipino, and likes having the Filipino (Tagalog) language pack installed, but as of August 2024, there is NO Filipino language pack for Android 14.  Her old phone (S20) was Android 13, and had it available.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Nice phone. Expensive. No SD expansion or storage.","reviewDescription":"Nice Phone Overall. Expensive. Was disappointed when I realized I could not back things up by SD card to save space. Started taking a really long time to charge after only one month. Once charged, it holds all day. Good features but I do not like the awkward control buttons on the side. Hard for me to take screenshots for example.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"S24 ultra phone","reviewDescription":"Received quickly. Price it is what it is high. Product good but battery life not so good. Like the phone it is nice. Thank you Amazon I have s23 ultra it was worth upgrading in my opinion but still I like the phone. Payment plan was great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great phone with 1 little issue","reviewDescription":"The phone is for me at least the best in the market. The only problem i've found is a little discoloration around the phone ports with just normal usr. The discoloration is not permanent, if you wipe it with a cloth it goes away and ut becomes as new. It's just annoying to have some parts of the frame get discolored with just normal and light use.Battery life with light performance mode is more than 24h, face unlock is a little hit and miss but fingerprint is perfect and fast, i used it for a month without any kind of protection and it didn't scratch. Charging is fast ( about an hour and 10 min from 0 to 100), the phone is very good looking, but the price is a little bit steep.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Boxy","reviewDescription":"I haven't used a galaxy series in years but I liked the S 24 ultra. It was fast and takes great pictures. In the end I didn't care for the boxy design so I returned it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Awesome!","reviewDescription":"I love my Galaxy! Has lots of cool settings like when i get a text the edge of the screen light up and thats pretty cool! Battery life isn't the best but charges fast so it evens out","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Over rated","reviewDescription":"You know I wish I returned it enough SAID overpriced and over rated don't need it for just a 5 point camera","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724112000000}
{"reviewTitle":"Review","reviewDescription":"I like this product especially in the battery use. Battery is good. But the price also good. Plus I got two months free spotify subscription.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Excellent","reviewDescription":"Good product, excellent quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Great phone!","reviewDescription":"I was debating about getting a new phone, but glad I did. Was easy to transfer data and apps from old phone with walk you through instructions.  Battery life is great! Everything is so much clearer to read, like getting a new pair of glasses. The camera has so many options, I can't wait to try them all! Love this phone!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Very enjoyable","reviewDescription":"Works no issue!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Excelente 👌","reviewDescription":"Excelente celular","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Way to go Samsung!!","reviewDescription":"I've had Galaxys' and Notes' I think from the very beginning and they have not once dissappointed me.Still the best tech: big, sharp, bright, and beautiful screen, fast... finally got rid, or at least set to \"optional\" some annoying integrantes apps. Finally the camera, the camera is mindblowing!!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Amasing","reviewDescription":"Espectacular","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Value for money","reviewDescription":"Factory unlocked, fast charging, value for money, fingerprint sensors perfect, size is good, comfort of use and lovely colors.Crystal clear camera and loud speakers,Easy to use and great features","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Really Smart","reviewDescription":"A phone this expensive should have expandable memory. Otherwise it pretty cool. The Samsung health app is great. The battery is OK but it's nothing to jump up and down about. The resolution is great. The cameras are exceptional. I'm very satisfied with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Samsung S Series never disappoints","reviewDescription":"Great phone. Battery life pretty decent and lasts the entire day with constant usage. Camera quality is excellent. Loud speakers. Phone quality is very premium. The screen is very responsive. Great value for money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Excellent","reviewDescription":"It's a great option to performance amazing pictures","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Galaxy S24 Ultra","reviewDescription":"It's the first new phone I've had in 7 years. I'm still in the process of learning about all the features.  I upgraded from a Galaxy Note 10+.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Awesome phones","reviewDescription":"Package arrived on time in sealed boxes. The phones are everything they said it would be. Top of the line phones with great features. The phones were unlocked and I had no problem getting them onto the old phones network.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"10\/10","reviewDescription":"Llevo casi 4 meses usando el teléfono y no me arrepiento de haberlo comprando la cámara ufff es hermosa el tiempo de carga igual","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Very nice phone","reviewDescription":"Doesn't come with a charger,  but I started looking on t-mobile and at&t and they also sell it without a charger  so you need to buy a charger so it charged properly the fast chargingI bought this charger Samsung Official 45W USB-C Super Fast Charging Wall Charger (Black) https:\/\/a.co\/d\/13BtUct","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Superb!!","reviewDescription":"This phone is worth every penny. Arrived in immaculate condition. I love the camera, the screen and the feel. Great sound quality and speed.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"Love this phone","reviewDescription":"It is lighter than my old s22 ultra but with little better performance.  I liked my s22 ultra but s24 ultra is little upgrade.  Little better camera and better battery life and lighter than s22 ultra.  It feels well made on my hand.  I do like flat screen because it's easier to put screen protector compare to s22 ultra curved screen.  I love my phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Amazing photos","reviewDescription":"Love it. Takes amazing photos, has good storage and is definitely a quality device.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"camera is so good","reviewDescription":"Over all nice device  Gaming is ultimate ex: pubg runs smoothly on 120fps no major drops","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Awesome phone, it takes great Pictures and videos.","reviewDescription":"It takes awesome clear pictures and videos, when I went on vacation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Best Samsung on the market","reviewDescription":"This phone is so nice, the screen is huge and perfect for watching movies, very responsive screen and the cameras are super nice. The only things that I miss from my iPhone are iMessage and FaceTime lol but of course those are IOS exclusive apps. The camera preview can be a little tiny bit grainy but after the camera processes the photo it looks amazing.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Do NOT purchase the Samsung S24 Ultra!","reviewDescription":"Since my S22 Ultra died, I began phone shopping. The S22 Ultra is an amazing phone, however it had several flaws. Nevertheless though, I thought for my next phone I would again go with a Samsung S24 Ultra. I was a little worried, since there have been a lot of people online talking about the S24 Ultra's screen quality being particularly bad for a Samsung device. Usually, the displays on these phones are some of the best. However, people online would talk about how the uniformity on the screen is bad, that there are color banding issues, or that it's extremely grainy relative to their old device. Honestly though, I wanted to order one and find out for myself. Were these issues really that bad, or was it a small problem blown out of proportion?Hoooooh boy...!When my S24 Ultra came in, the first god damn thing I noticed WAS the grain. Jesus christ, that grain. Yes guys, it is serioisly that bad. I believe some S24 Ultras don't have the grain nearly as bad as some others, but the device I recieved had the most atrocious OLED grain I have ever seen in my life. It would just turn any solid color, smooth gradient, and everything really, into a construction paper drawing. I AM NOT EXAGGERATING, IT IS REALLY THAT BAD. Under the glass, it looks like the manufacturers sprinkled colorful moonsand onto the OLED panel. The pictures I'm attaching this review do not do it justice, it is way worse in person and is there regardless of brightness. EVEN AT MAX BRIGHTNESS!!!It's a shame, because the phone is truly amazing otherwise. The cameras aren't as good as the specs and marketing would have you believe, especially with their default shutter speeds and motion handling, but they are certainly good. The performance is OUT of this world! If you're a power user, the S24's overclocked SD 8 Gen 3 is truly the king of Android SoCs, it is unbelievable. Never seen a stutter or hitch on this device when doing anything. It feels amazing to hold, it's weighty and certainly feels premium. The S Pen is an amazing feature, as well as the AI Stuff, the battery life is great. I really, really, really, REALLLY wanted to like this phone but... Yeah, naaaah. The display that my device arrived with is really that bad. Even my old S10e's screen is as smooth as butter, and as beautiful as I remember a proper OLED screen being. This one is just horrible.As for alternatives, I would suggest the Red Magic 9 Pro ($649!!!), the OnePlus 12 and OnePlus 12r ($700-$800 and $500 respectively), the Z Fold 5\/OnePlus Open (considerably more expensive, but the form factor on those is killer), any of the iPhones, and even the damn S23U! (Gets all the same features as the S24 Ultra, just on a SoC that is marginally slower for practical use, and without the damn sandpaper screen)Incredibly disappointed. Stay away from these devices until Samsung has issued a statement or has totally fixed the screen problems!If you've made it this far, here's a cute picture of my pet cat. You've earned it.","isVerified":true,"ratingScore":1,"reviewReaction":"85 people found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Be careful of re-labeled products if you order the US Version","reviewDescription":"I ordered the US, Unlocked version and it was sent via a third party seller.  Upon receiving the phone, the box did not look like another one that I had recently purchased for a family member.  There were clear plastic \"circle\" tamper seals on the box, not the black \"pull to open\" and \"do not accept if broken\" security stickers.  Upon opening up the box, the phone appeared to be ok, correct size, weight and every camera lens did have a sensor behind it, however, it did not seem to have the cut-out below the power button for the MMW 5G antenna.  This is a dead give-away that the phone is not really a US version and would potentially be incompatible with 5G in future areas were MMW might be deployed (its not currently an issue today as far as I know).  I was able to check the IMEI online to determine that the model number of the IMEI was a Canadian variant that has different 5G antennas inside. I was able to process the return, and was worried that the 3rd party seller would give me a hard time or claim that I did something to the phone but they did not so kudos to them. They did not seem to think anything was wrong with the phone when i talked to them, i essentially returned it based on it not looking like an identical phone that i had purchased a month before and they were ok with that.  I do not know if the seller knows their device is really a Canadian version IMEI repackaged as a US version phone, but buyer beware.  Might be best to just buy this one direct from Amazon to make the returns less painful.  The process for this return took several weeks and a few phone calls to get my money refunded to my account, a bit more stressful than a Kohl's dropoff.  If the boxes stickers look off, or printed with blurry text, or the phone doesn't have the cut-out below the power button...you aren't getting an unlocked US version and you should return it.","isVerified":true,"ratingScore":1,"reviewReaction":"44 people found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Wow I'm surprised by how bad the quality control is, not happy.","reviewDescription":"Please look at the pictures they speak for themselves. This is right out of the box what the phone looks like and what my immediate experience is. Mind you this is not an inexpensive phone. The terrible quality control on display here is shameful. For starters the first thing I noticed was the nic of three pretty obvious scratches to the right of the front facing camera just as I peeled off the screen factory sticker. Then I started looking around seeing if there was anything else thinking I might be able to live with it and sure enough there was a few scratches around the metal camera bumpers which yeah maybe I could of lived with that too. But the worst was the s-pen, IT IS STUCK IN THE PHONE :(...... Shameful. And it looks like quality control knew because it looks like they tried to dislodge it and get it to come out. The reality here is that they knew about that and decided to package the phone and ship it out only for someone (me) to discover. Like what were they thinking, someone would just be cool with that. This is a flag ship phone and Samsung is doing this? Very concerning, downgrades the brand in my mind. I had high hopes for this, I'm coming from an s21 ultra and was super excited to get this. Very disappointed as I am pretty invested into the Samsung ecosystem, now I'm thinking about returning my Galaxy watch 7 I just got and just going to the OnePlus 12....cheaper anyways.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"Should have kept my S22 Ultra","reviewDescription":"15 years samsung flagship user here!I’m extremely disappointed with the Galaxy S24 Ultra. Here are some of the major issues I've encountered:1. HDR Video Sync Issues: When recording in HDR, the audio and video go out of sync after just two minutes. This is unacceptable for a flagship device.2. Video Recording Freezes: While recording, the video isn’t smooth at all. It freezes for a second quite frequently, and this is very noticeable in the final video.3. App Performance Issues: Many apps don’t run smoothly. I've had issues with several apps not updating correctly, like emails that only appear after 10 refreshes.4. Lens Switching in Video Recording: Switching between lenses during video recording is anything but smooth. It feels more like a choppy 12 frames-per-second video, which ruins the recording quality.For a phone in this price range, these problems are unacceptable. I expected much better performance.I should have kept my S22 Ultra! Waste of an upgrade.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724457600000}
{"reviewTitle":"I feel cheated, horrible camera  , I am not sure if this is the right place to buy your phone from","reviewDescription":"I recently got the phone everybody was hyped about it so I got it. Everything is great about it except the camera.   I am really disappointed with the camera there is a lot of blur and the night photos are really horrible. I have compared it with the old Samsung generation and iPhone,  they looked way better than the S24 Ultra. I have watched every video on YouTube, I tried every stupid setting, and it is just the same result over and over,  horrible pictures and videos. I am really sad and it is not a cheap phone, you pay all this money for what? I understand that there are some people who loved the Camera on S24 Ultra, and some people got great pictures. I am just not sure where I go wrong, I have tried everything on my end and kept getting the same results. The phone is the issue and I feel cheated. Other than the Camera everything is GREAT!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"I would NEVER recommend this And DON'T recommend this to my friends","reviewDescription":"The UI is terrible my s22 is soo much better. I dont know what they were thinkin but I'm stuck with a lemon. its absolutely terrible.I've bought\/have nothing but samsung phones for over a decade and this IS by far THE WORST phone I have ever had from Samsung. ALL UI seems 2 B \"Bass-Ackwards\". I mean one of the greatest things on the S22 UI was that, with a single swipe of pull down  screen u could adjust the brightness of the screen AND adjust ur music, ALL IN ONE SINGLE PULL DOWN. this S24 U swipe down once to adjust music then u must swipe down again to expand the menu so u can adjust the brightness of the screen. Hey let me tell u in bright sunlight u can barely c the screen so trying to pull down again to expand the menu can be next to impossible. In bright sunkight I get so frustrated guessing at what\/where a button should be and NOT hitting it but hitting another button and it just screws up everything. BRING BACK S22 UI TO THE S24 SAMSUNG. STOP TRYING TO BETTER PERFECTION.","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1715040000000}
{"reviewTitle":"Disappointed","reviewDescription":"There are many big things that this phone does right and I appreciate them. Unfortunately, they are overshadowed by the one small thing that was bungled, the fingerprint sensor.I occasionally appreciate the performance when I play a game. I occasionally appreciate the camera when I take a picture. I constantly hate the struggle it takes just to convince this stupid hunk of junk to unlock every single time I use this phone. Not to mention apps that authenticate with fingerprint as well. Whatever or whomever convinced the industry to move to on display fingerprint sensors was mistaken and stupid.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Phone is one of the best I owned. Amazon however, you disappoint me","reviewDescription":"So far I have really like this phone. I had an S23 Plus but decided to upgrade because I didn't like the camera on the old phone (Petty reason I know, don't judge me) and I wanted the S pen since I do a lot of demos on my phone as part of my job. Overall I have been happy with the Ultra, haven't had issues with the display as some people have said, camera runs great, and I just have had good luck.However, Amazon, my guy, why you lying to us? Turns out that yes, the offer exists and can be used... but it's not an Amazon gift card... The promotional balance can only be added on purchases of Amazon created and sold items meaning Amazon Basics, Amazon Essentials, etc. That was NOT what they put on the promotional material and it is BS that they pulled it all down to cover their tracks. Therefore I need to sacrifice this review of an overall great phone because of Amazon. I fear they will come for me in the night, so if you are reading this, spread my story to all corners of this earth.","isVerified":true,"ratingScore":1,"reviewReaction":"95 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Samsung thinks they still on the phone","reviewDescription":"This Samsung 24s ultra maybe the most annoying thing I've ever bought in my life I've always had good luck with Samsung equipment until this one and I'll never buy another one again they think they still on the phone they ask you questions to comply with things they want but they give you no place to disagree when you call them they give you an annoying machine to talk to it talks over you if you buy this thing you're a fool.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1724198400000}
{"reviewTitle":"Samsung really screwed up","reviewDescription":"After using this phone for a few weeks, I can honestly say, \"I Hate It!\" You can no longer add a memory card to your phone so that is just sad. I will not be using The Cloud Or Google to store my photos! It is heavy and uncomfortable. I hate they put the on off button on the same side as the volume buttons. I absolutely do not see a considerable difference with the picture quality. I was happy with my Galaxy S9+. It has been a great phone and because of that I was looking forward to what was suppose to be a vast upgrade. Do not waste your money on this phone. it is not worth it. After this huge let down, I will never buy another Samsung. lt was to much money for what seems to be less of a phone and more of a headache.","isVerified":true,"ratingScore":1,"reviewReaction":"37 people found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Buena compra","reviewDescription":"Estoy encantado con el celular llevo varios días de uso y puedo decir que tanto en rendimiento como en estética es de lo mejor que puedes conseguir de una gama premium, pero hay una cosa que no me gustó y es que en la caja donde venia no tenía una capa protectora y también era mucho más grande. Pero por lo demás no me arrepiento de la compra totalmente recomendado.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"Mexico","date":1714262400000}
{"reviewTitle":"I can only make calls. I cannot answer a phone call.","reviewDescription":"Does not function properly. I cannot answer a phone call. Also, voicemail functionProbably will return if T-Mobile can't get it to work properly.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Oferta falsa","reviewDescription":"Compre el Samsung galaxy s24 ultra de 512gb y decía que si lo compra antes del 30-01-24 me daban el doble de almacenamiento y trae solamente 512gb","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Please no damaged products","reviewDescription":"Phone defective have to send back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Item used","reviewDescription":"Selling used item as new","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Way too much money for a Samsung","reviewDescription":"Not worth the high cost,Now I've learned my lesson.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"doesnt come with advertised promotion","reviewDescription":"amazon has not provided the promotional credit. phone is also horrible.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Publicidad falsa y confunsa.","reviewDescription":"Compre el artículo en pre orden y decia que si comproba me daría el doble de almacenamiento pero es mentira.Fue solo para que compráramos.","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"pointless","reviewDescription":"pointless","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Big mistake I made with this phones","reviewDescription":"The phone is mostly good to take pictures and the pictures of the moon is digitally put in there, fake. The phone antenna is weak and at times no networks are detected for no reason. I hate that the screen goes black while on a phone call answering questions to select options. It goes black and no way to fix that.I can't believe I spent all that money on nothing, just to have a good camera on my phone. I had no choice but to wait till the end of the contract, because otherwise they will charge me full price if I end the contract sooner, at least with Verizon. Very intrusive and bunch of useless functions. I will never buy Samsung ever in my life. I had bad experiences with them in the past and got this phones to please my wife, but as soon as the contract ends next hear, I will get another brand and discard these ones for good. They simply suck. 🤮👎👎","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1725062400000}
{"reviewTitle":"Extremely disappointed. Samsung failed! Again!","reviewDescription":"Overall, despite my efforts to love it, the S24 Ultra obviously is an inferior rival to the iPhone. It made me appreciate how much better the iPhone truly is. The display, which was supposed to be a standout feature, turned out to be very disappointing. I bought the S24 Ultra to replace my main phone, the iPhone 15 Pro Max, and placing them side by side just highlighted the S24 Ultra's dull and washed-out display. Ironically, the iPhone's display, made by Samsung, offers a way better experience with more depth and sharpness, looking crystal clear from every angle. The S24 Ultra's display sadly has a green tint when viewed from different angles, an issue that I believe has persisted since the S8 and S9 models. The speaker on this $1,000 phone sounds cheap and muffled, whereas the iPhone's speaker is clear, warm, and delivers distinct bass. I had forgotten about battery anxiety with the iPhone until I used this phone; the battery drains quickly and barely lasts a full day on a single charge. Switching lenses between cameras are significantly slower and more laggy. After so much debating, I had to returned it on the last day before my 14 days window closed and it was such a relief!!!","isVerified":false,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Excellent Phone at competitive price","reviewDescription":"Mainly used for camera during my travels. Picture quality awesome","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Amazing smartphone at an absolutely amazing price","reviewDescription":"Took the new phone and old phone to the Carrier for SIM swap and were on our way in 15 minutes with no charge and no change to unlimited plan. Couldn't have been any easier!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Brand new ✨️","reviewDescription":"I just got it can't wait to test it out fully, it's a 512GB fully unlocked Samsung galaxy s24, bad side the box was a bit beaten up but phone work well, it takes charge, will update my review after more use, so far it's great feel heavy in the hand and the size is just lovely","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Camera","reviewDescription":"Love the camera","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Compartir","reviewDescription":"Buenas tomas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Perfecto 👌","reviewDescription":"Rapido en llegar","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Great machine","reviewDescription":"I’m IPhone user but this samsung phone blows my mind excellent screen and cameras","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Calificación","reviewDescription":"Me agradó la seguridad y eficiencia del producto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Excelente producto","reviewDescription":"Excelente producto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Worth every penny","reviewDescription":"The picture quality is pure perfection","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Terrible battery life...and it's \"brand new\"?","reviewDescription":"I don't think so.  I've had the S3, S4, S10, S20, and recently dropped the screen on my S21.  I've been a Samsung loyalist mainly because it's the best Android option, not for any other reason.  That being said, it's time for a change.I wanted to segregate the apps from my old phone and what would become my new phone, so I tried manually transferring data and the only apps I wanted on the new phone.  I planned to use my old phone for GP App use, so less apps would have direct access to my primary cell phone (I'd use mobile hotspot as needed).  It didn't go smooth, maybe it was my impatience, but there was an awful amount of bloatware and AI non-sense that no one needs.  I tried uninstalling what I could and got only so far.  Then I just gave up and used the Samsung app to drag everything from the old phone to the new phone.  It was OK but bloatware reappeared.  I wasn't happy because it neither adopted all of my prior phones settings, and neither all of my new phones settings...just an odd combo of each.My main grievance was that the battery drained so fast WITH NO USE.  After buying this phone, I still used my prior phone mostly at home and my laptop as well.  I rarely used the new phone for anything.  The battery simply drained dramatically for no reason.  I checked what apps were the cause and 1.  didn't list any apps used other than what I actually did use 2.  I think Windows Defender or whatever the Samsung equivalent is, was the primary source?  But even then, the % was so low.  But why go from 100% charge to 75% overnight, while I'm sleeping?  No thanks.  I gave it 2 weeks and this didn't change.  I thought some smartypants AI non-sense would adjust it, like I read somewhere but no dice.Also, somehow this phone\/software kept backing up data I did NOT want backed up and in any cloud.  With the primary competitor to this phone the Pixel, a Google phone, I'm not sure what Android options remain.  I'm leaning towards a Tablet I can carry around and connect via Mobile Hotspot for apps and other uses.I also had mediocre data and cell reception quality.  It might have been the protector\/case it was in, because I've had many Galaxy phones since the S3 with no problems in that department.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Eh ...","reviewDescription":"I kept this phone for 2 weeks before returning it. I wanted to get a good feel for it and I just ... Couldn't. Idk ... For the price, I just felt like it could be better? Also, the picture quality was all over the place. Sometimes, my pictures would come out beautiful but at other times, they were extremely grainy. Could be user error BUT for a phone that cost as much as this one, I would expect to just turn the camera on and have amazing pictures without adjusting the settings too much.The funny thing is after I returned this phone, I got an S23 Ultra which came out a year before the S24 and I find it to be better in a way. The pictures seem much better and honestly, they're so similar ... You can't really tell a difference unless you're really into phone specs. Plus, the S23 Ultra was cheaper but still superb.By no means am I a tech junky. I just wanted a new phone and the S24 Ultra simply didn't give me what I wanted at the price point.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"The S24 Ultra, the world's current flagship phone shipped with a glitched out screen.  Unacceptable.","reviewDescription":"At first I thought that it was just me, but it isn't.  It's everyone.  The world's current most expensive flagship phone actually shipped with a glitched out, awful looking  bland washed out screen that is cringe inducing when looking at it.  If you're expecting the beauty of the previous S2X phone series, you won't get it here, this screen is BAD and shipped effectively broken and not working properly to every single customer.  Honestly, everyone should be refunded and if there's a class action lawsuit, I'm definitely joining it.  All of the colors look completely washed out and almost pastel, it's just . . . BAD!  It reminds me of installing a wrong video driver in the 90's or if you're using an unsupported color\/resolution mode.  Aside from the color just being horrendous and completely inaccurate, text looks smoothed and slightly blurry making it off-putting to read.  Looking at the S24 Ultra beside of the S22 Ultra is like night and day, no way in the world would I recommend someone to buy a S24 over the S22 or S23.  The S24 looks like garbage.  How in the world did they justify shipping it like this?  How in the world are they getting away with this?!  Massive respect and faith has been lost in Samsung as a smartphone leader in my eyes due to this.  Also, it's extremely suspicious that NO tech reviewers mentioned this, as if they were told not to or something.  I smell a lawsuit on the horizon . . .Shame on Samsung, big time . . .  I've been a loyal customer since the Galaxy III, but I think that this debacle has ended that long run that I was very happy about.  I feel betrayed and duped.DO NOT BUY THIS PHONE.","isVerified":true,"ratingScore":2,"reviewReaction":"100 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"LOVE THE FLAT DISPLAY but.. uh","reviewDescription":"edit: after using for about a week... phone still doesn't push gmail notifications after being idle for 20+ minutes.  Seems like android or samsungs being too aggressive in making apps sleep in order to increase the Batter Life statistics for reviewers or something.  Seems to be happening on all my android devices... so not sure if it's an Android 14 issue ('feature') or just the company trying to make their battery life seem better than it is bc they're forcing apps to not be able to push notification.  I only get notification pop-ups after I unlock the phone.... which is almost useless.---finally the human race has come to the conclusion that curved edge displays are absolutely not it.  thank you. thank you. thank you.  The phone physically looks fantastic.  Feels great.. flat display, finally.  Speakers sound good.  Spen color doesn't match... no idea why they can't figure that one out.  Seems like an easy thing to do.  Still doesn't have secure face unlock... iphone does it.  Pixel does it...the thing is, i am barely able to use this phone because it didn't come with a charger.  this phone msrp $1,419.99 and the company doesn't include a charging adapter? $1,419.99.Also, so many features\/customization options have been removed.. only mentioning a few out of the dozens, but the color settings don't allow for a vivid option that works.  The display is grainy.  There are color banding issues.  you can't change the brightness level of the AoD.  Bixby can't 'dismiss' a timer that has gone off (apple can do this)... so you have to physically press \"dismiss\" instead of saying \"bixby, dismiss timer.\"  again, i am mentioning a few out of DOZENS.","isVerified":true,"ratingScore":2,"reviewReaction":"63 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"The screen color is a DEAL BREAKER","reviewDescription":"I, like many others, are in complete shock of how BAD, DULL and WASHED OUT the screen colors are on this phone. Surely these are defective, I can't think of any other reason. This simply can NOT be on purpose like they claim. Along with that, a lot of games I've played have a very slight 'stutter' or lag every other few minutes. I am furious I spent all of this money on phone with subpar screen colors, I mean that has to be in the top 3 aspects of a phone, marked at this price, that NEEDS to be perfect, no exception.I don't know if my phone is defective, but I'm not at all satisfied. If Samsung does not fix this egregious issue, I will have no choice but to return in. That's the last thing I want to do, it's a gorgeous phone otherwise but the color and lag issues are seriously insane for a phone that costs this much.SAMSUNG - You NEED to fix the color issue, save your reputation. I will have no other choice but to NEVER buy your phones again after this.","isVerified":true,"ratingScore":2,"reviewReaction":"9 people found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Infuriating complications. Cumbersome Samsung interface overlay","reviewDescription":"First, data transfer: you have to go through a bunch of advertising hurdles and a treasure hunt to figure out what to do next.Later, much later when thanks to cheer luck and many tries you finally get thing downloaded, you get a message \"to complete account setup click here\" > empty page.After trying several ways around, you get a message asking you to enter a code that was sent to the very email account you've been supposed to access for days to complete setup...Btw, i've been using Android phones for years. Never seen so many hurdles, so many options, so much marketing included in the interface.Samsung interface overlay (Launcher), that you can't do away with, is overly complicated. I can't find out how to organize my interface. One UI is too smart by a half to be anything but frustrating for a lambda user.Great camera though!!PS -  The 2 stars don't reflect the actual quality of the phone but the way I feel using it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Bluetooth is a problem","reviewDescription":"I continue to experience problems with the Bluetooth on this phone. While it connects flawlessly, it keeps prompting me to accept or reject an incoming call - this is after I already answered the call and talked to the person. The only way to get it to stop is to disconnect my Bluetooth connection and reconnect. This problem occurs in multiple cars with different audio systems.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Battery issues","reviewDescription":"Doesn't hold charge long and doesn't charge fast even with x2 fast charger. My bf has a 10 and his charges fast with x2 charger. Don't buy used.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Camera is bad","reviewDescription":"After you take a photo. They process it and make everything dark. It just like applying a black shadow all over the image. And there is no way to revert it","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Phone is not Unlocked & Opened","reviewDescription":"Phone was described as unlocked, but it is lock to the AT&T network. Tried to unlock phone by contacting AT&T but couldn't due to phone having payments remaining. The box was opened prior to delivery. Returned phone for a full refund. Please update your description that the phone is refurbished and not currently unlocked.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"SAMSUNG GALAXY S24 ULTRA","reviewDescription":"I have waited awhile before i reviewed this product it is great for day-to-day use. At a minimum it takes great pictures and video. The screen is a great size for people with average to large hands. At first glance it looks like a standard ultra model its big, orbital lens separation, sturdy, bezel with a sleek design. I have been a Samsung fan since the galaxy line up started and practically owned every model out there to test and see which one is practical me the average joe. If you a minimalist this might not be the phone for you. This has the latest tech and probably will be overwhelming for you. This is due to the endless features that it has. If you are a gamer and have several hrs to kill on your favorite Mobile game this will meet your needs and then some. If you are that person that has been a Samsung note fan than this is the phone for you. If you're a movie junkie this will def suit your needs, when you're on a break from work or just hanging out. The color details are great especially in 4k. With this being said there are some quirks that i did not know existed and will pass it on to everyone. The s24 ultra has some drawbacks if you are purchasing it directly through Samsung. Your video calling will not work on with carriers - the reason for this Samsung does not have to voip it's a software according to Samsung. This is when you go to your contacts, and you have the option for video calling. This apparently cannot be put on by your carrier as they will deny trying to add it.(Samsung blamed the carrier , the carrier blamed Samsung) After several back-and-forth conversations Samsung told me to download a 3rd party app to allow me to video call. Other providers told me they could not help me. Now would you want to tell all of your contacts to download a 3rd party app and you would have to ask yourself \"would you do it for one person?\". Moving on to text messages and multimedia. You would normally be able pictures direct to people where it would show on the receiver's messages. But instead, it will send them a link that would expire in a certain time frame. They will then have to click to download the image to their phone. My question would be, how annoying that has to be every time i send someone a picture. They have to go through a ring of fire just to see the image or video. I have also asked about this with carriers they have stated, you guessed it go with a third-party app.  to the upside the phone is great. Standard android system as they have always been great but with a lot more at your disposal. Gpu is exceptionally fast (doesn't feel laggy or buggy) Camera is outstanding have taken countless photos with it. Videos are not grainy as some cameras from the galaxy line up once were. The phone is unlocked from Samsung. Bluetooth is great, connects fast and easy. Graphics are great for this model (does not overheat like the previous models when gaming) Overall if you want a phone that does the job this can do it. But do not purchase it directly from Samsung, purchase it through your carrier to avoid the hassles and dragged-out conversations i have gone through. I hope this helps you make your decision a little bit clearer on how you want to proceed on a new phone. I am giving it 3 stars from the manufacture. There was no recourse rectifying a solution. Also, for placing blame on another company and have me contact them, rather than Samsung trying to speak to the carrier direct that it also provides phones to.","isVerified":true,"ratingScore":3,"reviewReaction":"30 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Bugs and issues, unknown if all can be fixed with updates","reviewDescription":"The bad:Screen colors recently fixed so I upped the stars to 3Reception is middling (compared to my Note 20 Ultra it's a bit worse)Camera white balance is straight green\/blue and images\/video are just darkWide angle camera is not as wide as my Note 20 and no better qualityWhen on speakerphone, the top speaker cuts out if you get close to the top speaker.Generally jagged user experience due to a bunch of Samsung crap that cannot be removed.Bloody expensive for something that's delivered in this state.The meh:Batt life is good (not great, just good) only if run in 60hz and low power mode.In low power mode at 120hz the batt life is merely acceptable.All compared to my 3yr old note 20 in low power 60hz mode which is just below acceptable.The good:The antireflective coating on the screen is genuinely amazingThe 120hz on the screen is uber smooth but unfortunately hits the battThe rest is fine; not different from my Note 20 UltraThere's a thread on the Samsung forum that's thousands of posts long about these same issues I've brought up here. The screen color issue has been improved with a recent update (3\/7\/24)Hopefully all of the bad can be fixed with a software update but currently the phone is borderline unusable due to the extremely blue camera(s) white balance and lacking signal strength. I cannot understand how after ALL THIS TIME, Samsung seemingly doesn't test their flagship phone before manufacturing and shipping.As for the cameras, they're okay if the white balance wasn't green\/blue and dark. My Note 20 from 3yrs ago takes nicer looking pictures but it's honestly difficult to tell if the cameras are any good because it's just so green\/blue. If you edit each image one by one on an appropriate editor (not the built in one), you can get the images to look pretty good but a typical iphone 15 takes the same looking image without any editing. Reviewers are showing carefully shot images of scenes. General picture taking without much thought results in pretty bland\/poor looking images you don't care to share. I really wish they would allow you to adjust at least the white balance settings in the camera app such that the images it takes are correct to what you desire by default.I don't know what to say about all the tech reviewers out there raving about this phone. Either they were given a completely different phone or they're all paid off. I wouldn't recommend this phone to anyone until Samsung addresses the ridiculous issues. I do believe all but the signal issue can be fixed with an update but that would require Samsung to admit there's an issue and then address it which seems to be difficult for them to do. The signal issue may even be able to be improved with a radio update but again, Samsung needs to admit there's something wrong which they don't want to.I absolutely hate Apple due to their requirement for you to live in their ecosystem but this will likely be my last Android if Samsung or someone else can't get their act together on such an expensive product.On a very very positive note, the antireflective screen on this phone is genuinely incredible. It's the single biggest upgrade imaginable. Unfortunately putting any screen protector ruins that feature so I'm just going to use it without a screen protector. The phone is worth buying simply for the antireflection. It's THAT BIG of a difference. I cannot understand why this isn't getting more attention. The darn signal strength issue is the single biggest deal breaker and so unfortunate and annoying. It's about ~15% worse than my 3yr old Note 20.","isVerified":true,"ratingScore":3,"reviewReaction":"230 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Not to Impressed","reviewDescription":"I had high hopes for this phone, especially the Camera. I read everywhere it is one of the best Cameras and features right now, so I bought the Phone. Especially this is my 3rd in the Series. I had a Galaxy S9, then 22S and now 24S Ultra. I LOVED my 22S pictures, zoom just about everything. This one don't take nearly as great photos and has not a stable focus and gets fuzzy for Close Ups. I don't even have a Macro setting, well I can't find it anywhere. I joined a Galaxy 24S Forum on FB and it seems like 1\/2 the people are satisfight and 1\/2 the people have same or similar problems with the Picture taking like me. I honestly bought this phone mainly for the camera and now I feel like I wasted alot of money and I am dissapointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Good phone but lousy battery life","reviewDescription":"According to the advertisement this phone is supposed to have an amazing battery life, but if that's so why does mine have to sit on the charger all day?  Even with the screen so dim that I can barely see it the battery only lasts a few hours, and there's nothing running in the background.  Either I have a defective phone or the part about the battery is a lie.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Huge phone and freeze","reviewDescription":"Too big for my liking.  Not sure if its the built in GPS app but the first day I opened this phone to see what it was about, it was freezing with all that storage.  It has a lot of AI features but I'm a bit private so it's not for me. Weight wise it was moderately heavy, I would have wanted it to be lighter","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Good phone, but not easy to move from iPhone","reviewDescription":"I used an iPhone for a long time and decided to give Android a try. While most things were fine, I ran into a big problem with group text messages from iPhone users. My new phone also didn’t work with my car’s CarPlay system, and my Apple Watch doesn’t work well with Android either, which has been frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"So underwhelming","reviewDescription":"Longtime Samsung customer and big fan of the Note series. I upgraded to the S24 from a Note 10 that was starting to bog down. The S24 has some improvements but overall it lacks in speed and signal strength compared to the previous phone. I have come to expect better from Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Grest Deal Great Phone BUTTTTT Delivery was terrible","reviewDescription":"FedEx kept showing up at 2 for a delivery that required a signature. Had I known it was FedEx, I would not have bought it. I spent 3 hours of 5 o'clock traffic driving to the airport to pick it up.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1724198400000}
{"reviewTitle":"It's ok","reviewDescription":"I like the extra storage space. I'm still learning the new features it has. I had a Samsung A53 5g. This is an upgrade of it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Good phone with slight problems","reviewDescription":"The s24 ultra is extremely fast (compared to my old device, zflip 4), takes good pictures, and has a good overall appearance. (Though I wish the screen were curved like the s23 ultra). However, I decided to return it and order a replacement because I kept having small issues with it. For instance, the usb port seemed a little defective as it sometimes failed to connect to my car\/PC. In addition, the display is kind of disappointing as it does not offer as much as my old samsungs did. Especially in the dark, the display seems very uncrisp\/muddy. I tried to change the settings many times but failed to achieve my expectations. I heard this is a common quality issue with the s24 ultra, so I hope the new one I ordered does not have the same issues.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"So far so good","reviewDescription":"Went from S9+ to this, so need to get use to size and the buttons on the right vs left.  Lots of new features.  If it last me 8 years like the 9 I'll be happy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Great","reviewDescription":"Only thing wrong is product costs too much.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Worked like a charm and absolutely amazing","reviewDescription":"Great purchase , great phone .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Love Samsung!","reviewDescription":"Arrived and is working great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"S24 ultra","reviewDescription":"It's very fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"I love this phone. Samsung is the best. Love it","reviewDescription":"Everything about this phone is awesome. Easy to use, and Easy to operate. Great value for the product you get. Excellent camera with lots of photo & video options. Quick recharge. Sound is great from movies to your own video. Phone lock is easy to set up and change if needed. Overall performance of the Galaxy S24 Ultra is Outstanding.  Buy this phone you will not be disappointed. An Excellent item in every way.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"Wonderful cellphone","reviewDescription":"Simply the best ever","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Perfect","reviewDescription":"It's a great phone the best android phone out there by far. Camara is wonderful. The charge last for a whole day is wonderful.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"DO NOT BUY FROM THEM!!","reviewDescription":"I've had my phone 3 weeks. At least once a week, it says there's moisture and won't charge. I have not been in or around any water or rain. I use a wireless charger to recharge my phone. The last time, phone was in my purse, after dark in the car, is not even hot outside. And now the wireless charger won't even work. I contacted Amazon they say it's non-refundable. And there's nothing they can do. So I spent $1,500 on a piece of junk?","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Speechless","reviewDescription":"No words could compare to this phoneBest of the best","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Never stayed on","reviewDescription":"Out of the box, this phone never stayed on. It powered on and did the transfer of emails, texts, and calls. After that, it restarted and never stopped restarting. The only message was optimizing one ui on restart, but it continued to do this every 2 to 5 minutes. Samsung and Amazon made me go through the troubleshooting but none of that worked and was repetitive. Ultimately, they asked me to call but the phone shut off over and over and never completed a call. Sent back as quickly as possible. Not worth 1500 for sure.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"CantbGet Rid of It Fast Enough","reviewDescription":"1. SIM Tray is junk it affects SIM card usability 2. Junk Case,  for \"free\"  3.  Paid $730 after Trade-In of S22Ultra, special, pre-ordrr savings disappeared on day 2 of release  4.  Unlike S22U, SmartSwitch is a waste of time, unlike its usefulness in prior years, I spent days transferring files and data manually 5. runs hot 6. dull screen which no \"Advanced Settings\" adjustments could alter eye strain became unbearable 7. I'm certain my phone was either used or a floor model, it arrived fully charged with setting already modified when watching YouTube vids \"DO This First for 24Ultra\" 7.Thevworst of the worst, when I decided to return it, Factory Reset was non functional, after 10 attempts, went to YouTube for instructions. Clean Wipe using side keys didn't work it just turned the phone on but I couldn't shut down bc prior Resets had changed only 1 Setting- Power Off side buttons became  Bixby Options.  I had to manually uninstall Apps, 1x1, except I could not remove  my personal accounts info. Based upon polorized Reviews from Reddit,I'm convinced that Samsung sold 2 different products upon Release dates.  As of 2\/14\/24, Samsung has already announced Major Updates effective 2\/26  to  addtrss the numerous glitches for S24Ultra models.  The SIM tray issue is ignored bc it's a hardware malfunction \"No SIM card\" error messages made the phone unusable. Save your $$$$.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Display can't keep up with budget devices","reviewDescription":"The screen with the s pen can do 500hz sampling rate but without, even in game mode, it varies between 125hz to 200hz. It's completely capped at 125hz outside of gaming mode which makes scrolling and the like feel choppy like a phone from 60hz display days (when the standard *was* 120hz touch sampling rate) Even budget phones stay at 240hz. They sponsored the Call of Duty Mobile Championship but the game is just awful to play on this phone the view is super choppy. Cod Mobile looks better on my Pixel 6. The lack of customization makes me feel like I'm using iOS. Can't choose between 4g or 5g only, don't have the option of a vertical scrolling app drawer, can't force 120hz, the list goes on. At $1400 this is really a joke. Even the charging, I never was able to achieve over 13w wired. The cord they included was garbage too, can't even use it to transfer data to\/from a computer. It's bad enough not including a charger at $1400 but not including a decent cable is just insulting. I thought the 24u could replace my using a Pixel and a Redmagic but it looks like Samsung just gave up on quality while charging even more than Apple.","isVerified":true,"ratingScore":1,"reviewReaction":"27 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Falta tarjeta de regalo","reviewDescription":"La tarjeta de regalo no viene","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"Mexico","date":1710547200000}
{"reviewTitle":"No, no- so regretful","reviewDescription":"I was so hyped to get this new phone, but it turned out to be a total piece of garbage. I paid $1300 for a phone that doesn't even receive text messages properly. It always shows one bar even though I have great service with Verizon and pay for unlimited high-speed. I'm in a city area with lots of reception, so it's not my service.And don't even get me started on the camera. It makes you look like you're in some kind of funhouse mirror or something. The beauty mode doesn't do anything either.I should've listened to the reviews and saved my money. My old Samsung 9 Plus was the best phone ever.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"A tremendous step back for Samsung","reviewDescription":"I have been a Samsung user for a long time. I started with the Galaxy s3 Active, back in 2014, because it actually held up to normal use. 10 years later- the quality of both the software and hardware engineering are so abysmal, it's laughable to think this is the same company.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"LCD screen issues","reviewDescription":"Didn't have the phone for 2 weeks before the screen started showing a dead line of pixels across the screen. I had to take it to a repair shop, and the associate told me they've seen this exact thing across quite a few of these.Samsung seems to have let quality assurance get a little relaxed. I paid $1,200 for this thing, so this is unacceptable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"FRAUD ALERT","reviewDescription":"I returned this phone and now someone is trying to access my gmail account. My sister also returned this phone and someone tried to access her chase account. It showed they were trying it through her returned phone. The phones seemed faulty and fake that's why we returned. There is something fishy going on with these returned phones. I think are trying to retrieve and misuse private customer data.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"It looks original but it is not","reviewDescription":"Already updated it and still giving screen problems, does not sound when you call, not strong bibra calls and applications are not updated in the background not worth quality and price","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Had to return the phone","reviewDescription":"The phone phone was advertised as Galaxy S 24 Ultra unlockedXfinity was recognizing this phoneIt kept turning off my phone serviceI had to return the phone","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Horrible camara","reviewDescription":"I regret so much spending $1200 in this phone. The camara take horrible images and videos; I passed the return period due to I thought it was me who didn't know how to adjust the settings but I tried different ways and I even compared it to my old phone and images and videos are much better quality in my old phone. Don't buy this phone.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Bought new, got what looks like used","reviewDescription":"Packaging was opened and resealed. This has become a trend now where it’s acceptable to mark used products as “new” and to cheat customers.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"\"Like new\"","reviewDescription":"Damaged item not by courier.  The packaging was fine, once opened this was the condition of the product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Muy molestia","reviewDescription":"El pin de carga se daño el segundo día de la compra. Es usado y se recalienta. Poco volumen","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Counterfeit!","reviewDescription":"Neither Spectrum nor Xfinity could register the IMEI numbers. This ran super slow and something is fishy about it. When I first powered on, it went straight to desktop and not the setup screen. First red flag. Before I returned, I factory reset. I started it to make sure it took and then I get some screen with flames that was definitely not factory. Some features didn't work like the search feature in Settings and you could not get the back and home button to appear at the bottom of screen. Google listed the login as from a Note 7 vs an S24 Ultra. Def counterfeit. See photo.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"Everything's great EXCEPT Bixby","reviewDescription":"This is my first Samsung in years. I stopped buying Samsung for one reason. Bixby is the worst virtual assistant EVER! I got this because I was wondering if Bixby got better and heard I can switch the virtual assistant on this phone. You can't and Bixby is just as stupid. I'm giving it a 1 star just because of Bixby. Everything else is great. But Bixby. Let me switch Bixby to something else please. Samsung users have been complaining about this forever.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"No micro SD capability?","reviewDescription":"Taking out the micro SD capability is a big L for Samsung. Beginning to be just another iPhone.","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"No thanks","reviewDescription":"I'm still using the s9.  Thing is durable.  $1500?  My work and back kia costed that much.  I'm not chasing the Samsung dragon.","isVerified":false,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Very low quality and grainy","reviewDescription":"The whole reason I bought this phone is for the awesome camera so that I can share pictures and videos to my group page. I love the camera, but when you share or upload pictures and videos they look terrible. The worst I've ever seen. I'm regretting paying this much money this thing. I should have bought the Google Pixel instead","isVerified":false,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Samsung Galaxy S24 Ultra has disgraceful screen resolution","reviewDescription":"Everything you see on the Galaxy S24 Ultra screen is hazy, blurry and has dull, faded colors.  I have a Samsung Note 10 from 5 years ago that is undeniably superior in regards to picture quality when comparing the two side by side.  Check the problem reports online complaining about the terrible resolution and shameful pictures taken with the S24 Ultra camera.  This is the worst Samsung phone since the Note 9 that exploded and caught on fire in customer pockets.  Samsung keeps claiming that an update will fix the S24 Ultra problems.  This is clearly a hardware issue.  I have received 3 updates from Samsung and none of them have ever, nor could ever solve this problem.  A complete recall on this phone is definitely needed.","isVerified":false,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"A total disappointment","reviewDescription":"I have had a Samsung Note since the beginning, then upgraded until recently, when they stopped making the Note range. I decided to get the S24 Ultra, as I use the stylus for graphic design sketches and ideas.I have spent three of the four weeks I have had my phone back and forth with Samsung, because my camera is faulty. No, it is not me, it is not that I do not know how to use the camera. A phone this expensive, you should be able to pick up the phone and take a snapshot of anything, and it be a reasonable representation of what you are looking at. You should not need to use any pro settings. I have SLR cameras for that. I need a camera on the move. The problem is the color accuracy is WAY off. I mean brown is orange... bright orange. I have taken photographs of Pantone colors with my old Note 10+ and with the S24 Ultra, and the 10+ is by far the more accurate. My color vision is spot on, color is my life. If you color is of any importance to you, do not get this phone. I have loved my Samsung products in the past, but this one misses by a mile. The enhancements are at minimum, and I have gone through all the tech support with Samsung. Apparently it is a problem with the phone. So much so, they were supposed to have an update coming out next month. So, I  have to wait ANOTHER month with what is in essence, a paperweight. Save yourself a lot of money, and do not buy this.  A once very loyal Samsung owner.","isVerified":false,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"My Note20 Ultra was better in almost every way.","reviewDescription":"My Note20 Ultra mysteriously had issues right after an update.  I bought a  1TB s24 Ultra.I airway miss my Note20U.Why I think the new s24 is a step down?:-No MicroSD slot-Very washed out dull screen-No ability to turn off camera shutter sound-Much heavier-Buliker-No noticeable speed increase, in fact can feel slower-Less ram, which is going in reverse of making things better-Sound quality and volume seems less-I think the photos look worse, but that might just be the poor screen qualityI do like that the screen is no longer rounded. The fingerprint sensor is a little better now as well.Keep in mind the AI is only free for now. They will start to charge you monthly in 2025 to use it. Which is odd, since they make money off the data they take from your phone and the AI you enter, since you must be logged in to a Samsung account to use it. As well you are training their AI for free. So keep that in mind when buying. I rarely use the AI, so no big deal.Overall, I find my old Note20 Ultra to be far superior for me. If Samsung didn't discontinue security updates and discontinue push updates on older phones that break them,  I'd buy another Note20 Ultra. I think this will be my last Samsung.I already refuse to buy anymore Samsung appliances, due to quality concerns and my TV is an LG now.","isVerified":false,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Gorgeous phone but some shortcomings","reviewDescription":"I have some major gripes:- screen is grainy and washed out- in-screen fingerprint reader is slow and rendered mostly useless by a screen protector- default AI setting makes the photos look really weird- blurry indoor photos","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"When will Bixby go away spell check is dumb","reviewDescription":"I find this new phone very intrusive Bixby needs yo be shut off  In All areas .it's useless .also I can't focus on a close up Picture. Im a realtor n need to rely  on the ease of the camera it works poorly. Too much bragging. I. Not an I phone user I love android .too many pop ups that are hard to get rid of .too many sounds n hard to find  the turn off .the messages lost their dotsTo notify me of an unread message. I'm wasting hours .I'm very unhappy this phone is not worth the money .ide rather get a simpler phone. Buy this phone if you have hours upon hours to figure it out and you want to fill in bored time . I have no down time .I hope they take this phone back I bought it at t mobile. Also the spell check is slow it doesn't correct simple words like to  when spelled out as do .spell check doesn't catch  the small errors","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710547200000}
{"reviewTitle":"Received a Floor demo or fake phone.","reviewDescription":"I received a what is supposed to be a SAMSUNG S24 Ultra.  the item received appears to be fake and\/or a floor display demo that is completely inoperable.  When attempting to go through the refund and return options, I keep getting asked to fill out an issue and proceed when takes me absolutely nowhere.  At this point, I am stuck and cannot find a phone number or email to report this issue.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I have always loved samsung but this phone keeps crashing the last update made it worse I have spent more time putting apps to sleep or cleaning out the storage catche I switched back to my a15 at least it works","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"There is a lot of glitches","reviewDescription":"Map will freezes all the time.  Website doesn't load well.  Messenger don't work well.  Very disbelief hours bad this model is","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Defective","reviewDescription":"I purchase this phone which cost me over 1k and it stop working and now Amazon cannot provide me with any solution nor can them give me my money back!","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Samsung 24 Ultra","reviewDescription":"Not worth the money. Had issues, reverberation.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Don’t like it , the quality","reviewDescription":"Don’t like it , the quality","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good phone, but bad battery.","reviewDescription":"It's a goodphone, for a very bad battery life.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Me salió defectuoso","reviewDescription":"El celular llegó mal el mismo día que me llegó se me reinició solo 3 veces y estaba súper caliente solo 3 horas me bastó para pedir mi rembolso aparte las fotos salían con algo de ruido, espero que el próximo me salga bien","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Really Disappointed as a customer and phone technician. 😞","reviewDescription":"All the Excitement and anxiety of waiting for this device, only to have the screen start jumping 1 month and a half after. How??","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Amazon pre order storage upgrade special","reviewDescription":"The phone itself is great but Amazon really screwed me on this pre-order special offering the double storage upgrade. Been traveling for work and finally got my hands on the phone after it being delivered early this month. Did the whole setup and went to check how much extra space I'll have for things. Low and behold, no storage upgrade despite buying and paying for it in Jan....so Amazon can know they are pretty shady for misleading people just to get some items sold....","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Easy setup.","reviewDescription":"This phone is awesome it's lightning fast switching between apps and loading games. the camera features are awesome. It's big but not to big fits in your hands just fine it's almost like having a mini tablet. The battery came 50 percent charged and charges very quickly. Also I like the color it's almost like a smoky black. I would definately recomend to anyone wanting a new phone to try the new galaxy series and also get one through this seller they are honest so you get what you pay for. The Samsung switch app made porting all my apps and emails messages calls and everything else from my old phone to this one a breeze just downloaded the app on my old phone connected them both to the same wifi network and clicked begin and it did the rest. As far as connecting it to my carrier (metro by T-mobile) all I had to do was contact customer care and register this phones IMEI number with them and then I was able to remove my Sim card from my old phone and put it in this one and that was it now I have a Samsung galaxy s24 ultra on the metro network.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"What's not to love about this phone","reviewDescription":"Takes awesome photos, and seamlessly sends video to my RV's TV in HD, so no having to buy a second plan for internet for streaming.  I love this phone and connects at 5GUC on T-Mobile when my Samsung S23 5g work phone on with a different major carrier only gets 4LTE.  I have small hands and it fits fine. The only issue is that I bought the black phone as the description had a higher zoom, but I received the titanium color with a lower zoom.  I only discovered that after I had transferred all my apps etc.  I can't fault the phone though.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Big, beautiful screen and super fast CPU","reviewDescription":"Samsung Galaxy S24 Ultra 512gb unlocked version: What a terrific phone! The upgrade in performance over my previous phone is crazy. The 6.8 inch square corner display is the best out there. Battery life exceeds expectations - I charge the device every other day. Paired with the Samsung S View wallet case, it's an amazing experience. The unlocked version has no bloatware, and you can uninstall any app you don't need. I'm extremely happy with this device and recommend to all.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Best phone ever!","reviewDescription":"I got the Galaxy S24 Ultra. It is really the best phone I have ever used and owned. At T-Mobile it was nearly $1300 so I went to Amazon and saved about $300. Great price for a great phone. Super fast and the battery life is fantastic. It takes a little time to set up but is well worth the effort. There is a lot of setting on this phone but it is worth it putting in the time to set up. Also used the wireless to switch over from my old phone (Motorola) and that went smoothly. It also has wireless charging built in. Highly Recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Great refurbished phone","reviewDescription":"This is my first ever refurbished phone. I already had a working phone, so I figured if it was trash I would just exchange it. But most of the reviews on here are very good, so I went with it.Packaging was OK. Comes in the original box, with all the accessories (charging cord, SIM tray pick and paper manual), but was slightly sloppily taped together in place of the original tear-away seals. Phone was missing the plastic removeable screen protector, as expected, and was instead placed in a plastic bag (though, not an ESD bag).Physically the phone showed up in basically perfect condition. No blemishes on the screen, back or edges. The only thing I found was a slight scratch on the silver ring of the outside of the top rear camera. But you can no longer see it after I installed a camera bump protector. Camera lenses themselves were untouched, which is the important part.S-pen works as intended. Phone was properly factory reset and it fired up as intended. Phone has been working flawlessly since it was received. Speakers, cameras, bluetooth, wifi, sim\/network, all good. This was a great deal and I'm happy I went with it. It was like getting a big discount for basically a brand new phone. Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Making Memories","reviewDescription":"Got the S24 Ultra just before leaving for my bucketlist trip to Machu Picchu in Peru. It took stunning pictures from closeup to long distance that all the iPhone users were jealous over. Most of the pictures I did not need to edit at all and the ones I did it took me 30secs to edit. I mistakenly left my phone on in Machu Picchu and was shocked to have a call come in! Don't worry, I didn't answer.  It was my all-around communication device.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"I love this phone","reviewDescription":"This phone has so much more capability than I could ever use. Great battery life and control. So many options. The camera is amazing with all the editing features. I haven't even touched the AI capabilities. And Amazon had the best price of anyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Somewhat satisfied","reviewDescription":"It's a good phone for the most part...some apps have been changed from my old phone...Note9...I really like the old apps better. The clock was better before...the way to set alarms, the alarm music choices. The stylus is still there, which is great because I use it a lot. I would have like to have a slot for an SD card included, and also an aux port to use wired headphones, etc..I do like the flat screen vs the rounded edge one of the Note9...easier to scroll flat. The speakers are OK, but sound a bit tinny compared to the Note9. It's a little heavy for one-handed use. The Bluetooth is wonky...does not stay connected to devices...consistently and repeatedly connects and disconnects...and reconnects and disconnects...over and over and over again.I'm getting used to it's quirks...was almost ready to return it. A phone that costs over $1k should not act up like this. Also, putting all of the buttons on one side of the phone is silly. To screenshot something, you had better control with one of the buttons on the opposite side of the phone. All on one side is awkward at best to operate.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Great Samsung Phone","reviewDescription":"I love my new Galaxy S24 Ultra phone. I bought it during Prime Days for $300 less than the price TMobile and other carriers were charging. I was considering a refurbished phone but this new phone was such a good price (relatively speaking), I didn't need to buy the refurbished version. I haven't even explored all the new bells and whistles this Galaxy offers but I like it already. It hasn't been a difficult transition from my old Galaxy phone.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"the best","reviewDescription":"I love my Samsung s24 Ultra phone. I was going to return it because the delivery driver \"couldn't be located\" and I couldn't track my package. This is a substantial purchase for me and i wanted my item to be in perfect condition. Not sitting in a hot van for 3 days. I was sure it had been hijacked or similar.  Well, I changed my mind fairly quickly. I am keeping it and teaching it new tricks everyday. It's a superior piece of technology......Oh yes, the transfer with the C-USB cord took only 12 minutes.  And I have about 5,000+ photos, One Drive with 37 GB of files, and much more on my old Samsung. I'm very happy.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Love it!","reviewDescription":"Love my phone so many different things you can do !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"best phone I've ever had","reviewDescription":"This is a really great phone.  I've always purchased inexpensive phones (maybe $200-300 at most), and while this was significantly more expensive, I don't regret it at all.  It has great battery time, and it boots up super fast.  It also takes amazing photos!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Better value than from the phone companies","reviewDescription":"I will never buy another phone from a major carrier again. I have been a customer of one of them for 20 plus years but they wanted me to open a new account or give me $200 for a 2-year-old S22 ultra phone in trade. This was cheaper without any trade even without the $200 trade-in. All my phones will be from Amazon from now on.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Great phone","reviewDescription":"Awesome battery life and great screen so clean and sharp","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"es un buen telefono samsung","reviewDescription":"me encanta la marca samsung el telefono llego bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Good purchase","reviewDescription":"I am a android  person  looking a phone and I see the deal on Amazon  very good price so I didn't  think a second  and purchase  same time it's very good phone nice picture quality  it's a blast 👌 😀 phone","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Very impressed with this phone","reviewDescription":"The phone is impressive in terms of processing spreed and quality of camera. It was a breeze to transfer all the apps and settings from Galaxy  S21 to  the S24 Ultra . Process ( wireless)  took less than  15 minutes  . Battery life is impressive","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"The phone is smarter than a person.","reviewDescription":"So far the cell phone is great I hope it will last me a long time. I am still trying to figure out everything on this phone. It take great pictures just got to learn the ins and outs.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Love it","reviewDescription":"Worth the price. Great upgrade from my s10+","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"I love my phone! Android forever.","reviewDescription":"Had a brand new iPhone, actually put it on a new plan and after trying it put for like a week (because I was out of state) I went home and returned it when I recieved my phone from Amazon. 100% happier with this phone. I live the size, the pen and the functionality of this phone and the apps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Freezes","reviewDescription":"My phone frequently freezes and it's VERY annoying!! I have to get out of what I'm in and go back again. Also doesn't connect to all wi fi signals. If it doesn't improve, I'll have to return it or exchange it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"I'm on the fence with this one","reviewDescription":"So considering the phone I came from, this one is amazing! I give it that for sure! If your upgrading from a cheap phone with a bad camera, then do it! BUT, not that this price, if your after it for the amazing zoom quality... no it's useless...So here's the thing, idk if it's a fake I got, or if the zoom on the 24 ultra is just that bad, because I have seen the 22 in action,  and it's 1000x better, the zoom is the only Reason I even went for this phone to begin with honestyNow the phone I came from was a shitty BLU 91 pro, so yes, it's an amazing upgrade, but when your buying something specifically for sertan aspects of the camera, it's kinda sad.... so again, idk if I somehow got a fake or the zoom really is just that bad. It's Definitely not worth the tag if either of those are the case.If you can catch it on sale for under $800, go for it, but at $1,200 not worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Great phone, bad battery","reviewDescription":"I wouldn't order it here. 90 day warranty only. Too much money for that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"New tech lots of features","reviewDescription":"This new Samsung S24 Ultra is not much better than the Galaxy Note 10 plus that it replaced Ram memory both have same 12 GB, cosider that note 10plus came out five 5 years ago. The screen resolution is higher, true but makes little difference in real life applications and videos. Same screen size as my note 10 plus 6.8 and no memory card. Is much heavier than the note 10 and bulky and the flat screen doesn't make much difference. To be truthful most users don't get to use not even 50% of the feature that these phones offer including me. So why not concentrate their resources in a truly better screen experience and interactive features that can be used in a day-to-day basis like email and chats. This phone doesn't justify the high price tag of $1675 retail by Samsung website. At least I got a better price here in Amazon, so I don't feel that bad. This phone will be replaced soon, I'm pretty sure.  I apologize for pointing out the not too good things, but I feel disappointed, I had higher expectations from a $1600 cell phone. Don't understand some reviewers here unless they were coming from a really basic phone. Be your own judge and keep posting your experiences. It helps. Kudos to Amazon for a super-Fast delivery!!!!!","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Doesn't seem better than my S23 Ultra","reviewDescription":"I'm a bit disappointed that the video and photo quality isn't better than my S23 Ultra. I put all the settings exactly the same on both phones and the S23 Ultra still looks better than the S24 Ultra. You can really tell when you zoom in while recording a video. I'm wondering if I got a bad phone.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Great phone","reviewDescription":"Only had it for one day so far. Everything's great. Except, I would just like to know why Amazon had my $1,400 sliding around in a box with no padding. Good way to cut costs. Also, a great way to get your customers' expensive purchases damaged.","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Great seller, phone not worth it","reviewDescription":"Had major problems, typically Samsung can be picky. Don't get me wrong. I love the phone. Its a beast, just not a 1400.00 beast. Samsung has absolutely the worst customer service and Tech I've ever dealt with hands down. Overall the ohone is cool, fast as heck. Just remember..you cant add memory cards. Go big. Also. Verizon made me use my card slot which stinks. I wanted to have a second line. Seller was supper fast, and yep. Its unlocked as stated. I switch sims all the time.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Screen display color washed out + blurred pictures","reviewDescription":"Update on 2\/25\/2024: ▪︎The issue of washout color has been fixed after software update. ▪︎The camera can take a rather clear photo on  A4 paper.  BUT, still not that perfect yet. ▪︎The phone still get hot on fast charging. I have to disable \"fast charging \". Is this issue caused by software or hardware??This S24 ultra is my 6th Samsung galaxy phone.As a big fan of Samsung, I pre ordered this S24 ultra phone.I couldn't understand why Samsung would make a flagship phone like this one. Unbelievable!>>>The screen has dull colors, poor saturation, and cannot be adjusted.  I once wondered if I had cataracts in my eyes.  But when I get back to my S21 , my eyes feel much more comfortable and relaxed.>>>The camera doesn't focus !Isn’t Samsung famous for its high-definition cameras?But this S24 ultra just can make your pictures blurred with the terrible post processing but can't avoid. I even couldn't take a normal clear picture in a  A4 paper schedule.Will Samsung fix this problem through software?Otherwise I might have to return it.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Battery draining","reviewDescription":"I bought s24 ultra 2 days ago and the battery is draining really fast and I even tried all the steup to increase battery life but nothing is helping","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"The phone only had HALF the storage as described. Much to expensive either way.","reviewDescription":"The phone only had HALF the storage as described. Much to expensive either way.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Great phone, Love it!","reviewDescription":"One of the best phone out there.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Excelente producto 😁","reviewDescription":"Súper recomendado. El mejor Android actualmente . El color me gustó. Tiene un peso bastante ligero para lo que pensaba. Gracias.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Love it!!","reviewDescription":"Put in my order on Wednesday and got it Friday morning. Works perfectly. In excellent condition. Really great experience.Battery works well for my uses (mostly gaming and social media) and it's really easy to use and set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Came in as expected works perfectly","reviewDescription":"Great phone all works perfect very happy with this purchaseUpgraded from s22 ultra and I believe the camera upgrade is my favorite, it makes it worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Excellent phone.","reviewDescription":"This phone was a pretty big update from my S20+. It works well and has a much longer battery life.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Excelente","reviewDescription":"Llevo un mes ya con mi celular nuevo. Funciona a la perfección con mi operador at&t. Es perfecto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Awesome device!!","reviewDescription":"Awesome device!!  So much to say.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"excelente","reviewDescription":"yo siempre he comprado Samsung, pero este me encanto, es una perfecta obra de ingeniería","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Yes!","reviewDescription":"Did not have any problems with switching my phone to this new phone an it works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"😍","reviewDescription":"Muy bonito me gusto mucho sin duda lo volvería  a pedir!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"It works internationally BUT with esim not a physical Sim card","reviewDescription":"I bought it to use it in Costa Rica, almost got crazy mad when it didn't read my physical sim card but after replacing it for an esim it worked perfectly! :) hope this helps. Had to go to customer service SEVERAL times to receive the gift card promise and as the rest mentioned, I thought I wS going to be receiving the 1TB for the double storage but I received the 512 gb version as well, so the double storage was not given as promised with the pre order.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"The new AI features are awesome but the camera can be a bit annoying when switching betw zoom levels","reviewDescription":"Upgraded from the S22 Ultra, and while mostly everything about the S24 ultra is awesome, a really nagging thing seems to happen when switching zoom levels in the camera (the zoomed in image seems to consistently product a haziness\/whitewash affect when zooming - noticed between 3x and 5x).It noticeably drops in saturation and I thought I was going crazy thinking some kind of condensation or something was obstructing the lens, but after removing the phone from its case and ensuring nothing was obstructing the lenses, it still produced that dull\/unsaturated filter when 3x\/5x zoom levels were chosen (and in good lighting)","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"charging problem","reviewDescription":"while it's charging it keeps lighting up","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"I am impressed by the capabilities of the Ultra 24 lb.","reviewDescription":"I have only been using this phone for a short period of time, but I am quite pleased with its performance thus far. The security features are particularly impressive, and I intend to write a more detailed review once I have had more time to explore them. Overall, I am very satisfied with this product and would recommend it to others.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"It don't pick up very good in my area where I live","reviewDescription":"The phone itself is beautiful but the service thought my mobile service is not good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Nice phone, poor support from amazon","reviewDescription":"The phone is great. Samsung did it again.  However, I only bought this straight out from Amazon because they promised a $200 reward which made this a cheaper option than my carrier.  Well, they have not given me the credit and each time I call I am told to just wait.  It's been 14 days.  Again, the phone is great.  Buy from your carrier.  I learned my lesson here.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"BATERIA Se DESCARGA RAPIDO","reviewDescription":"La bateria del telefono no dura nada, y tampoco funciona bien!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"You cannot change color to vivid","reviewDescription":"The Vivid and Standard colors are the same, they do not change. The keyboard isn't great, you have to push down hard on keys. I'm not impressed with this phone. It's a bit Glitchy. The voice doesn't understand you very well when talking. If Samsung doesn't give an update soon to fix these problems; I'm going to return it, before the windows closes on the return.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Phone shows download and Freezes","reviewDescription":"I would like a replacement..I am ok with the phone even though it is less than I expected..The phone freezes while downloading something that I did not ask for..I have to force shut down then restart.Please advise","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Ok device","reviewDescription":"Dislike battery life","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Terrible DISPLAY, not happy...","reviewDescription":"Just like many others i have always run my Galaxy S series in VIVID mode, well with the S24 that mode just doesnt seem to work anymore, its going on 3+ weeks and Samsung still hasnt rolled out a fix, also camera problems too, i didnt have battery life issues but the screen and camera were really the only reason i wanted this phone, so... sending it back, back to my Pro Max 15!","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Terrible washed out display, vivid and natural settings do not work. Compare to S4-S23 Screens.","reviewDescription":"Preamble: I currently own a Note 4, S4, S7, S8 and S20U. IMO, the S7 was the best camera for getting everything in focus with sharp details and excellent color fidelity and 4K videos are terrific. The S8 suffered from some weird video wobbles. The Note 4 was good in general, but the S7 really took the performance crown. Then came the S20U. Gorgeous display and had a SD Card slot. However, the camera was absolute and still is terrible. Can't focus on anything properly and wide shots were all bent at the edges.S24U Review starts now (I got mine early from t-mobile with build ending in: AWM9)Pros1. Flat Screen is absolutely perfect, no more rounded dust collecting edges and easier to apply tempered glass.2. Camera is superior compared to the S20U (well, any camera is...) and trades blows with the S7 and S8 and the macro camera on S24 helps with getting everything in focus and not just having the horrible higher DOF where most things are blurred out, so basically, you don't have to dance around to get everything in focus.3. It's fast.4. Still allows a nano sim card.5. Modes, I love this app, allows you to customize profiles for the phone based on your criteria and set it to run at a given time, like setting wallpaper, wifi on or off, screen color and blue light filter and so much more.Cons:1. Super AMOLED screen has been crippled to 85% DCI-P3. Looks like a cheap LCD screen. Vivid\/Natural modes do nothing. Blue light filter makes it worse. Whites look bluish. It's like having a Ferrari and the manufacturer puts on governor on it because it goes to fast. It's a super amoled screen, give users the option of washed out, natural, vivid and ultra vivid, not just washed out.Don't take my word for it, go to your local carrier store and bring in your current Galaxy phone or just compare it to other phones in the store, it's that bad. If you have the S23U, it's not really an upgrade, it's more like a refresh that offers a flat display, but almost everything else is the same except for the washed out display and 10x optical dropped to 5x optical but with a higher resolution sensor.2. Camera doesn't take accurate colors, auto white balance doesn't work properly on macro shots.2. No charger (only a charging cable.)3. No SD Card slot.Notes:1. Forget about AI, between privacy and the fact they will be charging you for it at the end 2025, it's not worth. They are basically trying to get you hooked on it for a couple of years and then starting charging you for it once you rely on it. According to the Samsung product page: \"Galaxy AI features by Samsung will be provided for free until the end of 2025 on supported Samsung Galaxy devices.\"2. 7 years of updates. Does that mean they allow you to change the battery during year 3 or 4? Of course not, and there's no battery service they offered either to make it last that long. It's a gimmick. Just like 10 year warranties on washing machines for the motor only, while everything breaks down before 10 years.3. I can't say if there's any detriment with the new AR glass, because the color saturation is so poor. If that's fixed, I'll update this review appropriately.4. I find my S20U gets brighter then the claimed max 2600 nits of this phone.Bottom line, I'm returning mine if Samsung doesn't fix the washed out display and the color issue on the camera. If they can fix that, it's a great phone, just don't get hooked on the AI unless you're willing to pay for it in the future.\"The Dynamic AMOLED 2X display on Galaxy S24 Ultra received a certification from VDE Germany for 100 percent Mobile Color Volume in the DCI-P3 color range, which means your images aren’t washed out and you’ll get unbelievably vivid colors regardless of differing levels of brightness. The display can achieve peak brightness of up to 2600 nits, improving the contrast between dark and light aspects of digital content for a more brilliant picture quality, with a 5,000,000:1 contrast ratio to make your mobile experience more immersive. \"\"Update 3\/11\/2024While Samsung did provide an update to address the lack of vividness, it was wrong of them to dismiss users early on saying this was an intended and ignoring all users for a month. With that said, it's still a disappointment. The new anti-reflective screen reduces the wet\/glossy look of the color saturation. For the use case of anti-reflective screens, maybe one hour a day, it takes away the entire rest of the time. If we wanted anti-reflective or for those who really need it for whatever reason, they could buy a anti-reflective screen....now we are all stuck with it, except for the S24 and S24 Plus models. Wonderful. Spend over $1400 on a phone for a glass screen that reduces image quality, while the cheaper models offer a better visual experience.","isVerified":false,"ratingScore":2,"reviewReaction":"14 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Android is trash","reviewDescription":"Yes it is. It looks like a mess and it’s not fun to use","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"No likes","reviewDescription":"No memory sd storage no plug in headphone jack","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Not worth the money at all","reviewDescription":"It's a piece of junk. Pictures are excellent, fast charging but everything else is no better than a hundred dollar phone. Slow as hell. I could drive to New York from Seattle by the time it loads anything.  Drives me crazy. Plus it's not compatible with Doordash's app. This is one of the reasons I bought it.  Now I'm going to buy a hundred dollar phone to Doordash.  What a rip off.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712707200000}
{"reviewTitle":"Camera shots are blurry!","reviewDescription":"Overall the phone is good not great. My main excitement for paying $1435 for a phone is the pictures that this flagship was suppose to take.  So far I'm getting below average pics.  Only certain lighting helps.  The s4 note back in its day took incredible shots.  Now I'm at a lost about this expensive phone.  Battery life seems decent bit nothing like all day or anything.  I was thinking about giving it a 3 star rating but the camera is my main reason for making the leap to this phone.  Hopefully updates fixes these issues otherwise it's time to switch to something else.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Bad charging port","reviewDescription":"I don't like how I had to replace the charging port not even 3 weeks into owning it I paid 1,197 dollars for something I had to get fixed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Glitchy and unresponsive","reviewDescription":"Do not buy this phone. I have to restart this phone several times per day for it to respond. It will freeze up and the screen does not respond to touch. Apps take 30 seconds to start up once you click on them.  I got this phone for the camera, but I should have just stuck with my s22 Ultra.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Good phone. Easy to use. High quality doesn’t feel cheap","reviewDescription":"This is one of the nicest phones I’ve had. I am not a fan of the size of it as I am used to having smaller phones. The phone is very easy to use and there is easy to follow instructions to get it set up and running. I have owned two Samsungs and 2 iPhones and I will say that after using both I like Samsung better. They have elite camera quality and offer features unlike any other brand of phond","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"What happened Samsung?","reviewDescription":"I hate to say it but... The screen on my $250 dollar Samsung A53 is brighter, has more contrast, and more saturated.... What is going on? How is it possible that a $1,500 dollar phone is worse in the screen department? Can confirm that the screen is disappointing. I'm jumping ship for One Plus 12 for half the price and 80W charging... Sick of Samsung's bugs and overpaying for everything from phones to watches to earbuds.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Videos Won't Load","reviewDescription":"I was in love with this phone. However, having this phone for just over 1 month it's super slow and videos load slow or not at all! I bought extra storage and that didn't help. Now what?? Passed the return date.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"The phone started freezing one week after purchase. There is also blotches when doing videos.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Needs video jerkiness fixed.","reviewDescription":"Video playback is bad. Jerky.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Great 5-lens Camera!!!","reviewDescription":"If you like to take pictures, this is the phone for you!!!It holds a charge longer.  Takes crystal clear detailed pictures.  Has a translation feature that works as you need it.Generally, an excellent choice when upgrading from any older Samsung Galaxy phone or other older brand phone as well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"One of if not the best top tier phone","reviewDescription":"The phone for it's value is perfect, it feels good to hold and has some of the best specs and best additions for some one who is a tech guy like me. The screen is nice and one of the cleanest screens with the thinnest boarders on any Samsung phone. The squared screen is nice to see come back after seeing a lot of curved screen edges in recent years. I got mine for Amazon's prime day so I think it's worth at full price if your willing to pay that much but on discount it's a must for me. My last phone was a Samsung S9+ so this is a massive jump but we'll worth.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Just got my Galaxy S24 Ultra Cell Phone 512GB","reviewDescription":"Update:I'm still very happy with my purchase of this Samsung phone. Today I was using it to take pictures of ants in my patio area. The picture came out stove crystal clear... And when I zoom in you can see every single details of the ants. I decided to use a picture as part of my review for this phone. Again loving this phone and the pictures are amazing.Loving the feel, look and style.Set-up was easy.  There is a slot for a SIM card (although not required to use cell phone) it made set-up so easy for me. I installed my Cricket SIM card, got it connected the network & WiFi and got it going.  The phone eventually prompted me (asked me)  to switch over the to internal eSIM card which would give me greater functionality and I said yes.  Set-up completed.  I'm definitely enjoying my phone and my daughter loves the stylist.  Also Samsung's costumers service was amazing....during the initial set-up I forgot my Samsung account password - with one phone call and in less than 3 mins  a customer service agent talked me through a simple work around.  Even my husband was impressed with the quick response and time to resolution.I will update my review over time.  For now....I'm in Love.","isVerified":true,"ratingScore":5,"reviewReaction":"40 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Android freak","reviewDescription":"What a phone. Easy to use, sound quality is amazing. I bought it on Amazon Prime day for a very good price. A little heavy but I can manage it. The pics are just amazing","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Excelente","reviewDescription":"Aunque dice desbloqueado tengan en cuenta que si colocan su tarjeta Sim no va a captar la red movil, tiene que llevarlo a su operador para que sea habilitada dicha red . Pero el móvil es fantástico. La seguridad de la entrega es máxima porque te envían un código que se la tienes que decir al repartidor si coincide te entregan el celular sino pues no. Eso me pareció fantástico.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"A replacement phone","reviewDescription":"Replacing my water damaged S23 Ultra.S24 Ultra's s-pen feels like it uses cheap light-weight plastic compared to the S23 Ultra's s-pen. S24 Ultra's flat screen edges are a good change.In normal daily usage, can't really tell a difference from the S23 Ultra.Although the Samsung keyboard no longer has the text editing option and the \"Glance\" feature in s-pen air actions is no longer available.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Fabulous","reviewDescription":"I've always liked Samsung Mobile over iPhones --- camera,resolution,big screen (like the NOTE),ease in SMS typing and everything. But the best part of this purchase is getting this S24 Galaxy Ultra with the 500 storage for only $900+ during the Amazon Day.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724112000000}
{"reviewTitle":"Can't beat an Android!","reviewDescription":"Got this phone because of a couple cracks to my S22 Ultra screen,  which happened at a baseball game where the parents and grandparents were mad at my umpire husband, and I needed to video an unruly granny.This phone was 25% off, which made it affordable for me at that time.  Im a big picture taker, and you can't get better pics than the ones you get with this phone.Oh yeah, and the phone works great, too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Very happy so far (after almost 2months)","reviewDescription":"I had a Sony Xperia 1 III and absolutely loved it, unfortunately I broke the screen and it was too expensive to change it so I had to find a new one and the Xperia 1 VI doesn't have a 4K display nor 21:9 aspect ratio anymore so I went for the Samsung Galaxy S24 Ultra instead. I must admit that I've been really happy with it so far, I just wish more apps used the Face recognition more often than the Fingerprint for Biometrics but other than that it's been a very smooth experience! The camera is great and the 5G works great too!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"most powerful phone on the market","reviewDescription":"it faster then thee p8p and just better i had cheap phones before but this phone changed everything for me. music quality and pairing and all signal where reliable i see why phone costs so much there is so much on display quality and photo qualitty i have missed out on","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"La camara, la batería  🪫","reviewDescription":"Batería 🪫🪫","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Mala calidad este teléfono","reviewDescription":"Este teléfono que me llegó parece una imitación  no parece original","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Disappointed 😢","reviewDescription":"Don’t buy this phone from this particular seller.  They advertise as new but ship used and faulty phones to customer.  When you return the phone, it will take forever to get your refund.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"Phone wouldn’t connect with carrier","reviewDescription":"The phone they sent was not able to connect with my carrier. I returned it and i am still waiting for a refund. Buyer beware. The discrimination makes you think it comes from the samsung store but it doesn’t!! Look before you leap.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Display looks terrible, battery issues?","reviewDescription":"Screen looks dull.  My Note 10 has a much better picture quality.  I will return if they don't roll out fix within my return period.Battery seems to be draining fast.  My 5 year old Note 10 that I have used and charged daily has less battery drain.No microsd card slot.So far this phone has been a downgrade.","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"So fragile and bugging","reviewDescription":"I bought my phone s24 ultra 10 days ago and just today it got broke by the first falling from my bed. It was supposed to have some kind of gorilla glass2. And capable to resist falling . I  dont' advice people to buy it because you will be disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"DISAPPOINTED","reviewDescription":"The stylus was not in the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Overheats","reviewDescription":"Idk why but it overheats.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Not worth the price","reviewDescription":"When I ordered this phone they took no time in grabbing the money from my account,  I returned the phone the next day they have had it for two weeks and still no refund,  to much money for what was in the box","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"The worst purchase ever.","reviewDescription":"Serious connection issues, both mobile and wifi, it works worse than my 4 year old S20 Ultra. Clearing all cache works for a few minutes,  as well as resetting connection settings. Samsung community boards show this as a widespread issues,  hopefully it will be resolved. Until then,  I'm extremely disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"HW and SW","reviewDescription":"Overall it has good specifications and reasonable quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Perfect!","reviewDescription":"Great option for those who like bigger phones. The battery has long duration and AI capabilities make it much easier to use.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Best camera ever!!","reviewDescription":"Absolutely love my samsung,  best phone ever!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Very nice phone","reviewDescription":"Brought this for the camera. It did not disappoint.  The camera is absolutely amazing.  The phone works well also.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Excelente","reviewDescription":"Buen producto me llego bien y rapido","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Best phone","reviewDescription":"There is not a better phone on the market. Don't walk RUN AND BUY!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Galaxy S24","reviewDescription":"Price, and all what the phone can do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Fantastic","reviewDescription":"Everything is good and value for money, especially circle it so far i don't have any problem  with the battery, picture quality is also very  good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Powerful feature set .... gotta luv it","reviewDescription":"Performing tasks on the phone is a breeze.Photo quality is amazing.Fast.Intuitive interface.Gotta luv it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Great","reviewDescription":"Todo en perfecto estado y función","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Help needed","reviewDescription":"I have a S24 Ultra Factory Unlocked I save my contacts  in the following format 1 area code 7digits.  For example +1 345 123 4567If I call a contact with 7digits (123 4567), I see their name. But when I hit dial only the number appears.  In my call logs it only shows the number.If I dial the contact using area code all is well.  I have removed and replaced contacts.  I have moved contacts from Google to phone and back.Software is up to date","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Using under Liberty PR network.","reviewDescription":"Please keep in mind if you are buying this phone to use it in the Liberty PR network, the group texting won't work. Everything else works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"average","reviewDescription":"phone worked fine , too big, and the design a little outdated , I decided to return it , the return experience with amazon has been really bad , they did not acknowledge they had received the item and they did not refund until 45 days after item was shipped back. really very bad experience overall","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Expensive, but snappy","reviewDescription":"It's a phone. The A.I. stuff is pretty fun to mess with, but not entirely practical for daily use. That said, the camera is fantastic. I took these pics from the back of a dark venue from about 110-ish feet away. To me, concert pics are the true litmus test of a phone camera, and this is, without a doubt, the best I've ever had. Would I buy it again? Eh, yeah, probably. I just wish it were cheaper.","isVerified":true,"ratingScore":4,"reviewReaction":"29 people found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"Cool","reviewDescription":"I like my phone,  but most of the time I can't hear out of it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"No es un producto nuevo","reviewDescription":"Todo bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Super","reviewDescription":"Cumple mis expectativas","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Powerful Phone","reviewDescription":"The S24 Ultra with 512GB storage is a great phone with a couple of faults that drive me crazy.Screen:I love that it's flat. I hated the curved phones of the past. The screen gets bright and its good in the sun. The anti-glare coating is fantastic. It might be the best I've ever seen.Battery:Battery life in fantastic. It is easily an all day phone even for a power user. Only thing that might drain it before that is if you do intense gaming on it all day. It claims to be 5,000 mah, but I wonder if it's not a little bigger. My Anker power bank has an info screen and even with conversion loss, it drains the large bank a lot more than a 5,000 mah battery should, more like 8,000 mah worth of drain, which is quite a bit more than what should be expected.Camera:I'm actually disappointed in the camera. I use the zoom a lot. The AI does an incredibly HORRIBLE job with people's faces. They look like disfigured zombies with AI at max. I can't turn AI completely off, but even at the minimum, there is still a slight zombie effect. I can see the actual photo briefly before the camera processes it and I wish I could keep it before the processing. One way around it is to use motion photos and then editing it and taking a snapshot before the final processing. However, I shouldn't have to do it this clunky way. Please fix the AI when zooming!As long as you don't need to zoom too far, the pictures turn out great.Volume:This is the quietest phone I've ever had in terms of volume. I've tried every setting. It is soooooo soft, I can barely hear people talking on the phone. I've tried 3rd party apps that amplify, but they sound terrible and distorted the more gain you put on it. I've gone into the advanced setting, the developer settings, nothing. I've played with auto leveling. Nothing. It's so damn quiet! The max volume is what most other phones have as normal listening mode. I will trade battery life to be able to hear without straining and this is with ANC on.AI:I honestly don't use it that much. It comes in handy here and there, but AI is still at that level where the last 10%-20% can be so ridiculous, it becomes more work fixing what it gets wrong. This is most true with photos and writing. AI cannot write the way I like to write. I end up fixing so much, I'd rather write it myself. The translator functions are very useful, but I don't really need it that much. As mentioned above, AI is terrible with human faces when taking zoomed in photos.I've also noticed since last update, my screen will freeze up on me. I have to shut it off and turn it back on or shut app down and open it back up. Weird.As great as this phone is, the flaws really, really drive me nuts and they are all fixable!The 4 stars is giving the S24 Ultra the benefit of the doubt. My S10+ I came from, the every day experience was almost identical. I only hated the curved screen. Once you settle in and figure it all out, it's a Samsung smart phone. If the issues mentioned could be fixed, I would LOVE this phone. I","isVerified":false,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Great phone","reviewDescription":"It has an excellent screen size. great memory size.  But if you want a phone with a memory card slot try another Samsung phone. This does not have a memory card slot available. I got mine through T-Mobile when signing up for service.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Like a lot after two weeks use","reviewDescription":"Pre-ordered the S24 Ultra via AT&T to upgrade from a Samsung S20 FE.  The S24 Ultra is a behemoth in every sense of that word - features and weight.  My advice is to get it IF you have a reason to have the features unique to it.  Otherwise, there are lighter weight and smaller phones that are more comfortable to use daily -- and I say that as a male who is over 6'5\", with hands that match my height. The Samsung S24 Plus comes to mind.I am keeping the S24 UItra because of my interest in photography (this phone has a macro feature, AF on its ultrawide lens, and greater telephoto abilities than the S24 Plus) and my use of the S Pen.  Photos are excellent, including at 5x zoom.  The screen brightness, resolution and anti-glare features are great.  The S Pen allows me to make precise choices on the screen for a variety of uses.  The battery easily lasts all day with moderate use.My only big knock is the weight of the phone.  Just too much.  Smaller issue -the sharp edges, but I am no longer really noticing it after two weeks.","isVerified":false,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Se calienta mucho y se consume la batería.","reviewDescription":"Es rápido pero se calienta demasiado al punto de no soportarlo en la mano.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Sluggish camera, No SD card, not as good as older model","reviewDescription":"I had a Samsung S20 for 4 years and loved it. I was forced to get a new phone after my screen stopped working.  The S24 had good reviews for the camera, but that has not been my experience.  Every time I turn on the camera,  the screen locks up for 20 to 30 seconds.  It takes decent pictures eventually,  but I have missed out on some shots because of how slow the camera start up is. I changed to the lowest megapix speed, but it still locks up. Don't buy this phone if you are looking for a useful camera. The phone does charge fast. Another con is that Samsung did away with the SD card. So the storage in the phone is all there is. Definitely,  this model is NOT an upgrade from the S20. I would not buy it again, and am thinking of returning it.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Can't add memory.","reviewDescription":"Why did you take the memory slot away? Last phone to have it was the s 20. So I went back to using it. That imo is the worst mistake you could've made. For that reason thumbs down.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Location of fingerprint reader compromises the entire phone","reviewDescription":"The fingerprint reader is in the screen. For this reason, no screen protector reliably allows using the fingerprint reader. As such, no screen protector can reliably be used.. The screen is therefore at grave risk. If the screen is at risk, the whole phone is at risk, since the phone can't be used with a dead screen.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"I should have kept the S22.","reviewDescription":"I should have kept the S22. Not much of a difference.","isVerified":false,"ratingScore":2,"reviewReaction":"33 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Phone performs well. But","reviewDescription":"I have had Samsung phones since s2. I did not have problems with data transfer or call connectivity and qualities and audio quality was actually better than S23 ultra. I think other reviews were handed a defective phone or live in an area with very poor reception.The major problem I have is with the practice of data collection. I have identified at least 50 apps that you cannot remove using out of box tools that would collect just about everything you do with the phone. And you can't turn off many of them either. And to use any of Samsung's AI features, you have to give up even more privacy rights. I was not sure exactly which part of AI features are only kept on the phone and won't be sold to Samsung and its third party companies. Battery usage gets even worse when you turn the location on, not because of the sensor but all the unwanted telemetry apps that have attach themselves and vigorously send your personal data for the sake of $$$.If Samsung can make a privacy phone that won't steal or sell your data at your own expense, I would be one of the first ones to buy.","isVerified":false,"ratingScore":2,"reviewReaction":"14 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"No sd card","reviewDescription":"I will not upgrade from my note 20 til they bring back the sd card slot. There's no reason they can't! They just want more money for the cloud stuff!!","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Screen Scratched By Doritos","reviewDescription":"Got the phone today and during transfer of my files form my previous phone I had placed the phone down not noticing there food was crumbs. Picked the phone back up and found a good sized scratch\/chip in the glass. My phone has not been near anything metallic or abrasive, had the phone for less than an hour and it already has damage. Just and FYI it damages easily and make sure you get a cover on it asap.","isVerified":false,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Possible the worst glass yet...","reviewDescription":"I've been a galaxy user for many years and the S24 Ultra has the worst glass screen ever.  I've used my S20, S22, and S23 without a screen protector and have never gotten a single scratch on the screen.  And just less than a week into using the S24 ultra have seen that the screen scratches easily with normal use.  Absolutely disappointed for a phone that cost so much!  I would discourage users from upgrading to any of the S24 flagship phones.","isVerified":false,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Bring back the curved screen!","reviewDescription":"Curved screen is much more aesthetically pleasing and more comfortable to hold.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Goos product.","reviewDescription":"Ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Decent","reviewDescription":"It is a very nice phone. It can do a lot. The zoom on the phone is incredible. The clarity of the screen is I feel pretty good. The quality of all the pictures is a little bit to be said. Do not get me wrong it takes some pretty darn good pictures. My biggest problem with the pictures is that it takes a great picture of the item that you're taking a picture of. But blurs out the background. The only other thing that I'm really kind of disappointed about. Is the volume as far as on the phone. Phone calls. Even on speaker phone. If you have any kind of noise around you you will not build to hear it. It can play media very loud And usually have to turn it down a little. If they would find a way to fix the volume on phone calls. That would be a plus.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"200 MP Camera","reviewDescription":"Get the Titanium Black phone, it has the 200 MP Camera, all the other COLORED Ultra phones have a 50 MP Camera","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"great battery life and very bright screen.","reviewDescription":"I am very happy with the battery life and the charge quickness. the screen is bright and vivid. phone works as it is supposed to. I still don't like the fact that you don't get a charge block. it used to be an experience to purchase a smartphone. unboxing was have of the purchase. now they might as well send it in a zip-lock bag because you only get the phone and a cable. $1400+ I feel like Samsung has just charged me more money for less product. If you are like me and use the S pen daily then this is the phone for you but if not get the s24+ or just the s24. I got the s24 for my employees and they all love them good phones at a much nicer price point around $700.The battery life on this phone is bar none! I went about 56hrs without charging the other day and I was using it most of the time. I was taking video watching and editing videos. surfing for vday presents on line and talked to about 30 customers on the phone once I realized that I hadnt charged in two days and i still had 16% left I was blown away. My s22 ultra wouldnt even last the day and it would never super fast charge. this phone always charges fast about 38 mins to full from 5%.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Buen equipo pero...","reviewDescription":"En lo general es un excelente equipo, cámara de alta calidad, gran procesador, el motivo por el que no le doy cinco estrellas es porque no me explico el porque un equipo de alta gama y con un precio bastante alto no incluye un cargador, creo yo es algo básico para el uso del mismo ya que este telefono no recarga bateria con cualquier tipo de cargador si no es el adecuado puedes dañarlo.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Love my new cell phone but.....","reviewDescription":"This is an expensive cellphone. It is even more expensive than some laptops. I chose it because I was looking for the best however the battery does not last more than 8 hours and it take much longer than my old phone to recharge. This is disappointing.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Terrible cámara excelente","reviewDescription":"Muy fuerte","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Nice","reviewDescription":"It's much faster than my S8+, but not as fast as I thought it would be.  Maybe it's my wifi.  The battery life isn't that impressive either.  I have to charge it daily.  It runs about the same duration as my S8+, but since the S24 Ultra has a bigger screen, it might explain it.  Quite expensive for a phone with nearly same specs as the 23.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"Great phone","reviewDescription":"Great features, upgraded from a Note 9 and wasn't a huge learning curve. Pictures are fantastic and processing is snappy and apps open up fast. Very happy with it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Great phone but a bit pricey","reviewDescription":"Switching from my Note 10 Plus to the Samsung Ultra S24 was a big move for me. The new phone works a lot like my old one, and I could easily transfer all my stuff to it. I haven't really figured out the AI stuff yet, but the camera is good, and the battery lasts a long time. The phone is a bit heavy and thick, but I'm happy with its size overall.","isVerified":true,"ratingScore":4,"reviewReaction":"26 people found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"not worth it. bought it during the preorder to get the 200e-gift card, now they say they didnt offer","reviewDescription":"I could have gotten it cheaper off the Samsung website but they offered a 200 e-gift card to be sent after you paid. I received the phone on feb 8th and I have paid the credit card. I called today and the lady on the phone said they were not running any specials on this phone EVER. I researched and found 3 articles that were pushing you to buy on Amazon to get the 200 E-gift card. I order off Amazon all the time so I didn't think to screenshot the info as they have always been easy to deal with. So Im very disappointed that no one can help me with this. The phone isn't worth the money. The pictures are not better than my Samsung s20.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Too much money and will not charge a month later","reviewDescription":"This is the worst of the worst. The voice text is TERRIBLE it uses words you don't even say. The test is worse because it corrects words that have NOTHING wrong with them. NOW IT WONT EVEN CHARGE. WHAT KIND OF GARBAGE IS AMAZON ALLOWING TO BE SOLD ANYMORE!! I CANT RETURN IT BECAUSE ITS BEEN OVER 30 DAYS SO I WONT EVEN GET MY MONEY BACK. WASTED 1500 DOLLARS","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"It forgot how to be a phone.","reviewDescription":"I live in a fringe area. Above all else in a phone, I need excellent signal handling. If it won't talk to the cell tower, everything else is worthless.  The S24 Ultra fails in this one thing.  I experienced dropped calls, and extremely poor data rates.  My kids have a Galaxy A02 and a TCL 40: both low-end budget phones.  Yet both of these phones consistently have 6db higher signal levels, and twice the download bandwidth of this \"flagship\" phone.  I'm sure if you live in an area with excellent signal, this will be an excellent phone for you.  But if you struggle with a cell signal, this is not the phone for you.","isVerified":true,"ratingScore":3,"reviewReaction":"57 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Not What I Expected From Samsung At This Point In Time","reviewDescription":"After owning the S series line of phones for years, this one, if not a step backward, was unquestionably no step forward. I don't know what happened with the color clarity of this phone. There appears to be an issue with the color clarity of this phone, causing the colors to be less sharp and vibrant than usual. My wife still owns the S23 Ultra, and the differences are obvious and incredible.Even with the newest processor, there's not a notable increase in speed compared to the S23 Ultra. She has some pretty chip-intensive apps on her phone, and after loading them on my phone, the S24 Ultra, her phone did better with them.The main point is that I dislike this phone. I found it disappointing given its price. I am going with OnePlus 12.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Sent wrong color","reviewDescription":"Did not receive the violet color I ordered.  To be fair,  the box started it was,  but the phone is graphite, not purple.  I'm terms of the phone itself,  the camera is OUTSTANDING,  don't appreciate not being able to use an SD card anymore - but I understand the marketing scam behind it (forcing service provider customers to purchase storage space a la carte).  It's thicker and considerably heavier than my last phone (Note 10+).  Any \"upgrade\" in cpu power or ram isn't readily noticeable in comparison to my old phone.  All in all,  it's a phone, and not Apple,  so I'm pleased.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Problems S24","reviewDescription":"I love Samsung products, not this one so much.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"I ordered in Purple and it came in yellows","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"The promotion they offer is not genuine.","reviewDescription":"Great phone! I love it! But they offered me a $200 gift card, and I never received it. I tried to contact Amazon, but they said that the promo didn't exist.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"Almost perfect, except the muted colors on screen","reviewDescription":"I haven't purchased a new phone in quite a while so I was pretty excited to get the latest and greatest to hold on to for the better part of the next decade.The phone seems very high quality and premium, but one problem for me.The colors on the screen do not seem to pop. They are very muted. They look almost as good as a phone I purchased almost 7 years ago. The resolution is great, but the colors, just don't seem right. Other than that I can't find anything to complain about.  I hope this is just a software issue that just needs an update or I will feel a bit ripped off for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"19 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"This phone wasnt unlocked for all carriers","reviewDescription":"I got the phone went to my reg carrier and spent money to get a card and kit spent 2 hours before I was told it wouldn't work on their site-I then try ed a few other well known carries that said t hey could help me with activation of a esim card.So I aske Amazon since it was a completely unlocked phone if they could help me get a few dollars back-its costing me15 more dollars per month because I cant use my reg carrier.They said they couldn't get a differment of the price i paid-its its not unlocked to all carriers then the phone shouldn't be as expensive as a totally unlocked one.Iam not a Happy customer.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Great phone. But where is my $200 promotional credit?","reviewDescription":"The phone itself is great. But up to now, like many buyers, I did not receive any promotional credit of $200. Amazon customer service does not seem to understand while the promotion is still going on in the phone page. It is very strange.","isVerified":true,"ratingScore":3,"reviewReaction":"18 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"The phone is great, but...","reviewDescription":"I like the phone but I don't like how I never received my 200$ promotion credit!!!","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Really not worth it","reviewDescription":"Bought the 1 terabyte of S24 Ultra directly from Samsung when it was released. I'm  a long a Samsung phone user Note series  since the beginning of Note series. I upgraded from Note 10 to this phone. And really regert it, Samsung is really charging too much for mostly Gimmicky features, the Camera is a shame (if you compare it with half priced phones from Xiomi or others. Other than the 12 MP camera, I couldn't  find other Gimmicky 50 MP and the 200 MP to produce any quality pictures. To be honest,  the S pen usability is the only thing I still like and reducing my bitter feeling. I wish Samuel have large sensors all same MP size and large pixe for low light instead of the the Gimmicky camera... the AI features is not that great either.... And to be honest, I didn't use the phone call translator for real, i tried it with a friend for fun only","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"Great phone with a bit of disappointment!","reviewDescription":"Let me cut it short for you, if you already have the S23 ultra, or S22 Ultra, there is absolutely no reason for you to upgrade to this one, both phones are almost identical despite all the YouTube videos that want you to think otherwise!The AI gimmick that's all over the internet isn't really integrated into everyday use as expected either so that was not a plus point.The battery quickly learned my patterns and got better after a few days of use,but still not enough for a full day. The processor is amazing and everything runs so smoothly all day long, from productivity apps to games, with its amazing screen, everything just looks better on this phone. The colors do seem a bit washed out on this screen vs the S23 ultra, but Samsung is saying there will be a fix for this.The only disappointment, and the reason why I won't keep that phone, are the cameras.The selfie camera is a disappointment both indoor and, surprisingly, even outdoor it was not good.I had a family event and was too excited to use that big Main camera for all the shots, but I was left disappointed with the performance compared to the iPhone. The low light pictures were not good at all, while pictures with enough light were good, but nothing special. I can't even start to compare this camera to the Google Pixel lines, not even close!Bottom line, you'll get a great daily performance with a good camera and beautiful screen, but I would wait until the price goes down a bit.","isVerified":false,"ratingScore":3,"reviewReaction":"47 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Wow. Not worth it.","reviewDescription":"I got this for my girl because she wanted a new phone. She wanted the best. The S24 Ultra. So I got it. And ordered myself a OnePlus 12R for $499. My OnePlus is almost $1000 cheaper and is just impossible to see how the Samsung can possibly be worth $1420. Samsung is only charging between 15-20 watts with my 100w charger... My cheap OnePlus charges 70-80 watts. The stylus is hard to insert. The battery dies fairly quick even when turned off.I added an extra anti glare protector and in the picture you can see my old OnePlus 9pro vs the S24 with anti glare protector on.The camera is fantastic. But for the price of this phone, there should be A LOT more than a great camera.This launched at 5th place for performance. By fall it might not even be in the top 10. If you really want the stylus or a 200mp camera that doesn't matter in day to day use, go for it. But for almost every other user out there, there's already phones topping this... And for much lower prices. Look at the specs compared to the regular OnePlus 12, you'll see it beats the S24 in 9\/10 categories and for $800. Or the Red magic 9 pro for $850. The S24 Ultra is a waste for most customers. And you can't even brag about it. The only thing you can say is \"I got the best.. Samsung can offer\"","isVerified":false,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Squared off edges makes it tough on the handling","reviewDescription":"I'm coming from the S21U, which has rounded edges. The new design of these squared off edges on the S24U (and maybe the S22 and S23) is just not good for smaller hands. The phone is slightly larger and heavier the the S21U, so sitting in the hands has the edges digging in. I'm really struggling with getting around this. Apparently, someone with big hands designed this.I won't go down the path that everyone else has mention regarding the faded colors other than to say it is something I noticed right away as well. Holding both phones next to each other with these same photo makes it real obvious. Hopefully an update will fix this.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"No warranty by Samsung UAE","reviewDescription":"The phone I received is not the US version. It is the Canadian version. There is no warranty by Samsung UAE, I went to their store in Dubai mall and they confirmed that. The local seller confirmed that they provide a warranty in the UAE against any defects but I decided to return the phone because it is guaranteed to be under warranty outside the UAE.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United Arab Emirates","date":1717372800000}
