{"reviewTitle":"Hurts your butt.","reviewDescription":"I'll start with the negatives.Where your butt goes... it's a bit too firm. After 30 minutes your butt is gonna hurt.  That's the most important part of the chair....The leg rest is okay. It just doesn't extend as far as I'd like. The leg rest also doesn't slide with ease like others I've had.The massager is terrible. Didn't expect it to be good tbh. It just vibrates and hums. 0 effect on your back.  The pillows are fine. But I wouldn't even advertise it as a massager if I was the company.  It's a gimmick.The arm rests are pretty comfortable. The back is fairly comfortable for me. A short person. If you're 5'10\" or taller you'll want a different chair.Back and neck pillows are good. I'd almost say you need them for the chair to be somewhat comfortable.Overall it's an uncomfortable chair. It wasn't expensive so I won't say I didn't get my money's worth. I did. It does the job.But the seat is too d*mn firm. Needs some fluff. Consider buying a 2nd cushion to use if you decide to go with this chair.  I waited to see if it'd need a break in period before writing a review.  After 2 months use.  My a** still hurts. 🤣Positives:Neck\/Back pillowsArm restsLook\/designNegatives:Everything that makes a chair good, ceases to exist.Hard buttShort Back restVibrating pillow gives your back a hummer.If you recline it wants to tip over.The recline isn't a full flat lay down. More like a 45° angle at best.Hope this helps your decision.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Decent \"For The Price,\" but is showing its cheap quality with normal use after only 3-4 months.","reviewDescription":"Overall, this is a decent chair \"For the Price.\"  I have used it on a daily basis at my computer, normal use, no spills, no tears, no accidents of any kind... and after only 3-4 months (May-August) the fake leather is starting to peel and get discolored in the corner of the seat cushion as you can see.  The back cushion is significantly flattened from when I purchased it as well from normal use.  The back of the seat reclines, but the bottom does not lean with it, so it sometimes feels like I am about to slide out of the chair when I recline.  The footrest is chintzey - when I really want a footrest it's better than nothing, but it's not really that comfortable and not convenient to pull out, so I mostly don't use it as a result.All in all, it's a chair, and it works, and if you're on a tight budget - it will work for you too.  If you want a \"good quality\" chair though and you're willing to spend a little bit extra, I recommend looking elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Very poorly made","reviewDescription":"I've had this chair for two years now. When I first purchased this chair I thought it looked nice and it was comfortable. When I was assembling the chair there were some parts of the chair that weren't exactly straight, but it wasn't bad enough to not let me put it together. I wasn't impressed with the quality of the foot rest, but other than that things were okay for a short while. I started having to tighten the arm rest screws monthly because they were loosening greatly. Within a short period of time I noticed the frame of the chair was bending towards the left because I lean to my left. A better made chair would not be doing this or at least not that soon. Also, the cushion padding on the seat was flat and non-existant after 6 months. Now, after only two years, the metal part on the side of the base of the seat where the arm rest screw tightens into completely broke off. Not the screw but the metal part of the chair frame! How does metal break? This product is not worth the investment. This was too much money for me to waste on a chair that was warped after 6 months and completely broken after 2 years.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Broken zippers and backbreaking assembly","reviewDescription":"This thing is a beast. I'm disabled and it was a task just getting it from my porch into my living room.Assembly was easy aside from getting the backrest on. That took far too much effort. It was then that I noticed that the zippers on the backrest were broken. There was no finger tabs to hold onto to use the zippers, so I had to go to the store and buy a repair kit to fix them. No way was I going to take it apart, box it back up, and try to find someone to help me get it to a return spot or to the post office to return it. I'd rather spend the extra 5 bucks and just fix it myself since the manufacturer can't seem to box it up without breaking it.It's a good thing it has a back massager, as I needed it when I was done assembling the chair.Overall, if you don't mind wrenching your back just moving the box and can do some basic self-repair, then go for it. It has good support and the massager is nice.For my own part, I won't be buying a chair from this company ever again, though. I don't like buying broken items.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Eh, medium quality for its price","reviewDescription":"Given how expensive this is, I do not like this at all. The cushion is okay at best, it is NOT sturdy and is continuously requiring me to retighten its bolts, especially for the arm rests even though it was built perfectly right from the get go. It is nice outside material and looks pretty, easy to move on wheels but provides minimal back support as the cushions are not placed properly and the head cushion is actually refusing to stay in place. I would return this if I could but it’s actually pretty heavy and it came in with a box that had fallen apart.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Dont buy this chair","reviewDescription":"This is a very uncomfortable chair. Probably the most important part of any chair is the the seat and it just feels like there is no padding there, and the support of the back is basically not present. I'd like to say you get what you pay for but I could get a more comfortable chair at walmart for half the price, I paid $100 and this chair, it isnt even worth that. That being said, the chair faux leather is about what you expect and the chair articulation seems to do everything well enough. Since the chair is assembled Im not going to return it, its not worth the effort, I'll save it for a backup chair for guests or what ever. I regret buying this chair, even at a discount. My 10 year old cheap office $40 chair from walmart does a better job.(Im 6ft at 180 lbs)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Not bad needs significant improvement before I can recommend it.","reviewDescription":"Before we get started there’s no instructions YouTube videos are awful. Just don’t. I did find a pdf of instructions for a very similar chair that got me through it. Assembly isn’t hard so let’s get into it.1. MAJOR MALFUNCTION - The armrests are nice but they get loose after a few reclines. I’ve tightened the bolts as much as I dare without damaging the backrest or the screws themselves.2. The leg rest. FLIMSY. If you’re a big guy and saw the 400lb capacity and said “hey that looks great!” You’re gonna be disappointed. It dips down when you put your legs on it. It’s basically unusable.3. Seat, backrest and lumbar support:Not terrible. Lumbar pillow could be firmer and larger. Vibration is a joke. My phone vibrates harder. No seat depth adjustment but it’s not a deal breaker as most gaming chairs don’t offer this. Back rest is comfortable enough that I fell asleep in it. Adjusting the backrest isn’t super easy nor is it sufficiently spring loaded to come back up all the way on its own. The seat is kinda hard but it’s 110$ chair I can’t complain about it too much.4: HARDWARE - gas cylinder, base and wheels: it doesn’t lower smoothly for its purported capacity. You’ll drop like a rock. Wheels are not color coordinated which is a bummer but not a dealbreaker. Universal wheels are 14$ and fit great if you have carpet like I do. Base is also a bland black plastic seems sturdy enough.Over all the loosening armrests are the biggest issue the other chairs on here like Dowinx have a car style lever to adjust the backrest and I think I may go with that unless we can get the armrests to stay put.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Doesnt live up to hype","reviewDescription":"When I received the chair, I was missing some parts. Wheels, screws, levers, chair. Contacting customer service and getting them to send replacements was time consuming. UPDATE: Although assembly was relatively easy once I received all the missing parts (actually I was still missing a few screws) after only a few weeks I have had to tighten the arms several times.The seat of the chair is not near as comfy as they say, the footstool is not very useful or sturdy and the back support of the chair is already losing the padding there and is now very uncomfortable. UPDATE: Chair needs more durable padding in all areas. The padding in the seat and back (shoulder area) are already worn and I have had to replace with a pillow to pad the entire back rest. Because of the failing back rest padding I had to remove the lumbar pillow so I could use my own pillow for support and padding.  Also the velco strap holding the neck support pillow is losing strength and that pillow is sagging.Also - not made for short people - I'm 5'3\"  and I can only just barely have feet flat on floor and the arms are too short (it'd be nice if they could be adjusted.) Definitely not worth the cost. Look elsewhere for a better a chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Like sitting on those hard benches we had in school.","reviewDescription":"It was easy to put together, I'm not sure how study it is tho, my left armrest keeps bending way out. It does recline, assuming you would ever need that feature, and it does go up and down via this hydrologic pole the seat is mounted on, and it does swivel all the way around, which was something I was actually looking for, playing my Oculus. Being able to spin around quickly is definitely an advantage. But holy crap, that thing is NOT at all comfortable to sit on. I would DEFINITELY recommend a pillow or SOMETHING to sit on. I've sat on bleachers that were more comfortable than this thing was. Even with a pillow, it's not going to be your \"go to\" chair, I can tell you that right now. Honestly I wish I would have gone with something else and I see this particular company makes a lot of gaming chairs but honestly, I'm not sure if I want another one of theirs and now I'm sure WHAT to look for in a gaming chair. I mean it's really not comfortable at all. 😭","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"There are much better options out there","reviewDescription":"This product was just of very low quality. I put the chair together and knew immediately there was no way. The massage pillow cut in and out constantly, it was being held together by this hot glue stuff that was coming out the end of it. Sitting in the chair wasn’t remotely comfy either. There’s a pocket rocket somewhere in your wife’s nightstand that could offer a better back massage than this thing. Guaranteed. Spend your money elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Decent chair for the price but quality could be a tad better","reviewDescription":"This chair is \"ok\".  I've been in IT for 18 years at the time of this review, owned the chair about 8 months now, but I have certainly sat in a lot of different chairs throughout the years.  I needed this as a quick replacement as I changed jobs and felt the price was good at the time.  I like the lumbar vibration when I need it because I have posture and back issues and that helps me get through the day sometimes.  I also game in this chair at night with my buddies so, I do tend to spend about 12+ hours in this chair a day somedays.  It does tilt back pretty far and has a foot\/leg rest.  I've almost went over backwards sometimes depending on how I shift in the chair.  I am a 6ft 180lb male so, nothing too drastic.  I do have to tighten the screws in the arm-rests maybe once a month as they become very loose and wiggle around a lot.  Definitely annoying but, I keep the wrench right by the desk for when I need it.  Overall its a decent chair, for the price.  Would I buy it again? Ehhh....unsure....but its decent. 3\/5 stars for me.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Decent budget gaming chair","reviewDescription":"In general, this chair sacrifices comfort for aesthetic. A lot of \"features\" felt cheap and unhelpful, while the chair itself isn't anything to write home about.It's wider than my previous chair which is nice because I am broad shoulderedThe padding on the chair is pretty stiff and not that comfortable, but I'm hoping that will fix itself in time.The reclining features is laughable, it has a tiny little kick stand that doesn't feel very sturdy and the back doesn't recline to a full 180.I bought this chair on sale for 113 bucks and it's a decent chair but I'm a little disappointed. I certainly wouldn't pay full price for it.I'm probably just going to buy a regular office chair next time for the sake of comfort.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Meh","reviewDescription":"I have purchased these disposable office chairs for 30 years now. They all share certain idiosyncrasies. None of them are built straight, with the chair tilting to one side or another. This one is no different. I would like to say that you get what you pay for, but I have purchased chairs for several times this price with the same problems. Can't say I expected much else.I don't know why it seems everyone puts up with these same issues coming from the same factories in the same country with poor quality control, and then give them high ratings, other than, apparently this is all we can get. Just like shoes, if you find a good pair and it wears out, you can rarely get the same one to replace it. So you roll the dice and get what you get. This chair, just like all the other ones I have purchased, deserves three stars, and no more.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Cheap","reviewDescription":"I wasn't expecting a lot when I bought this but I will say the quality of the components could be higher. Primarily in the hardware that comes with it. Nearly all of the bolts that go into the arms have since come loose and are now stripped after having to tighten them up multiple times. If you're able, use some lock tite on the screws before installing them. You'll thank me down the road. Overall the chair is fine, comfortable and I'll continue to use it. I just with the construction were higher quality. For $100 though you can't really complain too much I guess. The vibration on the lumbar pillow is kind of fun but isn't something I use often. The manufacturer could have saved some money on the vibration component and spent more on hardware.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"It’s alright for the price","reviewDescription":"This chair I’ve used for almost a year now. The chair has some nice features like the extendable leg rest and the ability to recline as well as wheels to move it around a room. It is also relatively sturdy. The chair does squeak after some use so additional tightening of the bolts and screws are needed. The pillows they provide are pretty much useless especially the “lumbar” pillow that is supposed to support your lower back. I’ve had to throw it away and buy an actual lumbar support pad because the pillows are really useless. Without the pillows the back of the chair is just a hard board. Other than that it’s a alright chair for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Mid","reviewDescription":"The chair is somewhat comfy but not if you have to stay in it for hours at a time. After a couple months of use, the leather of the arms of the chair are already cracking and peeling. On the right arm, I have to tighten the Allen screw what feels like every other week.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Not labeled and what is labeled was not labeled correctly","reviewDescription":"The chair is great once put together however most pieces were not labeled. The ones that were label they were not correct. For example in the book, an Allen Wrench was labeled R. The item labeled R in the box was the arm of the chair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Foot rest shorter than expected","reviewDescription":"Looks great went together easy. Foot rest was shorter that expected. I’m 5’6” and it rests on the back of my calves. The screws in the arm rest loosen over time so maybe add a washer on both ends and throw some loctite in there.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"It was good but not that good","reviewDescription":"It’s a really nice chair and really easy to put together and really helps with your back but hurts my butt and the leg rest is really small and doesn’t go out that far but it’s a decent chair I would say !","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Couple things","reviewDescription":"Easy to esaamble, good price. After 6 months of purchase, it has been noticed of low quality, you have to tighten the screws every week, the chair sounds a lot as if it were very poorly assembled, that’s why 3 stars","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Dimensional properties are relative","reviewDescription":"This is meant for anyone over 63 inches in height. You will find this otherwise uncomfortable to sit on for an extended period of time or simply limited in locomotion. You’ll find yourself fastening the arm chair bolts ever so often. The material seems to be holding for now.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Get something better","reviewDescription":"Sitting in the chair for an hour or so hurts my lower back. The chair isn’t really comfortable and I had to add better supports to it. The lumbar support that came with it didn’t hold its cushion more than a few weeks of only sitting an hour or so a day in the chair. The chair looks really nice, but I’d rather have something comfortable. You definitely get what you pay for, and that’s why this chair is so cheap.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Doesn't feel durable","reviewDescription":"It's a fine chair and my biggest complaint is the arm rests. They're connected to the base of the chair and the back of the chair so the height of the arm rest isn’t adjustable so my arms just hover above them which is uncomfortable. I'm 5'3 so I'm assuming if you're taller your arms will be longer so it might not be a problem. The arms also feel like they're connected very weakly to the chair(although I tightened its bolts as tight as I could) and feel like when I leaned to the side to reach the pedals under the chair it would eventually snap the arm rest off. (Those pedals under the chair are also very hard to reach which caused extra leaning on the arm rest)For the leg rest, I like sitting criss cross so I was excited for this to give me a bit of extra space but when i tried it, it didnt feel very sturdy or durable. I'm worried that if I put the full weight of my legs down on it it'll break. It also doesn't give you the option to rock the chair back other than actually using the pedals to adjust the seat back.Not the worst chair but not the best, I'd rather spend an extra bit of cash on a better quality chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665014400000}
{"reviewTitle":"Missing screw for the back rest plate","reviewDescription":"There is a metal plate that connects the seat and back rest. Based on the instruction. That plate is screwed by an M6x30 screw (4). The threading isn’t M6. It’s an M8 threading (the hole is bigger).  There are 4 M8x40 screws but they are used for the arm rest. I did manage to go to Home Depot and got the right size screw. Just more an inconvenience","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Uncomfortable - Back Pain","reviewDescription":"5'4\", 110lbs tween has used this for a year and has been unable to configure it for comfort (removed the extra support pillows, put them back, recline & adjustments, etc.) . After a mere 60 minutes or so of sitting his back would hurt. He might be too small for it ATM, however the chair is also too small for a 5'11\" adult.On the plus side he was able to resell it at a similar price as purchased (minus shipping cost).I recommend avoiding gimmicky \"gaming chairs\" and getting something with long lasting comfort - a quality office chair...without \"massagers\", ill-placed lumbar or foot supports, etc.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Cheap for not so cheap a price.","reviewDescription":"Assembly: I had to force one arm into place to be able to get the bolt in, literally bending it into place.Support: The bottom is very thick and comfortable but the the spring is extremely weak and not adjustable. So leaning back with just the slightest pressure sends you all the way back.First time with a chair like this so for those in the same situation, the lumbar pad is far to large so you either don't touch the back of the chair with it or your back is bent far out of shape not like proper lumbar support. And the vibrator (not massager) is easily muffled if you really lean back on it and it generates heat after more then a few minutes of use. Oh and its only got a USB power supply.Spend a little bit more and get a proper office chair, especially for gaming, this is a joke and I'm sure all the rest are just as bad.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"Bad cushioning, useless footrest, poor fittings.","reviewDescription":"Easy to assemble but I don't expect much durability. Some of the bolts and fittings were poorly machined, couldn't get some fully tightened and ended up causing slipping with the hex. The arms already have some give to them.The footrest is terrible. It's just two metal rods that slide into a plastic base beneath the seat. The amount of sag makes it uncomfortable to use and the short length lands just about mid-calf on me. I am not a long legged man, so it would definitely be worse on others.Lastly, the back support has almost no cushion. I can feel the support bar against my spine. The included pillows aren't bad and can make up for it if you get them positioned just right. The seat has more cushion, but still more firm than I prefer. I end up having to shift every 5 or 10 minutes to get back comfortable.I'll keep it for the hassle and the price, but certainly not the cushy desk chair I was hoping for.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"Poor Quality","reviewDescription":"I am writing this review after owning this chair just a little over a year. The materials are poor quality. There's minimal  padding inside the seat cushion.  The  leather on the chair began to peel off.  The chair will not stay up, go's  down after sitting on it for 10 minutes, I'm only 150 pound.  The chair is not worth the price.The materials used to manufacture this chair is of poor quality.  Don't waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Okay for Price","reviewDescription":"Overall, this gaming chair is pretty solid. Easy to assemble and pretty sturdy. I like the flexibility it offers as well as the nice padding. However, I ordered the white version and there were little specs of black spots mixed in with the white design which did bother me a bit so be aware of that. I got it on sale so it was not a bad choice at all.EDIT: Chair stains super easily which is extremely disappointing. All I did was place a dry shirt on it and now parts of the chair are the same color as the shirt and it won't come off","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"Esta silla no vale el precio que tiene","reviewDescription":"Hola la Silla de Juego no tiene la calidad esperada por el dinero que pague,a los tres dias se rompio el masajeador y me mandaron uno nuevo,pero ese tambien se rompio el mismo dia,ahora el amortiguador de la silla se baja solo esto es una estafa,quiero que me la cambien o me devuelvan mi dinero,tambien las ruedas son de muy mala calidad,peso 90kg y casi no ruedan,esta silla es de 60$ no de 170$.gracias","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"This seems really sketchy.","reviewDescription":"I get the chair, first thing I do is look for the safety standards that's usually under the seat of the chair.  Nothing. I check the pump, also nothing ok. So possibly an exploding chair. Hopefully not but ok, I go to start assembly. Oh hey it's missing the entire base. I double check the boxes, nothing. I have wheels but nothing to put them into. I try to find the number to call in the instructions. It's a website. Ok, I check online, find a number, almost immediately puts me to voice mail because of a high call volume reason. The answering machine is full. What is happening right now? Is this chair going to explode?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Defective","reviewDescription":"Lever is too high up not allowing the foot rest to go in properly.In addition the delivery guy toss the box on top of my garden damaging the flowers.One of the parts for the lever is bent","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Multiple Quality Issues","reviewDescription":"This product came with multiple scuffed, warped, and broken parts. Also could not even attach one of the arms as the ball bearing inside is crooked and not assembled correctly. Not a great Christmas gift for my finacé overall","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Poor Build  Quaility","reviewDescription":"Purchased this chair back in july. Ive been tightening screws on the arms again and again as they dont stay tight. The chair its self has broken around the part where the actual chair mounts on the piston and so now it always sits reclined and uneven. Couldn't Recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"great support, uncomfortable seat.","reviewDescription":"one of the reasons i bought this was because my main hobby is gaming and i need proper support for my posture and spine, which this does very, very well. the more important reason i spent over $100.00 on a gaming chair is because i am someone who suffers from chronic pain and i need something that doesn't make that pain worse. this chair helps a lot with my lumbar pain, but the actual seat where you sit? my ass hurts after fifteen minutes. there's basically zero cushion for your actual ass. i don't recommend this chair for someone who wants to be fully comfortable unless your have a spare cushion, which you should not need. i regret spending the money i did on this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667433600000}
{"reviewTitle":"Great, but I can't screw in the right arm rest","reviewDescription":"The chair I was sent has a defective right arm. It cannot be screwed into the seat because the plastic inside the arm is crooked, so I had to do a bit of cutting through and super gluing to get it to fit. I have also had to re-screw everything almost every week because of how much movement it requires to disassemble. Despite these flaws, the chair is quite comfortable, and I have been using it for about a year.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Size","reviewDescription":"Meant more for a kid then an adult","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Cheap quality","reviewDescription":"Arms wobble and feel flimsy since day one. Tilt lock barely lasted a month, chair will lean back with barely any pressure so I could never actually rest back against the chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Weak welds","reviewDescription":"Seat mechanism welds broke after about 2 months of use and parts are almost as much as the chair itself","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"We can’t tell if the chair is good until we have all parts","reviewDescription":"Chair is nice but unusable due to missing arm rests. I can not tell if we like it or not. Customer service is slow","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Impressed. Good buy!","reviewDescription":"If you’re like me you probably spend hours sifting through reviews before making a purchase online.  Reviews for this chair are pretty high, and for good reason.However I did come across some criticism reviews, and I’m not going to say that others’ experience with this chair aren’t valid.  The main complaint that stuck out was screws loosening over time.  The assembly manual that comes with the chair clearly states that this will happen, and you may need to tighten them.  The reclining feature means that parts have to move and rotate, so this really shouldn’t come as a surprise.  Another complaint I saw was that the footrest wasn’t very sturdy…well, it’s a footrest and not meant to be sat on.  The chair is sturdy, no creaking or popping of parts.  The casters are smooth on carpet, short carpet, which is great. The padding on the seat is comfortable, but I would say it could use a little more on the seat side panels, and could be firmer on the armrests.  All-in-all I’m pretty happy with it thus far.*I’m only 5’7” and 200lbs, it feels like it could handle way more but I personally can’t verify that.","isVerified":true,"ratingScore":5,"reviewReaction":"52 people found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Better than expected !","reviewDescription":"⭐️⚫️🔴 **Fantastic Gaming Chair Experience!** 🔴⚫️⭐️I was pleasantly surprised by the outstanding quality of this red and black gaming chair when I made the purchase on Amazon. The package was impressively heavy, hinting at the sturdiness and durability of the chair within.The assembly process was a breeze thanks to the clear and organized instructions provided. The neatly organized tools, complete with extras, made the setup even more straightforward. What was even more delightful was having my 10-year-old son join in on the assembly process – it turned into a fun and engaging activity for both of us.The moment my son settled into the chair, it was clear that he absolutely loved it! Not only did he find it comfortable, but he was so relaxed that he ended up falling asleep while watching TV. The chair's design and ergonomic features contribute to its comfort, making it a hit with the whole family.The superior quality, comfort, and ease of assembly make this red and black gaming chair a standout purchase. If I ever need another gaming chair in the future, I wouldn't hesitate to buy this one again.Thank you for providing such a fantastic purchase experience and the comfortable end result. This gaming chair has truly exceeded my expectations and brought joy to my son!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Good for sitting for a long time","reviewDescription":"My kid was doing online school and he needed a new chair. I saw that this had a massager and wanted to give it a try. He loves his chair and his back isn't hurting from sitting for a long time.Pros-Foot rest is nice. It's at a good height-The wheels are smooth and glide in our tile floor-Good range of motion-It comes with a USB massager. My kid uses a power bank to power it and it works really well-It has good support in the back and bottom areasCons-Takes a while to put together. You will need tools if you want it to be done right-Heavy. I had a hard time getting this in the door the box was huge and heavy.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Solid chair, custome support was very helpful.","reviewDescription":"I initially ordered the blue chair, but received the black chair instead. Customer support contacted before it arrived and advised I cancel the order, but I missed the email. They offered for me to keep the black chair in exchange for some money back and less hassle on my end, but I declined. They then helped to facilitate returning the incorrect chair and sent the correct one. It took a bit longer than I would have liked, but I was willing to wait. Overall, customer service was very helpful.The chair itself is easy to set up and comfortable. I was worried about it not matching my set up, but it fits fine and is easy to maneuver and adjust.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Cool esthetic and comfortable design","reviewDescription":"Got this for my husband and he loves it. The red color is striking and cool looking. The foot rest, arm rest, head rest, and back rest make this chair super comfortable. He did say if you're tall (he's 6'2), the adjustable head rest doesn't fit well. It reclines pretty far back; combined with the extendable foot rest makes it like sitting in a comfy recliner. And it has a built in back massage setting via USB power cord. I can't speak to durability because we have only had it 1 day but the materials seem sturdy and of well quality. Assembly took my husband about an hour.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Worth the money","reviewDescription":"Stylish and very comfy compared to a regular computer chair. Easy to set up as well.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1724198400000}
{"reviewTitle":"Son loves it","reviewDescription":"Bought as a request for my son for his birthday.  He choose the fabric so it would not be to hot\/cold. Material is made well, small touches like the padding on the arms and the neck and massaging lumbar pillow, and the leg extension which hides away if you don't want to use it are all a bonus. It reclines and licks into place and is easy to operate. The chair was simple to put together.  They thoughtfully included extra parts and an awesome allen wrench. He loves it so much he suggested to his older brother to get one for his birthday.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Love my chair","reviewDescription":"Chair assembles fairly easy. These things normally take my husband a long time to put together no matter how easy they promise to be, but he got it figured out within an hour or two. The chair is super comfortable to sit in for a long time. It can recline back so far! And you can lock in your preferred amount of recline. The foot rest is awesome, as I'm the kind of person who likes to slouch with my feet propped. I am very happy with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Great quality for the price!","reviewDescription":"Bought this chair for my boyfriend and he loves it ! He has had it for about 2 months and has had no problems he says it is very comfortable! It leans back super far and it even has a foot rest and comes with a back piece that vibrates as a massager ! Very good quality for the price !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"comfort","reviewDescription":"I have been using it for few days in a row now and it is still good and comfortable to sit in. I have sciatica inflammation\/nerve issues on one side, having the lumbar massage come with the chair with the chair adjusted at right height and back support, the whole thing did the job good by making me sit comfortable and relax the muscles in my bad spot (lumbar & pelvis). I am currently sitting in it as I type this. I will highly recommend this even for office, not just for gaming.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Good for price, but quality is iffy.","reviewDescription":"The quality of material could be better. I gifted it to my brother for Christmas and for the time he's had it, it's held up but is already starting to wear down a bit in the places he sits\/and or uses the most. Good for price though, and I got it while on sale so that was a plus!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Its alright, Not comfy but ALRIGHT.","reviewDescription":"So I got the Red one, And I enjoy the massage feature but I will say overall the chair is super uncomfortable when trying to lay back in it. I did fall once because I leaned back too far and the chair basically fell back. It was kinda funny. The seat doesn't have memory foam which is good, But the back rest is just way too uncomfortable for my back personally. I also have scoliosis and the chair I had before was terrible. For Gaming wise, I'd give this chair a 2 or 3. For Office Work and working from home. Depending on your schedule if you're sitting in it for 4-5 hours straight, Look else where.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Good quality chair, but missing items","reviewDescription":"I like this chair overall, and the most important parts did arrive in good condition. However, it was missing the plastic height adjustment piece that goes between the chair and the base. I can only sit at one height. I requested that piece be sent to me. Other than that, it's a pretty decent chair for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"-After 7 months of 8-12 hours\/day","reviewDescription":"the back rest screws are too long to where they touch your back and you can feel them through the cushion. the chair itself is getting uncomfortable","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Uncomfortable!","reviewDescription":"I bought this because it had tone of great reviews and high star rating but was very disappointed after assembly. The chair itself looks nice, but it’s highly uncomfortable. It is stiff and unforgiving. It makes your butt go numb and isn’t good for long hours. The foot rest is more a calf rest and feels awkward. The massager only works if plugged in to USB but the chord is so short it’s impractical. The material itself feels cheap and I don’t foresee it lasting long. The last zinger is I bought this with Prime thinking I could return it if I didn’t like it - which I can - for the cost of return shipping which is about as much as the chair. Overall, don’t buy this chair. Get a lazyboy from Office Depot.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Game chair","reviewDescription":"But as comfortable as I thought it would be plus regret getting those colors.  Should have gotten solid black.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Doesn't rock.","reviewDescription":"The chair does not rock.  It's either all or nothing with this chair back.  Not supportive enough.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Not good quality!","reviewDescription":"I gave it three stars because at least it resembles a chair when it is assembled. But it is the most uncomfortable, poor quality chair I have ever seen I do not recommend anyone buy this chair. I have used it for a total of two hours and have bad tailbone pain. Once again I do not recommend this for anyone wanting to sit for more than 5 minutes… would return it if I didn’t have to disassemble it….","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Shipped wrong color","reviewDescription":"Ordered all gray, but received black and gray. Although it was shipped with the wrong color, this chair is comfortable. I did notice that this chair doesn’t recline as much as my bf’s gt player chair, all leather, but enough to feel comfortable. The massage feature is ok as well. I didn’t care much for that feature but if you don’t mind being sent the wrong color, I’d say this chair is pretty decent.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"It’s nice but you get what you pay for.","reviewDescription":"I have had this chair for a few months now and used it 6-10 hrs M-F.Pro: looks good. Comfortable for 4-5 hours at a time. Cheap. Kids love the slide out foot rest. Little lumbar pillow really works!CON: Cushion starts to give out after a month. Chair screws for the arm rest loosen over time, you have to tighten them up once a month.Conclusion - I like the chair but I’m worried about the cushion becoming a total pancake in a few more months.  It’s only about 1 inch thick. An extra inch would make this chair 4.5 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"okey for 100 bucks","reviewDescription":"I was on budget but I would get more comfy because I spent a lot of time on games. for an hour a day its okey but not more than hour I think","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Pretty good","reviewDescription":"Overall quality of the chair seems quite high. The only issues I have are the narrow back and lack of good lumbar support. As someone with back problems it isn’t ideal but I still like the chair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Easy to Assemble but Uncomfortable","reviewDescription":"The chair is good and functional for the cost however it is quite uncomfortable especially in the back. If you are a very slim individual it should be fine but the back juts in at an uncomfortable angle. If you want something cheaper its a solid choice but not for sitting in for long time periods.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"Missing hardware","reviewDescription":"I bought this chair for my son for Christmas, and when i opened it to assemble, it was missing all the hardware. The chair itself looks like it's going to be a decent gaming chair if i can get the hardware","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Looks great, but not comfy.","reviewDescription":"Love the look, but very hard and not comfortable. Top neck pad just doesn't fit right, always moving around. Arm covers started wearing after 2 months. Lumbar pad always moves, too. Of it had a better butt pad and thicker arm rest covers I would give it a 4 of 5 stars. Neck pad is just a plain stupid design.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Buy something local","reviewDescription":"Well when I opened the door and seen the box it looked like it was on the front lines fighting in Ukraine for the last six months. I had a feeling it wasn't going to need medical attention on the inside. There is a rip on one of the edges and two of the bolt locations that hold the right side armrest were bent so the back is not square. I tried everything to square it up but nothing worked. Trying to line up the bolts was a mission. After doing some triage I got it all together. Once this chair finally gives out which probably won't be long I will just drive down to Office Depot and get a new one. Don't be lazy like I was just drive down the street and buy one local. I'm just counting the days before this thing has a flashback and falls apart.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"hardware breaks, but chair is really nice","reviewDescription":"the screw has broke in two in less than 2 weeks. sad this happened, but other then that it was just the chair my grand son wanted.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Shipping is ridiculous!","reviewDescription":"The product itself is good. Seems of good quality and looks really good. The shipping cost $29.99. Eh..OK whatever. But then..it sat at the warehouse and showed as shippped when it fact it didn't get shipped until 2 days before I got it. Ordered on 7\/6\/23 and didn't get it until 7\/12\/23. That part is on the seller. Then FedEx decided to get lazy and deliver it to the leasing office rather than the door. I had to carry the thing, heavy but not crazy heavy, 2 blocks to my apartment. That part is absurd. That is only reason for the lower rating. Other than that, it seems to be pretty decent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"not near as good as i expected for the price","reviewDescription":"total assembly time about 35-40 min, looks great. seat cushons are not near as thick or supportive as i thought they would be, foot rest arms are quite flimsy considering this is supposed to be a chair rated for 300lbs. im 180. its ok at best. I do like the usb powered massage pillow, i like the recline feature although when locked the arm to release is is out of my reach. NOT worth the price in my opinion. spend the extra money (even if double) and get a real gaming chair. i prob would have been happier with a similar priced chair from walmart or office depot.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"If you follow their instruction how to assemble it - u will get lost","reviewDescription":"So apparently they are using same instructions for the different chairs they have manufactured before.Some things are drawn differently, the sizes of screws, bolts, etc. do not match, I had to choose the details at random. It took 3 hours to assemble. The right handle is constantly falling and it is impossible to screw it down","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Great comfort and support","reviewDescription":"I have only had this chair for a day and I haven’t felt this kind of support since my mother carried me in her womb. I’m 6’3, 230lbs and back support is so important since I work from home. The chair may tip a little if I’m not careful when I lean too far all the way back but other than that it’s fantastic. The massage feature and seat cushion are amazing. I think it’s shines best when just sitting upright with all the back and neck support.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great buy","reviewDescription":"My son loves this chair. No issues putting it together. Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great experience, even better chair.","reviewDescription":"I got this chair for my son and as I was putting it together I noticed the gas lift was missing. I contacted the seller and got a response from them within a couple hours. They got me the gas lift and let me just say I find myself sitting in the chair often. So comfortable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Perfect!!!","reviewDescription":"Brought this for my boyfriend gaming setup! Was a bit tendinous putting it together; he did not add on the footrest piece... personally I would've added it, but it was his gift, so I let him be. He's 5'9 around 275lbs and the chair held him great. Only had the chair for seven months and the chair started to lean a bit, when I noticed I immediately contacted the seller and they quickly determined the problem with pictures and sent out the correct piece to fix the problem.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Dope chair","reviewDescription":"it’s a very perfect gaming chair, a little stiff but i’m sure after a month it’s gonna be softer from me sitting on it. was very easy to assemble. 10\/10.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Perfect solution!","reviewDescription":"Durable, comfortable & sleek! GREAT value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725235200000}
{"reviewTitle":"nice chair","reviewDescription":"comfortable, nice movement","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Purchased for father's day","reviewDescription":"Great gaming chair! My husband is 6\"2' and finds this chair extremely comfortable for gaming and PC use. He doesn't really use the vibrating pillow. He really appreciates the adjustability of the back rest and leg rest. Assembly was very easy and the size is perfect for him. Very good back support.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Super good","reviewDescription":"Super comfy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Gaming chair","reviewDescription":"This is good quality and easy to put together…got it 50% off during the sale !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Okay chair for an okay price.","reviewDescription":"Armrests move forward and back with the reclining, do not adjust up or down. The chair and parts do not feel cheap or like it won't last long but the seat is thin and gets harder over time. The foot rest is small, angles kind of like a barber's chair and will probably be under your calves or ankles. Better fits someone closer to 5'6 more comfortably than someone closer to 6'. The reclining feature has a lock to set where you want it. The bottom back pad has a vibrating feature which while not like a massage chair, feels nice to use. Too many gaming\/computer chairs are way overpriced; for what you get, this chair is an okay purchase. May not fit larger legs or waist, (I'm 230lbs, 250lbs would be the upper limit for seat space between arm rests). On the stiff side, but with back and head cushion. Decent start chair.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Not comfortable","reviewDescription":"I feel this product is highly over-rated and is definitely not comfortable for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Seat not cushioned enough. Otherwise, a solid chair.","reviewDescription":"Great in every other way but the seat does not have enough cushion. Have to buy an additional seat cushion or else it becomes very uncomfortable after an hour or so.This reclines more than expected. Great feature.The foot rest could come out a little farther. Sits high in the calf if you’re over 5’11’’.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Mixed Feelings About the GTPLAYER Gaming Chair","reviewDescription":"I recently purchased the GTPLAYER Gaming Chair in white for my son, hoping to provide him with a comfortable gaming and study spot. While the chair has some positives, there are a couple of notable drawbacks that have left us with mixed feelings.Pros:1. **Stylish Appearance**: The white color of this gaming chair gives it a modern and sleek look that fits well in his gaming setup.2. **Lumbar Support and Headrest**: The inclusion of lumbar support and a headrest provides additional comfort during extended gaming or study sessions.3. **Footrest**: The footrest is a nice addition, allowing him to stretch out and relax between gaming sessions.Cons:1. **Limited Reclining**: One major drawback is that the chair doesn't recline all the way, which my son found disappointing. He was hoping for a more extensive range of reclining options for maximum comfort.2. **Non-Adjustable Armrests**: Another notable issue is that the armrests are not adjustable in height. This lack of flexibility can lead to discomfort during long gaming sessions.In conclusion, the GTPLAYER Gaming Chair in white has a stylish appearance and provides some essential features like lumbar support, a headrest, and a footrest. However, the limited recline and non-adjustable armrests have left my son somewhat dissatisfied. While it may suit some users, those who prioritize extensive recline options and adjustable armrests might want to explore other gaming chair options.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"Not Great","reviewDescription":"This chair looks great but it's very cheap for the price. When sitting in it you can tell it's a cheap chair. No support and it makes a lot of noise because the swivel really isn't that well made.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Good within a year","reviewDescription":"Honestly I really liked the chair and how customizable along with being comfortable.But I've had it since last August (so not even a full year.) and where the piston is, the welding split, and looking further into it it barely looked welded. Also another thing that bugged me was the back rest screws are too long to where they barely touch your back but you can feel them through the cushion. The screws are an easy fix, but the welding is another issue. But within the time ive had it, Other than that I'd probably recommend the chair for someone of lighter build than me.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"HARD!!! this is a hard chair not soft. I couldn't sit in this  hair very long.","reviewDescription":"Way to hard\/firm or a chair. Not for me. The back part of the chair is cheap and flimsy. I would  never suggest this chair for anyone to buy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Yikes","reviewDescription":"I found this dead roach inside of the box with the wheels and pieces I also killed 2 live ones crawling out the box, now I’m gonna have to spray or something to make sure I didn’t miss any since the box had been sitting for a good 20 minutes inside my home. Now the product is good I have no issue with that I do have an issue with roaches inside of the boxes being shipped to me.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"Meh","reviewDescription":"Isn't going to last long. Armrests are cracking. Chair creaks and squeaks. Will not roll on carpet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Just got","reviewDescription":"Easy to put together but the back of the chair was already torn And the plastic it came in was not so it must of happen before shipping it. Still a decent looking chair, going to take it to work to try out, I sure hope it’s better to sit on for long periods at a time. I will up date later","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Don’t buy furniture on Amazon!","reviewDescription":"After this I will never purchase furniture from Amazon ever again. Here are the Pros and cons.Pros: Looks really nice and is very easy to put togetherCons: Not comfortable, the reclining foot rest is just horrible! Definitely need to put just amount umph to pull it out, if you yank to hard it comes right off. Then resting your legs on it just feels as if its going to break off. I am no stretch a big person either, then trying push it back in just a jank process. The lumbar and head rest are just strap ons you can place onto any other chair. I bought this chair thinking it would replace my old office chair i purchased from office depot over 20 years ago. Sad to say this was just a poor purchase from my point of view. Hard lesson learned on my part.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Screws holding the arms continuously loosen","reviewDescription":"I’m forever having to re-tighten the screws on the right side arm rest, meanwhile the left side snapped completely. I don’t know what to do at this point except throw it out and buy another new one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Chair is small NOT for an adult.  Quality is very poor!!","reviewDescription":"Chair is not very comfortable for a 6' adult.  The quality is very poor.  I already had to tighten the bolts.  It is nothing special for the price.  I would not purchase again.  Shipping was expensive $29.00 USD.  Picture is deceiving looks much larger than actually is.  NOT GOOD FOR OFFICE CHAIR!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Be sure to test the screws before assembly!","reviewDescription":"I’d highly suggest you save yourself some time and test the threads before full assembly.  My chair has a permanently loose arm as the threads to attach it were damaged. Upon contacting the company there was little they could do for me and requested I send video proof, to an email address outside of Amazon.The comfort is expected for the price. If you’re going to be sitting for long periods you’ll want something more than this. It is hard and rigid with very little padding. It does not feel sturdy, especially the foot rest.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Built for looks, not durability","reviewDescription":"Pros & Cons listed at bottom if you don't want to read all this.I received this chair yesterday. Packing was fine, and assembly was pretty straightforward. The chair looks decent, and is moderately comfortable.It was designed with very cheap plastic, and without much quality. A lot of the plastic pieces had nicks, scratches, and even a couple gouges out of the plastic, which is so soft you can tear into with your fingernail. The pleather is not good for long sitting, as it can cause sweating. I work from home 8 hours a day and typically can spend up to another 5 hours per day on top of that at the computer. It is not comfortable enough for that kind of use. Also, I'm a fairly wide shouldered man, and the \"wings\" on the side of the chair curve inward, so I feel squeezed rather that supported.The armrests are also very fragile. They're bending armrests and they're only connected at two points to accommodate that, but that also makes them very weak to any kind of sideways pressure.The back without the lumbar pillow is almost comfortable, but has a weird knot about halfway up that sticks into the back. This isn't as noticeable with the lumbar pillow, but that pillow is very uncomfortable, probably because of the mechanisms inside for the massage function. I did not try the massage function.Without the lumbar pillow, it's not bad when reclined with the leg rest, though the leg rest is only held in place by a single screw to prevent the bar from sliding out. I doubt that would work very well for long. However, you have to manually bring the back up after reclining. Not a huge deal, but another annoyance on the long list.Pros:+Fairly comfortable without lumbar pillow\/massager.+Nice when reclined+Looks nice+Not terribly priced+Leg rest comfortable+Easy to assemble+Well packaged for shippingCons:-Cheap Material-Uncomfortable with lumbar pillow\/massager-Narrow Shoulder \"wings\"-Flimsy armrests-Material doesn't breath\/Makes you sweaty-Plastic came damaged, can be scratched away with fingernail.-Head Pillow strap not adjustable, annoying for tall people-Not comfortable for long work\/gaming sessions.-Back of chair does not come back up automatically (have to pull it up)Recommendation:Do not buy this chair. Save your money for a better one. I am going to try for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1607558400000}
{"reviewTitle":"Not great quality","reviewDescription":"Chair seemed nice at first but it didn’t last long only a few months and it broke and isn’t fixable. I’d recommend getting a higher quality chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"You get what you pay for....","reviewDescription":"So, before you start accusing me here, I am not a sweaty gamer or even a potato of a human that is living in this chair watching netflix. This thing is just cheap, price wise and material wise, I have had this now under 6 months an the \"leather\" coating is flaking off. The back support is non existent, so spend a bit more money and buy a chair once instead of finding yourself browsing around to replace this one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Very stiff","reviewDescription":"Maybe I just got a bad one but I found this chair way too stiff. The extra bells and whistles (lumbar support, footrest) don't really make up for how uncomfortable it is to sit on - especially for someone like me who uses it for 12+ hours a day on workdays. I wound up getting an entirely different chair after a little over a week and love my new one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717027200000}
{"reviewTitle":"Okay","reviewDescription":"Instructions were simple and the chairs comfortable, but unfortunately, they failed to include the footrest.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Fake leather for arms and seat, cracks and peels less than a year after buying it","reviewDescription":"I don't normally write reviews. It's been about a year since I bought this chair. I am really disappointed. It is a comfortable chair, but the fake leather on the arms and seat have been cracking and peeling for a many months now. I expected it to last longer than this. I am 5'9\" and 165 lbs. I also take care of the things I own, especially things that cost this much. The cracking and peeling came about just by daily use and it should really last longer than this. Other than this the chair is very nice though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Sorting through the return process was......a process","reviewDescription":"I have been trying to return this garbage chair since we got it two months ago. Seller gave me the run around for a couple weeks until I filed a claim with Amazon. The seller was then supposed to provide a return label, which they have failed to do and I can't seem to get a competent amazon rep on the phone to help me with the claim. We are currently storing an unusable chair in an enormous box (that we boxed up when they said they'd be sending a return label.....which never came).Key points: Chair arrived with a faulty armrest that could not be screwed in. Seller would not accept the return, amazon has been extremely unhelpful as well. We're out $130. Don't buy from this sellerUpdate 12\/9\/23: after many phone calls with Amazon we finally got them to issue a return for the chair. Took quite a while and literal hours on the phone trying to get someone competent to help but finally got the return label and shipped the chair back for a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Just an okay chair","reviewDescription":"The footrest gets jammed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Good for the price","reviewDescription":"Very stiff seat cushion, didn't realize that there is no tilt in the seat, but the recline ability is nice.Leg rest is just for looks unless you are very short.Overall, not a bad chair for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"It's good for the price","reviewDescription":"The chair itself is sturdy and supportive. Easy Assembly and everything you need is in the box. Color and feel is good. It does vibrate well and feels good on the lower back.The footrest is shaky at best  definitely needs more support and only extends out to my calves. I'm short so I can only imagine being tall and having to use the footrest. The headrest pillow has already came apart. The zipper didn't last one week. Just going to find another one for now. For $100 it's fair but definitely going to get a better one down the road.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"I'm not mad at it","reviewDescription":"It's certainly sturdy and easy to maneuver.  But your bum aches after a few hours in it.  I just bought an ergonomic chair cushion and I'm much happier.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Good but can’t use foot rest.","reviewDescription":"I was able to put the chair together quick and easy. But I am unable to use the foot rest due to the fact someone forgot to finish drilling the hole all the way and forgot to put the nut in so it will stay screwed in.I need a chair so I am keeping it because the rest of the chair is functional and I really like it. Just disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Not great for content use.","reviewDescription":"It nice chair easy put together. I wouldn’t by this unless you looking cheaper but looks nicer. Materials are kinda cheap. It’s nice for casual use but if you either work from home or play video games pretty regularly this would be a good match. The “skin” of the chair tears pretty easy and the seat becomes uncomfortable after a couple months or so. Other than that it a “decent chair”","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not so good","reviewDescription":"After using this chair for a while, it began emitting strange noises that were quite unexpected. Initially, it seemed sturdy and reliable, but these sounds have raised concerns about its long-term durability. The noise occurs mostly when shifting weight or moving, indicating possible issues with the chair's construction or materials. Despite this drawback, the chair remains comfortable and visually appealing. It's disappointing, though, that the quality doesn't seem to match the aesthetic and initial impression.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Pad is Stiff, Leg Rest is A++","reviewDescription":"Comfortable chair for first two hours. After that time line it starts to get very uncomfortable very quickly. However, the leg rest and simple reclining features allow for some alleviation of personal stiffness (pulled those words from Webster lol). Overall, great cheap chair. Worth the buy for casual gamers. If you will be sitting for long periods of time I would invest in a more ergonomic chair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Chair","reviewDescription":"Support not to great, stability not to great. It was easy to assemble, not versatile","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"More made it china","reviewDescription":"Is everything from Amazon made in China? Chair looks decent but the arm rest constantly is coming loose, the neck rest pillow strap has stretched out so much it hangs below your neck, & it's now starting to lean to one side. This after less than 30 days since purchasing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Quality needs work","reviewDescription":"Easy assembly the quality could be better and after getting it together I found out the back massager wasn’t working and the lumbar pillow zipper missing a piece","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Massage pillow cords broke in less then a week","reviewDescription":"I was so excited to get this chair for my desk, I have always wanted one of these. Originally when I bought it I was interested in seeing how the massager worked on my back since I am a swimmer who struggles with back pain a day to day basis from my bacterial meningitis since I was little. it was all going great. Loved how the chair felt for the first 2 days. Today my light weight cat jumped on the chair and the cord from the massager pillow broke. As you can see in the picture I did take it apart to show the pieces. overall was not happy that this was so easy to break. I do not want to return the whole chair because it is very comfortable but seeing the pillow break in 2 days was very disappointing. I would not recommend wasting your money if you plan on the massager being a big part of your decision","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654992000000}
{"reviewTitle":"Not great quality","reviewDescription":"I purchased this for my boyfriend’s birthday. He loved it at first, though I sat in it and didn't think it was very comfortable, the padding is thin and firm. After about 2.5 months of daily use, the right arm completely snapped when he rested his arm on it. Definitely not built for grown men or daily use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"I regret it","reviewDescription":"The seat has very little cushion (it's kind of deceptive looking imo) especially the bottom and the plastic feels cheap. The massage pillow is a joke, as you could assume. It just vibrates, loudly. I'm very disappointed in myself for purchasing this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"I do not recommend.","reviewDescription":"supports in the back seem to be made of plastic and broke after about 2 or 3 weeks of use.screws seem to be ok quality I have been tightening them every few weeks like it said to do and they seem to be holding up so I think that is the only part that is ok quality wise. The leather is very bad quality started peeling only after 2 weeks or so. long story short, ok screws, bad leather, broken supports in the back.And if punctuation is bad I'm young.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Cheap material","reviewDescription":"Sits ok. Not very comfortable,  padding is thin. Material is cheap and shows wear after only a few months of use. Good for a quick solution,  not a quality product for long term.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Nice looking, seems made for smaller bodies","reviewDescription":"The chair is attractive and has lots of options. It was easy to assemble and all the pieces arrived in good condition. Delivery time was a little long (but that could be the Xmas rush and\/or Covid.)As I am working from home I needed a chair that would offer support for an extended period of time.  I considered this as it had a high back. However I would say the chair is not for an adult. I'm 5'7 and found issues with the chair.  If you have wide shoulders the upper side bolsters push in making it hard on your shoulders. The bottom bolsters are okay, but are small bumps. I would rather they be wider or not there at all. Next the cushion is not soft. It is quite firm. I'm 190 and found it too hard and probably too thin. The arm rests are too low for an adult. I'm 5'7 (not tall) and I found them too low. The lower lumbar didn't seem to do anything for me. Also the neck pillow just pushed my neck forward with my squished shoulders. It seems like a chair mostly for a smaller person. I will be moving back to my older chair and giving this to a younger person.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1609286400000}
{"reviewTitle":"Very uncomfortable","reviewDescription":"Two bolts are stripped from the factory and the chair is very uncomfortable to sit in. The cushion is very hard and the recline feature is crap. Will be returning","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"NOT A Quality Product!","reviewDescription":"Had high hopes for this chair. Bought it for my home computer desk. Not much padding. However the frustrating part is that the armrest screws need to be tighten every couple of days. I am not rough on chairs and have never had this issue with prior desk chairs I have owned over the years. Wish I could return it. Do not waste your money. But if you do, keep a hex wrench close by.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Not comfortable","reviewDescription":"Chair was easy to install but it is not comfortable at all. I still kept it because I didn't want to go thru the trouble of having to break it down and shipping it since I already thew away the box. I had to buy a cushion and back support. Back support has not insulation and you can see the bar and hurts after a while sitting on the chair. I usually don't do any reviews but for this price I thought it wasn't worth buying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Decent chair but not the most comfortable","reviewDescription":"The chair was easily assembled with clear instructions. It took me roughly 30 minutes to put together.The chair itself is not super comfortable, but it's not bad. The cushions are not well-padded so the chair feels quite stiff overall. - The back massage cushion is really awkward if you're not using it and the cable is awkward if you are. - The head cushion is too low and just forces me to lean forward a little bit, so I leave those cushions off most of the time. - The leg rest is an awkward length that only goes out to my upper calfThe best use of this chair is to have all cushions on (and the massage function active) while the chair is fully reclined and the leg rest is out. It does make a nice recliner this way, but of course that's not practical for sitting at a desk working or gaming.I definitely don't recommend if you have back problems as I think this chair will make them worse.It's a good price, but you pay for what you get.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Fast Wear & Tear - Have to Constantly Re-Tighten Bolts","reviewDescription":"Pros:  It has done it's job.  I needed a desk chair for my home.Cons:  The wear and tear. Purchased in Oct 2024, and it's June 2024 now.  I have to constantly re-tighten the bolts because the arm portions of the chair get loose.  It's not a terrible chair, but I would prefer higher quality.  I use it daily.  Less than a  year in and I am considering buying a better chair. I hardly use the massage feature or the footrest feature.A five star review for me would mean quality that lasts and comfort that surprises me.A four star review for me would mean more comfortable and does its job better than the average chair.I give it three stars.  Average comfort, disappointed on wear and tear and need to maintain the chair with the re-tightening of the bolts.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Comfy","reviewDescription":"It’s ok have kids at home beware","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725235200000}
{"reviewTitle":"Comfy and looks nice, but doesn't last","reviewDescription":"I really liked this chair but after less than 2 years, the backrest will not stay locked anymore. Leans back with the lightest pressure while it's locked. Armrests also keep loosening itself as well. Just expect to replace it sooner than you'd like","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Ehh","reviewDescription":"I wanted an extremely comfortable chair - this is not it. It does the job but if you’re sending 8+hours it’s not very comfortable the foot rest is not as easy to push in and out. It gets stuck a lot","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"I gotta problem dood","reviewDescription":"dood listen, I put it together pretty good n stuff but them I get to the end and the screw wouldnt fit!!! I had to go to get bigger screws !! screw you!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Its alright","reviewDescription":"The chair was not as comfortable as advertised. I thought I screwed the bolts tight enough when putting together but the arm still keeps coming loose and falling off","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Padding wears out.","reviewDescription":"I got this chair about six months ago. It was great when I got it, easy to assemble and comfortable. However, now the padding on the seat has begun to get very flat (I weigh ~180lbs). I ended up ordering a seat cushion and that fixed the issue. But now the back itself is starting to wear out and I can feel the hard plastic through the rear padding.The chair worked great for a while, but the padding wears out fairly quickly. Be warned.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Comfortable Chair","reviewDescription":"I bought the chair in July of 2023. I have been using it almost every day since I got it. It is comfortable, I like the adjustments that can be made and the lumbar massage is nice. However, one month ago I started to noticing cracks forming on the arm rest. And the cushion is now no longer comfortable. I am now using a computer chair seat cushion. Yes it's economical and yes it is comfortable. But it may not be a long term chair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"TERRIBLE PRODUCT! TRUST ME!","reviewDescription":"This has officially become the last product I ever buy from Amazon. I am sick of the platforms terrible ability to control quality. The screws back out within four or five days of buying it. It has happened so often that I've had to disassemble the entire chair and put loctite on all the screws and reassemble it. I don't expect it to last much longer. Though it may look good it is not comfortable and the noise it makes just sitting it or trying to recline it is unacceptable. The screws backing out started with the arms of the chair and then it became the back of the chair so that it would pop and snap every time you lean back. The compression cylinder has already worked itself loose so the chair wobbles in every direction. The lumbar vibration vibration is super hard and there's no switch so you are going to have to manually plug it in and unplug it each time you want to use it. The chair back has very little to no padding at all and when you recline the chair there is a large gap between the seat and the back. And since the seat is solid in the back you are going to be very uncomfortable unless you slouch. The so-called leg rest will only work if you are under 4 ft tall. Because when you extend it out it lays perfectly horizontal to the ground whereas your legs will be a slight angle which means the back of your calves are going to be resting on the front edge only. There is no way to change this so the leg rest is useless and is also parallel to the seat which means your legs are going to have to stick straight out. Amazon used to be a great place to get things but now they just push absolute junk and their customer service has become inept at their jobs. And when there's a problem with a product Amazon refers you to the seller and usually the seller is in China and they do not care what your problem is. The company told me that they would send me whatever pieces I need and they weren't listening when I explained this whole situation to them that it is not a individual part problem it is the entire chair and the fact that regardless of how tight you tighten the screws they will back out. If you don't put loctite on them it's only a matter of time before they back out enough to either strip the threads or snap the head clean off. You're better off buying a more expensive chair because for $128 I would rather have purchased a bean bag chair. If you're a gamer, that means you probably spend a lot of time gaming and you do not want to sit in this chair for more than the length of a movie or you will be crawling down onto the floor to try to straighten out your back. This chair, just like so many other products that I'm tired of receiving, is absolute junk and you really have no recourse unless you want to box this thing back up and ship it back so they can send you another of the exact same problematic product. Goodbye Amazon, I'll shop brick and mortar even if it cost me 50% more per product simply because I won't have to deal with the headache that comes with being on this platform.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1725148800000}
{"reviewTitle":"Think twice before buying it","reviewDescription":"Purchased this to work from home, it was delivered on time but was missing the t-frame (what holds the backrest in place). First day of work was miserable, should have returned it at that point but received the missing part from customer support after a few days.The screws on the chair use an L-wrench. These state that they should only need retightening every 6 months, I was having to realistically do it every 3 weeks after around 2 months or so, with that timeframe reducing to the point where I was retightening the screws every few days.This issue with these screws are prevalent in both the backrest and the armrests. The chair lasted a little over 9 months before the backrest finally gave out today.Return for the chair is only 1 month, not 1 year. 1 year warranty is only for the 'accessories' not to replace the chair or return it.Backrest is missing much needed padding and compensates with the upper and bottom 'cushions'. You can actually feel one of the metal bars going across the backrest (right above the bottom cushion). Armrests are faux leather which will experience peeling after only a few months of fairly light use, not a big issue for me, but I know some people are particular about such things, I usually don't use armrests all that much aside from getting up.Chair is not a very good 'rolling' chair, feels more stationary than both my previous chairs. Felt like when my previous chairs had the wheels locked in place so the chair wouldn't roll.Think twice before you purchase this chair because of a sale or low-price tag. While another chair may be more expensive, it is likely to last you longer and be a better value overall. Moreover, your back will surely thank you for it rather than cutting corners by buying this chair.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"1 Year Chair - Buyer Beware! Read Before Buying!","reviewDescription":"Purchased this to work from home, it was delivered on time but was missing the t-frame (what holds the backrest in place). First day of work was miserable, should have returned it at that point but received the missing part from customer support after a few days.The screws on the chair use an L-wrench. These state that they should only need retightening every 6 months, I was having to realistically do it every 3 weeks after around 2 months or so, with that timeframe reducing to the point where I was retightening the screws every few days.This issue with these screws are prevalent in both the backrest and the armrests. The chair lasted a little over 9 months before the backrest finally gave out today.Return for the chair is only 1 month, not 1 year. 1 year warranty is only for the 'accessories' not to replace the chair or return it.Backrest is missing much needed padding and compensates with the upper and bottom 'cushions'. You can actually feel one of the metal bars going across the backrest (right above the bottom cushion). Armrests are faux leather which will experience peeling after only a few months of fairly light use, not a big issue for me, but I know some people are particular about such things, I usually don't use armrests all that much aside from getting up.Chair is not a very good 'rolling' chair, feels more stationary than both my previous chairs. Felt like when my previous chairs had the wheels locked in place so the chair wouldn't roll.Think twice before you purchase this chair because of a sale or low-price tag. While another chair may be more expensive, it is likely to last you longer and be a better value overall. Moreover, your back will surely thank you for it rather than cutting corners by buying this chair.","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Bad quality - horrible customer service","reviewDescription":"I purchased this chair and within the first 2 months it started falling apart.The back rest and seat cushion both had the core structure pieces poking through the cushion causing lots of back pain and very uncomfortable. The arm rests became unstable as well. Within the first 6 months of having the item the arm rest had fallen off, and the cushions were coming apart. I reached out to the seller to request a refund and was advised no refund could be offered however they could honor the warranty purchased with the chair by sending me replacement pieces. They sent the bottom cushion to me without any tools\/devices to put the cushion together, and while waiting for this piece to arrive the right armrest completely fell off. I reached out to seller again to replace the back rest and right arm rest and request the required tool to put the pieces together. The seller advised they would send the tracking info ASAP. 10 DAYS goes by and I hear nothing. I finally reached out to check the status of this item and was advised that they are unable to fulfill my order due to lack of inventory, and they would not be able to refund me for the chair either. In addition to that, they advise they don’t know when the inventory issue will be resolved or when they will be able to provide me with the replacement parts.I requested a refund again due to them not being able to fulfill the warranty I paid for, or replace my chair and they refuse.Not only is the chair bad quality and falls apart, but they also have terrible customer service, lack of follow up, and will refuse to refund you even though they can’t provide you with the tools and replacement parts that you paid for!If you are considering this item, DONT! Take your business to a different seller with better quality items!","isVerified":true,"ratingScore":1,"reviewReaction":"57 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"Horribly cheap and defective","reviewDescription":"I’ve fallen out of this chair multiple times and have hurt myself because the hydraulic cylinder never seated properly no matter how many times I wrenched it back out and tried to place it back in straight up and down. The pieces for the base never fit together properly, only three out of the five caster wheels ever touched the ground, causing it to lean and make my back ache from my hips sitting so unevenly for eight hours a day. I work from home, if you do too, steer clear of this chair. This is the second chair I’ve lost hundreds of dollars on, because Amazon will not give me a refund unless I ship the chair back to the seller WHICH IS CRAZY. If I kept every box that I was mailed just in the off chance I would have to mail something back, I would have no room left in my home. Amazon claimed that I could simply disassemble the chair and put it in a ups box large enough to fit all the pieces, but I don’t trust anyone to give me my money back if I did that. Most sellers want all of the original packing that came with the item, which is just a clever way to not offer anyone refunds. Horrible. I’ve thrown away so much of my hard earned money because of things like this.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"Lasted one month longer than the warranty","reviewDescription":"At first I was extremely happy with this chair. The back massager was great, but then the new chair feeling began to wear off. I spend almost all day in front of a computer and have a service connected disability, so I purchase a chair with more weight allowance than I place into it. The seat cushion became hard after a few months and I have almost damaged my USB ports several times trying to get out of the chair  with the message cushion still plugged into the USB port needed to power it. 5 feet seems like a decent length until you realize that you need 6-8 to back away from a desk to stand up. So I am reduced to using only on days that it is too uncomfortable to stand up, lie down, or sit for very long. The leg rest is kind of nice and would probably work great for a pre-teen or short adult (under 5' 5\") I am 5'11\" so the rest sits just below  the knees, about mid to upper calf when I sit in the chair with my back resting on the massager. This results in the blood circulation being cut off to the feet after 30 minutes or so.This chair was rated at 250 lbs. The VA doc told me last month that I weigh less than 220. So it is hard for me to understand why the weld or whatever is used to hold the front of the arm brace to the central seat portion has broken. The left arm now lays off to the side and is wide enough that I cannot rest my arm on it comfortably when sitting in the center of the seat. I do not trust a chair with wheels on the bottom of it to try and stand up so I know that is not the issue, same with sitting down.I have contacted the seller about the issue and will try to update this review with their response.","isVerified":true,"ratingScore":1,"reviewReaction":"33 people found this helpful","country":"United States","date":1688428800000}
{"reviewTitle":"Deceptive","reviewDescription":"Chair is meant to support an adult up to 300lbs. I am 6ft tall and 180Lbs, and this chair is barely wide enough for my 33inch waist to both sit\/lean-back in. It has to be at the lowest setting to allow my feet to touch the ground giving me a correct 90degree knee bend for posture. This is not ergonomic in any sense, as I've used a month now and am developing right hip pain. The front of the chair and side of the chair look like the photos posted on product page, but the backing is not shown. There is a good reason for that as the chair back attaches to the chair seat via a large metal bracket that is ugly and machine shopped as poorly as the rest of the components showing large welding spots. This is very visually upsetting as well as visually shows poor workmanship. The backing needs to be adjusted every few days as it is only hand tightened without a locking feature, and keeps sliding downward over time. This chair already creaks as much as the chair it was meant to replace which was a no-name brand and over 12 years old. I followed the lame GT Racing \"support suggestions\" (just re-tighten the screw-end of support), and re-tightened the screws, and it helps with the problem. However, this is less then 2 months in and I've had to readjust the backing, and screws 5 times. The armrests are incredibly flimsy (visually would be nice if they had covers for the screw holes or provided black screws so you didn't have to see them after assembly (every other manufacturer has figured this out decades ago). The look isn't of concern to me, but the fact that they are not durable or safe is. The armrests are very cheap with the smallest of washers actually holding the arms to the chair tight. These armrests are not safe to use to help you push up or sit down into the chair. Like previously mentioned, I am only 180Lbs, and I cannot put more then a few pounds of pressure on the arm rest without them bending outward. This will clearly leave them broken within the year if not 6 months. So be very careful as I was not and check warranty, 1 year or less = junk that will either barely make the mark or fail spectacularly beforehand.","isVerified":true,"ratingScore":1,"reviewReaction":"33 people found this helpful","country":"United States","date":1642032000000}
{"reviewTitle":"To put it together you function as a factory worker with damaged parts","reviewDescription":"I got this on Prime Day. I have multiple vertebral fractures from stage IV breast cancer and was looking for a nice reclining chair to work remotely in. There's about 300 pieces- none of it is put together already. My son put it together- he even hammered a broken piece back into the correct shape. It was quite the project! Honestly, it seems like a hoax as it's not just putting things together so it ships in a smaller box- you must assemble the entire thing. It costs $25 -30 to return so really not worth returning. When you sit on it, there's no way to control the angle of the recline- it's either straight up or fully back. I much prefer my zero gravity lawn chair to work in and my son inherited this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Dont Buy Gaming Chairs","reviewDescription":"This just arrived and I spent a full half hour on step 1 trying to place the wheels in only to find that they dont fasten in place, at all. When turning the thing around to go through more steps, the wheels fall out and it's literally impossible to put them back in unless the thing is upside down. Rinse and repeat. Not dealing with this when I have to work a 12 hour shift.Edit: I'm highly incompetent and learned that yes, the wheels do click into place! It only requires you to use the force of two colliding black holes to do it. Took me about an hour or more to put the entire chair together. Its recommended that you have two people put it together, but c'mon. You're getting this chair if you're a gamer. 0x0 is still zero and that's exactly how many friends we have.Overall I really enjoy the chair. It's pretty comfortable and seriously worth the 159 I paid. It did come in with a tear at the top of the seat but the tears in my eyes from my loneliness hides it pretty well. The massage cushion is also just alright but I enjoy using it while I game, it helps soothe my lower back just enough. If you're just like me and this is your first gaming chair but you're also fat enough to eat a full pizza and still get hangry, be warned that the chair doesnt allow for nearly as much sitting leg room as a normal office chair would. With that being said, it's easy to get used to.Edit: Purely for the sake of keeping the stupid crap I put fir this review, I wont be editing what's been said, but man...don't get Gaming Chairs. A week after I wrote this review the back of chair began to bend to the side. As it was my only chair, I had to keep using it. The side it was leaning towards caused that side of my back to become virtually incapacitated as when I moved it around, it caused me extreme pain.It's possible I was simply incompetent when putting the chair together, but after doing extensive research, you'll find it's not worth buying a gaming chair. They're cheaply made with low ergonomic design, low comfort, overpriced with a \"GAMER\" tag added onto them. They will cause back issues, they will hurt your poor tooshie, and most of all, they dont even last long. If you're thinking of buying a chair, just buy a nice office chair. You can slap a nice Gaming logo on it and boom, you've got a gamer chair that actually beneficial to you. Gaming Chairs look cool but have absolutely no practical use when you realize just how important it is to take care of your body.If you want to pay 150+ for back problems, be my guest!","isVerified":true,"ratingScore":1,"reviewReaction":"38 people found this helpful","country":"United States","date":1593216000000}
{"reviewTitle":"Get what you pay for TERRIBLE","reviewDescription":"The chair is very cheap. Probably a quarter of an inch of pad under the bum area and then your sitting on hard plastic.It will still not roll as they should. It’s like you’re in cement even though I have hardwood floors. I should be sliding across as if I’m on ice. I contact customer service in regards to the problem with the casters and I’m spoken to as if I’m a child and how I should understand that different floor surfaces could affect the operation of the casters. I did not appreciate the way customer service just made an assumption as if I was an absolute idiot, and didn’t know how a caster should roll across the floor.  Again I have hardwood floors. I should slide across it very easily. The issue I reported with the casters as if they were locked in place. These casters do not have a locking switch on them so that should not be the case. They do not spin and swivel as they should nor do they roll very well.As far as the armrest go, they have already loosened up quite a bit. I feel that this is a very cheap game chair. Those chairs probably worth maybe $50. And if that is probably giving it too much credit.I bought this chair based on the mass of amount of reviews. I thought that wow this chair has a lot of positive reviews a lot of review counts. It must be a good chain . It is not! I hope that you weigh your decision and think long and hard before you purchase any chair. I do not recommend this chair whatsoever.Please know not to base your decision on the amount of reviews, because there could be hidden reviews in there that aren’t even pertain to the item.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1670803200000}
{"reviewTitle":"Amazing!","reviewDescription":"This chair is exactly how it is showed in the picture! The chair has a back massager and a pull out foot rest! Money well spent Great investment!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Almost reclines, great chair, great price","reviewDescription":"Bought for my husband who was planning on taking it to his work. When we got it set up, he realized it would almost recline. So…he couldn’t take to work bc he would get too sleepy! He works from home sometimes so he is going to get good use of it at home instead. (Don’t worry, It can’t recline where we have our desk set up at! Lol!)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Extremely comfortable and versatile!","reviewDescription":"Love the flex this chair has! I purchased for my office and I may purchase another one for my home office! The massager is an added bonus 😍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Easy to put together! Hope they restock pink soon!","reviewDescription":"Got this chair for my boyfriend’s birthday! Put it together by myself in about an hour. I hope they restock the pink color soon! I’m jealous and want my own. I love it so much!😭","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Definitely worth the money","reviewDescription":"This is the chair for you or your child!  Looks cool.  Fits perfectly.  You can raise\/lower the seat.  It fits right up to a gaming table...not overly large and cumbersome.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Great chair for gaming and chilling out","reviewDescription":"Loved how easy it was to assemble. Looks great and perfect for the gamer!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Buy at your own Risk...","reviewDescription":"This seems like a really great chair. If you have pets get the leather one because Animal hair sticks to this thing like crazy...The arm's on this chair will come loose no matter how  many times you Tighten them down. The current chair I purchased had to have lock Tight and lock washers attached to it to fix this issue. This chair is exactly what I ordered and  I am extremely Happy with my Purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Very comfy","reviewDescription":"I hate the pull out leg rest that’s just more difficult than a lever but that’s all gaming chairs. It works great though! Definitely worth buying. Set up was difficult if u need the letters to the parts because not all the parts where labeled but I’m good with the pictures. They even give you extra screws if u lose them for setting up! It’s comfy but the massage part is on the lower pillow and u have to plug it in a usb port. I plug it into my computer. It is comfortable. Seems sturdy!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Great chair","reviewDescription":"Son loves it. It’s a great chair. Very sturdy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"very comfortable","reviewDescription":"Chair looks great nice to sit on and was easy to put together","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very Uncomfortable","reviewDescription":"Saw this had great reviews, so I bought one to replace a similar but more expensive chair ($250) from a local Swedish furniture warehouse that was making too much noise after a few years of use.There is no comparison. This chair looks great, but is very badly designed from an ergonomic standpoint. The seat cushion is far too hard, and after hours of being seated (I'm a lightweight person on the thin side) my backside was in pain and turned red. After about a week of use, I also noticed my spine being dug into by a hidden horizontal bar in the middle section of the chair back. Absolutely horrible, human-unfriendly  implementation.This chair is cheap, good looking and a lot of people say they like it. But when you get it and sit in it for 8 hours a day, it's pure torture to your body because of hard bars and planks that are hidden behind a thin layer of soft looking faux leather.Spend the extra money and go to thee Swedish store, where you can try before you buy. This thing is going where it deserves, in the dumpster!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655337600000}
{"reviewTitle":"Bad chair.","reviewDescription":"Cheap materials overall. Armrest, seat and the back support is bad. I should’ve bought something have the price and better made to be honest. I regret badly this purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Poor design, easily breaks.","reviewDescription":"TL;DR - Overall, this chair was constructed to handle the weight but fell short in using plastic materials that did not hold up and design flaws that made it uncomfortable for those with larger frames.I bought this specifically because I have a larger frame and, as such, needed a chair to stand up to the weight requirement. The steel construction of the frame itself and the quality of the pneumatic that adjusts the height is above par.However... The plastic wheels, after only a few months of use, have broken at the axle and fallen apart. Also, the footrest relies on plastics that have begun to stretch out of place or broken and no longer support my legs comfortably. To top it off, the seat itself has \"wings\" going up the side of it that has irritated and bruised my hips. Also, the covering on the armrests and seat has begun to decay, horribly cracking, splitting, or being worn down far more quickly than it should be given the cost and age.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1663286400000}
{"reviewTitle":"Falls apart after a short while","reviewDescription":"I ordered this for support while using my laptop at the desk or to kick back and relax and put my feet up and read, so I use the chair a lot. After 2 months the screws started coming loose and everything needed to be retightened. Then the little plastic wheel parts started popping off randomly. Now I am popping a wheel half back on almost every day, almost every time I move the chair one falls off. Frustrating and low quality wheels. The rest of the chair is nice, the adjustable head pad is good and the lumbar support is good. I did buy a gel cushion for the seat because I use it so much. I am a partly disabled veteran with arthritic back issues so I sit a lot. The massage feature is OK on the lumbar cushion, you have to be very careful with the cord while using it so you don't get tangled. The foot rest is a bit short but functional.I wanted to give it a better rating but just cannot with the wheels falling off so often. Really could use better wheels and then I'd say it's a 4.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641427200000}
{"reviewTitle":"Poorly made","reviewDescription":"After reading all the great reviews on this chair I’m really mad that I bought it. It was great for a couple of days then the arm started getting loose and now the other arm is peeling! He literally got it on Christmas morning and here it is Jan 2 and pretty much falling apart. For $130 this is pure crap!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Decent but uncomfortable","reviewDescription":"Was good price when I got it. But the chair does feel very stiff and it makes alot of noise!! It cracks and it's actually not a comfortable. The foot rest also is very stiff to pull out and hard to push back in. I rate this a 2.5 because of its functionality, comfort and noise...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"The seat itself pretty uncomfortable.","reviewDescription":"I never did get to try out the lumbar massage, one of the main reasons for buying the chair. The seat bottom was so hard and uncomfortable, it didn't even hit me where my knees bend, it hit about 4 or 5 inches from my knees. I'm short too so that is never an issue for me. I've had spine surgery and from the lack of cushioning that caused my leg to go numb. I am returning the chair for that reason.Sitting on it felt like sitting on a surface of brick. The chair is nice otherwise, the head rest is comfortable as is the back of the chair. The chair assembled easily.The seller shipped the chair in good time and was received as promised.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"Cheap quality, you get what you pay for","reviewDescription":"This is my first Gaming Chair. Everything about this chair is mediocre. They even give you a warning to tighten screws every few weeks or months. The way this product is designed made it impossible to completely tighten the bolts on the armrest joints; it took less than 24 hrs for one of the armrests to come off. I tested the bolts for armrest joints without the armrest and they are capable of being fully tightened. However the way this product is designed, makes it impossible to tighter the bolts on the armrests joints with the armrests attached. Having a stable armrest is a key element of a good office chair;  this chair lacks that.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Hard as a rock. Plan for short term usage.","reviewDescription":"Overall the chair is about what you pay for in quality. That is to say, it’s not crazy high quality, but it’s not falling apart at the seams, either. I couldn’t figure out why it was so uncomfortable at first, but after a few weeks it became overwhelmingly clear. The seat of this chair is hard as a rock. At first it’s manageable but after a few hours it’s agonizing. I have to put a pillow or blanket down.The “cushion” on it must be less than 1” thick, atop thick metal. Someone in the Q&A says “the seat needs to be thick enough so that when you lean forward, it doesn’t feel like sitting on hard stone” and that’s exactly what this chair is like - hard stone.If you plan to game for more than 4 hours - this is NOT the chair for you.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Good chair but terrible add on’s","reviewDescription":"The chair seems solid\/sturdy. However, the massaging feature stopped working after 15 minutes of us. Will not turn back on. The recline piece seems so unstable that we don’t use it. Just shop for a chair itself. No extra massage or recline feature. It will save you money!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Avoid this product!","reviewDescription":"It looked great but when my husband was putting it together he warned me that he thought it was junk. The back seemed very loose to him and the metal was cheap. After 3 weeks the back broke! My son is less than 120 lbs. and was just sitting in it when suddenly the back and one arm came loose on him. It took hours of gentle hammering to get the back in place, but we could tell it was destined to happen again so we had to return it. Even with a full refund We wasted $29.99 on shipping and another $11 on a new box to ship it back. Do NOT recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Poor quality material","reviewDescription":"I got this as a gift for my 120-130lb boyfriend less than a year ago, the wear and tear appeared months ago but I’m finally getting around to making the review. It would be understandable if my it had developed over years or if my boyfriend wasn’t underweight but that isn’t the case. He’s the only person who has sat in it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"This item was poorly made","reviewDescription":"Just got it two weeks ago the arms are loose already like they’re pulling away from the chair and the vibrator completely shut off. Don’t work now. I had this for two weeks. I give this not even a one star much money as you pay for that chair, it should not do any of that in that little time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"It is very uncomfortable","reviewDescription":"It is very uncomfortable. There is no spring for the back recliner to go up or down properly.But the problem I have is that when I adjust and set on it. it will go down very slowly. I was going to send it back but the company contacted me and asked to keep it and they would send a new tube. I agreed to it but they never sent me the replacement gas tube. The return window ran out and I have useless junk.They asked me if I needed to take a video of it. I replayed back to them that it was not a sudden drop. it takes a long while before it is all the way down. I was not ready to make a 30 minutes video.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"It's tiny","reviewDescription":"The chair looks and feels like its going to fall apart any second. The seat part is hard and the head pillow only rest at my shoulders never my head, I'm 5'10 the chairs only has up and down, no tilt. The Lumbar pillow doesn't have a switch to turn it on or off so if you want to use it stop what your doing to find a USB 2or3 port.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Good chair on sale","reviewDescription":"Okay chair that is somewhat comfortable, id only buy it on discount. The back of the chair is not very thick. You pretty much have your back on nothing padded and to make things worse there’s some kind of metal bar that is very uncomfortable to lean on. I will likely have to find a pillow or attachment to fix this. Haven’t really used it in “work” mode but I’m assuming you’ll still feel that bar. I honestly feel bad for anyone that bought this at full price. It is not a near 200$ chair what so ever. (Edit):The longer I have the chair the more I wanna throw it out. They seriously put tissue paper as the back padding. I will be trying to get my money back. This chair is a joke. Iva had the chair maybe a week already having back pain. If they don’t refund me Amazon better cause this is a joke. There’s no way any of those reviews are real and if they are they got the item for free. Please don’t buy this chair. Unless you hate yourself and your back","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"The rest of arms does not reach","reviewDescription":"I have not yet received this part the chair came defective and I saw it when I already had all armed so I did not return it. I need you to send me that part I have requested many times and no one respond.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725235200000}
{"reviewTitle":"Get something better","reviewDescription":"I ordered this because it’s going so viral and it was one of the most inexpensive options but it’s been nothing but regret since then it’s relatively comfortable I guess but the seat is small and the “extra support” cushions are a joke. And the pictures I included is when the chair originally came with two right arms. I contacted the seller and they responded fast and shipped out a new one, the new one is a left arm but for a completely different chair. Thankfully I was still able to Jerry rig it enough to work but ultimately this is a waste of money I’m tired of capitalism making us buy these things over and over instead of building them right.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Haven’t even had it a year","reviewDescription":"Got this chair for my son 16 year old son and  haven’t even had it a year yet and it is broken. He’s not rough with it at all. In fact he has taken good care of it but went to sit in it the other day and the piece that connects the base to the top broke. Sad to see something that cost so much fail!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Poor quality and broke after Les than a month","reviewDescription":"Very Poor quality the main jack weld broke all around while a 13 year old kid was using it, the weight rating is misleadingThis could’ve hurt my son while sitting on it.I don’t recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Perfect fit","reviewDescription":"Is very comfortable !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Ended a wild goose chase","reviewDescription":"I've gone through a few chairs over the years. I've tried office chairs and 'gaming' chairs alike, but they always left me achy and would break down over the course of a few years. I take exquisite care of my stuff (frfr I'm a germaphobe) but I'd have chairs start to tear or fray and leave my back hurting SO bad that it'd make my stomach hurt. I can't say I have the best posture on the face of the planet since I am hyper-mobile but it was ridiculous. I decided to give this chair a try because of the reviews and it seemed reasonably priced compared to the Titan Evo chairs I was looking into ($800).Assembly: Took me a little longer than expected, the instructions aren't the best but are relatively straightforward.Comfort: Fabulous. I can sit criss cross. I can sit like a shrimp. I can kick back and watch a movie. I can hunch over to do my homework. OR I can even sit properly (sometimes). I've never had a sore back no matter how long I've sat in the chair.Price and quality: I'd say this is mid tier quality. A step above \"you get what you pay for\" and a step below \"overpriced gucci chair\" that most companies market towards gamers to price gauge the title of 'gaming chair'.Is it worth it? Yes. I think you are mostly paying for functionality here and not style or aesthetic. Just a generic ol' gamer chair.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"10\/10","reviewDescription":"Incredible chair, very comfortable and in addition to being reclining and having a footrest, it also offers massage👌","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Great chair for the price.","reviewDescription":"Very comfortable and really easy to put together. Takes maybe 10-15 mins to put together and instructions are very straightforward. Overall I'm very pleased with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great chair","reviewDescription":"This was a birthday gift for my grandson Noah,  it massages  his back while he plays his games. He lives it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Easy assembly and great for someone with scoliosis who works at a desk!","reviewDescription":"I spend a lot of time at a desk. I work from home, go to grad school and I like to game and write in my spare time. I have back issues due to a congenital condition, so a comfortable and supportive chair is very important. I sprang for this one because I really, really needed a better chair than the one I had. I'm not the best at putting things together without a visual like a video,  but the instructions were clear and very easy to follow. I was able to put it together myself, shaking hands, motor control issues and all!The chair is so comfortable and feels sturdy when I sit in it. I have really long legs and the seat itself doesn't feel too short to me at all. The foot rest is a fantastic feature; I will say that it's a bit shorter than I will like, but I chalk that up to my legs being so long. Even with that, putting my feet up at work and being able to recline is a godsend on long days. The armrests feel sturdy and come up to a comfortable height. I tried the massaging lumbar support; it was a bit loud but it's by no means a deal breaker.If you're on a budget and are looking for a gaming or office chair, I would recommend this one for sure! If my husband likes it, I may even get him one.","isVerified":true,"ratingScore":5,"reviewReaction":"23 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Fast delivery","reviewDescription":"Great chair,perfect gift for my daughters Birthday. Came 2 days earlier then date given.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Nice","reviewDescription":"Gift for my son dad for his birthday. He loves it!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"LOVE this chair","reviewDescription":"I have only two issues regarding this chair, one is price related and one is actually chair related (but minor):1. Shipping Cost: $30 for shipping is insane. It’s a big, heavy item, I get it. But I almost didn’t buy this chair because of the shipping costs, but it had good reviews, looked the way I wanted it to in the pics, and I had an extra coupon I applied to it.2. The footrest is great, BUT it is very hard to pull out. I like that because it means it’s not easy to accidentally push it with my feet, but it also means when I’m very tired and comfy and wish to adjust the footrest it is a PROCESS to get it to move.Overall though, this chair is great. I personally recommend having a second person to help you put it together (at least if you’re inexperienced like me) specifically to put the back on. It’s super comfy, I love the little pillow behind my head, and I love how I can lay down in it or sit up. It’s a little too tall for my desk even at its lowest, but that’s because I’m in a college dorm 😅 I definitely recommend this chair!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1712793600000}
{"reviewTitle":"Great chair.","reviewDescription":"Very comfortable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Ok","reviewDescription":"Ok iz a chair note good if you a fatty like me T 300 not comfortable after 2hrs like the vibration cam buy N extra hour with that function 😅","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"It works","reviewDescription":"My 14 year old son loves it… but it is not for bigger people, he fits just fine but for an adult it wouldn’t last long","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Love the color","reviewDescription":"Color is amazing, love that the back vibrates but it gets so uncomfortable after sitting in it for about an hour… maybe it’s just me..","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Good for short-term but the quality shows over time.","reviewDescription":"If you need a decent chair for a couple months until you can save for a better one, then this would be a great pick. It will get the job done but the quality is sub-par at best, when it arrived the leather had cuts in some places and when screwed on i noticed the armrests were a bit loose despite being tightened all the way. The \"massage pillow\" is a literal brick that shakes(straight into the trash) and a pillow was needed on the underside due to little to no cushioning. But I looked past all this as it was all either visual issues or resolved easily. What was not easily resolved or ignored was when the weld on the base sheered away like nothing in the matter of a night, which is not what I'd expect from a chair that is moderately used by someone 170lbs, I had owned the chair for just over a year and one night it just gradually leaned further and further back until it snapped. If you need a chair in a pinch this will do but it is overall your typical mass produced Chinese garbage with no quality control, invest a little bit more in a better one or break this one within a year so you can get your money back from the warranty.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1649203200000}
{"reviewTitle":"Affordable, but not comfortable.","reviewDescription":"This is my first gaming chair. It looks great, was affordable and easy to put together. I love that it has a foot rest. However, I have had it almost 6 months now and the padding is gone. I feel all the structure bars in the back, seat and footrest. It is uncomfortable. I had to add a pillow to sit on.It also squeaks and groans. And a couple bolts come loose regularly, no matter how tight I turn them.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"Good so far","reviewDescription":"Its a good chair so far no major issue but it could be improved in two area's1) Good fabric could be used, current fabric is flimsy.2) It should be more thicker, overall chair is very thin from every angle resulting in less cushion which will be pressed in long term.(You can feel bones of chair ;) )","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"bought 2, here is my thoughts","reviewDescription":"pretty weak chair honestly, after buying 2 of them. both now being sat on and across from me. I can state the speed of break down is insanely bad..what is worse is the second one came with a super stripped out 1 of 4 mounts for the back of the chair itself.Quality control does not appear to be there on these models.I am not sending that bad chair back, instead i just fixed it myself.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"do not recommend to buy it at all","reviewDescription":"It is not comfortable at all!!! I bought it for my back pain because I need to sit in front of my computer for long hours. But this chair is not good and comfortable at all. although the massage feature is good.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Not comfortable","reviewDescription":"There is a bar in the middle of the back support that hits you like a 1970s pull out bed. Pillow helps but then you have to deal with a short seat. I ended up buying something else; just wish it worked out better.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Just okay","reviewDescription":"The chair looks nice but the bolts come undone too easy. Have to keep tightening it down. It’s just annoying! It warns you it will happen but I didn’t think it would that much.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Cheap medal","reviewDescription":"The welding already broke and chair goes too low :( only had for a month","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"squeaky","reviewDescription":"cant even move without SQUEAK SQUEAK SQUEAK. comfortable atleast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Squeaky","reviewDescription":"Put this chair together - is semi comfortable- squeaks  A Lot \/ arm rests are too low - though it would be comfortable for me since I’m a medical coder and working from home - so far seat is a little to firm - will give it a few more days - not sure","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"It's okay","reviewDescription":"My kid was insistent on getting this game chair due to the brand and color.  The quality is okay, not as good as others I have had in the past.  Installation and directions were pretty straight forward.  Looks good, not that comfortable.  For the price I expected more but my kid is happy so that is what matters.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Somewhat disappointing","reviewDescription":"Pros: Straight forward to assemble, and feels solid.Arm and seat cushions are comfortable.Cons: The back has absolutely no cushion to speak of - just metal bars covered by some leather,  making it fairly uncomfortable. Though I suppose this helps you get into the correct posture, hunched over the keyboard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Just decent","reviewDescription":"So after roughly using it for over a month, here are my thought.Pro- Easy to assemble- Cheap- Good lookingCon- Not very comfortable, might be due to me being heavy at 220+ lb.- The armrests constantly loosen, I have to tighten the screws every other day.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not as Comfortable.","reviewDescription":"While it may seem its comfortable to sit in, It is quite stiff and the cushioning is quite stiff as well, while the foot rest is nice again it is still a bit uncomfortable. I would say pass on this chair if you get uncomfortable easily and do not like like Firm steating.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Gaming chair","reviewDescription":"Decent chair decent for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Good Chair for the price. Difficult to put together.","reviewDescription":"For the price it is an overall decent chair and the ability to recline is very nice.Putting the chair together was overall very difficult and I had to retighten the arms multiple times as they came loose.I also appear to be missing the screws for the foot rest and though I was told I would be sent new screws that has not yet happened.Overall it’s not bad but it is flawed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Game chair","reviewDescription":"Bought this chair for my nephew nice comfortable chair but there was a few issues with it after the first week the vibration pad stopped working and one of the arm rest won't stay tighten felling a little disappointed 😑","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"This chair is awful","reviewDescription":"It is popping loudly, clicks and is noisy all the time, wouldn't waste my time or money on this chair.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Not worth it getting at all","reviewDescription":"The chair does not have the great balance. Not only that but the back part of the chair is so bad in terms of sitting  angles. You will have to bend to sit straight.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Its broke after a few months","reviewDescription":"Dont buy ive onky had the chair for a few months and the reclining feature is broken never actually used that feature but now the chair just leans backend forward with no way to lock it in place the material used for that chair is also cheap plastic leather the massager is a cheap rubber that heats up rapidly when using and the lumbar pillow straps are way to short and rip the pillow -1\/10 don't buy","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Decent but has issues.","reviewDescription":"Update: This chair has found its way to the garbage. AVOIDAfter a year use review. (See review edit 3 months after this review at the bottom, reduced rating to 2 stars. )Decent chair, but I can see some issues if you’re a heavier person. There are 2 wheels per castor, and 2 wheels now come off when moving the chair around. Will have to buy new wheel castor to replace them now.Edit December 2023: The bottom bracket for the left armrest has ripped out of the seat. Several wheels pop off now if rolled around. I am not a big person so this chair hasn’t been abused. If looking for a chair I would recommend spending the extra money and getting something of higher build quality that will last and avoid these Amazon fake gaming chairs.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Tbh I wouldn’t buy again","reviewDescription":"After a few weeks the chair began clicking everytime I sit down ( I’m only 145lbs) I tried to tighten bolts, un tighten bolts nothing worked then the “leather” (which is more plasticy than fake leather) started cracking pretty bad then after like 2 more months it started peeling and scratching my arms. Also the seat pretty much has no cushion it feels like I’m sitting on the floor with a thin blanket under me","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"extremely unfomfortable","reviewDescription":"I am 5'10\" \/ 140lbs. the back relies on the pillow that came with it to make it comfortable and it does a terrible job. there is a metal bar sticking out in the worst spot and no cushion at all. the seat is way too firm to be comfortable for any more than maybe 30 mins. the arm rests keep loosening up for no reason so I have to dig the allan wrench out and tighten it back up every week or so. the foot rest is secured by cheap plastic so I don't even use it out of fear it's gonna break. I had to both buy a better seat\/back cushion AND put a different, better pillow on the back just to make this chair even mildly comfortable to sit in. just spend the extra money to get a chair that's more comfortable because this one is awful.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Not durable","reviewDescription":"Did not last very long. Purchased in Dec. ‘22 and it didn’t even last a year before falling apart, and has become rock hard to sit on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"not well made","reviewDescription":"arms started pulling out on but it weren`t loose  glad I got the extended warranty and base screws loosened up and started making a cracking sound","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Cheaply made. No cushion , It just looks nice online.","reviewDescription":"Cheaply made. not cushiony at all. . I wish I had time to return it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Just buy a office chair avoid this product","reviewDescription":"Owned for over 3 months and the screws would loosen from daily use causing them to fall off within the first few weeks, So I fixed it using loctite. Then the screws broke inside making it completely unusable. Not that comfortable compared to a office chair.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715904000000}
{"reviewTitle":"Chair FAULTY Since Day 1!!!!","reviewDescription":"I have been going back an forth with this company since the day we put it together. The directions were easy and my son and I had no problem following the instructions and putting it together. (massage chair wires were tore apart out of the box) After he used the chair for two hours the chair was tilting. I reached out to the company immediately for a new chair. They would not send a new chair but offered a misley $15 credit. I am constantly being asked to take pictures. They ok'd a new massage pillow, even though I just asked for new wires, but couldn't see the tilt for the first few go arounds of pictures. Finally did... now want pics of mechanisms. IT IS BS!!! This company should have sent a new chair day one. I'm tired of having to prove my claims. I still have no wires, no credit... they want to wait to figure out what parts to send me...but I am not taking this chair apart to fix it. The whole process is ridiculous. DO NOT BUY GAMING CHAIR FROM THIS COMPANY, a chair should last longer than a day!!! (I am warning you) If I could give zero I would, they don't even deserve one star.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1620086400000}
{"reviewTitle":"Issues with seller- Item was defect","reviewDescription":"They sent me a defective product. When I asked they replaced the part with a used one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Cheaply made","reviewDescription":"Assembly was easy but the foot rest does not line up with the plastic mounts on the bottom of the chair and there is no way to adjust these to make it fit.  The foot rest is completely useless because of this.  Also, the padding on the back is non-existent.  The frame of the back feels like it just has a covering of fabric.  Returned due to the foot rest.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Particle board in frame of the chair disenegrated in less than 6 months","reviewDescription":"Purchased this for my 12 year old son that likes gaming and wieghs only 140 pounds.....The main back piece is made of particle board that literaly disengrated and now the chair is not usuable. It aslo left a mess of \"wood\" in the room as well.You get what you pay for.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Easy to assemble, but uncomfortable","reviewDescription":"Took me a very short amount of time to assemble, and it was an easy to finish project. But the design makes it inherently uncomfortable. A metal rod run horizontally right where just under my shoulder blades naturally rest and their is only a thin layer of material between that and the rest of the padding for the chair. No matter what position i contort myself, i can always feel the bar and it gets unpleasant overtime.Only thing i can positively say is that it was on the cheaper side.EDIT:THIS DAMN CHAIR IS SO UNCOMFORTABLE, I CAN'T SIT DOWN IN THIS THING FOR MORE THAN 15 MINUTES BEFORE I FEEL HOW BAD IT HURTS. LITERALLY WORSE THAN YOUR AVERAGE CHAIR ON AN AIRPLANE","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686787200000}
{"reviewTitle":"fast delivery, horrible padding and comfort","reviewDescription":"super fast delivery, however as a highest rated gaming chair it is terrible. After seated for 5 minutes already started having numbness. Chair is made out of cheap material, as well as the smell of the dye is noxious. Pets wont even stay in the same room due to odor. I will not continue to use this chair and have already began looking for a different option. A metal folding chair is more comfortable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"uncomfortable","reviewDescription":"It's a chair like any other, it is better to buy an office chair.I don't recommend it because it's a little uncomfortable on the back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"spend the money on something else","reviewDescription":"I got this as my first gaming chair. It was hard to put together for one person but it is doable. I’ve only been using it for 3 months and already one arm is lose and I have to constantly tighten it for it just to lose back up. After awhile of sitting to it become really uncomfortable as there seems to not be much padding at all in the seat. Spend the money on something else !","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Absolutely Terrible","reviewDescription":"The seat cushion feels like you are sitting on plywood and the backing has zero padding. I mean zero, it is just the fake leather and the metal bars creating the shape. Because of that, you feel every bar digging into your back. Complete waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Don’t waste your money!","reviewDescription":"I would put 0 stars if possible. This chair broke right away! Customer Service is a joke! They want to send all these parts that you need to hammer with a mallet to repair the chair. Along with these videos to follow to replace them as if they have constant issues with the same parts. Didn’t even last a week. Save your money and look for a quality chair; this is not quality!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Absolute dog water!","reviewDescription":"This chair, even at $60, is a complete waste of your money!I bought this chair for my 110lb daughter a year ago and the wheels fall off constantly, the cushion is completely flat, the pleather causes skin irritation and is peeling off.Complete trash!I would never ever ever recommend this garbage chair to anyone for any reason!She's better off sitting on a cardboard box!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Cheaply made, poor customer support","reviewDescription":"You have to really forced the arms into place when putting the screws in. On top of that, they sent me the wrong screws for the back to mount on the bottom. I had some extras from my previous chair but they didn’t fit right. I called the company and they said they would send me new screws in a couple days. That was about a month ago and they never showed.It is also worth noting the leather on the chair is really nice but it is poorly put together and has almost no cushion inside the leather. You can feel every piece of the frame when you sit in it. The leg rest is not a bonus as it’s barely usable. It sticks out maybe a foot and is supported by 2 pieces of plastic mounted under the chair so it flexes whenever you try to use it. The back massager doesn’t really do anything and has to be plugged in to barely vibrate.All in all it’s a decent gaming chair, hut if you can get one cheaper without the leg rest or back massager I would because it’s not worth the price.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Poor quality","reviewDescription":"Have had the chair for just over 2 months now and it’s already showing how cheap it is. I know this is by no means a high quality product but after 2 months I would expect something better. All the screws constantly need tighting, the arm screws anchors are broken causing the arm screws to be barely anchored in. The arm cushions and lumbar support pillow have gone flat. The fabric doesn’t breathe at all so expect sweaty pants. Overall for $100 just save up to get something that’s more comfortable and durable. If you’re on a budget and looking for a gamer chair I would recommend a mesh back chair instead of this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"I PURCHASED TRASH ,The screw holes don't have threads","reviewDescription":"We couldn't assemble this chair. We purchased because it was on sale and kept it for some time, when we tried to assemble it, most of the holes didn't have threads so we can't assemble. We threw it to the trash because that's whaylt it is.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Nice chair but the padding is a little stiff for me","reviewDescription":"Bought this chair when on sale during Black Friday for my son. The price point was good but after assembly I found the seat cushioning was a little hard. Some may like a harder seat but not me. My son did not care so we just kept it. There are more comfortable chairs on the market. Not sure were the rating \"For Gaming\" comes into play as you can sit on a bucket or even the floor and play video games. I know for me when I play to sit for an extended period of time 1-2 hours to game I am looking for a comfortable seat.** Update ** We have had this chair for only 5 months and the weldment that holds the post to the roller leg has broken. Just do yourself a favor and buy a more reputable brand of chair. I'm now out $120 and have to buy a whole new chair.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Could be an Amazing chair","reviewDescription":"I bought this for my husband for Father's Day. I paid for shipping and waited about 7 days before we received it. As we were unboxing everything we noticed the Allen wrench and some bolts were stripped. And as you can see in the pictures we couldn't screw the left arm rest in. We are unable to recline the chairm and even the slightest movement the arm rest falls off. Very disappointed in this and how this chair was manufactured.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Cheaply Made","reviewDescription":"Had the chair for about a month and the arm rest broke on one side plus i have to keep tightening the screws every couple weeks so it doesn't fall apart while i'm in it but that didn't even matter. It's a decent price but i would get something different if i were you don't waste your money like i did.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Awful chair","reviewDescription":"Do not buy this chair.So many issues wrong with the frame. The arm rests do not stay you have to keep tightening them because they cheap plastic that you screw into. There is no on or off switch to the vibration just unplug?I was so happy when I got this, a week after it started falling apart. When I contacted the company they told me to “screw the bolt back in” so I have to do this every day now.. no. They would t refund me but Amazon did. I already bought a new chair. Please don’t make the mistake I did.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Very short lifetime","reviewDescription":"Please do not waste your money on this. After only half a year, it has already broken beyond reasonable repair. Leaning back in it causes it to recline backwards now, even without using the reclining handle. I feel unsafe sitting in it because I am constantly worried it will lean so far back that it topples and I may hit my head.The assembly guide did warn about this, and said it could be fixed by tightening the screws. I have done so, and the chair is no better at all. I have no clue how to make it back to normal.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Material did not last","reviewDescription":"We've had this chair for 6 months and it has received daily use. Unfortunately the chair has not held up well at all, the material on the seat and the arms (fake leather) is pealing badly.  Also, all padding has deteriorated.  I would not recommend buying.  This one will be going in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Armrest bolt screws did not work","reviewDescription":"Very upset because during assembly when i was putting in the armrests, the bolts would not stay in and it felt like the hole they went into was already stripped or too big, I wish I could get a refund but I don't have a box to ship it back in. Make sure the bolts fully fit, if it wasn't for that then this would be a great chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Sadly, Not to durable!","reviewDescription":"We purchased this gaming chair in January for my husband and kids. The chair worked fine until it started slowly falling apart. First the armrest became loose and eventually came off. Then the pole that holds the chair on the legs bent and eventually breaks in half. Luckily no one was hurt but definitely wouldn’t recommend for heavy individuals and commonly used areas.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Save your money.. spend it on a better quality chair","reviewDescription":"Im not saying the chair is terrible, as I knew it wasnt going to be top of the line for the price, however, I should have spent the money on a better quality product.I was sent two left arm chair rest parts so now I have to go without a right arm rest.. very frustrating","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"6 months of everyday use","reviewDescription":"The chair overall is ok, my main problem is the right arm rest. Every week I have to retighten the bolt because it comes loose to the point where it wants to fall off. Since i have been doing this since I bought the chair I feel that this is a defective product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"doesn't last, cheaply made parts","reviewDescription":"Thought the chair was great at first, but now after about a year it is completely unusable. It started having issues pretty quickly. The wheels never worked well, but that was fine for me. I was having to tighten the armrest screws every day because of how quickly they become loose. Then after a couple months started having issue with the backrest and needing to tighten those screws frequently. Now the chair does not feel stable and is very creaky and loud.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Broken after less than a year","reviewDescription":"I've had this thing for less than a year and it snapped. The bottom bit connected to the legs broke.Never used the extra features as well since I'm a taller guy. The foot rest is too short, the massage bit didn't do anything.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Poor Quality and very uncomfortable.","reviewDescription":"Aesthetically this chair is pretty.  Otherwise,  it's terrible. The seat is very hard. The back pillow massage feature does not work. Zippers are sewn in backwsrds or missing pull tabs. Not worth the money and definitely not worth the effort for assembly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Uncomfortable and disappointing","reviewDescription":"After a few months of use, the padding becomes flat and you can feel the bars that make up the frame of the chair on your back. Quite uncomfortable to sit in for hours on end while I work. You can unzip the chair and add more stuffing like a pillow or blanket, but it's disappointing that this chair is the same price as many other gamer chairs and is much much less comfortable in a short amount of time. My last chair of the same price held up for 2 years before replacing it whereas this one has lasted 5-6 months and I'm already considering replacing it for how uncomfortable it is.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"Not comfortable for use as an office chair","reviewDescription":"The chair went together pretty easily and everything works. If you are looking for a comfortable chair for working at a desk all day, you probably want to pass on this one. The seat is hard, barely cushioned at all and it tilts toward the back of the chair as if it was designed for reclining. I placed a level on it so that you can see just how much of a difference there is from front to back. This is definitely not ergonomically comfortable in any way.I am 5'6\" and my behind sits lower than my legs do at the front of the chair which causes a lot of pressure on the back of my legs at the front edge of the chair. This pressure is there no matter if I sit to the back of the chair or scoot toward the center, the pressure on whatever part of my leg is at the front edge of the chair is very intense. I found a box to put under my feet to lift my legs upward and the pressure was relieved. It would be nice if the chair had a seat tilt feature, but it doesn't. Honestly, had I tried out this chair in a store I would have immediately disliked it and done a hard pass on it.I really don't have anything positive to say about this chair other than assembling it was pretty easy and everything was labeled and packed well.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Good chair but low cushion quality 👀","reviewDescription":"The chair is good and comfortable. Theres not much to say other than it is a GOOD CHAIR. The only and most important downside,  is the recliner cushion. There's none. Really Dissapointed on that end. Its like your reclining your back on thin paper. Very very Dissapointed on that. The cushion on the seat is 8\/10. The recliner cushion is 3\/10. Very Dissapointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Broken Chair and Broken Dreams","reviewDescription":"My chair lasted one month and it is broken because of weak welds! The company will not communicate with me!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Broke in 5 months.","reviewDescription":"DONT BUY THIS CHAIR, the base breaks after a couple months of occasional use. Super cheap, don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Junk","reviewDescription":"Made very cheaply and is super uncomfortable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Not great","reviewDescription":"Uncomfortable and the arms fall off easily","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Defective","reviewDescription":"There are several issues with this chair in particular but the two main ones are:1. the chair advertises as being comfortable, but there is absolutely no cushioning. not to mention the big wooden beam that runs across the back of the chair in the center of the back.2. the mechanism that controls the leaning back and forth of the chair is cheaply made. even when the lock is in place to prevent the chair from leaning back. you sit back and rest the chair will lean itself back.wish i had known about the issues of this chair, could have saved myself the $100 it cost to get this chair and gotten something more worth my money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Temporary","reviewDescription":"I've had this chair for almost 3 months now and I will say that it is good and is of a great quality. That being said, what it has in comfort and appearance, it lacks in build quality. The arm rests are attached via 2 L brackets on each side (4 brackets total). This means that it is extremely easy to bend the bracket when hitting the arm rest and It eventually breaks off. It is strange however since only my right armrest broke off while the left side is still in tact with moderate stiffness. This is a good product but for over $100 USD I expect higher quality especially in a freaking CHAIR. I bought a racing chair for my '00 Honda Civic for less than this. How can you possibly justify a \"gaming\" chair costing more than an automotive \"racing\" chair. I will never shop with this store again and will probably just add wheels to an old driver's seat to act as a \"gaming\" chair.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"Don't buy this chair.  Frame is like tin foil!","reviewDescription":"Purchased this for my son who is over 210lbs.  It lasted for 2 months.  The lower frame is very cheaply made.  As the pictures show the chair is on a permanent lean.  Contacted the company and I was told to send pics.  3 weeks and I have not heard anything.  Terrible quality and customer service.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Fell apart in less than 2 weeks","reviewDescription":"The back fell off because the bolts that held it stripped out with normal usage and unable to reassemble because of cheap materials making up the internal frame of the back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Not comfortable","reviewDescription":"For the price you would expect a decently comfortable chair but it’s not at all. Sit in it for about 30 minutes to an hour and it starts to hurt. Anyone seeing this should just go get an office chair, I had to switch back to my old chair because this chair is just not comfortable like they claim it is.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"Horrible customer service","reviewDescription":"Im sure the chair is fine. But... if you ever need anything from customer service, good luck.I never received my chair and they refuse to give me a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Great product","reviewDescription":"It is really nice. You can follow the manuals to assemble it.I would rate it as easy for assembling. The foot rest, back support is just great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Better than I expected","reviewDescription":"Love the product. Comfortable and sturdy. It also came earlier than I expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"😍😍😍😍","reviewDescription":"Love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Easy to assemble very comfortable","reviewDescription":"Chair arrived in exceptional packaging. Very easy to put together. Was surprised it has a vibration pillow for when seated can get a nice massage. Material is great and no bad odor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Better than I expected","reviewDescription":"I needed a new office\/gaming chair but was hesitant going this route. I had tried gaming chairs before and they just weren’t comfortable for me. I went with this one for the extra reclining distance and the footrest. It was easy to assemble although I did get roller blade style wheels instead of the plastic ones that come with it. It’s comfortable, the head pillow comes handy and I’ve found it comfortable. Actually fell asleep in it for an hour or so the 2nd night. It also has a massage feature but I haven’t used that yet.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Easy to put together and easy on my back","reviewDescription":"It only took me an hour and all the instructions were clear. They even had the nuts and bolts organized in a package that was just a ziplock with a letter on it. Literally every step had things separated. 10\/10The chair is nice too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"I love the Lumbar Support feature of this chair!","reviewDescription":"My husband gifted me this chair to help with my lumbar strain. I am so in love with this gaming chair coz it has a massaging feature that helps your back. The height adjustment feature of it is awesome most especially for someone short like me. The padding of the backrest of the chair is so comfortable. The footrest is another thing that I love about it. You can tuck it in if you're done stretching out your legs.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Nice gaming chair","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Great Chair","reviewDescription":"I am thoroughly pleased with my purchase in every aspect. The product I acquired is of exceptional quality, exhibiting versatility and reliability, thereby significantly improving my overall user experience. I would wholeheartedly recommend it to individuals seeking such qualities in a product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Awesome chair","reviewDescription":"Great quality, sturdiness and material. for the price of this chair you would think it was more expensive. It's really nice. When this one wears out most def buying another one for my son, he absolutely loves it! Great fit to his small set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Cheap quality and very bad smell","reviewDescription":"The chair arrived in a cheap box and not very good packaging. The assembly was easy enough. But right off the box, the components, particularly the seat and the back rest had a very strong chemical smell. Not sure if it's Formaldehyde but it can't be good for breathing. There are two controls: up and down  and the back rest moves back and forth. The seat itself does not tilt. The chair may be ok for kids to play video game on, but not for an adult. The vibrating lumbar support makes lots of noise. I would not recommend this chair for home office.  The box says the product is \"Made in PRC\". I guess it's People Republic of China, which is the mainland China. Why didn't they just say \"Made in China\"?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653523200000}
{"reviewTitle":"Comfortable","reviewDescription":"Recline already broken, if I lean back the chair falls all the way intoo fully reclined position.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Chair don't raise or lower","reviewDescription":"I bought this chair and followed every instruction to the very T. I check 4 times on the instructions and it don't say to prime anything once I got the chair built and tried to raise it, it didn't raise so I took it apart and tried looking over the instructions and put it together again and still won't rasie or lower. I wouldn't recommend for the price and the broken factor it don't rasie or lower.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"What a Piece of Crap","reviewDescription":"I guess I'll keep it since I went to all the trouble of assembling it, but this chair is a piece of crap. Instant back ache as soon as you sit. And for being big & tall - it is much too small.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Just okay.","reviewDescription":"I got this for my son for his birthday. Assembly was pretty easy and straightforward. The seat is SO hard and unless you are a midget, the footrest is useless. For the money I guess you can't expect it to be perfect.  But I did expect better than what I got.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"Recliner broke in less than a year","reviewDescription":"I didn’t expect the chair to last long but I definitely didn’t think it was gonna get damaged so early. Only issue I had before the recliner broke in a couple of months was the left armrest cause it was wiggly and it felt fragile compared to the right one. Simply I wouldn’t recommend the chair instead save a bit more money and get something better","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Already broke in under 3 months.","reviewDescription":"This was a Christmas present for my son. The locking mechanism that is used when you lean back to keep it in place has already broke. He is not a heavy gamer or nearly as much as he used to be and he certainly isn't a rough and active player but the locking mechanism is not that durable. I am still collecting information to see if I can manually fix it and I've reached out to the vendor am currently awaiting a reply.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1678924800000}
{"reviewTitle":"Cute but not fictional","reviewDescription":"Ok so this chair is really cute…… but not the most functional the biggest thing for me is that the wheels on it do not work trying to roll the chair is nearly impossible. I work from home and have 2 desks so moving from o e to another is really important. Unfortunately this is impossible with this chair I am writing this review a few months in after the purchase I was hoping that with time it would work out. That was not the case. Another thing is that if you buy this chair for the message feature think twice if you are not near an outlet this is useless. I will be having to buy alternative wheels for this chair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660608000000}
{"reviewTitle":"Small and Uncomfortable","reviewDescription":"This is the first review I've ever written on a product. I saw the 14,000 or so 4.5 star reviews and saw everyone saying this chair is perfect. Once I put the chair together I was a little skeptical due to how small it was; once I sat down the side edges of the chair dug right into my back. I'm 260 pounds and 6 ft tall, I'm very athletic and naturally larger than the average person; my brother is 175 pounds and 5 ft 9\" and he loves the chair. The foot rest seems fragile even to my smaller brother. I would not recommend this chair if you are looking for something sturdy and robust for anyone over 200 pounds.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"Chair is nice but there is a bar going through the back support that is very uncomfortable.","reviewDescription":"The chair is what I was looking for when gaming. There is a bar going through the middle back of the chair that ruins it. It is uncomfortable. I'm trying to find some kind of pillow to cover up that part but didn't expect an additional purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"2 months","reviewDescription":"Constantly have to re-tighten the bolts. Lasted 2 months. Don't waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Missing hardware to assemble","reviewDescription":"Missing the hardware and wrench to assemble. Would not recommend way over priced","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Immediately Returned","reviewDescription":"I was really excited about this chair and it does look great. It's also incredibly uncomfortable for even the shortest amount of time. The seat has almost no padding and there's zero chance I could sit in it for a few hours at a time to work on my computer. I sent it back immediately. I bought a lumbar support pillow to use in the chair I already own and it's much betterUpdate: The return process for this chair was really strange. The company repeatedly emailed asking me to keep the chair, insisting that the shipping cost for them would be over $50 and offering a $10, then $15 credit if I didn't send it back. It was suggested multiple times that I give the chair to family or friends. It was $130 though, so of course I declined. Then I was sent a label to return it, different from the one Amazon gave me, and told the shipping would be $20, even though Amazon said it would be free. I used the Amazon label and paid nothing and received a full refund, but I wouldn't buy anything from this company again, after the tried to trick me into paying shipping so they could save money.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1648166400000}
{"reviewTitle":"Can’t mount mechanism.","reviewDescription":"I am not able to mount the mechanism because the screw holes were not drilled correctly. I am a college student so I’m not sure where I will be able to get a drill to do this task myself I am very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Meh","reviewDescription":"I should have just purchased the secret labs chair. May of been 500 more, and it would have been more comfortable and not just a poorly built racing bucket seat. Overall a meh product. The pillow that vibrates died literally today, it smells like burnt plastic. My behind doesn’t hurt yet. It is sturdy for now. It will probably degrade quickly over time. It certainly not designed for someone of my height. That being 5’5”. There is a huge gap I could fall through between the seat and the upper portion. The design is flat and the aesthetics would not even work in a race car. Honestly I got what I paid for, no amount of support or apologies could ever fix that.Buy this at your own risk.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"the skin of the arms are falling off!!!","reviewDescription":"Hi! , i bough this chair this year on may 4th and as you see the arms are losing its cover :\/ and its only been like 2-3 months , i wouldn't recommend this chair !","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Uncomfortably Cool Looking","reviewDescription":"Recently purchased this chair for my media room and the right side arm rest screw doesn’t reach to hold the arm rest in place. I went through the hardware again to verify I had the correct one but it just spins in place. I even screwed it in without the arm rest and it works but it’s not long enough??? Despite the cool appearance and extra pillows it comes with the chair is very uncomfortable to sit in when gaming for longer than 45 minutes.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"not as good as advertised","reviewDescription":"once i got the chair, i immediately noticed the color (i ordered the blue one) was way off. nothing major, but still frustrating. once i got it assembled, i noticed the seat and back were far from aligned and i could not fix it. the leg rest does not extend far enough, so it only reaches to the middle of my shins. not comfortable at all. the reclining back is either way loose and doesnt swing back, or locks in place wherever you set it. would not recommend buying it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"No massage","reviewDescription":"There is not a massage feature in this chair. Has a pillow but no usb or way to make it massage…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Not Comfortable!","reviewDescription":"My husband's old gaming chair was very sturdy and comforable so that is what we looked for in replacing it. Although this one is advertised as \"most comforatable\" it was not. His back and legs hurt as soon as he started using it. He ended up going back to his old, beat up, but comfy chair and now this one is just sitting in our dining room taking up space. Unfortunately I didn't look into the return policy. We would have to disassemble it, pack it, and ship it back at our expense. If we had bought it in a store we could just take it back. Very sorry we bought this and will definitely think twice before purchasing an item like this from  an online only store in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Comfy with lumbar support","reviewDescription":"My fiancé is a big gamer and has a similar chair. I started a new at-home office job. Did a lot of research because I needed a chair that’s comfy, lumbar support, has message and honestly cute. Dream made! Took about an hour to fully assemble alone though","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Perfect for what I need.","reviewDescription":"Great chair. Got it for my home office. I am not a gamer. Very comfortable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Perfect!","reviewDescription":"We recently bought a PC laptop for my son and this is the exact gaming chair he was looking for. He chose the colors! Very bright! Easy to install and very very sturdy! It's worth it imo! Great value!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"It’s an awesome gaming chair","reviewDescription":"It’s all you could ask for and more","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Great!","reviewDescription":"All features are great definitely would buy again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Comfortable, Easy to assemble, All parts included!","reviewDescription":"Looks just like the product images! Is comfortable and has a great design. I was able to assemble it by myself in about an hour.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"The quality feels good and all the installation instructions are perfect.","reviewDescription":"I use this product as a gift for my boyfriend and he loved it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Game chair","reviewDescription":"Very cool! Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great!","reviewDescription":"I love this chair, is really comfortable! and I use in my Ofice not for games, but works very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Best gaming chair","reviewDescription":"Very practical and comfortable. Designed very well and even has an electronic massager in the back. Totally recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"The chair is nice","reviewDescription":"Butttttt! My left arm will not screw in. It seems as if the hole where the screw screws in is warped and keep coming apart.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Wrong color","reviewDescription":"Sturdy chair- husband put together while I was gone.  Wrong color sent","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"not straight","reviewDescription":"The back piece does not attach to the bottom piece straight","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"to many steps & directions could be better","reviewDescription":"I bought for my 10 yr old Son to game in. He LOVES it & also helped me put it together :) directions are ok but could be clearer, took us 2 1\/2 hrs to assemble UGH!! other then that I recommend","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Okay for the price but it could be better","reviewDescription":"I’m a big gamer boy and I game. Didn’t take a crazy amount of effort to build but I’ve tried everything I can’t get the chair to go up I tried hammering the hydraulic in so the button can press but it won’t do it, chair can go down but not up, if you use without the lumbar support it’s mad uncomfortable cuz there’s a metal bar that goes across your back with little to no padding. Dissatisfied but it is what it is. Massaging lumbar is alrigjt maybe my girlfriend would like it more than i if you catch my drift I give it 6-10","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"NOT comfortble but there's a fix","reviewDescription":"The assembly was really easy, very nice. I've had the chair now for less than a week and the seat is thin, the sides are rigid and there is a bar that goes along horizontally the mid back (inside the seat) that is just crazy uncomfortable. Absolutely NO padding in the seat back at all, OUCH. I do love the arm rests and the foot rest (and I am tall) but this chair just has no padding whatsoever (except the arm rests!). I do want to mention that I contacted the company about the bar in the chair and they were so kind as to refund me the difference for a lumbar support so I wouldn't feel it. Although I don't necessarily believe you should have to purchase extra items when getting a chair to make it comfortable, I do really appreciate the fact that they reached out to me and they were so accommodating and in fact followed up again to make sure I was comfortable after I received the cushion. It's an excellent company, just wish that bar was not an issue!","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1653609600000}
{"reviewTitle":"Decent","reviewDescription":"You definitely get what you pay for here. Good chair my only complaint is if your a hardcore gamer you’ll need an additional seat cushion, it comes with like a 1 in thick little foam seat it sucks. Besides that it’s straight.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"Not impressed","reviewDescription":"Missing some washers making the arms wobbly","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Good starter chair! A few hang-ups","reviewDescription":"This is a great \"starter\" chair considering the price, but I do have a couple issues with it (they are small issues overall)The instructions are a bit vague at times, such as when putting the wheels on, it simply said \"install the wheels\" without going into detail (I just shoved them in there). They do include an allen wrench and all the screws are in nice packaging so they don't get lost as easy, so that is a plus (they even included extra parts!).The main reason I picked this chair was the footrest, and while it does get the job done, it feels... off. It isn't strong, and dips at the slightest pressure so I'm scared of it breaking (BUT it hasn't yet, will update if it does). The rest of the chair is holding up well though! Another pint regarding the foot rest is I do NOT recommend it for taller people. I'm about 5ft 2 and half of my lower leg dangles off. If you're any taller then 5ft 5, I'd stick to buying a separate foot rest.Overall, chair is pretty good for a starter chair considering other gaming chairs are anywhere from 50-200$ more, and don't have the higher weight limit like this one doesTL;DR Instructions are vague at times, foot rest feels off, but a good chair for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1616112000000}
{"reviewTitle":"Comfortable, but some screws didn't fit","reviewDescription":"The provided screws on the back part didn't fit in the holes. I had to use spare screws from my own toolbox. If I didn't have screws that fit, I would have returned the whole thing. Once I got it together, it was  comfortable and works well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Better than Expected","reviewDescription":"I got this chair on sale for $110 (not counting shipping) which I recommend you do.Assembly: It took barely an hour to put together and could’ve honestly been quicker than that had I not been multitasking. It’s incredibly easy\/simple to assemble, a child (of good enough strength to tighten the screws and lift the chair) could build this. Despite it’s simplistic construction is feels smooth and sturdy.Experience: initially, it felt cheap. The sides of the backing of the chair feel as though they are lined with pool noodles, which threw me off at first. I was worried the chair was going to be stiff or uncomfortable. However, I was pleasantly surprised! It’s very comfortable to sit in, and the telescoping arms and foot rest are incredibly appreciated. I will say the plastic of the arms feels on the cheaper side and they already seemed a little wobbly shortly after construction. This can likely be amended by tightening the screws. The lumbar support pillow sits a little low for me, so I wish it adjusted to an even higher point, but I will say I am rather curvy so that’s likely a me problem. The headrest pillow is very nice and the backrest reclines and locks well, doesn’t feel wobbly or like it’s going to tip backwards. The chair also sits very low which was wonderful since it fit under my bunk bed, *and* fit my legs comfortably under my desk, which is impressive since most others do not (I have thicker thighs).Summary: I think this chair is definitely one of the best on the market for the price point. It’s not exactly top of the market quality but that’s to be expected for only $110. I would expect slightly better quality if I were paying the full $200 for it, though. Recommended on sale, and especially for those on more of a budget. Exceeded expectation. 8\/10","isVerified":true,"ratingScore":4,"reviewReaction":"55 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Trying it now...  here's the run-down!","reviewDescription":"Just assembled it. It is quite easy if you just review the parts.My first impression is, considering its bulk or size, it is like an internet date where you expect a 160 lb person but a 110 lb person shows up. So it is a bit thin in foam and size. The width is not as wide as a normal black foamy office chair. I myself may have preferred a chair with built-in pillows rather than the little ones meant to be placed on the chair, although they do stay in place.The pillows are small, and the seat has no front bump to keep you from sliding off during intensive gaming or TV-watching sessions. The lower back pillow straps around the chair like a backpack and slides up and down somewhat. It vibrates, if you're into that type of thing, but you have to be 3 feet from a USB (large end) outlet to plug it in, and it has no on\/off switch or controller; it unplugs from an 80s-style charger port at the base of the seat. That unplug is in an okay spot and does not dangle all the way to the floor.The controls for up\/down and reclination are not easy to reach. You have to either stick your arm through the right armrest or lean way to the right and around, but they do work well and lock in place nicely. The top pillow is okay and can be moved so you can sit back and watch TV, but it does not have the comfort level for extended TV viewing. As for gaming, I am impressed. The forward position, when locked in place, keeps you at a perfect position to rest your elbows on the armrests and hold a controller in front of you while keeping your back in a much more comfortable position than most chairs, all while resting your feet on the legs of the chair above the front two casters. You can sit Indian style in any position, and tilting back allows for wider leg expansion. The leg rest is more of an accessory. If you need to stretch out your legs and rest a while, it is okay, but it is not very wide so you need to keep your legs straight. The foam comfort level is above average. The pleather vinyl indents quickly, but it is not the shiny type, so it is not too sweaty.GTPLAYER really made a great simple chair. Great for upright gaming. Okay for standard computer use. It really should only cost $20 more than a $65 office chair, so if that is what you use, stick with that. What you're getting in addition is less but tougher foam, a separately reclining backrest with arms that pivot and move, vibration, and leg rest. Although quite a bit smaller than the picture, I am satisfied.If you type this review into ChatGPT, it will give you the pros and cons; too long to paste.I will update after 30 hours of computer use.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Good for the price","reviewDescription":"The chair is generally comfortable, and has the basic posture modifications. You can tilt back almost into a completely flat recline and adjust the height. This one comes with an extension for your legs like a reclining chair would have, but I was very surprised to find out that IT does not offer the option of rocking. That has always been a standard an any office or gaming chair I’ve ever owned in the past, and I was very surprised to find out this one doesn’t have it. I actually use the rocking feature regularly, so I was very disappointed to see that it’s not a feature of this chair.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Just what I needed!","reviewDescription":"Never had a chair like this and I must say, not bad...The instructions were very simple to assemble the chair with numbered tools. Since I assembled it by myself it took a little time because this thing is heavy! Especially in one of the steps...but I did it! Also, the pull out part in the front is not SO bad. I think I need to oil it or something because when I pull it out and push it back it after use, there is some resistance when there should be a smooth glide. The small backrest pillow is supposed to help support your lumbar area and you can also plug it in for a small vibration to help your back. Just don't expect it to do a great massage or something...the vibration power is only as much as my Gillette razor...oh well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Light and airy","reviewDescription":"I purchased the chair that was fabric instead of the pleather version. This allows more air flow, and the overall weight of the chair is much less. My initial impression was good, but not great. The chair back had little padding so it felt like I was resting on the board contained therein, rather than the cushion. It wasn't uncomfortable; merely not as relaxing as I hoped. The overall construction was solid, and assembly was quite easy. The leg rest is a nice feature, although I wish it extended much farther out. Overall, I am pleased with my purchase; hence the 4 stars, but not quite 5 based on the previous comments.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Didn’t come with instructions…","reviewDescription":"The chair took about more then a hour to make with some help with a YouTube video and finding the instructions online. But for some reason it did NOT come with instructions. Not the best chair I’ve ever sat on but in all honestly it was okay. Not bad. Worth $100? I don’t think so in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"GTPLAYER Gaming Chair Review","reviewDescription":"I recently purchased this massage pillow and have mixed feelings about it. While the overall product is great, there are a few issues that need to be addressed. The massage pillow itself is quite lackluster and barely vibrates, which is disappointing. Additionally, it causes a terrible amount of noise during use. Another issue is that the screws in the armrests back out regularly, requiring frequent retightening. Despite these drawbacks, I still find the product to be quite useful and effective overall.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great chair for the price","reviewDescription":"I wanted to wait a week before I did my review and here are my thoughts.  For the price, this is a great chair and I'd buy it again.  I work from home 80% of the time and also play Xbox at night in the same room so I use a chair A LOT.  Previously, I had a cheap desk chair from Amazon that I got in 2020 when the world shut down and we were all working from home.  I'll just do pros and cons:Pros:1. Easy to assemble.2. VERY sturdy chair.  Metal frame and smooth wheels, height and recline adjustments are very smooth and natural3. Vibrating lumbar pillow is a plus.4. Recline is great and feels sturdy.5. Nice to have a pull out footrest.6. Very large seat cushion.  I'm a small guy and can easily sit with my foot under my leg in like a \"4\" very comfortably.7. Cushions on the arms are soft and great for sitting all day.8. Every function is very smooth and feels very sturdy.9. They give you some extra parts.  I was actually missing a couple washers needed for assembly and found what I needed in the \"extra\" parts.10. Neck\/head pillow is soft and comfortable.  It's very small but definitely standard for most of these gaming chairs.Cons:1. Seat cushion is NOT very soft.  In fact, it's a little too firm in my opinion.  I found sitting for long periods of time, my butt getting kind of uncomfortable.  I'm assuming over time it will get softer but I wish it had more of a memory foam type cushion on top of the foam.  I got a cheap memory foam cushion pad for my old chair and am actually using it on this one which does help, but then that also puts your position on the chair higher.  This in turn makes the lumbar pillow lower than it really should be.2. The leg rest comes out easy for me (saw some people having issues and you need to make sure the mounts are straight when assembling, they are adjustable as you tighten).  However, the way the leg rest flips out to use makes it very easy for it not to stay where it's supposed to be.  If you rest anything on the inside part of the leg rest, it's going to want to flip into it's storage position.  If you have your legs straight this is not an issue but I found this cumbersome at times.3. It gets kinda warm.  If you're sitting with shorts on or I would imagine if you didn't have a shirt on for some reason (don't know why you wouldn't but you do you), your skin with start to stick to it a bit.  Obviously it's not like getting into a hot car in the summer, but just something to think about.3. Being a shorter guy I wish it did go just a tiny bit lower.  My desk at home is even a little higher than some \"normal\" desks and it doesn't fit under the desk even in it's lowest position.  I can make it fit, but it scrapes the arm cushions a bit and I could see that ripping them in time.  Certainly not a deal-breaker, but if you're used to storing this under your desk, this may be an issue for you as well.4. For the vibrating pillow, you must be connected via USB to a power source.  I'm guessing you could use some type of battery pack but there's also no on\/off, once you plug in you're on until you unplug.TL;DR: Great chair for the price.  Seat cushion could be softer imo but function\/style\/stability is on point.  Would definitely recommend if you're looking for a gaming chair and don't want to spend a lot of money.","isVerified":true,"ratingScore":4,"reviewReaction":"82 people found this helpful","country":"United States","date":1688774400000}
{"reviewTitle":"Not very soft","reviewDescription":"It's a great chair but it's not very soft. I got the fabric instead of leather. It does have great lumbar support. It moves over all surfaces with ease. Very sturdy but one of the screws wouldn't go in all the way it some how got striped and now turns with the screw. Other then that I love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Awesome chair.","reviewDescription":"It looks great. Feels good when you sit in it and was easy to put together. The only reason why I can't give it five stars is because after about a month, the lumbar vibrating feature stopped working. I bought a separate lumbar massager, and all is good.  I would highly recommend this chair for the house or office.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"you get what you pay for... right?","reviewDescription":"2.5 stars at best. -- changed to 1 star as of 4\/8\/2022.It's been a few months (ordered on September 12th, 2021) since we've had the chairs (ordered a red and a blue).  The red one had a defective bolt in one of the arms that forced the head to strip barely half way into the chair, so we had to contact the support team.  When explaining the situation over the phone, the response was \"What do you want us to do about it?\".  I continued by saying I didn't want a refund, I just want a replacement arm and seat for the chair (as well as the bolt) and I will send the other conjoined parts back to them.  They didn't want the parts back but DID send the replacements.. in two separate packages that arrived 3 days apart.FINALLY! We could enjoy our chairs together.  A few days later I developed neck and back pains from the shape of the blue chair and the lumbar vibrating bag got so hot that I was afraid it was going to melt the interior and start a fire.  For a remedy I slid a pillow and pillowcase over the chair for the necessary support and have started looking for a much better and much needed replacement.Also, for a person who is 185, 6'0\", this chair is surprisingly too small in height to a point where the neck cushion attachment area digs into your neck making it quite uncomfortable.  If they were on the outside edges it would not have been as bad.___Update for 4\/8\/2022 --  Well, the entire right arm connection to the seat is actually stripped out.  As you can see from above, I'm not a large person and I don't use it as a crutch when moving\/readjusting in the chair or a lean-to arm rest.  Went to tighten it down one day as I routinely check for loose bolts and the arm was fully tightened but ridiculously loose.  Felt around the bottom of the seat and it is 100% stripped out sliding freely back and forth from the connection.  Do NOT buy these chairs.  Updated Stars from 2.5 to 1.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1640476800000}
{"reviewTitle":"This chair is not as plush or comfortable as you might think","reviewDescription":"I would just like to say that I do my research very seriously when searching for an object I would like for a while, including when it is for a lot of money. however I would say that this chair is the most disappointing purchase I've made recently.When arrived it was fine, everything looked good. But upon opening just the tools box, I was already noticing I was missing parts (mostly washers and screws). I'll admit I was pleasantly surprised with the massaging lumbar cushion. But once it was all but together I was sitting there falling deeper and deeper into disappointment.There is no cushion in this. I am a thick lady, (220lbs) and my ass can barely sit in it comfortable. It feels like I'll just slid off, well, to make it more accurate, it feels like my ass is not even fully on it. The chair handles are poorly placed and make it difficult to lever one of them since it is nearly flush with the bottom of the chair. The massaging cushion is not a massage, more like just a medium vibration. Trying to set this chair up in a way that is comfortable was a chore and it didn't even hold that position, any amount of pressure on the arms would move the back of the chair forward.I honestly could complain further about how there is already rust on one of the parts, or how the welding isn't done correctly. I could mention the foot rest is weak and wouldn't be able to hold anything unless you were under the height of 4'.but I digress. I will probably be buying my chairs from wayfair from now on. I wouldn't buy this chair if you are looking for anything to actually sit in for long periods of time or to be comfortable. If your looking for something purely aesthetic then the chair might be for you.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1651190400000}
{"reviewTitle":"Office chair is more comfortable","reviewDescription":"Update: Had this chair for just over a month. A few screws are somehow starting to become loose. The chair also creaks and sometimes make a popping noise. I'm 5'8 and about 175lbs. Still haven't used the massager which tends to keep digging between the gap of the backing and bottom of the chair.The most important part that swayed me to make the purchase is the foot rest. I used an ottoman prior. The item was packed very well. The instruction booklet was laminated and instructions were clear. I was able to put the chair together within 30 minutes. All tools required was included. They even provide extra screws etc. The chair itself is not as comfortable as my $30 one. The footrest requires pulling the metal sliders from underneath the seat. However it requires a lot of wiggling. It doesn't slide right out. Haven't used the lumbar massager so can't really comment on that.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Retail high to discount heavy just to get buyers! Extremely uncomfortable, loud and noisy mechanics","reviewDescription":"The chair is not worth the retail price let alone a discounted price. I purchased this around $84 for the discounted price thinking I was getting a great deal.The problem is the chair is extremely uncomfortable. The seat cushion is rock hard and you can tell the material used is garbage. The chair itself makes a loud popping sound when you rest your back on the back of the chair and then move at all because of the terrible design of the chair. Both the back rest and seat are super thin as you can tell this product is a Retail price high and discount heavy to trick people into believing they made a good purchase. I wouldn't want this chair if it was free.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"After a year of owning it.","reviewDescription":"This chair is sturdy but causes significant lower back and spine pain after short periods of use. After a night of schoolwork, my back was in severe pain. I tried different cushions to help, but they made little difference. The main issue seems to be the design of the chair itself. I've decided to buy a different chair because of this. If you need a chair for long-term use, I do not recommend this chair.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"1 Year review: Don’t waste your money!!","reviewDescription":"After 1 year of daily usage, here’s my review:-Terribly squeaky (wd-40 won’t fix)-Hardware is soft and cheap-Cushion is unbearable-No support; lumbar especially-Vibrating back cushion is nearly flat after 1yr-CHEAP materials-Vinyl material on armrests has been flaking off for the last 6mo (see pictures)All of this said, I would honestly recommend spending a little more money and getting a chair that will last longer than 1yr. If you’re in the market for a pile of garbage secretly disguised as an office chair, then look no further!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Goofy ahh chair","reviewDescription":"I would give 0 stars if I could. This chair is the most uncomfortable thing you could ever sit in. I can’t even sit in it for not even an hour without immense pain and discomfort. The instructions were clear at least but the quality is not like the rest of the reviews said. This is a good chair to give to a relative if you actually hate them. Don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Not comfortable","reviewDescription":"I had high hopes for this product, but it turned out to be a major disappointment. After just 30 minutes of sitting, my back started to ache—not exactly what you expect from a product that’s supposed to be comfortable. If you’re looking for something that supports you and keeps you comfortable, this isn’t it. Save your money and look for something better. Trust me, your back will thank you!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"It didn't last two months This chair is a TOTAL waste of money","reviewDescription":"The chair was purchased less than two months ago, and already it has broken at the base. The chair wobbles so much it is un-sitable. Oh, it still looks good, but it has no use.I only wegh 2020 #'s, I hope that I didn't overload it, I didn't see any weight limit.I urge everyone to NOT buy this chair, Amazon should stop selling it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724716800000}
{"reviewTitle":"Cheap material, poor design","reviewDescription":"Material is low quality and seat hinge broke after 4 months of normal use. The chair no longer supports the upright position and is in a perpetual wobble, fully reclined state (big safety hazard btw). It's the worst chair I've bought from Amazon and despite its size is designed for children, not adults. But, they were smart enough to make sure it fails outside the return period and got past Amazon's high quality control standards, so props to their ingenuity because that's not as easy as it seems.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Great quality and easy to put together","reviewDescription":"This was a birthday present for my son. He loves it. I didn’t realize it came with massager. Great chair for the price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Great chair for computing.","reviewDescription":"Once I put together and started using it , I feel that it's a great purchase and I may but another one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Recommended.","reviewDescription":"The chair is super comfortable, I arrive in excellent condition, plus the customer service is great; unfortunately my package was stolen from the door of the building and they took care of all the management so that my other chair arrived safely. without hesitation I recommend it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"So easy a caveman can do it","reviewDescription":"I bought this for my husband for father's day. I put it together myself and it probably had the best instructions I've ever seen. I hate putting things together, but this was very easy to follow and it's nice and he loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Office Use","reviewDescription":"I use this chair in my office, its great the wheels move really nice on smooth surfaces, the massaging is definitely a gimmick but does give good lower back support, the recline and leg rest are really nice. For the price it is really awesome, it has kind of worn down in the past year but nothing crazy. Great product for price overall.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Excellent materials and workmanship","reviewDescription":"Thick leather-like material, excellent welding, easy assembly, impressive finish.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Yes!","reviewDescription":"Bought this for my son, he’s obsessed. Easy to assemble, does come in a huge box.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Amazing!","reviewDescription":"I work from home and this is THE most comfortable chair I've found. Everything else leaves me sore by the end of the day. This is awesome. And it completely reclines which is awesome on breaks lol","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Great quality and very sturdy","reviewDescription":"Love how this chair looks and my son loves it as it was a birthday gift for him.  Definitely recommend this chair for bigger gamers","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Great Cheap Option!","reviewDescription":"I've had it for around eight months and it has held up really well. I don't use the massage feature thing at all, but other than that, pretty good. It does hurt your butt after a couple of hours but so do most I've seen. I just got a cushion and I'm set for hours of Stardew.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Low quality","reviewDescription":"Chair is low quality and I don’t believe it will last. Terrible seller. They sent the wrong color and made it my responsibility to contact the delivery service to stop the delivery. I attempted to contact the delivery service twice but they asker for the shipping party to contact them both times.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Extremely uncomfortable + low grade","reviewDescription":"The chair’s arm rest cushions are worn out in 3 weeks. The head rest has squished in 3 weeks. The cushion is of inferior quality and does not provide enough support. Not recommended for office professionals maybe if you want to gift it to a child who does gaming.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Worst Chair Ever","reviewDescription":"Do you enjoy sitting on hard as a rock plywood? If so then this chair is for you. Do you like a chair back that makes you hurt? Then this chair is for you. How about armrests that are at an incredibly awkward height and totally not adjustable? This chair SUCKS!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"horrible chair and wouldnt let anyone sit on it","reviewDescription":"1. missing parts and no manual at all was included so i had to build it by looking at it.2. it rare for me to use it because im always working but when i do i noticed there was 0 cushion on the back... and the fact that you feel the metal stabbing me from my back.3. the \"leg rest\" that is included is pretty much pointless because it has no support to hold itself up. which overtime will bend the bottom seat and it doesnt extend far at all... its like it was built for a dwarf or someone with the shortest legs in the world.4.the bottom cushion of the chair where you sit is eh.overall the money you spend on this chair, i would tell you to save it and earn more to buy a far better chair because this was not worth more then 40-50$ and not was i bought it for.also i dont write almost any reviews so the fact that i forced myself to do this speaks volumes on how bad this chair is and i dont recommend getting it. bad quality over allto fix this crap i would have to buy more things just to make if somewhat comfortable","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1685145600000}
{"reviewTitle":"Falsely advertised","reviewDescription":"The video of this chair was not accurate. The size of the seat was thin and small The chair was not comfortable nor did it hold the up position. Very very disappointing. Not sturdy feeling at all. The value for the money was poor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Not worth it!","reviewDescription":"Bought this chair in February of this year and it’s falling apart! Seat is peeling, arm is about to fall off. Not even 6 months of use!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Incredibly poor quality","reviewDescription":"I received my chair with one of its arm rests missing a bearing which made it impossible to screw on to place, got in contact with the seller and they re-sent the piece missing... with the -SAME- defect, do not recommend this entire company.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Impossible to assemble","reviewDescription":"Missing materials or wrong construction materials.The package was delivered in perfect condition, but the materials part was open and in the construction guide there were 2 stickers showing different names of screws that do not exist in the package.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Cracked upholstery","reviewDescription":"The upholsterer is horrible. The whole seat is cracked and the arm rest are cracking now it's covered with duct tape things not even a year old. What a disappointment for my son. Don't buy it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Only lasted a year and a half of minimal use.","reviewDescription":"I purchased this chair in February of 2022. It was a cheaper chair so I knew it would not be the most comfortable. However, I did expect the chair to last longer than it did structurally.I used it for a few hours a day 4-5 days a week for about a year and a half and all of a sudden, the back of the chair is now stuck in the fully reclined position. It will go back up to a 90-degree angle but the second I lean back at all it just gives out. Seems like the mechanism that locks the backrest in place has failed. Before attributing this to some kind of user error, I am 5' 10'' and 200 lbs. and never even adjusted the chair once I got it to where I wanted it.Spend maybe 50 to 100 bucks more on something that with last longer. If I would have known this chair was going to be useless after 1.5 years that's what I would have done.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"It’s good","reviewDescription":"You have to tighten the screw every once in awhile and it will tip back","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Ready 2 Play!","reviewDescription":"Great price, beautiful chair, easy to assemble and great customer support.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"Better then expected.","reviewDescription":"Comfortable chair for gaming. Was alot better then I thought it was going to be","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Great all around chair !","reviewDescription":"Used as an office chair","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Decent chair 💺","reviewDescription":"My son likes it with an extra cushion","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Assembly not bad","reviewDescription":"Chair is very good quality in my mind  pretty nice gaming Chair","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"pretty good","reviewDescription":"only annoying thing is the screws that go into the arm rests get loose after some time and have to be re tightenedotherwise is pretty good and was easy to assemble","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"not really for tall or long-legged people; neck and back cushions are too hard to be comfortable","reviewDescription":"without the added features (leg rest, neck and lumbar cushions) this chair is great for working at the computer (6-8 hrs\/day). the added features were made for a smaller person","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"It’s a great chair for a gamer","reviewDescription":"My son loves the chair - it’s comfortable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Not great but not, not great...","reviewDescription":"So this chair checks all the boxes I was looking for, comfort, head support, lumbar support, height adjustments, and  recline adjustments. Setting up the chair is a breeze with the given instructions. This chair outperforms it's price point but at the cost of the padding quality . While I sit down I do feel better than most chairs, I still feel like I'm not on an amazing cushion. The asthetics are phenomenal and feel great as well. The arm rests are solid after you lock tight them after they come loose a few times. The wheels move very well on most surfaces and the lumbar support feels good. The whole chair is great but it just feels lacking. The cushion is good but not great, even tho I don't think it's off by much. I don't hurt from the chair on long gaming sessions but I don't ever feel completely relaxed either. I would suggest this chair and at this price category you will not do better. Overall 8\/10.","isVerified":true,"ratingScore":4,"reviewReaction":"52 people found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Comfy and cute","reviewDescription":"I'm 200lb and 5'2. Mainly use this to sit to do homework or play games. Assembled this by myself. Connecting the top part of the chair to the bottom part is a .... but it would've been easier if I had someone to help me.Pros: color is cute, armrest can be used lying down on the chair, neck pillow and back pillow is comfy, back pillow can massage, footrest, chair is comfy on my butt(very important I had to buy a butt pillow for my last chair)can be improved: wish there was a royal blue or lighter blue option, the armrest can't be adjusted lower or higher( I prefer it to be a bit higher), no on\/off button on the massage pillow","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Works good, left arm rest a little loose","reviewDescription":"Product is good, the arm chair became loose and isn’t sturdy now.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"It does its job but I expected better quality.","reviewDescription":"I bought this chair for my desk, I chose it made of fabric so that its material would be more durable, it is not very padded, it seems a little lacking in quality, its wheels are very noisy and lacking in quality, it is easy to assemble, if you have a Limited budget may be an option, if you have more budget find something more premium.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"Comfortable chair","reviewDescription":"I love this chair and can only give it 4 stars because it is wobbly where the seat meets the stem. There is about an an inch of play rocking left to right at the armrests. I'm thinking of finding a shim of some sort to go into the base of the chair so it is a bit more solid. Other than that I have no complaints.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Good for office work","reviewDescription":"Could make the leg support not as wonky","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"comfort","reviewDescription":"Seat is harder than expected for gaming chair.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Satisfied So Far","reviewDescription":"I should put a disclaimer first and foremost that I'm not a gamer. I'm a writer.... which means I do spend long periods of time seated in front of a screen. My last chair has been falling apart. That's beside the fact that it was generally uncomfortable and awkward to sit in. I've had my eyes on this chair for weeks. I've added and removed and re-added it to my shopping cart, lol. Read reviews, watched videos, checked out the Q&A section, etc. Finally, I decided to bite the bullet....so far, I'm pleased!Is the chair the most comfortable chair I've ever sat in? No. It's not even the most comfortable office\/gaming chair I've sat in. BUT, for the price, I think it's a good deal. It's comfortable enough that I can see myself sitting in it for hours with no issues. It feels sturdy and the overall quality seems great for the price (though, obviously, time will tell).It was pretty easy to put together. I put it together in under an hour. I should mention that I'm not at all good with building furniture. Yes, even office chairs, lol. It's just not my thing. I've been known to give up after a frustrated rant riddled with one too many profanities. But building this chair was a pretty easy task. I still struggled with piecing together the back and seat portions of the chair (difficult when doing solo), but it was only for a couple minutes. I will say I don't have the foot rest attached, because I couldn't get mine to do so correctly, lol. This isn't a dealbreaker for me, though, as I was pretty indifferent about that feature.Overall, I'd give this 4 out of 5 stars. I took off a star for the footrest mishap. Everything is pretty good. I even like the shade of pink, which I was also worried about when ordering online. I would recommend!","isVerified":true,"ratingScore":4,"reviewReaction":"48 people found this helpful","country":"United States","date":1688774400000}
{"reviewTitle":"Not comfortable","reviewDescription":"This chair was easy to assemble, looks nice, but the downside is the cushion it feels like you are sitting on cardboard, I had to purchase an additional cushion elsewhere just to be comfortable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Good for the money","reviewDescription":"Chair has tendency to squik when adjusting it or moving when sitting on it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"the part of this where I’m holding, it had it on the wrong side","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Pretty comfortable","reviewDescription":"Im delighted how comfortable the chair is. I love the extra functions for the massage and leg rest is nice. I dont spend several hours all at once but it does hold up and I dont have pain after sitting down couple hours at a time. The pillow rest is nice and the wheels glide smooth.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Comfortable","reviewDescription":"Does not lower as far as I would like it to.  Easy to roll while sitting in it.  Very easy to get out of this chair.  I wish it came in other colors.  Most important, it is QUIET!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Good deal for cost","reviewDescription":"For $100 it’s a comfortable chair that offers a lot but I have to tighten armrest once a week.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"good chair","reviewDescription":"Have used the chair for a day now after building it, and I am pleased with the overall function especially for the price. It’s is not the best chair in the world, but it is a very good chair and a comfortable one. It reclines far enough to take a nap in with the foot rest, and a vibrating pillow on your lower back. The pillow on top for your neck is tops off making this chair very comfortable.I would highly recommend this chair if you need an above average office chair that’s not going to break your bank. for the price it’s excellent. Building it was easy too and not long, 45-1 hr and it a a short hour. Easy instructions as well.I will say if you are a heavier person I feel like this chair won’t support you as well, at least the foot rest . It says 250lb limit and beileive it’s because of the foot rest as it’s not held in the trails at multiple points, just one screw. Keeps it from sliding forward. Luckily Im I on The lighter side so the foot rest has been my favorite part","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"good for the price","reviewDescription":"It shipped super fast and sturdy for its price. i bought this because my last gaming chair broke and i needed something else at a cheap price. my main concern is sturdiness of the chair which in my opinion is pretty strong. i personally dont care too much about the extra features but they are pretty nice, the foot rest is nice although the leaning feature is my personal favorite. i dont like the massager but honestly didnt even know it had one until put it together. the chair isnt the the most comfortable but it will do","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Back  support","reviewDescription":"Really good chair just what I needed at my desk","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Bent","reviewDescription":"Chair arm came bent so couldn’t get the last step to work. Ultimately it took three grown men to lean on the arm to get the screw in to hold it. Upside is it’s a strong chair.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Love!!!","reviewDescription":"This was one of my boyfriend’s Christmas gifts, and he loves it! It’s super comfortable, easy to assemble, and very easy to clean. The massage feature is a plus but doesn’t get used very often, it’s more of a light vibration for the back, but the rest of the chair is super nice!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Comfortable but flaw with foot rest","reviewDescription":"The chair was easy to assemble and is fairly comfortable, but does have a flaw with the footrest. When using the footrest in the upright position it tilts the seat forwards making it uncomfortable. There is no screws mounted to the bottom seat preventing the tilt from occuring.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Good budget gaming chair","reviewDescription":"Good budget gaming chair- not hard to put together (i.e. instructions are good). The color is different than what was pictured. The bottom cushion is a little firm if you are looking for something softer for longer periods. The recline and lumbar pillow are really good. It's not hard to recline like other chairs I've had. I have back problems and the lumbar pillow is perfectly shaped and positioned (others I've had just don't hit right). The head pillow that it came with did not come with any strap so it's not even usable. The band going across in the picture is the zipper, not a strap. I'm contacting the seller so I'll update if they fix this issue to let you know how customer service handles this. The footrest wobbles when pulling it out and does not slide easily, but it works fine and is comfortable to use once pulled out. I rarely use footrests anyway, but it's a nice addition for the price. Gliding on surfaces and turning is smooth. Overall it's a good gaming chair for the price.Edit: Customer service sent a new pillow with the correct strap without any issues.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Very uncomfortable","reviewDescription":"This chair is very uncomfortable. Will hurt your tailbone and back after an hour or so.The foot rest is a very cheap design and bends when you put your feet on it.Overall..... go with another chair.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Not that comfortable","reviewDescription":"I was at staples and was looking for a comfortable chair and found non till I sat in the Gaming chair  \"Staples Emerge\"  Wow the comfort was wonderful.  It was expensive so I went on line at Amazon and decided on GTPlayer a less expensive  chair.  You get what you pay for.  I should have considered you do not have to pay for shipping and got the right chair.  Even Amazon had the Staples chair but avoid shipping and get at the store.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"I little hard but is okay","reviewDescription":"Is okay","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Is okay","reviewDescription":"First thing first.I ordered this chair through Amazon, and the notice I received it will arrive between Jun 4-9May 29th, I was out working all day, I came home around 1 am, and the big box was sitting outside.Luckily I live in a very safe condo, and no one steals it.I never receive any notification this item arrived.This chair I always wanted, I sat on it at Office Depot and is very comfortable.I put this together within 15 minutes, but I still have a lot of screws left, one part that is missing, is the bottom base part, but is not a big deal, I can still put it together without it.I sat on it after, the seat is hard, this is not the same as the one I sat on at the Office Depot.Once again, this is not a deal-breaker, I do like it, and I also like it because this chair is not huge like some of the office chairs, I really like the size, and also like the pillow for my neck and my back.The leg extender is not great, is not as relaxing as some of these reviews said it is.I giving this 3 stars","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622332800000}
{"reviewTitle":"Okay for the price","reviewDescription":"The vibrating back part is just E waste. Other than that is it all around okay. The bottom does not have the amount of cushion it could.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Not enough foam padding in the butt area","reviewDescription":"This chair is decent if you are looking for a gaming chair specifically, the car came in a fairly sized box and assembly was fairly straight forward too. My biggest complaint is that it can be too narrow for larger sized people. I am 260 pounds at 5 ft. 8 in. with a semi larger upper body and lower body and I struggle to find enough room for my thighs. Assembly was easy came with all the screws it needed, a Philips head\/ hex key tool was provided, didn't need anything else tool wise to assemble it. My biggest complaint is that there is not enough padding in the chair to stay comfortable. The lumbar pillow they include with the chair just becomes flat after a few minutes of use, not really useful at all but that could be due to my weight. The head rest pillow seems decent enough, hasn't gone flat but I'm sure that's because not a lot of weight gets applied to it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1653609600000}
{"reviewTitle":"Pleased for the price","reviewDescription":"To begin with, the chair was a little dirty straight outta the package, just odd for a brand new item. My husband was a little frustrated building it because some of the pieces on the instructions were incorrectly named. The size of the chair fit perfectly in the limited space we have,and is pretty cool looking, this is my sons first gaming chair and he's in love with it. Pretty good quality for the price","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"Missing Part","reviewDescription":"I bought 2 chairs 6 weeks ago and they were delivered quickly. We assembled one and it’s a nice chair. I like the footrest. However the other chair had no wheels in the box so we couldn’t assemble. I reported to seller who told me they would send a whole new base. Here we are 6 weeks later and haven’t received anything. So our 2nd chair is still sitting in the box.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"Padding","reviewDescription":"Hardly any padding on the seat section makes long gamings not worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"It's Average, but not what I expected","reviewDescription":"The chair itself is made with good quality fabric - It feels like leather. It doesn't feel cheap. However, It's a little faulty. When I was setting up the chair, I realized that I received a pre-opened or returned item. The tool kit was taped closed, showing that it had been used before. Additionally, some of the pieces were not properly made to fit their designated location. Finally, the foot rest is very tight and hard to pull out. It requires a great deal of physical effort to get it out. This is pretty disappointing, considering that was the reason I decided to go with that chair. It's not the most comfortable. It's better than one of the cheaper options, but it's not ideal for me, as I sit for at least 8 hours per day.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"5 stars if it were $40","reviewDescription":"The chair works. And that's its best feature.Is it comfortable? I mean it doesn't actively harm me and not all chairs have been able to make that claim. But no, no matter how I align it or myself to it, I am never comfortable in this chair. That was clear almost immediately after building it and remains true after one could argue it was broken in. It holds my weight (230 lbs) and moves as it should. A perfectly capable seat for visitors you don't want sticking around too long.There is nothing wrong with this chair. There just isn't much good about it either. And at roughly $100 when I bought it, I definitely should have gone with a different option. Odds are good I'd at least end up with the same result.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Be careful","reviewDescription":"Leaning back, it wants to fall backwards too easy. Can bust your head on table behind you. Arms get in the way, we left ours off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Poor material","reviewDescription":"I never thought this chair will not last a year. The arm rest’s ‘leather’ is already peeling off. Poor material. I regret buying this chair. Do not be deceived by the reviews. Most people didn’t review it after months usage. This chair won’t last a year.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Not impressed","reviewDescription":"I read every single review and thought I was getting a good deal with the amount of great reviews raving about it. Guess I’m in the minority here but the chair feels incredibly cheap. It’s uncomfortable to sit in for more than an hour and leaves my tailbone sore. The back pad is almost nonexistent, it’s super thin and I can feel the frame on my back. Some chairs have a little bit of a resistance when you leave the recline unlocked to allow you to kinda lean back and forth — this chair does not. Once you have unlocked the recline function it’s either all or nothing meaning you’ll go straight back if you lean back a little. Honestly wish I would've bought something higher quality. I think if i buy an additional cushion it'll be salvageable. I do like the foot rest though. I'm lean and 5'10\" so I'm not overly large by any means.if you're on a budget and need a chair, go for it. if you want something higher quality and more comfortable, look elsewhere","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"Vibration stopped working","reviewDescription":"Vibration on chair stopped work after 1 week....😡","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Very uncomfortable chair.","reviewDescription":"There're no ergonomics to this chair at all! The seat is flat and hard and leans slightly forward; the foot rest might as well be welded in the tucked position - sliding it in and out is very hard (the rails keep binding up); the lumbar support has a USB cable to power the vibrate feature - where the heck am I supposed to plug that in there I don't trip over it every time I get out of the chair, where it doesn't get tangled around the chair's casters every time I roll it in or out of the desk, or getting all wound around the legs of my chair any time I pivot, never mind getting all tangled up with all the other cables I have under my desk.Don't buy this chair!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"The Wheels come off","reviewDescription":"The wheels don’t stay on very long","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"What you’d expect for the price","reviewDescription":"For the price I wasn’t expecting the comfiest chair, but there is almost no comfort in the back rest. Also the arm rest are already falling apart and I’ve only had it for 2 weeks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Defetosa","reviewDescription":"Mala cálida","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"To many things just not done well.","reviewDescription":"When I was looking for a chair I chose this one because it had a foot rest. In my mind this was something my old one didn’t have and I saw it as a small upgrade. When the chair got here I put it together and instantly realized I had gotten a cheap chair. The foot rest barely comes past my knees and feels so flimsy I will never use it in fear of it breaking off. It has a vibrator in the lumbar support pad that is so poorly made I had to take it apart and mess with it to get it to work after only a few days of use. The chair also barely reclines at all. To sum up, the chair is decent material, and feels sturdy but all the added features are very poorly done. I wish I had went with a different product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"Solid chair","reviewDescription":"Great chair for gaming I've had it for a couple weeks and its got 80hrs on it now, my only issue(s) with it are the arms keep coming lose and become wiggly. They haven't fallen off or anything and still hold my arms but the wiggle is strange. The only other thing is the leg rest, it works great and is solid but for someone 6ft tall it’s a little short so it’s awkward to use. It was a little stiff at first when it came to comfort but it has relaxed a bit and has started becoming more comfortable. If it wasn't for the wiggle arms I would of gave it 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Good!","reviewDescription":"Is a very easy and sturdy chair to get together.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Comfortability","reviewDescription":"I use this product for WAH, after 8 hours of use, it can be uncomfortable due to lack of padding & the footstool is a little uncomfortable as well. But it serves its purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Not too shabby","reviewDescription":"I have been using this chair for about 3 weeks. I don't sit much but for the days that I do, this feels great.  I have used the reclining feature a few times. I work 7 days a week and this helps when I can get a break.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Changing review","reviewDescription":"While I did have to reach out more than once (probably a problem with Amazon’s messaging system), this seller replaced a defective piece and remained in contact through delivery. My son loves this chair!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Comfortable but Massager broke within a couple months","reviewDescription":"It is a great chair, but the lumbar pillow doesn't have a long lifespan.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Great chair","reviewDescription":"I wish the arms were a little stronger but over all it's a nice chair","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Armrest already ripping","reviewDescription":"It's a good chair overall, and very comfortable.  However, my left armrest is already ripping after 6 months, and that's my non-mouse arm so I use it less.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Chair","reviewDescription":"I would have give five but I can’t move my chair around the room because I’m stuck to a plug 🔌 the chair is comfortable ,great material ,supportive ,recline capability overall perfect and if you have a lot of, butt you need to get this chair","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Decent Chair for the Price","reviewDescription":"Decent Chair for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Doesn't hold up very long","reviewDescription":"I work from home and bought this chair the end of December so I've have it not even 6 months and it just broke around the weld where the hydraulic rod connects to the chair. Very disappointed especially since this wasn't supposed to be a cheap chair. The chair itself was comfortable just mad it didn't hold up for very long.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Missing parts","reviewDescription":"Beautiful chair… well it would be if it came with the entire assembly the whole lower half is missing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Not Worth the Price or Hassle","reviewDescription":"It took me a while to consider doing this review, but I ended up having to purchase another chair from a  different company due to this experience.Cons - The attached pic are just some of the damages on the chair (s) I received. I had to have a replacement chair sent because the first one I had received had missing hardware, was dirty, not symmetrical, the armrest didn't line up to the chair, and there was hair in the wheels which led me to purchasing replacement wheels. Overall there was a lot wrong. Only for me to have another chair sent where, it was dirty as well, the armrest and the back of the chair didn't even line up with the base and was crooked. There was still so much wrong with the chair. After talking with their customer service they stated that the problems were due to how their warehouses had them stored and only offered a $15 refund. Which was an added insult being that I was out of pocket $139.99.Pros - Chair design was nice and fit my room design (which is why I ordered it to begin with), Shipping was fast, response from customer service was quick.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Your money is better spent elsewhere.","reviewDescription":"Let me get the actual product's review out of the way first: It's adequate, but for a few dollars more you can go into your local office supply store and walk out with a substantially better chair with less of a hassle to set up. But, if you can't afford that and want something that's good enough, this chair is just that.The real reason this gets a 1 star review from me is due to the impossibility of returning this chair. I assembled the thing, didn't like it, and sent in a return request. Went in to the place I was told to drop it off at, they told me it wouldn't be possible to ship it back without essentially paying the cost of my return in the first place. I could conceivably deconstruct some of the thing, but I lack the tools and the time to properly take this chair apart.Again, it's fine for what it is, but if you're on the fence about buying a chair from amazon, absolutely don't do it. You will be married to this thing.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1686355200000}
{"reviewTitle":"Very poor quality","reviewDescription":"This chair is terrible. It didn't even last a year before losing its shape everywhere. My son, who is only about 90 pounds, used it, so it's not a case of excessive weight. The quality is just poor. Save your money and don't buy it!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Very cheaply made","reviewDescription":"Was not hard to out together the only thing is its really cheaply made and very thin.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Waste of money","reviewDescription":"If you never had a gaming chair, this will be an ok chair. However, if you are used to comfort sitting for hours on your desk, avoid this chair. Not comfortable at all. Very disappointed. Bad bad worse product I have ever had from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"DO NOT PURCHASE THIS CHAIR TERRIBLE PRODUCT HORRIBLE COMPANY","reviewDescription":"Do not purchase this gaming chair. It is of terrible quality. It broke within two weeks of receiving it. The company makes you jump through hoops to get anything done. You will deal with multiple emails you will deal with multiple people and they’re horrible customer service they make you send videos, photographs, they admitted that the arms breaking on the chair has happened to many customers -they said they had engineers looking into it. Ok sure. supposedly it’s covered under a one-year warranty but that’s a joke they don’t follow through with that. I filed a claim with Amazon and the only response I got with this company was emails asking me to drop the file against them. Amazon should no longer allow them to sell on their site. Be warned it’s a cheap product. It will break. It will be a nightmare dealing with them. They don’t follow through with what they promise. Beware of third-party sellers especially this one. Definitely look elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Bad, avoid at all costs","reviewDescription":"Chair is ok but I wouldn't call it super comfortable. There's not much padding in the seat so after sitting in it for a few hours, or even as little as an hour, my butt starts to hurt and have to constantly adjust. Assembly was pretty simple and is sturdy so that's a plus. Honestly I didn't expect much for the price point and if I could do it again I would just spend more money on a different chair.Updated review: unfortunately I had to drop my score all the way to a 1. This chair is so uncomfortable it makes my butt and back hurt even sitting in it for a few minutes. It feels like I am sitting on a hard piece of wood with a comically thin piece of pleather on it. I hate this chair, if I knew it was going to be this bad I would never have bought it. I actually hate going on my computer because of this chair. Do yourself and your body a favor and buy something else. Spend the money elsewhere and don't suffer. Definitely going to find a better chair now.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"Don’t Buy","reviewDescription":"This didn’t even last me 4 months and I barely use it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Super cute, but wider hips beware!","reviewDescription":"VERY CUTE! However, with wider hips the chair was a bit snug and lacked padding in the seat (my booty hurt after about 2 hours and I work an office job). Other than that, it's super nice and adjustable for height and changing the angle of the back. I'd recommend getting a seat cushion to go with it","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Pretty durable with some flaws","reviewDescription":"It feels pretty durable. Be careful to lean all the way back as it's prone to tipping over. The leg rest goes about halfway down my legs so its there somewhat. I would not even bother with the leg rest. Pretty easy to assemble.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Pretty good for the price","reviewDescription":"I am 5”11 and 165 pounds. This chair is very very sturdy, but that takes a few points off of how comfortable it is. Fake leather tends to stick to your skin. It’s a great chair for the value with comfort that can keep me comfortable for hours upon hours of gaming, but my brother got one of the more expensive ones that has a memory foam cushion. Probably would’ve bought that if I did this over again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Great Chair, Bad Instructions","reviewDescription":"The chair itself was great but the assembly instructions were terrible. I was afraid to sit in it after putting it together, but I've used it for about a week. My main concern long-term is that the back massager doesn't have a switch (you have to unplug it to turn it off). But other than that it's pretty comfy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Very good, easy assemble","reviewDescription":"Assembled very easily, came with everything that was needed and even came with a little Allen wrench and the instruction book was very easy to follow. Thoroughly impressed with how this chair looks and feels. I like the lean back feature with the foot rest.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Easy to put together, sturdy and comfortable","reviewDescription":"My husband loves it, but I think it could be slightly more comfortable. The faux leather seat makes it somewhat harder than a cloth cushion would be; that's the only reason I gave it a four instead of five. The stainless steel parts hopefully will keep it from easily breaking.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Not bad but a bit firm","reviewDescription":"I like the chair but it is all or nothing when it comes to reclining.  The seat is a bit stiff or firm but still comfortable. You can easily take a nap in this thing though.  I just wish that it had a medium reclining option.  All that said, I'd buy again if needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great Chair for the price","reviewDescription":"I had some problems during assembly. Good customer service. They helped me resolve the issue when assembling and even offered to send replacement parts. The chair is comfortable even though it seems to lack padding.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Fun chair","reviewDescription":"Just what my son wanted","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"It was delivered and time price excellent","reviewDescription":"I bought it as a gift for my son for his computer and gaming table. He loved it perfect","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"No instruction Manuel!","reviewDescription":"Mine never came with an instruction manual. So that was fun having to google the instructions...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Great comfy chair!","reviewDescription":"I think it was easy to assemble, the lower lumbar support (can vibrate) and head support are nice! The only issue is the foam padding for the armrest its not terrible by any stretch of the imagination but I can feel my elbows on the plastic underneath the padding sometimes and I'm not even pressing in hard or sitting at an extreme angle. I paid under $200 for this and would recommend to others!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Fantastic!!","reviewDescription":"The size is perfect, it’s very sturdy and the purple is much deeper than in the pictures which is exactly what I was hoping for. The only complaint I have is the lumbar support cushion “massage” is merely a pillow that vibrates alittle. Could be better but honestly who cares? It’s a great chair that assembled pretty easily and offers great support and mobility.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"great chair!","reviewDescription":"UPDATE A YEAR N A HALF LATER:DONT GET THIS CHAIR!! i’m 5’6” and 160lbs. i used this chair daily, for at least 12 hours a day, since i got it. after barely a year and a half this chair has completely broken apart. first, the left arm of the chair came off from where it was screwed in, with no way of getting it back in. due to this there was a harmful metal connection protruding from the side of the chair. a few months after that happened, while sitting in it, the chair’s base completely snapped off the piston so that the chair freely moved backwards, forwards, and sideways with no stability.THIS DESIGN AND THE QUALITY ARE NOT WORTH IT! FOR $200 WITH SHIPPING YOU CAN GET SOMETHING BETTER!edit: contacted customer support and they replaced the massager pillow for me! now my main gripe is the wheels. they do NOT wheel around well at all. i went ahead and got replacement wheels from amazon, replaced them, and the chair rolls around infinitely better.for the price, i really love the chair and what it’s done for me already. i love everything about it. the footrest, the armrests, the pillows for extra back support, and the massager. the recline and lift are great. most of all, I LOVE THE COLOR!assembly was easy and the instruction manual it came with was good. came with everything you need to assemble and it didn’t take me long, less than an hour.my ONLY 2 complaints about this product are:the armrests are not even. 1 is lower than the other by maybe a centimeter, not extremely noticeable but you do notice it if you’re just sitting with your arms on the rests. i think this is because of where the holes in the back of the chair were drilled for them to screw into. i don’t really mind this though because it was important to me to have armrests that connect to the chair itself and i don’t notice the difference when i’m gaming.2 is that the massager, which was by far my MOST FAVORITE part of the chair, has already gone dead apparently. it no longer works when plugged into my console or when plugged into a wall outlet. extremely disappointed about that since i also specifically got this chair for the massager option. hopefully will be able to get this replaced.not as big of a thing, but as shown in the pic, the pulley for the zipper was also missing for the pillow that came with the massager.","isVerified":true,"ratingScore":4,"reviewReaction":"49 people found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"What a great chair!","reviewDescription":"The color is vivid, the assembly was easy to read and follow. Comes with extra screws and tool. The back massager comes in handy. I work from home and sit in this chair for 8÷hours a day! Very comfortable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"Nice game chair","reviewDescription":"Got christmas 5 months ago,sturdy, used several hours a day material  is wearing away , thinning  will need to replace soon getting holes","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Comfortable, but lacking in cushion","reviewDescription":"Chair was easy to set up and looks great. Tilt back and leg rest work.No smudges or clear defects, all parts were clearly labeled.Only complaint would be the lack of cushioning in the chair besides the lumbar support. But that is a personal preference.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"I would buy again","reviewDescription":"Every part of the gaming chair is great. The only dislike is the cushion. I wish they added a thicker cushion. But other than that, amazing chair for the price. 👍","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Nice so far","reviewDescription":"I like the chair and it seems well built. I have only had it about a week so time will tell. I use this chair in my home office which doubles as my gaming room. I had a big comfortable office chair that this is replacing. I will say this gaming chair is not as comfortable as my office chair. It doesn't rock back, but the back is adjustable and the lumbar massage pillow is nice, but there is no control for it. It's on or off and always on full vibration. I am 6' tall and 200lb and I think if I was any bigger this chair wouldn't work for me. I think a little more padding in the seat would be a nice upgrade. Like I said time will tell do I will update this review after I have used it for some time.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"It's ok for the price","reviewDescription":"Very easy to assemble, all hardware was included.  It's not the most comfortable but from the reviews I figured I'd end up getting some extra cushions for it.  Lowered all the way, my feet are flat on the floor (I'm 5'6\").  The levers for the recline and height are a bit further in than I'd like but it's not a huge deal.  It's a bit annoying to get the head and lumbar pillow adjusted to the right height and to stay put but again, I figured I'd getting new cushions anyway.  The foot rest is cool but it's more of a calf rest, I'm not sure how functional it would work for someone taller.  The back of the chair is a lot thinner than I thought it would be, hoping it holds up over time.  For the price it's a good deal, I just wouldn't expect anything phenomenal.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"It’s ok","reviewDescription":"Amazon wouldn’t accept my photo but the chair does the basics of nothing else. Not hard to put together. The massage pillow just vibrates. Nothing too special. The foot rest is a pain to pull out. I don’t really use it. Chair swivels, it leans back, and it can be lowered or raised.it does its job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Works great.","reviewDescription":"I can feel the screws in the foot rest so I might have an extra pillow for it soon. But I love it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Best chair for money, little finicky","reviewDescription":"It’ll grow on you: for the money it’s great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Not Bad","reviewDescription":"Price was right, so I ordered it.  For $100-ish not sure how this will hold up as the user is 6ft 2\" and 200lbs.  If he gets a year out of it...then great, its paid for itself.  Very easy to assemble, looks cool, and has some nice features, for example the head rest and pop out leg rest.  Just hope it holds up as now and then it needs tightening up here and there.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Nice","reviewDescription":"Its a very nice chair honestly I wont be using the massage setting as it just vibrates. I do love the extension part for your legs but the chair needs to be broken in a little to get more comfortable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Love it but feel like the seat is a little too firm and the foot rest is kind of useless","reviewDescription":"I really like it, the material seems good quality and it comes with 2 small pillows (one of them is vibrating) but the chair seems a smudge too firm for me. Its ok when its inclined but it would probably be uncomfortable sitting strait up for long periods of time...I like the idea of the footrest, but it seems useless to me (not long enough to hold your legs comfortably, or put your feet on, unless you tuck them maybe)...I like the different color options, really wanted the white and pink but went for black and purple for cleaning purposes (but the material seems pretty easy to clean)Assembly was ok, lots of pieces but not that terrible.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Great value","reviewDescription":"Comfortable.  Don't buy it for the recliner aspect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Better Packaging","reviewDescription":"This chair would have been easier to put together if the screws would have been in easier packaging to open. The pictures are super small and once you get the screws out of the package it is hard to figure out which ones to use. Otherwise the chair was easy to assemble. It just took longer because of the packaging.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Better support would make this a better chair","reviewDescription":"This is how I would improve the overall quality of this chair.1. provide more robust lower back support2. provide a better seat cushion that's not so hard3. I prefer a straight padded arm rest vs. a curved one. Provides better wrist support.4. Lengthen paddle arms for chair height \/ back adjustments","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Price fits the quality, it's not bad.","reviewDescription":"Not bad, quality fits the price, easy to assemble. The lumbar massage pillow is a simple vibration, nothing fancy but it does feel good after doing some deadlifts or fight sports. Took me about 40min to assemble myself. The fabric option would probably be easier to maintain, because the fuax leather gets marked easier with sweat, its easy to clean, but I'll probably have to do it often.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Good quality","reviewDescription":"The chair is very easy to build and comfortable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Great product","reviewDescription":"Easy to put together , comfy, and great price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Amazing chair","reviewDescription":"This chair has everything I need, my only problem is that it takes around 2-4 hours if you have no experience in building to set it up. Other than that it's amazing love it!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Decent for price","reviewDescription":"The seat sits forwards and the foot rest is basically a waste of time. You get what you pay for sometimes","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"For the price it’s good","reviewDescription":"Have a lot of friends with secret labs chairs that told me not to buy this and it’s terrible. Personally I think it’s fine. I’d it a lazy boy no. But for the price I can sit and game in it for 5 hours and I’m fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Bad shipping experience","reviewDescription":"Great product but after paying $29 for shipping I expected to at least have my box inside the building and it was left outside the building not even in the mailbox room. Risking it to get lost or stolen.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Decent enough","reviewDescription":"For a $100 gaming desk chair, I can’t complain. It’s cheap materials but that’s why it’s an affordable chair. Took me almost an hour to put together by myself. This will do!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Upgraded chair","reviewDescription":"I was in need if a new chair for a while now, it was easy to assemble and is comfortable up to a point, the massage mechanism stopped working after 1 week,  the wires came unattached, really like the leg rest","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"its comforable and nice looking","reviewDescription":"liked it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"It's 5 star but...","reviewDescription":"The chair is comfortable for the price and would highly recommend it for anyone on a budget. Fairly simple to assemble READ THE INSTRUCTIONS pay especially close attention to the armrest assembly because you can strip the nut inserted and compromise the integrity of them causing them to be weak and flimsy if assembled incorrectly.  The cons however; I'm 6'1\" and it feels like my body never quite lines up in the chair, either my legs hang to far off the built in foot rest and my head fits on the back of the seat or my legs are comfortable and my head will lack support. The massage feature is just a subpar vibration mechanism but does work decently.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"arm rests use thin, easily bent\/broken metal","reviewDescription":"The metal used for the arm rests on this chair is weak. It bends outward easily, and also breaks easily.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Buyer Beware: You get what you pay for (a cheap Chinese chair)","reviewDescription":"One year later, this chair is falling apart. I keep having to tighten it's screws. It creaks and wobbles no matter what I do. The back will barely stay upright, I had to seriously manhandle the tensioner to be able to sit something resembling upright.The faux leather is peeled off the armrests and the seat is peeling. Foam in the seat is completely worn out (and I'm under-average weight and size). Back cushion is at 50%. These deflated long ago.The massager is an obvious joke. It just vibrates.When you prop your feet up, the chair rotates.I greatly regret buying this and not saving up for a better chair.I can only imagine many of these reviews are illegitimate in some way, this chair is absolutely awful even after just a month of owning it. Unless you just need a chair for 3 months, stay away. It's cheap, really cheap. Just don't do this to yourself, I have to haul this to the dump now.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"ARMS KEEP COMING LOOSE","reviewDescription":"The arms on this chair keep coming loose , i am constantly tightening them and within a couple days they are starting to loosen up again.  I personally do not find the chair comfortable , there is a gap between the seat and the back that i need to fill with a pillow to be able to use the chair for any length of time. Will be returning.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"The arms keep loosening","reviewDescription":"This chair would be great but the arms keep loosening. The chair was assembled on Dec. 25 and we have had to tighten the arms SIX times since then (it’s Jan 12). This seems to be a design flaw or maybe we received a faulty product. This was a gift for my son so imagine how disappointed he is with his faulty Christmas present.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Great Chair Until It Wasn’t","reviewDescription":"I purchased this chair a little less than a year ago for my teen age son. This chair gets a lot of use as he’s a gamer and spends a lot of time on line for school. He loves the comfort of the chair, but was disappointed to see the artificial leather start peeling. His previous chair lasted almost 5 yrs with no peeling issues. I called the company and left a detailed voice mail as instructed, but never received a call back.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"Uncomfortable","reviewDescription":"I give it a four star for build quality, but two stars because there’s absolutely no padding in the chair back. There is a bar in the center of my back, not comfortable at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"This chair is worth_less","reviewDescription":"The leather started peeling the very next day after installation was done...the manual addressed that the chair armrest will become loose after a period of use..I've been re-tightening the screws 5 minutes after using it. the screws are having a hard time tightening.. me being a technician always find a way to modify things to get them working properly but I must say I wish I spent the extra 40 bucks to get a different brand..I must say i do like the color and the way it feels otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Gt chair","reviewDescription":"Leg rest is to short, the massage cushion just vibrates but it is fairly comfortable","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"A lot smaller than expected :(","reviewDescription":"The seat is rather small for a gaming chair for a normal sized adult. The lumbar support moves around a lot when in use and no matter the position, always feels like it's pushing you too far forward in the chair. At least it was mostly easy to assemble but the end didn't exactly justify the means. I would try to return but these things are so big it's hard to disassemble and put back in the box and then deal with further shipping issues.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Poor appearance","reviewDescription":"Came in with all the parts sealed or in plastic but looked off color at the seams and was stained as if had been used or left outside. Foot rest is chincy as well as the pillows. Directions helped put together pretty well. Poor quality for the chair upholstery is biggest complaint.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Love this chair!","reviewDescription":"Perfect chair for sitting at the desk.  Firm settings for sitting back without it coming loose.  Great buy !","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Budget Gaming chair","reviewDescription":"This chair has held up well for 7 months. The foot rest is great but could be sturdier. The pricing is on the mark. I'd recommend this to some one who doesn't want to spend much. The higher end gamer chairs go for $300+. This one is affordable for a budget gamer or a young kid starting out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Get this ! My 2nd buy","reviewDescription":"Easy to put together, stylish & durable..  ordered the red back in 2020 . Back for another in 2024 the old one is still good condition","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Comfortable!","reviewDescription":"Very sturdy and strong. I like this chair for gaming, the cushins are adjustable and so is the seat. Its pretty straight forward but a good chair.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Great chair for a great price","reviewDescription":"I had been looking for a gaming chair for my son. I had put some chairs on my cart and he discarded all of them and found this one.  I am glad I let him choose his own chair because he knew best the features he needed, such as adjustable height, lumbar support, massager.  The chair looks stylish as well. He has used the chair for a couple of months and it looks great. Easy to clean too!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Good chair","reviewDescription":"Easy to assemble. Great quality and adjustable chair.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"So cool!","reviewDescription":"Easy to put together and the massage is awesome!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Gaming chair.","reviewDescription":"I bought this chair for my son as a birthday gift. He says that out of all the gaming chairs he has had this is the best chair by far. Very comfortable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Very comfortable","reviewDescription":"I brought for my grandson for his game station and he said it’s very good and comfortable to seat either play games or do homework","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Exceptional Quality and features","reviewDescription":"The chair is great for it's price. I got it on sale, so even more so. The build quality is quite good, and the features in the chair are also great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Seat needs to be readjusted","reviewDescription":"Seatback comes loose so it needs to be tightened often.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Great chair","reviewDescription":"This has been a great chair for my son for gaming. The color is spot on from what was shown online, the lumbar support is nice and it was fairly easy to assemble.I am not certain of the overall sturdiness or durability as it seems kind of loose and rickety after a few weeks of use, even after tightening all areas.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"I like it","reviewDescription":"So far pretty nice! I originally got this one because of the footrest, but my legs are too long and it’s pretty short so I don’t use it much. I like the back and head pillows, but the massager on the back pillow is a bit useless. Also, it was pretty straightforward to put together.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Great Chair! I have a few problems with it though.","reviewDescription":"Beginning look for the chair. Took me about 2 hours to assemble. Much easier with someone else to help you. it’s a sturdy chair but it doesn’t automatically recline, you have to manually set it. my other problem is the leg rest is too short. i do have lengthy legs so that applies to certain people. After using this chair. i give it a 9\/10. i would buy it again if it broke.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Comfortability","reviewDescription":"This chair is extremely versatile. It fits any comfort zone, whether you like to sit up pretty much straight or slouch, heck, even if you want to recline. The built-in massager makes life amazing when you have to sit for long periods. Overall, I highly recommend it for gamers or even just as an at-home office chair. Beware of the build process, though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Wasn't expecting much","reviewDescription":"I was in need of a new gaming chair and when I saw this on sale for a hundred bones, I jumped on it. Spending only a hundred dollars on a gaming chair, I wasn't expecting too much.  But so far, I'm pleasantly surprised. It is a little smaller compared to my old chair, but that doesn't mean much to me being 5'10\"  around 160 lbs. The leg rest and massage pillow are nice additions. Yeah, the pillow just vibrates, and it is sort of loud, but it's better than not having one at all. Overall, I'm happy with the money I spent","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Conforme","reviewDescription":"Fue un regalo para mi novio y le gustó, solo me dijo que el masajeador no es tan bueno","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Comfortable gaming chair","reviewDescription":"Ran into a snag during assembly but located extract parts that were a different size that were included","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Very Comfortable Chair","reviewDescription":"A very comfortable chair to sit in over long periods of work or browsing. I wish the material were leather. That would make it more breathable. Very easy to assemble and sturdy. It is a great chair for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"It's very nice quality","reviewDescription":"It's easy to install and great design. However, it does hurt my bottom after around 4 hours and my back doesn't get as much support from it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Great price!","reviewDescription":"I bought this when it was on sale for $100. My son put it together himself and loves his gaming chair . Nice head rest , useless foot rest .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Great chair","reviewDescription":"We got this for my grandson and he lives it.  Very comfortable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Excellent","reviewDescription":"Very happy with this purchase. First off it is actually comfortable. I'm 5'8\" and 235 lbs and it fits almost perfectly. If the armrests were just maybe an inch further apart in width would be perfect but that really is nitpicking. Headrest is nice and soft, can be moved up and down or taken off completely. Really like the fact that the lumbar support is also removable. I don't use it often but is nice to have the option. Gas lift works perfect. Reclining is easy and can be locked into place which is great. Footrest slides in and out easily and when using is very nice. As far as assembling goes it took me about 45 minutes and was very easy. Instructions were very well done and easy to follow and all the hardware was included with extra parts just in case. If you are looking for a very nice chair for gaming, office, or just a great option that's comfortable and doesn't take up much space and is super easy to move around I would highly recommend this. Lastly, IMO can't be beat for the price. Would definitely buy again. No complaints.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"AMAZING CHAIR WITH WIDE SEAT","reviewDescription":"GREAT CHAIR. VERY STURDY AND SOLID.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Love it","reviewDescription":"Only thing I would say bad is the reclining lever is a little to far down to reach easily. But other than that it's a very sturdy and comfortable chair","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"GTplayer gaming chair","reviewDescription":"Great chair no problems I would recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Perfect!","reviewDescription":"Best chair EVER! BACK SUPPORT IS PERFECT. IT IS A SAFE AND SOLID CHAIR! I am so pleased with my purchase. I got it on Prime Day so the price was great. I love how it adjusts and the color and style fits perfectly in my space.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Guide quality","reviewDescription":"Really satisfied and happy with it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Really comfortable, one of the greatest purchases ever","reviewDescription":"Chair looked really promising and it did hold up, it is amazingly comfortable, practical 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Nice chair","reviewDescription":"I replaced my old office chair for this chair since I have been doing a lot of sitting on my butt. I like the recliner and the foot rest. I'm the person that likes to cross my legs and the foot rest makes it easier for me to do that. I have noticed the arms are a bit wobbly, but other than that, it has been a great chair!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1719878400000}
