{"reviewTitle":"Reliable and Affordable Microphone for Karaoke and More","reviewDescription":"**Singing Machine Wired Microphone for Karaoke (Black)****Reliable and Affordable Microphone for Karaoke and More**I recently used the Singing Machine Wired Microphone in black for a karaoke night, and it proved to be a solid performer that met all my expectations. This unidirectional dynamic vocal microphone is a great option for anyone looking for a straightforward, no-fuss microphone for singing, public speaking, or parties.**What I Liked:**- **Clear Sound Quality**: The microphone delivers clear and crisp audio, making it ideal for karaoke sessions. The unidirectional design helps focus on the vocals while minimizing background noise, which is especially useful in a lively party environment. Whether used with a karaoke machine, amplifier, or speaker, the sound quality was consistently good.- **Durable Build**: The microphone feels sturdy and well-made, with a durable plastic and metal construction that can handle the wear and tear of regular use. Despite its affordable price, it doesn’t feel flimsy, and I’m confident it will last through many karaoke nights and events.- **Plug-and-Play Simplicity**: The microphone is incredibly easy to use—just plug it into the compatible device, and you’re ready to go. There’s no need for complicated setups or additional software, making it perfect for quick and spontaneous use. This simplicity is a huge plus, especially for those who want to get started right away without any technical hurdles.- **Comfortable Grip**: The microphone is lightweight and comfortable to hold, even during extended use. The design is ergonomic, so it feels natural in hand, which is important when performing or speaking for long periods. It’s easy to pass around at a party without worrying about anyone dropping it or finding it uncomfortable.- **Versatile Usage**: While I primarily used it for karaoke, this microphone is also great for public speaking, announcements, and other events where clear audio is essential. Its versatility makes it a useful tool to have on hand for a variety of occasions.**What I Didn’t Like:**- **Basic Features**: The microphone is very straightforward, with no additional features like an on\/off switch or volume control. While this simplicity makes it easy to use, some might miss having these controls, especially in a louder environment where you might want to quickly adjust settings without touching the connected equipment.- **Standard Length Cable**: The included cable is of standard length, which worked fine for most of my uses, but it could be limiting if you need more mobility or are performing on a larger stage. If you need more range, you might need to invest in an extension cable.- **No Shock Mount or Stand**: The microphone doesn’t come with a shock mount or stand, which would have been nice additions for those who want to reduce handling noise or set the mic on a stand for more professional use. However, for casual use, this isn’t a major drawback.**Bottom Line:**The Singing Machine Wired Microphone in black is a reliable and affordable choice for anyone in need of a microphone for karaoke, public speaking, or parties. Its clear sound quality, durable build, and plug-and-play simplicity make it an excellent option for casual users and those looking to add a dependable microphone to their setup. While it lacks some advanced features and accessories, these are minor considerations compared to the overall value and performance. If you’re looking for a straightforward, no-nonsense microphone that gets the job done, this one is definitely worth considering. It added a lot of fun to our karaoke night, and I’m very happy with its performance!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"PERFECT FOR ME!","reviewDescription":"This did a great job for us. I plugged it into the amp and it worked great. I plugged it into the camera and again it worked great. FYI I had to buy a converter to make it fit into my camera mic jack. Great little mic.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"great value","reviewDescription":"For the price I was worried it would be garbage - but after plugging it in it works just as well as my other mic.  Sound quality is fine for karaoke, and the on\/off switch works.  Materials are kind of light, but so far it works great, and that's all I can ask!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Portable wireless microphone","reviewDescription":"It did not work with the system the church had. And was too late to send back","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"perfect for home use","reviewDescription":"We use this in the house or in our big van. We love reading books while on the road, but it can be hard to hear in the back while draveling quickly. We plug this into the aux (with an adapter) and read away. It has a really long cord so even those in the back can take a turn at the mike. Whether we are reading, playing a game, talking or anything else, we can all hear what is going on. I LOVE the on\/off switch that is has too. You can leave it plugged in, but turned off. It picks up sound very well also. Great product!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Did not work with a 3.5mm headphone jack adapter","reviewDescription":"This mic works with my JBL party box 310 portable speaker. I tried a 3.5mm headphone adapter on this and the mic would not work. Luckily, the mic port on the speaker I am using has the larger jack for the signal receiver that comes with this mic.Mic signal was working at 30 ft through almost 12” of drywall. Not sure how far the signal will go without anything blocking it.Definitely impressed for the price. Might need a specific type of adapter to make this work on a 3.5mm jack.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Se escucha como uno de marca reconocida!!!","reviewDescription":"Muy buena Calidad de sonido y solo costo 💲 una infima parte de lo que costaría uno de marca reconocida!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Great quality","reviewDescription":"Recommended","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great","reviewDescription":"Did the job and worked perfectly all night","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Perfect for us","reviewDescription":"Works just like we want.  Can be tinny sounding, but turn the mic and it goes away.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Nice product","reviewDescription":"It works well. You have to turn the volume up and place the microphone directly towards your mouth for your voice to be amplified.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Good microphone for the kids.","reviewDescription":"Update 5-24-14:  I wanted to add an additional update here, I found out that the system has enough microphone gain if the signal sources are configured properly.  The best way to use the machine and get enough loudness out of the microphones is to turn down the music source (iPod, iPhone, iPad, etc.) and then turn up the overall system gain.  This makes the microphones louder relative to the music and it works perfectly.  I changed to 5 stars for the review as well.I bought this microphone as an accessory to the Memorex Karaoke station so that both of the kids would have one to sing into.  The build quality is stable and it sounds good, easy to use.  I am not sure how well it will do over the longer term if it gets dropped a few times but works well to start.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1400803200000}
{"reviewTitle":"It is what it is for $10","reviewDescription":"I needed a mic to have some fun with my 5 yr old on sing alongs. Tried wireless, too many batteries to charge, and low run time.  Went with this wired unit, and its exactly what we needed.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"works well","reviewDescription":"Good quality, sound is pretty decent for a budget wireless Mic.  Be aware that you can ONLY use one of these! two would cause interference.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"It's amazing","reviewDescription":"My kids love this they play with it everyday it's just like the original that came with there signing machine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"Works like a charm","reviewDescription":"What is was intended for. Getting drunk and enjoying Scary-oke 🤌🏾🤪","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Great Microphone!","reviewDescription":"I use this for my job at a campground and it works great! You need a LOT of AAA batteries, so have extra on hand.Easy to connect and I was able to adjust the microphone volume independent of the music volume.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Works with older model SDL9035","reviewDescription":"We got this as a replacement when one of the wired microphone stopped working.Works well with model SDL9035. Sounds better as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Muy satisfecho","reviewDescription":"Todos muy buenos.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Serves the purpose!","reviewDescription":"I bought this microphone and a small amp to be able to communicate with my brother who is hard of hearing. I wanted to be able to read to him.For the price, it was a deal!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1658016000000}
{"reviewTitle":"Great buy","reviewDescription":"Bought this for karaoke day at nursing home. Good quality, and we’ve had lots of fun using it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Great Mic!","reviewDescription":"Love this! I bought it to go with our karaoke machine. I needed another mic to plug in the speakers aux. this did the trick! It’s a great price too! The sound is equally as good as the mic we bought that went with the speaker. It’s also great quality. It’s been used by my nephews who have dropped it many times, and it still works like a charm. I would recommend this for sure.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1660608000000}
{"reviewTitle":"High quality sound!!","reviewDescription":"I bought this for my karaoke it really works the best! High quality sound!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Great Party Mics!","reviewDescription":"Sound quality and durability of this microphone is amazing. I know this especially due to real life events, like leaving two of these bad boys in the rain.I expected failure upon jacking in and to my amazement they worked with no signal lost.I’ve also swung them into things by twirling  them around by their super duper long cord. They’ve been dropped on the floor and I may have kicked\/stepped on them a few times as well.Microphone splitter was purchased separately. When in use, both microphones need to be turned on to be compatible. Not sure if that’s a mic or splitter thing. 😀BUYER BEWARE: PURCHASING THIS MICROPHONE DOESN’T STOP YOU FROM BEING A TERRIBLE SINGER. FROM FIRST HAND EXPERIENCE, SING IF YOU LOVE TOO","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1610668800000}
{"reviewTitle":"Sweet","reviewDescription":"Great sound","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Micro Phone","reviewDescription":"This microphone worked very well. I used it for my daughter's wedding so everybody knew where to go when to go there when to go to the dance floor it was loud enough to be heard in a big open space we enjoyed it very much","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"this thing is just great. it sounds very good for being 9 dollars.","reviewDescription":"these things sound cool and are underrated. try them out for recording","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Microphone","reviewDescription":"Works well, good value for the money, good quality, on the sound is good.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Great","reviewDescription":"Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"it's okay for a kid","reviewDescription":"It looks like a toy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"microphone","reviewDescription":"Grandkids use it on their karaoke machine love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Durable Quality and Good Sound","reviewDescription":"I have read on here about many people complaining over the quality of this mic, but I have had no issues after about 3 months of heavy use. Due to COVID worries I host karaoke bonfire nights at the beach with my Monster Rockin' Roller 270 portable speaker. We use bluetooth to play karaoke songs off youtube on our smartphones. Also between songs we wipe down the mic with a fresh wet wipe and use the same one to cover mic while singing before disposing of it when switching to new person. These parties involve drunk and rowdy people signing their heart out, and guess what? The mic holds up. Even after being wiped with chemicals and getting some sand in it. I also sing a lot at home with the same speaker and mic set up. I'm always taking the jack in and out. No breaking or issue with the cord.I'm quite pleased with the purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1615766400000}
{"reviewTitle":"Very nice","reviewDescription":"Value, best sound for the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"This is very nice","reviewDescription":"Great product I love it would buy again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Excelente","reviewDescription":"Perfecto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Great product","reviewDescription":"Great mic for the money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"WORKS LIKE A CHARM!!!","reviewDescription":"I bought this mic for my granddaughter's singing machine after the mic that comes with it stopped working. This mic works like a charm. The cord is long, and it shockingly produces a very studio\/karaoke mic sound. It was the best purchase from Amazon this year.This mic is so good, the whole family was playing with the mic and singing.  I thought we would have to throw away her singing machine, but this mic saved the day. The transaction with the seller was smooth, and the mic quickly was shipped and was at the house by the next afternoon. 3000% satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1646956800000}
{"reviewTitle":"Awesome product","reviewDescription":"Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Works with any Bluetooth speaker","reviewDescription":"Thus was a gift for my husband.  It works with any Bluetooth speaker.  The cord is long enough so you want have to stay in one spot.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Karaoke King!","reviewDescription":"This is the third one of these I've purchased and they sound great! We always had to add effects when using a more expensive studio mic, but this little gem has some tone built in so it sounds great right out of the box! Word of caution, if you drink when you karaoke be careful with the mic. After about 3-5 good drops from 4ft up it goes dead. Still not bad for a cheap mic. I wouldn't use it for recording or live performance, but it is PERFECT for karaoke! If you have rowdy friends, like I do, buy two or three. That way people can swing it by the cord, drop it, and really rock star party hard! Great fun!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1625443200000}
{"reviewTitle":"Great Mic","reviewDescription":"If you’re not looking to spend a ton on money on a Mic than this one is it! I’ve had it since 2019 and it works great now in 2022. I’m surprised it’s so cheap with how great the quality is as far as sound, durability, etc. I’m a dj and it’s worked great for weddings, parties, you name it.  I highly suggest buying it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1652832000000}
{"reviewTitle":"I am Super happy with this microphone!!","reviewDescription":"I have one of the Singing Machine Karaoke systems.  It only came with one wired microphone.  It has another slot for a 2nd microphone hook up. I purchased the same brand, Singing Machine microphone but the wireless type before getting this cord one.  The wireless microphone wasn't smooth, it constantly bunked out while singing(I even changed into brand new batteries, same thing!!!).  I was disappointed..  Until I purchased this product, the wired microphone---is terrific! I am so happy with my purchase!!! This microphone works as intended and it sounds amazing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1618790400000}
{"reviewTitle":"For me","reviewDescription":"When and if mine ever breaks I will be buying this again maybe will buy again if I get a dual Karoke machine. I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Condition","reviewDescription":"Works great & looks brand new for a refurbished item.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"It works","reviewDescription":"Works really nice. Good to take anywhere for events.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Great Bargain!","reviewDescription":"I was looking around for mics and was disappointed that most were around $40 at the cheapest and cords were extra! This mic is simple, and has a perfect length cord for my networking events. I'm ordering a 2nd one so my co-host and I can be on the mic at the same time!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1651190400000}
{"reviewTitle":"perfect sound","reviewDescription":"This is a great sounding microphone.  Use it for guitar or any other instrument.  I am sure it is good for singing as well.  I hope you found this helpful!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1674691200000}
{"reviewTitle":"Es muy bueno","reviewDescription":"Tiene muy buen alcanse inalámbrico, le dura mucho la pila","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Best Quality, Best Price","reviewDescription":"I ordered this just to mess with some friends but it works amazing. My friends and I have used it at parties to give announcements and for karaoke. Overall, it’s a great microphone and the price only makes the deal better.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1664755200000}
{"reviewTitle":"Singing tine","reviewDescription":"Just the way described.. start singing right away","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Doesn’t work in mic slots with singing machine","reviewDescription":"I bought this because it’s  “singing machine “ brand and have the “singing machine “ karaoke .. one would think it works and when put in either mic slot it doesn’t work !! It does work in the ext slot but just my own voice ! Wanted to work in the mic slot because my machine changes voice to like chipmunk or female voice etc .. what a huge let down !!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Maybe for kids toys it work","reviewDescription":"I have to turn up all the volume on the mic so ppl can hear me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"missing parts","reviewDescription":"did not come with the 3.5mm adapter as said","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"I wouldn’t recommend","reviewDescription":"I don’t like the set up at all. I especially don’t like that the batteries drain so quickly in the port that has to plug into the speaker. This had the most reviews so I bought it.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Stopped working","reviewDescription":"This stop working after the second time it was used. It didn’t want to turn on at all. I don’t recommend it at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"low-quality microphone","reviewDescription":"You have to really put your mouth next to it for it to work, low-quality but understandable for $5","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Have to be right on the mic","reviewDescription":"Mic works pretty well, but you have to be right on it to have it pick up sound.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Cheaply made microphone that didn’t work","reviewDescription":"I was looking for a replacement microphone for my singing machine karaoke system and this didn’t work with it. Very light, not very durable and didn’t work in anything I tried using it with.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Awful Product\/Good Service\/Shipping: On-Time","reviewDescription":"This was my first order on Amazon.  I was happy that the microphone arrived on time, and the packaging was fine (so this is where one extra star comes from).However, I was extremely disappointed in the product itself.  I sing and play multiple instruments, so I wanted to make clearer recordings than my laptop itself would allow; I am also taking a class next school semester that requires voice recordings (just speaking).  I plugged the microphone into 4 different laptops, a karaoke machine, a piano keyboard, amplifier, etc. (basically anything that the adaptor and the microphone w\/out the adaptor could be plugged into), but the microphone didn't work at all.  I did go through the steps of fixing\/changing the settings on the laptops to test the sound of the microphone; the only time there was any indication of sound going through the microphone was when I hit the microphone, and I had to hit it on the top with a lot of force.  This was not worth my time or money.The one extra star also comes from the refund that I got immediately after sending my complaint in about the product.  Thankfully, service was good and, better yet, I did not have to return the microphone, which saved me from having to pay extra shipping fees.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1420588800000}
{"reviewTitle":"Save your money and buy a rechargeable wireless mics.","reviewDescription":"The sound of the mic is good but has problems that makes it impractical. First issue is you can't use two of these because it uses the same channel. There is no option to switch so either use the wired mic or get a different brand wireless mic. Second issue is the battery. It lasted about 6 hours before I needed to replace the reciever. The third issue is the build. It feels very cheap because its made out of plastic. Last issue is the value. There are other mics on Amazon that are rechargeable, last longer, have better build, and have multiple channels. I recommend the wireless usb-c rechargeable Lekato mic. One receiver supports 2 mics so you technically buy 2 sets and use 4 mics.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"Works great!","reviewDescription":"My son loves these microphones! He uses them for the karaoke machines and they were easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Singing Machine SMM-205","reviewDescription":"Good quality for the cost. The kids love this and the Sound is actually pretty good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"Amazing quality and less value.","reviewDescription":"I got this singing machine for my niece and this product is amazing, she loved it, and she is using it everyday, she had other singing machine but she was telling me this is better than old one. So this product is really good and value is really is good too. Quality is perfect. Love this...","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1623628800000}
{"reviewTitle":"Great for mobile DJ","reviewDescription":"I use this mic with my mobile Dj setup and haven’t had any issues with it. The cord is plenty long and the housing is plastic but it’s sturdy. They could improve the on off switch but it’s not a deal breaker. Sounds quality is great I guess as I have it going into a mixer to have more control. Otherwise, I like it and it’s a good choice for my needs","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1581120000000}
{"reviewTitle":"Great deal","reviewDescription":"This works and sounds great!  And for $10?","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Exactly as pictured","reviewDescription":"Exactly as described and pictured. Used for a singing machine and worked perfectly to replace the original which had gotten damaged. Also came with an adapter for the plug in case it needed to be used with a differently sized input.(Not a professional mic of course but plenty for at home karaoke)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"GREAT Microphone for a GREAT Price!","reviewDescription":"This is the most awesome microphone! I bought it as a recommended add on product for my 10 year old daughter to use with the Fisher Karaoke speaker my Dad got her for Christmas and couldn't be happier with it. The sound quality is very good and it is very well made as well as being an awesome price!. Holds up well to my daughter slinging it around when she's singing, and dropping it all the time, because, you know, she's 10. I would highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1539820800000}
{"reviewTitle":"Karaoke Time","reviewDescription":"Perfect match to my original microphone and the sound and quality were great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"She absolutely loves singing a long to her favorite songs! He little brother (20 months) likes to ...","reviewDescription":"I bought this for my daughter's 6th birthday and it was a huge hit! Even though she is struggling with reading, we bought the sing-along CD's to go with it to songs she already knows very well in hopes it will help teach her words she doesn't know. She absolutely loves singing a long to her favorite songs! He little brother (20 months) likes to pick up the additional microphone we purchased and make funny noises or attempt to \"sing\" with her. The entire family was excited by this gift!As far as the quality goes I have not noticed any negatives. No, it's not DJ quality, but it is extremely suitable for children or even adults to have fun with at home.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1407974400000}
{"reviewTitle":"works well","reviewDescription":"the sound is good.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"amazing great product","reviewDescription":"i got this product within the day i ordered it and i loved it the sound quality is great and it lasts for a long time :thumbsup:","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Works great","reviewDescription":"Easy to install and works instantly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"It works great","reviewDescription":"I’m glad I found it needed it for a Christmas gift I had bought that was missing the microphone","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Great Mic","reviewDescription":"This is a great microphone for my purpose. I bought two as replacements for my karaoke machine mics. They come with two male plugs which is great because I was worried about getting a wrong size. They are nice and heavy and the sound quality is great. Such a good value for the money!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Nice size","reviewDescription":"I love the way it sounds. Its perfect for my speaker from Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Diversion","reviewDescription":"Buen producto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Basic","reviewDescription":"It's a basic microphone. It works, but can't compare it to the more expensive mics. However the kiddos manage to break the expensive karaoke mic, so the basic mic is perfect for them lol","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"This mic was perfect","reviewDescription":"It was reasonable and I needed it for my bt speaker for my moms celebration of life outdoors. It was clear nice and loud I just plugged it into the mic jack on my speaker and it worked absolutely the way I wanted it to work. If you need one you won't be sorry with this item at all","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"Sound pick up","reviewDescription":"As described","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Works great with machine","reviewDescription":"Bought this so we can sing duets...it works perfectl, good deal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Did I get the wrong mic or does it not work?","reviewDescription":"I’ve never purchased a mic, so this was my first one and why I got a cheap one. It can pick up my voice when my mouth is all up on the mic, but it can’t pick up any other noises like instruments, which is part of why I needed it. So it’s a no go, but also maybe I don’t know what I’m talking about lol","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"So so","reviewDescription":"Works ok, batteries die very fast and need constant charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Great for a toy","reviewDescription":"I bought this mic for my clients to make announcements at a wedding. As a professional singer I have been very frustrated throughout the years when people try to take my microphone to make speeches and other announcements. Let’s make this clear, this is definitely NOT a performance microphone, it is however great for the best man’s speech and has a fantastic wireless range. Very affordable and I didn’t go into cardiac arrest when they yell “mic drop! “ or pound, pound, pound “is this thing on?”!","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Good","reviewDescription":"Good for the the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Broke after 2 uses","reviewDescription":"The plug","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Not reliable.","reviewDescription":"I bought two of these microphones for karaoke night. They did not work. The mic did not want to turn on even after batteries were replaced. People had to perform with borrowed mics.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"The description is wrong about the batteries!","reviewDescription":"It takes 4 AAA batteries...not 4 AA like the description says! We bought AA batteries only to get ready to use it and went to install the batteries and realized it took AAA and now we're headed back to the store!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Single channel\/not compatible","reviewDescription":"You can not use 2 of them at the same time.Sounds good, Battery life is about 3 hour sof constant use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"web page said it comes with a 3.5 mm adapter. it didn't","reviewDescription":"web page said it comes with a 3.5 mm adapter. it didn't, now I will have to return it wasting my time, and fuel, and then order another one","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Better than I expected","reviewDescription":"This is a cheap make product that does is work.  The wireless distance is great, the materials used to make it are kinda low quality but it fits it's work.There is a noise\/disturbance when you move the mic around a lot, but I put mine on a mic stand so nobody has to touch my stuff.Used it for live streaming and concerts connected to my audio mixer which is then connected to my black magic atem.Best to get some Duracell rechargeable AAA batteries with charger as other batteries drain very fast","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"... to do this one because it was getting a bad wrap. Yes it is cheap plastic like everyone ...","reviewDescription":"I dont review products often but i felt the need to do this one because it was getting a bad wrap.  Yes it is cheap plastic like everyone says and yes it is possible to break it especially when adding the battery at the base of the microphone.  HOWEVER the range is fantastic and the sound quality is good.  It's ONLY $11!Just be very VERY careful  when replacing or adding the battery.  That will become the point of breakage.  Also if this is for younger for kids they will CERTAINLY break it if they decide to be rough with it.  BUT if you treat it carefully, and under supervision it should be fine.  using mine for Christmas karaoke among other adults and it is awesome!  Love it and if i break it ill go out and get another one.  Very good product!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1481587200000}
{"reviewTitle":"Genial","reviewDescription":"Muy buen micrófono","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great item for the price","reviewDescription":"So I used this for a senior event for Bingo. It was clear and no issues at all with people being able to distinguish the letters n numbers. Great buy","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1662681600000}
{"reviewTitle":"Wow just wow","reviewDescription":"I was expecting it to not be that great after reading the reviews so I ordered it with low expectations but it has truly amazed me. It's a very loud and clear microphone even worked on a out dated karaoke machine! Wow just wow!!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"Microphone","reviewDescription":"Works great. Lightweight and easy to use. Ready to go out of the box. I recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1677196800000}
{"reviewTitle":"Teens\/Kids love it","reviewDescription":"Very good qualityPrice was great. Works with about any radio\/speaker I had. My teenagers use it for their party karaoke nights, and at home just to sing in their room. Recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1657238400000}
{"reviewTitle":"Excelente inversión!","reviewDescription":"Nos gusta, fácil de usar.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"I wouldn’t sing a song","reviewDescription":"I bought it to annoy my neighbors while riding on my golf are. Neighbors are annoyed.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"great product","reviewDescription":"great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Great mic","reviewDescription":"My daughter loves to sing she's only three so she puts it near her mouth and chews on it sometimes but since it has a hard top it's fine and there's nothing for her to choke on like  cloth or lil pieces","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"Great to use","reviewDescription":"U have to buy batteries for it but it’s works with no problem easy to use for a dj to","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Singing Machine Wired Microphone for Karaoke,","reviewDescription":"I bought the microphone to replace the microphone i had and was damaged so we can use while playing music with my boom box machine and to sing karaoke.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Microphone","reviewDescription":"My husband & grandkids absolutely love this","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Make sure it's the right model","reviewDescription":"It was perfect and worked great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"It works with JBL Partybox 110","reviewDescription":"I bought this to use with my JBL Partybox 110 on special occasions like birthday parties and family reunions. I didn't want to spend a lot of money for something that will get used so rarely. When I found this it was a no brainer. It feels solid enough. The sound is good. For the price it's not even a question, just buy it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"Great value","reviewDescription":"Unbeatable price won’t find a price this low anywhere else and the quality isn’t bad , shipping was fast also.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Works great","reviewDescription":"Just right for my wife. She loves it. Sounds great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Great value Great Price","reviewDescription":"Microphone worked as advertised. It is also a great value for the price. I recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"excellent and value for money","reviewDescription":"for the price i paid, this is excellent quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Good for the price","reviewDescription":"It’s actually pretty decent. Doesn’t feel like cheap quality and the sound quality is good. Perfect replacement to the original one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Wasn’t very loud","reviewDescription":"This wasn’t very loud at all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657497600000}
{"reviewTitle":"Need a karaoke or amp.","reviewDescription":"I bought to use with smart tv or sound bar- unable to connect. Sigh!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645488000000}
{"reviewTitle":"Not a great quality","reviewDescription":"We purchased it few weeks ago. First couple of weeks it worked ok and there onwards quality went bad.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639699200000}
{"reviewTitle":"OK","reviewDescription":"I am on my third microphone like this.  Yes, I keep buying this one because it is cheap, but it doesn't hold up over time.  I use it daily in classroom setting, each year I need to buy a new one. So if cost is factor, get this one or spurge for something more expensive,","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1523491200000}
{"reviewTitle":"mic check 1 2","reviewDescription":"the mic is a good value and works as well as expected for the money.  2 thumbs up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636070400000}
{"reviewTitle":"But by the other reviews it sounded like yoiu really did not","reviewDescription":"Ok so I ordered this microphone thinking that you just had to put the 9V battery in and then turn it on and it will work, but when I recieved it it turns out you have to have either a amplifier or karaoke machine. But by the other reviews it sounded like yoiu really did not. luckly I play electric bass and have a amp;long story short if you do not have a Karaoke machine or a guitar amplifier then do not buy this this microphone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1484352000000}
{"reviewTitle":"An $8 Microphone","reviewDescription":"Purchased as a replacement for the microphone included with a Singing Machine karaoke setup from 12 years ago (MTV co-branded, with double tape decks, CD, and 4\" black and white screen, if you can imagine - a real time capsule!). Little kids love it though. This microphone performs fine for that purpose. This is, fundamentally, a cheap microphone - if you care about sound quality, distortion, etc., keep looking.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1475712000000}
{"reviewTitle":"OK quality construction","reviewDescription":"I have been using this for about 4 months. Here's what I have experienced.PROs: The padding part is soft and grippy, the fabric holds up pretty well so far and the cover is tight and secure on the steering wheel.CONS: the leathery parts are very cheap plastic material. Those parts are very susceptible to ripping and the plastic peels away easily. Very frustrating","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1489276800000}
{"reviewTitle":"good karaoke machine","reviewDescription":"The only problem we had was the microphone went out on us and we had to buy a new one about a month after I purchased it, and the top of the microphone stand where the mic sits is a little flimsy and broke so you cant set the mic in the holder and sing hands free. Other than that it gets loud like I like it and it has a second mic outlet so you can sing a duet with someone. It was good for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1389398400000}
{"reviewTitle":"3 stars for a very basic microphone","reviewDescription":"It works, but you practically have to have to have it in your mouth for it to pick up. Is it worth $10? It is when you bought it for drunk karaoke nights anyways.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619827200000}
{"reviewTitle":"okay for kids","reviewDescription":"This microphone is good for young kids since they don't care as much about sound and such.  For the price it does make a great toy.  We got it to use with a singing machine karaoke machine which came with a corded mic that sounds better than this one, however, my son (who is 4) wanted a cordless one so he could sing and dance around as he pleases.  He is very happy with this microphone and will not use the corded one. The sound has a bit of an echo and you have to hold it right up to your lips to be able to hear the sound well.  This mic is perfect as a kids toy...but not ideal for adults.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1295049600000}
{"reviewTitle":"A wire came loose now it doesn't work","reviewDescription":"My daughter had this less than a week and a wire broke. It was her birthday gift and now it's useless unless I pay more money to get it fixed.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"Good not great...","reviewDescription":"For the price this works well but you have to be really close to the mic to get the sound.  That's okay if it's only your close family using it but not if others need to use it as well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Won’t buy again","reviewDescription":"Microphone worked good for a while & then stopped all of a sudden. It’s cheap so it’s worth it’s value just doesn’t last long.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1666569600000}
{"reviewTitle":"IMPRESSIVE SOUND QUALITY but DONT LET THE KIDS PLUG IT IT OR PLAY W THE JACK TOO MUCH","reviewDescription":"Well- I LOVE it and I love the sound quality for the price- IMPRESSIVE. but the darn quarter inch jack keeps falling off! So I would say if your budget is $20-$30, buy this but BE THE ONE Plugging in and turning on...my 6 year old child who is a trained singer and somewhat gentle broke it 3x. I might buy another one and make it a rule that only mommy touches.Still, I have to wonder if this thing can be made a little stronger.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1521072000000}
{"reviewTitle":"Low Sound","reviewDescription":"I got this because I thought it would do a better job than the built-in microphone in my laptop.  My laptop microphone causes a tin-like sound.  This does in fact get rid of the tin-sound- but at the cost of driving down the volume so much so that I have to practically eat the microphone. It's not sensitive as claimed. It's good if you want a cheap microphone for kids (or drunk adults) to sing into, but it's not a quality microphone.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1455321600000}
{"reviewTitle":"Nice mic just not very loud","reviewDescription":"For a plug and play mic this works fine. It has a sturdy feel and it is semi professional looking in appearance. I plugged it into my amp (I am using the Polaroid PBT3003) and even with the mic volume turned at max it still sounded low. I had to speak up to hear my voice.For now, it does what I need it too so I'm not too upset about the loudness. Will continue to search for a louder plug and play mic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1451347200000}
{"reviewTitle":"Por momentos no funciona","reviewDescription":"Por momentos deja de funcionar pero la calidad y el sonido son excelentes","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Karaoke","reviewDescription":"It looked nice but I didn’t like that it could not be pared to my tv.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644883200000}
{"reviewTitle":"Not a good replacement for the kids Singing Machine Mic Guy","reviewDescription":"Impedance is too high for the SINGING MACHINE KIDS MIC GUY SING ALONG. I have to yell in order for my voice to come across. Can't hear the kids at all when they use it. This might work very well in a normal emcee or PA type use but not a kids sing along machine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1547683200000}
{"reviewTitle":"It works","reviewDescription":"Sound quality is poor.  It works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648425600000}
{"reviewTitle":"Good for the price; depending on your expectations","reviewDescription":"We bought this for the occasional, pop-up karaoke party at my family cottage.  It sounds decent (a sliding scale, I guess, depending on who's singing :))  but it feels kind of cheap; very lightweight, not hefty like the kind of mic one might encounter in a karaoke bar.  If you're casual, for-the-fun-of-it singers like my family, this is a fine microphone for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1472515200000}
{"reviewTitle":"Decent price but have had to replace already","reviewDescription":"I really shouldn't complain because of the low cost of the microphone and amount of use it gets, but I bought this as a second microphone for my daughter's karaoke machine a year ago and it just broke.  I have now purchased it again and I hope this one lasts longer.  The microphone that came with the machine is still holding strong and gets just as much wear and tear.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1453852800000}
{"reviewTitle":"It works","reviewDescription":"It works, but not much better than the cheapie one that came with the karaoke player. It has slightly better volume, but when singing higher notes, it can crackle. It is nothing fancy, but it does work.  The only thing that puts this mic above other cheaper mics is it comes with an adapter for computer use.  Order it if you really need one that doesn't break the bank, but if you can afford a few dollars more, look for a better one.","isVerified":true,"ratingScore":3,"reviewReaction":"42 people found this helpful","country":"United States","date":1337990400000}
{"reviewTitle":"Just Ok","reviewDescription":"Sound is okay for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647993600000}
{"reviewTitle":"Turn it up","reviewDescription":"Bought for the kids to use with a keyboard. It was very quiet and we stopped using it immediately. I used the 3.5 mm adapter which might have contributed to the issue.Worth a try for the cost, but we couldn’t use it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1546560000000}
{"reviewTitle":"Mehhh....","reviewDescription":"Great price but you basically have to cup your hand around it to get the sound to pick up well. Wished I would have spent a little more and got a better quality sound.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612483200000}
{"reviewTitle":"Not loud enough","reviewDescription":"The SMM-205 works but is not very loud so I can't hear the voice over the music during karaoke.  I'm giving it 3 stars because it was cheap so not too much else to expect","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1547856000000}
{"reviewTitle":"Sound quality not great but still overall a good mic","reviewDescription":"This microphone was not bad but the sound was not loud at all and did not work well with my karaoke machine. It was non refundable so I ended up having to keep these and buy new ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1541116800000}
{"reviewTitle":"This Mic is good for karaoke I just want my voice to be louder","reviewDescription":"The sound quality is good for karaokeI would like my voice to be louder","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628899200000}
{"reviewTitle":"Great light show","reviewDescription":"Mic not loud enough to sing over music or if you are having a party! Very disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1609804800000}
{"reviewTitle":"it is not that loud","reviewDescription":"it is not that loud. i had to have my amp maxed out and my hand cupping the mic in order to hear it. and then you cant be in front of the speaker (exactly where the connection is on my amp) because it goes into a feedback loop. cord not that long. not great for beginners or light home use.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1449532800000}
{"reviewTitle":"Not too good to use with PC","reviewDescription":"I bought this due to the 4-star rating and relatively cheap price. My setup is to plug in the mic directly to a PC. So far, my experience has been unsatisfactory. Sound is cutting out or cannot keep up with the song. Maybe I need to buy a mic adapter as other reviewer suggests.But, as a stand-alone unit, I won't recommend it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1406419200000}
{"reviewTitle":"It's ok. Just ok.","reviewDescription":"The mic itself is ok. Its built to withstand a drop or two. My issue with it is you have to hold it VERY close to be heard even at max volume. Using with ION Party Rocker Max...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1536537600000}
{"reviewTitle":"Reception","reviewDescription":"The only bad thing is you have to have the mic to close to your mouth to get the sound.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1599523200000}
{"reviewTitle":"Try another $10 mic","reviewDescription":"I use many cheap mic for my karaoke machine this one is not very good for $10 and I have bought several other mic at this price just very light and hollow feeling and sound is crackly even at a low volume.  Take a chance on an other mic for $10 can't get much worse.  2 stars due to price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1417046400000}
{"reviewTitle":"Worked for 3 weeks","reviewDescription":"Have had product less than 1 month & having to buy another... Suddenly, microphone will not work unless standing directly beside karaoke machine.  Have tried new batteries - nothing will make the microphone work as it did the 1st 3 weeks.😢  5 star quality for 3 weeks! But giving 2 because didn't last....","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1469404800000}
{"reviewTitle":"Can't hear","reviewDescription":"We have been trying to use this for a speaker toy we currently have where the microphone broke, but we can't hear much that is spoken into the microphone.  We don't know which is the culprit of low sound.  The volume knob is always turned up on the speaker 100% so we don't know why it doesn't work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1375315200000}
{"reviewTitle":"Wrong one","reviewDescription":"I think I got the wrong one it should be a wireless one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1609113600000}
{"reviewTitle":"not recommended","reviewDescription":"bought because it was recommended to go with bluetooth speaker, can't even hear through speaker, may be the small speaker issue, but it was recommended to go with it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1550534400000}
{"reviewTitle":"Cheap microphone that works like an expensive one","reviewDescription":"Very clear voice not distorted I did buy a high quality patch cable for a guitar to extend the microphone cable other than that very happy with the purchase honestly happier than my pro microphone","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Works","reviewDescription":"It works how it's supposed to... sounds pretty solid","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Momma","reviewDescription":"Haven't used yet at the BDay party but it works will with karaoke party box in the living room area.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Granddaughter just loves it.","reviewDescription":"First time getting her to sing.  3 yo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"I love it","reviewDescription":"This is perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Excellent","reviewDescription":"Excellent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Highly recommend","reviewDescription":"I purchased this mic for an event that I hosted in a small venue. I had sponsors speaking, so I wanted a mic for them to use so that people could hear them clearly. This mic was perfect for the event. I was nervous about purchasing it, but it did not disappoint. Best investment ever!Pro: user friendly, great valueCons: none","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Great Quality for Great Price","reviewDescription":"This microphone was no setup, and the sound clarity of the microphone is very clear with little to no background noise. Definitely worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Good","reviewDescription":"Good choice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Very easy to use","reviewDescription":"First one I ordered didn’t work. Put in for a replacement and had another at my door in a day and half. Works perfectly and great sound. Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Good Range","reviewDescription":"Connected easily to my Sony party speaker. Has great range, and the sound quality is very good.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Works great and a good value for the money","reviewDescription":"Works great and a good value for the money","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Ok for the price","reviewDescription":"It's not bad for the price and usable, but not so good either because it's a little muffled when you sing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Good microphone","reviewDescription":"Worked well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Bueno","reviewDescription":"Ni tan mal","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Computer microphone.","reviewDescription":"Works for what I needed it to do. My computer had no microphone bill Dan, but it had a plug jack, microphone works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Lo recomiendo","reviewDescription":"Para el precio vale la pena me gustó mucho .. solo que no puede alejarte mucho de donde está conectado .. no pesa mucho tampoco lo recomiendo si es para uso de la casa .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Cordless mic","reviewDescription":"Strong and study easy on the hand with some occasional drop outs.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"So far so good","reviewDescription":"Good product for a cheap price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"It works","reviewDescription":"Good microphone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"It didn't fit in my speaker, but it is ...","reviewDescription":"It didn't fit in my speaker, but it is light weight and feels a bit cheap. I originally purchased it for my kids, so I don't mind that it feels cheap.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1475107200000}
{"reviewTitle":"3***","reviewDescription":"You get what you pay for. We were in a crunch for my friend's wedding so we bought this microphone. We were able to get about 7 to 10 usable minutes before it decided to start cutting in and out.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1470528000000}
{"reviewTitle":"Unfortunately the additional microphone was far from perfect it wasn't even half of the new one","reviewDescription":"I bought the singing karaoke and wanted an extra microphone for her birthday party. Unfortunately the additional microphone was far from perfect it wasn't even half of the new one. Waste","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1471651200000}
{"reviewTitle":"Compatible Mic","reviewDescription":"We have  a Karoake machine and I wanted another one so the girls can sing together.  It is comparable to the one that came with the device but I love the longer cord.  Gives the girls more play room.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1379030400000}
{"reviewTitle":"Okay but won't last a year","reviewDescription":"Couple of months past and now on\/off button not working properly. I have to really push hard to make it on. Still okay for the price of item. But would suggest people to buy more advanced and expensive mic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1415836800000}
{"reviewTitle":"You get what you pay for here. I actually ...","reviewDescription":"You get what you pay for here.  I actually got it for a Halloween costume, but the top kept popping off.  If this is for children I can't imagine it would hold up well.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1447891200000}
{"reviewTitle":"Poor Design\/ Quality","reviewDescription":"Microphone works fine, but is poirly constructed. The bottom unscrews for the battery compartment, but will not stay screwed on once the battery is in. It only has 2 dinky plastic threads, so we ended up having to tape it together. Poor design.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1451865600000}
{"reviewTitle":"READ BEFORE YOU BUT THAT MIC :\/","reviewDescription":"it cuts out not a lot but when u first use a lot like 15 mins after it does not cut a lot u do need 2 9v battery's It is cheaply made I should be $9.00 and free shipping.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1461456000000}
{"reviewTitle":"Batteries","reviewDescription":"The batteries don’t fit","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613520000000}
{"reviewTitle":"Temporary Mic","reviewDescription":"Worked well for a while, then just quit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1582588800000}
{"reviewTitle":"Out of box failure","reviewDescription":"I bought this as a gift for my parents, but it seems to be broken out of the box.  Multiple new sets of batterries and no light, no activity.Broken product, zero support if it is broken.Since it is out of the return window.  I recommend buying a different brand with better support\/warranty in case you fall outside the amazon return window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Buyer Beware, you get what you pay for!","reviewDescription":"I’ll start by saying I went for the less expensive option thinking that this would be a decent mic for backyard karaoke and other impromptu or informal speeches at family gathering. Boy was I wrong! For starters, in order to have any audible sound be heard by those in attendance, your mouth has to literally be on the mic casing for the mic to project one’s voice. And even then the volume on the speaker has to be maxed out. If you’re hosting karaoke night with this mic, it will be a short night, your guest won’t be able to hear that brave soul’s voice and they’ll probably start leaving while the night is still young. In summary, don’t waste your money on the product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Not good for karaoke","reviewDescription":"This Mike is terrible for karaoke I can barely here may self and when you sing your lips literally have to be on the Mike no joke. So look at something else if you want a good Mike for karaoke","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Extremely Disappointing - Stopped Working After Just a Short Period","reviewDescription":"I recently purchased this Portable Wireless Microphone, and it has been nothing but a disappointment. After only a short period of use, it completely stopped working. I followed all the instructions, ensured it was charged, and treated it with care, but none of that mattered.The most frustrating part is that I am unable to return it. The return window is ridiculously short, leaving me stuck with a non-functional product. This microphone was supposed to be a convenient solution for my speaker needs, but it turned out to be a waste of money.I do not recommend this product to anyone. Save yourself the trouble and look for a more reliable option. This one is simply not worth the risk nor your money.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Doesn’t turn on when plugged in, can’t hear anything thru the mic. Tried everything and nada. Save your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"DO NOT BUY!","reviewDescription":"I bought this for my daughter to do karaoke with friends. This microphone worked horribly, it was echoing, we had to keep changing the batteries many times in one day. Just stoped working.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Noooo","reviewDescription":"Broke within a month and only used it once . Tried to create a case bc “warranty” but I sent everything they asked me for and they denied my request and won’t send another one . So I have  broken mic now ! The wires on the inside of it are messed up .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"I AM SICK OF THIS CHINA GARBAGE!  4th mic just completely failed ... and i mean failed ... no audio at all mid song ... junk!!!!","reviewDescription":"do not buy this mic! the switch on the mic blows! scratch scratch scratch no matter what you do ... turn it on, scratch, turn it off scratch ... hiss scratch hiss scratch ... junk! happens on 4 different PCs ... total garbage!EDIT: my third shipment of this same microphone ... all results the same. The third shipment is the worst ... the switch isnt the only problem this time ... touch the cable and your speakers will hum extremely loud and wont stop even if the mic is shut off ... right now my wife and I are looking for a better mic ... this mic is just garbage! Since this is the third one in a row, and all three were faulty, I dont want to waste waiting on a 4th ... all 3 in the trash can ... looking for another mic ... really too bad, this mic feels and sounds great ... while it works ... ugh.EDIT YET AGAIN: ok so i went for a 4th on this one ... damnit i should have listened to myself on the 2nd ... this mic is complete garbage ... buy it and you will see ... same issues every single time ... switch scratch, random mic muffle, cord shorts out and causes scratch ... this mic pisses me off ... complete garbage product!EDIT UPDATE FINAL: the 4th mic just took a crap ... amazingly enough now theres no scratch, yet theres also no mic volume, now sounds like the mic is under water ... tested in 4 different sound cards ... this mic is complete garbage!!!!!DONT BUY THIS GARBAGE MIC!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1392595200000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I used it once.. and then it stop working. Couldn't return it since the return window closed. Don't waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"\"We can only confirm that our microphones are compatible with our karaoke machines.\"","reviewDescription":"Dead on arrival. Manufacturer emails back \"We can only confirm that our microphones are compatible with our karaoke machines.\" So be aware.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Bought this as an additional mic for my daughter’s karaoke ...","reviewDescription":"Bought this as an additional mic for my daughter’s karaoke machine that she received at Christmas. Could barely hear it. Kiddos kept tapping it to make sure it was on","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1514937600000}
{"reviewTitle":"Ok","reviewDescription":"Worked ok until it got dropped.  Not ideal for young kids.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577318400000}
{"reviewTitle":"Broke","reviewDescription":"I have ordered 2 of these and within a few hours to a couple days they no longer work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1541289600000}
{"reviewTitle":"Lots voice delay and echo, it does not pick ...","reviewDescription":"Lots voice delay and echo, it does not pick up your voice very much. I so regard buying this and somehow we can't return this junk. PLEASE STAY AWAY FROM THEM.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1507852800000}
{"reviewTitle":"Broke Easily","reviewDescription":"My kids broke this microphone pretty easily.  Once the wire mesh part came off it was impossible to reattach.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1543708800000}
{"reviewTitle":"DO NOT BUY THIS MIC","reviewDescription":"I'm a comedian and I needed a new mic and I got this one and I guess yo uh get what you pay for the on off switch has a short in it after 2 shows just not a very good product","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1466035200000}
{"reviewTitle":"May not last too long","reviewDescription":"I was only able to use the microphone twice before it cut off on me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1561939200000}
{"reviewTitle":"DOES NOT WORK WELL AT ALL..........","reviewDescription":"DID NOT WORK WELL AT ALL.  I GOT THIS FOR MY GRANDDAUGHTER AND SHE DID NOT LIKE IT EITHER. IT WAS A WASTE OF MY MONEY.I SURE HOPE THAT SOMEDAY I WILL FIND ONE WITH A POINT THAT WORKS ALSO.......","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1375142400000}
{"reviewTitle":"Not great.","reviewDescription":"Not a huge fan of this product. You have to hold it almost touching your lips for it to pick you up. Not a great buy.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1521417600000}
{"reviewTitle":"Worth it.","reviewDescription":"I like it. Kids love the new microphone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582243200000}
{"reviewTitle":"Poor quality.","reviewDescription":"poor quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Not great quality","reviewDescription":"The microphone worked great. But broke after only a few weeks and barely any use. I think we used it two or maybe three times is all. Of course it was a couple days past the return window. I don’t usually write reviews, but I read recommend finding a better quality\/different brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"Maybe I got a lemon","reviewDescription":"I don't know if i got a dud or not, but the microphone input is way too low.  Only way for microphone to pick up any sound is if it is 1mm away from you and even so, it will only pick up a whisper.  Anything further than that would be dead silence, unless you blow into the mic.  I guess I should have read the product description more clearly because it does claim that it has \"High Sensitivity\", but even so, a microphone shouldn't be this low. The only positive thing I could think about the microphone is that it comes with a 3.5mm adapter, which isn't in the product description.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1402704000000}
{"reviewTitle":"Not Worth It","reviewDescription":"I bought two of these microphones for my music classroom just to let kids practice with. The first one, the receiver was broken the first day of using it when a student ran into the karaoke machine. The second one worked great for one day, then the mic stopped picking up. The receiver makes the speakers click when I plug it in but nothing from the mic and I've changed all the batteries. It's also a pain that it takes 2 9V batteries, which I don't usually have on hand. I'm switching to a wired mic.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1550620800000}
{"reviewTitle":"Poor quality.","reviewDescription":"I was so excited to get my daughter a replacement mic for her karaoke machine. 5minutes not even exaggerating the volume was staticky  so I removed it from the karaoke machine to see if the connector needed to be pushed in a bit more. I took it out and it was broken in the karaoke machine. Terrible, it could just be a poor quality adapter but I won't know since it broke immediately.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1588809600000}
{"reviewTitle":"Battery life is horrible!","reviewDescription":"See title","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Sound quality not great","reviewDescription":"I bought two of them so my girls could each have their own. When I inserted the batteries and plugged them into the singing machine, they only thing I got was static. I tried removing one, but that didn’t work. I also tried spacing the mics across the room but that didn’t work either. As long as they are plugged into the singing machine karaoke box, the only thing we get is static. Very disappointed!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1611532800000}
{"reviewTitle":"Just shy of completely worthless","reviewDescription":"Unless you practically swallow the head of the microphone, volume is really poor. And when you do hold it close enough to get any volume, sound quality is absolutely awful. An inch from your mouth gives (barely) OK volume but terrible audio. Anything more than an inch, however (even just an inch and a half) and volume plummets.These may be fine for children, who mostly just want to hear their voice come out of a speaker, but forget about using these at a karaoke party. Sure, they're very low cost, but it turns out there's a reason for that: they're worthless!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1402531200000}
{"reviewTitle":"Cheap plastic and battery doesn't fit","reviewDescription":"This was really badly built, you can feel that it's made of pretty cheap-quality plastic.  Also, the battery doesn't fit into the battery compartment, so you're pretty much left with no option other than to force the battery in.  However, if you force the battery in, you'll break the battery compartment or the battery will get stuck inside the screw cap.  When I tried to put the battery in, it got stuck and I can't get it out of the screw cap, rendering the entire product useless because the screw cap won't even attach to the microphone anymore.It's a pretty low-quality product that has critical hardware problems that prevent it from working properly.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1438387200000}
{"reviewTitle":"Broke in 3 months","reviewDescription":"I bought this microphone in June for a Karaoke machine I bought on Amazon.  It worked fine while it lasted. The sound was OK.  But two months later it started acting up and voice would disappear in the middle of singing.  Now it does not make any sound at all.  Waste of money.  When I buy products, I would expect it to be reliable.The microphone that came with the Karaoke machine still works like new no matter what Mic outlet you plug it into, so this is not an issue with connection.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1380412800000}
{"reviewTitle":"Broke within hours!","reviewDescription":"The metal cap broke off the first hour! Still eorkd, but I don't expect for long, the quality og even the sound is poor. Disappointed and I do not recommend putchasing this product.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1515369600000}
{"reviewTitle":"Not so much!","reviewDescription":"Didn't get a chance to use it. The plug is old school...super large in diameter.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577664000000}
{"reviewTitle":"Mic and charger !!","reviewDescription":"I was really hoping this would last more than 3 times yes 3 times !!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"Go with wired mic","reviewDescription":"Broke one within first week. Other works great. Because wireless sound quality isnt greatest. I would go with wired.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1560556800000}
{"reviewTitle":"Doesn't fit","reviewDescription":"It does not fit into my system all the way","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"Totally Dedicated Unit?","reviewDescription":"Must be dedicated to Singing Machine boxes. Tried several boom boxes and CD players only one worked with this mic. The one that worked is vintage 1980 CD\/Boom box. Seems like this unit would be better as a Bluetooth capable system.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1481587200000}
{"reviewTitle":"cost is Cheap and Works cheap","reviewDescription":"The sound and distortion when the speaker is nearby is terrible. even at decent distance from the audio speaker, it still makes that distortion noise. This is totally for kids or one time use.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1506470400000}
{"reviewTitle":"Low audio output","reviewDescription":"I bought three of these but to my surprise the output of the vocals was terribly low for my karaoke machine.  I would not buy these again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1526774400000}
{"reviewTitle":"Pour quality sound","reviewDescription":"Pour quality sound, very narrow ranged where it works, if it is too close or far from my daughters mouth, ether you can’t hear her or it’s too loud and sounds scratchy…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1510704000000}
{"reviewTitle":"Poor Quality","reviewDescription":"Packaging was great and it arrived on time. The microphone however is much quieter than our other microphones. The volume for this mic has to be all the way up to put out as much sound as our other microphones at about 1\/3 max volume.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1374883200000}
{"reviewTitle":"Product did not come with 3.5mm adapter.","reviewDescription":"Sadly I ordered the product because the description claimed it came with a 3.5mm adapter, but the adapter isn't present on the SMM107.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Worst product","reviewDescription":"Not worth and need to change the battery every time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"does not work","reviewDescription":"I was testing the mic out today, and it does not work. I think I also got a mic someone sent back? the packaging didn’t look new at all. Looks and feels like a good mic, just doesn’t pick up sound","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"\"Singing Machine\" worst customer service team ever experienced","reviewDescription":"Worst Branding\/Customer Service team I have ever experienced! Note, DO NOT BUY THIS MICROPHONE UNLESS SPECIFICALLY USING IT FOR \"SINGING MACHINE\" MACHINE. The warranty does not cover anything but THEIR brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"No sirve","reviewDescription":"No es un Micrófono adaptable a nada le pongo mala calificación.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Buyers Beware!","reviewDescription":"*****DO NOT BUY IF YOU ARE NOT IN THE 48 STATES DUE TO WARRANTY ISSUES*****Used less than 10 times and the metal frame fell off. Not good quality.  I bought this not even 3 months ago and tried to see if it would be covered under warranty.  Customer service from Jackie Perez was not the greatest.  She made it seem we broke it and then said the broken are sold screwed on. Lol. Ummm no. No signs of screwing here.  Surprise surprise they won't entertain me because I am located in Hawaii.  So I can buy the products from here but I can't get a faulty product replaced. I couldn't even get it shipped to someone state side.  After asking for a manager or someone higher she came back to tell me she can make a 1 time exception to send it elsewhere with a $7  fee. The product is $9.99. Really!  I will not give this company another penny. Douses!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1613692800000}
{"reviewTitle":"Does not work","reviewDescription":"Bought it for Birthday of my daughter. And it does not work. I opened it after return period is over and now stuck with this garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"THE WEBSITE DESCRIPTION IS INCORRECT!  NO 3.5MM Adapter is included!","reviewDescription":"THE WEBSITE DESCRIPTION IS INCORRECT!  NO 3.5MM ADAPTER IS INCLUDED!!What's included:  Wireless Microphone  6.3mm Plug and Extra 3.5mm Adapter","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Cheap material","reviewDescription":"It's works but cheap material the receiver plug had broken easily apart when tooking out of the karaoke input mic port.i will not buy this again.only used this 5 times!.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Mic","reviewDescription":"Stopped working after 30 mins","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"I should like to return the microphone","reviewDescription":"I never even used the microphone as the PS3 system I had would only operate with two items. I should like to return the microphone.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1519776000000}
{"reviewTitle":"Poor quality","reviewDescription":"Hardly works, so returned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1591660800000}
{"reviewTitle":"Compatibility","reviewDescription":"I recently purchased two of these for my karaoke machine...however, you cannot use two wireless microphones on one machine, the sound will be distorted, it is not compatible...the one that we are using works well...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1361318400000}
{"reviewTitle":"If you use only one itself work and both together not work.","reviewDescription":"I bought two of this. I have the problem when I put two together. I heard the air sound when I turn it on for both. I used only one I could not hear it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1392076800000}
{"reviewTitle":"Distance at best is about 5 ft.","reviewDescription":"Don't work well. Went with another.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581206400000}
{"reviewTitle":"it looks like fit the family sound speaker","reviewDescription":"After read the topic, it looks like fit the family sound speaker. But it's not. Maybe it gona fit the professional sound system, I don't know. Returned","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1505347200000}
{"reviewTitle":"ONLY GOT 3  MONTHS USE","reviewDescription":"DIDN'T HOLD UP VERY LONG IT HAD BAD SOUND EFFECT FOR SOME REASON.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1552348800000}
{"reviewTitle":"It doesn't make your singing sound better ,so if you suck  you will just suck louder","reviewDescription":"Works well, cord is a nuisance though if you like to move around.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1554595200000}
{"reviewTitle":"Defective","reviewDescription":"It doesn't work when I plug it in any of the radios in my house.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1546560000000}
{"reviewTitle":"Kids toy!","reviewDescription":"Cheap!Stop working 5 months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580515200000}
{"reviewTitle":"No es muy sensiblle","reviewDescription":"No es muy sensible, crea mucha interferencia","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1643241600000}
{"reviewTitle":"It is good.","reviewDescription":"To sing karaoke in home with friens it is pretty good. Good sound for a nice price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1582329600000}
{"reviewTitle":"Karaoke mic","reviewDescription":"Great replacement karaoke mic. Sound is great and good quality","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"Good sound quality.","reviewDescription":"Good sound quality but it could be better if it has longer cord.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599868800000}
{"reviewTitle":"Nice for money","reviewDescription":"Have it attached to my karoake machine.  Not too powerful, but it works fine for what its use is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1562889600000}
{"reviewTitle":"You get what you pay for. THIS IS not a professional machine.","reviewDescription":"Sound quality is okay for kids.  Adults probably would be unsatisfied. Make sure you order an extra microphone so you don't have WWIII. It's a fun, lightweight easy to move machine. The best part is the \"light show\" that coordinates to your singing!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1481241600000}
{"reviewTitle":"Great for the price!!","reviewDescription":"I bought this for an event to hook up to my 80-watt speaker and it did very well! Has pretty good range and quality for the price. I would highly recomend. This isn't usually a brand I would buy so this was a pleasant suprise!​","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1499472000000}
{"reviewTitle":"Works great","reviewDescription":"Was skeptical all after reading other reviews, but the thing works fine. Had no issues with the battery compartment like other people have had.When switched on there is a slight buzzing sound, but once you start playing songs to sing along with, you don't notice it.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1490400000000}
{"reviewTitle":"Decent product for the price","reviewDescription":"I have gone through a few of these (I use one daily at work). They are inexpensive and they work well, but they don't last very long. But the price is good!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1515283200000}
{"reviewTitle":"Decent Little Mic for the Price","reviewDescription":"There's some distortion and feedback (more so than with the microphone that came with the Karaoke machine). But for the price, it's not a bad little mic.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1531353600000}
{"reviewTitle":"Economy microphone","reviewDescription":"This is the second one of these microphones that I've bought. I picked up one (same brand\/model) last month at one of the local big box stores and it worked well enough that we wanted another one. We're not using them with a Singing Machine karaoke system, but rather a Pyle Home PT270AIU 300-Watt Stereo Receiver, which has two microphone inputs and allows you to sing\/talk over whatever is playing. The two mics work reasonably well - given the system we're using them with. And considering these microphones themselves are pretty budget priced compared to professional grade equipment. Still, they are more than adequate since we're just playing around at home.I like that the cords are ten feet long, that means we don't have to use extension cords. One thing that I might note, these mics are unidirectional, but you really need to hold the microphone close to your mouth and (this is important) sing\/talk directly into the top of the microphone. The design of the mic inside the head is such that sounds coming into the sides doesn't reach the microphone (I unscrewed the head off one and discovered that).All-in-all, these are decent enough given what they are selling for. I'm happy with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"20 people found this helpful","country":"United States","date":1489190400000}
{"reviewTitle":"Not loud enough","reviewDescription":"It serves its purpose, however, it’s not loud enough.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Great extra min if neede","reviewDescription":"Sound ok extra mic when needed. B++","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Muy buen producto a un precio bajo","reviewDescription":"Buen sonido y recepcion","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Decent microphone for kids to play with or for karaoke.  Pretty good sound.  Takes AAA batteries.","reviewDescription":"The 1\/4 inch jack is a nice feature because you can easily plug it into a lot of professional equipment without having to use an adapter.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"A Satisfactory Karaoke Mic","reviewDescription":"I decided to rig up a karaoke system using some karaoke software and an old pc, but of course i needed microphones. Most importantly, these look right- this is what you want to be holding when you are singing. They sound good enough for karaoke use, but only when i ran them through a USB mic adapter. When i was running them through a mic\/line in port, the volume was very low and it was very hard to balance it with the music. That's why I'm docking them one star. On the other hand, most computers would only have 1 mic port anyway, so if you want to sing with a partner you're better off getting a pair of cheap, identical, usb to mic adapters. The build quality was pretty decent and very important, they come with a 3.5mm adapter so you can connect them to most computer equipment as it uses that TRS size (its native 1\/4 inch or 6.5mm). So if you want to sing karaoke at home, buy a pair of these and if you're looking to hook them up to a PC don't forget 2 cheap usb sound adapters. They're definitely worth the investment.","isVerified":true,"ratingScore":4,"reviewReaction":"95 people found this helpful","country":"United States","date":1343865600000}
{"reviewTitle":"Funciona bien","reviewDescription":"Es un micrófono básico si quieres jugar con tus amigos al karaoke o algo de hogar, no es profesional","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Know what you are getting","reviewDescription":"They work fine for what they are and what they cost. I wouldn't use them at a karaoke gig, with drunks handling them. They wouldn't hold up. At home use where you can control the amount of abuse they take and don't expect \"professional sound\" they work, they do the job.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1655424000000}
{"reviewTitle":"SLAYED","reviewDescription":"me n my friends SLAYED on this microphone.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1681862400000}
{"reviewTitle":"excellent for the price of just $30! Can't go wrong at this price!","reviewDescription":"Excellent for the price of just $30 bucks. You can't go wrong. I'm still figuring it out completely using the karaoke apps and recording the video when singing etc. Some songs we seem to get a feedback from speakers and or mic, not sure exactly why. Volume of song would have to be turned down to eliminate feedback. Mic cords only go so far away so it wasn't that. I adjusted the knobs and manage to fix it. I really love it , it's a great gift for my 8 year old daughters bday party. The girls all had a blast, and it was afforable fun! By the way this comes with 2 mics!!! I bought an extra mic thinking it only had 1 because it only pictured 1 even though description said 2., so I have an extra now for the keyboard lol!","isVerified":true,"ratingScore":4,"reviewReaction":"21 people found this helpful","country":"United States","date":1448150400000}
{"reviewTitle":"Es un aparato económico","reviewDescription":"Debo decir que esperaba más potencia en el micrófono pero a la hora de probarlo tienes que pegartelo a la boca si quieres escuchar algo de lo quendices.. Claro que por el precio me imagino que es lo que hay..... 2*","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Would not recommend","reviewDescription":"The quality of the output is very low.  The size is perfect and easy to use but the sound quality is poor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Wire attached for signal","reviewDescription":"The signal wire fell off?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Battery life","reviewDescription":"Nice sound but you have to change to new AAA batteries every couple of hours ..NOT WORTH IT","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Unit came with dead battery","reviewDescription":"This unit came with a dead battery. Company would not replace the battery and sending it back wasn't worth the hassle. Had to spend an additional 26 bucks on a battery. Overall the machine sounds great and the features are worth the price of the machine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670803200000}
{"reviewTitle":"Works at first but wont last long","reviewDescription":"I've ordered about 3 or 4 of these microphones now and I can confidently say that they are poor quality.  They simply do not last.  I get about 4 months of usage before they start shorting out and eventually stop working altogether.  The price is affordable and they work well in the beginning but I have been unable to get one to last beyond 6 months. The most frustrating part is you dont realize they are failing until youre in the middle of using them...which you can imagine is quite a pain if you have friends over for a karaoke session. Maybe spend a little more and save yourself the hassle and embarrassment.","isVerified":true,"ratingScore":2,"reviewReaction":"42 people found this helpful","country":"United States","date":1498521600000}
{"reviewTitle":"I'll update when I get an asap","reviewDescription":"This seemed like the most perfect gift for my six year old who asked for a real microphone for Christmas. She didn't want anything with any color because she said it was for kids. Lol. At first look, its perfect and exactly what i was looking for, but the problem is this....the the part that connects to a speaker is huge!  It won't plug into any kind of speaker. It has to be a giant amp. Definitely not what i was looking for. I'm going to have to find an adapter before it can be used, after I do, I'll update my review.","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1613606400000}
{"reviewTitle":"Drains batteries","reviewDescription":"Sounds okay but what it’s concerning is that it drains the batteries. I’ve installed new batteries and within an hours or so it completely drains the batteries. I’ve used it twice and it did the same thing each time.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Updates","reviewDescription":"Good regular size, easy to use just put batteries and turn it ON and ready to sing.  Great product and very fast shipping, and very good price.  Thank you very much.One or 2 song I sing and stop, I thought its just the Batteries because I only put in the Batteries I already in hand, so I bought new Batteries hoping that is the only problem, but when I put new Batteries still not working, receiver not even lite up, I don't know what is going on, but I'm so disappointed 😥","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1638403200000}
{"reviewTitle":"Inferior Sound Quality","reviewDescription":"I turned up the volume on my amp but the mic output is still low, you will need to put your mouth very very close to to the mic get the volume up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Next to Zero Sound Quality","reviewDescription":"For having a 5- and a 3-year old, I should be grateful this microphone doesn’t work. However, it causes a bit of a kerfuffle when one daughter has a working mic (that the singing machine provided) and the other doesn’t. A solid two-star review for creating more fights in my home.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1591488000000}
{"reviewTitle":"Vino defectuoso","reviewDescription":"Se ve que es un artículo que devolvieron con anterioridad","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"Great value for Low end gear","reviewDescription":"Has a range of about 4 feetStrong sporadic staticHowever the sound quality when it is close to the transmitter is not too bad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655683200000}
{"reviewTitle":"Can only use 1 at a time","reviewDescription":"This microphone has a good quality sound and easy to use, however you can only use 1.  I purchased 2 and was unable to use them at the same time because they operate on the same channel.  No where did it state this in the product description.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1642982400000}
{"reviewTitle":"It worked great 1st time.","reviewDescription":"Worked great the 1st time .. 2nd time we used it for karaoke and nopeeee... started to turn off and on..🤷‍♀️It should last a little more for the price. . But not too expensive I guess","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635724800000}
{"reviewTitle":"Not working rite","reviewDescription":"Don't like it..can't get it to act rite","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"USES AAA | Can only use one at a time.","reviewDescription":"The product info says 9v batteries, but mine needed AAA batteries. Also, I bought two for my karaoke setup, but I can only use one per machine. Not happy.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1643760000000}
{"reviewTitle":"Not a good buy","reviewDescription":"It kept making loud screaming sounds","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"It's not really durable.","reviewDescription":"My 12-year-old daughter accidentally stepped on it, and it bent immediately and the inner electronics at the top broke.  As long as you don't drop it, or bump it, or buy it for kids, it should be okay... I would not recommend this product based on my issues.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1549324800000}
{"reviewTitle":"You have to hold it against your mouth for it to work.","reviewDescription":"You can't even hold it a half inch from your mouth and have it work. It has to be right up against your lips.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641772800000}
{"reviewTitle":"Mic with output","reviewDescription":"This directional microphone does pick up decent sound only if you speak into the top.  It is does not pick sound that is far away or ambient sound, which is good.  It is only bad for the singer who speaks into the side of the microphone.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1402012800000}
{"reviewTitle":"Nice unit lots of fun","reviewDescription":"Not as loud as expected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1611532800000}
{"reviewTitle":"Strong Chemical Smell","reviewDescription":"The mic itself works very well. The reason it's getting 4 stars is because it has a strong chemical smell. It's been 5 days since I took it out of the packaging and it still has that strong chemical smell. I'm hoping the smell goes away.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1461456000000}
{"reviewTitle":"Good","reviewDescription":"Very good for the price!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610409600000}
{"reviewTitle":"Sing your great out!","reviewDescription":"Just what we were looking for! Works eighth my daughter's kateoke machine, sturdy material.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1574380800000}
{"reviewTitle":"but not that good for recording","reviewDescription":"You get what you pay for. It's okay for singing, but not that good for recording. The tone quality is lower than I expected. If you just want to sing for fun, this is the right thing in consideration of the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1435795200000}
{"reviewTitle":"Priced correctly. Good product","reviewDescription":"Cost is good for this product. Not professional grade but great for children or teenagers","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1569283200000}
{"reviewTitle":"Great Product","reviewDescription":"This microphone sounds great and works from really far away! the sound quality is good. It even works with my casio keyboard which is a plus. The only thing is the design makes it hard to put the batteries in the microphone itself and it must be screwed on just right or it wont stay shut. Otherwise I love it!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1311379200000}
{"reviewTitle":"Gotta Have For Kid’s Karaoke","reviewDescription":"Bought to use with a children’s Karaoke machine. It makes their mother nuts! We like it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1559520000000}
{"reviewTitle":"Great!","reviewDescription":"Great quality, cord length is great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1592265600000}
{"reviewTitle":"Using both them","reviewDescription":"You can't sing thru both them at same time","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1682553600000}
{"reviewTitle":"I fgeel like I should wear a white glove accessroized with rhinestones, when I use this.","reviewDescription":"My voice sounds like an anthem of cherubs and angels singing \"Ave Maria\" when I speak into this microphone. I feel like Andrea Botticelli when I use this microphone.  :::pinches fingers in Italian:::","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1655769600000}
{"reviewTitle":"Also disappointed in the flimsiness of the switch- which doesn't always ...","reviewDescription":"Seems to cut out some. I can see the other complaints about the flimsy cap on the bottom of the microphone- it is a little bit of a challenge to get the cap screwed on right and have the battery seated well. Also disappointed in the flimsiness of the switch- which doesn't always turn off completely (and that would be a problem with rapidly draining battery). Mostly connects and works well, but it isn't always perfect and doesn't seem as loud working with the Singing Machine as the wired microphone. Still, it is good to not have little girls tripping over wires and pulling machine off the counter!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1483056000000}
{"reviewTitle":"Good for price","reviewDescription":"The piece that connects to the speaker is pretty fragile and cheaply made so be diligent with it. Other than that, mic works great. Good product for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1655596800000}
{"reviewTitle":"Ok for the price","reviewDescription":"This is the 2nd one I buy.  Generally they work pretty good on a cheap Karaoke machine.  Good sound.  They both however have a defective screw on bottom for the 9 volt battery compartment to the microphone.  Others have complained about on reviews also.  It doesn't stay on, gets loose and cross threads and pops off.  Plan to Tape the bottom of the Microphone to prevent the problem.  If it weren't for that I would have given it a 5 star.  You also can only use one at a time on a dual microphone input machine.  Two of these together on the same machine interfere with each other.","isVerified":true,"ratingScore":4,"reviewReaction":"18 people found this helpful","country":"United States","date":1306108800000}
{"reviewTitle":"I ORDERED THIS MICROPHONE TO REPLACE ONE THAT I HAD ...","reviewDescription":"I ORDERED THIS MICROPHONE TO REPLACE ONE THAT I HAD LOST. I MUST ADMIT, I DID NOT OPEN THE BOX FOR ABOUT 3 WEEKS BECAUSE I WAS ON VACATION AND HAD FORGOTTEN ABOUT IT. WHEN MY 11 YEAR GRANDAUGHTER CAME OVER LAST WEEK, SHE OPENED THE BOX AND WITHIN 2 HOURS THE MICROPHONE DIDNT WORK. WHEN WE UNSCREWED THE TOP, THERE WERE WIRES THAT WERE BROKEN. I AM HIGHLY DISAPOINTED RIGHT NOW. UNFORTUNATELY, I THREW THE BOX AWAY WITH ALL PAPERWORK INSIDE. WISH I COULD GET A REPLACEMENT BUT I DOUBT THEY WILL DO IT WITHOUT THE PAPERWORK.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1428969600000}
{"reviewTitle":"El sonido","reviewDescription":"Por el momento muy bueno","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652054400000}
{"reviewTitle":"Good quality for family with 0.1% talent and a karoke system","reviewDescription":"Not going to get into too much details as this thing is a HIT right out of the box. Doesn't matter how much you paid for this.I bought this using the 'Used' feature @ amazon and I don't know WHY I didn't buy other used items. Its pretty much NEW. The packing, the quality, the feel.Buy it and don't leave yourself with 1 mic that comes standard with Karoke system.PS - I bought this to tag along with Memorex MKS-SS@ sinstand 2Home (which I bought USED also).","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1394150400000}
{"reviewTitle":"Professional  look","reviewDescription":"Light weightProfessional  lookNot like those you buy at wallmart.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639872000000}
{"reviewTitle":"So far so good! I have a karoke singing machine for my ...","reviewDescription":"So far so good! I have a karoke singing machine for my grandkids. I ordered the wireless because they didn't like being leashed to it, they love the idea of not being leashed. It would be nice to have 2 like that but from other reviews you can't use 2 wireless because of feedback. Now if I may add I also replaced the corded mic and the cord broke within two weeks of using. It breaks right at the base where the cord drops down from the end of the mic. Unfortunately, the corded mic is NOT returnable!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1479772800000}
{"reviewTitle":"The sound is weak","reviewDescription":"Doesn't seem to pick up sound very well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"Mic doesn't stay closed","reviewDescription":"I gave one star because I couldn't give none. I ordered the mic about 2-3 weeks ago and opened it a few days ago. I got the batteries it needed, put them in, and thought I would be on my way singing. Turns out, the cover for the part that I put in the batteries, doesnt stay closed. It's so flimsy. It doesn't stay closed and is therefore uncomfortable to hold. I don't know how it sounds or anything about the functionality because I never got to check it out. Poor product. Don't waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1427932800000}
{"reviewTitle":"Save your $$$","reviewDescription":"I thought this was going to be a good mic for our our Street Outreach portable sound box. But the quality wasn't enough so really anyone could hear me using it. So I ordered a better quality mic that came with 2 for about $18 on here that is such better quality then this.Save your $$$ and get a better quality mic","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1477094400000}
{"reviewTitle":"Spend more money buying a better Mic than this one","reviewDescription":"The sound quality is not great, not even for speaking, and you really have to speak at a certain angle and with your lips over the microphone for it to transmit your voice.Its cheap, and you get a cheap Mic. I'm using it but not enjoying it.I wouldn't recommend it for karaoke signing at home parties and would say its better to spend more money and get a better one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1417392000000}
{"reviewTitle":"Works but clunky","reviewDescription":"The receiver Sticks out from the speaker too far so I’m on my third one. Not to self “don’t move speaker with receiver plugged in.” Can’t use more than one mic on same receiver. Bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594425600000}
{"reviewTitle":"back ground music stops if you are too loud","reviewDescription":"I bought this for karaoke but it doesn't work for that, once you get loud the music ( noise) goes quiet, so only your voices heard.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Feedback was 👎🏽","reviewDescription":"Too much feedback","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"Sound quality","reviewDescription":"Used on multiple applications and sound is still faint with mic volume turned up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648512000000}
{"reviewTitle":"Do better","reviewDescription":"Cord length as describe. Had to almost put it in my mouth to hey any sound out of it. Waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1599523200000}
{"reviewTitle":"Sound quality isn’t great","reviewDescription":"The sound quality of this product is very subpar, I guess if you want something cheap for one time use this might be okay but not great","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611273600000}
{"reviewTitle":"Great cheap option with a full size plug and converter to small plug","reviewDescription":"Got this to use with a Samsung Gigaworks party system so my girls could sing along to their favorite music. For the price I am impressed with the weight and feel of it. The cord is also a great length to allow them to move around while singing and dancing. The only complaint I have is the on\/off button feels very flimsy and not sure how long it will last until it won't turn off or on but for now after a few months it is still going strong!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1598486400000}
{"reviewTitle":"Cord is inconvenient","reviewDescription":"Good value for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Mic's great but I sound like crap","reviewDescription":"Mic works great. I do not. I will not return the mic. Might ask to return myself to the gene pool cause I clearly lost","isVerified":true,"ratingScore":4,"reviewReaction":"22 people found this helpful","country":"United States","date":1660694400000}
{"reviewTitle":"Microphone you need","reviewDescription":"My one issue...  I didn't read that it does not come with batteries. I really wish it did come with batteries. That being said, the sound on it is actually very good. My 2 yr old and I have a lot of fun with the karaoke machine now.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"I bought this one because it was seven dollars and had good reviews, so I was like what the heck","reviewDescription":"I was looking for a mic that I could use for singing, podcasts, etc. I bought this one because it was seven dollars and had good reviews, so I was like what the heck. When it came to me it came with the microphone and it also came with an adapter. I opened the mic and used it. I loved it. I bought 3 other mics from a higher price and this is my favorite one. The sound quality is not the best but it's really good for 7 dollars. I recommend this mic for anyone who is looking for a mic on a low budget.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1486425600000}
{"reviewTitle":"Does not go with step on piano!","reviewDescription":"Amazon said this microphone went with this step on piano but it doesn't even fit! Thank goodness I have karaoke machine that needed another microphone!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Karaoke night","reviewDescription":"Nice microphone but sounds could’ve been better. Still worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"Good value for its price","reviewDescription":"This is about as simple as you can get with microphones. However, for this price I think it is a good deal. The microphone worked well as expected and had no distorted sound or white noise whenever it was being used.I purchased two of these microphones for my parents so they could sing karaoke. Additionally, I purchased this product to join both of the microphones into one amplifier: https:\/\/www.amazon.com\/gp\/product\/B000068O53?ref_=cm_cr_ryp_prd_ttl_sol_5&pldnSite=1.Everything worked very well, in this situation both of the microphones had to be on at the same time in order for either of them to work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1483142400000}
{"reviewTitle":"Not what was shown","reviewDescription":"Not what was shown the receiver was very very different didn’t require weird battery over all 4 stars maybe update you’re photos Amazon","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Belting em out!","reviewDescription":"Liked it. Family got me this for my bd knowing how I like to belt out some Vintage Bowie and Atlantic Rhythm Section. Well they've empowered me to branch out and diversify...Heatwave,  Stevie Wonder and Grand Funk Railroad.  Might have backfired on em. Can't stop,  won't stop. Great system too.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1610150400000}
{"reviewTitle":"Buyer beware","reviewDescription":"I hate it. It has to be so close to your mouth so you can actually be heard. The adjusting extra piese that connects to our home theater got stuck and i had to throw out my home theater because it couldn't be taken out. So I could not hear movies anymore.Would not recommend at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1586736000000}
{"reviewTitle":"I do not understand","reviewDescription":"I asked for tempered Because I thought it arrived damaged, but it didn't work for me either, I tried it on several computers and piano and nothing.  it's like it's damaged.  I do not understand.  I still have it every time I can, I try it and nothing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1601683200000}
{"reviewTitle":"Stopped working","reviewDescription":"This mic just stopped working today. Unfortunately this was 3 days after the last day to return the product.  I have replaced the batteries with brand new one and it still does not work.  I’m so disappointed.  I’m a teacher and bought this for my classroom.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1633910400000}
{"reviewTitle":"Works awful. Plugged in to a party machine for ...","reviewDescription":"Works awful. Plugged in to a party machine for my kids to sing along and goof around and it works half of the time. It'll come on for a little while, I'll switch to off on the microphone and it'll still work, and when I switch to on then it doesn't. I know it's a cheap mic, but c'mon man. It's a microphone - it can't be that hard to have it work properly. Not worth even trying to send it back. In the landfill now.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1483056000000}
{"reviewTitle":"The Microphone is Garbage","reviewDescription":"This microphone is garbage..literally, it's in the garbage can. I should have listened to the other negative reviews. Our sons used this microphone with our karaoke machine about 3 times with no problem. We plugged it in last night, and it had stopped working. I took the thing apart, trying to diagnose the problem. It seems like the wiring, soldering, and overall craftsmanship are lacking. Don't count on this microphone working more than a few times before you have to throw it in the garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1484697600000}
{"reviewTitle":"Horrible quality - buyer beware!","reviewDescription":"These are horrible quality! We bought two to replace the one that came with our Singing Machine karaoke unit we got our daughter for Christmas. The original microphone stopped working on Christmas day. I bought these as a replacement for that one. One of them lasted about a week. The other one maybe 2-2.5? My kids have not been rough with these (especially the second set--I was very careful to outline how gentle we needed to be with them!).","isVerified":true,"ratingScore":1,"reviewReaction":"79 people found this helpful","country":"United States","date":1517788800000}
{"reviewTitle":"Very disappointed!!","reviewDescription":"This is my 2nd purchase of this microphone. The first one worked great and survived lots of saliva & falls from my toddler\/pre schooler over the last few years, but alas it was beginning to quit so we decided to get another. Unfortunately the new mic didn't work at all!! My little ones were so very disappointed :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1569196800000}
{"reviewTitle":"Good for a few days only","reviewDescription":"I ordered this microphone and after using it mildly it stopped working. I'm an adult and this has not been used by a child nor anyone else. I ordered a new one and after 3 weeks it stopped working. And I used it very little. Not worth the price at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"Doesn’t work well!","reviewDescription":"I am so disappointed. Wish I could have returned but it was inconvenient based on my location. I bought one before and it so good. Decide to get another for my son kareoke but the quality is poor. Doesn’t pick up unless you hold wire next to mic and it’s muffled. It’s just sitting there. I also bought a coded mic, thank God as an autistic child could  be frustrated with that.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1546128000000}
{"reviewTitle":"Sound quality poor","reviewDescription":"Sound quiality poor","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Ok product, but you can do better.","reviewDescription":"Takes AAA batteries, not 9V as advertised. Drains batteries FAST.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1651622400000}
{"reviewTitle":"On\/Off switch static noises","reviewDescription":"This is an ok mic but there is a problem with the switch on\/off design. When it was new the mic performed well but after about 6 months, the on\/off switch became lose and when I touched the switch it made a lot of static noises. The built quality is not that good.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1449360000000}
{"reviewTitle":"Not best quality","reviewDescription":"After 2 or 3 uses the button to turn it on stop staying and just slips to off. The sound is ok for what we paid I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579219200000}
{"reviewTitle":"Wireless mic","reviewDescription":"Works good but isn’t as loud as a cord mic and I purchased 2 of these and found out u can’t have 2 on one machine the both won’t work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1573603200000}
{"reviewTitle":"Is use or new the package was open","reviewDescription":"Bottom package was open I think is used","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"It worked for a while about a year, it ...","reviewDescription":"It worked for a while about a year, it has short in the cable. These kind of microphones once the cables wear out, they are trash. Now that I have learned more about Microphones, I will only buy microphones that have replaceable cables.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1515888000000}
{"reviewTitle":"Not compatible","reviewDescription":"It does not work with my Ion portable karaoke machine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621382400000}
{"reviewTitle":"Low volume","reviewDescription":"Low volume you will have to increase speaker volume to max","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618185600000}
{"reviewTitle":"Sound quality is not good","reviewDescription":"Sound quality is not good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610236800000}
{"reviewTitle":"Works great in a pinch","reviewDescription":"Needed a microphone for a last minute  karaoke party. This one worked well, for the price I paid.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579478400000}
{"reviewTitle":"Major quality control problems","reviewDescription":"Purchased this mic for use with a karaoke player. It was a replacement for two identical ones that broke after about a year of use. This one broke within days of little use. So it's tempting to give this only one or two stars because of the horrible quality control.That being said, there are a number of cheap mics similar to this on the market and some of those break after light use as well. I suppose if you consider this a \"disposable\" mic, it's not a bad deal. You may even get one that lasts for a year or more, in which case it's a great deal. Personally, I'm tired of wasting money on this brand and wouldn't recommend it unless you had no other choice of mic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1451347200000}
{"reviewTitle":"Good, not great","reviewDescription":"Bought for Singing Machine that I bought at costco. Mics work good, however when not in use, there is a lot of static. Best to put mic in standby mode between songs.  Not sure what that's about or how to fix it. Sound quality is better than wired mics it came with. I did buy a different brand at first, and it was a worse quality mic. I haven't had the same issues that other reviewers claim, so at least there's that. For the price, it's a good microphone. It does take 2 9 volts per microphone, in case you get multiple.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1624406400000}
{"reviewTitle":"Just ok","reviewDescription":"I don't know what other reviewers found so amazing about this microphone... My daughter is really into karaoke singing, and I decided to get her a \"better\" microphone. I read all the good reviews on this one, stating that it was \"not a cheapie\", \"much better than the one that came with the karaoke machine\", and  \"definitely not a toy microphone\"... Unfortunately, I found it to be ALL of those things. It is just as bad as the original one from our karaoke machine. You have to literally hold it directly pointed at your mouth at no more than 1\/2 and inch away - otherwise, it does not pick up your voice. A little disappointed, but, for the price - I was foolish to expect anything more.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1399075200000}
{"reviewTitle":"Mic check","reviewDescription":"Very good price. If you have a lot of people talking no one will hear you. The microphone is low even after adjusting the volume. If it’s for kids or parties\/karaoke with a small group it would work good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"Does not work when plugged into other devices!","reviewDescription":"This microphone didn't pick up any sound when testing it on my devices. Typically only works for the karaoke machine it is made for, don't fall for the YouTube videos and people who use it for other devices. I called Singing Machine customer support and they said some microphones will work for other devices, some won't. The one I received started to play music OUT from the microphone. Only use this for the Singing Machine. Great Amazon customer service, ended up returning.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"I would just say that it broke many times and if I were you, get a better quality microphone.","reviewDescription":"In the beginning it was ok, the sound was fine, but I had to buy so many of these that I maybe used one for three or two weeks then it stopped projecting the sound. Then I couldn't use it. I just think that it was kinda a pain to keep buying it a lot so I would recommend to get a more high quality microphone for karaoke.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1573948800000}
{"reviewTitle":"Mic check one two one two","reviewDescription":"Dropped it and it broke.  Thought it should be better, but who knows.  Just one of those things.  Worked well before the mic drop.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649030400000}
{"reviewTitle":"Stopped working after a few years","reviewDescription":"I've ordered two of these for singing karaoke. Worked great at first, but the first one stopped working after about a year. Ordered another one and it stopped working after two years. I only used about 10 times a year and took great care of them.  I'll be buying something of higher quality next time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1603065600000}
{"reviewTitle":"Wash mesh head before using!!!","reviewDescription":"Beware to all. Gave the two that we bought to the kids. Next look at them found they had black all over their mouth area. Appears the actual wire web mike cover piece has either grease or some other black substance on them both. We unscrewed the mesh cover & washed with soap - inside & out. Then dried - inside & out before screwing back on. This seems to take care of the problem. As they were in sealed packaging, it was a shock. Otherwise, they work as expected. Lower star score due to this mishap.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1450915200000}
{"reviewTitle":"Low sound quality","reviewDescription":"The mic cord is long enough. The sound is super low. If you are trying to get your voice heard this is not the best mic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642636800000}
{"reviewTitle":"... bought many of these and at first they were great. They would work for a solid karaoke night","reviewDescription":"I have bought many of these and at first they were great. They would work for a solid karaoke night. But inevitably they would break, one by one. The problem is a design flaw that creates stress on the ground wire solder point. Sometimes even just the smallest amount of pulling on the cord that is attached to the base of the mic will create tension and pull that soldered wire free. You will then unscrew the top and sure enough, the circuit would be broke. I think I had bought about 4 of these over the course of about 2 - 4 months and I even resoldered a couple of them, which gave me a few more nights worth of use out of them. But them I found a different option on Amazon that added about 4 dollars to the price but over a year worth of work. As such, I really cannot recommend these at all.","isVerified":true,"ratingScore":1,"reviewReaction":"161 people found this helpful","country":"United States","date":1538006400000}
{"reviewTitle":"Inaccurate description","reviewDescription":"The product description says that it comes with an adapter for 3.5mm, but upon opening the package, the adapter is not included. If your setup requires a 3.5mm plug, consider another microphone.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Missing adapter that says is included","reviewDescription":"Listing states What's included:Wireless Microphone6.3mm Plug and Extra 3.5mm AdapterOurs was delivered without the 3.5mm adapter","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Breaks easily","reviewDescription":"This is the 2nd one I bought. I used it occasionally for about a year. It just stopped working one day. I never dropped it. The 1st one was decent and lasted several years and broke when I dropped it, so I thought I'd buy the same one to replace it. Now, I wish I'd bought a different brand. Too bad the Sony microphone I like is discontinued.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Trash","reviewDescription":"The mic doesn’t work at all. I followed all instructions, making sure new batteries were placed in the microphone and receiver, plugged the receiver in before turning it on, set the volume accordingly, and nothing happens. I’d give zero stars if I could. We already threw all the packaging away b\/c my son was so excited for his own mic to sing with.Update: I realized the top part of the mic screwed on and off as well, I opened it and found that both the little wires were broken off so there’s no connection. This seller sent me a used, broken microphone.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Easily breaks when removed from outlet","reviewDescription":"The microphone broke after 2 uses.  It was an ok sounding microphone for our needs.  The adapter that plugs into the Karaoke machine broke on the second use.  When it was pulled out the end of the adapter stayed in the machine.  Now, I can no longer use the karaoke machine with a microphone that has a male end to the adapter.I am very frustrated that I can no longer return this item.  It was purchased in October of 2023.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Doesn't turn on!","reviewDescription":"The microphone doesn't turn on. The wires look damaged.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715040000000}
{"reviewTitle":"WIFI Module Broke after 1st time using","reviewDescription":"Ordered this and used it once, when I went to pull the wifi jack out of my karaoke machine the end of it came and stayed in machine. Now I have no mic or wifi housing I can use cause it's blocked...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Dissatisfied","reviewDescription":"Arrived on time, very low quality sound. Not impressed at all","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"DO NOT BUY - short life, low sound quality, short range for a wireless, static","reviewDescription":"We got the microphone and right out of the box the first one was defective - the battery would not fit into the slot of the microphone base at all and it would not screw together.  This product requires a 9 volt for the microphone and another 9 volt for the jack\/wireless sending unit.  After contacting the company was able to get a replacement.  The new mic worked but it had static and a short range for wireless - not much longer than the corded unit.  It also does NOT fit into the microphone holder on the machine which is mind boggling since it is a singing maching mic!  It only worked for a couple times.  We don't use our machine very often so we just got it out and put fresh new batteries in it and the mic won't work at all - I think we only used it 2 or 3 times.  I will not be buying another one.  I'll go back to the wired mic that fits into the holder, has a much better sound and lasts longer than just a few plays.  How disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1548547200000}
{"reviewTitle":"Karaoke","reviewDescription":"Cannot wait to give this to my granddaughter for her 4th birthday in November. Good for the money. Totally made of plastic which is a little cheap looking but for a 4 year old it works fine. I did buy two better mikes from Amazon from the same company & they work much better than the original mike","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1443484800000}
{"reviewTitle":"I hear singing!","reviewDescription":"Dont know anything about mics but good sound volume, easy to use and sturdy. Use for kids karaoke.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607212800000}
{"reviewTitle":"like it","reviewDescription":"like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628208000000}
{"reviewTitle":"Great basic mic","reviewDescription":"I was looking for a new mic after the original mic that came with the machine had its performance suffer due to toddler drool. This mic is great. I'm not an audiophile by any means, but for a kid karaoke machine this thing is great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1522972800000}
{"reviewTitle":"really good sound quality","reviewDescription":"when you start singing you could hear it like 3 rooms away","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613088000000}
{"reviewTitle":"Great Mike. for the price","reviewDescription":"It’s a great Mike for the price  but I rather pay the extra money for a better mic it just feels like it’s a cheap  not professional but other than that it works fine .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1543968000000}
{"reviewTitle":"Put it 4 star to its comfortable and quick response customer serves","reviewDescription":"I bought it and want to connect with my computer speaker but it did not work. Put it 4 star to its comfortable and quick response customer serves. I knew would better fit a Karaoke machine after I purchase. The items I received is great  of its quality but just not the one that I need.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1478822400000}
{"reviewTitle":"Ok for price","reviewDescription":"You get what you pay for works so can't complain","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617321600000}
{"reviewTitle":"Great add on","reviewDescription":"Works great for a second mic","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620950400000}
{"reviewTitle":"These microphones are great. I've used them countless of times already to ...","reviewDescription":"These microphones are great. I've used them countless of times already to record some music. I do recommend you buy this to improve the quality of the sound. https:\/\/www.amazon.com\/dp\/B000KGYAYQ\/_encoding=UTF8?coliid=IWJXQ7PI290TI&colid=LUUMU3TV4X5G&psc=0Its a great product and will be even greater with that hardware. Highly recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1515024000000}
{"reviewTitle":"This is gross!","reviewDescription":"So this isn’t something I normally do, but... I bought this mic for my girlfriends daughter and what I received was an open package with dirt and hair in it.  I’m not quite sure if these are bonus items or if this was included with the purchase of the microphone. It would also appear that the packaged of this particular microphone was a smoker. There was also clearly a defect in the packaging machine that wasn’t caught in time so they had to repair the damage with tape. Unless you are interested in these bonus features, I would recommend buying from somewhere else.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1592524800000}
{"reviewTitle":"Cheap","reviewDescription":"Did not last very long, kinda kind of destroyed it rather quickly, poor quality low quality sound","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Don’t buy","reviewDescription":"For the price of this don’t buy it shorts and statics after a week of use","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Poor quality in the wire -- wire will break or is broken upon wire.","reviewDescription":"Giving one star because microphone arrived DOA.  The internal wire is broken at where it connects into the microphone and resulted in high amounts of popping and static when flexing the wire just one inch from the microphone.  The wire has to be bent just the right way (which is difficult when holding on to the microphone) to permit it to conduct the signal.  The build of the microphone is sold, with a large sliding on\/off button.  I would have given it 5 stars, but the broken wire ruined the experience.  The microphone's packaging caused the wire to be bent at an 80 degree angle, which probably contributed to the weakened wire and ultimate failure of the entire microphone.I would expect this kind of failure after regular usage, but not right out of the clam-shell packaging.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1359504000000}
{"reviewTitle":"Misleading Amazon Page","reviewDescription":"I was looking forward to recieve this but it was late, which I don't really mind. It gave me time to research and I found out that it didn't come with batteries. I read the Amazon page and it says this product requires 2 9V batteries. I dont't mind, I bought 2 9V batteries ahead of time and finally got the product. I was so excited to try it but turns out it has to be 4 AAA batteries. This page is misleading. I hope you fix this. This really put me off.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1661299200000}
{"reviewTitle":"Don’t waste your money!","reviewDescription":"Gave karaoke machine for Christmas present, flew to FL 12\/30 for 5.5 weeks, returned 2\/7 and opened box for the 1st time on 2\/11.  Has 2 mic ports, so I purchased a wireless Mike for the 2nd port.  Microphones both do not work, no sound from them despite turning to maximum volume.Disappointed to learn I cannot return a product when we just opened it.  Product purchased  12\/17, return date expiration 1\/31.22.Would love to have a karaoke machine with volume controls for both input and microphones.  This however, was a waste of money; my iphone works better than this device.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1644710400000}
{"reviewTitle":"2nd one and it doesn’t work with singing machine as described","reviewDescription":"2nd one and both do not work . I’m going to send them both back now . We have the singing machine and the description states that it’s compatible. It is not. All you hear is low humming and loud static. If you play with the cord like an old pair of headphones from the 80’s then it gives you a tiny bit of sound but both mics are faulty.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1633132800000}
{"reviewTitle":"1 mic out of 2 actually worked. Sound is not pro.","reviewDescription":"I was kinda impressed by all the reviews so I ordered two of these. After I received the package I tested them out. One of them worked, the other didn't work. Ok. I don't want to have to deal with shipping the other one back so I accepted that I payed for two mics and only able to use one. I've used the one that works a few times. It does produce sound, but the sound is not very warm, has no bass, not a natural sound. If you like to sing then you will be disappointed with this mic. If you need it just for announcements, you will sound kinda sucky but you will be heard. What can you expect from something this cheap? Lol. I don't recommend this product to anyone.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1456704000000}
{"reviewTitle":"Stopped working after a few uses!!!!!","reviewDescription":"This product was acceptable for the short time that it was usable, beside the fact that I think that I may have blown one of speakers during use. The mic was functional for a few uses only and now the return window has expired, so I'm stuck with a non functioning piece of equipment. I GIVE IT ONE STAR!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682121600000}
{"reviewTitle":"Poor Design","reviewDescription":"Sooo disappointed! I literally picked this item up off my door step 10 minutes ago. Opened the box, wrestled with the plastic for five minutes and attempted to install the 9v battery. The design requires you to put the rectangular battery upright in the circular opening of the end of the microphone. The cover then SCREWS into place while the battery housing is in a fixed position. It was nearly impossible to get the end cap on and just when I thought I had some traction in the treads I heard a crack and the switch which is located half way up the shaft of the microphone broke. I can only imagine that turning the cover against the fixed battery position put pressure on the innards of the microphone causing it to snap. Not Cool!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1489363200000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"Product was inop, when connect you could hear sound coming from speaker but not loud enough to be audible, tried multiple devices to insure it wasn’t user error. It was s gift and by the time it was opened the return date had passed so we are stuck with it. Spend your money on a higher quality product!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1562889600000}
{"reviewTitle":"No voice detected while plugged in. (I tried on 3 individual devices)","reviewDescription":"I followed all steps on the user manual, but it still not detecting any sound. I tried it on my Business PC, Home PC, and laptop (with a 3.5mm to 6.35mm transporter). None of them detect any sound from this mic. It is light weight and good looking, but the quality and the using experience is awful to me.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1642723200000}
{"reviewTitle":"This Microphone barley works. You have to put your mouth way too close for it to produce any sound.","reviewDescription":"Exactly what I said in the title, you have to put your mouth way too close for it to even work. Spend a little more and you will probably get a way better experience. Exactly what you get for $8 a cheap toy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1652400000000}
{"reviewTitle":"Nope","reviewDescription":"Plugged into a karaoke machine. From beginning sound wasn’t that  great then it quit working all together. Took it apart and the wires had come apart (not soldered on well enough?) times span from date of use -Christmas Day to last week of January. Junk. Waste of money, waste of resources","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1581379200000}
{"reviewTitle":"It doesn’t work","reviewDescription":"I purchased this product and it worked for the first 2 hours, then literally stopped working. Such a waste of money smhIt went from working, to cutting in and out of functioning, to completely dead - with new batteries in place on the device.Don’t waste your money. I’m sure mad I did","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1635292800000}
{"reviewTitle":"Stay away.","reviewDescription":"This thing sucks. It doesn't pick up any sound. The only way I could get the thing to record ANYTHING was by hitting it with the palm of my hand as hard as I could while it was recording. Even then, I could barely hear the sound in the playback. Stay away.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1576540800000}
{"reviewTitle":"does not work","reviewDescription":"does not turn on and I had a event and feel like I wasted money but it ok because I guess you get what u pay for","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"ratings are deceptive","reviewDescription":"Received this mic a few months ago, wanted to use it with kids. It had a very unpleasant chemical smell when opening, it still smells bad today.Also I can't do anything with this mic I've tried to plug it into my sound interface and turned up the gain to max but can't hear a sound. Tried another interface and same thing, no sound.4 stars really? Better spend twice the money somewhere else for something that has more quality control.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1470355200000}
{"reviewTitle":"Garbage","reviewDescription":"Didn't work. returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working in Less than a month. I put new batteries and still doesn't turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Works, sometimes","reviewDescription":"First off in today's world I don't know why it does not have a rechargeable battery built in, you need to replace the battery. Second of all it was not always work like if you're not facing the antenna towards the receptacle","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Hard for kids to connect themselves","reviewDescription":"Bought two for my daughters karaoke machine, she can’t connect them by herself and it’s hard to get them both connected at same time. Needs batteries in both parts, lightweight, doesn’t always connect.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Good sour but don’t last.","reviewDescription":"Only use it for about 3 times and is not working now.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Buy with risk","reviewDescription":"Sound is wonderful it just is battery powered and they die to fast :\/","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Mic System","reviewDescription":"I have to connect and disconnect including disconnecting the batteries because if not, it discharges and have to buy and change a lot of batteries constantly. Vender needs to upgrade system.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Nice quality","reviewDescription":"Nice quality for not to expensive","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Decent for the price","reviewDescription":"I got this as a second mic for my home karaoke machine. It's decent for the price, but you just need to make sure you hold the mic right under your mouth so it picks up your voice. If you're willing to spend more you'll definitely find better options. If you want something basic though and don't want to spend much it's a decent pick-up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646438400000}
{"reviewTitle":"Static problems and a tinny sound","reviewDescription":"In this case, you get what you pay for. When plugged in, this microphone doesn't have that rich tone when you hear it through the speaker. There are also static issues when the mic is in motion. But if all you want is something to fill a basic need at your karaoke party, this is OK. The cord is a good length, though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"Quality not so great","reviewDescription":"The price for this is craZy. Sound was too low comparing other products also the attachment that goes into speaker needs batteries and it drains too quick. I used it for 30mntes and batteries was drained  Would not recommend.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Requires two 9V batteries. Lots of static when in \"standby\".","reviewDescription":"Be warned that this device requires two 9-V batteries to work with a \"classic\" model of \"The Singing Machine\". The static from the mic and the constant humming of the \"Singing Machine\" drive me insane, but do not at all bother my 11 year old daughter who LOVES this microphone. She hasn't yet used it for Karaoke, but rather enjoys providing narration for everything going on in the home. Had I know how much she would love it, I would have spent more on a higher quality mic that would work with a higher quality speaker system. \"Ladies and Gentleman, my mom is now going to walk across the room! Yes, ladies and gentlemen, there she goes! Mom, do you have any comments for the audience?\" LOL.","isVerified":true,"ratingScore":3,"reviewReaction":"41 people found this helpful","country":"United States","date":1514678400000}
{"reviewTitle":"Did not work properly","reviewDescription":"I bought this 2 weeks before my daughters baby shower, and the day I needed it, it hardly would work..i was very disappointed that it could not be used for what i needed it for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688860800000}
{"reviewTitle":"Worked Right Up Until It Didn't","reviewDescription":"No one in my family can really sing. We carry a tune well enough to make a song recognizable, so karaoke is cheap at-home entertainment for us. And it makes for consistent fun at parties. So when the wireless microphone that came with our original Singing Machine system seemed a bit spotty, I bought this one. The original wired microphone had been just fine, so it would seem this one would be, too. No dice. It was okay at first, but it died a year later. It wasn't dropped (to my knowledge). It merely stopped working. For the price, I guess it's not that great an investment to undertake yearly, but what a pain. I won't purchase this now that I need to replace this one, too.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1388102400000}
{"reviewTitle":"microphone recognized as speaker","reviewDescription":"the first few times it worked fine; but I stopped using it for a year b\/c I was away. When I used this microphone again for the first time in a year, it no longer worked. all of my 4 laptops recognize it as a speaker and microphone function doesn't work. I tried googling and finding help videos to stop from my laptops recognizing it as speaker but it didn't work. The first time i bought this thing, i remember all of my laptops recognized it as microphone no problem so i started using it as soon as i plugged it in.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1479686400000}
{"reviewTitle":"Did not like this for sound","reviewDescription":"This may be fine for a child’s little karaoke machine.. but it really does not work well.. you have to speak into one little area of the Mic to get any projection","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661990400000}
{"reviewTitle":"Doesn't come with a 3.5 mm adapter","reviewDescription":"I really had no opportunity to try this product, but I'm giving 2 stars because it doesn't come with the 3.5mm adapter which is necessary for the kid's version of the \"singing machine karaoke\" The wired version (same brand) comes with the adapter so I thought it would be cook to have the wireless one....but it didn't even if it is advertised like that. Buying a separate adapter will be $10 so I might as well return it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1609113600000}
{"reviewTitle":"Great sound quality, until it broke","reviewDescription":"The sound quality was great. It does require multiple batteries in the antenna and microphone which can gondead quickly if you don't remember to turn them both off after each use. My biggest problem is that the antenna is not strongly made and protrudes awkwardly from the input jack. A simple bump will knock it away from the jack and the inner wiring easily rips out. So after less than 1 month, it's broken and useless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613606400000}
{"reviewTitle":"You need to scream into it to make it work.","reviewDescription":"This is worth exactly what you pay for. You need to have this thing like down your throat to actually hear sound in the speaker. I tried even changing the speaker to no avail, still have to cover your hand near the top of the mic head to have your sound waves carry into the mic. Would def not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581292800000}
{"reviewTitle":"Don’t do it","reviewDescription":"Bought two and they broke within the first week. We do also have 5 kids... and needed to use the adapter it came with to fit our machine. The adapters are what broke, they are very flimsy and the weight of the cord is just too much for them. Returned both","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618704000000}
{"reviewTitle":"Still haven’t opened","reviewDescription":"Should be ok, still using the first one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687910400000}
{"reviewTitle":"It does work, but it's CHEEEEEP! Throw-away expensive toy","reviewDescription":"The system is a good one, but the craftsmanship is bogus. This product is made to break and fall apart. If you can't afford to waste the money, then don't buy it. The battery compartment on the mic doesn't fit well at all, and will probably break soon (see other reviews), and the switch on the receiver is garbage. It is broken, right out of the box, but it does work. The range is good at least to 50 feet, and the frequency pickup is heavy on the bass, good for crooning. Weak signal, needs boost and heavy EQ to make palatable sound. Easy to overload.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1311984000000}
{"reviewTitle":"Karaoke night","reviewDescription":"Great design and sound reproduction.Light weight.Down side, En. batteries drained about 3 hrs. into the singing. Luckily I bought a large pack.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1649203200000}
{"reviewTitle":"Voice pick up","reviewDescription":"I love the machine but the microphone could have been better. It doesn’t pick up your voice well. It’sa poor quality. The machine itself is perfect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616025600000}
{"reviewTitle":"Great for exercising a 3 year old that loves to sing...","reviewDescription":"Bought this for my 3 year old who, I think, is planning on being the next pop star.  He loves it, the batteries last a good long time and there's no cord to get tangled up or rip the plug out when he gets too far away from the karaoke machine.  Volume is good, sound is good...does exactly what we all hoped it would do - wear out a 3 year old bopping around singing and dancing to songs.Would definitely buy again!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1488844800000}
{"reviewTitle":"Nice sound, low range.","reviewDescription":"Not bad for the money. The sound quality is decent enough but the range is pretty poor, getting crackly at around 6 ft with the receiving antenna fully extended.It did do what I wanted it for which was to test the waters. I will be upgrading shortly and this will be relegated to backup only. If you know for sure you want a wireless mic, I would skip this one and find something else but if you're just messing around or need something short-term, this may fit the bill.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1468886400000}
{"reviewTitle":"Great gift","reviewDescription":"Wonderful","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1672617600000}
{"reviewTitle":"Worth the money","reviewDescription":"I like cheap and work good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633305600000}
{"reviewTitle":"Great 2nd Microphone for Karaoke Duets!","reviewDescription":"Bought as an add on second microphone for the Karaoke Singing Machine.  Works well. Not a professional microphone.  Does overmodulate if too loud.  Works fine for it's purpose.  Sturdy design and well made. Plastic.  Would Recommend as a second mic for Duets!  4 Stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1533254400000}
{"reviewTitle":"Short term use only","reviewDescription":"Great for duets but after a couple of uses it’s hard to hear .. sounds like it’s not on when using it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609113600000}
{"reviewTitle":"Maybe","reviewDescription":"It was really hard to hear anything from this. It may have been our kid- piano we hooked it to.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610150400000}
{"reviewTitle":"Good Mic ...","reviewDescription":"This is a good mic ...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"Awful, don't buy","reviewDescription":"This microphone is worthless. I tried to use it using a JBL partybox speaker with a dedicated microphone input (lest anyone might think that my results were due to a junky speaker). When I turned up the gain high enough so that my voice could be heard coming through the speaker, there was a VERY noticeable fuzz sound. I don't get this with the cheap wired microphone that I also have.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1637712000000}
{"reviewTitle":"Product was opened and used....","reviewDescription":"Very disappointed. The microphone package was cut on the bottom and you could tell someone had replaced it because the cord isn't even rolled up well. I was going to wrap the package from delivery but so thankful I did not and decided to double check. My children would've had to witness this on Christmas day...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1608249600000}
{"reviewTitle":"Stopped working.  Wires came undone","reviewDescription":"This thing slowly stopped working after less than a month of use.  At first it sometimes worked, if you kind of shook it around it might start working for a while.  Finally stopped working all together.  I unscrewed the top and the connections had become unsoldered.  Would like to return this but it is past the return window.  I will probably attempt to solder it back on, but I really shouldn't have to.  The microphone that came packaged with the karaoke machine has been fine so far.","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1515801600000}
{"reviewTitle":"Little to no sound at max volume","reviewDescription":"Although it came quickly I am very disappointed. I plugged it in for my daughter as soon as we got it so she could use it on her Singing Machine she just got for Christmas (bought a second mic so her sister or friends could sing with her) and you can barely hear it! You have to put your mouth on the mic and put it to max volume to even hear it a little. Would not recommend this item.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1546214400000}
{"reviewTitle":"Defective  microphone and wrapping package for that microphone...","reviewDescription":"I asked for 2 microphones.  One was returned apparently  by someone else before in 2017... according to the tag. Unbelievable.. it was open , all tapped in a hurry and pieces loose inside...I  didn't  bother to open the other one ... please people... I am paying for a new one ..  not a used one....","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1592352000000}
{"reviewTitle":"It is far too quiet","reviewDescription":"Even with the amplifier on max volume, this mic has issues picking up and amplifying sound. In addition to that, the on\/off switch turns off under its own weight, so you have to hold it in place for it to work. Overall not something I would recommend if you are looking for a microphone, as I would often be louder myself than the microphone and the amplifier.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1559088000000}
{"reviewTitle":"Volume isn’t loud.","reviewDescription":"This mic volume doesn’t go as loud as the speaker if that makes sense. You practically have you yell into it and have your lips touch the mic so your voice can be heard on the speaker.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649980800000}
{"reviewTitle":"Doesnt work like a mic.","reviewDescription":"So I plugged it into my daughter's mic outlet on her keyboard.  It only works if your mouth is pressed into the mic with your hands covering it.  That's really gross considering the mics going to be covered in spit.  Worst mic ever.  Not even loud.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1609891200000}
{"reviewTitle":"Micrófono inalámbrico con exelente sonido pero exagerada menté sensitivo","reviewDescription":"No tengo mucho que desir masque es un producto casi profesional con exelente receptor de sonido pero las naves y partes exteriores del micrófono esta mui uecas que captan asta el tallon de las llemas de los dedos con el plástico","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"Can barely hear it.","reviewDescription":"I got this home and when I plugged it into my guitar amp I didn't even know it was working. On max volume I couldn't even hear myself. I tried it on my JBL speaker and then it was even worse. This microphone it very cheap and gives off little to no sound even if you talk directly into it. I would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1559520000000}
{"reviewTitle":"Three Stars","reviewDescription":"turned lips black :( and yes, i know you're not supposed to kiss the thing, but let's be honest, these are kids here and it takes some getting used to! Definitely creeped out the kids when they realized they had been covered in a strange black film from the mic. functions ok otherwise, but cord is long and bulky which i hadn't considered","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1453248000000}
{"reviewTitle":"Love the sound! But very cheap","reviewDescription":"Love the sound and the wire is long. Don't like that the wire is in built, so, if it get damage, adios micro!UPDATE: After a 1.5 years of very low use, the micro is not working anymore.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1531180800000}
{"reviewTitle":"OK","reviewDescription":"Bought this for our daughter to hook up to our surround sound system to sing. The quality is cheaper than I expected but it works. The major negative is that it is not loud. We have to max our system out to hear the voice which is only a little louder than  a speaking voice. It is not the system as other microphones have only used half the volume.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1356652800000}
{"reviewTitle":"Lots of static","reviewDescription":"Does not make a clear crisp recording.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"Si me gusto pero poca durabilidad","reviewDescription":"Si me gusto pero poco tiempo de vida","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"2nd mike","reviewDescription":"I bought this as a second mike for the Memorex MKS-SS2 Singstand 2 I bought for my 7 and 9 yr old boys for Christmas.It didn't work as well as the mike that comes with the stand, but it was ok. I bought it so I could possibly avoid a fight over the microphone, but now they fight over who gets the \"better\" microphone.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1388275200000}
{"reviewTitle":"Well made, sturdy, doesn't pick up voice that well.","reviewDescription":"It works well enough for a karaoke machine, but really doesn't pick up the sound of your voice unless your mouth is right up on the thing. But for a simple singing machine, I guess it's okay, it's well built though, with a sturdy construction, better than the ones that come with the singing machines. I just wish it picked up your voiec better","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1419206400000}
{"reviewTitle":"There is better for the $","reviewDescription":"It's okay, but there's a cheaper one that is better.  I purchased 2 at the same time, this one for $20 and this one \" Audio-Technica ATR-1100 Unidirectional Dynamic Vocal\/Instrument Microphone\" for $8 something- the cheap one works the best.  We're using these for kids and the cheap one picks up sound the best.  Would recommend that one over this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1384560000000}
{"reviewTitle":"I don’t want to share this product to anyone.","reviewDescription":"I couldn’t wait my product but when it’s came I was so  disappointed you have to stay close to the Bluetooth system but they say 90 feet it’s not true","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1585094400000}
{"reviewTitle":"Good","reviewDescription":"Good for the price but connection cuts in and out quite a bit.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1647216000000}
{"reviewTitle":"I was not specifically expecting the best sound quality","reviewDescription":"I bought those mic to practice at home and get accustomed to holding a mic while performing.I was not specifically expecting the best sound quality. But this does not even produce decent sound. The voice levels fluctuate intermittently. I did some research online, and found that some mics have to be held at a certain angle to your mouth to get the best input into the mic. I tried all angles and combinations but was not able to get this to work.Sad part is, I did not get a chance to use the product until about 2 months after purchase. But when I did, I was disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1519430400000}
{"reviewTitle":"Adapter does not work","reviewDescription":"Used it for one night and it stopped working. The adapter just wouldn’t turn on. Opened it to switch batteries and still doesn’t work. Bought it for thanksgiving.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Not working right straight out of the package","reviewDescription":"We just got this delivered. Kids were really excited to sing together, we immediately opened it and it is not working right straight out of the package. You have to hold the on button (that you slide up and down) up for any noise to come through. I’ve tried everything I can think of to get it to work without doing this (it is hard for a small child to continually hold the button up while singing). So disappointed with this product!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1632787200000}
{"reviewTitle":"Very low voice output","reviewDescription":"I bought this mic to connect to my Yamaha AVR for Karaoke . But even for full sound volume in AVR the sound is very low . A normal volume level you can’t even hear any thing . Not useful for the purpose I bought so had to return it .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1654560000000}
{"reviewTitle":"Worst Service response- They simply said that our product is fine","reviewDescription":"Model #: Singing Machine SMM-205The microphone is not loud at all from the day I purchased. I have to keep mouth inside the microphone still it is not working. I know I would have a complaint on day one but still, I am annoyed at how the microphone is catching the voice. It’s same like with or without a microphone. Same voice not working. Can you please replace with a better product. I can pay to upgrade as well but this is a waste of my money I spent on your product.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1569456000000}
{"reviewTitle":"Doesn't work with KoolMAX cooler","reviewDescription":"Didn't work straight out of the package; LED lit up on mic but not on receiver.  Contacted Singing Machine, they wanted me to verify with the manufacturer of my audio equipment that the mic would be compatible.  Audio equipment is the, and the manufacturer said as long as the mic is outputting an analog signal, it should be compatible.  Singing Machine confirmed that the mic outputs an analog signal, so the product must be defective.  Got a replacement from Amazon, same issue.  No idea if it's the microphone or the cooler\/stereo causing the issue (as I've had numerous issues with it as well).  All I can say is buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1507507200000}
{"reviewTitle":"Disappointed","reviewDescription":"This mic only worked twice then it quit working all together.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Just go with half price wired mic!","reviewDescription":"This does not even work with all the speakers the mic is not the greatest when it works either! Just get 10 buck wired mic!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Doesn't Work","reviewDescription":"Cannot get microphone to work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Did not magnify the voice","reviewDescription":"I choose this product based on prior reviews of the Singing Machine which I also purchased.  People noted that it was a good idea to also purchase this wireless microphone to go along with the karaoke machine.  Unfortunately, this microphone did not work...the sound coming out of the microphone was barely auditable.  So I am returning and hopefully a replacement will work properly.  We did carefully read all instructions and decided to return and try again with another of the same microphone.  My granddaughter was very disappointed as she could not play with this wireless mic over the Christmas holiday.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1357084800000}
{"reviewTitle":"Do not order if you just need a wireless microphone.","reviewDescription":"I need a microphone for my classroom. This is what this microphone was labeled. It’s not until it’s opened and you read the directions that you discover that you have to have a certain karaoke machine (don’t need one of those) for it to work. So now I have an opened microphone that won’t work for my purposes.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Didn't turn on","reviewDescription":"We bought this for our outdoor wedding and it didn't turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Annoying","reviewDescription":"It didn’t say that I needed a karaoke machine, I wasted my money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Eh","reviewDescription":"It came with a different plug in and different packaging from the reviews. Unfortunately I don’t have any pictures, but in short, it wouldn’t plug into my amp, it was too small. However I will say that I was able to return it and get a refund so I’m still happy, but I wouldn’t buy from them again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"This is a simple device that arrived dead","reviewDescription":"I needed this item for a party in two days.  It is a simple microphone that came with no instructions.  None should be needed.  Plugged it into an amplifier and NOTHING.  It did not work at all.  A simple, non-destructive test at the manufacturer should have caught this item.  Amazon is sending me a replacement, but not in time for the event.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"Requires AAA not AA batteries","reviewDescription":"The listing says it requires double A batteries but that’s wrong. I bought double a batteries along with this mic and I can’t use them as it requires triple a batteries. Please fix this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Cockroaches  ** Horrified and Disgusted","reviewDescription":"Cockroach Warning! I purchased this mic as an addition to a karaoke machine for Christmas.  We used it now and then, total of ten times... Then it stopped working. We removed the mic cover and a dead cockroach fell out, also the tape that wraps around the mic had a multitude of what appears to be baby cockroachs.  I have never been so horrified. Thank God these bugs were locked into the top of this or I would have a different problem all together. My children are so freaked out, and I am disgusted. My fear is where the hell this mic was made and that there are bugs making thier way into the equipment as its being constructed. I worry about everything I purchase now because there is no way for me to know what we purchase isn't bringing something like this into my home. Horrified and Disgusted.","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1480204800000}
{"reviewTitle":"No amplification","reviewDescription":"Doesn’t amplify sound unless your lips are touching the microphone.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Missing","reviewDescription":"I received the incorrect color and missing adapter","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Looks and feels great - NEVER judge a book by it's cover!","reviewDescription":"We were looking for a low-cost microphone to add to our karaoke machine and, based on the good reviews on here, went ahead and purchased one.  It was well-packaged and came with convenient adapters.  Physically, it felt well-built and sturdy.  This mic worked fine at first, and sounded decent for the price.  Over a few weeks, it started working intermittently and also introduced lots of hum into the machine.  Then the switch started malfunctioning to the point where you had to hold pressure on it to keep the mic on.  It was too late to return the item, so we bought another one thinking it was just a fluke.  The new one worked out of the package, but after 1\/2 hour of singing, it started doing the same thing, and eventually stopped working altogether.  Two chances is all this manufacturer gets.  I would not recommend this mic to anyone.","isVerified":true,"ratingScore":1,"reviewReaction":"68 people found this helpful","country":"United States","date":1398988800000}
{"reviewTitle":"Good for the price, compatible with the singing machine Disco light karaoke machine.","reviewDescription":"We purchased the singing machine Karaoke machine for Christmas, the included microphone went bad the first day of use, it seemed to be cheaply made. I purchased 2 of these to replace it (the karaoke machine has 2 mic inputs for duets). Our kids have used this now for the last few weeks. and the microphone have held up well. They are better quality then the original, not the best out there but for this price, they are an excellent replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1422057600000}
{"reviewTitle":"Does the job","reviewDescription":"Does the job and its a great value. You just have to be careful with angle and distance. The mic has to be straight and fairly close to work properly. not  a huge problem but you have to maintain awareness","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599350400000}
{"reviewTitle":"Works","reviewDescription":"Grandson loves","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650758400000}
{"reviewTitle":"Works as Expected","reviewDescription":"Got this as an addition to our daughter's new Singing Machine.  It works perfectly, just don't get extremely close to the machine.  It used 2 9V batteries, one in the receiver and one in the microphone.  The only con we have found is that it does not in the microphone holders on the side of the Singing Machine.  Other than that it does the work and allows you to be cable free.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1546041600000}
{"reviewTitle":"So far, so good","reviewDescription":"I read the other reviews and wouldn't have bout this except that everything else like this is in a different price range entirely. There is a little noise when no one is talking, but it does the job for a kids kareoke machine. Before this we had microphone tangles and even pulled the kareoke off the table a few times. Too bad you can't use two at once, but it still helps to only have 1 with a cord. Also doesn't eat batteries.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1518220800000}
{"reviewTitle":"Wireless Microphone 🎤","reviewDescription":"It’s is lightweight and must have batteries to use. It has a little static at times when in use and not in use.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1652313600000}
{"reviewTitle":"works well","reviewDescription":"We bought a karaoke machine for our daughter and her family Christmas 2014 and they love it and still use it with 2 sons now 10 & 13 years old and 15 yr old daughter. I just bought a 2nd one for our 5 teenage foster girls and they had it put together and singing in about 20 minutes.  I bought this product as a 2nd microphones with each machine purchased.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1472169600000}
{"reviewTitle":"Perfect 2nd Microphone for Karaoke Machine","reviewDescription":"Works great as a second microphone for our karaoke machine.  The sound is fine...nothing great.  If you are super into singing, then you may want to find something a little more higher quality.  But for my children, this microphone works perfectly.  The cord is nice and long so they can move around and dance while singing.  It also looks different than the other one we have, so they know who had which one.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1423526400000}
{"reviewTitle":"E","reviewDescription":"So far so good it works well","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1643673600000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646438400000}
{"reviewTitle":"ok","reviewDescription":"This product came on time and the packaging was good, however it has a short, You have to push up on the power button for sound to come in. Didn't feel like going to post office and doing a return for a simple mic so we make it work","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1395619200000}
{"reviewTitle":"Its nice.its ok.","reviewDescription":"Its ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"we will see!","reviewDescription":"The first one I received of these did not work at all.  We plugged it in and got nothing.  Amazon was very cooperative and immediately sent me another one.  So far so good but it has only been a week.  I guess we shall see","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1373414400000}
{"reviewTitle":"Great for kids","reviewDescription":"It was okay. So-so.Not very clear in my opinion, and the on-off switch is very VERY cheap.Great for kids. I wouldn't use it professionally in any way.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1524182400000}
{"reviewTitle":"Broke after a few months","reviewDescription":"It is very average. It worked for a few months but now it's broken and we cannot use it anymore. We did not overuse it though... hence the disappointment","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1528502400000}
{"reviewTitle":"Microphone","reviewDescription":"Color","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"Spend a few more dollars and get a better mic.","reviewDescription":"It works but I have to turn up channel volume and master sound on my mixer, and aux volume and master volume on the system. Spend a few more dollars and get a better mic.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1469059200000}
{"reviewTitle":"This Microphone is a good microphone, besides the fact that you literally have ...","reviewDescription":"This Microphone is a good microphone, besides the fact that you literally have to talk directly into the top of the microphone. If you try to sing into the sides, you won't be able to hear anything, which is pretty annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1444608000000}
{"reviewTitle":"La caja de la batería es muy pequeña","reviewDescription":"La batería entró muy forzosa","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620345600000}
{"reviewTitle":"Fun, but not loud enough.","reviewDescription":"While I like the product and it's set up was super easy, the speakers are pretty quiet. Probably appropriate for my 11 year old, but way to quiet for my adult friends. Was hoping for more power - should have looked at amp output first I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1357862400000}
{"reviewTitle":"It work’s","reviewDescription":"It does it’s job it’s what you expect form and an expensive microphone it’s not professional but it works just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1583971200000}
{"reviewTitle":"Great price for the product","reviewDescription":"I bought this for my granddaughter and she loves it. She hooks up to my amplifier and sings into it. You do have to turn it up to hear her sing and you have to put your mouth up to it also. Other than that she enjoys a lot. Great price for the product.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1410825600000}
{"reviewTitle":"It was great once I got an amplifier to plug it into","reviewDescription":"I bought this because I thought I could just plug it into the TV for our Karaoke night but it does not work that way.  I had to buy a Karaoke machine and I used this as a second mic.  It was great once I got an amplifier to plug it into.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1420848000000}
{"reviewTitle":"I wish it had better quality, it sounds tin ie  but it words for practice.  maybe if I hook it up to some descent speakers... wi","reviewDescription":"I wish it had better quality sound... maybe if I hook it up to surround sound or sometning... it sounds tin  nie  like its brassy or something  not really quality sound .  I will try it hooked up to surround sound that may help  not real happy ith the quality sound.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1373241600000}
{"reviewTitle":"Decent enough for kids Karaoke machine","reviewDescription":"Bought so that we could have an additional mic for our three kids to sing together with their new memorex karaoke machine. Not a huge fan that you have to sing directly down into the top of it to be heard, but it's also not a $200 mic. Does what it needs to do...entertain my kids!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1454284800000}
{"reviewTitle":"Great value for your money","reviewDescription":"Works good over my sound system.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615939200000}
{"reviewTitle":"Great value for the money!","reviewDescription":"Great value for the money. Would buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1600992000000}
{"reviewTitle":"Works","reviewDescription":"Works but you have to get you mouth extremely close to mic for sound to be picked up..Satisfied for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1566604800000}
{"reviewTitle":"Great value...","reviewDescription":"Bought as a Christmas present for my 4 year old. She LOVES IT.  Great sound and does the trick for her.  Only downside would be that it is not wireless, but we knew that when we bought it.  It works for our needs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1483142400000}
{"reviewTitle":"Good","reviewDescription":"Great for the price. The only down is you have to get very very close to the mic.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576195200000}
{"reviewTitle":"Stopped working in less than 2 months of intermittent mild use","reviewDescription":"Feels fairly sturdy and sounded good while it worked but one mic stopped working in less than 2 months of mild use. 30 day return policy. Boo. I understand the concept of \"you get what you pay for\" but still... Not sure what I could have done to prevent it from breaking besides never using it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1424995200000}
{"reviewTitle":"Can barely hear it.","reviewDescription":"Can barely hear it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649030400000}
{"reviewTitle":"sounds low","reviewDescription":"sounds low not very load for this mic.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611619200000}
{"reviewTitle":"all in all it is a good computer. I had to replace the CD ROM ...","reviewDescription":"The computer came promptly but when I needed tech Suport. It was a week before someone called me back. the CD ROM was not rewritable and there is a plate missing . all in all it is a good computer. I had to replace the CD ROM and add more ram. Not very happy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1429747200000}
{"reviewTitle":"The sound quality is terrible","reviewDescription":"Terrible sound quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652313600000}
{"reviewTitle":"Only one at a time due to frequency","reviewDescription":"You cannot use more than one at least Mike's they're always on the same frequency the only make one frequency so you can only use one Bluetooth mic the other has to be a chord","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1513728000000}
{"reviewTitle":"Didn't work","reviewDescription":"This product did not work the jack fit but kept coming out. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617235200000}
{"reviewTitle":"Poor backup mic","reviewDescription":"Volume is so low i can't even say its value for its money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618099200000}
{"reviewTitle":"Only if you are loud.","reviewDescription":"It only works with mic in your face. Other than that -  no volume. Sucks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580083200000}
{"reviewTitle":"not good sound very low comparing to other mics","reviewDescription":"not bad for the money but for $20 you can get much much better one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615075200000}
