{"reviewTitle":"Okay","reviewDescription":"It's okay. I did return it because my phone kept falling out. My phone is way too big to be fitting in this. It's very cute and pink I've never seen that before so that's why I bought it. The sticky bottom didn't really stick to my car even with the plate that comes with it. It's okay","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Works, but not dirt proof","reviewDescription":"I got this for my wife for her B.day. Purchased it because I typed into Amazon \"UTV\/ATV Phone holder\". This came up with a bunch of others. But got this one because it said worked great on a UTV. WELL... NO it does not!! Well it worked, but by the end of the first day of dusty driving, the automatic locking arms were no longer sliding, and then clicked like crazy when pushing in. I ended up putting on the older phone holder from RAM, and I guess she's still happy with that one. This one now... well, sitting in the closet because I wont return it because it physically doesn't work right.. but it's my fault for using it like the ad said. DO NOT BUY This for an ATV or UTV, but I'm sure it would work in a dry environment, like inside a vehicle.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Sticking","reviewDescription":"Does not stick to dash as well as I would like for it to","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Fell off & won’t connect again","reviewDescription":"This has been great until 6\/7\/24… it fell off while my car was parked in Oregon. It will now not reattach and hold…","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Falls often","reviewDescription":"It’s not the best took me a couple try’s to get it to stick properly","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Had trouble assembling","reviewDescription":"I ended up never using it after I had issues with getting it set up. My Ford Focus dash also didn't really have a good spot to attach it to.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Some Aspects Great, Some Not Great","reviewDescription":"I bought this as a replacement for the phone mount I had in my car for years. I really loved how it came with multiple ways to mount my phone (vent, dash, or windshield). It was easy to install. I first tried the dash mount, and it would not stick. I tried for days over and over again but it just wouldn't stick. I then moved to using the vent clip mount and it is absolutely wonderful. In regards to the part that actually holds the phone, it seems VERY sturdy (sturdier and stronger than my last one), but it doesn't automatically clamp. Because of this, it takes much longer to set up my phone than I'm used to. It's a bit of a personal annoyance as I have to use 2 hands to put up my phone until I figure out how to do it with one hand quickly, but it's not a deal breaker. The strong grip of the phone holding part is enough of a win to make it worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"worked","reviewDescription":"The holder worked for good time then heat came on windshield and a sticky film was left on windshield. and would not stick anymore","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Good but not for dashboard","reviewDescription":"Really like it but if you have any sort of a textured dashboard, the included adhesive plate nor the suction cup will work. I stuck it to my window. Two weeks later it is still good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"Melted","reviewDescription":"This item was easy to install, and easy to use. Upon trying to remove it recently, I bought it maybe two months ago tops, I found that it had melted to the inside of the windshield. I suppose if you never want to remove it that’s fine, but if you do, you damage it trying to get it off because it had melted to the inside of the windshield. I suppose it’s because of the heat, but of course it will endure tremendous heat in the summertime inside of a vehicle at all times. I would sway from this if you want to remove it and still be able to use it.Update:After posting this review I was contacted by their customer service and offered a replacement. I was apprehensive for obvious reasons and did not respond right away. They contacted me again and offered me an Amazon gift card to right the wrong.  I accepted.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1659916800000}
{"reviewTitle":"Questionable build quality","reviewDescription":"I got this holder and it was great at first, but I did notice it had some play even after you tighten it down. My biggest problem was that I live in a hot climate, the suction cup melted to the windshield. When I pulled it off, I was able to clean the glass off east of plastic, but the cup itself stayed sticky. I actually got a plastic bag stuck to it and pieces of it melted into the cup.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Good while it lasted","reviewDescription":"Great suction and  adhesive, but it has to be on a smooth dashboard… I loved it but it’s a shame it didn’t last","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"ok","reviewDescription":"instructions not clear. sticky didn't last long. suction cup not strong enough to hold phone with case","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Sent me a used one","reviewDescription":"The box was torn and parts were put back in a way that it couldn't even close. The stickers have been removed from the adhesive pads and kind of put back on. If you're going to sell me a used box item I'd like to pay used box prices.  As far as the quality goes this should be a 19.99 item. I would not trust it fully extended and\/or in landscape mode. I'm using a Samsung 23 Ultra which is a big phone and this seems pretty weak","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Very cheaply made","reviewDescription":"Not worth the money, cheap plastic","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Bad suction-glue!","reviewDescription":"Bought three of these for ourselves and it held great for awhile till it reached summer! With the heat of inside the vehicle as well as the windshield heat, the glue on the suction got so hot that it meted and will not hold anymore, leaving a sticky mess!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Extension not very long","reviewDescription":"Ended up using the vent holder instead of the dash\/windshield mount. Don't really like it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Adhesive to weak","reviewDescription":"The overall flexibility fine. However, the flat plate for the suction cup mount needs stronger adhesive.  It would not stick at all. Barely tacky.  I had to remove the adhesive pad that came on it and replace it with trim adhesive. Also, if you have a case that stores credit cards it might not hold your phone securely.  The side clamps might not be deep enough.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Doesn't stick to anything","reviewDescription":"I bought this product to put on my Mazda Miata so I can mount the phone. While the part that you can clip onto the air conditioning ducts work, the part that you would put on the dash does not work at all. It has zero ability to stick to anything. I was very disappointed in that aspect of this product. Since that was the sole reason I purchased it. I would post a picture of it sitting proudly on my Mazda Miata dash, however it would be impossible for that to happen since it doesn't stick to anything.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Bad suction cup","reviewDescription":"It will not stay attached to the dash with the so Chipco I have one and two other cars have no issues whatsoever. I’ve done all the steps to clean it Kohl’s for a short time, and then falls off no matter what I do will not work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Fine but not for me.","reviewDescription":"I purchased two, one for my work van and one for my car. The work van on would not stay stuck, even after letting the base cure for 24 hours. Outside of that, I feel it's operation is a bit rudimentary\/in-elegant. It's quite bulky and if your phone is wider, it can be difficult to reach the release button.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655683200000}
{"reviewTitle":"Not deep enough","reviewDescription":"The quality is really good and I really liked it, but had to return it as it was not deep enough to fit my large phone case.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673654400000}
{"reviewTitle":"Its Okay","reviewDescription":"For the price, I wish it was just easier to move the fact that you have to unscrew it to turn it landscape or portrait I would think this could be done without that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"Good quality but not suitable for flip folio case","reviewDescription":"This item was advertised as holding deep phones, but it's brackets are too short to hold a phone with flip-over case.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680825600000}
{"reviewTitle":"Still not big enough","reviewDescription":"I have a pop socket, as I'm sure a lot of people have, and though this was big enough to house my phone when I take off the case or even it if was just the case alone but since I have a pop socket it's too thick for the holder. I don't want to take my phone out every time I get in and out of my car. I how to one day use it, cuz I never got around to returning it, so it just sits there for now in the box.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628640000000}
{"reviewTitle":"Vent clamp loosens","reviewDescription":"Concerned about the inability to stick to my not-so-smooth dashboard and\/or the chance that I won't be able to clean the leather grooves after removal, I opted for the vent louvre configuration. Regardless of how much I tighten it, the mount inevitably wiggles it's way out... and it's not because I don't tighten it enough. The V-shaped clamping fingers do not provide enough uniform friction to maintain a reliable fixation under normal road vibration. So, I need to take it off and re-tighten every week or so. Otherwise, all other aspects of the mount seem good.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1626480000000}
{"reviewTitle":"Great product...until a month later!!","reviewDescription":"Overall the product is great from suction power, adhesion and was easy to install. It’s held up the only issue I have is if you have a pop socket on the back of your phone it’s bulkiness cause it to stick out and unable to secure your phone w\/o adjusting it just right.01\/29\/21: I am editing this review because last night my phone mount lost its suction and fell off my dashboard. I had not changed my phone or case and have had the product for about a month. I am sending it back for a refund so that is why I’m changing my rating and review for this product, so disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1611705600000}
{"reviewTitle":"Would be 5-stars","reviewDescription":"The suction\/adhesion is great.  The extendable arm allows us to put it in a great spot in the car so that we can use the mount without it obstructing anything.  The only reason I can't give it 5-stars is because it's titled \"Thick Case & Big Phones Friendly\" but it's not quite big enough to handle the grips on either my wife or my phone very well.  It's seems like it does, but often our phones will fall out of it which is both frustrating and distracting.UPDATE: Customer Service is great and they gave me a full refund when they saw this review","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1599609600000}
{"reviewTitle":"Bad product, but good customer support","reviewDescription":"The suction on this device is horrible. It refuses to remain attached for more than a minute at a time. However, customer support reached out to me and offered either a full replacement or a refund. I opted for the refund.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662336000000}
{"reviewTitle":"Doesn’t stick","reviewDescription":"I really liked this but it didn’t stick well at all. It came off quickly. I’m going to restick it with command strips.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Defective mount","reviewDescription":"The main mount sticky part was defective. I've used this mount before but I'm disappointed with it this time. I'll have to use a diffrent one in the future.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639872000000}
{"reviewTitle":"Don't buy","reviewDescription":"This product is not worth the money it will not stick to the dashboard know matter how much you clean it.  The cradel that holds the phone will not adjust for your phone. It was a waste of money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613347200000}
{"reviewTitle":"Not for big phone or case","reviewDescription":"Use it for a Google map for directions on my phone  ,keep falling from my dash board on the highway I had to park at the emergency curb. Am using samsung galaxy s10 plus.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618099200000}
{"reviewTitle":"Adhesive not strong","reviewDescription":"After 2 months the adhesive wore off and continuously fell from my dash. My phone ended up on the floor. The set up and functionality are great, but it just doesn’t last unfortunately. Unsatisfactory","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"It cannot be attached","reviewDescription":"I was so happy when I received it but it had been impossible to attach it to the car. As soon as I am driving and I turn, it gets loose. I had one before, very similar and I never had this problem🥲","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1609718400000}
{"reviewTitle":"Doesn't handle as BIG or THICK as they say","reviewDescription":"\"Thick Case & Big Phones Friendly\" is not totally accurate. My & wife's iPhone 11's just barely fit -- both have thin cases & thin finger rings.I recommend something else for bigger phones, thicker cases &\/or rings\/popsockets.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629763200000}
{"reviewTitle":"wont stay in place.","reviewDescription":"I'm not able to get this to stick anywhere. maybe it's me i dont know.i ended up putting it in my cup holder and it might be my favorite spot for it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620172800000}
{"reviewTitle":"It's not that good","reviewDescription":"It's was really good and I like itBut probably bc of the heat it kinda moves, the base is stuck to the dashboard but the arm kinda moves around","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621641600000}
{"reviewTitle":"Does not stick.","reviewDescription":"Installed it on my dash. Drove 2 miles and it came off. The rest is a sturdy well made product. But the adhesive is pathetic","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640563200000}
{"reviewTitle":"Air Vent holder weak","reviewDescription":"I have tried every vent, position and configuration with the phone and the air vent mount but it flops around like a fish out of water.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"Cheaply made","reviewDescription":"This broke after 3 weeks.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667347200000}
{"reviewTitle":"Not good for large phones...","reviewDescription":"Gave this to a friend of mine and so far she says that the phone droops down while she drives. This is for the air vent clip holder. It is a ball-joint that moves freely. She hasn't tried the suction holder for the dashboard yet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609891200000}
{"reviewTitle":"It’s okay. Just won’t stay put  and it barely can hold my phone","reviewDescription":"This product was great but I don’t know why it refuses to stay up… I’ve ensure that I’ve installed it correctly (which is very easy by the way) but after a few minutes it just falls back down. I had to just take it down due to the distraction when I’m driving.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1615420800000}
{"reviewTitle":"Works well on cool days!","reviewDescription":"The product was all good until it had a very very warm hot day. The dashboard became hot because of the Sun and sticky thing came off. It would not restick itself because the hot dashboard. So that sucks! That's why I'm giving it a 3-star.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621209600000}
{"reviewTitle":"Do don’t buy if your phone is big or has a pop socket","reviewDescription":"My phone fell out hard a lot so I had to dismount and buy something else. I don’t know if this is best for iPhone 12 Pro Max or any big phone especially if you have a popsocket","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628640000000}
{"reviewTitle":"Suction cup doesn’t work","reviewDescription":"Could not use to attach to dashboard -suction cup did not work. The attachment for the air vent is good though. I bought 2 of these and would not recommend","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636243200000}
{"reviewTitle":"Sturdy piece of gear.","reviewDescription":"Haven’t tested suction, but device seems to be well made. Negative is that appears base had been used previously and needed to be cleaned.  This was disappointing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638230400000}
{"reviewTitle":"Its unfortunate that the adhesion mount is permanent. One you use it you can't remove it.","reviewDescription":"I did not like that the adhesion option is not removable so I was only able to utilize the vent clip.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Can Only Use Sticky Patch One","reviewDescription":"Fantastic holder except when you use the sticky window patch, it can only be used once.i wish they would've included a second window patch. After it's used once, it can't be used again. That's the downside to this phone holder.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625270400000}
{"reviewTitle":"Not for phones with back pockets","reviewDescription":"Nothing particularly bad but something to watch out for is that the holder also holds from the bottom which is limiting. And if you have a pocket on the back of your phone, this is not an option.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"Countiously falls off dash","reviewDescription":"I don't reccomend this product as the suction cup mount will fall off in extremely hot and humid environments and the vent clip blocks the vent from throwing ice cold AC VICSEED should include a magnet or 3m sticky strip in the package as the disc even fell off","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622160000000}
{"reviewTitle":"Worst purchase spent","reviewDescription":"My mount when I got the package was beaten and smashed, I sent it back to Amazon,  and got a new one. The adhesive didn’t stick at all. It ruined my vents from the vent clip and it never stays in the correct spot!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639526400000}
{"reviewTitle":"Only had it for 3 months and it’s not grasping the phone anymore, it keeps slipping out.","reviewDescription":"Only had it for 3 months and it’s not grasping the phone anymore, the phone e keeps slipping out while the vehicle is moving.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656201600000}
{"reviewTitle":"Would not stay clipped on vent","reviewDescription":"I would not recommend this product b\/c it would not securely stay on the vent in my truck.  I also have another cell phone holder that is not as fancy and just a magnet sticker that works 10x better.  I bought this fancy one and it won't securely stay on.  I need to return it, but such a hassle.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606953600000}
{"reviewTitle":"Broke after 1 year","reviewDescription":"Not too bad for the price, but still disappointing it only lasts a year.  Best spend a little more money on something that will last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654819200000}
{"reviewTitle":"Falls off","reviewDescription":"Initially stayed put on dashboard for about a week, then kept coming unstuck. Tried cleaning the suction cup, using base plate on dash, etc. but nothing helped. Too bad, because actual mount is sturdy and large enough to handle phone in case.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625097600000}
{"reviewTitle":"Does not hold a phone with anything on the case.","reviewDescription":"This advertised as being able to hold “thick” phones. My phone has a thin case & a clckr on the back. This device does not hold my phone very well!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651968000000}
{"reviewTitle":"Suction does not work","reviewDescription":"The clip for the vent works well but the adhesive does NOT work at all. I cleaned the dust and followed instructions, but it kept falling over. The suction is alright but still not too strong. A bit disappointed about that","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1640217600000}
{"reviewTitle":"Pourly packaged, missing information","reviewDescription":"This product was shipped in a standard ziplock bag without and directions or guide on how to work this unit.  Seems like everything is there.  I am guessing I received someone else's return and the original packaging was damaged.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625702400000}
{"reviewTitle":"Doesn’t fit larger phones","reviewDescription":"This would probably work for normal phones or small cases. 2 stars because it specifically advertises as working for deep phone cases, but the arms are still too shallow for my iPhone 11 with a credit card slot on the back. Bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624406400000}
{"reviewTitle":"Good but melted","reviewDescription":"I’ve had this for a while now and absolutely loved it. Unfortunately as time went on and the heat rose a bit, the suction cup turned yellow and started to melt. There is a small trail running from the suction pad itself down my front windshield. Disappointed that it started melting and now turns my phone when I’m driving as the goo is not as solid.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661126400000}
{"reviewTitle":"Pop Socket","reviewDescription":"This is a decent mount. I use the vent clip option just to the right of my steering wheel for my 4Runner. It works great for the most part. My only complaint is I have a pretty thin Otterbox iPhone case with a Pop Socket mounted to the back, and I feel like it’s barely in there sometimes. I clamp it really tight and I’ve still had my phone pop out a couple times on bumpy roads. I just wish it was a bit deeper.Other than that, I recommend just be cautious about the Pop Socket that thing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642982400000}
{"reviewTitle":"It’s okay.","reviewDescription":"The dashboard pad wouldn’t even stick to my dash, let alone my hand but the actual suction cup part was the only way it’d stay on my dash and be sturdy but now I am nervous for when summer comes because I am worried it’s going melt onto my dash. Also it says it can hold phones with a bigger phone case, which I don’t believe. I have a thin case on mine & a pop socket, I had to take the pop socket off for it to hold my phone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646697600000}
{"reviewTitle":"Do not get if you have a thick Phone Case","reviewDescription":"I was never able to use this product since after testing it would not hold my iphone 11 pro max. One thing to note is that i bought this because i thought it would be able to handle my Iphone with my wallet case, but it could not. Great design other wise but not for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671321600000}
{"reviewTitle":"Eh","reviewDescription":"I was looking for something that would fit my phone. It's a galaxy s10e. In a regular otterbox. But I do have a hand holder thing on the back. It's simply a strap of stretchy fabric so I can hold my phone. That extra 1\/4\" added to my case makes this thing entirely useless...it'll hold my phone for a few moments. Then it falls out. The suction cup has also failed twice now. I'm really sad bc the design of it is great. But sadly I can't use it at all even tho it's described as being a deep phone holder. It's not.If you don't have the extras on your phone tho I'm sure it's be great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619654400000}
{"reviewTitle":"Works well enough for the price","reviewDescription":"I live in Texas, needless to say temps are getting pretty high (it’s currently mid July). The suction melts off if I leave it suctioned on my dash and my phone has overheated multiple times leaving it directly in the sun.The air vent clip attachment isn’t the best fit for my car and tends to get loose. Also, it takes away a vent in a very hot month with temps still rising.Needles to say there could be vast improvements but it gets the job done. Not the worst purchase of you want a cheap solution to mounting your phone. Just some things to consider before purchasing!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626307200000}
{"reviewTitle":"Adhesive doesn’t last long and can’t reach support","reviewDescription":"Bought this item in November 2020 and was very happy with it until now (July 2021).  The adhesive failed and the entire thing came off the dashboard.  I had hoped to be able to order just the adhesive circle, since the rest of the item was intact and still working very well, but got an error when I clicked on “get support.”  I will have to look elsewhere for adhesive, but the rest of the item is still very functional and well made.  Just too bad that they don’t include an extra adhesive circle or two, would be extremely helpful.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1627516800000}
{"reviewTitle":"Good customer service","reviewDescription":"My first time installing, I followed the instructions but the plastic with adhesive that sticks to the car always seems to not be strong enough to hold my SX Max. I messaged the seller & they sent me a new plastic adhesive piece very quickly & hassle free. I followed as instructed, changed the placement this time & it’s lasted longer than the first time….but it is still lifting.It will probably do well with the air vent clip (a pro of its versatility) & the sides that hold it in place are very durable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632700800000}
{"reviewTitle":"Perfectly adequate until it melted","reviewDescription":"Good suction power. Worked fine for about 6 months before it began to melt. It was fine for a while though the melting suction cup was causing it to droop and slide down the windshield. Ignored the problem for a few more months and today it was 100F when it finally gave up and fell off the windshield. Great adhesion I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1655769600000}
{"reviewTitle":"If you're willing to use super glue, this is an ok mount.","reviewDescription":"The suction cup is useless.  However, the Adhesive on the plastic plate that you stick on your car first is fine.  Pick a spot where you are comfortable with the mount sitting.  After that, the suction cup is unreliable at its best.  Since the rest of the mount is adjustable and quite sturdy, I decided that at this price point I would simply super glue the suction cup in my preferred position on top of the adhesive plate.I give it an overall rating of 3 since I can now use it regularly and it did improve functionality within my car.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624147200000}
{"reviewTitle":"Held up well until it didnt","reviewDescription":"This holder lasted me 2 1\/2 years before it gave out. This summer was too hot and humid for it and the adhesive melted right off the windshield. But until then it worked great, no complaints. I like how easily adjustable the size is, although its a bit of a struggle to do one-handed if your other hand is on the wheel. Overall, i feel like i got enough bang for my buck.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"holds the phone securely","reviewDescription":"The plastic is sturdy and it is well made & wellPackaged.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"I like the mount but it does not stick","reviewDescription":"The suction cup does not adhere to our car. The phone mount is great size. We love the arm on it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Good quality","reviewDescription":"Good sturdy holder, hasn't lost suction yet, good price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Perfect","reviewDescription":"Have had it about a year and it work perfectly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Good as advertised","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Easy install nice looking and works good","reviewDescription":"This product is nice looking soft eject of your phone from holder. Just a couple things tho. If you have anything like a finger holder on the back of your phone make sure you clamp your phone in tight  the space cuz it's not flush can cause it to drop. I wish the arm was a tad bit longer  but it's a good product and handles different size phones without issue.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"update 2 re: UV Film helped prevent Rubber seal (glue) fails and makes a hot mess","reviewDescription":"the replacement product made it through a very hot summer and the replacement seems to be working as expected.  i think the additional UV film between the glass and the product helped, but not scientific test.previous note below:I was contacted by the vendor and have received two new replacements for this product. In addition, to the replacement the vendor sent along additional UV film to add between the windshield and rubber\/vinyl (?) seal to help reduce the chances that direct sun melts\/ruins the material.Thank you very much Mary for that. I appreciate your diligence in correcting this.I have not install the new product yet - and it's fall\/winter now - so I won't be able to change the review until I see how the new product performs through warmer weather.Original comment below:Works great, until summer comes (East coast) and the sun melts the glue\/silicone and the product fails completely leave a mess of glue on the glass.Purchased 3 of these for 3 vehicles - two out of the three have failed this way.The silicone material used to attach to glass windshield is absolute garbage.Throw your money directly into the landfill instead.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1664150400000}
{"reviewTitle":"UPDATE: Wonderful till summer arrived, and the adhesive melted","reviewDescription":"UPDATE Nov 2022I must commend these folks for their phenomenal customer service. Based on my review, they reached out to me directly to find a way to make this right. I was not interested in a replacement and am content to use the air vent clip. They insisted on sending me an Amazon gift certificate to compensate me for my trouble -- and they would not take no for an answer.If you're not sure whether this clip will work for you, it's certainly worth a try with customer service this good. These folks raise the bar. Thank you!__________I loved this all last winter. Then summer arrived, and the adhesive just melted. The whole thing slid down the front of my dash, leaving a sticky trail of goo.  :-(I'll be logging a question to ask whether anyone has found a good way to clean this off your dash without ruining the dash.If you live in a climate that never gets above 75 degrees Fahrenheit, then this might work well for you. Otherwise, bear in mind you car gets a lot hotter than the outside temps.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"It does what it says on the tin.","reviewDescription":"I've ordered one of these before but I forgot to remove it when I sold my car.  It works great.  It's well put together.  This product is identical to similar ones listed, just with different names.  They are no better or worse.  The vent clip is the stand out feature.  It's well put together and holds on tight.  There is zero chance this thing will fall off in transit.  The only reason I didn't give it 5 stars is because if you drive a smaller car, the sheer bulk of the arm will obscure too much windshield.  I went from a Chevy Trailblazer to a Corolla and there was no way I felt comfortable using the main holder.  Your mileage may vary.  My fault for not remembering how chonk this thing could be.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"What a mess....","reviewDescription":"I bought this in 2023, and it worked great for about 6 months. I actually like it so much that I bought a new one last month to replace \"this one,\" but I'm afraid to put the new one on because, as you can see, it weeps this thick sticky glue everywhere. I have cleaned it off a few times, but as you can tell, it just keeps coming. It's such a mess and almost impossible to clean.  What do you think?  Take the old one off and try again, or is the new one going to make the same unbelievably sticky impossible to clean mess?  I'm hoping \"VICSEED Phone Holders for Your Car people\" reach out to give me some direction, and I also humbly ask how I clean this gook off my window.  Thank you .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Not for textured dashboards","reviewDescription":"The #1 reason I purchased this was because it says in the information, “Includes a 3M adhesive pad which can smooth your textured dashboard”.  I cleaned my dashboard very well before I tried this and it didn’t even last a month. Added to which, the vent clip they show you in the picture is not the vent clip they send you. The one I received doesn’t fit my vents. I missed the return window by a day or I would be sending it back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Vicseed- that’s not what suction means","reviewDescription":"I bought this phone car mount because it advertised using a “strong suction cup” as one of the methods for attaching the mount to your car via the windshield- I live in Florida, and having read the reviews I didn’t want to risk using the adhesive to attach the mount because apparently heat causes it to melt and make a mess. I receive my package, only to find that the “strong suction cup” advertised by this company is not a suction cup at all, rather a silicone pad with adhesive attached.Vicseed, for your reference, here is the definition of “suction”: the production of a partial vacuum by the removal of air to procure adhesion. Suction cups don’t require adhesive, rather the suction is created by voiding a vacuum of air. As I can’t risk using the adhesive in South Florida, I am forced to use the vent clip, which I did not want to do as my large phone blocks the flow of AC. Very unhappy that this device did not perform as advertised, or even come with the advertised parts.Another note, if your phone has a PopSocket or something similar you will have to remove your case so your phone will be secure in the holder. Another disappointment, as this device was also advertised to accommodate all sizes and thicknesses of phone cases.","isVerified":true,"ratingScore":1,"reviewReaction":"52 people found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"Not so sticky","reviewDescription":"I bought this for my wife as we were going to be going on a pretty long road trip. I read a lot of the reviews and figured I would give it a shot. Much like everyone else I have been searching for a good car mount for a long time and have spent hundreds of doallrs on devices like this.This first issue is the puck that comes with the mount that you use to mount to the dashboard  had less glue than a piece of scotch tape. I stuck it to the dashboard and it slid off. I heated the sticky side and put it back on the dashboard. It stayed put for a while but eventually fell off while we were driving nearly causing an accident.W eventually got it to stick to the window, my guess is that it has more to do with the glue on the suction cup than anything, but it got us through the trip. The lijsting indicated the mount is  \"[Thick Case & Big Phones Friendly]\" which we did not find to be true at all. In fact, my wife has to remove her phone from her case to get it to fit as she has a pop socket the this mount will not accommodate.For now this Junker will go in the box with the rest of the useless plastic mounts of failures and disappointments.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"Garbage","reviewDescription":"I could not get it to stay on any part of my car, even the perfectly smooth pieces. The vent one would not stay in either.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Not Durable","reviewDescription":"The knob to position the phone broke (see picture for the crack) so the phone faces down and can’t be seen when I drive.  Just be careful when you tighten it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Mala calidad","reviewDescription":"Se daño con muy poco uso","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Not my cup of tea","reviewDescription":"It was really big in my vehicle.  I returned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"This Version Didn't Work - BUT...","reviewDescription":"Got this holder for a christmas present.  It didn't work for me in my Chevy Silverado as there was no dash area that was flat enough to allow the mounting disc to effectively adhere.  I reached out to Vicseed's customer service, and they were amazing.  Helen and May reviewed their products and replaced this holder free of charge with a new magnetic holder that works great.  I was super impressed with their prompt service and resolution!","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Doesn't stick well","reviewDescription":"Removed from windshield to move over and it would no longer stick. Only used it 1 month..","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Disappointing","reviewDescription":"I bought this not realizing there was an adhesion component and I was disappointed to find that out when the product arrived. I looked for options that didn’t have that. I was fine using the air vent clip version until it broke today.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622851200000}
{"reviewTitle":"Don’t buy it.","reviewDescription":"The suction cup doesn’t hold for more then 20 minutes ever. The clip that goes into the vent is cheep and the ball and socket part doesn’t hold the device where you want it, it keeps falling down.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Doesn't stick","reviewDescription":"It won't stick on my dashboard. Putting it in the vent it doesn't get tight enough to stay.  When I put my phone on it at times it falls on the floor.  It cracked my new phone hitting my stick shift.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620777600000}
{"reviewTitle":"Car phone mount","reviewDescription":"It did not fit my needs.  My phone would not fit in the holder and when it did, the suction power was compromised.  I was not able to adjust it to have the phone facing me.  It might work for other phones, but it did not work for my iPhone 11 Pro Max. Two stars!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1604448000000}
{"reviewTitle":"Aw, I had bad luck with my extension, but they seem to work for everyone else.","reviewDescription":"My phone mount. Had trouble with the ball attachment. In fact it broke for the extension.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Good but bad","reviewDescription":"If it wasn’t for the vent clip, I would have returned it.  The suction cup with sticky substance didn’t stay in place for 24 hours on a clean windshield.  I guess I will have to install and remove it every time I use it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616457600000}
{"reviewTitle":"did not stick to dash","reviewDescription":"Did not stick to dash no matter what I did. The clip is good in the air-conditioner vent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"So so","reviewDescription":"I like this phone mount, BUT i had a few troubles with it. The adhesive circle didn’t not stay attach, so the mount fell off the dashboard. The rotating knob that extends or shortens never worked.I have to push it back all the time to keep it in place.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625443200000}
{"reviewTitle":"Won't stay up. Ridiculous waste of money.","reviewDescription":"Nothing bought additional will help the weight of this to not fall.  Waste of money. Tried several different ways to get it to hold to different spots even.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Adhesive not durable","reviewDescription":"The adhesive is definitely not for Texas heat, it easily separates while the car is parked for few hours in sun. Need to rethink of using a different adhesive. The product by itself is designed well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625270400000}
{"reviewTitle":"Almost passed the test of time","reviewDescription":"Suction stickiness failed just after return period. Completely useless now... 😒","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693526400000}
{"reviewTitle":"Won't stay attached","reviewDescription":"Love the adjustability of this phone mount, but it will not stay attached. The suction cup seems to have some sort of stickem’ on the mating surface. I’m sure it’s designed to improve adhesion, but it doesn’t hold as well as others I have used without it. Every morning, it must be re-attached to the mounting disk. During the day, it will come loose randomly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Well.  The quality of the item is good.  But the dashboard doesn’t work at all. AT ALL.","reviewDescription":"The suction cup is great and but the dashboard pad doesn’t work at all. I cleaned the board and put the pad on it for an hour.  The moment I put it on, I knew it’s not gonna work.You can feel it doesn’t stick at all.  But I still wanna give it a try. Well. As the video shows, it doesn’t work.I’ll just keep it and use the windows \/ ac mount","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"United States","date":1628553600000}
{"reviewTitle":"can not use in multipal cars","reviewDescription":"I bought this thinking i could switch this device between my 3 cars by appling suction cup to windshield BUT according to the directions once it it is sucked in place and try to unstick it it wont stick again.I tried to use the one from my wife's car and ruined it when the suction cup rolled up into a ball while i took it off the disk on the dashboard","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641340800000}
{"reviewTitle":"Suction cup does not stay on window.","reviewDescription":"Did not meet my needs.  Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Doesn’t stick anywhere and doesn’t fit to clip on the vent.","reviewDescription":"It holds a phone well. Not that such a thing is useful if it won’t stick anywhere in the car without falling off and doesn’t fit correctly in the vents. It’s like it expects the little plastic parts of the vent to be narrower so it won’t go far enough into mine to actually latch on. Basically the car is an older model I bought for my au pairs, so I am just going to superglue it to the dashboard now.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629072000000}
{"reviewTitle":"Did not work","reviewDescription":"I tried using in my vents and i could not get it to go into vent and it would not hold my my Samsung note 10.So itried the the other option  the stickon base with the suckion cup and it keep comming off my dash. I finally use super glue to the base andsuckin cup and it is now working for me. I willprobably never be able to get it off my dash now.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629504000000}
{"reviewTitle":"Doesn’t stay longer than a week.","reviewDescription":"This product does not have good suction at all. It will not stay out for longer than a week. It just falls off. The vent holder works better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"Bad suction","reviewDescription":"The suction does not work at all. If you live anywhere were the car gets too warm or too cold it will come unstuck constantly.  Which is so unsafe when driving. I had to superglue it down so it would stay.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657670400000}
{"reviewTitle":"Loved it while it lasted! 6 days before the adhesive failed.","reviewDescription":"I really loved this for the 6 days I was able to use it! I wish the adhesive was stronger though! The flat section of my dash was cleaned thoroughly with 91% rubbing alcohol prior to application, to no avail.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657497600000}
{"reviewTitle":"0 suction power","reviewDescription":"This things sticks to your window by the suction cup but the thing is the suction cup doesn't actually suction to anything it just has a sticky adhesion substance on it, and when you flip the suction cup lever to tighten the mount down locks with such ease and it doesn't feel sturdy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640390400000}
{"reviewTitle":"After a few weeks the suction does not stick at all it falls off so easily","reviewDescription":"Look how easy it falls off with such minor effort. I've even tried washing the cup as the instructions asked but still doesn't work well.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"Not that great","reviewDescription":"3m tape is not sticky and after cleaning an area on my dash 3 times with 91% alcohol the suction cup pad will not stick to my dash. The suction cup part is sticky as hell and when put on the mounting plate, I almost couldn’t get the suction cup off because the silicone is so sticky\/gooey.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636675200000}
{"reviewTitle":"Not for thick case","reviewDescription":"Will not hold my iPhone XR with a thick case. I put it in there and it stays for a few minutes then falls out in the floor (I can’t answer calls when it’s on the floor). Good idea and I guess it will work with a phone with a thin or no case.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639008000000}
{"reviewTitle":"Just get an air vent setup","reviewDescription":"The suction cup is more asherant than the pad that they want you to put it on, and that pad cant even stick to my hand under its own weight, other than the reason you might be interested in getting this, the included air vent clip is all that is keeping this from the trash can, also the phone holder itself is pretty good as well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1612051200000}
{"reviewTitle":"Suction not strong","reviewDescription":"Tried many times to stick to my dashboard and no luck. Adhesive it not sturdy suction did mot work. I just use the piece I can connect to my vent","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656460800000}
{"reviewTitle":"6 weeks.","reviewDescription":"Worked great for 6 weeks. One arm broke off, and now it's useless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"Defective piece?","reviewDescription":"The round piece that goes on the car permanently did not get stuck and fell off only a day later.. I tried to get in contact with them but Amazon sends me to a weird website. I would just like a replacement for that part, maybe it came defective ? I don’t know.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Not in Texas","reviewDescription":"Can't hold up to the Texas sun. Lasted about a year and a half. Probably would work great in a little cooler environments.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665964800000}
{"reviewTitle":"Not dependable","reviewDescription":"Adjustable clip to attach to air vent does not stay tight.  Needed this adapter for rental car. Tightened the clip repeatedly still came loose. Phone and clip continually fell off causing my phone to fall off. But a dependable design","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644192000000}
{"reviewTitle":"Great so far.","reviewDescription":"Received my dash cam yesterday & it's great so far. I called customer service today & it was a pleasant experience.  I'll see in several days if I get what I asked for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680652800000}
{"reviewTitle":"Amazing Customer Service","reviewDescription":"I purchased one of the Vicseed Phone Holder and the clip of the phone holder got broken.I was able to receive the Clip back with thePhone holder after I contacted Customer service in just two days. The clip is also really sturdy and it attaches well to the Air vent.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1664755200000}
{"reviewTitle":"Good adhesion and maneuvers well.","reviewDescription":"This product readily adhered to a flat, smooth plastic surface next to my radio.  I’ve had no issues in either hot or cold with it losing adhesion.Only gripes:  1) that the clamp does not hold my iPhone 13 ProMax in OtterBox very securely (at near max the clamp will hold and almost too thick). 2) the button to release the mount when it’s tight on the phone is a) flimsy and b) poorly located (have to reach behind phone to release).Would by again.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1641600000000}
{"reviewTitle":"Repost","reviewDescription":"Originally gave this one star because it didn't work on the dash board like I wanted it to but they contacted me and tried to work with me even send me a new one for my car it also didn't work on the dash but for the window is great they really care about customer satisfaction","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Base sticks well to dashboard","reviewDescription":"Use to hold cell in view for use while getting driving directions","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Texas heat","reviewDescription":"Worked absolutely great for almost an entire year. Bought in August 2021, today the bottom adhesive just let go of my dashboard and even though I pushed it back down and reattached it wouldn’t stay. To be be fair to it though the Texas heat is crazy and this about the length of time I expected to last.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651104000000}
{"reviewTitle":"Pretty Good Product","reviewDescription":"It can be kind of a pain getting my phone in and out. My friends often pull the entire AC attached\/mount off when I have them put it in. It is reasonably sturdy put has fallen off a couple of times. Overall, this is a pretty good product.I do have an iPhone 12 Pro Max, so does fit this phone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649894400000}
{"reviewTitle":"Plastic breaks easily.","reviewDescription":"You'd think Id know that plastic is fragile by now, but apparently the last brain cell left with the rest of them. It works great in my Hyundai Veloster, just make sure you dont tighten it too tight, it WILL break the plastic. :)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Sturdy holder, vent clip is best option","reviewDescription":"Bought this as a gift.  It's easy to install and once done, holds the phone very well.  Even on road bumps, the phone does not move.  However, the black pad and its adhesive underneath does not stick, even after the 24hr wait.  The pad comes right off--it doesn't even feel sticky.  Because of this, you're defaulted to use the vent clip.  Great vent clip, bad adhesive pad for arm mount.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1640476800000}
{"reviewTitle":"Great, but....","reviewDescription":"Looks great, seems very durable, great price for what appeared to be really good quality.My problem was I had a pop socket mounted on the back of my iPhone 12 Pro Max case which would not allow the phone to fit securely in the clamp. Was not willing to get rid of my pop socket because that’s my favorite accessory, so I returned the holder.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Doesn't last","reviewDescription":"The adhesive material melted and the whole device fell off after one year and will no longer stick in place","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"Disappointed really...","reviewDescription":"The small disc's adhesive side (where you mount the main arm to hold your phone) doesn't stick to any surface. I followed the instructions: clean the area, press firmly and leave for 24hrs. But the disc merely slipped off, I figured the adhesive wasnt sticky enough. To make matters worse, its not like the suction cup can stick to any surface, it has to stick to that small disc or else you cant use the arm mount. Figured you can just place more adhesive to the belly of that small disc plate but I was hoping the arm would work and if im purchasing a product I would expect ALL of it to work not just 50% of it.However, the small vent clip works perfectly so the product isn't completely a bust? But it doesnt excuse the fact that I made this purchase mostly for the arm not the vent clip. If you were looking to use the arm like I was then it's best you find another product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1638230400000}
{"reviewTitle":"Very unstable","reviewDescription":"During driving,phone mount shakes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Waste of money.","reviewDescription":"This is the second brand of phone holder I ordered with the adhesive and both fell off in the cold. I will not use the vent feature because I don't want my phone to overheat in the winter. In my case it was a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Updated review, it melts!!!!","reviewDescription":"Edit: does not hold my new phone Samsung Galaxy s20, the best part about this phone holder is that it melts noticed the rubber dripping down my windshield. When I went to go pull it off I had to use a knife because it melted to my windshield.If you live in a climate where it gets above 90°, don't buy this.Holds the phone very well. We went on a road trip and at times this thing bounces quite a bit and the phone never came out and the suction never failed. Amazing to have for a road trip, I've probably owned 4 different holders and I'd say this is my favorite. Also the button to release the holder has a very well thought out placement. You can just grab and click in one motion.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"Did not stick","reviewDescription":"My cel is very light, the cel holder kept falling down, I put it on my window a few times and then dashboard just to see and it would not stay in place at all,","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Does Not Hold Suction or the weight of the phone (iPhone 11)","reviewDescription":"This item did not hold my phone. I attempted to attach it to the dashboard, the windshield, and even the side window. I also used the 3M tape to help. That didn’t work so I added additional store bought 3M tape. Still would hold my phone.  I ended up purchasing some heavy duty mounting tape that I saw on an infomercial (but bought the generic version on Amazon because it actually had better reviews).  I just attached it last night, so it hasn’t been out in the AZ heat yet, nor has it had to actually hold my phone....so we shall see. Very disappointed that the item alone did not do what it said it would and I had to spend additional money to attempt to get it to actually work. Next step may have to be actually MOUNTING it to the dashboard with screws. Ugh!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1602720000000}
{"reviewTitle":"Would not maintain hold on dash overnight","reviewDescription":"Did not hold suction to dash. 2016 Acura","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"It’s not working for me","reviewDescription":"Mine does not stick on the dashboard","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Can not activate warranty","reviewDescription":"Unable to activate product warranty. I wanted to activate because previous vicseed phone holder broke. Disappointed with vicseed customer service.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"The best results! Clear way to generate equitable services","reviewDescription":"The best results clearly open equal opportunities to improve the global markets correspondence with proper satisfaction and support . Thanks!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"Staying power","reviewDescription":"I wish I could give this 5 stars, but I can’t.  The arm won’t stick to the dish provided for the dash. I put the disk on the dash overnight and it won’t stick.  The weight of the arm and phone pull it off.  I put the arm on the window, and it slid down the window until the arm is resting on the dash.  I only kept it because I had a hard time finding a holder for thick phones.  I have a case on my phone and I don’t want to remove it every time I drive.  It is very sturdy and it’s very easy to get my phone on and off the holder.  I like the way the arm extends and retracts.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"Great, except...","reviewDescription":"This item worked great at first. Easy to use, lots of options. Phone didn't fall out or slip. Very happy with it but when I moved the mount to a second car with a different more textured dash the mount doesn't stick.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1683849600000}
{"reviewTitle":"Good product","reviewDescription":"It is here as well to the dash and I would highly recommend it as well be a good value","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"It does the job.","reviewDescription":"It's not exactly stylish or fancy. It simply gets the job done. If you have an extra large phone with a case like the Samsung S23+, the jaws of the holder barely can accommodate the case on the phone. But, it does fit!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Heat","reviewDescription":"Product was great but terrible for them hot days used the dashboard pad for 12 days and heat made the pad become loose and now I gotta use the vent mount","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"A Convenient Device","reviewDescription":"This product is easy to install and use.  I like that it has at least three different points of adjustment.  I've only been using it for a few days, so I can't speak as to the longevity of the suction sup, or the button that you push to release the sides of the holder, but so far it's holding firm.  My only wish was that it angled down more.  The section of dashboard that I had available is angled upward slightly, and it would be nice if the arm came down more so that it wouldn't be sitting so high in front of the windshield.  I haven't yet noticed any issues with it interfering with visibility, but it's something I'd take into consideration in the future.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Good","reviewDescription":"I bought two for two cars. Unfortunately one is broken. Then I bought another one. Seems ok now.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Rather disappointed","reviewDescription":"I rec'd the product yesterday and was all excited about mounting it to the dashboard of my car.  When I got home, I parked my car in the driveway and proceeded to read the directions and attach it to my dashboard.  Either my phone is too heavy or the equipment is cheaply made.  While the main part of the apparatus did attach, once I inserted my phone into the part that holds the cell phone, the entire thing came undone and would not re-attach to my dash. On the flip side of that, there is another way to attach your phone.  The piece that attaches to your a\/c vent seems to be the best option for me.  So I'm using that for now.  But I'd like to use the larger piece that attaches to the dashboard.  I'm going to give it another try this weekend, hoping for better results.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595894400000}
{"reviewTitle":"Doesn't work if you're phone\/case (Wallet) w\/ Popsocket measures greater than 0.5\"","reviewDescription":"Sadly my phone is 0.8\" according to my caliper. I have the S21 ultra with a phone case (VRS design) that has a built in wallet and attached on the back is the Pop Socket (gen 2) making it just a bit too thick for the arms to make contact.  The design does seem robust but falls short of those of us with thick phones. Also a little disappointing was that compared to the other phone holders that has a switch on the base to retract the arms so it auto closes when placing the phone on the holder.  That aside overall good build quality but sadly will have to return this and see if there are other options for me.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1622764800000}
{"reviewTitle":"Didn't work for me","reviewDescription":"I tried the vent clamp and the vent louver is too long for he clamp to  get a hold.  I tried the suction and my dash (Subaru) was too porous and the suction would not hold.  I tried the dash pad and there wasn't a strong enough adhesion to hold the device in place.  It kept falling off.  Maybe it will work for you but it didn't work for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635292800000}
{"reviewTitle":"Works","reviewDescription":"The adhesive on the suction cup is great. Has never fallen off my windshield since I installed it 8 months ago. The arms hold phones great, even my Galaxy S21+ with a pretty thick case AND popsocket on the back. My problem is that the suction cup WAS clear. The sun exposure over time has turned the suction cup and awful, ugly yellow. With it being suggested to be used on windshields, the suction cup should be black.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1631318400000}
{"reviewTitle":"Adhesive failure","reviewDescription":"This product is great, except for one thing… the adhesive fails when it gets warm, so if you park your car in the sun, be prepared to come back and find your cell phone holder on the floor instead of adhered to your dash.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654905600000}
{"reviewTitle":"Purchased for the dash mount, used vent mount","reviewDescription":"The adhesive on the dash mount was aweful and didn't stick to my girl's dashboard at all. Even with thurough cleaning, just slid right off.However, the vent mount is the most secure one I've ever used and fit my note 20 ultra with a thick poetic case beautifully!5 stars for the vent mount and phone mounts. 0 stars for the dash mount setup.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637366400000}
{"reviewTitle":"Suction cup not good","reviewDescription":"The suction cup melted and hardened to the point it was not useable. Difficult to clean the windshield where it was mounted","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675900800000}
{"reviewTitle":"Nice, but not for thick cases","reviewDescription":"Very nice phone holder, but it is definitely not for thick cases. I have an iPhone 12 Pro Max with a Case-Mate case and a thin holder on the back and it doesn’t even come close to holding! If I had my bling case with diamonds or my thick Otterbox it would be even worse! Don’t waste your money on this nice holder if you have a thick case because it’s only for a thin phone!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"Won’t fit with pop socket or loopy","reviewDescription":"The suction and sticky stuff on the suction cup work really really well. It never fell off my dash even in the southern heat. The problem I have though, is it says it for “bulky” cases. It wouldn’t fit my iPhone 11 with a loopy case on it, and it won’t fit with the slim case and a pop socket on it. If it was really created for bulky cases, then it should fit just fine with the pop socket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1608940800000}
{"reviewTitle":"Bed better","reviewDescription":"Bed that holds phone need to be deeper and adjustable, clips that hold phone should be longer, my iPhone has a charger attached to my phone, hold but could be better, can’t take a picture on the charger or my phone","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"Adhesive is not heat-resistant","reviewDescription":"While the adhesive works well in normal temperatures, it melts easily in high temperature environments, and it made a huge mess in my car.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"Struggles to hold my phone upright but good design.","reviewDescription":"I'm going to be contacting the seller. The design is great but the arm isn't strong enough to hold my phone up. I tried it with my daughter's smaller phone and it did the same thing. I already have the base stuck to my dashboard so I hope I'll be able to remedy this situation.The seller sent me an email already so I'm thankful they will be easy to communicate with.I will update this review after my situation is resolved.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Sucton works...for a little while","reviewDescription":"If I had written the review about 2 months ago I would have given it 5 stars but after a few months of use I can't keep it secured. I originally had it secured to the dash. I pulled it off one time and tried to secure it again...no dice. So I used the disc that came with it and for about and hour of my drive....looked great.  But then I got the ttiiimmmbbbeeerrr and it fell on the floor. Could not get it secured again for a long period of time.Update - After customer support notified me on how to fix, clean the suction cup, my issue the product is working very well. However, I left one star open because the heat did not have a chance to affect it. We will see next summer","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1606089600000}
{"reviewTitle":"Phone hooder","reviewDescription":"I like it just don’t stay stuck that great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Works well","reviewDescription":"I got this as a I move from vehicle to vehicle a lot (not going to buy 10 of these). The suction on this is great and sometimes hard to remove. Holds well when driving on rough roads.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1679184000000}
{"reviewTitle":"Muy bien","reviewDescription":"Excelente producto","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"Works Good + Lot of Features and Adjustability For The Price","reviewDescription":"Quality and adjustability are great, especially for the price.  Only issue has been the suction cup doesn't stick all that great to my dash.  I've cleaned, and cleaned the dash surface and the bottom side of the cup and about 2-3 times a week I'll come out to the car and it'll be lying on my floorboard where it became unstuck overnight and fell into the footwells of my car.  It's also getting more and more frequent as the spring and now summerish temperatures have come.  It still is a minor inconvenience all things considering.  Overall I am happy with it and would buy it again and again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624406400000}
{"reviewTitle":"Great little phone holder","reviewDescription":"Overall this is exactly what you need. I bought it for my wife to use and she is very happy with it. The adjustability is great and the different ways to move it around makes for a good versatile item. My only issue is that the sticky suction cup does leave a residue once you move it. Not a big issue if you plan to leave it in the same place. Overall very happy with the whole thing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656028800000}
{"reviewTitle":"May be too good at its job","reviewDescription":"This thing is amazingly good at sticking and holding the phone steady, even on bumpy roads.  The only issue I have had with it is that it is too good at sticking to its surface.  The adhesive on the suction cup is so powerful that when I set it down in a place on my dashboard to see if it would work fine there, my tiny weak arms had trouble removing it to move it to a different place.  Ultimately I had to go get a screwdriver to wedge under the suction cup to leverage it enough to detach it from my dashboard.  Fantastic product, but make sure you know exactly where you want it before you remove the protective plastic from the bottom.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"Love it","reviewDescription":"It was good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Great product!!!","reviewDescription":"I purchased this product for my 2017 Toyota tundra. I followed the instructions as how to prepare the surface. However, the suction cup did not adhere to the disc  which came with it for more than a few hours before my cell phone, to include the car mount, fell unto my gear shift while driving.  So I ended up placing it on the bottom portion of my windshield. And the suction worked great!!! Overall I’m pleased with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639353600000}
{"reviewTitle":"Best car phone holder found...highly recommend","reviewDescription":"By far, this is the best car phone holder I ever found after trying almost everything in the market. The extension feature and flexibility to reposition it is awesome! The suction and adhesiveness was not strong to hold a heavy phone on the dash board or windshield alone. I had to use suction on windshield and position the extended arm over the dashboard (se pic) to hold it safely without dropping from windshield. The front brackets could be redesigned to make it deeper and perhaps adjustable as well, with option to better grab and secure thick and heavy phones that use extra power battery (like mophie). The price is fair for the quality of the product. It is the most sturdy and reliable car phone holder to have, specially when driving over bumpy road. Highly recommended!","isVerified":true,"ratingScore":4,"reviewReaction":"88 people found this helpful","country":"United States","date":1596844800000}
{"reviewTitle":"Adhesive won’t stay stuck to the pad","reviewDescription":"Had high hopes for this phone holder but was disappointed. Phone is to heavy for the holder to stay upright in the ac vent. Tried to use the mount on the dash, after adhering the pad to the dash (24-48 hrs) the sticky pad that attaches to the mount that holds the phone won’t stay stuck. Useless","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1668038400000}
{"reviewTitle":"Locking arms too thin","reviewDescription":"Despite the description saying this holder can hold large and chunky phone cases, this holder couldn’t grip my iPhone, in a hard case, with a small silicone card holder on the back. My phone isn’t unreasonably thick, really. I actually bought two of the higher end holders on here until I found one -  for less than $10 - that actually could grip around my phone. Very disappointing how limited phone thickness can be with most holders on the market.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1642464000000}
{"reviewTitle":"Suction sucks","reviewDescription":"Lasted about a week it got sunny a couple days ago and the suction stopped working and it fell off my dashboard (I also had to buy extra sticky pads in order to not use the suction directly on my dashboard since I saw reviews saying it pulled off parts of the dashboard and the thing it came with didnt  work ) anyways I tried to put it back on after it had cooled down but it keeps falling off and landing in my cup holder lmao waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646179200000}
{"reviewTitle":"Gutted!","reviewDescription":"I sent this item as a gift for my best friends daughter who just got her first car when it arrived it was not at all as expected it was flimsy and didn’t stick to the dash. I don’t normally leave reviews but as I didn’t know how to contact the seller to rectify it I’ll have to leave one. But I wouldn’t recommend this item unless we got a bad one?! For the money I would have expected better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1642118400000}
{"reviewTitle":"Spring doesn't last","reviewDescription":"My return window closed August 1 2020 for this car mount.  Due to Covid-19 I didn't travel as I've out of work and did Zoom appts for the family.  I just went back to work last week for three days and I'm on day two this week and the spring no longer holds the phone in the mount.  I'm incredibly disappointed and wish I had an option to contact the seller and get a replacement as I'm hoping it's a fluke.  Shouldn't stop working after 5 days. Very frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1599264000000}
{"reviewTitle":"Dont waste your time.","reviewDescription":"Dont waste your time and definitely dont wast your money. If you like it as decoration then fine, but once you stick a phone in this thing it will jist fall off no matter what you do. The company knows this obviously, because they send you an email after you buy it saying if it doesnt qtick they'll send you a new one, but they jist make you try differnt methods that still dont work then jist ignore you. I threw this thing in the trash where it belongs.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646438400000}
{"reviewTitle":"The adhesive does not work!!!","reviewDescription":"This cellphone holder was extremely disappointing! After following the directions I allowed 3 days for the adhesive to set before applying the cellphone holder. Then I allowed another 3 days before using it for my cellphone. It only held my cellphone for about 1 hour before toppling over! I have  an I phone XR in a clear I phone case with a flat fingering. Unfortunately the width and the grip was also problematic. I would not recommend this product mainly because the adhesive doesn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1616716800000}
{"reviewTitle":"Product broke within 1 month of use- not able to contact product support","reviewDescription":"This didn’t last for a month. I am just 2 days away from the amazon return window and it breaks. The holder doesnt work anymore. I feel like i wasted my money on this. I don’t know how to contact the support since, it doesn’t let me email them.I would very much want a replacement sent to me or refund the amount i paid.Edit: The contact us form wouldn’t let me contact the support folks.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1625961600000}
{"reviewTitle":"Doesn’t Stay On Long!","reviewDescription":"I came on here looking for how to install it, it stays for a few minutes & then falls off, the longest it’s stayed mounted to my dashboard was 1day! This is my second one & it this point I’m ready to return it, I even washed the suction cup & it got sticky again, but when I went to push the lock down it feels secure but falls off within minutes! Can somebody help me please? Otherwise I will be returning this!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1621209600000}
{"reviewTitle":"Not what I expected","reviewDescription":"Do not stay on. Kept coming off the console. Poor quality","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"Phone holder","reviewDescription":"Don't  stay up it  falls  down give 1 star I don't  like it at all","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Overheated Phone or Drive with Vent Closed","reviewDescription":"I found out too late to return the product that the phone on the dashboard overheats in the sun while driving. I tried the vent option, but found that you will have to drive with the vent basically closed because the vent will not remain open with the weight of the holder\/phone attached to it. Just some things to consider before buying. I would be returning the item if I had discovered this issues earlier.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Did not stay glued to the dashboard","reviewDescription":"Followed directions. Cleaned dash with alcohol. Placed the black disk to the dash, waited 24 hours I then placed the suction part to the Black disk. Waited till the next day to put the phone in, and the disk came apart from the dashboard. I wish I could give it 0 stars.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Hilariously Bad","reviewDescription":"Deceived by the good reviews. It didn’t stick at all, even after meticulously following directions. Can’t even return it so now it’s only future is in a landfill.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Melted - bad quality","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Doesn't lock well","reviewDescription":"This car phone holder does not stay locked. Every time I go over the train tracks or a bump, the lever becomes unlocked dropping my phone to the lowest position. I have to readjust every time I come to a stop light or stop sign; it's annoying","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Didnt last","reviewDescription":"The stick part didnt work long i needed it but it was made great","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Will not fit my phone.","reviewDescription":"Product looks good, however it will not fit my phone.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Didn't Stick On Cleaned Surfaces At All","reviewDescription":"This didn't work for me at all.  I followed instructions and cleaned\/dried my dashboard.  The adhesion would work for about 5 minutes before falling to the floor of my car.  It was a distraction at best.  I had to stop the car and find my phone - which was still in the grips of the display.  I don't recommend this.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"Doesn't stick AT ALL","reviewDescription":"Per the instructions, I wiped the flat area of the dash with rubbing alcohol, which a wipe was not provided as it said. I placed the sticky base on that area and let sit for 24 hours. The following day I went out to attach the mount and before I could seal the suction cup, the base detached from the dash with almost o effort. I tried to stick it again, and it still didn't adhere. Returned it after that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"Won't fit phones with case","reviewDescription":"I couldn't fit the phone with the case. Wasn't for me. Returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Works for a normal phone","reviewDescription":"I thought it was great until I decided to use it with my phone which has a thick phone case. The product claims it's for big phones but it was still too small for mine so it's useless for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646611200000}
{"reviewTitle":"Did not stick","reviewDescription":"My dash is Level. After reading other reviews I made sure I cleaned my dash well. I used Rubbing alcohol, put the sticky pad down and left for 2 days before I attached phone mount. It fell off immediately.Ended up just mounting to my air vent which is exactly what I did NOT want to do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Does NOT stick","reviewDescription":"I loved that the vent connector was easy to place and the holder itself was soft and held my phone tightly however; the dashboard mount did not stick at all.  I had received a replacement of this product and it did not stick neither. If it would have had better adhesive it would've been the perfect mount.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628035200000}
{"reviewTitle":"Suction cup does not hold to all dash materials","reviewDescription":"The vent clip feature and holder for the phone are great, and is what I use. However, I bought the product for the suction cup mount. The suction cup adhesive is very weak and does not hold to the dash. My dash is an Audi and is fairly smooth.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"Nice","reviewDescription":"Thought this was supposed to hold phones that had big cases? 🤔 that was t the case with this one. It still does it’s job, I just have to remove my case every time I wanna use it. If you must know, I have a wallet case for my iPhone. So that’s possibly why it won’t fit cause of my cards. I’m not complaining tho cause like I said, it does it’s job","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616716800000}
{"reviewTitle":"Ease of operation.","reviewDescription":"The product is easy to assemble and sits well in the cup holder. After one summer, however, the opening mechanism didn't work well. One side was \"frozen\" and had to be forcefully opened after which it remained hard to open if closed on the phone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637107200000}
{"reviewTitle":"Great purchase but poor adhesive","reviewDescription":"I had a really hard time keeping it attched. It kept coming off the dashboard. Somehow it managed to stay on when I attached on dashboard corner next to steering wheel. So now its been working great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651276800000}
{"reviewTitle":"Good phone holder","reviewDescription":"Awesome phone holder, the only thing I don’t like is HOW adhesive it is. Other people might enjoy this but I almost ripped a panel off of my car trying to move the holder over haha. It is now a fixture of the car and will remain there forever.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632268800000}
{"reviewTitle":"Fabulous mount until the hottest day in FL","reviewDescription":"Funny how this mount stayed stuck to the window everyday until the day after it was returnable. Yesterday was the last day this mount could be replaced. Crazy coincidence. It worked flawlessly until today. In florida with all of the humidity and heat, it just could not make it another day. Total letdown on this product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625788800000}
{"reviewTitle":"Don't work good","reviewDescription":"After just 2 days in my dashboard it goes off like a limp plant, put it back again press it and let it stand for minutes in a cool surrounding under our big oak tree. Try it again, nope, still won't stick. The only good thing is i can put it in my car vent. But the suction? i don't think so based on my experience.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1621468800000}
{"reviewTitle":"Melted in under a year.","reviewDescription":"Worked really really well….until it melted. I will say it’s been a hot month but still. I would not put this on your dashboard. I can easily get this off of glass but I think it would have ruined a plastic dash.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Suction sucks!!!","reviewDescription":"If fell, the sticky pad didn't stick! If it wasn't for the vent clip I would have returned it! I wanted it on my dashboard!  I settled...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679011200000}
{"reviewTitle":"0 for 2","reviewDescription":"I've never written a review before, but this one's a  public service. Device comes with a vent mount and an adhesion\/suction. Tried out the vent mount first and it promptly broke the slat of my vent. Figured I'd give the suction a chance. Applied the adhesion, waited 24hours and used the suction on it. The adhesion immediately broke and fell off my dash. Oh well. I'd advise you to look at a  different product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1610841600000}
{"reviewTitle":"Broke after less than a month's time...","reviewDescription":"Plastic nut that is suppose to secure the holder in place broke yesterday. I can't navigate their website. It is in another language and has the 404 error code. Then it just opens up a new home page. Disappointed it broke already especially since I've been using it every work day. I really want to like this product, but I'm pretty bummed it broke so quickly when I've only used it for about 2 weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625184000000}
{"reviewTitle":"It’s too heavy to stick","reviewDescription":"I was so excited for this mount. I needed it to create content. I cleaned the dash and attached the metal pad (because the dash isn’t completely smooth). I waited 24 hours and as soon as I attached the suction cup to the pad it came completely off the dash. It didn’t even have the phone in it yet. Super bummed 😕","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635638400000}
{"reviewTitle":"great design...suction cup sucked","reviewDescription":"The design and concept are spot on however the suction cup left alot to be desired....i could not get it to stick and stay on anything including the windshield...it would stay for a bit and just fall off...i even cleand it as the instuctions said but not luck...would not stick to anything...so i modified it to sit in my truck the way i was wanting it too ...just without the suction cup","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625529600000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"What a waste, the phone Mount won’t stick to the circle dashboard Mount. It sticks for about 30 min then begins to detach. The one time I didn’t catch it the sticky part landed on the floor of the car and got gravel pieces all over it now it doesn’t stick at all. I used this product a whole 2 hours before buying a better phone Mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"Not for otter cases and phone","reviewDescription":"I have a note 10, plus other case plus card holder for my id attached to my case, my set up is too thick for the arms to hold, just a 1\/4\" wider it would be fine, why limit the thickened holder so much? I'm frustrated that this is a common issue for me, I'm sure I'm not the only one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621296000000}
{"reviewTitle":"Not what it says","reviewDescription":"The product says for thick phones well I have a Samsung s21 and it would fit that normally but I have it in a otter box and I thought hey thick is going to hold it while in the case nope there is no way this is meant for \"thick\" anything as my phone bearly fits out of its case","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636502400000}
{"reviewTitle":"Loved it but broke after a month of use","reviewDescription":"I loved this product, it was super simple to install and I used it every day! But after a few months of use it won’t stay tight and when I put my phone on the holder it flops down and faces the floor. I’ve checked everything! I didn’t install it wrong, it’s broken!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1662249600000}
{"reviewTitle":"Doesn't hold actual thick cases","reviewDescription":"Idk what they think a thick phone case is but this thing doesn't hold actual thick phone cases. My car mount before this one fits my thick phone case better and it's not even advertised for thick cases, like if you have an actual protective case on your phone this mount will not hold it. I have to remove my phone from its case to be able to use this mount","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1620345600000}
{"reviewTitle":"Ugh","reviewDescription":"Followed all the directions and it just would not stay suctioned to the dash. I mean if your phone is ultra light it would work but my phone is heavy so it just won’t stay adhered to the dash. I’m unhappy with this purchase and asked for a refund","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649635200000}
{"reviewTitle":"Fell off my dashboard after two days of use.","reviewDescription":"The clip works fine but the adhesive that is used is not good at all. Came off my car’s dashboard with a few days of use After installation. I would use the suction instead but the manufacturer of this product thought it was a bright idea to put sticky adhesive on the suction portion of the stand. All together save your money from this one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1640736000000}
{"reviewTitle":"Sadly Disappointed","reviewDescription":"I followed the instructions and even seriously cleaning the dash before installation but still after the 24 hours instructed to wait for the adhesive to work my whole mount toppled over in 5 mins with my phone in it. Also the clip is not big enough to hold my iPhone with its case on. Sadly sadly disappointed bc I really wanted this one to work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"Absolute garbage!","reviewDescription":"I bought this because it said it was \"big phone friendly\". It is anything but! Neither the dash mount nor the vent clip will hold my phone. And my phone isn't THAT big or heavy. The phone fits, but the dash mount falls off as does the vent clip.For personal reasons, I couldn't try to install it until today. I have missed the return window. That's $25 down the tubes.This thing is junk. Don't buy it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"Great while it lasts","reviewDescription":"This phone mount works great while it lasts. I’ve bought two now figured the first was a fluke. They break in the same spot every time. The weight of the phone breaks the mount everytime. I will be looking for another mount. Each one lasted maybe 4 months this one maybe 2 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660176000000}
{"reviewTitle":"Super cheap","reviewDescription":"Not a very good quality product one of the adjustment plastic nuts just crumbled this piece of the product was not abused or overtightened realizing that it seem to be not very strong also could be partly because of the hot weather would not recommend this product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1662768000000}
{"reviewTitle":"Do not waste your money like I did","reviewDescription":"This item was useless 😕 it does no contain any stability and it does not hold the phone up, my phone it's super lightweight and it doesn't stay.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683590400000}
{"reviewTitle":"came broken","reviewDescription":"do not buy. as soon as i opened the box i didn't like it. it was way bigger than it looks, almost as big as my cellphone. on top of that, the plastic thing that's suppose to tight the screw so the lever stays in place came broken. it turns and turns and turns and never looks. than you for making waste my time and my money","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1608768000000}
{"reviewTitle":"CAUTION: Breaks windsheilds!","reviewDescription":"Went to take this mount off of my windsheild since i got one that attaches to the vent with the mag safe thing on the phone... this mount WILL NOT come off, it has created a spider web on my windshield and the windsheild needs to be replaced now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"Not as advertised.","reviewDescription":"So the mount is supposed to be able to hold thick phone cases. It claims to hold thick battery cases..........I have a 10000mah newdery battery case on my phone and the car mount doesn't even begin to hold the phone and case in place at all. The arm depth is very shallow and would likely have a hard time holding an Otterbox defender case. For the first time in Amazon, I feel like I wasted money. I will probably be returning it for a refund","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1603584000000}
{"reviewTitle":"cell phone head is poorly designed","reviewDescription":"The head that holds the phone is designed so it turns the phone off when you put it in the holder. The cell phone has to be manually held in position as the clamps are squeezed by hand to close the clamps around the phone. The head is rendered worthless because of the way the clamps have to be squeezed by hand to hold the phone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1632700800000}
{"reviewTitle":"Disappointed","reviewDescription":"The suction cup is great . I cleaned my dashboard, waited for it to dry applied the adhesive pad waited 24 hours like the instructions say and then placed the suction cup on the pad and in less than 10 minutes it fell off and wouldn’t stick again. The lever on the air vent works great but that’s not where I wanted my phone . It sits too low I needed it in the dashboard. So yeah a waste of $25 bucks","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"Cannot get it to stay attached to windshield or dash","reviewDescription":"This phone holder looks great but no matter what I do, I cannot get it to stay attached to the windshield or dash using the suction mechanism. As soon as a little vibration happens it falls off. No other option exists. Maybe the one I got has the suction mechanism faulty. I will change my review if manufacturer can get it to work for me. Otherwise I am returning it. It's currently a dead weight.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1639958400000}
{"reviewTitle":"Suction was useless","reviewDescription":"The suction was totally useless I put it on my dash would never stay suctioned. Useless for dash use. I don’t know about the other option. Only wanted it for dash. Could not remove the adhesive piece off the dash it is still there. also missed the refund date I didn’t even have time to try to fix the problem.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1634428800000}
{"reviewTitle":"Details are Important","reviewDescription":"1. You need to have a smooth surface to utilize the suction cup. They do provide you with a plate with a foam double sided tape for this reason. I am not doing that, just personal preference.2. Suction cup has to be on a level surface.I could have avoided much of this if the description properly written out.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1633564800000}
{"reviewTitle":"Garbage","reviewDescription":"Followed the video instructions, and the sticky pad that suppose to stick to your dash fell off before even putting my car in drive, i touched it and wasn't even sticky...Welp its not the end of the world right because i can just stick on my windshield. Nah just fell off before getting onto the highway.  Once again ripped off by dollar general store quality products sold on amazon but thats nothing new.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1640736000000}
{"reviewTitle":"Total fail in TX heat.","reviewDescription":"Waste of money the phone cradle didn’t adhere.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"This was the worst purchase ever","reviewDescription":"The suction would not hold no matter what I would do. I did everything the instructions said. Would. Not. Hold. I ended up throwing it out of my window this is a disgrace of a product. Do not buy this BS.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"This car cell phone holder has three different adjustments, looks good, has Good visibility.","reviewDescription":"This is a nice phone holder. It can hold any type of cell phone you might have as the adjustments on it have a wide range. Has good gripping capability so that your phone will not fall off during any type of driving. It can also be dismantled from the holder so that you can insert it into your fresh air vents also. One drawback I found however, is that the holding apparatus on this unit will not accommodate a phone which has a protective case. The grippers are not large enough, so if you use it on top of the dash, you will have to take your protective case off the phone.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Phone heats up in sun","reviewDescription":"There was little wrong with the product itself, though I'm unable to remove it from my car now, it's so firmly attached.  However, if your considering this product think about your placement.  Will your phone be in the sun, will the phone have ac blown directly onto it?  My phone would heat up on the dash, and turn itself off after an hour or 2, and it was a brand new phone at the time I bought this.  Fine product in terms of quality, but does it even accomplish what you want it too.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"VISCEED phone mount review","reviewDescription":"Hi, I like this product but when I first bought it, the mount came off so I was in utter shock. Nora from the company agreed to ship me the replacement ASAP which tells alot about her character. She was apologetic and responded right away to ship me the replacement. I am very happy for that and her customer service skills are impeccable! She will go the extra yard to ensure that we (the customer) is satisfied with the service and product. I will go back to her and buy the same or another product if need be.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"it's good","reviewDescription":"I had to use the connector for the a\/c vent and it works good.  Was not able to use the suction cup or the adhestive.  I didn't want it on the windshield.  There was not enough room on the plastic on the dash for the adhesive.  2023 ram longhorn.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Impressive","reviewDescription":"*Tested on an LG V60 with Dual-Screen Case*For heavy phones like mine, this one holds up great! Not once did my phone or the arm of the mount fall, a problem that I had with my other car mount. Installation to my windshield was pretty intuitive, and I have to say, I like the look of it as an addition to my car. It fits well and makes management of my phone easier while driving. The only slight gripe I have with it is the fact that the part that holds the phone itself (the fingers I guess?) curve inward too much and don't fit my case completely. This may be due to the extra thickness of my phone's dual-screen case and is probably an issue unique to those with extra thick cases. I would've probably preferred not having the extra curvature. However, it still holds my phone just fine, but isn't quite a 100% satisfying fit (r\/mildlyinfuriating). Would still definitely recommend this for everyone who is looking for a phone mount that supports larger phones.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631664000000}
{"reviewTitle":"It's good until it's not.","reviewDescription":"After moving it to a new spot a few times, it gradually falls over while you're driving. Lasted 4 months.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Great customer service","reviewDescription":"I wrote an earlier review for this product that was not so happy with the mount. Since then I have had great customer service from VICSEED. Because the mount would not work with my vehicle, VICSEED asked me to just keep the mount, and the company refunded my money in full. Furthermore, they wanted to figure out if another mount would work instead of the one I bought. Should you buy this product, you will not go wrong with the excellent customer service you may need.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1682726400000}
{"reviewTitle":"Get one with auto closure","reviewDescription":"My last one was an iOttie and it would automatically grip the phone. Now I have to use both hands to secure the phone in the holder.Mount is very secure. Release is easy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"Great Customer service !!!!!","reviewDescription":"My Car mount stropped sticking after 5 !\/2 months. I contacted cs and within hours they shipped a new one.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Not Bad","reviewDescription":"Not bad. I did not return, but if u can find a better one, get that one. There can be better options🙃","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Overall Worth The Buy!","reviewDescription":"I waited to review to see how this held up. IT STILL HOLDS UP! It's been over a year and the suction power is just great. We've had heat waves and freezing temperatures and it has a set lost its adhesion.The only con is I always have a popsocket on my case, and because it takes up a lil room in the back, sometimes it takes some finessing to get it just right so the sides will clamp just right. Otherwise my phone falls off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622505600000}
{"reviewTitle":"Quiet and Holds Nicely","reviewDescription":"I’ve had it in both cars for 6 months now. We swapped the one my wife had because this one was much nicer. I used mine horizontally, she keeps hers vertical. If you leave it open without a phone it may squeak some. But just put the grips back in and it stays quiet. Only downside was I moved it a little on the pad when I turned it horizontal so it lined up better and it loses some sticky. But 6 months and holding, so I’m still very happy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617753600000}
{"reviewTitle":"Good car mount","reviewDescription":"I only returned this because I wanted a charger and ordered by mistake.  Very sturdy and good customer service.  Not happy with having to pay to return it though.  If you get a printed label it costs 7.50!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648166400000}
{"reviewTitle":"For The $$ it works Great","reviewDescription":"The one that attaches to the vent work great, it easy to install. I just site my phone there and it stays, I rearly clamp it in. The one on top I haven't used yet, but I will update it if it doesn't perform. A tip for people where I stick mine Is a flat surface  near the screen. The top of the dash might not be a flat surface.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632182400000}
{"reviewTitle":"Nice holder and great support on products","reviewDescription":"This is a very sturdy phone holder. I have a Samsung S20 Ultra phone with a removable popsocket  holder on it as well that I use . I have used this for about a month in the blazing  Florida heat. I am happy with product sofar  only complaint the stickiness of the pad is starting to pull up from dash however not a big deal to change. I would definitely buy again and happy with purchase. The customer service for these products are great as well.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1600646400000}
{"reviewTitle":"Good mount","reviewDescription":"I like it well enough. I'd say it almost has too much suction on the cup, it's really hard to get off once you get it on so just be careful. I like all of the adjustment points and it's pretty sturdy but with all that it's a little more bulky then I would like. It was a bit difficult to find a good mounting point without obstructing my view but overall it is a good product and I'd recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623888000000}
{"reviewTitle":"Perfect fit for my car","reviewDescription":"I have a Kia soul 2014 and the kia soul has a circle in the middle the stand worked perfectly for my car. Great buy.. it wasn't bulky or anything like that.49 people found this helpful","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659657600000}
{"reviewTitle":"El tornillo al ser de Plástico al mes 8 se tuesta por el solY tienes que comprar otro.","reviewDescription":"El tornillo al ser de Plástico al mes 8 se tuesta por el solY tienes que comprar otro.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669161600000}
{"reviewTitle":"Doesn't allow room for Pop socket","reviewDescription":"Does not work well if you have a pop socket. My phone stays on but it is not on tight because it's literally on the edge of the support on the bottom and the side only clinches a bit of the phone. If we drive over a bump or turn hard, it falls off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643932800000}
{"reviewTitle":"I wish it stood in place!!","reviewDescription":"I love that you can adjust in all directions to maneuver your phone. But I do wish the suction  was better because it just falls off when the car is sitting for a while. So I have to constantly take it off whenever I'm done using it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"Adhesive didnt stick","reviewDescription":"I cleaned the surface of the dash and put the adhesive pad down and pressed it down and whatnot and when I came back the next day I put the suction on it and it came right off the dash.Easy fix though as I just suctioned the Mount directly to the dash and haven’t had any problems. The vent mount also works really well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633564800000}
{"reviewTitle":"Absolutely love it","reviewDescription":"Easy to install. Suction portion has yet to move. The arm is extendable so easier to reach if installed farther away, however at least for my phone with Otterbox in place, it doesn't want to always hold the phone up, almost as if it is too heavy for it. Regardless, was very pleased with it on our 16 hr drive across country! Would purchase again!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633824000000}
{"reviewTitle":"Liked product, sketchy company read description","reviewDescription":"Super easy to use, durable and Roomy for those larger phones.Update: still love the holder, however I found d the sketchy FB messages disturbing.  The company offered to let me try 1 of 2 products for free. I chose one and then they wanted me to pay for it through Amazon and screenshot it to know how much money to send me back... too sketchy.  The should be able to send product free on their own or through a discount code.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"Works best on smooth flat surfaces like glass","reviewDescription":"Good product... if you attach it to a window or similarly smooth flat surface it sticks real good... dashboard... not so good.  It will slowly peel off and drop with the weight of the cellphone.  It does come with a stick on plate that you basically glue to your dashboard as a mounting point.  It still wants to pull loose but if you put something under the arm to relieve the cellphone weight it works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1604102400000}
{"reviewTitle":"Perfect","reviewDescription":"Good phone mount. Excellent fit. Will purchase again.  The extension makes it all the better","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Pretty good!","reviewDescription":"Better alternative to the cellphone holder that clips to your car's air vent so it doesn't block the air and fall out easily. This mounts to the dashboard and you could position it the way you want. However without the adhesive on the suction piece, it will not stay in place. I wonder if it'll ruin or leave goo on the dashboard when removed.  I gave it a 4 stars only because of this. Otherwise, it's pretty sturdy and serves its purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1597276800000}
{"reviewTitle":"Dont use it in places that have curves (the black base)","reviewDescription":"The product is almost  perfect feels like you got quality holding your phone but I got a sock pocket in my phone like many people and it almost falls out to the front if its too thick so maybe you guys could enlarge the arms of the holder but other than that it’s perfect and i would buy it for all my cars if I had more it also look really futuristic","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622073600000}
{"reviewTitle":"Not Bad, Quite Handy","reviewDescription":"Had this for about a week now?  Thus far, it's only fallen off once, but I think that has more to do with where I placed it in my vehicle rather than the adhesive.  I was worried about that since it's crazy hot right now, but it hasn't been an issue since.  Otherwise, I'm diggin' it.  Not a bad mount at all.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625961600000}
{"reviewTitle":"Weak Adhesive; Cooperative Seller","reviewDescription":"The adhesive for the mount pad could be stronger. However, I made a formal complaint to the seller and they sent another product without hesitantion","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665187200000}
{"reviewTitle":"works well appears sturdy","reviewDescription":"so far so good i have only two complaints. the release button could be in a better place and open the holder fully in stead of taking three pushes becous one and to pushes doesnt open it enough to remove phone and being in a awkward place just makes that it is in a awkward place more annoying","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632182400000}
{"reviewTitle":"Very solid phone mount","reviewDescription":"I had been looking at various mounts for my iPhone XR for a long time.  I finally settled on this mount, and I can say that I am very pleased with the results.  The mount is very well made, and is very solid.  The suction cup is very strong.I initially tried this as a window mounted configuration, and when I tried to remove the suction cup, it took me several tries to actually get it off.  The cup does have a sticky substance on it that helps hold the mount in place for longer amounts of time.  Just beware that the sticky solution can wear off if you move it around a lot.  I ended up going with a dashboard mounted configuration, as the unit comes with a flat pad so that the suction cup can be mounted on the dashboard in case it's a bumpy surface, like most dashboards.The mount is easy to manipulate if you want to change from portrait to landscape for map\/gps applications.  Just make sure not to tighten the ball mount on the back too tightly, or it will be hard to move.  The mount is also well padded at points where it contacts the phone, and the holders on the mount extend to a very wide with for larger phones.  It holds my iPhone XR, with my OtterBox Symmetry case, very securely with plenty of room to spare for larger phone models.I like that the mount has a release button on the side to expand the mount clamps when you want to remove your phone.  The button can be hard to find, depending on where you have the mount, so be sure to leave some room to push the button so you can easily remove your phone when needed.All in all, a great product for the price.  I would not hesitate to suggest this mount as a great option for your vehicle.","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1641772800000}
{"reviewTitle":"Great size options","reviewDescription":"PROS:1.  Several adjustable options make it fit for every phone and almost every desired position.  It has adjustments on the arm that make the arm move forward and back which is good for the distance you want from your window\/dash to your hand.  It has a bendable up and down option so you can move it up towards the window or lower.  It has a rotating end so you can turn your phone in a variety of directions.2.  It gives you several parts so you have the option to stick on your windshield, stick to the dash or put in the vent.3.  I love, love, love the adjustable side arms so that you can adjust it to the size of your phone and make it lose enough so you can just drop your phone in and pull it out without two hands.  THis was the number one reason I bought this model.  It also has rubber on the inside to keep your phone in place.4.  The suction really sticks to the window.CONS:1.  If you are going to use the sticky pad for your windshield you better make sure you put it exactly where you want because taking that sucka off is almost impossible.  The little tab they give you to pull it off is so small it's almost impossible to pull and grab.  I wanted to move mine but I can't get it off.  I'll most likely have to use a knife to create a pocket of air to pull it off.2.  Don't place it too high on your windshield because though it has a rotating end, I found the rotation is limited.  Also be careful not to place it too high where it will hit your mirror.  Remember your phone is higher than the unit empty.SUMMARY:  This is worth the buy.  It's easy to put together and comes with many options.  I bought two and recommended it to my parents.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1625184000000}
{"reviewTitle":"It’s a good sturdy product","reviewDescription":"Overall this is a great product. The suction cup works like a suction cup. I recommend using the vent clip because after the arm fell off I decided that the clip stays on and does everything I need. The ball joint on the back of the stand gives it good motion but the screw holds it in place when needed. This product works well and does what it’s made to do extremely well. I highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"VICSEED is my trusted brand for car mounts!","reviewDescription":"I like how they include the suction cup mount and the vent clip so you have the option to choose. I’ve tried many different car mounts, but having to buy them and return them was a hassle. I then decided to try VICSEED’s dash mount. Super easy to use and navigate. I love having my phone vertically up and down, but sometimes I need it horizontally so I can use the navigation system.As I tighten down the screws to adjust the car mount, I noticed how sturdy it was and it didn’t feel like it was going to break as I was tightening it. I’m not sure if you’ve had other car mounts, but when I tighten those, I strip the screws and it no longer holds the level that I need it to. With VICSEED it is super tight and holds my phone well.One-handed operation is something I also look for. I need something that doesn’t take much time and requires me to use both of my hands just to put my phone on a mount. If I can use one hand, it’s a 10\/10 for me. I’m always on the go and I require that my phone stays securely on the car mount. If my phone were to fall on the floor, it would be super dangerous for me to look down and find my phone on the floor.It sticks so well to the dashboard and the suction cup is powerful. I cleaned my dashboard with a cleanser and made sure there was no dust sticking onto the suction cup (that’s the number 1 reason why suction cups fail). They also included a 3M adhesive pad which I could’ve used if my dashboard had a textured dashboard. I also have the option to put the car mount onto my windshield if I wanted to but decided not to.Overall, this car mount is something I would buy again if I were to get a new car. I would 100% recommend this to anyone who wants an easy-to-use car mount! The customer service is super friendly and they will literally answer any questions you have. If you need help finding a mount, they’ll help you right away! I love this brand and the products they make! You won’t regret it!","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"STOP! Purchase NOW","reviewDescription":"This is perfect. I have a SAAB 9 7x that has square rotating air vents so I really needed more of a dashboard suction kind of phone stand. The problem I often have is the dash is textured and does not hold onto the suction stands for too long. However, this phone stand uses a special kind of system that has a base with glue (that is only usable once, so place well) but cures for 24 hours. After the base is set then the suction part cleanly sucks up the to base, leaving you with an amazing phone stand that will not budge under any rough terrane.The phone holder itself, I guess you could call it 'basket', fully adjusts to your phone using a gear system. The phone cannot fall out due to the friction and slight pressure the stand uses on the phone. In order to release your phone, you just press a small black button on the side, where the gears retract outward and release your phone. On the bottom of that stand, there is a little lip that holds your phone up a bit, it is split into two parts to allow you to charge your phone while it is on the stand.My husband uses the air vent component (both parts are included when purchasing and remember I got two). The air vent component fits perfectly in the Honai Sonata's vent and even has a special piece in the back that laches itself on behind the plastic panel. So when he takes his phone, the entire holder doesn't come out of the vent with it.Honestly, this was a genius design. The manufacturers and designers worked well with each other and really made a solid phone holder. everything works so well together. When you pull it out of the fancy little box you will be amazed at all the little extra steps they took to create the perfect stand, that you can custom place in your car.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1642723200000}
{"reviewTitle":"Great! As advertised. Works with thicker cases","reviewDescription":"Great product. Been using it for months and it has no fallen or become weak. Looks nice and features are A+. Don’t have anything bad to say about it. I use this as a windshield mount not a vent mount. I believe it’s too heavy with my phone to use in a vent. I have a iPhone XR with generic ottorbox case. Easy to install, strong suction, easy to charge my phone while mounted. Not sure how it stands up to the heat yet as summer heat isn’t bad yet.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Good product","reviewDescription":"This is the second one of these I've purchased.  The first one worked great for a about 18 months....no problems.  The only reason that I bought a second one was because I had to have my windshield replaced. The company obviously had to remove the first holder.  The suction was so strong that it kind of messed up the suction cup when they removed it!! So happy that I was able to buy the same holder.  I believe that this one will hold up as well as the first one.  Would highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Excellent Customer Service","reviewDescription":"I purchased this product and had an initial challenge, but the customer service and May were extremely responsive and helpful and immediately resolved my issue with no problem.  I greatly appreciated their attentive response and great service to the customer.  The product works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Sturdy, long lasting","reviewDescription":"I’ve had this mount for over 3 years and never once had to replace the adhesive attachment or had any issues. I work from my vehicle and in both extreme cold and heat environments. Should I ever need a replacement, I will definitely go with this product again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Long life","reviewDescription":"I've had this for 2 years now and it's still going strong. If it stops sticking, just wash it with soap and hot water and it goes right back to sticking. Even with 100°+ weather, it is still going strong. 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Broke after only 6 months.","reviewDescription":"Loved it till it broke less than 6 months. Never needed to mess with it but one day the place where the phone goes and holds it in position broke while phone was in it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639699200000}
{"reviewTitle":"Poor adhesive adherence","reviewDescription":"Adhesive not holding. First warm day and I’ve had to reattach several times. Silicone seems intact but is not bonding to the dash. Didn’t even hit 80, very disappointed.Past return period so bummed. Will have to search for alternatives.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618272000000}
{"reviewTitle":"Does not stay attached","reviewDescription":"I bought this hoping that I could set it an forget it. The adhesive did not stay longer than a few weeks. The design is great, but it is useless without it staying on my dashboard.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622332800000}
{"reviewTitle":"Not good in warm weather","reviewDescription":"Cold weather, this is great; stays in place perfectly. But now that it's Spring and warmer weather is here, the adhesion expands, it no longer stays in place, and the suction doesn't back it up. The whole thing falls.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"Adhesion only lasted less than a month","reviewDescription":"Adhesion lasted less than a month and now window return period closed. Worked well when it was mounted but big disappointment in the end. Used flat surface and cleaned it as instructed but didn’t help. Don’t waste your money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633392000000}
{"reviewTitle":"not good","reviewDescription":"at first i really liked it, it held my phone well and all up until 1 month in it started to get loose and now that every time i do a turn it keeps moving but not slighty, by alot.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632614400000}
{"reviewTitle":"misleading description","reviewDescription":"The car mount is fine.  The issue I had is that it said it would fit thicker phones.  It has the same depth as a normal phone holder.  So if you have a thicker phone, I would be cautious.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615420800000}
{"reviewTitle":"Don't waste your money","reviewDescription":"The auction cup is a POS. Cleaned off my dashboard and it stayed on maybe 5 minutes then it kept falling off due to the weight of cell phones. I'm stuck using the clip after I tossed the other half.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616544000000}
{"reviewTitle":"fell while driving","reviewDescription":"The actual part where you put your phone is awesome but the whole mount fell while i was driving almost causing an accident","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650758400000}
{"reviewTitle":"failure to stay up","reviewDescription":"The thing falls off over and over with hot summer day hear after just a couple of days of having. very disappointed as this was supposed to be the best on amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623542400000}
{"reviewTitle":"works very well after 1 week","reviewDescription":"i installed this last week on my dashboard using the suction cup.  It included a metal plate with adhesive in case the suction doesn't work, and it includes a clip for mounting onto your vent. I didn't need either of these because the adhesion on my dashboard is very solid.The material of the suction cup, while not adhesive, is extremely tacky so when pressed on the surface and locked using a small lever, the attachment to the dashboard is secure and stable. I don't notice any vibration while driving.The only qualm I have is that the clip that holds your phone is small, I would have personally (having large hands) liked to have had a bigger clips.  The other wish was that it would be deep enough so that I don't have to unclip my phone from its wallet holder. This would require the clip depth to be > 1.25\" but this product is closer to 0.5\".  (I have an iPhone XR wallet case from 12 South).  But I couldn't find any phone holder on the market that would meet that desire, so given that I think this holder is optimal","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1604275200000}
{"reviewTitle":"Size","reviewDescription":"I have a Samsung galixy 21fe phone with a case. This gets big enough for my phone but barely. Any bigger of a phone probably wouldn't fit. But it works great for what I need it f9r!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Best Suction mount available","reviewDescription":"I ordered this item to replace a similar product that the suction kept failing on. I needed extension and suction that would hold even when the car was parked in sunshine. I installed it in my car and used it for a couple weeks. It worked great. I then needed to transfer it to another vehicle for a weeklong trip that required a 9 hour drive each way. When I tried to remove from the windshield it was stuck fast and hard. I had to \"manhandle\" the release pull to get the unit to release. It stayed put in the rental vehicle windshield as well. Even in high humidity and heat. When I returned home and removed from the rental I was greeted with the same super tough stickiness and had to manhandle to remove again. Definitely worth the money and should this one break or fail for any reason, I will buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1634688000000}
{"reviewTitle":"Works well and solidly built, may not be perfect for you","reviewDescription":"The glass suction cup is adhesive in addition, and very sticky. It was quick to install and works well for what I need it for—with caveats.Unfortunately the padded material holds heat, so my phone gets very hot on the back when fit properly into the cradle; I have to lift it a bit in order to get some airflow. It's worse in the sun, but that's to be expected. The included window mount arm also has very large steps when rotating it, so it's hard to get it into a good position due to the sheer angle of my windshield. I ended up putting it on backwards from how they display it in the promotional images and instructions, and I am able to angle it better now. I am using the mount to use my smartphone as a dashcam so the reverse position of the cup also moves the giant hand turn screw out of the way a bit for better camera visibility.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1621814400000}
{"reviewTitle":"Lasted awhile, but eventually fell off and wouldn’t stick","reviewDescription":"I bought this about a year ago and it worked great in my car! Easy to install for a not-so mechanically-inclined teenager. My phone was always secure and it made it super easy for me to have access while driving (for navigation or DJ purposes). HOWEVER, about a week ago it was extremely hot outside and the heat did a number on it. I noticed it sagging a bit as I was driving to work. As I drove, it continued to sag lower and then eventually just fell off. I tried sticking it back on, but once I put my phone inside it falls off again. Guess it’s time for a new one, perhaps a vent clip that won’t unstick in heat?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653264000000}
{"reviewTitle":"My phone fits with a case cover on it.","reviewDescription":"No complaints","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Still holing strong however.","reviewDescription":"The gear shaped plastic fastner that holds the phone mount to the arm snapped and is useless now but I loved the product could you send me some new fastners.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Better than advertised","reviewDescription":"I wish this cell phone had is the ability to hold phones with a folding leather case. I still have to take my phone out of the case to use the holder.. Then it would be perfect. But it is still an amazing holer. It does firmly hold phones with a protective jacket. The best part of this holder is the flexibility. I recently used mine while going through some beautiful Colorado mountains. By mounting my phone backwards (lens facing the windshield) I got some amazing video and time lapse photos. And, the camera could be rotated to catch the scenes in portrait or landscape. Another convenience, I mounted the holder close to the center of the dash so with a little twist the phone can face the driver or passenger. My wife likes to glance at the map and appreciates that function.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626998400000}
{"reviewTitle":"Work great (Samsung S23Ultra)","reviewDescription":"Stable no shaky while driving, stick good to windshield (it's been about a month now...will see how long will last) Able to hold S23Ultra with thick case.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Works as described","reviewDescription":"This product does exactly what I needed for! Would def recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Pretty good","reviewDescription":"Bought this for my husband. He likes it, but sometimes his phone slips out.  Could hold a little better","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"YES","reviewDescription":"This lil' guy has been doing so well! I wanted something I could stick to the area in front of my clock display (dashboard area but smooth plastic so I didn't have to use the sticky disc) because I live in LA and the heat always makes the ones on the windshield pop off because this city is a desert and everyone pretends like it's not because we're stealing water from the CO River to get by....but I digress. Phone holder 1, Desert heat 0.The piece that holds the actual phone is not terribly deep and I have a phone case with one of those moveable finger rings on it so it's a little thicker than usual. To remedy this, I tilted this part back a little so the phone kind of just rests on it in place. Absolutely not a major issue, but anyone using an Otterbox or something similar might experience the same thing. I love the \"jointed\" feature on this instead of a long bendy arm that you have to wrestle into place. Much more user-friendly.Be careful not to attach it where it brushes up against knobs in your car. I didn't notice right away, but the holder bouncing on my A\/C knob has chipped a lot of the paint off of it. This is user error, nothing wrong with the product. If you keep hitting something, eventually something will change. It's very easy to adjust and was a quick fix once I caught on.Overall, very good product that gives you a lot of freedom when it comes to how you want to position the mount and where you want the phone to hang out. I'll be sticking to mounts like this in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1619049600000}
{"reviewTitle":"Amazing customer service and Good Product","reviewDescription":"I've ordered this phone mount twice before (once for myself and once as a gift) but when I ordered this time around, something went wrong with the mechanics on my first use. The side clamps to hold the phone in place got stuck when I released them and wouldn't tighten up to secure my phone. I reached out to customer service on Instagram as I got a card in the box saying it had a lifetime warranty, and they were kind enough to order and send me a replacement free of charge. It's genuinely a good product which is why I ordered it again and I'm glad their customer service reps were able to help me.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"Great product","reviewDescription":"This thing is great! I like having the option to use the dash mount as well as the air vent mount. I used the dash mount originally because I liked the placement, but the air vent mount is actually very helpful in the summer, as my phone tends to overheat in the summer sun when it's on the dash - when it's attached to the air vent, it gets its own AC right on it! Honestly a game-changer.I've had this for a few years. One small piece on the back did crack (might have been my fault as I didn't understand how it was attached at first), but customer service was so helpful and responsive. Every now and then the suction comes undone, but this is only on the hottest summer days, and it always goes right back on, no problem. I have an iphone SE and a Honda Fit. It has also worked great for my partner's Pixel. Price is right, would definitely buy this or newer models again.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Excellent customer service and high quality product","reviewDescription":"I bought this car mount 2-3 year ago and using it all the time, great quality, highly recommend it for anyone I know. recently the nuts was cracked, contact their customer service support, they send me the replacements very quick. Highly highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Good grip on phone, easy set up","reviewDescription":"got this since its \"rally race durable\" and i have to say they may be right about that, very easy to use and set up. Multiple way to set up, im using mine in the vent clip config and its been holding very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"Best product I’ve bought","reviewDescription":"I bought this phone mount last year and it was great til my newphew got a hold of it and papered the sticky suction cup. I was upset to say the least and took the sticky suction cup of and was hoping to replace it. I tried others to no avail so I contacted VICSEED and they hooked me up, Cathy was my go to and she made sure to let me know when my replacement was shipping. They didn’t just replace the sticky suction cup they replaced the arm that is attached to the suction. Thank you VICSEED!! Worth every penny!! The first photo posted is the empty suction without the sticky.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"This holder keeps your phone secure","reviewDescription":"I like that this holder can be mounted anywhere in your car. I have mind with a suction cup on the wind schield, very adjustable stable add ease of removal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Better than any other car mount I’ve tried","reviewDescription":"I was driving today and had to tighten the arm bolt, and realized how reliable it has been. I’ve tried several car mounts but they never last in the Texas heat and usually fall off after a few months. I decided to leave a review on this and see when I ordered it, I bought this 2 years ago. Except for retightening and adjusting the arm a couple times it’s never had any issues. The plastic is turning yellow, it’s going on it’s third Texas summer, and on a dash that’s not perfectly flat, and it hasn’t budged an inch. Unless I actually released the latch to reposition it.It is a little bulky, but I have it slightly behind and right next to my dash screen and haven’t had any visibility problems. I love the side clamps. I can quickly plop my phone in and squeeze them shut and it stays put. Then I press the side button, it pops open, I grab my phone and go. No awkward fiddling around to put it on or take it off.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"Best phone holder I’ve had","reviewDescription":"My husband purchased one of these years ago for his car and it is amazing. I finally got tired of my cheap ones breaking and bought a vicseed one for my car. It is the best one I’ve had. It’s super adjustable and sturdy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"So sturdy","reviewDescription":"As an avid camper and off roader, this thing holds up!! I’ve broken and gone through at least 7 other brands and this one is still hanging on strong!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Lo recomiendo","reviewDescription":"El mejor soporte que he podido conseguir.  Es seguro y","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725235200000}
{"reviewTitle":"Jeep Tough","reviewDescription":"Needed a phone holder that could handle off road driving. This has worked out great. The holder has multiple options for placement.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Good quality","reviewDescription":"Good quality, interested to see how it’ll hold up in the heat next summer. Easy to set up, proper size for iPhone 14 Pro Max, stable and vibration resistant.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Phone holder","reviewDescription":"Does not disappoint!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Cellphone holder","reviewDescription":"Great cellphone holder. Sturdy and easy to manage.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Seems to work well","reviewDescription":"I haven't found anything negative about this product, historical I have bought those that could be fastened to the windshield.  This style is the first dash mounted one I am using, the fact that you can change from dash mount to vent clip is an added plus.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Great","reviewDescription":"I've gotten 2. The first one I had for a long time then move to a new car and got another.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Durable Phone Holder","reviewDescription":"This phone holder is easy to install and durable. Love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Still working after two years","reviewDescription":"Price is great and it's made good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Suction Cup failed after a few hours in the sun","reviewDescription":"Brand new car, extremely clean windshield.  Suction Cup failed after a few hours driving in the sun.  The suction cup lever doesn't have much pull on the cup, so it doesn't really have much suction at all.  Everything else is fine, but it failed to do what I purchased it for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626652800000}
{"reviewTitle":"Suction\/ adhesive not great","reviewDescription":"The mount fell off in less than a year of purchase because the adhesive isn’t strong enough!! And keeps falling off no matter how many times I hit it in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652659200000}
{"reviewTitle":"Not Deep Enough","reviewDescription":"Description mentions being extra wide for cases like Otterbox. But apparently they’re not as deep as a phone case that has a credit card holder on the back. Still looking for something with a larger front to back measurement.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"Its ok","reviewDescription":"I noticed when I put it on my dash and it's to hot outside it comes off. Sometimes when I am driving it comes off and it sucks. If it wasnt because of that  I would give it and 5 star.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637107200000}
{"reviewTitle":"Not a good fit","reviewDescription":"The clip for the vent did not fit my VW so I attached the plate to the dash for the suction cup and works ok, just wish the arm was an inch longer so it can move side to side. It barley reach the front of my dashboard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631059200000}
{"reviewTitle":"So so","reviewDescription":"It’s okay not great not bad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680220800000}
{"reviewTitle":"Good product but needs fixing","reviewDescription":"Suction power was great but not good enough to stick to my dash.  I decided to use the adhesion pad.  The suction cup has stayed secured to the pad with the adhesion bottom.  The adhesion pad on the other had has not worked well and I am constantly having to fix it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609804800000}
{"reviewTitle":"Does not fit otter box, a thick case","reviewDescription":"It was not deep enough to hold my Otterbox Pop case with enough security for my iPhone 13 Max. The first time it flew, it scared me and it was the last time I used the holder.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"I opted to use the clip to attach to the vent. Holds the phone well…but once the phone is in the holder it no longer sits in place so that you can see the screen, the car mount shifts the phone facing down. It isn’t sturdy. Very disappointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"Won't stick","reviewDescription":"I really wanted to mount it to the top of my dash but it just will not stick. So I have to use the vent attachment instead.  The vent attachment does work very good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"Husband loves","reviewDescription":"I bought this for my husband after he got a ticket for holding his phone up to his ear while driving.  In our state you must drive hands free.  This was easy to install on the windshield & easy to get the phone in & out.  I know this bc if any part of that were difficult my husband would have thrown it out the window.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Gets the job done, high quality","reviewDescription":"We recently purchased an older car to use for commuting to and from work. It did not have any smart features so we are utilizing our phones for music, navigation, and communication. This device fit my Iphone and the wifes Samsung perfectly. It opens wide and would seem to fit any phone on the market. The grips ensure that your phone will not fall out and its easily opened with a touch of a button. The suction poster to the windshield is impressive and it has yet to become detached. It adjusts in and out to bring the phone nearer of further and also up and down. We did not utilize the dash mount feature but it comes with everything you would need to include instructions. Also, my wife and I both are able to charge the phones while they are mounted in the device. It seems to be high quality and again, the suction is impressive and doesnt leave any residue. Only time this comes off is when we are putting the sun shade in the window. To remove, its an easy lever pull to release suction and I pull the tab to remove. Good buy.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Love it","reviewDescription":"It’s a great holder and mount for my phone! It’s not a charging mount but that’s ok it holds my phone securely and keeps it snug in place. It’s also super easy to set up in the car and stays secure to my dashboard.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Was good while it lasted.","reviewDescription":"Melts off when it’s too hot. I hate the one on the vent because it gets so cold or so hot also. Mine just broke just under two years. So it did well. I’m just sad. I guess ntn last for ever","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Actually works really well!","reviewDescription":"Update: Still working great after 8 months! Ordering another for our second vehicle.-----------I am only using the vent attachment, I haven't tried sticking the phone holder to the dash or the window because my dash is rounded and textured and it gets 120+ in my car in summer.This works so so well! Finally! I've tried so many and they never work. This holds the phone and keeps it exactly where I put it!With all the other holders we tried, my phones always fell or moved when we hit bumps. They broke easily or never functioned well.Not this one! It holds my phone so securely and my phone is very large with a huge otter box on it!I'll update if we have any problems, but we've been happy with it for weeks now!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Great product!","reviewDescription":"Really great product and amazing customer service! The product melted initially in my car, which I was very frustrated with but representative May helped to resolve this issue immediately. She had a new version with updated heat resistant properties sent for free and I haven't had any issues since!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Works great","reviewDescription":"I would buy again,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Rugged, Sturdy, Flexible and well priced.","reviewDescription":"The design is sleek, very flexible with several adjustments. It is strong and ridged. Well priced and high quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"So far I am pleased","reviewDescription":"I recently bought this one when my last phone holder broke. I typically use magnetic mounts; however, I have seen the Vicseed open on Amazon and liked that it had such good ratings.Unlike some of the reviews, I found installation to be very easy. I did not use the mount plate although it's recommended. I mounted my Vicseed by suction-cup mount only and directly to the dashboard. I cleaned the area first by wiping it down with rubbing alcohol and then applied the suction cup. I let the mount sit overnight before using it the next morning.I have had no problems such as  mount not adhering or falling off, and the temperature in my car during the day can get to be 100 or more degrees.The only thing that would make me like this mount better would be to have the arm come down lower and closer to the level of my air vents. Right now it's lowest position still sits rather high on my dash for my liking.It's easy to place my phone into as well as release my phone when I am done. It allows my phone to still nestle easily into the mount, even when the charging cord is attached. Although it still bounces a little when driving, I thinks it's expected as it is attached to the car.Overall, I am quite pleased with the Vicseed. However, should issues arise, I will update my feedback.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1648339200000}
{"reviewTitle":"Best Phone Holder","reviewDescription":"I ordered this for my SUV months ago. Every other phone holder I found would unattach and my phone would go flying. This attached smoothly to my dashboard, keeps my phone sturdy as I drive and is not too big. For reference, I have an Google pixel 7pro and my phone fits perfectly. Just ordered a second for my husband van to use on our road trip. Highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"So far so good","reviewDescription":"I have an iPhone 8+, it’s not a very big phone but I do have a ring pop socket (which also isn’t very big) but the sides don’t hold it super well. It’s fallen twice when I’ve taken slow turns but it’s not too bad. It’s only been a few days, I only go about 20 minutes to get to work and it’s done well. The holder itself is pretty sturdy, doesn’t lean forward like ones I’ve had in the past so that’s good.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1609977600000}
{"reviewTitle":"Overall works well for me","reviewDescription":"I haven't mounted mine.  Currently, I just have mine attached to my vent.  It works pretty well, however it doesn't quite hold my phone in it all the way because I have a pop socket on the back of my phone, so just be aware.  Your phone may or may not fit if you have a pop socket on your phone.  But as I said, mine still holds my phone decent enough to use.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1612915200000}
{"reviewTitle":"Not for everyone, but it works.","reviewDescription":"I got this because with my phone case and popsocket my phone ends up being a little on the thick side. I was hopeful this would hold it securely. It does hold it but barely. If I hit a speed bump the phone snaps out.I take my phone out of it's protective case when I use this now. It's a little inconvenient, but does it's job now without issues.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1618444800000}
{"reviewTitle":"Cell Phone Holder","reviewDescription":"It didn't fit in my car. I'm sure this depends on your type of vehicle. I use this at work. It suctions to my desk and my phone is facing me at all times in case of a text. I love it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641513600000}
{"reviewTitle":"Great holder except.....","reviewDescription":"Awesome holder, solid, great extension, but returning it for a couple reasons.1) I have a pixel 4a and the rear plate doesn't allow me to use the finger print reader.2) My wife has a case that holds her driver's license and a couple credit cards and this isn't deep enough to accommodate those.Overall great mount, just didn't meet my needs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1623283200000}
{"reviewTitle":"Its good","reviewDescription":"The suction is really good, but the little hand that holds it up is cheap as heck, if i hit a bump it loosens the lock and drops it down so i have to lock it up again. Only happened a few times but other than that its good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635984000000}
{"reviewTitle":"Holds phone as promised could be more versatile","reviewDescription":"I have an iphone max with a case. It was too large for my previous phone holder. This product securely held my phone in place. My only complaint is I can’t turn my phone to landscape or back to portrait without using two hands. This definitely holds the phone securely and stays adhered to the windshield in all temperatures.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626825600000}
{"reviewTitle":"The clip was my saving grace","reviewDescription":"If it wasn’t for the clip, this product would have been returned. The bottom disc did not stick to my dashboard at all. Thankfully the clip fits securely in my vent. I still want the option of using the dash but I don’t know how to get another adhesive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634774400000}
{"reviewTitle":"Do not recommend.","reviewDescription":"The mount fell and stopped sticking the first day so I used the vent one and it literally broke while I was driving.Update: The seller was super helpful and sent me a new one for free. I’ve been using the vent one for a couple weeks now and so far so good! I haven’t had any problems with it so far. Big thank you to the seller for reaching out to me and solving the issue.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1595548800000}
{"reviewTitle":"Great price and does the job","reviewDescription":"I bought this to use in the car.  Easy installation and nice adhesive.  It does stay in place ehen i hit bumps and holds my phone in place.  Easily adjusts to the phone.  Now when exposed in intense heat it has popped the holder off the dash but went back no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"A Great Product","reviewDescription":"I had been looking at various mounts for my phone for a while. I finally settled on this mount, and I can say that I am very pleased with this product. The mount is very well made, and it is very solid. The suction cup is very strong. The mount is easy to manipulate if you would like to change from portrait to landscape for MAP\/GPS applications. The mount is also well padded at points where it contacts the phone, and the holders on the mount extend to a very wide with for larger phones. I like that the mount has a release button on the side to expand the mount clamps when you want to remove your phone.It is a great product. I would not hesitate to suggest this mount as a great option for your vehicle.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Heavy duty, Great for truckers.","reviewDescription":"I had the original one for over a year, after being bounced around in a tractor trailer, it finally had enough. That was after driving 100k miles. They sent me a replacement quickly, and it's just as strong as the original one was.Absolutely the best phone mount out there especially for truck drivers that need something heavy duty.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Works great","reviewDescription":"I've had a few suction cup windshield cell phone holders and they suck. They lose suction after a few days. I've had this for a couple months and it works great. I have an iphone 13 with a small case and it holds it fine. Even in hot days, the suction stays. It comes with a vent attachment and a dash board mount but I didn't even try those. The suction against the windshield works fine.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"I love this cell phone holder","reviewDescription":"I've been working with Uber and Lyft for about 3 months now.  it's amazing what Best Buy sell's you for $30.00 a fan clip that the ball joint doesn't work either because the phone is too heavy or just the plain heat.  Then I went to Walmart and again my phone is too heavyI finally decided to look on Amazon and under HEAVY DUTY.  I found this along with Great reviews.  This holder is great it actually has something to tighten the ball joint so my phone can be heled in the case.  For me the vent  clip didn't work because there is a piece of plastic above my air vent in the car for esthetics which blocks the vent holder being tightened. However the windshield holder works perfectly! my phone is stable and tight and it stays on in 180 degree disgusting heat in the car in Florida.I'm sure the dash would be great also but i'm afraid because even though it says it won't ruin the dash Florida is a constant 150 to 180 degrees in the car and I won't take any chance.I know I'm ranting let's get to the point.  This is a beautiful cell phone holder. I'm a man that only takes quality. it's heavy duty, it holds my ultra 23 with the case tight and I'm sure you will be happy with it.  Buy this don't waste your time in Walmart or Bestbuy they they will sell you a $30.00 piece of junk that doesn't work.  This VICSEED is the best holder i ever had and now i can work safely.  thank you I recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1690588800000}
{"reviewTitle":"Phone holder","reviewDescription":"Awesome phone holderl","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Item delivered was as described.","reviewDescription":"It worked well and have no issues","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Great Product With Potential; Strong And Effective!","reviewDescription":"I had an Excellent experience Chatting With Nora The Seller of the Product. She Gave me A second One to Fit My exact Expectations On the Correct Correspondence to My car. And also, who Knew you could Mount it On the Front Windshield with Tough Sticky Mounts with a disc Protection from Your Windshield From Damaging. I always Knew that I Would consider Purchasing this one because of its Unique Features and Extra Add-ons. It has two mounting options to choose between and set your mounting Port and clamp Your Phone Onto the Car Air Flaps on the Car or onto the Windshield Screen with the Screen Disc Provided for Extra support. I would Recommend this product to everyone that Needs an Upgrade for Mounting Your Phone instead of constantly Having to Hold your Phone which is dangerous while Driving! I’m a Multitasker; I can handle it but others.. No. But if you buy this your setting yourself up for Success and Convenience. It’s an essential Product especially if your business requires you to drive For Long Distances while still maintaining consistent Safety measures and assurance with this Product to help you keep both eyes on the road while enjoying yourself listening to audio podcasts, or Scrolling through your apps; without the distractions of Having to constantly Hold Your phone which in turn increases the risk of Injury because You can’t seem to look up; only down on your phone since your arm is so tired of holding your hand up. So if that applies to you than you should Buy This Product ASAP!! Also, Thank You Nora!!! Your Awesome; And Appreciate your Kindness\/Services.~ Ali","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Great Phone Mount","reviewDescription":"This mout works great with either the suction cup, or the vent mount. I used mine for 3 years, then the adhesive lost its stickiness after I cleaned it with alcohol. I contacted customer service, and they sent me a replacement no charge! Lifetime warranty and Great Customer Service!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Cell phone holder","reviewDescription":"I like this cell phone holder because it is Easy to use , very sturdy and has a strong suction to the surface it is applied.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Works great","reviewDescription":"Works great right out of the box. No complaints. Caught it on sale.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"orks great on your desk too!","reviewDescription":"Originally, I was going to put this in my \"Big Girl\" Jeep. After assembling it for the suction cup mode, I thought I'd try out the suction power on my mahogany desk with a satin finish. It sticks great! I'll probably just take it off the desk and put it in the Jeep when I'm driving someplace, which really isn't that often.It well-made and fully adjustable. There is an expandable arm that allows you to pull the phone out to about 8\", or you can leave it back to about 4\". The included a 3M adhesive plate if you want to use the suction cup on a rough surface. It's a 2-thumbs up from me!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Perfect","reviewDescription":"Purchased November 6, 2021. Has just fallen off my window. This has been an excellent phone mount for me. I drive about four hours each day. It has been out in the sun in Florida and Georgia. Ordering another today!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Fits every need.","reviewDescription":"This is awesome. It has 3 mounting modes. It accommodates my phone case and is very versatile. It rotates and slants to my viewing needs. I’m glad I found this product! I highly recommend this!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Suction mount failed & melted, but company replaced it with a new one","reviewDescription":"Review Updated 5\/24\/2022The company got in contact with me, it seems the previous person that was working with me in customer service has left the company, and thus my e-mail back had not been found for a while.  Once customer service got in touch with me, they sent me out a replacement, and sent me several notes to ensure everything was correct and offered to apply a lifetime warranty to the item if the same issues keep happening.  At the end of the day - if a company stands by a product like that, and is willing to go above and beyond to help, I can't really think of giving them less than 5 stars, so I am amending my review.Previous ReviewWhen first installed this mount seemed like it was going to work well.  Over time, the clear suction cup became yellow.  I e-mailed VICSEED that this did not look right and if they would replace it.  This was really an eyesore on the windshield, but they said this looked normal to them and if it had more of an issue in the future they would help out.A few months after this, I noticed it starting to melt, and so I went to take it off the windshield and it was a gooey mess as pictured.  I messaged them back for a replacement, as they said they would provide one when the suction cup started to fall, but they never responded to my follow-up e-mail.I can understand that things fail over time - but specifically they have the marketing claim that this \"will leave no residue behind\".  Per the pictures I have included, that does not seem true, and it was frustrating that they did not follow-up on the message to replace the unit.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1651881600000}
{"reviewTitle":"Dont give me any crap!","reviewDescription":"Good buy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Works great","reviewDescription":"I have an eggshell finish on my dashboard and nothing sticks to it. But used the disc that came with this and I have no problem with it. Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Great Product","reviewDescription":"Phone holder is 5 stars. I like that it comes with the holder for the dash and a holder for the AC. It’s easy to install. Flexible. Lifetime warranty.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Magnífico","reviewDescription":"Bonito","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"I've purchased FOUR!","reviewDescription":"The first was for my teenage daughter. I liked hers so much that I purchased one for myself and for my husband. Now I've just purchased a fourth for my older daughter. It's easy to install. You have the option of attaching it to your dashboard, your windshield or on an air vent. I chose the windshield and believe me, that suction cup is not going ANYWHERE. There's some serious adhesion here, so I would recommend being pretty sure about where you want it before you actually attach it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Incredible Customer Service","reviewDescription":"Very easy to install and stable using the vent clip. It broke after a couple of months but they had fantastic customer service and I got it replaced for free very easily and quickly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Just glad it fits all phone sizes","reviewDescription":"I was surprised to learn the disk for the dashboard needs 24-48 hours to be 100% adhered. Then you stick the suction cup to the impossible to remove disk, and it holds your phone. But, any time it gets hot in my car, which is basically every day, the section cup peels off and falls to the floor. I have to constantly re-suction it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"Not for extra thick cases as advertised.","reviewDescription":"While it seems like a good holder in general, it does not hold a phone with an extra thick case as it says it does. It’s actually worse than my old one. In need of a holder that can hold a case with the credit card holder on back. This is not it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641600000000}
{"reviewTitle":"Doeant fit popsocket phone with case","reviewDescription":"Reviews state this will fit with a large case and or popsocket and this is not the case for my LG phone. My case is small and thin and I still had to take it off, as well as when it in the mount the wings of the mount push the buttons for \"okay google\" and it tries to pick up on my voice while I install it","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1630886400000}
{"reviewTitle":"Two options","reviewDescription":"I wanted to use the suction cup in my car but the suction would not release once attached. Also the adhesive did not stick to my dashboard. I was forced to use the vent option which was not what I wanted but the only choice left.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"Lasted 4 months","reviewDescription":"Worked great for 4 months. Easy to install and suction never failed. However, the ring that tightened the swivel broke after 4 months. I hadn't touched it, and now it just flops around. My only guess is that the cold weather made the plastic fragile.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"VICSEED car mount","reviewDescription":"The look of the phone mount was nice but, I didn't actually use it. The vent holder I already had 2 others similar so, I didn't open or use the VICSEED, the suction cup holder didn't fit where I wanted it to on my dash, I don't have a flat platform for it to fit. I also, use a wallet phone case and thought the holder was thick enough to use w\/my ph still in the case but it wasn't .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617840000000}
{"reviewTitle":"Vent grip not firm ...","reviewDescription":"I like the fact that the holder stays in the car.  I don't want to mess up my dash with the adhesive so will try the windshield, but since it's not flat, it may not work. So far the vent has held.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643500800000}
{"reviewTitle":"Doesn't stick - Phone falls out","reviewDescription":"It doesn't stick well to my car and my phone often falls off while I'm driving. My boyfriend has a similar product but its magnetic so the phone stays in, I would recommend trying to find that over this product..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"Worked well at first","reviewDescription":"This mount gets the job done, but the adhesion is not the most reliable. It fell off numerous times, and I eventually had to replace it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Suction cup has poor sticking power","reviewDescription":"If you're looking for something to mount temporarily (e.g, in a rental car), the suction cup mount isn't it.  It would consistently pull off of a well-cleaned glass or flat dash surface - the length of the arm plus an average-size phone was simply too much torque for it to handle.  The vent-clip worked fine, however, as did the phone-holder itself - thus the three stars, not 1.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623628800000}
{"reviewTitle":"Eh","reviewDescription":"So I followed the directions to a T. I waited 24 hrs before putting the actual phone holder on. And then I went above that and waited another 24 hrs for it to all settle before putting my phone in. The phone holder still popped off. In 2 days... now I have it on my windshield which is not where I wanted it but it's been holding since... it's been almost 3 weeks so that's a good sign. I just wanted it on my dashboard and not my windshield.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684108800000}
{"reviewTitle":"This is a great cell phone holder","reviewDescription":"Even tho it’s a great cell phone holder just doesn’t hold a thick phone case as it stated. I have a walli case which has a wallet and a loop. So nothing would hold the phone in its case. Works fantastic without my case on but that’s not the point of getting this holder. I need my phone to stay protected in its case. so I had to return it. I only installed the vent did not attempt the sticky mount","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Okay except won't stick to dash!","reviewDescription":"I tried to put this mount on my dash and it kept falling off. Even used the circle to help but it wouldn't stick to my dash. I had to put it on my Windshield and it kind of blocks my view when I have my phone on it. Get another product if you want this to stick anywhere else besides your windshield.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Doesn't stick to dashboards very well.","reviewDescription":"The suction sticks to the adhesive pad just fine but trying to mount it in the car has required additional adhesives, even after making sure the dashboard was clean. It also didn't stick to the window very well at all.Amendment: The other components of this product work well enough, such as securely fastening to the air vents. Also, after leaving the review they offered me a full refund and did NOT require an amendment to their review, I am amending it just because the product is good quality just lacks in sufficient stickiness to windows and dashboards.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"Very disappointed","reviewDescription":"I was very excited to I install this. I followed their instructions, cleaned the area and stick the botton round plate on my dashboard and waited 24 hours. The next day, after 24 hours passed, I put my phone in, and began driving. I driving with my GPS on when suddenly the whole piece with my phone in, fell onto the passenger floor. I tried to glue it again but it didn't stick. I dismounted it and let it stand fir one day, but still didn't stick. I unglued the suction part from the rounded piece glued to my dashboard, and use the suction part directly in the dashboard. I didn't want to put in on my windshield glass. So far it has sticked in place. Very disappointed for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653004800000}
{"reviewTitle":"It's ok","reviewDescription":"The vent clip isn't as secure as it should be, mostly cuz the teeth on the clip don't work great. A slight tap and it goes flying off. The hold onto the phone is great and secure but it is slightly inconvenient because you have to push a button on both side to loosen its grip from the phone. Which is normally fine but it then knocks off the vent. Will save for a better one. Until then it is ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Weak Suction and Mount","reviewDescription":"I drive a Mercedes GLA 250 and the only place to put this mount would have been the window. I didn't want it on the window due to obstructed view. I tried this mount everywhere the car would allow. This would be more of a car thing than the product but the rubber piece on the mount barely stuck to the window itself. I figured I would try the plate that helped it stick to your dash but that thing wouldn't stick ANYWHERE. I tried flat surfaces, rounded, smooth, etc. Nothing would stick.I also have a larger S20 Ultra from Samsung and the phone is just too heavy and too large for this device.  This wouldn't be an issue but the product says 'big phone' friendly but it just isn't. No matter how much I tightened the nuts the phone over time made the device sag.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1611619200000}
{"reviewTitle":"Not good in the Arizona 115° temperature.","reviewDescription":"This company has to think about the environment that they are selling this product in or at. I am in Arizona and the adhesion sucked from day one. I cleaned off my dashboard from all debris, tried putting the sticky adhesive part on my dashboard,I thought it was staying on,, but it stayed in place for all of 1 minute. It slid right off of my dashboard and into my lap.So I had to use the vent clip, which isn't long enough to go over the vent slats.So I had to tighten the lug tight as I could get it, so that it wouldn't fall off and prayed that it wouldn't damage my vent slat in the process.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1626134400000}
{"reviewTitle":"Not ideal for my use","reviewDescription":"I am unsure if my Samsung S21 with Otterbox Defender case fits nicely in this mount. There is always a feeling that it might fall. I tried to attach this phone holder to my garmin car dashboard beanbag mount and it fits. While it gives a good grip it is too small. I think Vicseed should do some R&D to create a mount for something similar to garmin dashboard beanbag. That is ideal for larger phone with otterbox case.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665878400000}
{"reviewTitle":"Works well","reviewDescription":"Works well but, alas, the sticky pad has become unsticky. Wish it had a regular suction cup.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Works welĺ","reviewDescription":"Good price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Just got it yesterday.","reviewDescription":"I used it today In my work truck. It holds firmly and attached securely and easily to my dash. So far we'll pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Great product but can't get it off of my dash","reviewDescription":"I bought this 2 years ago (2022) and am now donating my car and would like to take this with me.  BUT, I can't get it off of my dash. :-(  I THINK I am trying to remove it correctly, but that sucker is STUCK on my dash and NOT letting go! Oh well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"I am so happy with this purchase!","reviewDescription":"I did a little research before buying.  This phone holder is perfect.  Easy to install, sturdy.Excellent product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Very good product and thanks for quality service.","reviewDescription":"Arrived on time, good product and quality service.  Thanks and will buy again in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Works well","reviewDescription":"I’m using it for my vent so I can’t comment on how well it works sticking to your dash but it works pretty good in the vent!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Good product","reviewDescription":"If you want just a simple phone holder for your car this is perfect.  I use the vent clip and it works great and is easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"The device is of very high quality. I'm very satisfied","reviewDescription":"The device is of very high quality. I'm very satisfied","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Like this","reviewDescription":"I have never had a car mount for my phone. I originally was going to use the suction but after playing with it I Decided to use the air vent holder. Gives good angle does not block the air study and doesn’t wobble!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Works Perfectly","reviewDescription":"Perfect, exactly what I needed 👏","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"UPDATE TO THIS REVIEW  NOT DURABLE -- Third one in a row that broke","reviewDescription":"And in my frustration with this item, I posted a review last week. I am happy to report that the seller responded immediately and professionally. Seller is in the process of resolving the issue and as soon as I get replacement parts, I will report back further. At the moment, I will keep trying this item, and hope that the replacement part resolves all issues. Thank you to the seller for being so incredibly responsive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Good till it wasnt.","reviewDescription":"When I first purchased I thought my issues of having faulty car mounts were officially gone. Especially since this one had such great reviews and was a little pricier than some I passed up on. My five below mounts that I would buy would eventually break or fall off but they never melted to my windshield or dashboard. I’ve never moved it unless it fell which was very rare. Then all of a sudden when i’d get in my car it would be off my windshield. Spending over 30minutes getting this adhesive off my windshield and dashboard wasn’t fun either. It was good while it lasted!","isVerified":true,"ratingScore":2,"reviewReaction":"12 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Good for About a Year","reviewDescription":"I didn't understand why I needed a thick gel adhesive since my last mount was just suction which worked great on my windshield, but I installed it as instructed anyway. It held great and worked just as I needed it to - for about a year. Then, one summer day I came out to see the whole thing just hanging from my windshield by a big, long stretch of goop. It was hard to get the holder off as the goop was stuck to both it and the windshield, very thick, and still sticky. I later spent quite a bit of time removing the thick adhesive from both surfaces and tried using just the suction cup without adhesive. It feels firm at first, but won't hold my phone for more than a minute seconds before falling. So, here I am shopping for a phone mount again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643414400000}
{"reviewTitle":"Did not stay on the dash","reviewDescription":"I watched the video and believed it would work and it didn’t. Did not stay on my dash past 30 days. It does not stick","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Adhesive on suction cup very weak","reviewDescription":"As per the instructions on the package, I placed the suction mount down and waited 24h. I then placed the suction arm onto the mount and waited 15 min. Within 15 minutes the suction cup and my phone fell off the mount. Very disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Car Phone Mount NOT Thick Case Friendly","reviewDescription":"I bought this mount because I have a wallet style cover for my cell phone.  I found this mount to be smaller than the one I currently have.  It was not suitable for a wallet style cover.Updated 9\/3\/2020 - VICSEED provided great customer service.  They sent me a free updated model to see if it worked.  It didn't work but even the other two car phone mounts that I thought might work did not work either.  Manufacturers need to use longer side arms to hold phones with thicker covers.  I finally put 2 small squares of velcro tape inside the cover between the back of the phone and the inside of the leather cover.  It holds the phone in place and when I put it in the VICSEED holder, I turned the magnet tab backward to secure the other side of the phone\/cover.  It works!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1596240000000}
{"reviewTitle":"Suction portion doesnt stick","reviewDescription":"For the price I love that it brings both suction cup and clip for the vent.. Clip is great has a good hold to the phone but the suction cup didn't stick at all seems we have to both something to help it stick..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"I did not enjoy this product","reviewDescription":"This was not a good purchase. When I took it out of the box it looked like a nice sturdy phone holder for my car. It comes with a piece of it attaches to the dash or window and a piece that attaches to the air vent. I really wanted to use the suction on my dashboard. It would not stick to any clean surface in my car. It's also very long and you have to be careful where you put it so you it won't be in the way when you try to drive. So I attempted to try it in my air vent but they're no fault of this item, it would not fit in my air vent. I found this product to be very frustrating and ended up giving it away to someone that could possibly use it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1616198400000}
{"reviewTitle":"Disappointed","reviewDescription":"I bought this because it advertises thick cases and being fully adjustable. It does allow for many different positions, which is great! But it doesn’t work with thick cases! I didn’t see the tiny print that says it won’t work with pop sockets. I have a super think case and thin pop socket and it’s waaaaay too thick! My old phone has a finger strap with nearly flat holders and that doesn’t fit either. My daughter has the loop thing and that definitely doesn’t fit.Also, my iPhone 12 mini is too short to be able to record while driving. Which is one of the main things I wanted it for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"Plastic garbage","reviewDescription":"The only part of this that is worth anything, is the vent mount. The main reason I bought this was to get my S22 ultra off the vent... but the construction of the arm that holds the device is too weak to hold up to the weight of the phone. Recommend not buying this. The tighteners are plastic aswell as the arm. Needs metal to be able to support bigger phones. I'm sure it works great on lighter phones, but if you over tighten and fastener it's never gets tight again.(and it's easy to over tighten). Threw away the arm mount, kept the vent mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646524800000}
{"reviewTitle":"Doesn't stay secure when the sun comes out","reviewDescription":"Bought this in January.  Worked well for the first 8 weeks or so while it was cold outside.  When the sun started heating up as spring came along, it kept falling off the dash board.  I followed all the instructions on reattaching it, and it keeps falling off.  Really surprised.  Unable to contact seller\/company either.  Went to their store front, and could not find any way to get product support.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1622419200000}
{"reviewTitle":"Dangerous","reviewDescription":"Don't buy this because I had it on my windshield for three weeks and when the first day the outside temperature reached 72 degrees it just fell off. I can't find out how to contact the seller to see if they could send me a new adhesive replacement. I was driving so please be careful it could cause you to have an accident.I ended up buying the 3M rubber adhesives so it would stop falling off. Update","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1620000000000}
{"reviewTitle":"Do not waste your money!","reviewDescription":"This product does not work. I followed the directions exactly, even the extra instructions they sent in an email after I received the phone mount. Perhaps my phone was too heavy? I even tried to place the arms of the mount so the weight of the phone would not be hanging at an angle that would put pressure on the base. Bottom line is that the base wouldn't even hold the mount by itself overnight in my garage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1615161600000}
{"reviewTitle":"Not as described","reviewDescription":"I have a galaxy S8+ with a protective cover, not as thick as the otterbox.  My phone doesnt fit.  You have to unscrew the back of the holder to adjust the width then tighten back down.  Very awkward for constant removal and replacement of phone when getting in and out of vehicle.  That alone disqualifies this phone holder, imo, unless you're going to leave your phone in the car.  But, it doesnt fit my phone at all.  Returning","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1629417600000}
{"reviewTitle":"Plastic parts break easily","reviewDescription":"Purchased 10 of these for my company vehicles and 5 months later, most are broken. The screw cuff is the oroblem. You need to loosen it to adjust it and then tighten it to hold the phone secure.... But, the screw cuff peice breaks easily and renders the item useless since it no longer will hold the phone in the correct position.  Hoping for replacemwnt parts refund or replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"This Product Sucks!!!","reviewDescription":"I attempted to use this product in my vehicle, and was unsuccessful as the adhesive did not work, and neither did the suction power. Next time, I will seek advice\/feedback from friends\/family who have purchased a car phone mount that actually works. This just goes to show that you absolutely get what you pay for. Everything that is offered as a discount is not always a good deal!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1627516800000}
{"reviewTitle":"No good at all","reviewDescription":"This SUCKS!!! I Bought this item because I wanted a phone mount I could mount to my dash. I thought I got a good one but no. I cleaned the dash before. To make sure there was no dust or anything on it. I put the pad on and then I mounted the phone mount. And I was driving with it for less than five minutes and the POS falls off while I’m driving. WTF man!!! Don’t waste your money go look somewhere else.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1627430400000}
{"reviewTitle":"Please, replacement was defective as well , no pin holding long connection arm missing","reviewDescription":"Went to install and no way as arm not connected , missing a pin so 1st damaged and returned this replacement in pieces, i just wamt to return this 2nd broken and please refund my money , i am having no luck. I give up. Please refund , i will return , this is in pieces with no connecting pins.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1630540800000}
{"reviewTitle":"Can’t use with a pop socket","reviewDescription":"Bought this because it said it would work for bigger phones, so I assumed a pop socket would be ok. It is not deep enough to grasp a phone with a pop socket firmly in place. My phone kept falling off while I was driving. This could be easily solved by extending the feet and making the side grips a little larger. The suction and function is good. Just please make it useable for phones with pop sockets- most people have them now!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1628726400000}
{"reviewTitle":"Too Messy","reviewDescription":"I was happy with the product when it first arrived. Then the sun and heat started. I had the suction cup attached to the window in my truck and the suction started to melt. The phone holder started to slide down the window. Once I was able to scrape the suction off my window it took awhile to get all the goop off.I do not recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1624924800000}
{"reviewTitle":"Not a good product","reviewDescription":"The glue that's supposed to stick the circle to the dash of my car does not stick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"This item does not work as advertised, does NOT stick to dashboard!","reviewDescription":"Adhesive does not stick to dashboard when it becomes too warm, which is most of the year on sunny days.Unfortunately, I have missed the window to return. Very disappointing, Amazon. Defects do not always present themselves within 30 days.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Not automatic","reviewDescription":"Doesn't adjust automatically. Too much trouble securing it in place everytime you put it in, and having to do extra steps when taking it out.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Doesn't stick","reviewDescription":"Bought 3 of these for our 3 vehicles. Design and functionality are amazing. Really good, solid product in that regard. We didn't want to stick them to the window since we use sunshades in the summer and the vent clips didn't really work all that great. We decided to stick them on the dashboard.However, none of them stuck to our dashboards for more than a day. All 3 vehicles have different style dashboards and it stuck to none of them. My dashboard is a smooth surface with no design, bumps, leather, etc... just a smooth surface. Mine stuck to the dash the longest, at just about 24 hours after allowing the allotted time to let the material stick to the dash. On my second time using it, the holder detached and fell on the floor. Tried to re-stick it but it kept falling. The base is very sticky and I was very surprised it didn't work. I'm actually glad this happened during the winter because I'm sure the summer heat would have loosened the seal, and the product would have failed then... out of the return period. We returned all 3.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1643846400000}
{"reviewTitle":"Gonna need to buy a different one soon...","reviewDescription":"From installation to function, this was a pain. The suction and adhesion isn't that great to the car surface (yes I cleaned and put it on a flat surface and waited the specified time before hooking up the phone holder and the phone). It unstuck. The part that actually attaches the phone got stuck because I couldn't unscrew it with my hands. Had to use a hammer to get enough torque to undo it. Have been using the vent attachment ever since. It was fine until it wasn't. It keeps tilting (my phone isn't that big or heavy, most phones are actually bigger than mine) and the attachment keeps slipping off of the vents. It looks like an little piece broke. Just an all around headache.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"junk","reviewDescription":"will not stick and cleary had been returned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"No suction and no adhesion power at all. so no installation either. Waste of money!!","reviewDescription":"No suction and no adhesion power at all. so no installation either. Waste of money!!The product arrived after I left for my home country. After returning I tried to install but its not having any adhesion or suction. The moment I am putting phone to holder, The holder falls forward due to weight. Not good for smart phones. Mine is I-Phone 13. Please don't waste money. This product is useless.Seller said money will be refunded. I submitted yesterday a feedback that money is refunded depending on that email from seller but not it’s not refunded yet!! And still i dont see any refund information in my amazon account.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696118400000}
{"reviewTitle":"Heavy without phone","reviewDescription":"It has 3 options, suction to dash, glue to dash,or vent clip.This thing is too heavy for suction, not using glue on my Mercedes and of course it won't attach to vent but for vent, again too heavy.Unless you wanna glue this thing to your expensive cars, don't get it.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Won’t stay on","reviewDescription":"Adhesive doesn’t stick to the dash despite following the directions exactly. Unless you want to use super glue to stick it in place, don’t waste your time.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Melted down my windshield in less than six months!","reviewDescription":"It melted down my windshield leaving a clear sticky mess that gets on everything it touches. It is advertised as good for thick cases but my otterbox defender case is barely held. It is awkward like its not meant to be and your forcing it. I have a thin finger ring glued on the back of my otterbox defender case which is about the same thickness as a pop socket and it barely grabs the sides of my case and it is hard for me to get it to grip it when setting it up for use. It really needs another quarter of an inch of gripping sides to hold it confidently. Another issue is that I have it suctioned to my glass and in two weeks it fell off once...which isn't awful but still it isn not great either. I have it basically resting on right above the dash in case if falls off and it still pulled away from the windshield.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1615075200000}
{"reviewTitle":"Don’t hesitate this is the one!","reviewDescription":"Im not really a phone holder type guy, however this is definitly one of the better ones I’ve ever used. It has so many different options on how to adjust angle how far out you want it, easy release button, The back is shaped like.a phone so is nice feeling carrying around or typing on, I rarely leave feedback for products. This one 10\/10!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Great Phone Mount","reviewDescription":"A very durable product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Sticks VERY well","reviewDescription":"I’ve used other car mounts in the past but this is by far the best one I’ve ever tried. It sticks almost too well. I’ve never had a problem with it and they last a long time; I had my previous one for 2 years. I just bought a new one because they upgraded it to help with sun exposure. I have an IPhone Max so it’s important that it withstands the weight. This is the ONLY car mount I trust and use - I got my whole family one for Christmas.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Very good holder for my iPhone pro max","reviewDescription":"This is a very sturdy unit, easy to mount in various places in my car, and the best part is getting the phone in and out of it. It’s very simple no Hasley no struggling with my prior holder. I have a Nissan pathfinder is very well suited for that And I have bought two, another for my wife’s Lexus 200 and it works great there too. Recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Solid.","reviewDescription":"Have been using this for about a month now with the air vent clip and am happy. Doesn’t budge, doesn’t drop my phone, was super easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Great Product","reviewDescription":"Great Product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Versatile. Easy to Install. Works as Expected.","reviewDescription":"Note: This review is based on the vent-mount, rather than the suction-arm mount. My phone is an LGV30, with the huge, heavy, Love Mei case, which is .6\" thick (a tenth of an inch thicker than this device recommends).So far, so good. It mounted quickly and easily, even with my giant, heavy phone case. It barely fit the width of my phone, and had to be slowly wiggled into place. However, this is probably because my phone case is a tenth of an inch thicker than their maximum allowance, so it meets the adjustable grips at a place where they're more narrow. I'll give them some slack on that.The device comes with two mounting options (suction mounted arm, or vent mount), which fits many scenarios. It keeps my phone securely in place, and allows me to position it exactly how I want it, for easy viewing. I haven't been using it long enough to see how durable it is under rough driving conditions, but will update if there are any problems.The specifications for this device say it handles phones that are \"4-7\" inches wide. I'm not sure what they mean by that. It will definitely handle a phone that is 7\" long, but the adjustable jaws only go 4\" wide. I suspect what they meant is that it will handle a phone that's up to 4\" wide and 7\" long.Another note here, regarding one two-star review, where they said this device wasn't for thick phones. That person's phone had a pop-socket mount glued to the back of it. You can't use this with a pop-socket mount, and it's not fair to judge this device based on such ignorance. Also, the specifications for this state your phone is supposed to be less than or equal to .5\" thick, and with their pop-socket mount, their phone was closer to an inch thick.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1623801600000}
{"reviewTitle":"Happy","reviewDescription":"Perfect fit and steady!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"The best vent mount I’ve had to date","reviewDescription":"This is by far the best mount I’ve had to date.  It stays where you put it, has a very strong magnet so the phone stays put. I’ve bought several more for other cars I drive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Excellent phone mount!","reviewDescription":"I normally use when I rent a vehicle. Easy to mount. Excellent stability. Easy to get phone in and out. The adhesion is excellent too. When in remove it, I reuse the original non-stick covering to keep the stickyness until the next time I use it. Been using for a year now and still is great!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Great","reviewDescription":"Has performed flawlessly. Even moved to a second vehicle and it's lasted without a single issue. Highly satisfied. Easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"SOLID!!!","reviewDescription":"This phone mount is so good! The last one I had was always falling and a bit flimsy. I've had this for maybe 6 months now and it hasn't fallen once. The way it's set up doesn't allow for it to fall. I can adjust its position and lock it into place and it will stay. However, keep in mind that it is meant to keep in one spot, so when you install it, make sure it's where you want it to be for a while. My phone fits perfectly in it. It was very easy to install and it's made perfectly to charge your phone while set in the phone mount.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Sturdy and does the job","reviewDescription":"Sturdy and does the job","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"2 months in - perfect in my Mazda with suction","reviewDescription":"Stuck it on the dash two months ago, and it's done great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Fits","reviewDescription":"Fits nicely","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Very functional","reviewDescription":"Easily and securely holds my phone.  Easy to remove my phone from the holder.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Works as described","reviewDescription":"I like this and will buy otheres for my other car","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Durable","reviewDescription":"Bought this a few days ago and WOW. It is durable, locks in tight to vent and rotates! Haven’t used the mount for the dash yet but I’m sure it is just as stable! The release and locking function also works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"This is the one","reviewDescription":"This a fabulous, well made, cell phone holder!!  I will absolutely buy more for my other vehicles!!  ****** Instructions ****** You must though my degrease the spot your going to attach it to.  A little alcohol swab isn’t going to cut it.  I used an un-scented alcohol sanitizer on a paper towel and scrubbed it!  Once the area was completely dried I placed the adhesive disc and pressed down hard.  The instructions say to let things rest for a day.  I erred on the side of caution and left it for a day and a half.  Here is the catch!!  You have to mount the suction lever towards the windshield.  If you mount it any other way it will fall off!  I’ve tried to sow this in my 2d photo.  The end result is a very stable mount that survived a brutally hot North Carolina summer.  I spent hours researching different makes and models of cell phone mounts until I found this one.  I read through the comments and incorporated the different lessons learned into the process I used.  I wish you the success I had!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1668211200000}
{"reviewTitle":"Great phone holder for your car that won't fail!","reviewDescription":"I have had many phone holders for my car but none ever lasted and felt flimsy, this holder when installed on my dash is solid! My phone locks in place and does not move, even on the roughest roads! So glad I bought this holder and highly recommend it! I use a Samsung 24+!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Works great on my dash","reviewDescription":"I purchased an ac vent holder but it would not work on my vents. Returned it and bought this one. Attached to the top of my dash and all the adjustments allowed my phone to be in a perfect visible position and it's convenient to have the charging cord on the phone while in this holder. It's been on the dash 2 weeks and hasn't budged. Highly recommended. It has so many adjustments.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Love it","reviewDescription":"I love it, it’s the best one I’ve bought. All the others break so easily, highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Great Phone Holder","reviewDescription":"Really happy with bitten. I’ve only used the air vent part of it and I love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Nice","reviewDescription":"Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Stands above the rest","reviewDescription":"I have tried many phone mounts over the years. Vent mount, dash mount, cup holder mount. They all are good at some things and poor at others. Maybe it’s sturdy but it blocks a vent. Or it has good visibility but it’s a little wobbly. Very sturdy, doesn’t block anything, but it’s out of your peripheral vision, making it dangerous.This mount is literally the only thing that I’ve ever used that has checked every single box.Most important to me, it’s extremely stable. You can extend the arm quite a bit and maneuver the angle to suit your needs, and I was shocked at how little jiggle there is. I’ve actually bought two of these mounts and the original is still stuck to the glass where I installed it two years ago. That’s impressive.And the fact that you can stick it to any glass means you’ve got a lot of choices on where to mount it. I’ve got mine off to the left in the small triangle window of the driver side door. This puts my phone just off to the side, perfect to keep my eyes on the road and check the map.It comes with a vent mount as well but I’ve never used it. The glass mount is all I have needed. And I really like the spring loaded mounting mechanism which allows you to gently nest your phone in the holder and release it when done.Zero complaints for me. Especially at this price. I would probably pay double, given how durable it is. Knowing I won’t have to buy another mount is priceless. The only reason I bought two, is because I got another car.I’m a fan.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Works great!","reviewDescription":"Applied to windshield. Does all that it is supposed to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"I liked the options-vent or stick on","reviewDescription":"Works great in my car. Happy with my purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Works Great!","reviewDescription":"Borrowed one from a friend and had to replace it.  Decided to get same model.  Sturdy and stable it’s a great mount.  Wouldn’t use any other.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Works well","reviewDescription":"this was easy to install and easy to use, however won't work well with a thick phone case","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"This","reviewDescription":"You got it right. I wish the depth of the brackets was bigger for thick cases and pop sockets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"If you live in a very hot climate - 2 THUMBS DOWN","reviewDescription":"This does NOT work in  hot Texas summers. I like the idea of the holder, but it just doesn't work. If you always park your car in a garage, then yes, maybe it would be ok.  I gave up after the holder, with my phone in it, fumbled off the dashboard during normal driving. It just can't handle the heat.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Great Product - Not Really","reviewDescription":"Great product in lots of ways huge CON falls off!!!I started with the mounting plate - cleaned and dried area, attached mount to flat surface, apply pressure for 2-3min, allowed to sit for 24 hrs.I was driving down the interstate and phone falls straight to the floor.So I went with the suction to glass option, lasted about two weeks, driving across bridge this morning and down goes the phone to the floor of the car.And guess what??? Just pass the allowed days to return! Another piece in the garbage.I wish Amazon had a way for us to flag companies we no longer wanted to purchase from","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1615507200000}
{"reviewTitle":"Poor Suction","reviewDescription":"I really like the design of this and how it holds my phone and the level of adjustment, however it falls off my windshield multiple times a day making it useless..  I've cleaned the windshield, cleaned the suction cup, and tried to optimize the way I have it on the windshield to make it have as little downward weight and force as possible, and it still falls off my windshield several times a day.  I replaced it with a $8 suction style holder from Walmart with zero issues, the Vicseed just doesn't have enough suction power.  Great cell phone holder aside from the fact that it can't do the thing it's designed to do...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1622592000000}
{"reviewTitle":"“Stable as a rock” and “powerful suction” my ass","reviewDescription":"I followed the directions to a T for installing this car mount and literally with 3 seconds the whole thing fell off when I placed my phone on it. The suction part of this car mount won’t hold up the weight of my phone. Don’t waste your money!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Mount Doesn’t Stay, Don’t Buy","reviewDescription":"Mount keeps falling off of it rendering the entire product useless. False advertising as it is not sturdy at all and can’t hold the weight of itself. Very dissatisfied as I got this for my fiancé for our anniversary and it didn’t work out.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688428800000}
{"reviewTitle":"Doesn’t stick long","reviewDescription":"I bought this in February and by April it wouldn’t stick no longer. Used this on my dash and even set it to where the bottom of my phone was supported and didn’t put too much pull or weight on the sticky part. It was a failure and a waste of money. I would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"AVOID UNLESS YOU WANT DASH BOARD DAMAGED","reviewDescription":"What you’re seeing in my picture is the top dash board surface that adhered to the sticky mount. Now I have a light circle in the area this was mounted on my dash board. It peeled the top layer of my dash board right off. This product was only stuck on my car for a few weeks. I decided to take it off and I’m glad I did…otherwise the surface of my dash board might’ve ripped off when I removed it from my BRAND NEW HONDA CRV. Disgusted with this horrible product. You’d be wise to avoid it!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1648080000000}
{"reviewTitle":"*update* Doesn’t stay adhered","reviewDescription":"I bought this based on reviews.  I like the construction of it and how it adjusts several ways.  It stuck to windshield great, until I put my phone in it.  It stayed on less than 5 minutes then fell off the windshield.  Not extreme temperatures at the time.  Returned it. Starting my search again.  I have an IPhone XR with a small case on it.**edit*** my husband turned the suction cup part upside down and it now has stayed adhered for 2 days with my phone on it.  See photo.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1610841600000}
{"reviewTitle":"Will not support Samsung S8","reviewDescription":"I tried using it with the vent clip prior to using adhesive suction. Neither worked at all.  Phone kept dropping where I could not see screen. Then I used the adhesive suction that was in box. Well I mounted it for a couple of days to ensure it was good, only to come out after a warm day to find the adhesive didn't stick well. It came off the dashboard. I would not recommend at all. Of course it always happens when it is too late to return. I wish I would have not waited to test it out after receiving shipment.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Don't waste your money!","reviewDescription":"Will start with shipping, was a prime product, 2nd shipping, it took 6 days to arrive.  I purchased this due not wanting to put adhesive pad in my jeep, didn't happen.  Adhesive is terrible, it stuck to nothing, the holder kept falling off window and area of dash I wanted it to go.  Owned it for about 5 minutes before I returned it.  Don't wast you money, it would be better to throw the money out of the window instead of wasting it on this piece of junk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1617148800000}
{"reviewTitle":"Piece of crap with no customer support","reviewDescription":"Adhesion came off within 3 months of use.  It stuck to the dashboard just beyond the Amazon \"return\" window, so it's a complete waste of money.  I tried contacting the company through the Amazon provided website, but it's just a series of links in another language that go nowhere.  Definitely don't buy this product unless you want to waste your time and money.  I'd give it a zero star rating if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1618963200000}
{"reviewTitle":"Don’t buy","reviewDescription":"The thing wiggles around so much… When I put my phone angled so I can see the screen it flops all over the place and I can’t find a solution for it…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"Did not stick","reviewDescription":"I put the mount on my dashboard and let it sit for a few days because the instructions said the longer it sits the better the suction. Well that is not true. When I put my phone on the holder as soon as I start driving the suction comes off and the whole mount with the phone falls off. The one that screws on the air vent works fine.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1624406400000}
{"reviewTitle":"Fail product","reviewDescription":"Very disappointed, it did stick on dash board even 1 day or 5 sec so am using it other way by clipping it to the vent it’s working great over there otherwise it’s dashboard attachment is fail :(","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Customer","reviewDescription":"I purchased this phone holder for my car. I tried sticking it to the dash board it is not staying the adhesive does not stay the entire holder falls off the base. I tried the clip for the vent in my car my phone keep falling off. I’m not happy with this purchase. I tried using double sided tape to connect the holder to the base it is still not sticking. I own a IPhone 12 plus.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1611619200000}
{"reviewTitle":"Will not buy another!  Damaged the dashboard!","reviewDescription":"The boast of high temp was untrue.  The suction cup melted a sticky slimy mess down the dashboard.  Removed Vicseed phone mount and threw it into the trash.  Then paid an upholstery shop almost $40 to remove the sticky slimy mess leaving a mis tinted color to the dash. Mick","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Had to repair & modify","reviewDescription":"The nut that held the cradle onto the arm cracked within a month making this phone mount unusable. I imagine most people would have tossed it after that. I replaced with a brass plumbing nut that I got at the hardware.  I had to modify the nut by cutting off the collar. I also attached a post to keep the phone mount steady.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626480000000}
{"reviewTitle":"Not safe to use","reviewDescription":"I used it yesterday and it held during the night but it does not hold during the day and kept falling off which is very dangerous while driving. I will be sending this back. So i decided to try again followed the instructions and it still does not hold suction but now i cannot remove the adhesive circle that is on my dash. So i can return it. What should i do?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1621468800000}
{"reviewTitle":"Thought it would last.","reviewDescription":"It did not even last 2 months. A component in the inside broke and released a spring. Total waste of my money. I had high hopes when it was brought.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"Didn't like it.","reviewDescription":"I didn't like the structure and how it held my phone.  It was quite bulky.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Works well","reviewDescription":"Bought this item early spring. Had to stick mount directly on my dash as the included adhesive plate would not stay securely.However, it has stayed put over months of regular use. Your dash might get damaged, but it will definitely stay put.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656979200000}
{"reviewTitle":"Easy to install and use but adhesion pad could be better","reviewDescription":"We installed the pad for the mount suction cup on the car dashboard and waited the recommended time before mounting a phone. After a long drive with an iPhone 12 mounted at max arm length, the adhesive pad fell off. Luckily it was still sticky and stuck on with a shorter arm length.Other than that, installation is simple and the phone is easy to mount and take off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641254400000}
{"reviewTitle":"Well worth the money!","reviewDescription":"I have tried other phone mounts and none really work as well. I had to replace my phone case so my weather tech didn't work anymore. Magnetic mounts don't work either. My phone is kinda large and thick thanks to my poetic case on my Samsung galaxy s21 plus. It still barely fits, but better than others. I can now have it on my windshield where I can see it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642204800000}
{"reviewTitle":"Exactly as described but...","reviewDescription":"Kept falling down whenever the car sat in the sun... ended up getting something else.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681084800000}
{"reviewTitle":"Used the Vent Mount, Love it.","reviewDescription":"ok, so I've had this thing for 24 hours, so not exactly a long term test...  HOWEVER, I can tell you that I love the vent mount. Easy to attach, and mounts with no wiggle or give.  So far, no real negatives.  I'll update if anything comes to mind.  Can't speak for the window mount, personal preference, I don't like 'em.  Looks sturdy enough.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640131200000}
{"reviewTitle":"Good not great","reviewDescription":"I got this to use in my wife's car while I'm DoorDash delivery driving. She did not want anything permanently mounted in her car, so I got this model because it had the vent clip option. It works . . . okay. The part holding the phone works just fine. The part holding onto the air vent is just okay. At its maximum tightness, it will still slip right off the vent if I rotate the mount to the left or pull on it in the slightest. You really need to keep it stationary, which is fine. I mean, for the money, it's good enough for someone not looking for a permanent setup.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Good phone mount, strong suction.","reviewDescription":"Alot better than my last phone mount, it was the kind that clips on the vents. Only problem is this one wiggles back and forth like the suction cup is loosely fitted to the base, so the whole mount bounces\/moves back and forth. Other than that it's been great these last few weeks. Also I suggest setting the direction of the base of the mount like in mine and others photos, it gives you a couple extra inches so your phone isn't resting right against the vents, depending on your car.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622073600000}
{"reviewTitle":"Happy I made the switch from vent clip to this holder!!!","reviewDescription":"Was very excited for this to arrive I’ve gone through so many cell phone holders and I have finally given up with the vent clip and gone to the suction and this one with the extending arm works just perfectly with my wireless attachment. Very happy hopefully it sticks for a long time the suction is great but the adhesive doesn’t really adhere to my dashboard as much as I’d like but I can fix that that’s not a big deal my biggest concern was whether it would coordinate with my wireless charger and it does and I am very happy with it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610755200000}
{"reviewTitle":"Great but weight of phone causes tilt","reviewDescription":"I liked everything about this except for the fact that the piece that your phone actually sits on tilts from the weight of your phone. It’s a problem I’ve had with every phone mount, but this one at least mounts to the dashboard so it doesn’t completely fall over. I do wish there were a way to tighten the ball and socket joint considering the fact that cheaper ones have that ability, but it’s something I can look past for it’s overall great quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623974400000}
{"reviewTitle":"Good Product","reviewDescription":"The product is fine. I have had no problems with how it works. Though keep in mind if your dash is slightly curved, it will not stick to the dash. I had to stick mine to the window. I didn't want to cover up the ac, cause it's super hot during the summer.However, the rubber backing is just not holding up to the Texas heat. It has bubbled up and I hope the backing doesn't come off. I'll update if it does.Overall, it's solid and I believe you get a good product for what you pay for.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1594598400000}
{"reviewTitle":"Melted and made a huge mess","reviewDescription":"It melted and made a huge mess. If you live somewhere where it gets above 80 degrees Fahrenheit don't buy it. It was good otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Easy to install","reviewDescription":"When you first use the product, it's great. The suction is strong and it holds. But after a few weeks, the suction starts to lose its effectiveness like all the other suction phone mount products. It keeps falling down.  I do, however, like the ease of set-up of this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"Different brand second time ordered","reviewDescription":"Overall, this has a very great suction and does not get worried if there's excessive heat on your window like I have been used to with other brands. However I'm quite disgruntled about this one because this is the second time I ordered this particular one and the clamps are different than the first one therefore my phone doesn't set steady with the side clamps because they curve in the ones I had before actually were straight and not curved if that makes sense I will not be buying this again because of that. The whole idea is to hold your phone and if you have a contraction that can't do that then there's no purpose.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1626652800000}
{"reviewTitle":"Returning","reviewDescription":"The suction cup with the glue is great for the windshield. I had it there for a while with no problems...except putting in a sunvisor was impossible because of the huge arm sticking out of the glass. In the Vegas heat a visor is a must have. So, I decided to use the air vent option but the part that comes together to hold\/pinch the vent was way too long and hits on the inside components and wouldn't go in all the way (2020 4runner). So it would keep falling off with the weight of the phone. Lastly I tried the disc with \"3m\" like glue on the dash but that also didn't work and kept unglueing with the weight of the arm and phone. Returning.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1601683200000}
{"reviewTitle":"Doesn’t work right","reviewDescription":"The suction works well on the phone holder but it comes with a disc to stick on your dash board to then put the suction part on. It’s said to wipe the area and then press it on hard for a minute. Then let it sit for up to 72 hours before you try to attach the phone holder. I did all of this and the disc came right up after I attached the phone holder. At least the suction cup works so I can stick  to my window, otherwise I’d return the product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639440000000}
{"reviewTitle":"Wont stick!","reviewDescription":"InStalled on a smooth vertical surface on my truck after cleaning the spot extra well with alcohol. The Adhesive pad fell off after a month of so. Ordered a set of replacement pads and both of them feel off after about a week. I used one of the pads that fell off and attached it with screws: after a day the suction cup gave out and fell off! Now the suction cup wont stick any more. Now i have a adhesive pad screwed to the surface of the truck and the phone holder wont stick to it any longer. Not a good product!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617235200000}
{"reviewTitle":"Didn’t work for me","reviewDescription":"Stuck it on my windshield first, didn’t work.Stuck it on my front dash with the piece given for that afterwards, didn’t work.Was easy to install but didn’t last with me so now I’m out looking for another.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679097600000}
{"reviewTitle":"Defective Part","reviewDescription":"Easy to install as windshield  mounted phone holder. It served its purpose well but after 8 months the phone mount suddenly collapsed. I was surprised to find that the plastic nut that holds the phone mount to the arm had cracked.  I attempted to connect with the manufacturer for a replacement part at the website that the Amazon rep identified for me but keep getting a 404 error message. I will try to see if I can get a replacement for the part at the hardware store but the inability to contact the manufacturer is disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1631145600000}
{"reviewTitle":"Not for thick case phones.","reviewDescription":"It's like any other car mount. I don't know why it's advertised as a thick case holder, bc is clearly not. All I have is a popsocket and it is not deep enough to hold the phone. If they would have just made the arms that clamp down just a bit wider, then they could claim that. I really don't know why it's so hard to design a car mount with deep clamp arms that can hold a phone in a case and has a hole on it like most phones now have. Very frustrating. Poor design on all car mount products.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1611187200000}
{"reviewTitle":"Lasted about 2 weeks!","reviewDescription":"I used the adhesion pad to put up this holder. It lasted about 2 weeks then it wouldn’t stick anymore. I needed the sticky pad because I had many display areas I didn’t want covered by the holder. I also didn’t want to cover an air vent because I live in the south and it gets hot in a car. Unless you are st king the holder on a vent or a completely smooth surface don’t bother with this holder. Waste of my money and my search continues for a phone holder.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1631491200000}
{"reviewTitle":"It does not stay in place…..  and the rotation piece broke the first time I used it.","reviewDescription":"It does not deliver what it promised.  Cheap material also….. breaks very easy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656460800000}
{"reviewTitle":"Suction cup is really strong","reviewDescription":"The suction cup is no joke, it won’t budge, but the platform adheres to your dashboard with a 3M adhesive, and that fell off within two days for me. Otherwise the product is really sturdy, I’m overall happy with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634601600000}
{"reviewTitle":"Doesn’t stick in extreme weather","reviewDescription":"This is a really cool product, and held my phone well.  But the package directions said it might not work in very hot climates.  I wish I knew that before  I bought it and it fell off my dash on the freeway (Arizona).  I returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624492800000}
{"reviewTitle":"Disappointed","reviewDescription":"I had this on the car for a 2 weeks before it lost its adhesion and fell off. I had high hopes for this but it did not meet my expectations. I did follow the directions and cleaned and dried the dash area before installing. It did last longer than others, so there is that!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"Vent clip","reviewDescription":"The vent clip comes loose and I have to retighten it at least once per week. It works fine otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"Amazing","reviewDescription":"I bought this for my dad and he loved it just the suction only worked on the window and not the dashboard. But that was our only problem everything else was amazing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641772800000}
{"reviewTitle":"it fell","reviewDescription":"it fell after having it on the car for about three weeks so I'm not sure what caused it to fall. maybe the phone was to low and added more weight.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1642377600000}
{"reviewTitle":"Good but Could be better","reviewDescription":"It’s alright , the clip is steady and good the main thing I can’t get it to stick anywhere in my dashboard. I even tried to sandpaper an area make it a bit rough it couldn’t stick regardless might buy gorilla glue to reinforce. Overall the clip is steady and good love it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619308800000}
{"reviewTitle":"Overheats","reviewDescription":"Every time I use this phone holder it overheats my phone. At first, I thought it was the case but it does the same thing when I take the case off so I'm returning it. It's messed up because it's actually a pretty good phone holder.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626307200000}
{"reviewTitle":"Keeps everything together","reviewDescription":"I have an otterbox case and a popsocket and my phone still stays in place. Very grippy, can charge phone while in this holder.My fiance bought the low profile magnetic car phone holder- but when he hits a big bimp- the phone falls off.Update: the silicon suction cup turns to goo after two years.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616544000000}
