{"reviewTitle":"I like my food hot… not kinda warm..","reviewDescription":"As someone always on the lookout for a reliable solution to keep my lunch warm at work, I initially gravitated toward the HOTLOGIC Electric Lunch Box. It has been a dependable choice with its straightforward warming mechanism, ideal for busy office days. Its plug-and-play nature made it easy to keep a unit at my desk, ensuring my meals are warm and ready when I need them. I also pair it with my newly purchased Lava Lunch Heated Lunch Bag for good reasons. It offers a different, innovative approach with its Lava Rock technology, which uses microwaveable heat packs to maintain toasty meals for up to 5 hours. This means no more worrying about finding an outlet, making it incredibly convenient for those who are frequently on the move. It is also crafted from non-toxic materials and features an easy-to-clean liner, which adds to its overall user-friendly design.I need a versatile and effective solution for keeping meals warm, the Lava Lunch Heated Lunch Bag delivers on all fronts. Its emphasis on ease of use and portability aligns perfectly with my lifestyle needs. Warm items go into hotlogic and HOT items go into lava lunch. Easy. If you are looking for a heated lunch solution that offers more flexibility and capacity, give both a try and see which one works best for you!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"HAPPY SIXTH ANNIVERSARY! Last purchased May 22, 2018","reviewDescription":"I decided to write this review because I just took out yet another perfectly heated lunch and realized how much I loved this product and never shared a review. It was sheer coincidence that it's the sixth anniversary of buying this product.With out a doubt, HotLogic is one of our most RELIABLE and often used products we've EVER purchased on Amazon, this little miracle does what it does simply and perfectly, all the time, every time! I almost always bring leftovers with me to work, and the first thing I do when I get to my desk is plug in my HotLogic and zip my plastic lunch container inside. By the time lunch time rolls around I have a perfectly heated meal waiting for me! Yum! I have the mini and fell in love with it so much that I bought my wife the larger one with the included glass container.One thing that bears mentioning that often gets overlooked, is the fact that this works so much better than a microwave! Because this heats with gently from the bottom, your food will heat more evenly and still taste the way you intended it to be; delicious, hot, moist, and uniformly heated. I hated waiting in line at work to share the one messy, smelly microwave, and then have to walk back with my hot food to my office.Also, if you get an inexpensive AC adapter for your vehicle's lighter port, you can have HotLogic heating your meal as you drive. It's great for long car trips, camping, or even the drive-in!","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Worth it","reviewDescription":"I keep it at work and grab a frozen dinner on my way out the door. I plug it in and put my meal in it. When I'm ready to eat lunch it's nice and hot and perfect. I've used it for leftovers too! I liked it so much I bought a second one for my car to heat up breakfast while I'm at physical therapy. Best product ever!  I bought this because I really needed something to help me eat lunch everyday. It has made figuring out lunch a breeze!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"I am totally in love with these mini ovens! BUT, read the review and know what you're getting.","reviewDescription":"First, I want to mention that it was YEARS ago when I bought my first Hot Logic Mini, and over a half decade later, it's still going strong! Since then, I've bought the \"Family\" size, the expandable bag style, and now this 12VDC version (and a couple backup ones for my camping gear kits).So, on to the details...WHAT YOU NEED TO KNOW:- This is both a cooking \"bag\" oven and\/or a warming plate, depending on how you use it. Yes, it will COOK food (even frozen food), unlike many of the generic \"warming bags\" out there.- Do NOT use meltable cheap plastics (eg: very cheap plastic bento boxes or \"ziplock\" style freezer\/fridge bags). It does get hot enough to melt them. If you use plastic bento boxes, use high quality ones that aren't warping or bubbling in your microwave or dishwasher.- I suggest any of the high quality glass bento boxes available on Amazon for the best and widest range of cooking and heating.MY REVIEW:I bought one of these over half a decade ago, when I started my first foray into ketogenic dieting. This was back when it was really tough to find low carb meals anywhere. So, I'd prep my meals for a week or two, put them in glass bento boxes, and stick a bunch in the fridge and in the freezer. By \"prep\", I mean, most of the time, the stuff would be raw. I'd take them to work, stick them in the Hot Logic Mini, and plug it in 2-3 hours before lunchtime (depends on what I was eating that day - more on that later). By lunch, I'd have a hot, fully cooked meal!So far, I've found it does a really good job at cooking things like boneless chicken (chicken breasts, chicken thighs, chicken strips, etc), heating or even cooking lasagna (really nice when I make keto lasagna - the only thing I pre-cook is the ground beef so I can drain it), fish (apologies to my coworkers) and even veggies (use the 2 or 3 section glass bento boxes and put the veggies in their own section with a little bit of water for fresh, or as is for frozen, with maybe a little butter and some seasonings).I even found it can cook steak! Yes. You can actually cook totally raw (or even frozen raw) steak in it! The caveats for cooking steak are:(a) it cooks fattier steaks better (more tender)(b) it cooks it to something between a juicy tender stew meat consistency or pressure cooked and braised consistency(c) it leaves lotsa steak juices in the bento box (which helps keep the steak tender till you pull it out.So, while you're not getting a grilled steak out of it (and the steak takes a while to look the right color), what comes out is delicious. As a matter of fact, a bunch of cut up ribeye or chuck\/stew meat in it, with some cut up raw carrots and potatoes, and maybe the tiniest bit of beef broth - plus a few hours to slow cook - and you're going to have a nice beef stew.I've also cooked eggs (scrambled with cheese) in them - that works out ok; something between pan fried and microwaved. It's a great time saver for weekly work food prep.It's hard to burn anything in them, which is nice. The Hot Logics just keep slowly heating the stuff, so, it is a little easier than stove cooking in that respect, that an extra hour won't destroy your food.WHAT I'VE COOKED:I've cooked bag rice (yes, the microwavable bags will survive in them, break up any rice clumps, stick them on their side, and cook for a couple hours), steak, fish, chicken, lasagna, scrambled eggs, veggies (spinach, broccoli, carrots), frozen microwavable dinners of ALL sorts, and much more.IMPROVEMENTS?Not many suggestions for this already near perfect product.- I wish they had a combo unit that was AC and DC selectable, but at the price point and small size, I'm ok if they don't.- They should integrate a velcro tie onto the cable- They should make a double height one (would be nice to put my meats on the bottom and my veggies in a glass bento box on top). I do understand why they probably won't though, because sadly I think it would confuse people who tried cooking a steak or chicken on top of something else.All in all, I now own 4 of these (was five, gave one away):- my original one, which I still use to this day- one spare for when I go on camping adventures (it only draws 40w, so, I plug it into my car's 100w inverter)- one family- one DC version (I have a Renogy battery bank that I can use to cook in tent)- one expandable one (has an expandable storage bag built onto it).I gave away the spare and moved the original into my car where it almost permanently stays, and use the expandable for work, so I can put silverware and such in the top. The DC version just came in a week ago, and will be migrating into my camping pack.NOTES:When you buy one, you will get a link to info on recipes - or you can visit their site yourself and find tons of recipes of food you can actually *COOK* in these.","isVerified":true,"ratingScore":5,"reviewReaction":"173 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Perfect for work.","reviewDescription":"Works great for what I need. I am a railroader and the Hotlogic is easy and convenient to pack in my work bag for my meals while on the engine and going down the tracks. The only thing was the lid was busted when I received it in the mail, but isn't that big of a deal.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"I've never been happier with a purchase!!","reviewDescription":"I bought this because I really needed something to help me eat lunch everyday. It has made figuring out lunch a breeze! I keep it at work and grab a frozen dinner on my way out the door. I plug it in and put my meal in it.  When I'm ready to eat lunch it's nice and hot and perfect. I've used it for leftovers too! I liked it so much I bought a second one for my car to heat up breakfast while I'm at physical therapy.  Best product ever!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Great for Travel","reviewDescription":"Takes much longer than a microwave, but food does not get burned and overcooked like a microwave. Takes a little planning in advance, but food goes from frozen to steaming hot (see pictures).Getting tired of eating fast food all the time while traveling, so the Hotlogic is a lifesaver for me. Great product and great results so far.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"I've used one so much I had to buy another one.","reviewDescription":"I use this just about everyday for various meals. From frozen meals to warming up pizza to even quick quesadillas. One thing I've managed to work around is plastic baggies or plastic containers. I use them all the time for different meals and what keeps the plastic from melting is putting a paper towel on the warming plate and then the baggie\/container on the towel. If you're heating up a warm sandwich, pizza, anything with bread; by occasionally flipping it over, it'll keep the bread\/pizza from getting too hard to eat. If you're warming something up but don't want it too soggy, keep one side of the bag unzipped. That will air out the steam and your food won't be too soggy\/wet. For quick quesadillas, just a tortilla and cheese. Clean off the warming plate and place a flour tortilla directly on the plate. Flip it over a couple of times and once the tortilla is hot enough, add cheese and fold the tortilla closed. This makes it less of a mess than if you're doing a two tortilla quesadilla. You can actually add more to the quesadilla as well. I actually cook eggs with this warmer as well as warm up frozen sausage links or patties. Once the eggs and sausage are ready, add that to the quick quesadilla and you've got a breakfast quesadilla. Or even make burritos. I cook my eggs in foil cupcake tins, just spray them with some cooking spray. It's makes for great Sausage and Egg muffins too, like at McDonalds. I even make cheeseburgers but I buy the pre-cooked burger patties and warm them up, add sliced cheese and whatever else you want and put that on a burger bun and you've got a cheeseburger. I like to keep things simple but tasty. I don't always like depending on frozen meals so being able get easy ingredients and make something in this is great. Easy clean up too. I use mine so much that I got another one just in case I might need it.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Works like a charm","reviewDescription":"Been using this thing for a few months for work since I travel around a lot. It definitely gets food hot enough. I unusually put my stuff in about an hour before lunch and it’s always piping hot! Even if it was frozen when I put it in. Just don’t forget to unplug it when you’re done for the day or it will drain your battery, ask me how I know…","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Best purchase ever!","reviewDescription":"Got this for my partner because her work doesn't have enough microwaves and all 40 workers take lunch at the same time. This heater box is a lifesaver! It accepts glass and plastic containers and can even cook food - though we only use it to reheat. Just be aware you might need to vent your food periodically if you leave it plugged in for a long time. Love this and all the colors it comes in!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"I finally have a Portable Travel Microwave","reviewDescription":"Perfect for travel, especially since more and more hotels do NOT have microwaves (?!!).What I Like:- Portability- Quick heating.  Other comments said it took a couple of hours but my food was hot in less than 90 minutes- Easy to use.  Just plug and pack your food.- Gives me a \"microwave\" for leftovers while traveling- Foolproof and safe- Excellent customer service.  I found it at a better price within hours and they honored it!What I Don't Like:- Container attached is small- You can't just stick anything in this.  My saran wrapped sandwich was NOT a good idea, saran wrap melted and made a mess.- Must be careful it doesn't get crushed in your luggage.  I found a bigger container and filled it to make it more rigidSUMMARY:  This is a must get for travelers. Though I have only tried it with the plastic container (not paper bag) I found it an excellent product.  Concept is easy, heating mat within an insulated bag, it does the job and safely.","isVerified":true,"ratingScore":4,"reviewReaction":"38 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Worked for about a year and a half.","reviewDescription":"Worked for about a year and a half.  About 3 hours a day 5 days a week as a trucker.  Than the plug started to smell and melted the plastic. Now it keeps blowing the fuse.  This is the second one because the plug on the first one broke.  It works great but has a short life.  The plastic food container that comes with it is cheap.  I use an aluminum food container which works way better.  The plug wire is long enough to keep the warmer out of the way.  Never had a problem with the zipper or warming plate.  I'll buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Nice idea, execution could use work","reviewDescription":"The idea is nice. Not having to use a microwave, you can heat up something that's inside metal. But it takes quite a long time and by the time it's totally hot, it's dried up quite a bit.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Hot logic food warmer","reviewDescription":"This is good for travel on the road. My third one. I hope it lasts as long as the 1st one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Works as expected","reviewDescription":"Does take a little bit of time to heat up food but overall satisfied. Only wish it had a battery operated feature when no outlets or car charger is available.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Heating dish is plastic not pyrex","reviewDescription":"This is a great little gadget for heating up leftovers or cooking frozen dinners.  I have never used it for cooking.  Mine is a 12v and great for camping.  Food usually heats up in a half hour.  It didn't come with a pyrex dish but a plastic one, which I do not like.  I did have a small pyrex dish with a lid of my own that Iuse instead.  These can be purchased cheaply at Hoome Goods or TJMaxx.  They used to sell these with a pyrex dish but not anymore.  Also the temperature cannot be controlled.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Great way to have hot food without a microwave","reviewDescription":"I don't like using a microwave and I travel a lot.  It heats slowly but very thoroughly.Must be plugged in","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Usefull","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Works but takes time.","reviewDescription":"This thing is very easy to pack. Great for hotel rooms without microwaves. I tested mine with a thermometer and it maxed out around 140° F. Shouldn't melt plastic containers. One thing to note is that it is slow. Expect to have your food in this for at least an hour depending on how much mass is in there.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"So far so good","reviewDescription":"I've o ly been using it 6days a week for about three weeks now. I have no complaints besides the length of time it took to ship to me. I shouldn't complain about that either, considering the original date I was set to receive it was actually a week after I actually received it. My self and my co-workers love ours.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Such a great purchase.","reviewDescription":"I bought this almost a year ago in the early part of the pandemic so I could avoid touching a bunch of surfaces in the breakroom. I have never been a fan of the communal microwave (I am a manager at a grocery store and some of the people I work with are pretty gross) but covid added a new layer of terror, and this lunchbox was a great way to deal with this.A few months later I changed positions to an admin\/HR\/bookkeeper role where it’s very hard to leave my little office and clock out for lunch. Someone always needs me for something or other and I have conference calls, interviews and new hires to deal with all day long. So, I decided to put this to work in a different way. My only outlets are under the desk so I plugged in one of those Christmas tree floor switches that you tap with your foot and I leave my Hot Logic plugged into that.Every day when I get there at 5 or 6am I bring in a small breakfast from home (sometimes a homemade foil-wrapped burrito, sometimes a frozen breakfast sandwich with its original plastic wrapper…) and drop it in my Hot Logic and tap it on with the foot switch. My food will be perfectly cooked whenever I can find a moment to eat an hour or three later. Then sometimes I will buy a sandwich or some cold chicken nuggets from the deli or a frozen meal from grocery and drop it in there to nosh on for lunch. It’s so handy to have my meal ready to go so I can eat anytime I have a spare moment between appointments.Also, this little lunch box works great to cook just about anything. It has never melted any plastic wrappers or boxes but somehow manages to crisp up the crust sometimes. The food is never rubbery or dried out like it gets in a microwave.My only major qualm is that the durability kind of worries me; for one thing, the little cord keeper on the side has already started coming unsewn. I hope that keeping it in my office and not actually carrying food in it will save it from wear and tear so that won’t be a problem. Like others have mentioned I do wish there was some sort of LED on this too because I’ve forgotten my food in there once or twice but I have ADHD and visual reminders are really helpful for me.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1624060800000}
{"reviewTitle":"Quality is good, it works as designed.","reviewDescription":"Great product for every day use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"If you take leftovers to work, you need this.","reviewDescription":"Let me start off by saying that I use this with a container that fits perfectly inside.  The description for this container on amazon is: Pyrex Storage 6-Cup Rectangular Dish with Dark Blue Plastic Cover.  It took me a while to figure out exactly what container to use so I want to save people some time.  This container costs $6.55 on amazon at the time of my purchase.  Don't waste your money on the one with the ventilated lid, that's only useful for microwaving and costs more than double.  This oven will not pressurize the inside of your container.  Microwaves are horrible about that because they heat the water very aggressively so that some of it is boiling even when your food is cold in the middle.I plug this thing in when I get to work at 8:30am and when I eat lunch sometime after 11:00am the food is perfect.  I was concerned at first that this might overcook my food leaving it in there so long but it does not.  Today I had leftover steak, It was the ultimate test because it was one of the best I have ever cooked and the microwave I was using before always ruined steak.  It was outstanding.  You can leave your food in this thing for a long time and it will be fine.  If you are a few hours late to lunch no big deal, it will still be better than microwaving.  The secret is that it cooks your food in a sealed container with very good temperature control, trapping the moisture and odor inside.  Since it cooks gently and from the bottom you do not need to worry about your plastic lid.  The lid just doesn't get that hot.I have access to a microwave at work and I never have to wait for it, that being said, I will never use it again.  Frozen meals are excellent in this unit as well, the difference between this and a microwave is even more obvious with frozen food.In case anyone is curious about it, I did some research and found that the power consumption for the HotLogic Mini is 45 watts.  That's 0.375 amps at 120 volts.  Taking into account the efficiency loss of using an inverter, you could run 4 of these off of a standard 20 amp 12 Volt socket in a car.  I have never tested this but the math works out.Update:It's been a while and both of my units are still working perfectly.  I have been using the one I keep at work every day and I will never go back to microwaving.  Since my food is so much better now, I bring my lunch much more consistently and the savings are adding up.  When my lunch break starts I get to sit down and start eating right away, It blows my mind that my co workers can see how good this thing is and yet they still use the microwave to destroy their food.  I paid $30 each for mine and it's possible the best money I've ever spent.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1403827200000}
{"reviewTitle":"when you want a hot lunch but don't have access to a microwave","reviewDescription":"Love it.  I didn't have to have sandwiches when I worked a 4 week assignment with no way to heat a lunch.  One of my co-workers bought one for her son who drives a truck so he could use it on the road, since it also has a cord to connect it to a cigarette lighter in the truck.  I was able to heat my lunch in about 20 minutes or sometimes less, depending on what I brought.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715040000000}
{"reviewTitle":"As advertised!  Does what it's supposed to do with ease.  Compact and a joy to travel with","reviewDescription":"This HotLogic Mini works great for travelling.  No more getting stuck with hotel restaurant food or granola bars.  I've heated up burritos, leftovers, frozen sandwiches, etc. on this hot plate.  The included plastic container works great, but mine eventually developed cracks in the lid.  No matter--I got some Glad 38 oz rectangular take-aways (BPA free, microwaveable) and they fit perfectly.  Not sure if the lid will handle the heat generated by my HotLogic, but it should.  The bases of the Glad containers are slightly taller than the original container, so they could be used without the lid if it seems to deform when heating.Glad Take-Aways:https:\/\/www.amazon.com\/Glad-38-oz-Rectangular-Food-Container\/dp\/B0BF6148R2\/ref=sr_1_1?crid=FKIFOCK69XFZ&keywords=glad+take+aways+38+oz+50+pieces&qid=1706559292&sprefix=glad+take-away%2Caps%2C439&sr=8-1Bravo for HotLogic for inventing this device!  I have no need for an in-room microwave anymore (apparently frowned upon by many hotels--it's a rarity for me to find a room with a microwave).  As long as I have an hour or two to heat the food, the HotLogic will do it!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Awesome!","reviewDescription":"Works great! I use it daily working over the road. Heats up quick.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"A truck drivers friend","reviewDescription":"As a truck driver I can't stand having to use the microwaves at the truck stops they are hardly ever cleaned and sometimes don't work this is a game changer I can put my food in cold or frozen or even uncooked and as I work it will cook this lets me have a a better range of options where I can stop and not have to worry about trying to find somewhere where I can heat my food up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"I really like this","reviewDescription":"I pre-made meals, froze them, and then took them camping. Used this ‘stove’ to heat up the meals while I was out and about. Worked great. Takes little power to run.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Great if you work outdoors","reviewDescription":"I bought this for my husband and he loves it. We read the reviews so we knew the food can take a while to heat up so we prepare his food the night before or in the morning and he heats it up in this portable electric lunch box. I wish I would have gotten this for him a long time ago. I recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Excellent","reviewDescription":"This is the best item so far from Amazon","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Works great, short life","reviewDescription":"I have bought three Hot Logic Mini 12 volt warmers. I bought my first one several years ago on the recommendation of a friend and was very happy with the purchase. It heated my food quickly, even if it was frozen. I'm a truck driver and this was a great way to eat warm home cooked food without spending a lot of time and money at a gas station or truck stop. After several years it finally quit working so I immediately ordered another one in May of 2023. That one lasted until January of 2024 and just quit working. The light on the plug would glow but the warming tray would not heat. I decided to try one more time and ordered my third one in January of 2024. It has now quit working, and just like the last one the red light on the plug glows but the warming plate stays cold. Both of these last two warmers worked great for the short time that they worked but then just quit working after about 7 or 8 months. I'd like to try another one but I'm not sure it's going to last.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"food warmer","reviewDescription":"was not impressed with this warmer so send it back","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Material","reviewDescription":"No me gusto la tasa de plástico","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Muy angosta","reviewDescription":"Es demasiado pequeña","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"SO SO","reviewDescription":"ok to begin the zipper was very hard to zip open but closing was fine and I heated up some chili that took an hour to get Luke warm so I would not buy this if your in a hurry to eat","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"5 years","reviewDescription":"This lasted 5 years. Now, only a small area of the heating plate works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Lasted about a year","reviewDescription":"Great product when it was working, which is why im giving it three stars, got hot relatively quick and did a good job of keeping your food warm.My biggest issues with it is build quality, the zippers, from day one were terrible, and just got worse over time, and here we are, about a year later, and the heating element is broken.At 40ish bucks, I dont think its worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1712707200000}
{"reviewTitle":"Okay sort of","reviewDescription":"Its a good idea. It works for me because it keeps food warm for hours. And the food taste much better than getting nuked in the microwave. My complaints are as follows - Food gets soggy. Since all of the food is effectively in the same oven (sealed dish) it all gets cooked at the same temperature. The heating plate somehow senses when the food inside needs to be cooked and it cooks for a period of time before reducing temperature to hold at warm. There is no way for it to know that some food should be cooked shorter and some longer and it would not matter anyways since there is only one heating element and one dish. The end result is as the manufacturer claims - the food will never be overcooked - but that depends on your definition of overcook (like asking Slick-Willy-Clinton what the definition of \"is\" is. Rarely will food ever dry out (sweet potatoes will if you leave them in there for 10 hours by themselves.) But once the cooking is complete the temperature lowers to keep the food warm indefinitely but all of that moisture in the sealed dish will cause vegetables to become soggy, and meats to become more and more tender. So really meat and fish can remain in for 10 hours and they are fine. Vegetables will be soggy after just a few hours depending on the type of vegetable. I purchased two of these ovens and they are plugged in 10 hours\/day. The meat and fish are plug and play and I can eat from them whenever I want, though they do become more and more tender and will fall apart easier as they day goes on. The vegetables need more attention and are best only left in there 2-3 hours and then replenished for the next meal, otherwise they will become wilted and soggy. Cooking vegetables like brussel sprouts is confusing - they can be in there for 8 hours and be barely tender enough to eat, yet after just two hours they are wilted and \"grey\" looking inside and out. Peas will wilt. Broccoli will wilt very quickly. Red peppers if not eaten in three hours will turn to mush. A little disappointing. My second complaint is the heating process - the manufacturer recommends keeping food in contact with the bottom of the bowl. This limits the usefulness of the oven. The manufacturer recommends a 6-cup pyrex container. If you limit the food to the amount that can touch the bottom of the container than you really cant carry that much food. Apparently the food gets cooked thru the surface to surface contact on the bottom. Any food not actually making contact with the bottom will get cooked but takes significantly longer. I pre-cook all meat so if I layer a second layer of meat, it will get heated properly just takes longer than the bottom later and not as hot. If I layer a second layer of raw vegetables, the cooking takes much much longer for the top layer since only the bottom layer will really \"cook.\" And does that second level actually cook or do they just get soggy? Maybe a little of both. One last comment - because of the heating technology used which admittedly I really don't understand, once the dish is opened and food removed, the food taken from the bottom of the dish is really really hot, but it gets cold really really fast. So if you insist on a hot meal like I do be prepared to eat fast otherwise you'll be making trips to the microwave. As i said earlier, its a good idea.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1445644800000}
{"reviewTitle":"Too long to heat food","reviewDescription":"I wanted to love this. I am a flight attendant and most hotels do not have microwaves in the room, so this was going to be the answer for me...or so I thought. Getting in close to midnight or later and being hungry...it takes FOREVER to heat my food. When I get to my hotel room, I am ready to relax, unwind and eat but I ended up waiting so long that I fall asleep. Again, I wanted to love it, but I do not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"This is not 12v as advertised","reviewDescription":"Product says it’s 12v and it is not. You need a 110 inverter to run it. Instructions even say 12v and it has a 110v plug. It works good on 110v but is not as advertised.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Great product","reviewDescription":"I visit my husband who is in a memory care facility from morning till night and I was spending lots of money buying food every day for me. Now I can bring my leftovers to his facility and use this product to heat up my food. It works great is compact and sturdy. It is a wonderful product and I wish I would have thought of this outstanding idea.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"Excellent","reviewDescription":"Muy bueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Reliable","reviewDescription":"This is my 4\/5 purchase of the hot logic. Buying as gifts because they are so useful. Highly recommend these to anybody wanting to cook, reheat or anything in-between.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"best thing ever !","reviewDescription":"love it! use  it multipole times a day! only warning is the heating element is not sealed so don't spill any thing on it, also zippers I pulled the little goodie off but was able to reinstall so carful with zipping. other than that great product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Cumpleaños muy bien su función","reviewDescription":"Toma su tiempo pero calienta muy bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Works great on the road","reviewDescription":"My son heats his hamburgers in his truck when on the road. Works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Perfect microwave alternative.","reviewDescription":"Plug in, treat like a slow cooker. No sound no microwaves. Perfect.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"It works better than I thought it would","reviewDescription":"Provided you have a always hot 12v plug it works great for lunches. Takes more time than the manufacturer says but works well for my timing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Hot meal anywhere you want it.","reviewDescription":"I absolutely love this product! I'm a truck driver and used to buy most of my meals from truck stops because I wanted a hot meal instead of a cold sandwich or something similar. Now I just meal-prep something at home and enjoy a nice hot meal while on the road! I like it more than a microwave because it heats everything all the way through. Now, it does take longer than a microwave, but if you have the time, it's so much better.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Great for work & not having to wait in line for microwave","reviewDescription":"This is my 3rd one. I use one regularly at work to avoid having to use the microwave for my lunches. I’ve lent one to my parents for reheating the frozen meals that I prep for them. …And this one is for me to use at home. I think they are easy to use, healthier than the microwave, and great for using with a battery pack either during a power outage or on a trip.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"One biggest CON!!","reviewDescription":"The moment this product arrived I thought this was saved me some money and one of my food quick but I've done 3 testing in and I am extremely disappointed. I thought it would easily wipe my food quick. But it just takes way too long and is way too time consuming.  I tested with 3 different containers. The first container was just like a Had a full amount of food in it and when I warm it. I thought it took like 30 to 40 minutes. No, it took 2 hours and 2 minutes to warm up the food in a good hot temperature tested it with a second container I used a small one with a decent amount of foods. Warm it up that took 1 hour and 35 minutes In the last third container was a glass container and after I tested that that took over 3 hours to warm up the food It works don't get me wrong. But the biggest con with this product is that it is way too time consuming, especially that's those that's on a Go like at work or something. So I personally do not recommend this product at all. If you're someone, that's needs to bring a lunch to work.  And there's a no microwave or something.And you gonna use this, don't use it. It takes like hours to warm up your food By the time your food is warm up enough your break is over. I suggest finding like a different type of electric lunch boxnot this one My only advice for the ones that made this product.  Increase the heat so the food quicker.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Worked great for 6 months…","reviewDescription":"I’m a local intermodal truck driver who works out in the morning and meal preps 2 meals a day for the entire week while at work following my 16 fast. I’ve taken care of it as it’s been great! A lot of these shippers don’t even have restrooms let alone somewhere you can warm up food or even get past the caged area past the S\/R door. Followed the instructions heat it up on its own for 15-20 minute then place your food inside and in an hour boom it’s hot and ready to eat. I noticed that hot and ready temp being the first to go when my food wasn’t as hot and then one day plugged it up and nothing! Didn’t heat up at all. Purchased in Jan and died beginning of this month Jul so 6 months was all I got at 2 meals a day. So maybe if you do 1 you can get a year out of it? Definitely a bummer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Quality","reviewDescription":"(EDIT) This product works as it should.One thing I wish i would have known before purchasing is that it would take an hour to heat up my food.I cook about 400-600g of food and that's in each meal prep container.I heat it up in a very cold state, not frozen, just cold.I never really stir it up, just shake it in the container after about 45 mins.______________EDIT:So I've had this product for about a month or so, and recently it just stopped working entirely.The light indicator turns on when plugged in but the heat pad wont heat at all.It's not the 12 volt socket because i can charge my phone there just fine.I visually inspected everything and it looks completely fine. Don't know whats wrong with it, it just stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"2 hours","reviewDescription":"It will take you about 1.5-2 hrs to heat up a container of soup.  I tried it 2 days in a row, you are better off driving and microwaving it at a local deli and making it back to the job on time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"A must have for a company driver","reviewDescription":"I am a local truck driver, and this is a must have! I I was recommended it by a few  friends of mine to get this. I got it and I’m not disappointed there’s many different versions, but this is the best !! Makes your food hot like it was just cooked on the stove! Worth themoney and saves you from eating unhealthy and spending by eating outOk update very upset it stop working keep in mind I use about twice a week give or take. I tried to reach out to Amazon or hot logic, but got no response. I should’ve just bought a microwave or cheaper one if it was only last us long. Not good I’m out on $40.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"No temperature regulation = Ruined meals","reviewDescription":"Serious and dangerous flaws. I tested the HotLogic on two separate frozen Marie Calendars dinners. The first one, I plugged in at 8:00 A.M. and checked it at 11:00 A.M.. I opened the zippered bag a saw the contents of the dinner rapidly boiling and the plastic film bulging out. The temperature on my laser thermometer read 215 deg. F on the package film covering. The contents were overcooked, unrecognizable and inedible. I tried a second dinner and timed it for only two hours with pretty much the same results. The problem with this particular unit is that it had no temperature regulation and would not maintain a constant temperature (like a slow cooker). Did I get a defective unit? I was surprised, because most of the one star reviews were because the unit didn't get hot enough or just stopped working.I think that the HotLogic is a great idea having serious flaws that need correcting. $40.00 is too much money for a cheap zippered lunch bag with an unregulated temperature \"hot plate.\" I expected nothing of the HotLogic except a warm meal after a few hours, but it just couldn't deliver. No more ruined meals for me. I just returned it.Note: I rarely leave one star reviews. This unit just might have been defective. Don't let this review keep you from trying one out. You might get one that works.","isVerified":true,"ratingScore":1,"reviewReaction":"271 people found this helpful","country":"United States","date":1526688000000}
{"reviewTitle":"Garbage product","reviewDescription":"Stop working with in 30 days of the purchase","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"ARRIVED USED and OILY","reviewDescription":"Product appeared smaller than I expected. However, when I opened it, it was already used. The product was oily, and had pieces of food left inside. Please see photos. Definitely returning this item!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Demasiado sencillo para el precio.","reviewDescription":"Muy pequeño, solo tiene un compartimento y es demasiado sencillo y muy caro.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Second hot logic. Both stopped working","reviewDescription":"This is my second 12V Hot Logic. Both stopped working. Plug is illuminated, but hot plate stays cold. I work as a first responder and rely on the hot logic to heat my food. I will not recommend this product to my coworkers anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Good for drivers","reviewDescription":"Got this for my hubs who is a truck driver. He doesn’t always have access to microwave.  It took about an hour to heat his food while he was driving and was able to have home cooked meal on the road.  He likes it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Muy útil.","reviewDescription":"Calienta mi comida muy bien. Ahora no tengo que comer frío en mi trabajo como conductor de vehículos.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Works great.","reviewDescription":"Takes about 30 minutes to heat up food in a Pyrex container. Gets Hot.  Great for traveling.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Useful item","reviewDescription":"I use the standard plug in type all the time for heating leftovers or side dishes. I bought this with a power cord converter for travel and\/or as a second meal heater. If you haven't tried one before they take about an hour to heat up a refrigerated meal and two hours to heat a frozen dinner. Great for work as it keeps smells mostly contained.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Most convenient and now lunch tastes better.","reviewDescription":"I bought this about a year and a half ago and I use it a lot.  I even bought another to have in reserve in case this one should meet an untimely demise.  You do need to evaluate the time needed to heat what you are cooking, but that doesn't take much trial and error.  Most things I've heated can stand to sit in the heat for an hour or two longer than is really necessary, if it should come to that.  Many things I heat for lunch taste better in my Hot Logic than coming out of a microwave oven.  A frozen solid lasagna requires for me to plug it in as soon as I get to the office, but then it comes out really good.  Rice with some chicken, veggies, and spices requires me to set an alarm on my phone to remind me to plug it in about an hour or two before lunch.  I bought it for the convenience of not using our break-room microwave, the food tasking better is a very welcome bonus.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Best purchase to save me money and eat healthy!!","reviewDescription":"*****************************************update 11\/14\/2016******************************************************This unit still works great!! I have purchased a second unit! I will tell you frozen dinners taste so much better from the mini oven than the micro wave! They come out smoother and better tasting... This product continues to heat my food and makes for a better day for me while I am at work.*****************************************original review below**********************************************************************************************This is working out so great!! I take this to work with me and to workshops!!! No more using nasty community microwaves or standing in line for the microwave!! I love this item!!Saves me money and keeps me away from the nasty microwave and nasty cafeteria! I was so tired of the long lines and attitudes at the community work microwave!!! I was tired of the nasty cafeteria food and wanted a way to heat my food instead of always taking sandwiches as an alternative! I saw this mini portable oven when it was around $39.00. Which has already paid for itself at first I thought the price was too high.The straw that broke me down was when I was in a workshop and the one micro wave that was there went out after a person had used it and left me having to eat cold food!!! I said never again, as soon as I made it home I ordered this and the on the go cereal bowl and salad unit! Working for someone else is hard as it is!!! So I said never again will I be in a position that I have to eat cold food or use a nasty micro wave that is unhealthy!!! Or pay for nasty food, that may not have even been prepared correctly!So far this unit has paid for its self, I have ate chicken, and rice, spaghetti, soups, sausage green bean potatoes, and many more! I cook in my bigger crock pots so dinner is done when I arrive home, so I take a portion of that meal and place it in the glass Pyrex ware for my lunch for the next day and what a pleasant treat for me knowing I have healthy food warming and in a clean unit!!!Someone told me that it smelled good in my work space I just said thanks because I did not want them running and telling, you know how some people can mess things up for others. (Yes, that is the type of work environment I currently have) So this unit makes my day pleasant knowing I have a great lunch waiting for me!!!I am so happy with this unit that I plan to purchase an adapter for our suv so that if I need to heat food up in the suv I can if I am out in workshops and there are no plugs etc (things do happen).I highly recommend this unit! For me it blesses my day because it gives me more time to also read my bible during my lunch instead of waiting in line to purchase food or heat my food. I make sure I always have something to heat in my portable oven even if it is just a can of soup! I refuse to go back to the micro wave or cafeteria!I don't have to stand in line any or more or watch the attitudes of people waiting for the microwave or using the microwave. I am grateful, for my current environment, just speaking on how much of a blessing this unit has been for me!Peace of mind!!!! Gives me more time to also eat the word for lunch!!","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1431734400000}
{"reviewTitle":"Me encanto","reviewDescription":"Muy buen produto muy util para mi esposo que trabaja de camionero","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Great!!!","reviewDescription":"My husband loves this thing. Works and warms up his meals while working. He works for the railway so I did have to buy an adapter from eBay in order to plug in on the train.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"12V: Perfect for Working Out of a Car","reviewDescription":"I work as an environmental scientist and I primarily work in remote areas. Even if I wanted to buy lunch everyday, I usually don't have the opportunity. I've gotten tired over of the years of cold sandwiches & salads. With this food warmer, I can have a hot lunch everyday which is especially nice in the winter when I am working outside and freezing cold. I've never tried to heat anything from frozen but heating a refrigerated meal only takes 20-30 minutes. It will get your food piping hot. I highly recommend this if you work out of a vehicle. I've had it for about 5 months now and so far, so good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Es perfecto","reviewDescription":"Muy bueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Too short and plate a bit too small","reviewDescription":"Had to exchange it because it was very shallow, also a few inches bigger plate would be way better, but the next size up is a huge casserole size. I wish the sizing on their products were better.  Also the zipper was super flimsy and it was hard to zip up, it seemed as if it were gonna fall apart tomorrow.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1641513600000}
{"reviewTitle":"Good idea","reviewDescription":"Got this because a co worker has one, I thought it would come with dishes for the inside to reuse, but it didnt, and I don't have that size","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679443200000}
{"reviewTitle":"Too small","reviewDescription":"I love it, but the only draw back is the size. I like to eat a lot but I'm limited to what containers fit in this thing. I had to purchase new ones just to use it. If it was an inch or 2 taller it would be perfect. Also, you have to carry an extra lunch bag for work because the only thing fitting in here is your warm meal, not your drink, snack, fruit, or whatever else. My plastic fitpacker brand meal prep container only leaves an inch of room on one side.Note: I was going to order on their site originally to get their package that comes with 2 minis and a joining tray for 80 bucks, but had a terrible experience with their customer service so I ordered through Amazon whom I trust.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1495843200000}
{"reviewTitle":"Not sure it works as it claims.","reviewDescription":"I purchased this item as a Christmas gift for my son. He’s used it twice at work and has not been able to get it to fully warm his food.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Works, but takes like an hour","reviewDescription":"It’s smaller than I thought, and works enough. It takes about an hour to heat up my food, it does get hot though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674604800000}
{"reviewTitle":"did not get hot enough for me","reviewDescription":"I liked that it was small. you could put most anything in it to warm...unfortunately it took too long to heat things for me..Do not attempt heating anything from frozen.. it takes several hours.. defeating my purpose of freezing meals ahead of time.. I would have to defrost over night before trying to heat them up..Leftovers were fine as if you used a tight closed container.. I loved that you didn't need to watch over them..just plug it in and a few hours later they were warm...I got use to another brand that got hotter,,,.. odd thing is this one keep popping off more than the other one I had been using and not coming back on...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1585958400000}
{"reviewTitle":"start heating at breakfast to eat hot food for lunch","reviewDescription":"I like the idea but it takes much longer than they say to warm a couple bean burritos.  I had to leave it run 4 hours to make warm but not hot for items which were cold from the cooler.  Which makes it less convenient than the 2 or 3 hours I believe I remember being lead to believe.  Don't take it internationally as they held me up for an hour in security before letting me through I really thought they would take it away from me.  So far I have had only a few questions from security here but most of the time they serve my bag if I  am carrying this item.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1570665600000}
{"reviewTitle":"Help My hot logic won’t turn on","reviewDescription":"It won’t turn on","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685145600000}
{"reviewTitle":"Nice but doesnt last long.","reviewDescription":"I’ve had my hot logic for 2 months now and it just now stopped working. I use it 3-4 times a week heating one meal. And today was the day it decided not to heat properly. And the usual 50 minutes it would take to heat my food took way longer, so I just ate my food half way warm. When I first started using it. It heated my food fast and properly. Pizza came out soggy and everything else like chicken, rice and veggies turned out perfect. The size and design were perfect for my pyrex glass dishes and even plastic tub-aware. Stores easy in my backpack. And just perfect for my on the go job.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1558051200000}
{"reviewTitle":"Container showed up broken","reviewDescription":"Giving three stars since the packaging clearly isn’t great. Container arrived broken, hopefully nothing else is. Don’t have time to return since my boyfriend leaves tomorrow for the week and needs this for his food. Will update on how the rest of it works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650153600000}
{"reviewTitle":"Huge Disappointment","reviewDescription":"For the price I was expecting a lot more for the money & thought how it looked like it was made out of reflectix with a tiny little conduction plate. After I opened my package I couldn’t believe how flimsy it was. If I paid 9 $ less I could have gotten a heated lunchbox with a metal container with the heat element built in & an additional metal insertable container, lockable cover, two power cords, 1 12 v & 1 110 cord in addition, metal eating utensils included. This hotligic came with a thin little disposable type container u would get for take out from a Chinese restaurant. I haven’t plugged it in or tried it yet but I definitely won’t use the container. I believe the container would leak inside the lunch pouch. I wouldn’t recommend it to anyone.What’s more, the container was crushed under the pressure of being pushed into the mailbox","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"BURNS OUT FAST","reviewDescription":"I've purchased two (thinking the first one that quit working was just bad luck) the second just lasted a few days past 30 days. Great concept but the product just isn't there yet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Plastic container","reviewDescription":"I misunderstood the type of container.  It came with a cheap plastic container rather than a glass dish with a secure lid, as shown in pictures provided in the reviews.  I am hopeful that it is still a useful product, but I am disappointed with the container for this price point.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Zipper snapped after like 5 uses.","reviewDescription":"Bought this to use occasionally and today when I'm zipping it up the zipper snaps in half. Lol","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"The heating element works great, but the bag isn't durable","reviewDescription":"2 stars for the efficacy of the heating element - it really does work, and it's such a great invention.But the bag, the part that houses the whole thing and enables it to be portable and self-contained, is crap. To be fair, I purchased this several years ago, but also to be fair, it seen literally less than 5 uses in that whole time and the seam on the bag has a hole in it. My original intention for this was to send lunch to work with my fiancee, who is in his truck all day. Unfortunately, he didn't think it was nearly as good of an idea as I did, and so it sat in its box, totally unused, for almost 2 years until I remembered I had it, and it was too late to send it back.I used it once on a vacation where I knew I would be getting an insanely large steak dinner (go to Jocko's, if you're ever in the San Luis Obispo area!) and was staying in a place without a microwave. I used it 3 times when my mom had an accident and wanted hot food pre-prepared for her so she didn't have to hobble around the house. And just this last week, I used it once to bring my food to work for lunch.So, yeah. That's not a lot of uses, and definitely not a lot of zipping and unzipping, and really, it was only 4 times because on the 5th time is when I saw the hole. Nothing very heavy has ever been held inside, and it was only held by the handle those few times it was used. For $40, I would've hoped that the bag would be more durable than it has proven to be. Still, the heating element works, and heats food well. I wonder if replacement bags exist out there.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1596412800000}
{"reviewTitle":"Good heat but it doesn’t hold up","reviewDescription":"I’m on my second hot logic lunch box in 12 months and it’s starting to fall apart again. It works great for heating up my food but it’s cheaply made. My first lunchbox lasted about 4 months and the charger fell apart. This one I’ve had about 7 months and the zipper is falling apart now","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Quality has severely declined. Very flimsy and cheap feeling","reviewDescription":"Short version: This was a huge disappointment. I immediately returned it after receiving and assessing it. This item was severly lacking in quality.I am an EMT and was so excited to get this after seeing one of my partners with one.  He bought his 5 years ago and had nothing but great things to say about it. The lunchbox itself was good quality, nice and sturdy like any regular lunch box you'd buy. The food container inside was also a good quality reusable food container one would reasonably pack daily lunch in with flaps to seal it.The item I received was absolutely poo. It's the thickness and sturdiness of a free throwaway lunchbox you'd get as a promotional item. I would never pay more than a dollar or 2 for a lunchbox so cheap. I wouldn't even be comfortable washing the inside for fear it'd fall apart.The heating element is the only thing that feels sturdy but after seeing the quality and \"care\" of the rest of this item, I don't trust it to last.Lastly, they have the nerve and disrespect to include a **disposable** takeaway container as a \"free gift\". Mine came cracked and I'd rather it wasn't included at all.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1647648000000}
{"reviewTitle":"Don't buy---breaks before it's a month old!!!","reviewDescription":"Purchased on 4-1-2024 and today, 4-29-2024......Needs to be replaced and if that's not in the cards, will purchase another...Had such high hopes this would be great.....Nope folks, it sucks!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Silent, easy to use, but faulty wiring — doesnt last long for the price","reviewDescription":"Loved these, but they don’t last long. I think the wiring inside is cheap or not fastened properly, because after months of steady use only on a flat surface, one suddenly failed, smelled of burnt wires in spite of gentle use and regular care. And we have had to return others for the same reason. Also, the corners aren’t shaped properly and catch in the zipper unless you fiddle them. And a family member had a long list of ways she fiddled with timing and other details to keep meat from going rubbery while veggies and purees separated into water and mush after more than the recommended minimum reheat time. Example, rice, even premade in pouches, will scorch unless you add water and stir, or flip the premade pouch, every half hour. Looking into other brands.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1666742400000}
{"reviewTitle":"Short life span","reviewDescription":"Worked great for 19 days beyond the 90 warranty period of 90 days, then stopped heating completely. The red light on the plug turns on when connected, but the heating plate no longer gets warm. Will not purchase another. Not Wirth the money fir such a short usable time period.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"I will test 30\/45\/90 days  TBD.","reviewDescription":"It worked  will cycle 30\/45\/ 90 days. TBD","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682121600000}
{"reviewTitle":"Works great but could be designed more user friendly.","reviewDescription":"It works really well for heating food and keeping it warm. I would have given it 5 stars if there was an easier way to remove the Pyrex 6 cup glass dish it came with without burning my hands. It is such a perfect fit that the first time I used it I burned my fingers on the glass and then on the steam when the lid popped off while I was trying to lift it out the dish. Now I either unplug it and let it sit opened for a few minutes or I just keep the dish in the mini oven while I'm eating from it. I also wish it had an outside zipper or some place to store silverware. I haven't tried storing metal silverware in the oven for fear of burning my fingers.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1461974400000}
{"reviewTitle":"Only last up to 12-16 months","reviewDescription":"I purchase 2 of these for my truck driver husband.  They last about 12-16 months and then stop working. Each time my husband was on the road and couldn't eat lunch. Hes also diabetic. So disappointing.  I think I'll try another brand.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660262400000}
{"reviewTitle":"Good idea but poorly executed","reviewDescription":"The slow heat personal oven is not a bad idea but there are some design flaws and in my opinion, the product is also poorly constructed. To begin with, it lacks a on\/off switch therefore the only way to turn it on or off is to plug and unplug the power, this is kind of clumsy.Secondly, there is no temperature control. Once the container of food reached the desired temperature, the oven cannot be turned down to prevent the food from overcooked. For that reason, if green veggies are left for too long, they will turn brown.Finally the case is really low quality. It is very flimsy and insulation is next to nothing.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1545177600000}
{"reviewTitle":"Stopped working","reviewDescription":"My husband works outside and doesn’t have access to warm up his lunch. I purchased this and It worked great till it quit working after a couple of months.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Too small but works","reviewDescription":"I wish it had both adapters but I still like it, I have alot of my coworkers buying some now","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Well worth the money","reviewDescription":"I love my hot logic min, it’s one of the best purchases I’ve ever made for heating food. I use mine when I go fishing. I just plug it into my trucks cigarette lighter and I have a warm entrée in just about 25 minutes. If you are going on vacation or you travel for a living there are two different types of minis one is for the car charger, the other is for an electrical plug (I own them both) I have used them both and they both heat food very well. This  little item is well worth the money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1568592000000}
{"reviewTitle":"Every thing worked well","reviewDescription":"The heater worked well. Works a lot better than a microwave. I would suggest another brand tho the zipper broke the 2nd time using it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1671235200000}
{"reviewTitle":"Came broken","reviewDescription":"Actually super awesome, didn’t give it 5 stars because the container arrived broken","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678233600000}
{"reviewTitle":"NOT A NEW ITEM","reviewDescription":"I expected a new item. This arrived in a plastic bag, the carrying strap with a rubber band around it and the tote interior was crumpled.  It should have been stated that was return and discounted.I am not returning it because it is inconvenient to do so at this time.  But I am not a happy customer","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633737600000}
{"reviewTitle":"Excellent for trucker","reviewDescription":"This little oven is a good purchase for keeping food warm and for warming food.  Not Styrofoam friendly. It is excellent with take out plastic dishes and glass.  I've had it a few months and I don't have any complaints, yet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Quick delivery","reviewDescription":"I was looking for a microwave on the go and thought this may be a solution for me. It stated in the description possible length of time. Thought this would be convenient for us, but it takes way too long to heat for that. Great thought, super quick delivery, but don't meet my needs. I do think if you are using this for a job, then it would work, but I was attempting to use these for my Summer Camp kids when out and about. I think the time will seem like an eternity when wanting to feed little kids, unless you can truly plug it and forget it for several hours. I think maybe in a jam it would also be a good option or maybe while traveling in a car if it is one person taking up one cigarette lighter or if you are camping out in the woods and have no other source. For me, it would be far quicker and more convenient to just go and pick up food. This is no slight on the company or even the product, just a review of how I feel it would meet some person's needs and why it didn't meet mine. They came just wrapped in thin plastic, but it did have all the instructions inside, a container for you to warm your food in, and it was sturdy as well as cute looking.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1654819200000}
{"reviewTitle":"Smaller than imagined, does the job, is a bit slow","reviewDescription":"You can never fully trust measurements or sizing on Amazon depending on the seller or product in general, but this did come in a bit smaller than I had imagined.Still, you can fit what you need in there. A burger and fries should fit just fine.It does take a good bit of time to heat up, but listen... we're working with car plug-ins. What can you really expect?No real complaints here, just being honest as it may not be exactly what you want, but it works for my boyfriend while on call and he loves it.It comes with a plastic insert, but you may want to switch it out. Insert is easy to clean, we just toss it in with our dishes if need be. Have never had any consistency issues, still works like new after a few months.Overall 4\/5 for sizing and wait time, but a great product for on the go!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1684627200000}
{"reviewTitle":"Arrived on time, as advertised.","reviewDescription":"Delivered as advertised.I do wish it had a 110v plug as well.Handy product, though.  I work in the field all day, in a company truck.  Great for my situation.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"No more sandwiches!","reviewDescription":"This thing works well. I drive truck so I plug it in a few hours before I want to eat. It will cook your food, not just heat it up. My only regret is that I didn't get the bigger size. The zipper snags a little bit. There is no setting so it's up to you to unplug it when you think food is hot.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Pretty happy with it. Here's what I've discovered...","reviewDescription":"Overall, I'm pretty happy with my purchase. I chose to go with this brand because of the extensive online reviews everywhere and a \"feeling\" this may be a better choice than the cheaper brands and perhaps not cause a fire when it's out of sight. Basically it does what it says so I won't waste time going into everything already covered elsewhere.Here's what I've discovered that new buyers MIGHT find helpful. The obvious question... How do I know how long to heat my frozen entree when I'm just starting out?Answer: Look at the microwave instructions! Assume the average microwave is 1100 watts and then multiply the time by 27. Why 27??? Because 1100\/40 watts is 27.5... Meaning it will take the 40 watt heating element 27 times longer to consume the same amount of energy as the microwave. So if your entree says microwave it for 3 minutes... try about 80 minutes (or less to be safe).Is this fool proof??? Absolutely not, it's called a rule of thumb and you can adjust it from there as you gain experience. No 2 foods will reheat the same but at least the frozen entree people gave us a clue as to how much energy they think we should pump into their creation to bring it back to life.Does it work for refrigerated leftovers, you ask??? Sure, except YOU must come up with a microwave time and power setting YOU would normally use to reheat leftovers. 3 mins at 50% power???50% power = (1100\/2) = 550550\/40 = 13.75x 3 mins you'd normally reheat= 41.25 mins in the miniThere're multiple ways to do the math. Just imagine you're throwing watts into a bowl for a certain period of time and then ask yourself how many minutes it would take if you only throw 40 watts per minute into the bowl instead of 1100.I hope that's not too confusing and that someone is helped by it.","isVerified":true,"ratingScore":4,"reviewReaction":"179 people found this helpful","country":"United States","date":1606521600000}
{"reviewTitle":"Do NOT Recommend--YET.  *** UPDATE ***","reviewDescription":"*** Update below - originally 1 star *** I will NOT be returning these (I have two), but I do NOT recommend them right now. I so much wanted to love this item, but I don't. I have tried on several occasions to heat frozen meals in the car and was unsuccessful at all attempts. It takes FAR longer than 2 hours for food to even get warm, let alone hot. I have both types of oven--AC and 12V. I've plugged the one directly into the AC charger in the car and the other I've plugged into a 120V inverter (w\/480W capacity), but neither of them worked well. So far, REALLY, REALLY disappointed. I say \"so far\" because I've only tried them while idling the engine (yes, for HOURS at a time). I'm going on another 5+ hour road trip in a week and I'm going to test them while driving to see if that makes a difference (although I can't imagine how or why it would, but we'll see), then update this review to confirm or change my rating.*** UPDATE ***First, since this thing doesn't come w\/precise instruction, you have to figure it out. I found out that it works best if you PREHEAT IT, just like a a regular oven. All that requires is plugging it in for about 20mins and it gets quite warm. Second, it still takes more than an hour for frozen foods, but for things like RediRice or canned goods it works fairly well (about 40 mins including preheat). While those foods feel really hot in the package, it tends to be just really warm, certainly edible. I've also heated plastic bottles of water for instant coffee; again, feels hot, but just really warm. And I make popcorn! After preheating, I put a bag in and it starts to pop after about 5 mins. After another 5 mins, I unzip the oven and continue to cook until the bag is fully expanded. 😊","isVerified":true,"ratingScore":4,"reviewReaction":"26 people found this helpful","country":"United States","date":1584316800000}
{"reviewTitle":"It’s all good just like I said, wish it had the glass container still","reviewDescription":"Like this product just wish it came with the glass container like it used to. now it comes with a plastic . that’s the reason I gave it four stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Very handy","reviewDescription":"My husband travels a lot and takes dinners to hotels which sometimes doesn’t microwaves in the room.It takes a little while to warm up but he usually turns it on as soon as he settles in the room and is done by the time he’s finished showering.Very handy when he’s on the road and folds up nicely.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"A \"must have\" item for minivan steath camping","reviewDescription":"The Hot Logic Mini is basically a small hot-plate inside an insulated-aluminized lunch bag. We had just started minivan stealth camping and needed a low wattage cooking appliance to complement our existing our 550 Watt portable power station and mini fridge. Since we were planning on eating out each day we only needed something to heat up any leftovers. The Hot Logi Mini, with its ability to take a standard 1.5 Quart square Pyrex Dish met this need perfectly. It performed exactly as advertised. Plugged in it used only 50 Watts. The only inconvenience is having to remember to load and plug in the Hot Logic Mini at least 2 hours in advance of your planned meal. So we'd load and plug in the Hot Logic Mini right after breakfast so that it could heat the food while were on the road. By lunchtime the food would always be piping hot. We've upgraded to a larger power station and bought a butane stove in preparation for our next road trip.  However because of its small footprint and efficient use of energy the Hot Logic Mini is also coming along for the ride.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1658534400000}
{"reviewTitle":"It was great while it lasted.","reviewDescription":"I bought this in June for my husband who is a truck driver, so he could heat up his lunch. So many places he delivered to did not allow him to use their microwave to warm up his lunch during this pandemic. And today, it stopped working. It no longer heats up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"Just ok","reviewDescription":"Simply ok. Takes to long to warm meal. About 2 hrs form my lunches.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661126400000}
{"reviewTitle":"Short lived","reviewDescription":"I loved it right up until it stopped working for no apparent reason. It worked great for 2 months, pulled my lunch out of it today and my food was ice cold, just the way I don’t like it.😩. Maybe I just got a defective one. Lunch time was so nice for two month.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1602633600000}
{"reviewTitle":"Works good but takes a while to heat up food","reviewDescription":"A lot of my coworkers use these and other branded food warmers and for some reason this one takes a lot longer to heat up food then the other brands, for a regular size lunch it takes about an hour to heat up wich isn’t a huge deal just hoped it would work a little better than that","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1598918400000}
{"reviewTitle":"THIS BABY IS A HOTTIE","reviewDescription":"IT'S A HOTTIE 👍Literally a hot product baking on the market right 👉 now. I fell in luv with this teeny tiny oven, after getting over the shock of it's tininess. Bought it, to take with me on my vacation, but started using it, now I can't stop. I've cook some of, everything in this little sucka. Pizza, Hot Pockets, Hungry Man Dinners, Frozen Dinners, Baked Chicken, you think of it, I went there. Definitely will be puttin my order in for at least a few more. It's hottt...YES","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1489449600000}
{"reviewTitle":"Thought it came with indoor charger","reviewDescription":"I thought it came with in indoor light switch charger","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658620800000}
{"reviewTitle":"Just fine!","reviewDescription":"Takes forever to heat up the food but it does get warm.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1660089600000}
{"reviewTitle":"Container broken upon opening","reviewDescription":"Just received my hotlogic. Was very disappointed to find the food container that it comes with was broken. Hopefully this is the only thing wrong with it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643932800000}
{"reviewTitle":"Bought as a gift","reviewDescription":"Bought as a  gift","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668038400000}
{"reviewTitle":"It also would had been nice if it was just a few inches wider & ...","reviewDescription":"It’s a very neat item. It really does the job but it takes too long. An outdoor worker uses the one I bought and when its cold outside, waiting for a meal to warm up is an essence much more waiting for it to get hot! He likes the product, but the inconvenience to use the cigarette lighter while the truck is off site or find an electric outlet is a hassle specially when there is no electric on site. It also would had been nice if it was just a few inches wider & taller.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1446940800000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"Great idea. Poorly made. Was in love when I first came across this product. Once I received mine, I was disappointed. Doesn’t heat food evenly, let’s heat escape where the cord runs from the plug to inside to the hot plate, and the plug in is very cheaply made. My plug fell apart. No damage to it, wasn’t rough with it nothing. And I had just used it before it came apart. Wouldn’t pay $40 for this. Maybe $20, but for $40 you should be getting a better product than this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1602720000000}
{"reviewTitle":"Hot logic needs sturdier plug designs for vehicles","reviewDescription":"This is my third hot logic bag and this is the first one that I must complain about. I have the model that you can plug in at home and I had an older model that can plug into the car but it had a different plug design than the new model. The old model that plugs into the vehicle had its plug crack on me where the plug screwed together, but continued to work. This new plug design has melted and burned my hand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622419200000}
{"reviewTitle":"Just received","reviewDescription":"Looking forward to using this new product opened the package and the first thing I see is the plastic container it comes with damaged. I’m hoping it works great.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"takes to long, may be defective","reviewDescription":"I like the concept, i live in hotels so anything i can cook in thats less likely to get me thrown out is a plus. But I wonder if I've gotten a defective unit. Seems like its taking to long to heat up. Raw thawed meat took like 4+hours and still had some pink. Hour n a half reheating a refidgerated left over burrito and still had coldness. Trying a frozen burrito and sandwich right now, the top of the container is still cold and has been an hour n a half. At this point i can only imagine using it to keep already warm foods warm...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1525046400000}
{"reviewTitle":"Damaged Tupperware","reviewDescription":"The portable oven itself is fine. This is the second one I’ve bought this year. The Tupperware that came with this one was damaged. Going to have to use my own instead. Would not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669852800000}
{"reviewTitle":"Case fails","reviewDescription":"The product heats up well, but the bag is tearing apart. I think they need to invest in a little better material.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1679097600000}
{"reviewTitle":"Big let down","reviewDescription":"This lunch bag had my hubby so happy. He was finally able to have hot lunches without having to buy fast food. He works on the railroad so no place to have hot food unless you buy fast food since not much time for lunch. Unfortunately, it stop working after one week. Very disappointing and I was gonna buy one for my son that’s a truck driver. Glad I didn’t waste my money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1597190400000}
{"reviewTitle":"Plug broke in a few days using it","reviewDescription":"I like the way it warm up, but it’s too fragile broke in a few days, I don’t know how to be honest, it’s just missing the plug connector.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1663545600000}
{"reviewTitle":"Socket broke in months","reviewDescription":"Loved this until the socket portion that goes into the car lighter broke. You cannot simply replace the cord since it’s built into the baseplate. Wish it was more durable.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"Potentially dangerous","reviewDescription":"5 star for the first 6 months1 star after that.Used maybe 1-3 times a week 1-3 hours at a time. One day I started smelling a burning plastic smell when I checked the hot logic I noticed it was extremely hot. Alot hotter than normal. Looking at it I noticed it was shriveled up.  I'm not sure what happened but it was nice when it worked. Probably not getting another one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620345600000}
{"reviewTitle":"Works Well.","reviewDescription":"This product is sturdy with a handle that makes it easy to carry and a four foot cord that facilitates being able to place it in the most convenient area during use. It also comes with a plastic container and lid to use for your warming and cooking needs. However, it would be nice if there was an indicator light to verify that the unit is on at a glance.When it arrived, I cut up and seasoned some raw potatoes and onions to see how long it would take them to cook. It took 5 hours and 45 minutes. When I choose to cook potatoes again, I will slice them thinner to reduce the cooking time. I have not warmed up any leftovers yet but judging how hot the unit got while the potatoes were cooking it should have no issues warming.So far I am very satisfied.","isVerified":true,"ratingScore":4,"reviewReaction":"31 people found this helpful","country":"United States","date":1673222400000}
{"reviewTitle":"Takes a while","reviewDescription":"It does take quite a while to heat up my food but if you start heating it like an hour or two before lunch it works perfect. I’m a truck driver so I’m fine with that. 4\/5 stars","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"No more cold lunch","reviewDescription":"Only reason for 4 stars is because packaging is a a little lame, came wrapped as as you see it, maybe a box next time??  But product is good, last one I bought was a different brand and did not last long hopefully this one gives me at least a year of service","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"Convenient","reviewDescription":"Very light weight and convenient. Takes about 90 minutes to properly heat my food in the size container that comes with it but i mostly do 2 hours. Works well when I have a busy schedule the food heat while I work and when I am ready i just enjoy.It is best to heat it in the bag as the bag protect the temperature as it heats up","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Handy For Van Life!","reviewDescription":"I bought this for use in my Transit Connect micro car camper, which is so small I am leery of using a gas stove inside. I've been testing it in my sticks and bricks first and it works great for cooking small pieces of meat (I made delicious salmon with a cabbage veggie mixture and warmed up precooked rice yesterday), overnight oats, etc.Note that you really CANNOT bake in this. Nor can you cook hard things like raw rice, pasta, potatoes, carrots, etc. It doesn't get hot enough, but the manufacturer tells you that upfront. However you can slow cook meat, tofu, frozen dinners, and other things and they come out great.Note that I bought the 110 version, because the 12 volt was out of stock. I am going to test it on my Bluetti solar power bank later this week but I don't anticipate running my battery down.It will be great to be able to prep and pop a simple meal in there on the morning of a driving day, and have a hot lunch or dinner when I stop.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625961600000}
{"reviewTitle":"Great little lunch warmer but the price has gone up!!! From 9.99 to 39.99","reviewDescription":"I have this lunch warmer for over a year and has suited me very well. I work in construction and i dont always have time or most of the time i cant afford to stop my work and find a place to get lunch. I have deadlines i must meet. So its best ti bring your lunch. Its always better to bring a meal from home thats warm and ready to go. Its small, doesnt take up alot of space and really does heat up food when you want to break for lunch. Have said that though you do have to give it time to warm up your food. I usaually plug it in as soon as i can before 9 am and my lunch is ready by 11 am or whenever its an appropriate time to have lunch. It warks really well with caned soups. I also suggest that you thaw out frizen dinners at home before you decide to use it otherwise youll wait awhile before its done, but it will get done! I do recommend that you also get the glass pyrex container thats for this warmer. It works better in my opinion heating your food evenly and thoroughly because it will heat up the glass.Since i did buy this warmer last year i bought it when this unit was $9.99 and now its at $39.99!!! so that is my reason for giving it 4 stars and not 5. Supply and demand i suppose... It has held up well and easy to clean but the price has gone up unfortunately but It is the smallest unit you can buy and WILL WORK!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1485043200000}
{"reviewTitle":"So far so good","reviewDescription":"Its a hotplate in a laminated tote made out of cloth, it works pretty good but takes awhile to heat up food, if ur foods cold its going to take a hour to dethaw and another hour to cook. It only reaches a certain temperature so u could even touch the service of the hotplate if u wanted and sadly the hotplate is made of plastic not metal, thats how they use plastic and the compatibility for on the go. It has no gauge to control temp just reset low heat. If anything get a hotplate for cheaper with more temperature control with a pyrex bowl and call it a day. This works since i bought it already but i live in my truck and only use 100ah. At 2 hours for every meal im using more electricity than a 500watt hotplate for 5-10 minutes","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Life changing for a truck driver","reviewDescription":"I'm a truck driver and got tired of cold deli sandwiches and they few restaurants that i can park in.  This thing is the greatest thing I've ever bought for work. It doesn't burn food if you forget about it for a while.  I use glass container or plastic with no issue. Takes 1 to 2 hours to heat food up.  Any driver or someone who doesn't have access to microwave needs this. I've recommended it to guys at work.  If it broke today I'd buy another one immediately. Tip- watch the price,  it goes up and down from 30 to 40 bucks.  Buy it at 30.*update*After 8 months of near daily use, it has stopped working.  True to what I said in my original review,  I immediately purchased another one. This time though, i bought it from the hotlogic website directly so i could get the one year warrantyUpdate 2: I bought another one and it broke after two months. The others I bought lasted at least a year. Just past the return date. Should have taken my own advice and bought directly from hotlogic website. Deducting a star.","isVerified":true,"ratingScore":4,"reviewReaction":"575 people found this helpful","country":"United States","date":1526256000000}
{"reviewTitle":"Great purchase","reviewDescription":"I bought it for my husband. To make his lunch or dinner hot. He loves it. It just takes 1\/2 an hour to heat a 32 oz glass tiffin. The car charger which comes in it works good. Overall money well spent.I knocked one star down because the plastic tiffin which came with this lunch box was broken. I did not bother to return it. It was a disposable one. Not a big thing. But still seller has to keep that in mind for future sales.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"Great product that could be improved","reviewDescription":"As a truck driver, I absolutely love this little oven. I use it everyday. Being able to have hot food on the road is awesome. It actually gets hot enough that I have to unplug it and let the food cool down for a bit.  I also found that the Rubbermaid long, low profile take alongs fit perfect inside. It's more durable than the container that comes with the product.That being said, the only issue I have with the product is the pocket for holding the cord. When you first unbox the oven, the cord is shoved in that pocket. But as I used it on a daily basis, folding and stuffing the cord back into the pocket for transport started to tear the lower stitching of the pocket. After about a month I started noticing a tear probably a 1\/2 inch long. Now it is about two inches.It's really unfortunate this happens. I feel like the problem could be fixed with a reinforced stitching on the pocket to withstand the frequent in and out of the cord.But after all that, I would probably buy another one in the future. I would also recommend it to others with the caution that the pocket will probably tear.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1603152000000}
{"reviewTitle":"Didn’t work at all","reviewDescription":"I bought this for my husband to use at work. He had one with the plug in so I thought I would get him one for the truck too. He used it the other day for the first time and it wouldn’t heat at all. He even tried to different vehicles and they were running too. It’s past my 30 days do I can’t even return it","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1588809600000}
{"reviewTitle":"Zipper is cheap and sticks","reviewDescription":"I bought this as a gift and I'm not sure I'll give it to them as the zipper is super cheap and sticks at the corners","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676592000000}
{"reviewTitle":"Safety hazard","reviewDescription":"Do not buy!!! My husband got this to warm his food at work.  It worked great for the first few months.  One day it stopped working as the plug melted.  We tried contacting the seller and got absolutely no response.  What a waste of money.  Please see pics.  Luckily nothing worse happened.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1607299200000}
{"reviewTitle":"Cheap and over priced","reviewDescription":"This thing was worthless, I can't believe they charge $50Its a hot plate inside a lunch bag.... I ended up buying an electric hot pot andam way happier with it","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"Zippers broke apart","reviewDescription":"I got this for an emergency backup during hurricanes. First one zipper broke and then the other. They literally fall apart. Very cheap. I have not even used it to cook as I have had no power outages since I purchased it. Look for something sturdier than this.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1640563200000}
{"reviewTitle":"Not worth the buy, very disappointed.","reviewDescription":"Stopped working after five uses. No longer word when I plug it into my work truck. The car port has power so it is a fault with the product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Stopped working after a short time of using smh","reviewDescription":"I got it in July, didn’t use it for more than three months and it stopped working. I plug it to heat up my food and it would not heat up. I tried different vehicles to see if maybe it was just my car but no. Dead already. Waste of $40 😒","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1614729600000}
{"reviewTitle":"Never worked\/Heat","reviewDescription":"Never worked. Light turns on as if it’s working but the plate never got hot. It was plugged in for hours. Tried two different outlets. Nothing. First time using it. Unfortunately I didn’t use it till a couple months after ordering so it looks like I can’t return it so buyer beware. Check for faulty products right away when receiving.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1594252800000}
{"reviewTitle":"Zipper broke on second use","reviewDescription":"The first time I used this lunch box it was fine. After 2 or 3 hours my lunch was warm not hot by any means. Went to use for the second time the zipper pull broke off. I tried to pull the zipper with my fingers after and the zipper shattered in my fingers.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1606176000000}
{"reviewTitle":"Fire hazard","reviewDescription":"I used this warmer daily for work and loved it . Recently I was using it and realized the 12v plug itself was so hot it actually was melting the plastic around it . The website says set and forget but I would use this product under supervision only .","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1638403200000}
{"reviewTitle":"Wire issues?","reviewDescription":"It kept the food warm, but the plastic keeping the wires in came off while it was plugged in and now it has a bunch of loose wires. It’s fully broken and no longer works. I think it got too hot and possibly melted something in my car.Is a replacement even possible? If a replacement is an option I will have to keep a close eye on it when it’s plugged in to make sure it doesn’t come undone again.I bought this in the beginning of November and used it once or twice a week it broke mid March...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1618358400000}
{"reviewTitle":"One Job","reviewDescription":"It had one job... Reheat stuff that would be bad for the microwave...I bought this for my hotel room with the idea that within an hour or 2, it'll reheat. I bought this a month ago and used it maybe once or twice... The third time I used it, it didn't work, and i made sure it worked or didn't by putting a different appliance in the same socket. I thought I was crazy, but after an hour, 2 hours, 3 hours, no heat. This thing doesn't work, but at least the inside seems isolative and might use it as a lunch box, but really disappointed and bought an overly expensive lunch box","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1597622400000}
{"reviewTitle":"Not what I expected","reviewDescription":"The description of this item was misleading. It's much smaller then expected. And it doesn't plug into a wall","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Insufficient","reviewDescription":"What it takes a microwave oven to warm in five minutes, this item takes 1-2 hours.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Product stopped working","reviewDescription":"This product stopped working after a week of use. It won’t heat up as hot as it did first couple times.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Only used a handful of times.","reviewDescription":"This only worked  a short time. Maybe 15 at most. Then it just quit heating.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Defective, product wouldn't even unzip","reviewDescription":"I would have liked to test this heated lunchbox put, but how can I if I can't even unzip the lunchbox? Pretty big letdown considering all the positive reviews.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Stops working","reviewDescription":"Second purchase the first one we used for about a year and stopped so we said okay let’s just try again and this time after just a handful of times it just stopped . So we won’t be buying nor recommending","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"does not work as described","reviewDescription":"First look, cheap material which make the bag can't stand as it shape after removed the cardboard and manual inside. The heat board can only heat up the bottom of food container while the food inside is still cold. Plugin for 45mins, and yes the outside food container is hot, bottom is especially hot but everything inside is cold. There is no temp sensor or timer which may cause over burn or fire (saw another preview from other customer has pic of the bag was melted down because of the heat. Have no idea why it has many 5 stars reviews, better keep it true.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1587859200000}
{"reviewTitle":"Stopped working after a couple months","reviewDescription":"I don’t know if I got a faulty portable lunch box but it started out at a good temp, I noticed the last few weeks my food has been scorching hot and then it just all of a sudden died and doesn’t work at all in any of the charging ports. I work in home health care and travel to homes all day and barely get a lunch as is and now I’m just eating cold lunches on the go until I can order another one. Really disappointed in this product.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1632096000000}
{"reviewTitle":"The case is thin fabric, delicate on the back.","reviewDescription":"I bought this back in 2016 to heat up food in my work van off the inverter. I really like the unit and it heats up really well. The pros are endless but I have one con and it is the reason I didn’t give it all five stars. As you can see from the pictures, the back seam where the cord gets ticked always has torn open. I am not sure I can exchange it at this point, but you would think something for the working guy who uses it daily, would be crafted out of denier\/ballistic nylon and not this lighter fabric, and certainly not polyester.I am going to end up having to figure something out now.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1614556800000}
{"reviewTitle":"Pretty cool! Worth the money? Maybe!","reviewDescription":"I have an office job where I like to try and save money\/poundage by not going out to eat more than once a week\/every two weeks. I got one of these cause I take a lot of time to meal prep and make sure I eat good for the week, but I am disappointed by what the microwave does to my food. Dulls it, dries it, and doesnt heat it evenly. The hot logic has heated a weeks worth of my meal prep to perfection! My food is never dried out, always full of flavor and tastes like its freshly made. For this reason I find the hot logic to definitely be worth it, it was a little more expensive than i wouldve liked but hey, again, i think its worth it to have my food so nicely heated through every time :) Thanks for an awesome product!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1550620800000}
{"reviewTitle":"poor zipper quality","reviewDescription":"we absolutely love this lunchbox but after 2 months the zipper completely broke off leaving hubbys lunch inside unable to open until he returned home and was able to wiggle it open to remove the food, of course now it's useless as it doesnt open and close, i noticed the price jumped increasing by 10.00 i hope they at least reinforced the zipper when they do so, otherwise i would certainly say I wouldnt purchase at this new price the old (2 month old) price was iffy for me.I am hoping they honor the replacement quickly without hassle, but for the most part I would say it was a purchase we were happy with but it obviously does need some redesigning for constant, daily use.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1595289600000}
{"reviewTitle":"Great little item, especially for work.","reviewDescription":"Rather than heating items up from the cold state, I like to microwave my lunch before leaving the house, put it into the Hot Logic and plug it in after I get to work.  That way, it's already hot and I can eat as early as I like and the Hot Logic keeps it hot.  I like that the heating plate is removable so that you can rinse it out if you spill something which does happen occasionally when containers are not sealed properly.  A couple of things I wish they had done when designing would be to make it a bit larger and to have a zippered pocket on the outside for adding condiments, spoon, fork, etc. but depending on the size of your dish, you can probably just put them inside with your dish.  Since the item is insulated, it would probably work to remove the hot plate and keep cold foods chilled as well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1469059200000}
{"reviewTitle":"Hot Lunch Everyday","reviewDescription":"Thank you for enhancing my lunch. This is absolutely fantastic.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"Love this product but....","reviewDescription":"I've been using it for many times and I like this product because it is light weight and easy to carry. The only thing that I don't like is it takes more than an hour to make soup.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664064000000}
{"reviewTitle":"Great for on-the-go","reviewDescription":"This was recommended by a friend and is exactly what I was looking for.  My husband drives for a living and doesn't get a lunch break, so he can plug this in and eat a hot meal during his 10 minute break.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672012800000}
{"reviewTitle":"Makes food hot","reviewDescription":"Works great and makes the food very warm.  I didn't like having to keep washing out food containers so I bought some disposable foil trays that fit inside perfectly.  I had another brand that just stopped working for a month, but this one continues to work well.  The only think I wish was if it had an on\/off switch as opposed to having to plug and unplug it as needed.  I keep it at work on my desk and bring my lunch. I bough a separate plug switch so I don't have to keep unplugging it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1619481600000}
{"reviewTitle":"Easy to use","reviewDescription":"I’m only giving 4 stars because my husband just started using it so far it’s working great and it heats the food up really fast so that’s a plus.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"Container inside cracked and broken.","reviewDescription":"I’m wasn’t  sure if this hot logic was even  supposed to include a container, but it came totally broken and unusable. Not a big deal because it’s just cheap plastic… but still. Hopefully the actual Hot Logic works! Haven’t had a chance to try it yet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"Does not come with wall outlet plug like in the picture.","reviewDescription":"Had to rip the zipper open to even get inside to see if it had a wall plug to use. It did not. Only a cigarette lighter. Have to return for another brand.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Nearly burned my car down","reviewDescription":"I originally gave this 5 stars. However. This is my THIRD hot logic that has broken. The plug overheats and melts away nearly causing a fire within the vehicle. It’s not the vehicle because i use it in vastly different types of vehicles and it keeps happening. It also always happens less than a month after the return window happens to close. I don’t know what’s going on but I’m extremely disappointed in this product.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1622332800000}
{"reviewTitle":"Didnt work","reviewDescription":"I bought this to warm up food in my car. It was not even ALITTLE warm and i had it plugged in for 30 mins. That means it would have to be on for 2 hours to warm up even alittle if that was the case. I bought it used like new so maybe a new one would have worked better.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Disappointed","reviewDescription":"I was excited to get this and when I did, I was completely disappointed.What a mission to actually get the zipper to open. The zipper is garbage.Inside came a cheap plastic all cracked.I still haven’t used it but this far, not looking forward to it anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1665273600000}
{"reviewTitle":"No es buena","reviewDescription":"Al principio funcionó Perfecto después de 4 meses no funcionó para nada no lo recomiendo","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Multiple uses plug will break!","reviewDescription":"I bought two of these because im a truck driver and both times the plug broke… its not intended for long term. Unless u want to buy one every six months stay away. I tried calling but it just goes to hotlogic voicemain. Will try a different company now","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"L. A. M.","reviewDescription":"No calienta lo suficiente. Es la segunda vez que compro una lonchera de diferentes marca y las dos salieron igual, me pregunto quien será el responsable?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Rip off","reviewDescription":"Absolute garbage Straight Out of the Box. Plugged it in didn't work. It is made so cheap the cord which plugs into the socket doesn't even have an indicator light to let you know that it is receiving electricity from the socket. Quality in our country today is a thing of the past people nowadays build things just to get your money rip you off give you the cheapest possible product with absolutely zero shame. It's all about getting your money. Not worth the box it was packaged in, do not waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1550448000000}
{"reviewTitle":"CORD MISSING FROM PACKAGE!","reviewDescription":"So disappointed, eagerly waited to get this. It arrived today with no cord included. Had hoped to use it on a road trip but am out of luck as have to wait for replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679702400000}
{"reviewTitle":"Expensive trash!","reviewDescription":"Purchased August 11th. Used it maybe a dozen times. Stopped working today September 20th. I bought this to heat food while I'm in my crane at work. Thats where it's been safely stored. Tried to use it today and it doesn't do anything. Checked fuses and they're all good. Expensive trash!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1663632000000}
{"reviewTitle":"Disappointing","reviewDescription":"I rarely write a review and return items to stores. However, this item arrived in a manufacturer smashed up box. The container in it was damaged, and the zipper got stuck in two places. Very disappointing. I would buy something nicer or spend less money on a similar cheaper item like my sister purchased.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1601424000000}
{"reviewTitle":"Stopped heating after 6 months","reviewDescription":"Stopped heating within 6 months of very casual use. Would be great if it was more durable and lasted..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660262400000}
{"reviewTitle":"Product works great, other than it breaking after 3 months","reviewDescription":"Love this product and it works great but unfortunately it broke after about 3 months of having it. I want to buy a new one but i'm not sure if it's worth spending the money if it is just going to break again in 3 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600646400000}
{"reviewTitle":"Ugh good while it lasted...","reviewDescription":"Worked pretty good for awhile....bought in Feb. 2019 and was amazing. By April it started melting plastic containers which it is not supposed to do and by May it completely quit working.....I think it should last longer then 3 months. Especially since it wasn’t used every day. My husband only works 14 days of the month.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1561420800000}
{"reviewTitle":"Not to great","reviewDescription":"Doesn’t warm food up all the way unless u sit there for an hour with the car running. Gets the bottom of the food basically","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651536000000}
{"reviewTitle":"Mobile electric food warmer","reviewDescription":"Item returned.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681862400000}
{"reviewTitle":"Wrong size","reviewDescription":"I ordered the lunch blue item.came sat.looks small.i read the dimensions on the mini an lunch version. Why is the mini larger than what I ordered and the 1 I received  says mini on it.i ordered the lunch version  which I thought would be bigger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"Great until Damaged within 5 months","reviewDescription":"This would have at least gotten a 4 star overall, but the charger for my car broke after having it for just 5 months and wouldn't allow me to warm my food. I'm hoping to get it replaced under warranty, but this was very disappointing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614211200000}
{"reviewTitle":"Stay away.","reviewDescription":"Makes the food too hot or dry! Does not keep it at a warm temperature as advertised.... oh! And it also takes too long to warm up so you tend to leave it plug for a bit THEN it makes the food burnt on one side or too dry.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1596499200000}
{"reviewTitle":"Stopped working!","reviewDescription":"I really enjoyed this as I drive in my truck all day, and this lets me eat healthier instead of buying fast food all the time.  However,  As of yesterday, it stopped heating!!  I won't purchase another one since they don't even last for 1 year.  Looks like I'll be looking into a different product now.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1537920000000}
{"reviewTitle":"Poor material","reviewDescription":"It does not warm your food even I plug it in for an hour.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1680134400000}
{"reviewTitle":"Didn't last ... See Edit: great customer service.","reviewDescription":"Was good as long as it lasted. Coating on the hot plate started blistering and flaking little by little, even though I was very very careful on how i cleaned it.Contacting customer service to see how they will deal with it. Will update review after I get their feedback.UPDATE: contacted customer service and they were amazing. They sent me a replacement pad telling me it wasn't supposed to have done that. Those guys stand by their product. I will buy again from them.","isVerified":true,"ratingScore":2,"reviewReaction":"7 people found this helpful","country":"United States","date":1550448000000}
{"reviewTitle":"The plug melted","reviewDescription":"The plug melted one day it was plugged in to the 12v plug. It does heat up food good. No temp control","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666656000000}
{"reviewTitle":"Background color of paisley design is bright pink! HATE IT!!!","reviewDescription":"I love love love my hot logic!!! I have been using my all black one for over 2 years. Need to replace it because one of my animals tried to chew into it and broke the zipper. I WAS SO excited they had the paisley one!!!...BUT BUYER BEWARE!!! UNLESS you LOVE pink...you may not like this design. The background of the paisley design LOOKS black in the Amazon picture but it’s BRIGHT BRIGHT pink!!! So  annoyed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1565654400000}
{"reviewTitle":"Beware!","reviewDescription":"Worked great for about a month. I went into my truck to get something  and I smelled something burning like your  know that distinctive wire smell investigated and discovered that the part that plugs into the outlet melted and was burning. Thank God I was close to the vehicle could’ve been really bad!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617148800000}
{"reviewTitle":"Poorly built","reviewDescription":"I have only had this for just over 2 months and the plug messed up. The center piece doesn't stay out so it will not maintain contact with the plug. Tried taking it apart see if it can be repaired, but I was afraid I was going to break the plastic.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"It take a while to actually heT up the food and a part of the zip us faulty.I am not impressed.","reviewDescription":"The long wait time for the food to heat up and the faulty zipper","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672531200000}
{"reviewTitle":"Broke after a month","reviewDescription":"Broke after the first month. Worked well when it did work though. Warmed food up in about an hour. The adapter that plugs into the car port basically came apart inside the port and I can't get it out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Broken Lid","reviewDescription":"Have yet to use it but it arrived with a broken lid.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"12v adapter quit working within a month","reviewDescription":"Adapter quit working within a month. Can’t figure out how to contact the seller","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662940800000}
{"reviewTitle":"Not for everybody, unless you're willing to wait to eat.","reviewDescription":"I was so excited to receive mine. I put it thru the test right away, within 20 minutes of opening the package it came in. Left over spaghetti was on the menu. This was going to be a great thing because I'd just got home from work and was hungry.According to the manual most leftover are ready in 30-40 minutes. Okay I figured, not as quick as a microwave, but it promises a better quality meal, so............I put the refrigerated spaghetti in the provided prep container, closed the top and placed it in the cooker, and zipped it shut. I plugged it in at 5:22 pm. I eagerly awaited the results. I did get hung up on doing something else so I didn't get to open it at the 40 minute mark. It wasn't until 6:11 pm I got to open it. It really hadn't done anything at all. You could feel warmth on the bottom of the container, but most of it was still cold after 50 minutes.So, does it work? I'm not so sure about that. I stopped my test and got something else to eat. It may have eventually worked. But come on...... it may have taken another 30 minutes at least. And that was refrigerated, not frozen! Can't imagine how long frozen would have taken.I'm probably going to take them up on the full refund.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1588809600000}
{"reviewTitle":"Zipper doesn’t work well","reviewDescription":"The zipper constantly gets stuck when opening and closing, also the hot pan does not have an off and on switch. So you must unplug every time it’s not in use or whenever you wish it to stop heating up the tray.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Hit or miss...","reviewDescription":"The product worked fine at first, but after 2 months its broken. So now i have to find something else. Btw, I drive trucks. I use it everyday!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Doesn't last.","reviewDescription":"I had this for less than 2 months. Used it maybe 20 times. And now it does heat up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"No sirve, y muy pequeña","reviewDescription":"No sirve , y muy pequeña esta mas largo sobre tamaño carta","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"These are useful, but they keep dying.","reviewDescription":"Useful for reheating leftovers or heating food when traveling. However, they don't last.Since they are cheap and useful, I'm on my third one now. Would be nice if they lasted though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Zipper is useless !","reviewDescription":"Good concept but the zipper broke and gets stuck on corners. Past return window.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Plug melted","reviewDescription":"Husband loved the product until the plug melted","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Lasted 8 months.","reviewDescription":"(UPDATE)So I've been using this about 8 months steady, and it's worked pretty well. I had to re solder a new plug end on it about 4 months in, because the old one just fell apart because it's so low quality. It just stopped working this week on me and I pulled it apart to see if a connection had broken off inside the plate. One indeed did, the coil wire completely dissolved and left both ends burnt and frayed. For what you pay for, the least they could do is use a little heavier wire and better quality parts. I'm going to try a Chinese brand one now because that's just what this seems to be.This is one of the best purchases I have made in a while. I meal prep for the work week and have gotten sick of eating cold lunches. I work construction and am usually away from a microwave. It takes about an hour to fully warm up a meal kept in the refrigerator. It will not over cook the food like a microwave will, so the food is reheated is the tastiest way.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1553385600000}
{"reviewTitle":"Doesn’t fit in my charger port","reviewDescription":"My friend purchased this and told me it’s a great product. However, mine arrived with a cracked plastic top inside. The plastic wasn’t a big deal, I have plenty of those containers. I’m just disappointed that the charger port doesn’t fit my car. I drive a 2019 ford escape. Pretty standard yet the charger port doesn’t fit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Dirty and deffective","reviewDescription":"This item was obviously used and abused before. IReceived it and upon opening it, I noticed how dirty it was on the inside. There was dried up food all around the inside. I plugged it in and the plate warmer doesn’t even heat up. How was this mistaken by a new item?","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Not too happy about this.","reviewDescription":"It takes an hour for my food to get warm and it’s not even cold food. Problem is, I have to run my car engine running while using this so it waste gas everytime I use it as I have to warm 2 meals as I work long 12 hours shift. It’ doesn’t even make the food hot after one full hour and it’s just warm.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"Zipper got stuck with my food inside!","reviewDescription":"Zipped open and was ready to use , when trying to get food out zipper was complete stuck. I wanted this product to be great as my lunch I had to throw away","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Broke after 6 months","reviewDescription":"Bought this for my husband so he could eat hot food on the road. He’s a service man so being able to eat something hot instead of a cold sandwich makes a world a difference. It was GREAT while it worked HOWEVER it BROKE AFTER 6 months. Purchased in January and just broke at end of July. The connector part doesn’t work. He had to use tape or something to rig it together.Usage: Did NOT use everyday, only sent home with hot food like once a week. Just for usage reference.Was able to find a # for company and waiting for call back. Hoping they’ll replace it. I’ll update this review once that happens.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1627948800000}
{"reviewTitle":"Exactly what I wanted....but.","reviewDescription":"This product is exactly what I wanted, however the zipper on the item I received was defective. I have since requested a replacement. If it was not for the zipper issue, this would have been a 5 star!!!!! review****UPDATE***I received a replacement, however it has the same issue. The product zipper is defective. This would have been such a great product if the manufacturer had went with a better quality zipper.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Luke warm, not heating","reviewDescription":"Unfortunately it doesnt get as hot as most reviews claim. Im not sure if i got a defective one, definitely feels like i did, but it doesn’t produce heat. I bought it for myself to have lunch in my van everyday, and i only used it twice because it never worked. Im starting to meal prep again and i pulled it out of the cabinets to retry and it just doesnt transfer heat to the food very well. Ive gone as far as leaving it cooking in my van for 3hours and the food is luke warm at best. Wouldnt recommend. Im going to loom into a different one","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1617148800000}
{"reviewTitle":"Stopped working after 4 months","reviewDescription":"I absolutely loved this till it stopped working after about 4 months. It’s winter again and I’m back on the market for a new one","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Not hot","reviewDescription":"Doesn’t get hot enough even when turned on for hours.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Quit working within 5 months","reviewDescription":"It worked great for about 5 months and just stopped heating. The light comes on and the heat plate gets luke warm but 4 hours after putting my lunch on it the food is still cold. For the price paid I would assume it would last longer. I used it about 3 days a week driving truck locally.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Does not, I repeat, does not heat food!","reviewDescription":"Ok, I SO wanted this to work because I'm convinced that zapping food in a microwave is killing us all. This product is a great idea in theory but simply just not good. It NEVER  heats up food thoroughly enough. I have no idea what some speak of when they say it has gotten their food hot. I purchased for use at work and used small portions of vegetables\/chicken to heat. After more than 2 hours, food was not hot. The plate was hot, but not food. Even a small cup of soup never got warm enough to eat, even after stirring it a few times while it was \"warming.\" I will try to say something good: nice inconspicuous bag, zips up nicely with food inside, doesn't give off weird smell so no one will know you are using it at work, sellers are AMAZING and very gracious to work with. They gave me a full refund as a courtesy because I had longer than thirty days.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1406764800000}
{"reviewTitle":"Too small!","reviewDescription":"I received a “Mini” but I did not order a mini! I would not have paid $40 for something so small! This was a Christmas gift & it’s not what she wanted! This is for a small lunch, not a casserole sized dish! My hand is for size reference.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"Did not last..","reviewDescription":"This product was good while it lasted. the heater inside burned out on me after a year to where it no longer works so not much durability luck on my end.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"It takes too long to heat up food.","reviewDescription":"I love how compact it is and easy to pack but it takes too long for food to warm up. One hour is barely enough with most foods and I’m vegetarian. I can’t imagine how much longer it would take to heat up meat.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1576281600000}
{"reviewTitle":"Love this but...","reviewDescription":"Use this at work all the time with leftovers and lean cuisines at my desk or on the road in the car. It really works and keeps food at a steady 165 degrees after just two hours. It’s way overpriced. If you find one on a deal or with the Pyrex included, maybe it’s almost reasonable. Otherwise I can’t believe it costs $40.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1517011200000}
{"reviewTitle":"Need 110 outlet\/ plug in.","reviewDescription":"Didn’t realize it didn’t have a regular plug for indoor outlets.  Would be great for over the road travel in a car, but not for a flight attendant on a layover at a hotel","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1587340800000}
{"reviewTitle":"Stopped working after 6 weeks","reviewDescription":"I loved this thing at first! I had hot lunches everyday and it worked great. After about 6 weeks of use it just stopped working. It won't heat up at all. I am very disappointed I loved this thing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1572912000000}
{"reviewTitle":"What a bummer!!","reviewDescription":"It was great until it stopped heating after about 3 weeks of use. Couldn't figure out how to get it working or have any company contact info. Bummer because it was really nice while it lasted","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1576454400000}
{"reviewTitle":"Didn't last a year","reviewDescription":"Didn't last a year with moderate use. Have used cheaper ones and have gotten a few years thought I was upgrading.  So disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"Portable","reviewDescription":"East to use however when it’s getting warm the unit it’s self stinks like melting plastic and it makes the food taste like it smells as well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619568000000}
{"reviewTitle":"It’s OK, only makes food “warm not hot” after about 3 - 4 hours","reviewDescription":"Easy to bring with you on the road but takes about 3 to 4 hours to actually make leftover food that was cold, hot. After three hours it’s pretty much lukewarm, every time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579219200000}
{"reviewTitle":"3 Years Going Strong","reviewDescription":"Best purchase Ive ever made while living on the go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"👍❤️","reviewDescription":"This is the best food warmup ever.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Great product!","reviewDescription":"I've had this warmer for maybe about a few weeks. This things heats up everything amazing.  For me it takes about an hour to heat my soup or meal prep in a maybe a 16 oz glass container?? I have not had ONE issue and I use it 5 days a week. The only small thing is that you have to plug it in or unplug it to turn it on and off. There is no type of indicator informing you how hot your food is...at the end of the day it's just meant to sit at my desk at work and use it so I don't need to wait in line to warm up my food in the only available microwave. 5 stars!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"100\/10 👏🏼","reviewDescription":"Got this for my boyfriend. He’s a cop and spends all day on shift in his vehicle and wanted to have a way to warm his food on the go. He personally rated this item 100\/10 so kudos to HotLogic. He approves, therefore I approve ❤️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"As expected","reviewDescription":"I’m very familiar with this product, which is why I ordered a second one. It’s a great travel essential","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Hot Food!","reviewDescription":"I use this to reheat my food while I drive for work. I’ve used it to reheat brats wrapped in tinfoil just placed inside on the hot plate to full food containers of taco meat, spaghetti and so much more. I give it about an hour and stir occasionally to make sure my food is Hot and it is!!! Highly recommend!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"My grown up lunch box!","reviewDescription":"I have owned a Hot Logic Mini for six or seven years.  Initially, I purchased it for camping and potluck dishes where I might need to provide my own heat to keep the dish warm.In the last couple of years, I have come to rely on this as my lunch box when I work.  I absolutely love that I can meal prep lunches ahead of time and have anything from fish to soup in this little gem.  I can plug it in somewhere in a quiet corner out of the way when I arrive at work and then 2-3 hours later when it's my lunch break, I have a hot lunch waiting for me without needing to find a microwave oven or stove.  Absolutely no cooking food aromas can be smelled until I uncover my casserole dish when it's time to eat.Often my coworkers stop by to check and see what's on the lunch menu for the day.  I am frequently told I have the most appetizing lunches around.  One of my favorites is cheese ravioli with sauce.  I start with frozen, uncooked ravioli then add a little sauce to the bottom of my dish (so that the pasta doesn't stick to the bottom of the dish), arrange my ravioli  on top of that, and top with more sauce and a handful of mozzarella cheese.  Delicious!I prefer using glass\/pyrex-type baking dishes in the Hot Logic.  The Pyrex brand six-cup is a perfect fit as is the six-cup Snapware brand.  However I do prefer the Razab 6.5 cup with locking lids the best.  They are less expensive, completely leak-proof and also a perfect fit for the Hot Logic Mini.  (https:\/\/smile.amazon.com\/dp\/B081PBY1CR?psc=1&ref=ppx_yo2ov_dt_b_product_details)One can heat ready-to-eat frozen meals still sealed inside the cardboard container without risk of anything burning.  A person can use any flat-base dish for eating and cooking, including paper plates or bowls, aluminum foil, aluminum pans, plastic, glass, heavy-duty freezer bags, and even restaurant carry-out containers.  A person can also cook food from raw, as it functions much like a slow cooker.  It has more difficulty with root vegetables (potatoes, carrots, turnips), and it will not sear or crisp edges on meat.  It doesn't do well rice or pasta either, so when I do these, I pre-cook to al dente.  It is perfect for frozen portions though!It is a great meal preparation device for one or two people!","isVerified":true,"ratingScore":5,"reviewReaction":"128 people found this helpful","country":"United States","date":1660694400000}
{"reviewTitle":"Great news for Slow Eaters!","reviewDescription":"I got this for my elderly mother, who has always been a slow eater.  This keeps her food warm without ruining it, and she and her aide are very happy with it. Simple to operate, and simple to clean.  I also purchased the covered glass dish but you can use any container, which is a plus. Recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Hot logic","reviewDescription":"This is my second purchase and I use it at work instead of using the microwave. It works great for frozen meals and left overs, also if you plan for it,  you can actually cook in it for lunch. (I've cooked pasta)My first one lasted almost 9 years, so I would say that I definitely got my monies worth.There is no temp control so you'll want to make sure to check on your food to turn,  stir or to determine that it's done to your liking.Yes, I recommend this product and will buy again should I need to.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Handy device","reviewDescription":"I use this all the time at work. Does what it's supposed to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Limit expectations, but very portable.","reviewDescription":"Speaking from experience, a typical hot plate is just too large and heavy to easily travel with. This is very compact and lightweight. You can make a cup of tea with it, but using average-cold tap water it's going to take between 30 to 45 minutes when heating one cup (I zipped the cover over the cup while heating). In continental Europe, don't expect coffee makers or tea kettles in your room. This mini hot plate eventually gets the job done. . A standard hot plate you really need to buy from the region you intend to use it in. For this min plate, the power usage is so low that I personally wouldn't worry about using it anywhere in America\/Europe. I'm not sure yet whether I'd leave any heat source unattended in my car, but that's my tendency toward caution. If you're up for that, adapters are available. I wish I had something that heated things faster, but you can't beat the size\/weight.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1560038400000}
{"reviewTitle":"Lonchera","reviewDescription":"El tamaño es mas pequeño de lo que pense","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Not For Our Needs","reviewDescription":"This is going back. It's a great idea for lunch warming and such but while it claims to cook too and that there are only a few items it won't cook unless they're submerged in water (carrots, potates) it also was a great disappointment when I set my egg fritatta to be ready for breakfast 9 hours ahead of getting up. So much water still on top of these eggs, maybe because of the condensation from the sealed container (required). Just had to finish frying it up in the cast iron. The spices had not taken to add flavor either. I also made a balsamic\/onion pork chop (from raw) and apples\/carrots with ginger and cinnamon in there. The apples were mushy, the carrots underdone and the pork chewy. So, heat up your soup or stew in there, but nothing fancy going on here. Maybe great when I'm ninety and have a tiny kitchen and am not that hungry anyway. Don't underestimate your happiness for it though if you have a job for which this fits.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1474070400000}
{"reviewTitle":"I wouldn’t but it again","reviewDescription":"I use it to warm up my lunch in my service truck, but it won’t  last a year the way I use it, I’m a mechanic.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1679356800000}
{"reviewTitle":"My husband loves it!","reviewDescription":"Purchased this as a gift for my hard working husband who works in the elements 6 days a week.  I pack his lunch daily and it normally consists of wraps, salads or the occasional chili\/soup in his thermos.  I cook dinner every night and wished he worked closer to town to heat his food, but he’s normally in the country and miles away from a gas station or anywhere he can heat his food.  I saw this and was eager to order it.  The only downfall I see is that it didn’t come with a car adapter.  If these are advertised as portable; then be 100% portable.  It lost 2 stars because I assumed it was perfect only to find it lacked a major piece","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1612569600000}
{"reviewTitle":"Really Works well but.....","reviewDescription":"I am in love with this.  I plugged my food up around 8 am and had my lunch at 1 and it was scorching hot.  I am sure I didnt have to heat it up that long but it was my first time using it .  My food still stayed juicy and not dried out.  I used a pyrex glass dish with a plastic lid.  Hopefully it will last years.Ok update somehow I either overlooked that it had a hole at the seam or using the zipper loosened the seam but either way I only used it 2x and had it less than a month so it should not be like this.  So I am sending it back today for a replacement because it really really works well.Updated pics had to knock stars off from this review.  Sorry but I refuse to pay so much for it to RIP on me","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1523404800000}
{"reviewTitle":"Cute Box. Works good in a pinch.","reviewDescription":"I've only used it once and it seemed to work ok. Doesn't make your food hot just keeps it warm. I did expect the box to be a little bigger than it actually is.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678838400000}
{"reviewTitle":"12 Volt not versatile enough","reviewDescription":"I like the idea of the hot logic, but often found that the 12volt plug wasnt convenient unless I remembered to use it while driving.  When I'm in my RV it would be nice to plug into a regular outlet with my inverter on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659744000000}
{"reviewTitle":"My 1st one was really good.","reviewDescription":"I have bought for these now. My latest one was very disappointing the 1st time I used it the container melted. I was gonna be buying 4 more of them for Christmas gifts but I'm gonna check other brands now.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"Good product, but takes forever to heat up","reviewDescription":"It’s nice and compact, and was made well. But it really just takes forever to heat up any food, whether it’s a small or big portion. I’m a flight attendant and bought this to use for the homemade meals I take with me on trips, but I find myself only using it as a last resort when I don’t have access to a microwave, just because it takes so incredibly long to heat up my food. It’s a good product to have as a last resort, but as a first choice, not my cup of tea.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1632873600000}
{"reviewTitle":"Heats up Fast!","reviewDescription":"Works just as described. Heats up fast & stays hot for a long time!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Good","reviewDescription":"Great for the price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Best darn method to warm food...hands down!","reviewDescription":"I love the way my food tastes after being slowly heated in this lunch box. It actually makes leftovers taste even better without the hazardous radiation microwaves give.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"I Love this Pouch!","reviewDescription":"I fell in love with this warming pouch. I love it so much, I have purchased 4 of these, at various times, for gifts. Everyone I’ve given one of these, loves them, too.  It does exactly what is stated in the information provided. You plug it in, place food in it, zip the lid closed, and wait for your food to be heated. It does so quickly, and doesn’t dry it out. When I DON’T want food heated quickly, I just leave the cover unzipped and flipped back.  And, if you have an item that’s too large to fit inside the pouch, you can take the heating tray out of the pouch and simply place the item on the tray. (I actually pack it in my luggage and travel, with it. It really comes in handy, to re-heat leftovers from lunch\/dinner, when you’re staying in a hotel.)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Works so well!","reviewDescription":"Works amazing my husband uses this for work to keep him food warm until it’s time for lunch and it doesn’t over cook nor does it burn your food keeps its at a steady 165 degrees and stays warm for up to 12 hours! Best Buy ever!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"The perfect travel oven!!!","reviewDescription":"I’m a flight attendant and have seen these around the system. After 2 decades I purchased this one. It’s compact, light, easy to use. Can heat 2 medium size plastic containers in 20min!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Amazing","reviewDescription":"This thing is a life saver in my line of work warm meals is always a plus!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Life just got a little nicer...","reviewDescription":"As mentioned in other reviews, this food warmer is really just a hotplate in an insulated bag.At first glance the Hot Logic Mini doesn't seem to be very special. However, upon closer inspection (and use) it is apparent that Hot Logic has put a lot of thought into this product and the intended use and has produced a very well-made and useful product.Plus, after much research I can't find any other product out there that comes close to matching the features and versatility of this portable food warmer. Before I get into my (long winded) review here are some specs on this unit.Specs:o 1 shelf with Smart Shelf Technology (cycles off and on maintaining optimal food temp.)o Nylon case available in four colors: Black, Blue, Green, Orangeo Exterior dimension 10\"W X 8\"L X 3.5\"Ho Can accommodate food containers up to 8.75\"W x 6.75\"L x 2.5\"Ho Plugs into a 110v standard wall outleto Heats food to a max of 212 degreeso Consumes 42 Wattso Weighs 1 lb. 4 oz.o Electric Cord is 48\" longo UL CSA Certifiedo 1 Year WarrantyI travel a lot for work, mostly by car, and after years of fast food (mostly unhealthy, expensive, time consuming, and often served from unsanitary establishments) I started looking for something to take with me on the road other than a cooler with a cold sandwich.After looking at all of the available items out there I fortunately settled on the Hot Logic Mini.After receiving the Hot Logic Mini the first thing I noticed was that it is a quality made product. The attractive double zippered nylon case opens and closes easily and the 48\" electric cord is long enough for my needs. (Note: The cord can be folded and stored in the pocket in the back of the case.)Eager to try it out I simply dumped some chili in one of my many Pyrex glass containers (I prefer glass containers.), snapped on the container lid, zippered the Hot Logic Min shut, and plugged it in. 45 minutes later, I had piping hot chili. Of course your result will vary depending on starting food temperature, portion size, container size, etc.Note: You can use most any appropriately sized flat bottomed container (with tight cover) as the maximum heating\/cooking temperature will not reach over 212 degrees. (The warming plate will cycle off and on maintain a maximum temperature of 212 degrees.)  At this temperature food will be kept well above the recommended 135 to 165 degrees for food safety, but not hot enough to burn your food or container.After use, you simply have to wash the container you used. (Much easier than some of the warming products where the container is built in or requires that you buy disposable liners.)I did read a few non-positives about this product such as it not having an on\/off switch. However, I am ok with that as a switch would add bulk and is just one more thing that could break. However, if you are using this at an office and have to crawl underneath your desk to reach an outlet, you might think about getting an extension cord with a switch or at least one placed so you can easily plug and unplug this warmer.Also, this unit only runs on 110v AC (household current), however this is not a big dealer to me either as it is only pulling 42 Watts and even the cheapest DC to AC inverter should be able to handle that. Plus, many new cars come with an AC outlet built in.Bottom line I am very happy with this purchase. I can heat up (or cook)food as I drive down the road and pull over under a shady tree and have a nice hot lunch (and a nap afterwards). When I get to a hotel I can keep it in the room to heat up leftovers or food I buy from the market. I'll also use it at home to heat up (and possibly cook)food as it uses a lot less electricity than my oven or microwave. Plus, I don't have to plan my meal times perfectly as the Hot Logic Mini will keep my hot food at the right temperature for hours.I hope this review helps!","isVerified":true,"ratingScore":5,"reviewReaction":"32 people found this helpful","country":"United States","date":1404432000000}
{"reviewTitle":"Calentador portátil","reviewDescription":"Muy buen equipo facilita el calentar la comida","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Worth Every Bit","reviewDescription":"This has made ALL THE DIFFERENCE! Be advised, not all recipes or left-overs will work so effortlessly well. I cannot report that I have found any of those. I suspect there are only a few things. But I have merely started to empower myself with such a risk-free hot meal at all times, that I can capture the moment to do so at work. Firstly, I have tried successfully to provide myself with ready hot meals with the Crock-Pot lunch warmer. It works well. However, being restricted to the proprietary container, leaves too much narrowness to the equation for any absolute satisfaction, because of singularly limited dining containers. Now, for the HotLogic warmer, I can have my own meal warmed and held in a container compatible to my choice (Glass-Lock) to deliver to me an instantly gratifying hot lunch in my work environment to satisfy any stickler for individualistic superiority. All the other lunch-minions scurry for some mucked-up public microwave to scald and scorch and boil their miserable leftovers or plastic, industrial, MSG ridden, convenience poison, waiting in line for the scarce minutes to sit down to their reluctant pseudo-nutrition. I merely remove my container from the HotLogic pack and open it on my elegant place mat and sink my personal tableware into some succulent entré, lifting it to my waiting pallet to indulge in the anticipated culinary delight (choose your own verbiage). With just the right added ingredients, I can make a plain-Jane substance turn into the reason to go to work. Maybe my imagination has gotten the best of me, but my imagination has been inspired by this HotLogic Personal Oven (lunch warmer) to ready myself for tomorrow. Like some obsessive competition, I look forward to making someone break the ice and ask me about this rig. I merely go about my business as if the mechanics of fixing a superior lunch for myself is far better than marching off to some Greasy-Spoon, Blue-Plate-Special. Well, it is!Okay. Now to review this product. I have become so personally enthusiastic about the success of my initial use of the HotLogic Personal Portable Oven that I can make this comment. The potential is clear to me and the failure is impossible. In just one week, five work days, I have become the greatest advocate in my living room. Not bad for an introvert! So, I tried to sabotage my experience. Can you imagine anything worse than to put cooked Japanese Black Rice in the refrigerated container. Three days later I open a can of salmon, pick the bones and soft skins, throw in some fresh asparagus cuts with a little butter, teriyaki glaze, dehydrated garlic and onion and closed it up, thinking I might have made a mistake. My hypothesis was pointed towards disaster, however, even though I still expected the worst, that the salmon would stink the break-room, that was my only mistake. Surprisingly, I sat down to a tasty dish, even for canned fish, and delighted in not having made a mistake at all. I have turned cheap cake with a dollop of cream cheese, frozen berries and white chocolate chips, into a tasty warm desert to round off my private dinner. There is no way I would wait to pay top-dollar for such excellent results. The thing is that I merely placed the ingredients in the container, sealed it up and packed it for the next day or two in the fridge. Then I plucked it to carry to work and placed it in the HotLogic first thing, forgetting it. Lunch could be at any time several or few hour later. When that time came, I merely unzipped the enclosure, as the containers were held at table-hot temperatures perfectly and suspended in time, and placed my succulent nourishment before my salivating anticipation. I even tried a portion of buttered bread folded in foil and received a tender accompaniment to my feast. This is better than a cold bento box. Why should I call in reservations at the Angus Barn? I just entertain the imagination a little, mainly because that imagination is inspired by the readiness of a perfect hot meal all because of this HotLogic. Don't take my word for it. Just DO IT! I am now a member of the clean lunch plate club.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1396310400000}
{"reviewTitle":"Best little lunch warmer ever!!!","reviewDescription":"I have been using Hot Logics for many years. I'm a truck driver and it's perfect for plugging in and leaving until you get a chance to eat. It takes an hour to heat up to 165 degrees then stays there. It will not scorch or burn food. I always use sealed glass bowls and it heats perfect, every single time. Get you one!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Keeps your food hot!","reviewDescription":"My husband bought this for me for work and I will say after plugging it in for an hour my food was very hot! Definitely would recommend if you need something to warm up your food on the go as long as you have a plug near","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"UPDATE : Still loving this","reviewDescription":"Purchased 12\/3\/22, I use it several times a week in the semi truck and it never fails. So far best $$ I’ve spent. I reheat, cook noodle bowls in it and it usually takes about an hour or less. The only improvement I would do is add about 2’ more to the cord.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Railroader","reviewDescription":"Nice product. It’s nice to be able to have a hot meal while on the train for 12 or more hours.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"This Mini Portable Electric Lunch Box Food Heater really heats up your food!","reviewDescription":"Working a 12hr Overnight shift Security mobile Patrol Heating pre-prep food or cooking makes Lunch so convenient and its  a must have while working in a Vehicle!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Hot Logic Mini","reviewDescription":"The hot logic is perfect to take frozen entrees right out of the carton and place onto the hot logic. In 2 1\/2hrs it is ready. It is so convenient  to take to work to have a fresh hot meal, because  you can  leave it in there to keep warm until your ready to eat it! It is like a slow cooker but no mess or clean up!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Reading is key","reviewDescription":"I am super heated!!!! Maybe I should try to heat my food on my head because I sure can’t use this hotlogic unit. I must have totally over looked the fact that this could only be used in a vehicle. I bought this for my wife to use in her office and She Shed, but no way to plug into an outlet. I wasted my money. Don’t make the same mistake. I gave it 5 stars, because I had too, but never used it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"The Closest To A Wife","reviewDescription":"The first issue that I want to cover is something that made me drop my jaw when I read it more than once in the reviews: This Portable Oven IS NOT Intended To Cook Food!Geeez... guys... no! You first prepare a meal and cook it. Then, a portion of that \"already cooked food\" may go in an appropriate container. Later, you place that container inside the 'Hot Logic Mini Portable Oven,' set the timer to be on for 2 [two] hours, plug it in a live outlet, and walk away. When you come back, the oven has done a good job to bring food to the right temperature.This is my schedule:1.- In the evening, I prepare and cook a meal. After it cools off, I place it in a container and in the refrigerator. As a personal preference, I added two [2] tablespoonfuls of healthy Olive Oil and I sprinkle the entire meal with Herbs de Provence from France. Both ingredients are available at Amazon.2.- After I have breakfast the following morning, I place the container inside the 'Hot Logic Mini Portable Oven,' set a timer to turn on two [2] hours before I get back home, and I walk out the door. When I come back home from work, I go straight to another healthy meal which is at the right temperature.Assuming normal ambient temperature, I estimate that 12 to 14 ounces of food reach a sensible temperature to eat in two [2] hours. Longer than two [2] hours may expose nutrients to heat for too long.This 'Hot Logic Mini Portable Oven' has been a hero to me. I stopped relying on unhealthy ~and costly~ breakfasts at fast-food restaurants, I get much more satisfied with food Mother Nature provides which keeps me healthy.I already concluded that this 'Hot Logic Mini Portable Oven' is the closest a single guy can get to a wife. Well... but not in all departments, of course.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Love it!!!","reviewDescription":"I was introduced to this product by a friend and I absolutely love it. Simply place your lunch bowl in the warmer, plug it in, and voila! You'll enjoy a deliciously heated meal that is not overcooked or burnt.  This warmer is easy to clean and conveniently fits on my desk without any hassle.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Comida caliente en minutos","reviewDescription":"Que mi comida esta caliente en un par de horas trabajo conduciendo es muy práctico","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Love the warmer","reviewDescription":"Warmes up left overs while traveling in your vehicle all day. Don't have to just pack boring sandwiches or buying lunches with inflation prices. Best Christmas gift ever my husband says.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688256000000}
{"reviewTitle":"A Travel Piece","reviewDescription":"Dislike.... The time it takes to warm up food, too long.Like... On long drives, or out of town travels, it's a must have, take along.Good for Truck Drivers!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Great Product","reviewDescription":"My employer's kitchen has been closed since Covid.  I cook on a regular basis and was definitely tired of bringing salads and sandwiches to work for lunch.  Therefore, my search began for a heated lunch box.  This product was one of many that I saw during my search.  I was a little skeptical about all of the products.  I decided on this one and was glad that I purchased it.  Needless to say, I am now eating hot lunches again.  This product definitely heats up well in a short period of time.  Food heats in a very short period of time (about 30 minutes or less).  Great product.The product has a 1 year warranty.  However, if you register the product, you can receive a 2 year extended warranty for free.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617580800000}
{"reviewTitle":"Great for driving jobs!","reviewDescription":"My husband is a delivery driver for a local beverage company, being in his truck all day he doesn't have access to a place to warm up his food so he was taking sandwiches and cold lunches everyday. Living in the midwest, being a driver in winter and having a cold lunch is just a bad combo. I purchased this for him and he loves it! It heats the food perfectly, it's the perfect size for our leftover containers. The only reason I docked it one star is because it doesn't come with an adapter for using in a vehicle. Luckily we already had one. Otherwise great product!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644969600000}
{"reviewTitle":"Worth the money","reviewDescription":"Patience is required. This will not heat things up as fast as people say unless they are small portions. A container of leftovers out of the fridge takes a little under an hour. A container of leftovers out of the freezer takes close to two hours. A frozen pasta dish in heavy sauce will take close to three hours. And you have to watch this. It will overcook and ruin your food.That all being said, if you can plan your reheating time accordingly, reheated dishes out of this taste worlds better than microwaved leftovers. As do meal delivery dishes. Most meal prep containers fit perfectly in this. I ended up buying a second one so I have one at home and one at work. I have had them both close to two years and they both still work just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1615248000000}
{"reviewTitle":"All around great","reviewDescription":"The ONLY negative is that the zipper is a little tough to get it to make its way around the corners.This thing is great. I'm a mobile field tech repairing heavy equipment. I LOVE this thing. It's way better than a microwave. The food is not rubbery or tough after reheated in Hotlogic. I turned around and bought the 11v AC version.  I love it also.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1678147200000}
{"reviewTitle":"Faulty Product?","reviewDescription":"As a flight attendant, i'm constantly on the go and in different cities every day. With the ongoing Covid-19 Pandemic relying on hotel and local restaurants became very unpredictable. So I began to pack my own food to bring with me on trips. I had heard great things about Hot Logic and was very excited to get one. The Hot Logic itself works great. They even included a meal container to go with it. However, after only 4 months the plastic top to the container cracked from the heat and the zipper broke in half when I went to zip it closed. Make me wonder if the metal in the zipper was fatigued. Hopefully if you purchase this product you'll have better luck with the zipper. It's the only reason I cannot give it a 5 star rating. Needless to say i'm disappointed, but i'll make do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607472000000}
{"reviewTitle":"Zipper Sucks","reviewDescription":"Great idea. Perfect for working on the road.But I happily would’ve paid a couple extra bucks for a good zipper that doesn’t get stuck on the corners","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"This product has worked well! 5 months so far","reviewDescription":"I bought the hot logic mini 5 months ago, for my husband, he really likes this product.ProsIt really keep stuff nice and hot!Easy to clean, easy to use.ConsTakes about 30 mins to heat up foodUse glass container because it has no heat control.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Hot lunches at work","reviewDescription":"Heats up food perfectly a little smaller than I thought","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"More of a food warmer to me","reviewDescription":"I use this on my desk at work to avoid the communal kitchen.  I have never tried this with frozen food.  I have never tried this with raw food.  But in my experience, I would keep this as a food warmer.  If you have more than what's in this, you will need TWO lunch bags?  Or one really big one that hold this plus your other food.  I'm going to experiment with just leaving this at work and carrying my lunch back and forth.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"Just over a year and it stop working","reviewDescription":"This was perfect for left-overs for lunch the next day as a driver. I got a little over a years use out of it.Plugged it in as usually,30 minutes later a cold lunch.dont know what broke on it,my guess is the heating element. would like to buy another but i will prolly try a different brand.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648166400000}
{"reviewTitle":"Its impressive","reviewDescription":"This thing works exactly as advertised.  I had my doubts and I was wrong,The zipper is a bit difficult to operate and fragile which is why I maked it down a star.  I will ether break in and run smoother or it will fail.This is a perfect job site lunch tool!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652659200000}
{"reviewTitle":"Small but mighty","reviewDescription":"Smaller than I thought it would be. It does get warm enough to warm up your food though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Best tool for truck drivers","reviewDescription":"This is awesome for a truck driver, if your a truck driver, I suggest you get this, it’s perfect, I put any meal preps my wife makes me in it and keeps it warm all day, works great with Campbell’s soup in a Tupperware and ravioli. You can also put those cups of stew they sell at truck stop in it and it will heat it up and keep it warm, I like using this better than my microwave. Doesn’t take up much space too.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Works great","reviewDescription":"I travel all the time and decided to get this so I could have a hot meal in the hotel room without having to order expensive room service. I've only used it once and it worked great! My only complaint is the zipper seems flimsy like it's going to rip or something. The zipper is poor quality and it's hard to zip in a couple of places (this is while it's empty and I only put a small dish in there so it was never overstuffed) and I'm afraid it will tear or break soon. I will have to be extra gentle and hope it doesn't tear because I love having a hot meal on my overnights now! My food was heated evenly, was piping hot and not burned. That's a win for me!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1500508800000}
{"reviewTitle":"Portable but very slow heating","reviewDescription":"I like that it is portable, and it comes with a food container. what I dislike is that it takes about 1 hour to heat up food that fills the container.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Perfect for office","reviewDescription":"I love this lunch box with heating  element.  when I get to work I plug it in and I have nice hot lunch when I'm ready and I don't have to use the gross communal microwave.  I only wish the paisley pattern was in a taller version.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652313600000}
{"reviewTitle":"Very nice","reviewDescription":"I love this bag and the only reason I gave it 4 instead of 5 is because it would be nice if this had a light on it to signal that it was actually on because I'm construction the outlets may not be live and then you get cold food","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"Pricey for only lasting 2 months","reviewDescription":"Second warming tote I buy from Hot Logic.The tip where you connect to the car always gets damaged. It sinks in and can't be fixed. Also the fuse went out on one of them. I handle it very carefully when inserting and ejecting. Yet it still gets ruined. Wasted over $80 within a few months. Save your money and go for an outlet warming tote. Use a power inverter to connect to car.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1617667200000}
{"reviewTitle":"Product no longer works.","reviewDescription":"I purchased this product almost two months ago and it no longer works. The heating function has stopped working. Would not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"buyer beware","reviewDescription":"does not work in regular car 12v outlet must have 150v converter the description is not true","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Stop working after 3 months","reviewDescription":"Only lasted 3 months got another one from the warranty and lasted another 5 months. Not worth it at this point","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Not worth it! Quit for no reason, still looks brand new","reviewDescription":"My husband is a truck driver who packs lunch daily to heat up for lunch. We ordered this and received it on August 14, 2020. He used it almost daily, and on October 16, 2020 it did not heat his lunch. When I looked, it was too late to return. I’ve since purchased another Road Pro heater, which he will begin using tomorrow. We previously had one, and it lasted over a year.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1604275200000}
{"reviewTitle":"IT'S A WALL PLUG!!! NOT FOR CARS!!!","reviewDescription":"MMAKE SURE YOU K IW THAT THIS IS NOT FOR YOUR CAR! Its a WALL PLUG...i wish i would have went to use this vefore the return window was done.  Unfortunately i sat it to the side for a month  , then prepared a nice \"warm\" lunch for my husband to warm' IN HIS CAR'  then looked at it to gind uts a darn wall plug and it was to late to exchange\/return..will have to buy a $20 converter","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1588377600000}
{"reviewTitle":"The zipper is terrible!","reviewDescription":"I bought one and the zipper is terrible! I have to rip it to get it open! I'll never buy one again.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"DO NOT BUY THIS PRODUCT UNLESS YOU WANT TO RISK ...","reviewDescription":"DO NOT BUY THIS PRODUCT UNLESS YOU WANT TO RISK FOOD POISONING!!  Sadly, I missed my 30 day window to send this back or I would have. I don't know whether it is broken or just being misrepresented on the website. I just got around to trying it out and it does NOT get anywhere near the proper temperature to hold food. After leaving my pre-cooked hot dog in it inside a glass flat-bottom dish for 3 hours (double the maximum length of time it said it would take to heat), the internal temperature only made it to 111 degrees....prime target for food poisoning. Wish I could send this expensive product back.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1460764800000}
{"reviewTitle":"Not happy","reviewDescription":"I purchased this and when I tried to use it… never got my food warm it was not working…. Of course I didn’t save packaging and was unable to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1682726400000}
{"reviewTitle":"Did not last long","reviewDescription":"Used a few times a week. Doesn’t work anymore. Lifespan of ~6 months? Not good.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Very disappointed","reviewDescription":"I like how convenient it is but it cuts off periodically while in use as if it has a shortage. Exchanged the first one for a new one and it also cuts off during use. Not satisfied.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1662508800000}
{"reviewTitle":"Received a clearly used, foul smelling product","reviewDescription":"I just received my product and noticed the box was not sealed.  I opened it up to find a clearly used product which included a HotLogic heating dish.  I made the mistake of lifting off the lid and was punched in the face by the smell of old food.You cannot sell a used product as new, there is a whole section of Amazon for that.  And if you are going to, at least replace the plastic heating dish and reseal the box!!  Working on a refund as we speak.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1612828800000}
{"reviewTitle":"It was great until..","reviewDescription":"I really loved this product it kept things hot such a great idea.  I've had it for 2 months but all of a sudden it has stopped working. I'm bummed  out","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Hotlogic","reviewDescription":"Purchased new back in November of 2022, only used for work. Went to use it today, March 6 2023 and stopped working, has power to plug (light is on) no heat. Very disappointed, I guess made in the USA isn't a good choice after all.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1678060800000}
{"reviewTitle":"Refund needed","reviewDescription":"Didn’t work and wrong plug I want a refund","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"So disappointed in this recent purchase & brand.","reviewDescription":"I absolutely love my first purchase hence a return customer.  I use everyday!  Product quality has fallen substantially.  Warning ... not made like once were!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Bad burning plastic smell","reviewDescription":"As soon as it arrived, I tried it out. It makes a bad burning plastic smell from the hot plate. I took a watt reading and it's at 43 watts which is within range. It works, but literally stinks, bad. Anyone else have this problem?","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1669680000000}
{"reviewTitle":"Died rather quick","reviewDescription":"If was wonderful, until it decided not to work.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Didn’t last after 3 uses.","reviewDescription":"I was excited to find something I could use for work, since there was no microwave. It takes like an hour to warm up the food which I was okay to adjust to that, but after the 3rd use, it stopped working…. The plate no longer got hot. Pretty disappointing..","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"Broken and looks used.","reviewDescription":"I received the package on time which was great. But then upon looking at the bag it had stains on it. I would have been okay with it but the inside container was all broken and the hot plate looks like it’s been throughly used and dirty.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1671840000000}
{"reviewTitle":"Overrated","reviewDescription":"I’ve purchased my 3rd hot logic! The 1st lasted me a year and was great! My second purchase lasted 6 months and my last purchase lasted one week! I’m going to assume that it’s not made to last being that it 40.00 bucks!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Don't worth it take too long to heat up my food","reviewDescription":"This is not worth buying to heat up my lunch at work have to wait up to 2\/hours to heat up my food","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Waste of money","reviewDescription":"I’ve had it about a month and a half and it was great.  Then just stopped working for no reason.  I’d recommend spending the extra money and buy something well built.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"It worked for less than a month","reviewDescription":"I’ve had this product before and it lasted me around 3 years which was amazing. So after that first one gave out on me I ordered it again and this second unit only lasted me around 3 weeks. And there’s no way to exchange it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Junk zipper breaks","reviewDescription":"I've been using a microwave for leftovers for so long that I've forgotten how much it affects the flavors of the food, so the first time using this to warm leftovers was almost like a revelation. Super convenient as well.UPDATE: Although I like the results, the zipper has started catching every single time, now I takes me 4-5 attempts to close it. It's become very annoying. Dropped from 5 stars down to 2 stars since I'm about to throw it in the trash.UPDATE 2: The junk zipper broke after it caught again, rendering this thing useless. It's gone in the trash. Buying a competitor instead to replace it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Good product.  Terrible customer service","reviewDescription":"The heating unit works great. I sent 2 messages over a 7 day period because the zipper on the case was broken. Apparently they chose to ignore my messages so I returned it and bought one from someone else.  I recommend finding another seller. This one doesn't respond to messages. Great product though.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Disappointing","reviewDescription":"This bag for starters doesn't accommodate the food container. The bag has a opening in the bag where the plug goes through which allows the heat to escape, so it take way longer to heat up food. Overall disappointing compared to the last bag I owned.😐😑😏😮‍💨. Bag also purchased in February of 2024 and stopped working by May!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Crap","reviewDescription":"I'm am so disappointed I ordered this.hotlogic used to have great products.the inside used to be glass now the inside is something you would get from Applebee's from take out didn't get a cord to plug in the wall either.what a piece of junk .seriously","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Poor packaging causes damage","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"POOR QUALITY","reviewDescription":"The previous reviews were correct; the zipper was faulty. When I finally got the cover to unzip, the plate inside appeared scratched. I’m not sure if this was used and returned, but I was not interested in keeping this item. It was quickly returned for a refund. The concept of this device is clever, but it certainly lacks in development and execution.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Product does not meet my needs.","reviewDescription":"It doesn’t work as advertised.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"Perfect for those who travel a lot and bring their own food.","reviewDescription":"Works as advertised. Great for traveling and reheating prepped meals on the road.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"excellent","reviewDescription":"loveit,very useful in my work","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"5 Yrs Success","reviewDescription":"I've been using this for 5 years.  I keep it at work and use it for 90% of my lunches.  It's obviously perfect for reheating leftovers or frozen meals.  It can also be used for cooking food from raw.  I've made frozen chicken breast (cut in half), onions, potatoes and broc for one of my fav fresh lunches.  I've put other raw foods... you have to do some trial and error to figure out just how to you need to prepare the raw items so they can fully cook in time (for me it's usually about 4-5 hours between the time I get to work until I have lunch).  Only time I've been disappointed was thicker baby carrots weren't fully cooked.  But if I slice them in half, they were perfect.  I've got one for the office, one mini for home as well as the family size.  I've also purchased them for my kids in college as well as given them as gifts to my employees.  I've yet to have an issue with any of them... and those who have been gifted them have reported the same.  Just don't reheat in styrofoam or plastic bags (at least not w\/o a barrier like a paper plate).  If you forget the plate, you'll have a heck of a mess to clean up.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"Finally bought it!","reviewDescription":"Flight crews swear by it. Sadly, more of our hotel rooms don’t have microwaves. I will never have that concern again. ++it’s lighter than my laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Works great for this Truck Driver","reviewDescription":"I meal prep my meals for work , I put my container in the warmer and about 30-45 minutes my food is hot .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Changed my lunch for ever","reviewDescription":"This thing is great. It heats left overs to the perfect temp in about an hour. You will never want to use a microwave again. I Purchased a glass dish for it. It came with a plastic takeout style one. You need this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"It works","reviewDescription":"Works well to warm up a meal. Takes a bit longer than I thought but it does the job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"So convenient.","reviewDescription":"Got this for my daughter who is a flight attendant & is having to make & take meals with her. She was told about the convenience of this from other flight attendants.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"He loves it","reviewDescription":"My husband works construction sites and loves this","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Culinary Convenience at Your Fingertips: A Review of the HotLogic Mini Portable Oven Food Warmer","reviewDescription":"As a busy individual who appreciates the pleasure of enjoying warm and delicious meals on the go, I recently had the privilege of using the HotLogic Mini Portable Oven Food Warmer, and I'm excited to share my thoughts on this incredibly convenient kitchen gadget. With its innovative design and efficient heating capabilities, the HotLogic Mini has redefined the way I approach mealtime, offering a new level of culinary convenience.Effortless Food Warming:The HotLogic Mini Portable Oven is a true game-changer when it comes to warming meals. Its user-friendly design allows you to effortlessly heat up your favorite dishes without the need for a microwave or stovetop. Simply place your meal inside, plug in the Mini, and let it work its magic. Whether you're at the office, on the road, or anywhere in between, the Mini ensures that your food is warmed to perfection.Consistent and Even Heating:One of the standout features of the HotLogic Mini is its ability to provide consistent and even heating. The patented Smart Shelf technology ensures that your meal is heated thoroughly without hot or cold spots. This technology preserves the flavors and textures of your food, so you can enjoy a meal that's just as delightful as when it was freshly prepared.Versatile and Practical:The HotLogic Mini Portable Oven is incredibly versatile, accommodating a variety of food containers and sizes. Whether you're reheating leftovers, bringing frozen meals to the perfect temperature, or simply keeping your food warm until you're ready to eat, the Mini has you covered. Its compact size makes it a practical companion for any situation, from workdays to road trips.Convenience Redefined:The convenience offered by the HotLogic Mini goes beyond its warming capabilities. Its portability and simplicity of use mean you no longer need to rely on communal microwaves or settle for lukewarm meals. The Mini empowers you to enjoy hot, home-cooked food whenever and wherever you desire, adding a touch of comfort and satisfaction to your daily routine.Energy Efficiency:The HotLogic Mini is not only a time-saver but also an energy-efficient option. Its low energy consumption ensures that you can warm your meals without worrying about hefty electricity bills. This feature makes the Mini a sustainable choice for those seeking both convenience and environmental responsibility.Conclusion:The HotLogic Mini Portable Oven Food Warmer is a culinary game-changer that redefines convenience in meal preparation. Its innovative design, consistent heating, and versatility make it an indispensable tool for busy individuals and travelers alike. Say goodbye to cold and uninspiring meals on the go—the HotLogic Mini empowers you to enjoy warm, home-cooked food whenever and wherever you desire. If you're seeking a solution that combines efficiency, taste, and practicality, the HotLogic Mini is a must-have kitchen gadget that elevates your dining experience to new heights.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Doesn't last long","reviewDescription":"Only get a couple months of daily use before it quits working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"cheaply made ,,not durable at all !!","reviewDescription":"purchased  and delivered may 21,,here it is july 17 and this thing is already FALLING apart at the seams !! it still works i guess but for the price of these things you would figure they would last longer,,on a brighter notethey are awesome when it comes to heating  your lunch at work,,i always kept the bag in my locker and just take the bowl home so its not like it lived a rough life !! i had numerous people ask me about it and directed them to amazonwhich probably 5-7 people ordered them from here ,,ive looked for similar products like this that maybe might be more durable or better quality ,,, no luck,,i guess ill just have to slap some duct tape on it to keep it from ripping anymore,,im sure when other people see my tape they will probably have 2nd thoughts on buying one of these,,I WOULD","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1594944000000}
{"reviewTitle":"WOW!","reviewDescription":"It heats up fine but... but!The zipper is HORRIBLE and erases all the positive aspects.Wow this is beyond bad!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Save your money","reviewDescription":"This product that the potential to be my life savor. I am a international flight attendant that travels frequently which means I bring my own food to cut cost internationally. When my cousin told me about the oven immediately ordered mine just before Christmas. It cooked fine the first few times, I've been noticing it's taking longer and longer to cook the simple things. I had some rice left over from dinner .  It didn't cook my rice, I put some Asian food in  went to the city and came back the food was barely warm. Tonight I placed pre cooked chicken and rice in there again (the hotel i am in doesn't offer a microwave) for almost two hours. I came back the food was cold on top and sides! The plate gets hot but it's not worth it if it doesn't cook all the way around. It should be noted that I love used both the glass and metal Tupperware.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1517356800000}
{"reviewTitle":"Broken down too soon","reviewDescription":"I bought this product because I’m always on the go in a car. I was really excited to find this product and that I don’t have to waste more money buying lunch everyday. The times that I did used it to warm up my lunch I was very satisfied with the outcome but now it’s broken. Bought it the end of March, now it’s in the mid May, used it less than 10 times and it’s not working anymore. I didn’t mind the amount of time it took to warm up my food as long as it does warm it up by the time I have lunch but this is horrible. It broke too soon for the amount of times I used it. I didn’t even get to use it that much before it broke down. And my return window ended on April 27.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1526515200000}
{"reviewTitle":"Decent","reviewDescription":"After using it for a while it looses heat","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Stopped working after a few months","reviewDescription":"I loved this until it broke. Of course it broke after I can no longer return it. I spend a lot of time in hotels and I depend on this to heat up my food most of the time since some hotels do not have microwaves to use. Takes a long time to warm up your food since it’s just a hot plate but now it seems to have stopped warming up all together. Just waited 2 hours for my food to warm up and the plate is still cold. The outlet works so I know that is not the issues. Not sure if it’s worth buying another one if it’s just going to break after a few months","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1605916800000}
{"reviewTitle":"Cheapest quality in china","reviewDescription":"Cheap junk. The zipper came off track the FIRST time I opened it. Also the FIRST time I opened the lunch box I find that the container is cracked and won’t close properly. Overall just a cheap lunchbox. You’ll probably have to take the heater out and use your own lunchbox.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1668902400000}
{"reviewTitle":"Cheap","reviewDescription":"Hot logic has become cheap. The first picture is what I received in my package today and the second picture is the glass container I received in my first hotlogic i bought a few years ago. Not worth the $40 something dollars.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"Plug melted","reviewDescription":"Title pretty much sums it up, although it did work great for 2 years of almost daily use so I suppose I got my money's worth. I'm considering purchasing another, except this time I might get the 110v plug and get a 110v to 12v converter.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"Fire risk","reviewDescription":"Been using these warmers for years off and on. Got this one in September used it maybe 10 times, the plug got so hot it was melting.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Only car warm option","reviewDescription":"The item came only with a CAR charger for warming! Inwill be at work at my desk. I thought it would be optional for both. I definitely do not warm my food in the car but this was the only option.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Junk","reviewDescription":"Worked great for 6 days. The seventh day my lunch was hotter than normal and the eighth day it quit working. I guess you get what you pay for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"It quit working","reviewDescription":"Used it a couple of times and it stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"the plug that is used","reviewDescription":"could not use it.  It was my fault that I ordered the wrong one.  I did not check the plug.  I am ordering another one with a household plug.  It is good quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Doesn't last long","reviewDescription":"This product did work, but not for long. I had it not even a full 3 months before it completely stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Not working, not even a month later..","reviewDescription":"It was working fine; then suddenly it just stopped.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Garbage","reviewDescription":"This product worked great but for only 2 weeks and now it does not work. Needs better build quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"I’m highly disappointed! I read all the instructions and did exactly ...","reviewDescription":"I’m highly disappointed! I read all the instructions and did exactly what I was supposed to do. I drive all over for work, I have a large territory so I thought this would be perfect. I put my leftovers in when I got in my car and plugged it in like directed. All the sudden about 15-20 mins later I start getting a horrible headache! All I smell is this toxic smell and I didn’t even realize it was from the hot logic! I immediately unplugged it. I AM PREGNANT and I had to roll my windows down in extremely cold weather so I could drive because the smell was so horrific. I tried calling customer service several times and they have ONE person who is does their customer service &  her name is ANN and she WILL NOT PICK UP I had no time to eat, wasted food and was starving.  I want a full refund and I will never purchase anything from them again. Worst experience ever!","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1512518400000}
{"reviewTitle":"I guess I got a lemon...","reviewDescription":"I'm not an angry Amazon reviewer.  I won't buy without reviews, so I try to give honest and fair reviews.  I was so excited about this purchase because my guy delivers packages for a living.  He is always eating at fast food spending too much money, making unhealthy choices, etc.  I read the reviews and got this for his birthday.  He and I were so excited.  It's maiden voyage was sad...especially since this was a gift.  He finally took it to work with some awesome spaghetti and meatball leftovers, and 1) it didn't heat, and 2) the zipper broke on the first try.  It was very cheaply made.  Even the painting was coming off the stretched piece of broken metal.  Just poor, poor quality.  Again, I might have gotten a lemon, but a lemon, I definitely did.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1606780800000}
{"reviewTitle":"45min to 1 hour","reviewDescription":"Takes a long time to warm up food so you have to plan ahead of time so you can warm up food before you get hungry. Works well on road trips or if you work in the middle of nowhere like myself","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Works great","reviewDescription":"I bought this to take to work with me. I warm up frozen meals and leftovers on it all the time. As long as you remember to put your food in a couple of hours before lunch it works fantastic. And food tastes so much better than using the microwave.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Lightweight portable hot lunch box","reviewDescription":"The lunch box is small, lightweight, and heats well. It does take some time to heat up so be patient. Also, the zipper seems flimsy so be care with the hardware. I like it though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678406400000}
{"reviewTitle":"Only missing a power switch","reviewDescription":"I love everything about this case.  I have saved so much on lunch not going to the cafeteria daily.  The food is perfectly heated through by lunch time and I don't have to waste time retrieving food from a restaurant or the cafeteria giving me more me time on my lunch break.  Only thing I wish is that it had an on\/off swath so I didn't have to unplug it  everyday since all my outlets are under my desk.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"It does what it's stated to do, literally.","reviewDescription":"Pros: Now got it and used it only once but it heated refrigerated soup to an edible temperature in around 1.20 hours. The heat proof appeared durable and definitely easy to clean.It's neat and looks well anywhere it's placed.Cons: The zipper keeps snagging the bag material at a corner and it could have been a bit taller to accommodate a larger container.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665100800000}
{"reviewTitle":"This is my first review!!! Perfect for work for people who don't want to microwave!","reviewDescription":"I'm very food conscious, and am against using a microwave. I cook my meals at home, and was getting up extra early every morning to heat up my lunch and put it in a thermos. I don't like using the thermos because it invariably touches the plastic inside the cap, and hot, I fear it leaches plastic particles into my food. I was looking for a solution that I could use at work to heat up my food more easily without all the planning and thermos issues. This product is a dream come true!! I used it today for the first time, and in 15 minutes the chili I made at home and was at refrigerator temperature was piping HOT!!! It is somewhat of a glorified hot plate, but I love the fact that the food isn't in plain sight while heating at my desk. I couldn't be happier. I wouldn't use this for carrying a ton of heavy things though. To me that's fine, as I try to reduce bulk when commuting.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1543881600000}
{"reviewTitle":"Great for an operator!","reviewDescription":"Got to love hot lunch on the job site! I use it for everything! Regular lunch meals to muffins and cookies! One disappointment the paint flaked off of the heater surface. Other than that everything it great and you can wipe the inside easily. Zipper is light weight so not sure about longevity on that. Get the Pyrex from Walmart or online to for a perfect fit with no plastic on there!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1666396800000}
{"reviewTitle":"Good for construction brothers and sisters","reviewDescription":"Heats food slowly on jobs with 120v","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688256000000}
{"reviewTitle":"Lasted 8 months","reviewDescription":"I've been using this lunchbox for 8 months and it's been great. Unfortunately it stopped working yesterday; the light comes on but it doesn't heat up. Was a lifesaver while it lasted so i'll still give it 4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677369600000}
{"reviewTitle":"What a neat little lunchbox","reviewDescription":"So far so good ….. easy to use !!! I was skeptical about this but it’s working as described. I plug in an hour before lunch ….. this was so I remembered. When I came back to it …. It was nicely heated and the plastic container was not melted .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672876800000}
{"reviewTitle":"Best thing ever invented!","reviewDescription":"I’m a local truck driver and I use this daily to heat up my lunch. It’s never let me down and you can’t beat the price. It takes about 45-60 minutes to get something scorching hot but it’s worth it to me!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Love it!","reviewDescription":"I rarely write reviews but I love this so much. I actually just bought a second one so I can have one at work and one at home. It heats food dishes so nicely, especially things like pasta and soup. It's much better than having it in the microwave and being unevenly cooked. Also, I'm very busy at work so it's nice to be able to just have it sitting there warm when I have time to eat it and not worry about it burning.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"keep food hot and nice","reviewDescription":"My lunch was hot enough to eat. money well spent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"I look forward to lunch at work now!","reviewDescription":"I’m a convert! I got this for a work field trip with my high school students where we stayed in a hotel. I don’t like paying to eat out all the time in the city, so I tried this out. It was great for oatmeal in the morning and heating up leftovers from when we did eat out. But then I brought it back to my office and use it several times a week. I love that I can pull leftovers out of the freezer and pop them in in the morning and they are warm and evenly heated at lunch and I don’t have to wait in the microwave line to end up with food with hot spots and frozen spots. On pizza fundraiser day I put my sad little slices of gluten-free pizza that have been out of the oven for 45 minutes straight onto the hot plate for 15-20 minutes until they are crispy just getting melty and appetizing again. No time for packing a lunch? I have shelf-stable Indian packets in my desk and just throw an unopened one in for an hour or two. I keep a canister of food-safe wipes at my desk to clean after I put anything directly on the plate. So easy and delicious, I actually look forward to my work lunches!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Gets food hot!","reviewDescription":"I bought this for work because I don't have a way to heat my lunch and I am totally impressed with it! Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Works great!","reviewDescription":"I bought this to heat my lunch up in the car.  Works great.  After 30-45 minutes the food is the perfect temp to eat.  Very happy with the product.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"5+ years of daily use and still going strong.","reviewDescription":"This is the best purchase I have ever made, hands down. I take pre-made food I made at home and freeze it. After 3-4 hours it's HOT! I absolutely love my hot logic!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"perfect","reviewDescription":"I gifted the Mini Lunch Box Food Heater to my husband, who works as a truck driver. He was impressed with how quickly it heats up food and maintains its temperature. It's been a great product for him, providing convenience and efficiency during his long shifts on the road. Overall, it's an excellent product that meets his needs perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Work great.","reviewDescription":"I have been using this for over a year without any issues as traveling field service technician this keeps my luch warm.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"This thing is great","reviewDescription":"It is so handy. I use it all the time to heat my lunch, or to take food to eat on a road trip.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Does the job but the heat gives off a scent..","reviewDescription":"Great for traveling but I do think the container makes the food have a “container smell”? My food tastes like it’s been in a box and I don’t like that. Maybe I will try using a glass container instead of plastic. But it does keep my food warm. I would suggest buying this but try to use a glass container.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1567641600000}
{"reviewTitle":"Worked well for 5 months","reviewDescription":"Warmer worked well for 5 months then stopped working.  I bought this for my husband who is a truck driver so he is on the road all day.  He liked being able to warm up his lunch as he drove.  Unfortunately it gave out after 5 months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613692800000}
{"reviewTitle":"Short life!","reviewDescription":"This little gadget was great for my Husband in Law Enforcement  who spends long hours in a car until it broke today. Only lasted less then a year. Tried it on 3 vehicles to make sure, and it’s confirmed that it is completely dead. Unfortunately it was very short lived.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612224000000}
{"reviewTitle":"Awesome product","reviewDescription":"I used this product to heat up my food at work. Due to COVID we weren’t allowed to used microwave. This little oven has been great to heat up my food. I plug it in 30 mins before I am going to eat and it works wonders.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618185600000}
{"reviewTitle":"Melted","reviewDescription":"Bought in February 2021. Today it stated melting while in use and now I am unable to use it at work. Absolutely loved this until today. Great for the ambulance when it worked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628640000000}
{"reviewTitle":"It’s ok","reviewDescription":"Warms the food good- I had a bowl of pasta and it heated up in about 30 min but the smell of it is horrible I hope will not smell like this every single time I use it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610409600000}
{"reviewTitle":"The cord broke from the car plug in socket","reviewDescription":"It was working beautifully until we pulled it from the car lighter socket and half stayed in the socket and cord broke off.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1637971200000}
{"reviewTitle":"This is a small lunchbox size","reviewDescription":"I though it would be larger something you could take a casserole in, but it is not. It is lunch box size. I kept it and gave it as the gift. The person ended up returning it to me and said they would not use it. :-(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1597968000000}
{"reviewTitle":"Good quality","reviewDescription":"The only thing I don’t like about this item  that it  does not have  a pouch or something that I  can put my fork and napkins or spoon in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625356800000}
{"reviewTitle":"Stopped working after 10months","reviewDescription":"It worked when it worked!.  Stop working less than a year","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Don’t think just do!","reviewDescription":"My boyfriend LOVES this, he does landscaping and he’s a very hard worker and needs to eat properly with the amount he does. Sometimes he misses lunch and with that hurts his weight were he is so tiny!!! To ensure he is getting properly fed and getting a good meal this is has done wonders! He gets his favorite foods nice and hot! He was shocked how hot it got to heat it. It’s perfect size to flatten and put back in his backpack. Best part is no buttons no setting no remember to open the vent he can just plug in and walk away !!! And as to my surprise it came with its own container.The only flaw was the charger was difficult to out in it almost felt like it was gonna break not sure if it’s because it’s new or the vehicle. And yes it is a mini for sure and perfect to fit and a backpack that’s also a cooler but it’s maybe a little to small for me personally, only because I would prefer to pack a deeper dish for a huge lunch but he’s fine with it which that’s all that matters. Also don’t pack to much in the container where you can’t stir. I over did it and the top of the food was still cold even after 45 min and I didn’t leave room to stir. Other than that this is a great product a must have if you work outside. Great present idea for your husband boyfriend girlfriend whoever !","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1685059200000}
{"reviewTitle":"Works perfectly for lunch heat up","reviewDescription":"As a teacher with a strict 40-minute lunch period, I don't want to waste up to 10 minutes standing in line for the one microwave in the Teachers Room! This is the perfect solution! I'm not cooking food, just heating up. I plug it in around 8:30 a.m. and my lunch is at 11:45. Chilis, stews, and soups all reheat to the perfect temperature! And I get my microwave line time back!I don't carry this back and forth as my lunch bag since there are things in there I don't want to be heated up. I just take out my container when I get to school, put it in the Hot Logic, and plug it in.The only con I see is that the zipper doesn't open smoothly. I have to put a finger in and lift up the top of the bag around the corners. I hope the zipper lasts! So, 4 stars instead of 5 for that reason.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Use it in my Semi","reviewDescription":"The hot bag works ok for precooked meals. I’ve never tried to cook raw meats in it as it claims you can do however. Prepackaged meals like healthy choice need to be tired or you get a burn spot on the bottom. Yes you CAN have them in too long. Any of those with the cardboard type bowl burn horribly and are very dry.Soups, canned ravioli etc and home cooked meals do very well.Keep in mind the temps are over 180 degrees so the longer it heats the dryer things can get.It definitely does the job and heats food well. It even came with a nice sealable food tray for. Home cooked meals. Saved more in the first week the. This device cost. Highly recommend","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Lonchera","reviewDescription":"Esata bonita lo malo que solo se puede conectar al carro para calentar","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"My husband had really enjoyed hot lunches","reviewDescription":"My husband is a local cdl driver and for months he had been eating cold lunches because I couldn’t find a “easy” heating method. But recently I came across this lunch bag and it’s done great! 20-30 minutes to warm up cooked food - my hubs eats a lot of meat so I do recommend slightly undercooking meats so when they heat up they have a chance to keep some moisture.The thing I like about this the most is it’s plug n go. My husband doesn’t have to fuss with it to get it working.The only thing that would improve this bag is to have a small section on the top to add snacks (cheese, small cracker packs, etc) or side pouch to stick a single can drink in.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Its good for warming up food. Not cooking it","reviewDescription":"It does not replace a microwave or stove AT ALL. If you're expecting to cook anything on it expect to be there for hours because it pretty slow to warm up to that point. However it does keep food warm and can warm up room temperature\/cold food for however long you need it to. But its not gonna get fry an egg on it hot. I don't regret buying it as it has helped me in alot of situations. Oh and it has certain spots that are hotter than others. I like thst you only have to plug it in and easyness of it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Really awesome if you're trying so hard not to use a microwave and traveling with food.","reviewDescription":"I really love this! It's easy to keep clean! I feel it's really safe to use! but my only issue is the food smells fill the air so close quarters in the car traveling only works if it's not a onion based meal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great for heating good on the go!","reviewDescription":"Awesome product, great for cooking a hot meal. As a truck driver I use daily to heat up breakfast Sandwiches and meal prep items for lunch.(Cons)The seem to have a short lifespan when used regularly. My second one lasted only 2 months.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"As advertised","reviewDescription":"Perfect size, fits most meal prep containers and works great. Never have to wait in line to use office microwave anymore so two thumbs up.Not a deal breaker for me but the lid to the container that came with the product broke because of the packaging so just a heads up for the next person.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"BUY THIS!!!","reviewDescription":"This is the first time I have bought something like this and its amazing. My husband is used to working in an office with all the amenities needed for lunch breaks. Now ge is out in the cold working and his lunches just dont stay warm. I've bought him soup thermos's but he still is getting luke warm meals at best. I started searching for appliances that can be heated by car lighters and this one popped up. I read the reviews and thought I'd give it a try. He's had it out 2 days now and at luch time he sends me texts say OMG THANK YOU for this thing. His food was so hot that he had to blow on it before taking a bite.The only reason I am giving it a 4 star is the zipper is cheap and I see it becoming an issue in time but I've already thought that out. He can use chip bag clamps to keep it shut.My suggestion for the company is to make a bigger one with a quality zipper. My husband has only used the plastic container it came with but he will be using pyrex glass dishes this week with sealed lids to prevent spillage.Tammy","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"Workmanship","reviewDescription":"I just received my product with the paisley design,12v. On my initial view, it seems quickly and cheaply made.  Color \/ pattern  didn't scream paisley with deep rich colors. Some  stitching bunches slightly.  The zipper doesn't glide easily and one of the pull tags was bent. Not a one handed zip.  When zipped, one area is bowed which could be a stitching issue.  Thanks for the plastic to go container that I bent (lid) while trying to reshape the product.  I so want to love this item.  Not confident it is sturdy enough to last while on the road.  I will return with another review once it is used.  Just wondering if an AC plug could have been included for home use.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Baja Calidad producto","reviewDescription":"Recibí el producto y puedo evidenciar que la cremallera es de muy mala calidad. Creo que no durará mucho.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Stopped working after 2 weeks of purchase","reviewDescription":"I used this to keep my prepared meals warm in the car because my job requires lot of driving. The product worked fine at the beginning but it stopped warming after about 2 weeks. I thought it was something wrong with my car’s port, but it tuned out that the product just stopped working for no reason","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Okay quality, great design","reviewDescription":"Zippers are flimsy, have to be careful zipping around the corners or it’ll get caught on the material inside. Kind of disappointed in overall quality for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Hotlogic","reviewDescription":"I like the product because it warm up my leftover food. My food container was placed in Hotlogic around 1045am and was taken out around 1250. By the way this was my first time using it....When it was opened I saw the condensation on the inside of the container and thought wow! It worked!What I dislike about it was it only made my food warm. Maybe I should have it in a little longer than 2 hrs but I was hungry. It's an okay buy. Just remember it's not a microwave.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Worked well until it didn’t work at all","reviewDescription":"Had this for about 2 weeks and got about a dozen uses out of it before it completely didn’t work. I always kept cords organized and took good care of it but I guess it just couldn’t keep up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Good while it lasts","reviewDescription":"This is a handy device, but it's disappointing that it doesn't last long. After less than a year, using it about twice per week, the small spring in the plug broke. I bought a second unit, which now refuses to heat up after about ten months of use. I am debating buying a third. I guess it is worth $39 per year to warm my lunch in the truck.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Works great, zipper doesn’t - zipper is of poor quality","reviewDescription":"I love the product idea and it heats fast.I did not like the zipper on the container, it could and should be more durable.  It’s gets stuck and is very hard to zip.It seems to me, that it will not last long.  It’s no good if the zipper breaks because the heat will escape.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Melted the bag","reviewDescription":"My boyfriend works in construction and is always eating a cold lunch, I bought this for him in hope he’ll finally be able to eat a hot lunch on the jobsite. He uses plastic meal prep containers so that was my first concern, is that it would melt the plastic. The description states its safe for plastic containers, it wont melt them. His first time using it, it melted the bottom of the container. He even tried using the container it came with and it also melted the bottom. He figured out plugging it in and letting it sit a little before putting his food in kinda helped so in that sense its been working fine. It also says you can heat frozen foods in a cardboard container, he wanted to try it out. It ended up getting so hot it melted the bag and started smoking. When it worked, it was great he loved it.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Doesn’t last long term","reviewDescription":"I’ve bought two of these. Both lasted less than a year before they stopped working. Shame because they work well when they’re working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Great product!","reviewDescription":"I purchased this for my husband since he is out all day driving around in his truck and is far from home. He always complained about his food being cold and he would choose to eat out at times because he wanted a warm meal. I want him to eat healthy so I bought this for him and he absolutely loves it. He plugs it in his truck about 1 hour before lunch and he gets to have a hot meal :) I absolutely  recommend this!Unfortunately after a few uses the zipper on the bag broke and it seems to be falling apart :(","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1510704000000}
{"reviewTitle":"Loved it, but stopped working after 4 months","reviewDescription":"Loved it, but it stopped working after 4 months. It heated up really fast and I had these awesome warm meals when working on the road. But then for no apparent reason it stopped working -- no liquid damage, nothing visibly wrong with the cord, didn't experience any trauma. Tested it in several different cars to be sure. Really disappointing for the price. If I buy again, I will probably go with the cheaper knockoff ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1599609600000}
{"reviewTitle":"The size of item.","reviewDescription":"It was smaller than I thought, my friend had one and I liked the size of hers. I don't know how good this item worked as I returned it, but it looked perfect and I'm sure it would be great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"Container broken","reviewDescription":"Haven't tried this yet but disappointing that the container it came with was broken upon opening.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663113600000}
{"reviewTitle":"Wasted my money","reviewDescription":"I bought this item on September 11 2020. It quit working on October 30. The return window with Amazon closed on October 15. I contacted Hotlogic about this on October 30 and have gotten nothing but a run around. I will not buy another Hotlogic product. On about November 23 I received a replacement from Hotlogic, it is working good at this time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1604707200000}
{"reviewTitle":"Broke after 18 month","reviewDescription":"Loved this mini oven as long it worked. Had it for 18 month and just used it during the winter months and now it's not heating up anymore. Little disappointed, thought it will last longer :-(","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1643155200000}
{"reviewTitle":"Was just okay...","reviewDescription":"I wish it was maybe twice the size. Kinda hard to put anything in there that's maybe bigger than a handful of hot dogs. Warmth was fine, but the distribution of heat was a bit of a problem. Just turned out to be very underwhelming. As a concept, I love the idea, but I think I'll upgrade to something more heavy duty.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1603497600000}
{"reviewTitle":"after only a few uses the surface started to peel while cleaning","reviewDescription":"I like the fact that it heats food evenly and easily. however after only a few uses as I was cleaning the surface it started to peel. I did to have leftover food sitting on it. I cleaned it up immediately after using once it had cooled so its not like I was trying to scrape off anything.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609891200000}
{"reviewTitle":"Good for short term use.","reviewDescription":"Had it for about 3 months. It was working great until it stopped working. The little end piece of the plug came off and I can no longer use it. It’s good for a short period of time, but if you’re looking for a long term use, spend a little more on a better product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622419200000}
{"reviewTitle":"Small, slow, but it does what it promises","reviewDescription":"The portable oven does what it promises. It is small and you can only get a handful of containers to fit in it, but if you look, you can find them.The key to operating this item is not to unzip it while it is warming up the food. Also, depending on what you are heating up or what thickness of food container you have at the moment, it might increase the heating time to 75 minutes. So if you are a fly-by-the-seat-of-your-pants when it comes to eating your lunch, this will not work for you at all.Overall, I am glad there is an item that allows me to avoid microwaving my food.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1418860800000}
{"reviewTitle":"Looks nice!","reviewDescription":"Wish I could use it..plug doesn't fit in my older vehicle cigarette outlet..so I can't tell how it is..like all the other reviews, though..(everyone else must have newer cars).","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Only lasted less than a year","reviewDescription":"It was great while it lasted but needing to spend $40 in less than a year is ridiculous. The shelf life should be longer for this product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Not bad","reviewDescription":"A bit tight, depends on what you place inside it will approximately take 35 to 45 mins to heat up. But otherwise very practicle.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Disappointing","reviewDescription":"I have a less expensive Skywin portable oven and was hoping to upgrade after reading reviews. The HotLogic came with a plastic fast food container! The Skywin has a metal cooking pan and a plastic lid that is a better quality. This is going back!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Size","reviewDescription":"Kept food warm, but too small for much more than a sandwich.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"This worked great for about 8 uses.  Then it stopped working.","reviewDescription":"Not sure why it stopped working.  I checked for a short in the power line.  Couldn't find one.  There were no loose wires.  It stopped after about 8 uses.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Its just ok...","reviewDescription":"The heat takes forever a good hour for food to get warm and hour n a half for to be hot. But it does work it just needs time","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Flaws not disclosed","reviewDescription":"Purchased Used-Like New. Arrived in an undamaged shipping box, but plastic container was cracked, and zipper was defective.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Be safe! Check food temperature before eating!","reviewDescription":"For frozen pre-packaged meals to be safe, they must be heated throughout to a min of 165F\/74C for a period of several minutes. I've had mixed results with the HOTLOGIC Warming Tote. A rectangular foil or 'microwave safe' plastic container that covers most of the warming element in the Tote works best, but after a min of 2 hours in the Tote, my meals have varied from 150F\/65C to 180F\/82C. Most of the time the temperature has been below the safety threshold. Oddly, refrigerated left-overs have heated to a lower temperature than frozen meals! I have access to a microwave that can bring my food to the correct temp, but what is the point of using this Warming Tote if a microwave is still necessary?I really WANT to like this Tote. A friend raved about it, and when office access to microwaves was limited by the pandemic, it seemed like a fantastic find. Just make sure your food is the proper temperature before consuming.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619740800000}
{"reviewTitle":"Good product. But broke with less than one year usage.","reviewDescription":"Ok first off. I love this product!!! I used it around 4 times a week for almost a year. I work in the transportation industry where a hot meal isnt always practical. But this changed everything!!! I probably turned 20 people onto this little gem . However just last week it stopped working. So while i do feel i got my monies worth out of the item.... I just cant give it five stars as I would have like it to last a little longer.Also here are some of the best ways I have come to use this container wise....Dollar tree -- Three individual foil containers for a buck. Good but you have to be carefull of steam as they so not seal 100%.Glass pyrex -- Ok but very heavy. This is a hugh minus... If you are not returning home everyday. Also the lid will pop off slightly if you heat for a while.The Best option by FAR!!!!IKEA ceramic\/plastic container with a lid that has pressure release built in. This was awesome it was a little bigger than the pyrex so you kind of have to pull the corners around the container but it works flawlessly. Completely water tight and very lightweight.","isVerified":true,"ratingScore":3,"reviewReaction":"97 people found this helpful","country":"United States","date":1505865600000}
{"reviewTitle":"Excellent","reviewDescription":"I wanted a more healthier way to heat up my lunch and this has surpassed my expectations. I high recommend everyone to purchase it for yourself. I don’t travel without it!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Gets HOT!!!","reviewDescription":"So what you see here is baked jerk Chicken, Mac & Cheese with some Cabbage Collard Greens 🥬 mix..If you’re going on the road for a long drive & wanna eat when you get there then this is perfect!Plug it in the car charger for about an hour for piping hot food & a little longer if you took the leftovers from the fridge..I’m an Over the road driver (OTR) Motor Coach Operator & this is THEEEEEE BEST!! Yep for you Truckers too !!When you heat up your food made from home & open it up steamy hot is comforting..It comes with a plastic container but I suggest getting the suggested Pyrex glass dish, glass is always better.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Works great!","reviewDescription":"I got this for my boyfriend who works on a construction site and does not have access to a microwave. We have had it for a few months now and he absolutely loves it! It works great and now he can take left overs from dinner the night before. It has been super beneficial during these cold months so he is able to have a hot meal on his lunch break. It has also given him so much more options of what he can take to eat. It’s also super easy to use and heats up the food great. I would definitely recommend to anyone who does not have access to a microwave at work but does have access to a place to plug it in.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Perfect for the road","reviewDescription":"Bought this for my husband and brother for work. They love the convenience of being able to heat up their lunch\/food when on the road and at work. Ideal for truckers on the road… I’m a repeat customer because this has been our go-to brand for this product. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Works","reviewDescription":"I hate that it takes 2hrs to heat up a frozen meal,  but I do like the fact that if I ever go somewhere with no microwave,  then this works just fine.  (I only tried it once). I'm gonna see how long it takes to just warm up some leftovers.  I do like it.  This is something I can take to work and heat my food up while I'm working and by lunch time it will be ready. (I get breaks every 2hrs, so it will be heating up for only 2hrs).","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Quality","reviewDescription":"I bought one for at Christmas for my husband.  Several of the men that he works with all wanted one. They all love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"It works. Very well at that. No more fast food.","reviewDescription":"This thing rules. I no longer need to eat fast food on the road or sandwiches from home. I can make a half decent healthy meal and bring it with me. The bag is insulated they state it’ll last 12 hours keeping things warm. I don’t know how true that is, but I can tell you at an hour and five minutes and needed a little bit more time. It was hot but not as hot as I would like it after an hour and a half it was perfect. It came with a Chinese food container that is plastic. I bought a Pyrex  From Amazon that fits perfectly as you see my video. I’ll update my review as time goes on. This thing is definitely worth its weight and gold.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Gets the job done","reviewDescription":"It’s cute, not huge and bulky, fits a plate of food perfectly on the hot mat. I haven’t had any issues with leakage or over heating\/getting too hot on the outside. My job doesn’t really allow me time to stop, but food and sit and eat when I want so with this I’m able to plug it into the rig and by the time I’m done with a call I have a nice hot meal I can eat before getting another call.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Going 6 years strong","reviewDescription":"I've had my HotLogic for over 6 years and it's still one of my favorite gadgets. I keep it in my desk drawer at work and use it to heat up lunch. When I get to work, I put my lunch container straight into the HotLogic so that whenever I can break for lunch, it's ready. I will say I did have to put a folded paper towel on the heating element because once I did have a (albeit cheap) plastic container melt just enough to stick. The folded paper towel resolved that and hasn't been an issue since.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Keeps Food Hot in My Delivery Bag!","reviewDescription":"I bought the pink because it was the cheapest one, it goes inside my catering bag and stays between 180°-200° F and won’t melt styrofoam packaging or plastic bags used by many fast food and dine in restaurants. It’s a game changer when there are a lot of orders and traffic is bad, or I messed up and took that GrubHub order and it didn’t come close to where I thought it was going, adding heat ensures the customer gets hot food without adding enough heat to change the cooking levels. Five stars so far, it works well so fsr.UPDATED 04\/07\/23I’ve found that when I start my deliveries I plug this in gaily l to the multi cigarette lighter adapter I use, and open the insulated bag of this lunchbox fully, I can insert the entire thing into my 3 year old small DD bag that’s looking ratty on the outside, but the foil insulation inside is still perfect. This allows the foil inside the old DD bag to heat up, and it can’t contain all the the heat, so rather than having a single hot spot that’s 8 x 10 or so, it spreads the heat evenly throughout the catering bag after these two bags go inside of the catering bag to keep it ALL warm. I’m thinking about cutting the bottom of the old DD bag out to allow heat to escape more evenly. I’ll probably also cut slits in the sides to even it all out. I’ll keep anyone interested posted on my results in the coming week or two.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1680048000000}
{"reviewTitle":"12V plug GETS TOO HOT","reviewDescription":"Even though we verified it is compatible with our vehicle it gets tooooo hot even after 30 mins of run time. This issue started about 5 weeks after we been using the item 3-4 days a week. Would love a replacement but we are outside the 30 day return window.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687478400000}
{"reviewTitle":"Decent...","reviewDescription":"It's decent. Very underpowered. I'm a driver, and I started putting my food in to heat 1.5 hours before lunch. Even then, it gets warm, but not HOT. It's definitely better than eating cold, but also not as hot as you'd like it.It also varies depending on the food. My rice bowls with ground meat heat up decently in 1.5 hours, but chicken breats(diced) or anything thicker is pretty Luke warm after the same time.I'll probably try and heat it up for 2+ hours, see if that makes a difference. But it's a bit annoying having to heat food for that much time to be hot. Might just look into getting another brand.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"So so. Would not but again","reviewDescription":"Works great. But the life of it was not very long.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Love it but should automatically shut off","reviewDescription":"It doesn’t over heat or burn the surface it’s sitting on (well I haven’t experienced it) but it just stays on as long as it’s plugged in. I just feel like there should be an auto shut off for safety purposes. But it definitely heats up some food and it taste 10 times better than the microwave. It’s not going to give you oven quality reheats but it comes pretty dang close","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1661385600000}
{"reviewTitle":"A Little Downgraded","reviewDescription":"Sort of a disappointment. As a flight attendant, we've been using these for years. So I still have 2 others. The colors aren't as bright on the case, which is the reason to get this colorful style. The zipper has been swapped out for a cheaper version, so hopefully that will last through multiple uses. And the biggest disappointment, the no longer come with a heavy glass bakeware container and top. Now it's just a cheap black hopefully resuable container with a plastic top. i can't imagine how few travels this will last. Thank goodness I saved my other units so I can just swap it out. But most people will have to buy the durable glass, reusable bakeware. But, I'm going to make it work.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1621296000000}
{"reviewTitle":"Not durable and element gets hot","reviewDescription":"I recently purchased this for my trip. Used it 4 times. I like it, It is handy and does heat up fast. I have to watch because the temperature is always high within 15 mins.  Though the inside sides of the pouch looks like aluminum, I don’t understand how the bag can start to melt n wrinkle. Also they claim you can put plastic in it, I tried putting the food in the plastic container that came with the pouch and after one use it is already melted a little. I was kind of disappointed with this as I had wanted to purchase another one after trying this. But I don’t think I would. I hope this review is published. I saw the reviews and because of the good reviews, I bought this product.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1614124800000}
{"reviewTitle":"Works well.","reviewDescription":"I use this to keep tortilla’s warm at the table.But the zipper. Is cheap, hangs up and doesn’t open or close smoothly.Velcro would have been a better choice, imo.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685836800000}
{"reviewTitle":"Came quickly","reviewDescription":"Catching flies. Works but not at rate the add shows. Bate was not specified.I had to trim the fly ended hole, it was covered with some netting.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Nice but container completely broken.","reviewDescription":"Seems to work just fine, but I had to go out and purchase another container as the one that it came with was smashed and broken. I was upset (especially for the price) but I needed it right asap so I couldn't return for another. Wish is was sturdier so that I won't run the chance of it getting smashed again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Could be better","reviewDescription":"I'm a truck driver and it's hard to find a microwave on the road. This item has came in handy so many times. Heats the food up perfectly I've only used plastic and glass Tupperware. Plastic is the quickest to heat up. My only 2 complaints is that I'm on my 3rd one in the last 2 years. They are cheaply made.  First one the plug melted. Second one one of the zippers broke but I still had the other. Then the other one broke.Let's hope this 3rd one lasts longer.I use this item about twice a day 5 days a week.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1628208000000}
{"reviewTitle":"Drains power from vehicle, and doesn’t reheat precooked food very well.","reviewDescription":"Not good for reheating already cooked foods on the road..doesn’t do well with glass dishes either. The bottom gets VERY hot and then the food never actually warms. I wanted it to heat my food quickly for when I’m ready to eat, but this is one of those “plug it in at the beginning of the day, and it’ll be warmish by lunch time” type of deals. Also my fiancé’s work vehicle started very rough while using this..so it’s draining tons of power from the battery, with less than desirable results. Wouldn’t recommend. Going to return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1588032000000}
{"reviewTitle":"Plate came broken,  if its sent via bag, be aware of damage.","reviewDescription":"Plastic Tupperware is not sturdy, came in damaged,  I'm a Truck driver on road for long periods,  don't have time to return, so having to bite the bullet.Just be aware it can arrive damaged so plan ahead with extra bowls. I didn't purchase bowls hence I was testing product prior to investing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656547200000}
{"reviewTitle":"Lasted barely a month. Unhappy!","reviewDescription":"Christmas gift. My uncle loved it, it’s January 4 and as of Monday it stopped working. I barely missed the window to return. I’m very disappointed and sad for him because he loved it. Not durable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675382400000}
{"reviewTitle":"Worked great (3) times.....","reviewDescription":"I purchased this for my husband as a Father's Day gift. He is a truck driver and was just sick of taking sandwiches for lunch and wanted the option to have a hot meal. It worked great for the 3 times he got to use it last week. He plugged it in this morning and the light came on. He pulled out his lunch on his break and it was still ice cold....The concept is great and it did in fact work really well when used it. Just didn't last long at all!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593475200000}
{"reviewTitle":"Heating takes long time","reviewDescription":"The idea is good. However, you have to wait for about 10 mins until the food is warmed up which is a downside comparing the speed of the microwave.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"Simple, Amazing Solution!!! \/UPDATE 10\/31\/22","reviewDescription":"This is sooo much better than a microwave! It took about 30 minutes to reheat packaged food that I bought. It uses very little electricity. Everyone needs to have one of these.I bought this on July 5, 2022 and have used it everyday. Now it has an electrical burning smell. I am so disappointed!","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1657411200000}
{"reviewTitle":"Works","reviewDescription":"Bought this because I am a truck driver that is on a dedicated run. I put my food in about an hour before I'm going to take my 30 min Lunch\/Break. It gets the food warm enough to melt cheese. There isn't any temp control it reminds me of a crock pot on low. The size is perfect for the lunch size Rubbermaid containers. I had one that lasted me 2 years with daily use. The solder came loose on the plug. I ordered a second and it only lasted 4 months. The tip of the plug came off.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1556496000000}
{"reviewTitle":"Poor quality of car adapter","reviewDescription":"We were really excited about this product, up until the plug for the car melted and stopped working. Really disappointed with the quality of the product, idea is great but the quality was really poor. Not sure if we got a defective piece and thus did not lasted, but it’s too late for a return. Perhaps it’ll be better to use a USB adapter but the plug broke so fast.  Please take a moment to reevaluate the purchase if you’re looking for something of good quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1592784000000}
{"reviewTitle":"Not fast enough","reviewDescription":"I bought this because I am a person that work out of a truck, having that said I needed something that could warm up my lunches to save some moneyDoes it do it ?In a way yes but it take forever to do so, I have had it hooked up for 30 minutes and still not gotten my food hot only warm after 45 mins it made it hot.I only get a 20-30 minute lunchSo if you have a lot more time then this could work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578268800000}
{"reviewTitle":"Worked great but has durability issues","reviewDescription":"At first this was fantastic. I saved a lot of money from not having to eat out. This work great and warmed food perfectly. The issue is the durability. I used the one that plugs into the cigarette lighter. There is no on\/off switch so you have to unplug it every time. In less then a year the inside of the plug pulled apart.  I used this almost everyday but I still think it should have lasted longer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613692800000}
{"reviewTitle":"Looks as pictured","reviewDescription":"Bought as a gift for a railroader. He hasn’t received it yet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Best purchase !","reviewDescription":"I’m often driving around at work during lunch time and I can’t afford to buy lunch\/dinner every day so I decided to meal prep each week. Only problem was, where do I heat up my food? Sometimes there’s an office or 711 nearby but often enough there’s nothing so I had the option to eat it cold or wait until I could find a microwave. I found this lunchbox on Amazon and figured, what the heck for this low price I’ll give it a shot. It’s the best purchase! On the downside, yes the box takes a bit to heat up depending on what the food is it could be a 30 minute wait or an hour. On the bright side , I usually eat around the same time each night so I plug it in an hour early and by the time I’m hungry my food is hot and ready to go ! It’s very small and light so easily fits into my bag without a hassle. I’d highly recommend this to others !","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1629072000000}
{"reviewTitle":"A nice addition to my office tools during COVID","reviewDescription":"Like many who have jobs that cannot be performed from home, I have been relying on work to provide a microwave in the break room.  Ours has three of them which are continually being used simultaneously causing the electric circuit they run on to overload and blow a fuse.  That normally takes us down to one oven which is covered with everyone's lunch because it's too much to ask for consideration these days when personal convenience dominates over all.Enter the Hot Logic food warming tote.  It's very light and so compact, it arrived in a shipping bag like clothing rather than in a box which surprised me.  It's just a standard aluminum lined canvas tote with a little hot plate built into it.  Just enclose your lunch inside and plug it in.  It's plenty hot from a frozen state in an hour.  I've heated a Trader Joe's spinach lasagne, a Jon's mac and cheese and a Deep Indian Spinach Paneer (all frozen grocery items) and all came out perfectly heated.  That's one less trip to the break room and less handling of door knobs and community appliances in the safety of my office.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599350400000}
{"reviewTitle":"Very Convenient","reviewDescription":"I had one of these in the past but lost it. I decided to buy another and am just as happy with this as before. Great purchase!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Slightly small","reviewDescription":"For the most part everything is good but to me it's a little to small to put multiple containers of food in there. Gotta put one container at a time based on how big it is.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690588800000}
{"reviewTitle":"Works good","reviewDescription":"My husband has enjoyed being able to have a hot meal at work. He doesn't always have access to a microwave so this is a great alternative. He does have to turn it on pretty early before lunch to get things going. The container that comes with was broke when it arrived but its just a cheap one so didn't really care.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686528000000}
{"reviewTitle":"It works good","reviewDescription":"Keep my food warm and easy to carry, can fit in my purse","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"So far very impressed","reviewDescription":"I just got this unit and ran my first test. It's a little smaller than I thought it would be, but no biggie for me.I re-heated a left over soup directly out of the fridge, put in a sauce pan, took the element out of the container and placed it on the counter top and plugged it in.From cold soup to hot soup in 90 minutes! Very nice!I then left the pot on the element for another hour, and the soup was piping hot! Almost too hot to eat!More tests to come with my Jackery and Stanely power boxes!","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Warms well","reviewDescription":"It works well, actually warms much quicker than 4 hours than stated in some reviews, but smaller than I thought.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"very affordable great buy","reviewDescription":"got this for my son that drives a school bus he say it works really well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Love the product but it failed in 6 weeks.","reviewDescription":"I have very mixed feelings about this product. On the plus side the warming tote was compact and light weight yet held enough food for a full meal. It was simple to use and most importantly the food warned up as promised and tasted great! As an example, I had some ribs left over from the previous day. I just wrapped them in parchment paper, plugged in the tote and then pulled my van over in about 45 minutes to eat. They were as moist and delicious as the day before.Unfortunately, after 45 days the tip of the plug came off and I can no longer use the product. It's past Amazon's 30 day return policy so I'm very disappointed. The product is great but the durability didn't work out for me.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1616198400000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"Purchased this in mid January. Has already stopped working less than 3 months. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"I received it today and the inside container are broken","reviewDescription":"Not happy at all the inside container was broken. Not recommended.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Plug was for a vehicle","reviewDescription":"Sadly the products plug was not for an electric outlet so I will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Don ‘t waste your money!","reviewDescription":"Used Hot Logic on kitchen counter max of 5 times and stitching failing  and zipper failing. Do not waste your money!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Stopped working after a few months.","reviewDescription":"Worked great for a few months and then stopped working. It was probably used no more than 12 times.  Short lifespan.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"DANGEROUS ! POSSIBLE FIRE STARTER","reviewDescription":"I’ve had the product for two months and it was great, up until today. I plugged it in like I always do and waited for my food to warm up. 5 minutes into warming up my food I started to smell an odor, which I didn’t think much about because I thought it was the bowl the food was in. When I went to unplug it I did so without looking and burned my finger badly. The plug completely melted and became extremely hot.I plugged in my phone charger just to make sure it wasn’t the outlet. No issuesWhen it worked it was great, but now I have burnt finger, an unusable item, cold food. Thankfully a fire wasn’t started.","isVerified":true,"ratingScore":1,"reviewReaction":"36 people found this helpful","country":"United States","date":1599782400000}
{"reviewTitle":"Trash","reviewDescription":"Trash! I was obsessed with it at first. Then 3 months later it stopped working. I emailed them requesting a new plate. They sent it quickly. Plugged it in and the very first time it wouldn’t turn on. Don’t waste your money!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Disappointed","reviewDescription":"My friend has this item from overstock.com. Hers came with a nice glass dish for heating. Mine from Amazon came with a cheap plastic container much like a take out box. If I had known this, I would NOT have bought from AmazonUPDATE:  I emailed Hot Logic and expressed my frustration with the plastic dish. Anna Hollar contacted me immediately to work on a solution. To my surprise, she offered to send a replacement glass dish for heating foods, at no cost to me.  This type of customer service is hard to find.  To say I will purchase more of their items in the future is positively true.  They have made me a customer for life.","isVerified":true,"ratingScore":1,"reviewReaction":"27 people found this helpful","country":"United States","date":1638576000000}
{"reviewTitle":"Doesn't work well","reviewDescription":"Order 2 one for my lady an one for myself. 1 works fine.  The other one takes forever to heat up. I can't just return one cause of how the system works. I don't want to return the good one. An because I  can't return the bad one without returning both I can't give thus company a good review. Order 2 a 1 doesn't work.  That's not good","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1679702400000}
{"reviewTitle":"The bag does not feel good quuality","reviewDescription":"Outer bag (I got purple) is flimsy, and the black trim was seamed together cheaply.  The seam is fraying and gets stuck in the zipper and it's brand new.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1679616000000}
{"reviewTitle":"Traveling cook","reviewDescription":"For me this was a great discovery.  These should be advertised more at high school and college.  As a Vegan I have difficulty finding adequate meals when I have to travel.  I used this on a recent business trip and was impressed. Some of what I \"cooked\" was a test to find out if it worked and I was not disappointed.  One morning I quartered some amber potatoes, spiced them, place in a container with a few tablespoons of water and when I came back for dinner four hours later (after work) the potatoes were done exactly as they should have been. i did pasta, vegetables, frozen pizza, frozen desert, and a few other items.  They all cooked exactly as they should have.  This is so small, easy to pack, doesn't burn food, and the meal is ready when one returns from work.  Sorry it took me so long to find the product.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1563753600000}
{"reviewTitle":"Pretty handy warmer","reviewDescription":"I purchased in January and by June the hot plate stopped working, I used it maybe 20 times. I contacted the company and the promptly sent a replacement hot plate. It keeps food nice and hot.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677628800000}
{"reviewTitle":"it gets really hot","reviewDescription":"this is good for on the go when you have time to wait for your food other than that it takes a while for food to heat completely up. I haven't tried cooking with this, but I would imagine it would take some time if you like your food well cooked.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671148800000}
{"reviewTitle":"Poor quality","reviewDescription":"Bag and zipper feel a little cheap to be honest but it gets the job done ✅","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684454400000}
{"reviewTitle":"Great buy","reviewDescription":"Perfect for truck drivers like myself . Keeps your good hot all day until you’re ready to eat.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683158400000}
{"reviewTitle":"Great","reviewDescription":"All I have to say about this warmer is it works great.  I have always wanted something to warm my lunch and a friend told me about this product and I bought one love it. The only reason I gave it a 4 Star is because it takes a little time to get your food ready. It doesn’t get it Kitchen hot but it gets it pretty close. Great product!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"Good to have, not perfect","reviewDescription":"Nice to have to be able to heat something up away from a stove\/microwave. Pretty ideal if you are in a hotel w\/o any amenities. Ive heated a few things, frozen (pre-cooked) chicken, pasta dish, leftover thai food and all suffer the same problem.. soggy and too much water absorption. the pasta and thai both wound up too saturated? with water, very mushy\/overcooked unlike the original prep. Not sure if there is anything that can be done about that. The chicken was soggy too. I am sure there are some things it reheats great, I just havent found them yet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633046400000}
{"reviewTitle":"Takes time but saves searching for a microwave!","reviewDescription":"Im a flight attendant so love the idea of having a way to heat up my meals after a long day of flying. Not all of the hotels provide microwaves and it’s not in my budget to buy meals every night I travel. It does take some time to heat up food (allow an hour at least!) so if you’re looking for a quick meal this is not the gadget for you. (This is why I gave 4 stars instead of 5) I bring my food already in the glass container I’ll be using (instead of trying to transfer it from foil, etc, to the container.) As soon as I get in my room I plug it in. By the time I get settled in, it’s usualy only about a 15-20 minute wait. So if you have the time to wait it’s totally worth it plus it’s safer than a microwave with the added plus of being green!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1518998400000}
{"reviewTitle":"Broken zipper when received","reviewDescription":"When I received the package and looked it over, it is missing a tooth on the zipper. A bit frustrating, but I will live with it as I don’t want to hassle with returning it. As for functionality, I give it 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Doesn't work","reviewDescription":"Not able to heat rice or bread. It takes 5-10 mins to wam, also not enough to feel the rice as warm.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621382400000}
{"reviewTitle":"Good but doesn’t last long","reviewDescription":"I bought this for my dad since he is a truck driver and he loves it. I bought it in June, it is now the end of July and it stopped working. I highly recommend purchasing the protection plan because you will need it!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1532649600000}
{"reviewTitle":"Disappointed in longevity","reviewDescription":"Product worked perfectly for 2 months and then just stopped heating completely! I only used it about 4 days a week so it's not like it was overworked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1597190400000}
{"reviewTitle":"I want one that plugs into the power in the car,  not electric.","reviewDescription":"I returned this item because it isn’t what I want,  you sent another one just like it and I have not ordered the other one yet","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613001600000}
{"reviewTitle":"Broken","reviewDescription":"The container that comes inside came broken. Asked for a replacement and that one also came broken. You will have to find a container that fits inside.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593216000000}
{"reviewTitle":"Durability is lacking","reviewDescription":"Very disappointed.  Bought this for my dad and it’s already stopped working for him. He’s basically used it for three months. Will not heat.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1599436800000}
{"reviewTitle":"Only lasted a year","reviewDescription":"We ordered this a year ago and itJust stopped working. Pretty frustrating that it didn’t last past a year. We really liked it- made traveling with food convenient, it worked just like it said- but guess longevity is an issue.... 👎🏻👎🏻","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1547769600000}
{"reviewTitle":"Broke after 5 months of use.","reviewDescription":"After only 5 months of use it is no longer working. I was satisfied how it worked but am very unsatisfied with the fact that it only worked for 5 months. Would like a return or exchange.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1548374400000}
{"reviewTitle":"It takes more tgan an hour to warm up food","reviewDescription":"It takes way too long to warm up food","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652745600000}
{"reviewTitle":"I love the idea","reviewDescription":"I love the idea.  It worked two times.  Those two times were great.  Will not even get warm now.  I have tried various plugs, the connection etc.  etc.  Still nothing!!  Very disappointed.  I keep hoping it will work.  🙁","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1521331200000}
{"reviewTitle":"A Star for 2 months.....then it died.","reviewDescription":"Worked for 2 months great and now it's dead. It heated up great when it worked but the cable plug does not work anymore. My trucker hubby now left without his portable oven. Really disappointed. I had high hopes for this one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595030400000}
{"reviewTitle":"Takes too long to heat up","reviewDescription":"Husband is a pilot and many rooms no longer have microwaves. This was a great idea but disappointing as it takes an hour to warmup. Useless when u arrive late at night and still need to eat.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635984000000}
{"reviewTitle":"Taking so much time to warm a food","reviewDescription":"I could have brought a 120V. This warmer is very slow to warm up the food. This is suitable in long drive travels only.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649116800000}
{"reviewTitle":"Minimal warmth output","reviewDescription":"The booklet enclosed with the unit indicates a warming temperature of 165 degrees.  The unit I received warmed a thawed veggie burger to 77 degrees after one hour.  An egg was runny after 30 minutes.  Kept it on the warmer for another half-hour, it was finally soft-cooked.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1589500800000}
{"reviewTitle":"Only worked for 3 months exactly.","reviewDescription":"Ordered this in February for my husband and it already stopped working.  He loved it but with a 3 month time it,  it's not worth it. Disappointing for sure. I don't recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621814400000}
{"reviewTitle":"The electronic portion of this product is poorly designed","reviewDescription":"Bought this a few months back and have only used it about 4 times so far.  Went to plug it into my car and the damn tip broke off. This product is so poorly made. I would not recommend it AT ALL","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1622678400000}
{"reviewTitle":"DID NOT LAST 5 MONTHS","reviewDescription":"I bought this item in October 2021 and the Hot Logic didn’t even last 5 months. I hv to get myself a different brand","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1646697600000}
{"reviewTitle":"Was great...for a while","reviewDescription":"This lunchbox worked great for my boyfriend for a while and then one day the adapter literally just melted. It was really weird and now it is unusable. We’ve had it less than a year :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619308800000}
{"reviewTitle":"Smaller than expected","reviewDescription":"It appeared much larger than it actually is. It’s the size of a personal lunch box. Not what I expected. Was hoping I could put a casserole in it. Nope.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640131200000}
{"reviewTitle":"got a few uses out of it before it died completely","reviewDescription":"Not super dependable","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677974400000}
