{"reviewTitle":"VR Is Not Just For Kids.  Everyone Should Have One of These!","reviewDescription":"I’m truly amazed at how awesome this Occulus Quest 2 refurbished headset is.  It’s the same as the Meta Quest 2, but it has the old logo on it.  It’s also discounted about $50, which is why I decided to finally try VR.  I don’t know why I waited so long!  Oh, I know, most of us probably think VR is just for kids, or we don’t like shooting games, or we get motion sick and all that jumping around would be too much for us.  I know, that as someone who’s considered, well elderly, I should just stay away from this nonsense and leave it to grandkids, right?  That is so wrong!  Sure, there’s a lot of violent shooting games available and you could easily make yourself sick riding roller coasters in VR, and there’s a lot of potential for people to abuse community spaces and bully others, but that’s just a tiny portion of what VR opens up to you when you put on a Quest 2 headset.  I’m the first to admit, I had my reservations, but although I’m old, and disabled to boot, I don’t think you ever get too old to try something new, especially something like this that lets you experience things that you’ve never experienced, without having to leave the comfort of your home.  You don’t have to climb mountains in VR, but with this headset you can if you want to.  You can come pretty close to the experience without actually plummeting towards the earth when you jump and miss your handholds.  The view are spectacular in that particular game, but I had to return it because although it says you can play it sitting, I couldn’t really do it from a wheelchair.  That’s not a problem, though, because if you purchase most games or apps you have the option to return it within 14 days, providing you haven’t spent over a certain amount of time using it.  But there’s plenty that even someone as limited in physical ability as I am can enjoy in VR, thanks to this fully self contained headset.  With the Quest 2, you don’t need to be tethered to an expensive gaming computer, and there are things that anyone can find in VR that will amaze and astonish even the most unflappable person.  Right now, there are a wide variety of games and apps, some free, that no matter your age or interests, you will be able to find things that make you say, “Wow!”.  You can get an app that allows you to go anywhere in the world, similar to using Google Earth, except that you find yourself being able to look around as if you were there at a famous landmark or your childhood home.  You can take guided tours to places you probably didn’t know existed, or take a tour of the Space Station and see how the astronauts live and work there, go swimming with whales or watch gorillas play in a jungle.  You can meditate, play musical instruments, meet people with similar interests, take courses, draw and paint in 2D and 3D, play golf or dance, surf the internet, or one of my favorite things so far, sit in a movie theater and get the feeling of truly watching a movie on a big screen while actually being comfortable at home.  I know that sounds unusual, but for someone like me who hasn’t been able to go to a movie theater in many years, it’s a truly awesome experience.  I haven’t had my Quest 2 long enough yet, to convince friends and family to join me in VR, but if they do, we can watch movies or play games together in a variety of settings.  For me, the neatest game I’ve discovered yet is VR Fishing!  It’s so relaxing to fish in real places in Japan, South Korea, or the Northwestern USA, in a variety of weather conditions, from shore or in boats, and to catch fish and put them in your Aquarium in your fish lodge.  It’s a nearly magical experience to feel as if you are truly getting a nibble to catching a fish that looks so real that you can forget for a moment that you’re at home, and you feel like you’re actually sitting in a wooden boat in the rain and mist at a lake in the mountains.  VR is awesome for everyone, but especially if you or someone you know loves to travel or fish, or do any number of things but you find yourself unable to enjoy such activities anymore due to physical limitations or even monetary restrictions.  VR is a great way to expand possibilities beyond what’s easily available.  If I were younger and healthier, my dream job would be to bring VR to as many people as possible, but especially to elderly and home bound or disabled folks whose lives are getting narrower and restricted.  VR can expand your environment in ways that have never been possible before.  Quest 2 is relatively affordable, easy to use, and it will only get better as more people expand their lives into the VR environment.  I was surprised at how easy it was get started, and I was able to do most of it right from within VR.  Is it perfect?  Absolutely not. It’s a bit of a money pit.  When you buy the Quest 2, you get a headset, two controllers, and a charger cord.  That’s all.  The controllers are battery powered.  If you want rechargeable controllers, you’ll likely need a charger base with rechargeable batteries.  You’ll almost certainly have to get a head strap because the one that comes with the Quest 2 headset is minimal and it feels like the headset is going to fall off no matter how much you tighten it when you put it on.  If you want to balance it better and give you more playtime, you’ll need a head strap with a battery.  Unless you invest in a charging station, you’ll probably want a case, and lens covers because you can’t allow sunlight to hit the the lenses because that could burn out headset.  There are other helpful accessories, such as controller covers, lens cloths and covers, possibly a fan to keep your glasses from fogging if you wear glasses, or you can buy prescription lenses here on Amazon, or other accessories.  Some are more necessary than others, and depending of what you use your headset for, you may not need every possible accessory.  At this moment, as fun as VR is, it’s still in it’s infancy, but it’s usefulness to others besides video gamers is growing every day.  Meta Quest 2 is probably the most useful and affordable stand alone VR system available, and there’s plenty to be found in it.  I’ve barely scratched the surface of what it’s capable of doing, and I think that even old folks like me, who might be initially reluctant to try it, can find plenty of awesome things to do if we can be persuaded to try it out.  I’m kicking myself that I didn’t buy one the first time I saw it, because it would have made my pandemic isolation a lot less isolating.  I wish that something like this would have been available when my dad was confined to bed and a wheelchair after his stroke many years ago, because he loved to travel and learn new things, and VR opens up the world to exploration without even leaving home.  With the Quest 2, exploration is easy and fun.  If you’re thinking of trying it out, for yourself or a gift for someone young or old or in between, there’s never been a better time or a better and more affordable device than the Meta Quest 2. [Edit] [Addition] I recently got new glasses, and while it comes with a spacer for glasses, I was using it without glasses because since I had cataract surgery and I thought my vision was good enough without wearing glasses.  Although my distance correction was minimal, nearly the smallest size available, I got a great Black Friday deal on prescription lenses that snap right on to the regular lenses.  This turned out to be one of the best accessories I've bought for my Quest 2.  I highly recommend getting these, as long as your distance correction is a negative number.  I hadn't realized how much I was settling for by not wearing my glasses because I found it uncomfortable.  Now my vision is really crisp, and if someone else wants to try my headset, the lenses snap right off so they don't have to look through my prescription.  I'm still enjoying my headset nearly every day.  It's even got Amazon Prime Video available to watch on a big screen, which is a favorite of mine as I'm a Prime member.","isVerified":true,"ratingScore":5,"reviewReaction":"381 people found this helpful","country":"United States","date":1667174400000}
{"reviewTitle":"Absolutely Worth It","reviewDescription":"I first want to start off by saying not only do I love the product but I'm really impressed by the seller. I was really worried about buying this refurbished because I didn't know what to expect, however if I wasn't the one who paid for it and saw \"refurbished\" I would have thought it was brand new. It came In a sealed box, with all the plastic coverings, stickers to remove, everything, just like a new one.I did purchase this for my son, who is only 12. I was a little worried about the people he could interact with but I was very happy to see that there are settings where you can set it for children to use, there are setting to approve if he can interact with strangers or not as well. Lastly, the most reassuring thing, you can download the app, allowing you to view and hear everything that is being done in the Oculus, from your phone, allowing you to see\/hear what they are doing.I also really appreciate the fact that even though the transaction was marked 3 days in a row by my card company, not allowing the transaction to go through until day 4, my transaction wasn't cancelled or sent to someone else.My son saved up for 6 months to buy this, he worked his ass off in school to get A's to get money and worked his ass off ay home to earn money from chores, I can confidently say, it was very much worth it. He's so happy with it, there are so many cool games and easy to find free ones.It's a great product over all and I can't express how amazing it was being refurbished, If you are on the fence about thispurchase, I sat go for it. It's so fun and worth it, it's fun for everyone in the house ranging from the kids to the adults. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"Amazing product for it being renewed!","reviewDescription":"I love my meta\/occulus quest 2. Also, no need to have Facebook to play games! I initially didn't buy it because of that. Overall I give this a 9\/10!About the console:Set up: Setting it up is quite easy. Depending on your wifi speed, it can take up to 15-30 minutes. You will need to make a meta account. I use my phone and linked it to my device. My device needed an update, so expect that, as well.Battery life: Impressive battery life. My oculus lasts up to two weeks (average 30 minutes play time daily). The controllers do need batteries after the ones included die out, but there's third party sellers who are using rechargeable batters and stations. I may invest in that. The charging takes up to two hours, at most.Controllers: They feel very comfortable to use. It feels natural to use compared to other VR consoles (PSVR1--btw, I am a Playstation fan, but the move controllers suck). For Nintendo lovers, they have ABYX buttons (I also love Nintendo).Graphics--They are pretty good for an entry level VR. I feel immersed playing. The colors are vibrant. Do not expect them to be super higher graphic like newer VRs (this did come out around 2020\/2021). I'm sure the Meta quest 3 will have advanced graphics.Immersive--This is where I feel Meta's VRs take the cake, especially the Quest lineups. Wireless playing is soooooo much less of a hassle compared to using cords, and cables. I can also stand, jump, walk around, and feel like I'm part of the game. I can also sit and play some games when I feel lazy. In other words, I have a choice. This is where it really sold me with the Meta compared to my PSVR1 I used to own, and why I didn't buy a PSVR2. Also you can take it with you for others to play (will need to buy a travel case)! You also have a \"home base\" you can customize. From futuristic, to a secluded resort, to a Kyoto resort (this is mine currently), I found it very relaxing to do that. I also love the different avatar selections you can use and they have a wide range of diverse choices.Comfort--This is where I feel the meta does lose compared to the PS lineups and other lineups. I cannot play it more than 30 minutes without getting a headache. The solution is to buy an elite strap, but why not just make it comfortable to play with from the get go? This is where the minus one point comes from.Games--Now the fun. I'll be honest, Sony outdoes the quest with RPGs and shoot 'em ups, in my opinion, but the quest outdoes Sony with social and casual games. So, it depends on what you want out of a gaming experience.I hope this review helps someone out there thinking between a Quest vs PSVR, likes to compare the two, or is hesitant with the whole Facebook thing.","isVerified":true,"ratingScore":5,"reviewReaction":"84 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"BEST THING EVER!! SEEMS BRAND NEW!!!","reviewDescription":"This Is So Awesome! I Should Have Gotten It Sooner! My Son Is 6 Years Old & Loves It & Is More Active! He Took Off The Headset Earlier & He Was Dripping Sweat! He Is Having So Much Fun, He Doesnt Even Notice How Much He Is Working Out At The Same Time. When It’s Cooler Outside He Stays Inside On His IPad. This Is A Great Alternative! Came In The Original Package, All Original Pieces & Accessories! Best Purchase. Only Bad Thing Is, The Lack Of Games On It For A 6 Year Old. So I Have Had To Cave In On Some Gory Ones. Hopefully More Games To Come!","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Fun for older folks, too.","reviewDescription":"I was impressed from the moment I put it on. The VR experience is immersive enough that a rock climbing game greatly reduced my acrophobia.I'm in my mid-40s and was a computer geek from age 7 but I haven't cared to play games for 10 years. I bought this on a whim, half-expecting to return it out of lack of interest. Instead, I get countless hours of entertainment out of this thing each week, and I've mostly only used it for games, so far. You can watch 3D movies and documentaries, use all kinds of productivity apps, enjoy endless travel videos, witness celestial events and anything else you can think of. Most services like YouTube and Netflix have an app for the Quest, and those that don't can still be accessed through the web browser.The Quest has an app store with free and paid content. Additionally, you can access free VR games through websites in the browser. You can also link the Quest to your PC to play some of your computer games in VR, and you can access quality VR games through your PC via services like Steam.I recommend this for lovers of non-physical games of any type, including card and board games. And it's worth considering the Quest+ subscription. For $5\/mo you get a bunch of premium games that would otherwise cost hundreds, with new ones rotated in each month.I think people with mobility problems could see a real quality-of-life improvement from this machine. With the built-in microphone, lonely kids will benefit more from this device than from other multiplayer game systems where communication is not verbal and auditory.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Move and sweat","reviewDescription":"Okay, weird title, right? Hear me out.One of my kids gets a lot of movement being in taekwondo and playing outside. However, two of my kids were starting to scare me with how little they moved in non-school hoursThis is awesome. They play Gorilla Tag and some wizard game and they move around, flinging their arms around, and they play so hard they end up all sweaty.Would it be better for them to get outside and play out there? Definitely. But sometimes I'll take what I can get when I don't feel like arguing the point.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Meta Quest #2","reviewDescription":"We are very happy with this item.Like new,works great and the price was very reasonable.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Amazing!","reviewDescription":"This is my first experience with modern VR after the disappointing attempt back in the '90s. For me the Quest 2 was the right balance of cost vs quality. I am a lifelong PC gamer and this exceeded my expectations as a standalone unit and even more so as a PCVR device. Out of the box the experience was better than expected but, If you do your research and learn how to use the settings I would find it difficult for most players to be disappointed. Even quite a few of the standalone apps have impressed me. This is highly recommended for any first time VR enthusiasts who didn't want a huge first time investment. Plus the Amazon premium renewed is worth it for the year return.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Love it","reviewDescription":"VRchat has traumatized me but I keep going back anyways so it much be good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Great product","reviewDescription":"Everything you would expect great product, I recommend getting a cloth head strap for better comfort","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Picture isn't as sharp as I would like.","reviewDescription":"This is my first VR Headset. It's amazing to see how far tech has come. It's such an awesome experience, I'm contemplating getting the Apple Vision Pro. The controller technology is amazing. It will impress you. I did find that the resolution and in the image isn't as crisp and sharp as I would like it to be. But that doesn't deter me from using it. It's a very fun device. If you've never played VR, games with a lot of movement will cause nausea...keep this in mind. The store has a decent variety of games but they can be pricey and some games require a subscription...keep this in mind too. Overall, I do recommend this product!On an added note: This is my second purchase as Amazon Renewed and I must say that it has been a two out of two excellent experience. The product was packaged just like it was new. It even had the plastic linings that a product from the manufacturer would have. It had absolutely no signs of use or blemishes and It has worked flawlessly.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"So super cool and unbelievable!!!!","reviewDescription":"Where do I start with this VR system it is so great I love how it makes everything so 3D! When you look inside of it it looks so real! The handles are easy to control in the headset fits your face really well as long as you had just the straps! You will sweat though a little bit after you wear it for a while so don't wear it for too long. I do wish that it fit better on kids heads because the first we put on our kid it fell down and cracked because her head was too small. So maybe they could Implement some smaller straps for children to make it kind of more Universal that would be great you can't see on the outside which works well. I wish it would have came in a different color as well White straps seems to get dirty I would have did a gray or a navy blue or black in color also I would have wished they had more storage for the price. The price could have been a lot more cheaper and affordable for everyone!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Kids love it.","reviewDescription":"It's a nice setup no match for my Vive HTC Pro. But they're young and this is good for them keeps them happy. Exercise, learning and expands imagination get them neurons pumping LOL","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Works great for renewed quality","reviewDescription":"I bought the renewed version as I didnt have the money for a brand new headset, and this came with some of its own issues. The controllers werent properly linked and it was a struggle to relink them through the oculus app, but I somehow did it after a couple hours of messing around with it. Now it works as great as ever, I don't think the battery lasts as long as it should but I could be wrong. I do experience small issues here and there but I honestly can't tell if it's a Meta\/Oculus software issue or it's an issue with the headset.  Overall I don't regret my purchase and I use it very often.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Great as a cheap option for VR","reviewDescription":"Compared to some of the higher end headsets it gets blown out of the water, however at the price point it’s impossible to beat! You can also link it to a pc and play an even wider selection of games however there may be some delay when using it wirelessly.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Mi honesta opinión sobre el producto","reviewDescription":"Lo utiliza mi hijo ya por un tiempo y le ha gustado mucho por ser liviano y queda bien ajustado en el rostro…","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Ok","reviewDescription":"Ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"trash battery life","reviewDescription":"it works perfect- the only thing that sucks is the battery only lasts you an hour at max. had i known this when i bought it i probably wouldn’t of gotten it. but there are some good battery attachments you can buy for it- which i HIGHLY recommend if you don’t wanna wait for 5 hours for it to completely charge and then it drains in one hour.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Pretty cool","reviewDescription":"Its pretty cool, A bit hard to navigate and still has some bugs to smooth out, the battery does not last as long as I was expecting.  Id probably recommend getting the newer version.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Review of the Meta quest 2","reviewDescription":"This product was better than my wildest imaginations very happy with the results and graphics but the battery life could be better","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"AMAZING","reviewDescription":"My kids absolutely LOVE this!! It’s super easy to use and so realistic!! Would definitely recommend","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Fun to use","reviewDescription":"Had this for almost a year now and it's really cool. The battery lasts somewhat long depending on what game you play. For me it lasts anywhere from an hour to four hours. In the winter the lenses are prone to fogging up if you sweat right away and it makes everything blurry. Do make sure you have space while playing because I have punched my ceiling a few times, bumped a wall, and punched a support beam which really hurt. I've experienced a little stick drift on the left control and sometimes, somewhat rarely, the headset refuses to connect to my Wi-Fi despite everything else connecting. Really recommend buying beat saber and contractors (it has black ops zombies) if you buy a headset. Really good substitute to a warmup for your workout if you play with a fast pace.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Very good!","reviewDescription":"Good price,  good quality,  came in time. Thank you.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Works perfect!","reviewDescription":"I've had it for about a year now and it's still in perfect condition! No problems with it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Great quality","reviewDescription":"I like how high quality it is.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Perfect","reviewDescription":"Item was delivered as described and my son has played it everyday since it arrived with no issues. Received it about 2 months ago. Works perfectly. Thanks!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Easy To Figure Out","reviewDescription":"Not overwhelming and easy and fun to use I wanted to use it for social media and it works for everything except Snapchat, Insta And X Are Available And Work Very Well It’s Like 3x The Normal Size You Will Be Shocked Great Purchase And You Can Still See Thru Like Any Other Just It’s Only in black and white so if you want color get the next one up but it really is a fun experience eye sockets move to match your eyes and glasses extender for those with glasses like my wife","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Quest 2","reviewDescription":"Omg this is freaking amazing. I got it for my son but he let me try and I was in a room that was so beautiful it literally took me away from reality for a few moments. Was awesome!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"This appears to be completely new... except for","reviewDescription":"…a few small coffee or tea stains that was easily wiped off. I noticed no residual greasy or dirty film on the headset itself. It appeared completely new and all the protective labels and protective wrapping were still on it. The silicone and foam appeared as new also, while the silicone face ring was still in the original paper sleeve.The headset arrived with about 45% state of charge, I set up as new and installed Gravity sketch for work and did all the usual FB login stuff and it was working within minutes. After I was done with the setup, I charged it fully and the battery did get to a full 100%, even though it was noted that these were at least able to hold 90% charge from new. The entire box arrived as a new one would, but the tape seals did indicate that the item was refurbished.I’ve added some anti-slip hexes and cat tongue tape in the photos, as these are the only photos I have of the unit. The addition of these helped grip so much, there’s less fatigue for extended sessions from gripping the hand units too tightly or fear of them slipping out of your hands. I’m not a fan of the silicone sleeves or socks that add too much thickness, and even weight, especially when used in 3D sketching and modeling, where slower and more precise movement is required.Totally worth it if you get a good one and the full warranty and packaging are \"as-new\".  Saved myself $50 for a tool that's needed for work while I return the one I've been borrowing for Gravity sketch training for auto design modeling.  BTW, Gravity sketch is an amazing tool that's quite powerful.. The games and apps available are amazing as well.. very excited to try out the other capabilities and apps with this Quest 2!","isVerified":true,"ratingScore":5,"reviewReaction":"70 people found this helpful","country":"United States","date":1644710400000}
{"reviewTitle":"It's really good","reviewDescription":"I liked it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"incredible value","reviewDescription":"It's amazing what this unit does for the price - true high-frame-rate \/ low-latency virtual reality - not only the headset, but the controllers as well. We've been using it with the Reflexion Go app for improving basic cognitive abilities for sports.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Love this","reviewDescription":"Great buy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Loved it","reviewDescription":"My daughter loves these. She plays with other kids at school online. It’s definitely a great buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Love the product","reviewDescription":"Is is so cool to play","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Enjoys it!!","reviewDescription":"Gaming!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"These are really cool.","reviewDescription":"My wife and I bought one and figured we would give them a try.  They were so cool, we bought another one.  You can play with friends far away and it seems like they are right there. An awesome set.  I have recommended these to other people and will again.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Lots of fun","reviewDescription":"Kid plays it all the timr","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Fantastic Refurbish","reviewDescription":"The refurbished Meta 2 I received was in great condition. It was in the original box & looked brand new. I've had mine for a few days and it's a great, fun workout! Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Love this VR headset","reviewDescription":"Works perfect. Looks fantastic and performs very well. Much better than it's predecessors.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Great service","reviewDescription":"This is such a cool affordable, let's call it a toy. I have now been around the world I have been skydiving flying mountain climbing all the things that I cannot do due to physical restrictions and I did it all from the comfort of my living room. Such great graphics and just mind-blowing quality and VR content available. Haven't spent money on games yet but soon to come. I had a problem with the objects being a little blurry and a discoloration on my first set but without question or reservation I made a note of it and I was promptly sent a new Oculus. Can't be happier with the service I received and it's just absolutely mind-blowing fun for a very reasonable price. And the initial intro, they have some silly things to get you acquainted with the controls, I spent almost 5 hours just playing alone in that area.","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1650931200000}
{"reviewTitle":"How can I say?","reviewDescription":"The battery will run out quickly.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Price","reviewDescription":"Working great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680998400000}
{"reviewTitle":"Expensive plus then you have to purchase the gamez.","reviewDescription":"Love this tons of fun for my niece but definitely hurts your eyes easily. Plus, for as much as it cost how come there is no free games?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662940800000}
{"reviewTitle":"Brand new with minor detail","reviewDescription":"Everything seems brand new outside.One or two dead pixels in the right screen in the same spot, unnoticeable in most games but you see it in white or clean environments.Battery last around 2 hours.Lenses are little bit blurry but I guess is normal","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1651968000000}
{"reviewTitle":"Incredible","reviewDescription":"I've loved it so much. The only problem I encounter is sometimes when it starts, it gets a little lag. No more issues, really good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"I didn't know that this VR was refurbished and that's why it had a lower price","reviewDescription":"I didn't like the fact that I did not know that this was refurbished and that's why the price was lower","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"fun","reviewDescription":"alot of fun for both adults and kids","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"CAN'T CHANGE MIC?!","reviewDescription":"unless you connect it to your desktop it's useless to try and use a different mic.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1666137600000}
{"reviewTitle":"A lot of fun and interesting events with oculus","reviewDescription":"The goggles get a little warm but boy what fun you can have wearing them!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"A great experience.","reviewDescription":"A great experience. The headset adjustment is tricky. Something for meta to improve upon.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1663891200000}
{"reviewTitle":"good battery life","reviewDescription":"this replacement headset arrive the next morning after being ordered.  I has a like new condition and  work welll","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"don't get if you have motion sickness","reviewDescription":"These things are awesome. It feels like you are in the game. If you have motion sickness I would strongly advise against not buying.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1686096000000}
{"reviewTitle":"amazing came in original packaging","reviewDescription":"its works its good what else is there to say there is no problems with it no scratches its in perfect condition a little pricey and wish it came with everything like the usb link to connect to a pc its crazy you are spending all this money and companies still cut corners and you will haft to buy it separately if you are a pc gamer like me and wanted to use it with steamvr trust me airlink is not good at all","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"AMAZING! But...","reviewDescription":"This is the best item I have EVER BOUGHT! The only complaint\/downside to this is that since it isn't brand new, some of it's functions are glitchy and don't work well. For example the hand tracking and casting to your device. Overall AMAZING, though it can be improved a lot.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"I would give it 5 stars but…","reviewDescription":"The headset is great! Everything is clear, smooth, blazing fast. But the only reason why I’m not giving it 5 stars is because of the head strap. It’s so uncomfortable and needs to be seriously adjusted and modified.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Purty gud","reviewDescription":"Very fun, but battery life is terrible definitely need a battery pack extension but overall it’s fun to play with your friends and tracking gets lost sometimes but a majority of the time everything works smooth and is a great way to hang with friends","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Good For the Price","reviewDescription":"While there are other VR Headsets on the market that far exceed this one the value to price ratio is pretty fair, just expect to replace the head strap as the factory one is garbage especially so if you have smaller children. also requires meta which is a whole other issue.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1666828800000}
{"reviewTitle":"Controller problems","reviewDescription":"I like the apps\/games…. But the controllers needs some work","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Works good","reviewDescription":"Kids loved it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"Amazing but data storage doesn’t work very well","reviewDescription":"I love my quest so much! I would say it’s 100% worth the price BUT if you have a few extra dollars to spare please get the higher storage- I can currently only have 3 large games saved on my device!!","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"A Good Standalone VR Headset but Not Great for PC Use","reviewDescription":"This was my first time using VR since the first gen Oculus Rift, and while this headset has massively improved in terms of optics, screen quality, sensors, and more, the PC experience got worse. However, before I get to that, I do want to say that this renewed unit was virtually brand new. It came in the original box, and all the accessories had brand new packaging around them. Even the headset itself appeared as new, without any scuffs, scratches, hair, dust or anything of the like.The setup was very easy to do and only took a few minutes, although I did have to get some assistance from online help on Meta as the Touch controllers would not initially pair to the headset. The headset is very easy to put on as it features an easy to adjust fabric strap, an optional silicone liner, a glasses attachment for those with glasses, and a three-way IPD adjustment. Once done with the setup, the Meta Quest storefront offers a lot of apps, but I found that it lacked a significant amount compared to when I had the Oculus Rift years ago for my PC. This could be due to the limitations of the Quest 2 when used standalone, so I didn't initially think much about this.Now, in terms of the quality of the headset, the lenses are way better than anything I was used to previously. The screen door effect was almost entirely gone, and the inner display was able to deliver a brighter image with better color reproduction. The only thing that hindered it was that, despite having much sharper and clearer optics, the actual resolution of the games did not look that great when using it on its own. So, to me, it was like seeing super clear but very bland graphics with a lack of detail. When using it with my PC, this was a different story as the games I was able to run looked way clearer and more detailed than anything from the standalone mode and I was impressed, at first. The audio was also impressive. The audio comes out of built-in speakers in the straps and they do an excellent job at delivering high grade surround sound audio with surprisingly very little noise bleed. Even at max volume, others in the room around me could only barely notice the audio coming from the headset.I also loved how great the cameras on the headset were able to track my movements as it really did feel immersive when using the headset on its own. The touch controllers are fluid and responsive, and most games feel like you are actually there and interacting with your surroundings for real. Additionally, the guardian system does a great job at creating artificial boundaries that you can see in-game that prevent you from ever worrying about running into your surroundings.However, when using the headset in Standalone mode, the built-in battery drains FAST, like extremely fast. On a full charge I was lucky to play games for about 2 hours before it needed to be plugged-in, and that was only on most games. More intense games like Beatsaber, that number would drop to around 1 hour 30 minutes of playtime per charge. Once again, this isn't an issue when using it with a PC as the Link cables can maintain and charge the battery while you are using it.Now, let's get to my main problem; PC Gaming. While I initially loved the concept of using this as a standalone headset with the option of connecting it to my PC, I found that this created an absolute mess compared to the older Rift. The setup was very tedious in the Oculus app to start as it initially kept saying my Quest Link cables were USB 2 and not delivering the required bandwidth. I tried many different cables, even the official Meta Quest Link cable, and it just did not work. I eventually found out that this was an error due to me using a 7900 XT GPU which was not officially listed on the list of supported graphics cards. I then tried setting it up on my backup gaming rig with an older 6600 XT GPU and it worked perfectly there. From this point I used the backup PC to set up the PC side of things, and all seemed well- until SteamVR got involved. Personally, I own way more VR games on Steam than I do on the Oculus store, so I followed the steps to get SteamVR working to play those games. At first, it all ran smoothly until it didn't. While I was able to get SteamVR working on the Quest, it only detected some of the games I had and not all of them- which was a lot that was missing. For the games that were missing from the SteamVR dashboard, I would then have to add a shortcut to my desktop and then use the \"desktop\" mirroring ability in the Quest to view my desktop in the headset and then use the controllers to manually open the game from the Desktop. However, this only worked some of the time and not all of the time as sometimes either the Desktop preview would freeze or lose signal, or the games wouldn't open at all, or the game would open on my PC but not open inside the headset.Overall, this is a very capable headset, but since I can't use it well with my PC which is what I primarily got it for, and due to its subpar battery life in standalone mode, I had no choice to return it. While I am impressed at the brand new-like quality of the headset I received, I honestly cannot recommend this headset for PC use (unless you ONLY use the Oculus store and NOT SteamVR). For everything else, it's okay, but it's just not for me. Hopefully the next gen Quest headset can improve this.","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"Drift stick","reviewDescription":"I like the meta 2 for what it is but my controller has been experiencing a significant amount of drift and it’s getting frustrating","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Fun and Exciting, but Not Without Its Flaws","reviewDescription":"So, I recently got my hands on the Meta Quest 2, and I have to say, it's a pretty cool piece of tech. It's a fun and exciting way to experience virtual reality, but it's not without its flaws.On the positive side, the Meta Quest 2 is a blast to use. The graphics are crisp and clear, and the tracking is spot-on. It's also very easy to set up and use, which makes it a great option for both experienced and novice gamers.Another great feature of the Meta Quest 2 is the variety of games and experiences available. There's something for everyone, from action-packed shooters to calming meditation apps.However, there are some drawbacks to the Meta Quest 2. Firstly, the battery life is not very impressive, and it tends to drain quickly. This can be a major issue, especially for those who want to use it for extended periods of time.Additionally, the device can be quite heavy and uncomfortable to wear for long periods of time. This can be a major issue for those who want to use it for extended gaming sessions or experiences.Moreover, the price of the Meta Quest 2 is also a major drawback. It's quite expensive, and the additional costs for games and accessories can add up quickly.Overall, while the Meta Quest 2 is a fun and exciting way to experience virtual reality, it's not without its flaws. The battery life, weight, and price can all be major drawbacks for some users. However, if you're willing to overlook these issues, the Meta Quest 2 can provide you with hours of entertainment and excitement.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Hardware is great. Software meh. Games are great.","reviewDescription":"It’s astonishing that Facebook is a user experience company and they just flopped so hard on the software design (while nailing the hardware, which, to be fair, they purchased). The quest 2 has multi user setup, but one person has to be the admin, and that person can share certain games with shared users, but other accounts can’t. What. Also, only the admin can stream (to a tv, to the internet, to the app).So if I’m the admin and my gf adds an account, I can share beat saber with her, but she can’t share it with me. I can play on my account and stream to the tv, but if she wants to play on hers (to keep her scores separate), she can’t stream because she’s not an admin. And as an admin, I can’t tell it to stream her view because it’s not my account.If you buy this to play with your child, you can’t watch what they’re doing (to enjoy with them, to monitor their online interactions, or even to troubleshoot). They have to play on your account… so why even have separate accounts…?Some of the dumbest decisions I’ve ever seen in software. My god.However, the hardware is amazing and even has a no controller mode where it maps your hand movements via front camera. The games are arcade style fun, with lots of dancing, swinging swords, punching the air, and shooting games. The frame rate is high enough that I don’t feel sick even when the scene is moving very fast. Really solid experience outside of facebook’s OS.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Fun that doesn't last","reviewDescription":"When I had first bought the headset I had a lot of fun on the games I had but later on I found there is not much replay ability to any of the games. It was fun for the first few days but it seemed more like a chore after a while. There is not a lot of games with just the base headset. I would only recommend getting it if you have a PC to get other games not available on the oculus store.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Need to use Insurance, both controllers broken","reviewDescription":"Worked fine, just controllers are both broken. Need to access 3yr insurance I purchased w\/ Occulus. Can someone help plz","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Works great except for the software","reviewDescription":"The software is being a pain and not working with stuff the headset it’s self work the software doesn’t it needs to be fixed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"It is what it is I guess","reviewDescription":"The item is exactly what it is supposed to be now here is the down side to buying a refurbished one directly from Amazon they are not COMPLETELY refurbished aka the battery and joysticks or even the face plate (I think it was a return and not a refurb) the face plate REFUSES to stay on once you are done it falls off and you have to put it back on and hope you have it just right when you are ready to use it again....the right joysticks is a drifter (not EXTREMELY bad but noticeable) and the big one you get maybe an 45 mins of game play and that's playing non stress games or gathering rooms.....if you are doing fitness beat sabers boxing so on well you MIGHT get your 30 in if you are fully charged.....I personally don't use it everyday or for a LONG time but that's besides the point....but I have 11 months to decide to just deal or send it back and hope a replacement is better that's a 50\/50 shot OR get a refund and just spend the extra 50 on a NEW one.....might update review when I decide what to do","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Is getting Old","reviewDescription":"I had this oculus quest 2 for about a month. The first experience as a newcomer was kind of neat and enticing. However, this all changed when you sit down and see that the actual quality of the strap is horrible and the lenses eye levels all hard to adjust. To add on, the screen pixels are noticeable and will probably give you some motion sickness. At this point just get the new improve version, since apparently is so much better. Battery life also was MEH, and PCVR function as intended, Air link also but that all depends on your WIFI connection","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"Cool…","reviewDescription":"So far, pretty cool, however, these really don’t work well with my glasses. No matter how much I adjust, there’s always some part of the view in each eye that is blurry. I’ve tried with two different pairs of glasses. A different type of strap might help or I might have to order the specialty prescription lens inserts. Not sure yet.Also, I’m sure not everyone will have this issue, but I got really really nauseous after using it the other day. Almost to the point of throwing up. I might need to just try some nausea medicine or something but if I can’t find something to help with the nausea and the glasses issue, I might end up returning the headset.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Not bad, but could use work","reviewDescription":"While this is a Meta device, there are some hoops to jump through to get it connected to your desktop and Stream. Once tackled, everything is pretty straight forward. Ultimately, it is an amazing experience degraded slightly by discomfort.The head strap is terrible. Replace it with another (I picked up the Kiwi Designs one here on Amazon). Most of the pain is now gone, except for the eye strain.I waffled between 3 and 4 stars on this. There's no seemingly breakthrough apps beyond a handful of great games to be had. There's a definite awe-factor when playing Elite Dangerous or No Man's Sky in VR.  Using Desktop mode in the Oculus gives you a giant version of your PC desktop - but given the eye-strain, I'd rather just use my physical monitor.Overall - if you're a gamer, there's plenty of things to try with the two aforementioned games being pretty good things to pick up on sale. For the broadest consumer appeal, this is going to take a few more generations to hit the sweet spot for pain-free performance and utility","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"This was super amazing they enjoy it","reviewDescription":"The will not stop asking to play they love it it’s pretty high quality and they LOVE IT! 😍","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Love it","reviewDescription":"It's really good, I just wish it had more battery life","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Amazing","reviewDescription":"At first I thought I ordered the wrong one but it doesn’t matter! It is amazing and fun to play with","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Mostly good","reviewDescription":"There's a lot to say about VR in general and this product in particular.I would recommend everyone that is not familiar with VR to study the potential downsides carefully. In particular it can give you nausea, which varies from person to person and can be overcome by some people and not by others. The experience itself can be amazing. On the other hand, I'm finding I don't use it as much as I hoped (and I have previous version of a VR headset) because the apps are very limited. I probably wouldn't buy it again for that reason alone, though of course that's not a criticism of the headset itself. Look it up before getting into it if this is new to you.The product itself is good. I have had no problems with it, once I got it set up, which can be a little tricky. I use it mostly plugged into my gaming computer, which gives a better experience compared to using it on its own. To do that you need a very powerful (and expensive) PC. That's not to say that the unplugged experience is not acceptable. It is. Value for money is excellent compared to other offerings.","isVerified":true,"ratingScore":4,"reviewReaction":"26 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Missing","reviewDescription":"Why would the battery cover be missing? I understand that the item is (Renewed Premium). Not cool!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Great for the price!","reviewDescription":"This is my first VR headset, so I don’t have anything to compare it to. Thus far I’ve been very impressed with the capabilities of the unit, especially for the relatively low price point. As a self-contained unit, it’s actually nice not to have to worry about connecting to a phone or anything like that.  The game selection is pretty good, and the head and hand tracking do a great job in providing an immersive experience. The one drawback I have noticed is the adjustments for the display are limited. Essentially the only adjustments you can make are how far apart the eye pieces are. I would like to see more adjustments that would allow more fine-grained control of the picture quality.I would definitely recommend this if you’re interested in experiencing VR, as the system is very easy to use and approachable for a first time user, but provides the feature she would expect for heavy duty VR gaming and other applications.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1656979200000}
{"reviewTitle":"As expected","reviewDescription":"The head strap sucks, face cover is a good bonus(I have sensory issues with the texture under) graphics performance is okay-ish. It really sucks that the usb-c cable for it is $80 but otherwise works as intended","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"My son loves these","reviewDescription":"My son bought himself the refurbished version of this VR headset. He was disappointed to find that there seem to be scratches on the inside of the goggles, but has decided it doesn’t interfere with the functionality. They work great, the scratches aren’t visible during gameplay, and it was a very good deal, so he decided to keep them.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Didn’t like it","reviewDescription":"Not my thing so I sold it, but it was good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Perfect Christmas gift.","reviewDescription":"I bought these for my adult children this Christmas. Everyone was very excited and loved using it. Thinking of getting one for myself.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"Came as advertised","reviewDescription":"There was nothing wrong with this purchase. I was worried buying something so expensive from amazon but it was perfect. Worked as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"I love it","reviewDescription":"So I had the oculus quest two 200 and something gigabytes for about seven months now, I have absolutely loved it but the right controller sometimes can’t turn right anymore and I have to do a 360 doing left which is really annoying. I have still recommended this though to four different people and they’ve all bought it and all love it so I definitely think it’s a good price for what you get. You just have to be careful with the controllers but I feel like that’s with anything.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Great","reviewDescription":"Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Fun","reviewDescription":"Really enjoy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"This thing is awesome!","reviewDescription":"This is one of the best gifts I’ve ever bought my son. It’s fun for the whole family. Setup took a few minutes, but once setup it works great.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Vr","reviewDescription":"This was a Christmas present for my son, he loves it.He is always on it playing the games.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Really Nice product","reviewDescription":"It appeared completely new and all the protective labels and protective wrapping were still on it. There is no usage sign. I bought the Meta Quest 2 - Advanced All-In-One Virtual Reality Headset - 128 GB (Renewed Premium) and I am very happy with my purchase. The headset is easy to set up and use, and the quality of the graphics and sound is amazing. The renewed premium version looks and works like new, and comes with a one-year warranty. I have tried many different games and experiences on the Meta Quest 2, and they are all very immersive and fun. The headset is also comfortable to wear and has a good battery life. I would highly recommend this product to anyone who wants to enjoy the best of virtual reality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1646179200000}
{"reviewTitle":"Pretty fun","reviewDescription":"Kids love playing with this gaming device.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660521600000}
{"reviewTitle":"Great headset","reviewDescription":"Awesome vr for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1663372800000}
{"reviewTitle":"Developer mode is broken","reviewDescription":"I’ve been trying to enable developer mode for three years I have done everything tech-support told me everything Internet told me everything my brothers told me nothing works. I’m giving up now. The product is great but I’m getting bored with all the games and there’s more games inside quest and Apple can get cool games like Minecraft for quest to but in order to do that I need to have developer mode in my world and I’ve been at 33 years. I know every technique there’s video should you say flip a switch you got to be verified I even made a account but my account doesn’t recognize I’ve signed into my account so I can’t do anything asking if they would. Please help me order to fix it in general because every app is changing the settings I can’t findings I can’t do anything no one can help me.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683504000000}
{"reviewTitle":"Was Decent, But Went Another Way","reviewDescription":"I already had an HTC Vive which was getting a bit dated, so I thought I'd try an Oculus. I really didn't think it through. I didn't fully realize that Oculus was going to leverage Facebook for accounts. Because of past experiences, I don't trust Facebook enough to give it a credit card and didn't really want Facebook integration with annoyances like Messenger. I also got tangled up in trying to get the Oculus to use Steam. (It and the Vive would fight.) The newer Oculus was wireless and had better graphics, but I still liked my old Vive better, mostly because it doesn't integrate with Facebook and because it was easier to leverage Steam. I think I'll let the VR industry mature a little more before my next purchase.I bought the Oculus directly from their site, not via Amazon. This proved to be handy as there's a 30-day trial period and you can get a full refund. That might be handy for folks who aren't sure if VR is something they want.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659312000000}
{"reviewTitle":"Glad I received it this time.  The last one was apparently from a bad seller","reviewDescription":"Hope it continues to work.  Was a bit glichy at first.","isVerified":false,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1661126400000}
{"reviewTitle":"Like new","reviewDescription":"Absolutely perfect a couple scuffs barely noticeable on strap I replace strap with one with extra battery. My son loves it too. Submitting same review they keep denying censorship for no reason.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"Excelente Serv y me resolvieron rápidamente haciendo la devolución total","reviewDescription":"No pude conectarlo al sistema y se trabó. Hice el reclamo y enseguida me resolvieron y  haciendo reembolso.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1719100800000}
{"reviewTitle":"Buena calidad","reviewDescription":"Pros:El producto llegó como nuevo y muy rápido.Es un producto muy actualizado y comercial.La calidad de la imagen es bastante buena si lo conectas al PC.A pesar de las críticas a la correa de la cabeza a mí me parece aceptable.Debido a ser el visor más comercial su compatibilidad en juegos es extensa.Contras:Si o si necesitas comprar el cable para PC,  porque los juegos que vende Facebook son el doble o triple de caros que en otras plataformas como Steam.Además de poder explotar al máximo la calidad de cada juego y tener un catálogo de juegos más extenso.Sudas bastante, pero se puede resolver comprando accesorios para ventilar el oculus.Es un visor viejo, por su precio lo vale. Pero los pico 4 sin mejor elección si tienes el dinero. Y si de plano te sobra plata  las quest pro. Porque ya dejaron de darle soporte a los oculus 1 y es cuestión de tiempo que le quiten el soporte a los quest 2. Creo que a lo mucho le quedan de 3 a 4 años de vida a este producto.No se puede jugar acostado, si o si debes estar sentado o parado. Eso se vuelve cansado.Si tú idea es experimentar la realidad virtual a bajo costo es el visor ideal, es económico, muy compatible y con unos cuantos años más de soporte en el mercado, es muy inmersión .Si lo que quieres es experimentar la gama más alta en tecnología de Real virtual lo ideal serían las quest pro, o las pico 4. Ya que tiene un mejor visor, muchos años a futuro en el mercado y nueva tecnología de inmersión.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"Mexico","date":1682640000000}
{"reviewTitle":"Baterias muertas","reviewDescription":"Hasta ahorita todo perfecto, pero llego con baterías alkalinas descargadas completamente","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1722470400000}
{"reviewTitle":"Buen funcionamiento","reviewDescription":"Es un aparato que al parecer es reconstruido. Pensando en eso, llegó en condiciones adecuadas y funciona muy bien. Mi hijo aún no le ha dado un uso rudo, y cuando eso suceda, espero que tenga buena durabilidad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1701907200000}
{"reviewTitle":"Awesome Renewal, like new! Big firmware issues though.","reviewDescription":"After facebook bumped the prices of this headset up by $100, I thought id rather buy a refurbished one. This product came with all the original packaging, and if you had told me it was brand new I would completely believe you. In that regard, it is fantastic!HOWEVER, when I set up the headset- it would NOT connect to the controllers or my phone. It took me about an hour to figure out that the firmware the headset came with was no longer supported by oculus.For anyone interested, this issue can be resolved by finding the firmware online, and manually sideloading it, but you do need some technical know how. Not everyone wants to do that.I can only hope this issue is resolved on amazons end before this same issue occurs underneath someones christmas tree, or if it happens to someone who doesnt know how to fix it.","isVerified":true,"ratingScore":4,"reviewReaction":"55 people found this helpful","country":"United States","date":1663891200000}
{"reviewTitle":"Works great but slight controller problems","reviewDescription":"Got it and it worked amazing. Just a slight problem with the right controller I have is thar it will unpaired every now and then and I'll have to re-pair it through the quest app. Not a big deal","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"Great value!","reviewDescription":"I dont give 5 stars out of principle but i would give this product a 4.5 stars, came in great condition, got it set ip and paired all in the same day. I use it in steamvr through air link and ive had no issues so far.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Cool","reviewDescription":"Likey","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Fun","reviewDescription":"I love this, i am having so much fun playing the games, but one thing you need to know is the battery plays out in about 30 minutes, i bought a backup battery ,I’m waiting for it to arrive.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"So heavy and uncomfortable","reviewDescription":"I wish the headset was lighter, it makes my head hurt, very uncomfortable and moves when I have to move vigorously with it. I wear it with glasses and that works I think better than without the glasses, go figure.But I love the games and fitness apps, very beautiful visuals.My son has a special head set and that is even heavier. I got extra covers for the hand sets and they do not slip out of my hands anymore.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"It's good","reviewDescription":"\"Upgraded\" from a Rift S and this was disappointing. The display resolution and screen refresh rate is a lot better but the color accuracy is a lot worse. The controllers and tracking are an upgrade. The Rift S is very comfortable and I can wear it for hours without any issues completely stock. The Quest 2 is extremely uncomfortable and the stock head strap and facial interface is practically useless. The silicon cover helps a little but it still hurts my face and after 30 mins I need to take a break. The battery life is decent enough for what it is, and you can use an external battery to help prolong it. If I had known I'd need to spend an extra $80 on a head strap and face cover to make it comfortable I wouldn't have gotten it.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1659398400000}
{"reviewTitle":"Bueno","reviewDescription":"Bueno","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Nephew loves it","reviewDescription":"Got it for my 9 year old nephews bday and he loves it!! I didn’t give it 5 stars because it was too complicated for him or my elderly mother to set up and they needed additional help","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"It’s STILL GOOD","reviewDescription":"I love playing with my meta quest, I’m about to interact with people, play games, ya know the normal stuff. Only problem is probably the glitch sound it makes when I play one of my favorite games, VrChat. It’s probably because of how many people in the server worlds, but AWESOME DEVICE!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"interesting but ...","reviewDescription":"1. I may be allergic to the material it is made of. My eyes were swelling up after nearly an hour of using it. (The right eye looked more severe.) Fortunately, the swelling slowly subsided in 24 hours.2. Its sound and image qualities seem poor.3. There are not enough good apps\/games to choose from and they seemed all similiar.4. It does not have developer mode.5. There are bugs in the available apps\/games (for example, YouTube VR login fails.)6. My vision blurred after having used it for a while.7. The headset either sliding off or sticking on my face making it uncomfortable to use.8. Camera doesn't always work.9. Photos\/videos in Meta Quest App Gallery can not be deleted.10. Controllers do not always function.11. Very poor software for user's interface.Currently I have only enjoyed its immersive videos, I hope it's not a requirement for them to intentionally cause user motion sick, though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Don't buy refurbished","reviewDescription":"Started to charge the oculus after only having it for 3 days, started melting out of nowhere?!?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Doesn’t work! RebootedAnd factory reset and still won’t work!","reviewDescription":"Did not work! Rebooted it and factory reset it . StillDoesn’t work! Lens won’tTurn either","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"I would like to give it 5 stars","reviewDescription":"I wanted to like this and I want to give it 5 stars.  But it was terrible for my health.  Within ten minutes of opening an app I got a headache, nauseous and the real scary part is it raised my blood pressure. I tried it 2 to 3 times a day for 3 days and every time it was the same thing. I was hoping I could get used to it but it didn't happen.If you can tolerate it I would highly recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Buyer Beware","reviewDescription":"We purchased two of these. They were delivered on July 19. A few weeks later, two small bright dots appeared on the left side of the screen (at about the 11:00 position) in one of the headsets. The internet said they were frozen pixels and suggested a factory reset, which we did. It did not fix the problem, so we contacted customer service. We were shocked to learn that after only a few weeks of use, they would not replace the faulty headset. They gave us only one option: a refund - but ONLY if we returned BOTH headsets. We paid about $250 per headset, and the refurbished ones are now selling for $350 each. So basically, we could send these back, pay an additional $200 and have absolutely no recourse if the replacements also failed to work. We asked to speak with a supervisor and were told we would receive a call in 24 hours.  We never received a call. Because we LOVE the one that works and it would be a financial hardship to invest another $200 on the chance that the replacements might be reliable, we decided to keep the originals. We have never experienced such poor customer service from Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1662854400000}
{"reviewTitle":"bad experience","reviewDescription":"one lens not proper work very bad experience","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"The Jury is Out","reviewDescription":"The packaging around every piece is top notch. But one controller did not have a tab to remove for initial set-up. So out of the gate I have to return the first one headset and have not been able to enjoy the product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Extremely AVERAGE.","reviewDescription":"Not a good buy in my opinion. Until these VR devices get MUCH better. There is no chance the amount of money they're asking you to dish out for this thing is worth it. It's average. Fairly heavy on your head. The ease of use is probably one of the better aspects but the investment is large. Ya figure you get this thing & want to play games on your PC then you now either have to invest in a wifi extender for your PC & superior connection speeds or it's not going to work at all. That or you literally tether yourself with the USB 3.2 link cable to your PC. Which in my opinion was far less than ideal or comfortable to do.I hope in the next 5-7 years these things can become priced reasonably & actually give a worthwhile user experience.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"Controller Problem","reviewDescription":"On the third day of using, the left controller quit working and I guess from looking on YouTube that this is a common problem. I'm not paying $150 for a new one either...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Features don't work","reviewDescription":"The left camera doesn't work. Scuffs on both controllers. And there are stains on the headset. But the quality for the virtuality is OK. I would recommend a different headset from this company.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Renewed Unit 1 - No Power \/ Unit 2 - Blurred Lenses","reviewDescription":"My son purchased a Meta Quest 2 (MQ-2) a couple of weeks prior to me ordering this one.  He wasn't willing to share for more than 5 to 10 minutes, so I thought I would get one for the rest of the family.  We were all excited when it arrived.  It arrived perfectly packaged, and although it was a renewed item, every component looked new.  Unfortunately, that's where the good vibes ended.I carefully extracted the unit and pressed the power button and absolutely nothing happened.  So I held it in for a few seconds, and still nothing happened.  I made several more attempts, but I didn't even see a glimmer of light from the lens nor the power indicator light on the outer case.  Obviously the battery must have been dead.  So I charged it for several hours and tried again.  It still wouldn't work.  I didn't want to do this, but I had to go to my son to ask for help.  I just knew he would figure out how to power it on and then tell me I was out of touch with modern electronics, but to my surprise, he couldn't get it to power on either.  We left it on the charger overnight and tried again the next morning, but it still would not power on.I called Amazon and asked for a return and replacement.  I couldn't be happier with their return service. Two days later I received another renewed MQ-2.  Unfortunately, I had to return it also.  The lenses were extremely blurry.  The focus adjustments incorporated in the unit did nothing to improve the issue.  After comparing the same games and scenery from my MQ-2 to my son's MQ-2.  I knew the lenses in my unit were defective.I'm not a quitter; so I didn't give up, but I decided to refrain from ordering another renewed MQ-2.  The third and hopefully final MQ-2 was purchased as a brand new unit.  I'll write a review for the new MQ-2 also, but I'll summarize that future review by saying the view through it is much better than the view through my second renewed unit.  If you choose a renewed MQ-2, just remember that someone returned it for a reason, and that reason might be because it was defective.  I know these units are certified by Oculus to work and look like-new, but in my case, I received two duds.","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1667347200000}
{"reviewTitle":"Disappointed","reviewDescription":"Meta Quest 2 has some issues. We fell in love with it and spent about 18 hours trying to fix a glitch with not seeing the controllers in the head set and not being able to click on anything. I researched took out batteries for 15 min multiple times, booted, factory reset, cleared App Cache, cleared guardian, synced controllers to headset multiple times and the controllers still vibrate and blink. Ugh! Had to return and ordered meta 3. I hope it works better.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Received Completely Dead + Power Button Malfunction","reviewDescription":"I was VERY disappointed to find out when I got my oculus that was it completely dead, and so I had to charge it, but honestly I didn’t find it that as big of a deal.. at least, compared to the other issue I found out later on. After I let the Oculus charge and it showed a green light, of course I tried to turn it on.Well.. nothing that you would expect to happen, happened when I tried to do so. The only thing that would occur is when I plugged and unplugged the charger from the headset, I would see the Oculus symbol, then a battery icon showing how charged the Oculus was ..then it would disappear and nothing. I even tried to reset it, factory reset it, but nothing ever popped up and the button on the side never glowed white, either.After thinking for a while and talking to some friends who have a perfectly working Oculus themselves, we all came to the conclusion that the issue has to be with the power button. Think about it, it charged perfectly fine and even the controllers seemed to work, just the headset itself would not power on at all.. or doing anything related to needing to press the power button. So unfortunately, I had to return my headset.. which REALLY bummed me out. I truly was looking forward to playing VR with my friends and significant other.. Hopefully nobody else has to have the same experience as myself, it just makes me so upset that’s something worth over $300+ had this kind of experience.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1664668800000}
{"reviewTitle":"Defective?? Right out of the box...","reviewDescription":"I opened up the box minutes after being delivered. The headset was defective right out of the box, stating this error:\"The cooling fan on your device is not functioning properly. Your headset may overheat or experience abnormal behavior due to insufficient cooling\"I couldn't believe what I was seeing. Before buying this, I spent lots of time looking through various reviews of this refurbished headset, and knew I would be taking some kind of risk. But to get an error straight after taking it out of the box? Really??I hoped the error was a false positive. So I tested it out by wearing the headset for 15-20 minutes. I watched the introductory videos and tried to find a way to comfortably put on the headset. When I got to the part of setup that required the headset to download firmware updates, the headset was already uncomfortably hot. I took it off and listened anywhere for a fan noise, but nothing. I restarted the headset a few times, let it charge, but no - The error kept popping up over and over after each restart.DO NOT buy this refurbished version. What happened to me may not happen to the majority of buyers... But a deal-breaking, easily detectable defect right out of the box?! The description claims that these headsets are \"guaranteed to look and function like new\", but this is a complete lie. Don't risk it, spend the extra $50 or whatever it might be and get the fresh one. That's what I've been left to do after waiting for the refund to process.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1656374400000}
{"reviewTitle":"Meta is a failure","reviewDescription":"You can't set up the headset without setting up your profile in the app;the app will not let me past the \"Choose how you'll appear\" screen.You can choose a screen name, but it won't advance to the next setting.Tried repeatedly setting it up with an email and with Instagram, reloading the app, resetting my phone, etc.The headset only gets to the point of telling you that you need to set it up with the mobile app,so the website is of no use.Meta support said they are aware of the issue: \"our engineering team is aware of and are currently working on to resolve as soon as possible. Once I receive any update from the engineering team about when this may be resolved, I will let you know so that you can enjoy the VR experience as soon as possible.\"It has been four days. Now the app won't even allow for keyboard input to enter an email or password.Tried reloading, resetting, etc.I worked with multiple Oculus Go headsets in the past, and recently set up several of them with a new Meta account using just an email address, not a Facebook or Instagram account.Looking forward to using the Quest 2 if Meta ever resolves this issue, but I will be returning the headset if I can't even get to the point of setting it up.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Controllers would not pair to headset.","reviewDescription":"Disappointed right out of the box. The first one I ordered, the controllers would not pair. Sent it back for a replacement and the second one had the same issue. BTW it was the 256G. I Googled it and found that a lot of people were having that issue with no real fix to the problem. Went back on Amazon and saw that the Quest 2 256G was no longer available. Probably pulled them off the shelf. So then I decided to order the quest 3. I'm crossing my fingers.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716768000000}
{"reviewTitle":"Product will not charge after playing only twice","reviewDescription":"We got this for my daughter's birthday gift. She only played it a couple of times and it would not charge after. I sent it back to Amazon and am still waiting on a refund. It's been over 2 weeks. Customer service is beyond frustrating. First I was told it would take 30 days before I was refunded even though it was received on the 13th of October. Then I was told that it won't take 30 days and because they do have it, I will be refunded in 4 days. 5 days later I'm being told it's there but no one has scanned it yet so it won't be until the 26th. My daughter forgot to put the charging cable in and I still have yet to receive a return code for that so I'm sure I'll end up being charged for it, or when I finally do get one it will take another month to refund the money. When I asked why it takes so long to refund the money I was told because it was a high price object. I would honestly say so yourself a favor and get it from anywhere else. Usually Amazon customer service is great, don't know what's going on right now but I'm getting different answers everytime I ask about my refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1665273600000}
{"reviewTitle":"Would not connect","reviewDescription":"Went through tech support and it would not connect. Not able to assist so I'm returning in.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"The oculus quest 2 is horrible","reviewDescription":"I bought an oculus it worked good for about a week then I logged on and the zone didn’t work at all it was completely messed up and glitchy so I tried wiping the cameras on the front of it but nothing changed and even after that if I was able to get the zone to work after a few minutes of playing a game it would get rid of the boundary and I would have to go through the process again. And just when I though things couldn’t get worse when I would turn it on it would just show a black screen I could still here everything like opening the menu and closing it but it was just a black screen so obviously I returned it and got a new one but the same thing happened again so I returned it again and got a new one but to my surprise it happened again. This is the worst product I’ve ever bought I would definitely suggest getting something else than waste your money on something that only lasts for 1-3 weeks.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"Have been trying to get a repair","reviewDescription":"We bought the oculus quest 2 to play with friends, we went to learn to set up with friends and played for a whole weekend, came home got busy with life and stored it when we tried to play with it again it would not charge and boot up, trying to get it to work and no Human Resources made us feel money out the window. A friend told us about the manufacture change and we reached out, what a joke, so I am reaching out to Amazon, we paid a lot of money for this and my daughters really love it, we bought another to replace it at Walmart but not the same. Please help","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Waited years to purchase..","reviewDescription":"Waited for software development.  Can't  describe how wowed I am.  The software by 3rd parties is excellent.  Be prepared to spend an additional $100 to $200 on apps.  Most are reasonably priced from $10 to $20.This is a far cry above the cellphone VR goggles.  Plus the apps will mostly store on your Meta Quest.All the apps have trailers or demos and some have returns and yearly fees outside the demos.Can't say enough about how real the Meta Quest is.  Best example is imagine stepping into your TV set and becoming part of the show!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"Looked brand new!","reviewDescription":"This machine is high preforming and just like new! Battery life is fine, you can play high performance games for up to hours while less consuming games might last another hour. Camera is great and I loved this product!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"VR is the new real technology","reviewDescription":"As a baby boomer, this thing blew my MIND.  The default app looks like your in Veil ski resort.  Starry sky,  huge lodge with gazebo, decorative flame fountains, GIANT windmill, and you can almost catch the snowflakes!  I just did the intro lesson and i am retarded at throwing anything from balls to blocks to paper planes, but launching toy rockets from your hands is pretty simple.  Holding and releasing objects takes alot of practice. I bought the baseball app and i failed miserably on pitching and batting, but watching my \"no lower body\" teammates bob around is so funny.  I just bought the golf game and fortunately you can go to a VR driving range and practice!  Thant will be my first stop!!  Even you are not a seasoned gamer, just plan on lots of practice!  I am looking forward to the what i call the \"skill games\" that apply to real life,  like rock climbing and truck driving (I have an RV and its great for backing up practice).  As a doctor, I hope they make one that i can do major surgeries on!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"Fun","reviewDescription":"It was for my grandson and he loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Loves it.","reviewDescription":"My son loves this. Download the app to make set up easier. My tv doesn't support this device but I can mirror it from my phone so that I can watch him play. If you are going to be transporting this get a case! I also bought a backup battery and it extends playtime alot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Fun fun fun","reviewDescription":"Great Virtual Reality headset.  My kids love it and it keeps them up and off the couch staying active.  Great purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Renewed is BETTER THAN NEW!! And Quest 2 is better than life itself!!!","reviewDescription":"After reading review after review saying that Facebook was a nightmare to deal with for warranty service, (taking weeks and even months to respond), I noticed that Amazon Renewed has a one-year satisfaction guarantee (which seems to say the item doesn't even need to malfunction for you to return it), I realized Amazon Renewed was the way to go. If you add the 3-year warranty for just over $30, it still costs less than a direct-from-Facebook purchase which only has a one-year warranty, and most importantly, MY AMAZON RENEWED QUEST 2 ARRIVED IN WHAT LOOKED LIKE BRAND NEW CONDITION with only labels marked, \"Refurbished\" to clue me in that it was anything but new. I am an adult who is not into gaming, and I'm finding this device to be BEYOND AMAZING, transporting me to fantastic worlds that look and feel 100% real. In the few days that I've owned it, I've visited with elephants in Kenya (ECOSPHERE), ridden on a roller coaster with Santa (EPIC ROLLER COASTERS), danced with an alien (FIRST STEPS), relaxed in a breathtakingly modern home (ALCOVE), taken a bus tour of Dubai, attended a private performance by the most adorable girl dancing and singing in Japanese (TOUCH THE BEAT), learned the ins and outs of Quest 2 from a good-natured robot (FIRST CONTACT) and more -- and these were just the FREE apps! So all my research on warranties, guarantees and return policies likely won't matter since, it turns out my Quest 2 from Amazon Renewed is a keeper after all!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"43 people found this helpful","country":"United States","date":1654041600000}
{"reviewTitle":"Truly looks and works as if brand new","reviewDescription":"I got this for my child as a Christmas present to relpace the cheaper less cool version I got them a few years ago and ABSOLUTELY loved it.  Im considering getting myself one later this year so we can play together in the future.  I'm personally super pleased with how easit is so far to have the same type of parental controls security features like they have on mobile devices.  If you want your child that is 12 or younger to have this but are worried about them having access to things you don't want them to, this is the VR set I'd highly recommended","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Worthwhile","reviewDescription":"This is very fun. My first experience with vr was samsung gear. Haven't touched it in 4 years. it was ok. But this is on another level of awesome. Plenty of fun free apps to try. As long as you don't block the sensors the tracking is beautiful 👌 😍 ❤️. Definitely want to keep doing vr","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Oculus quest 2","reviewDescription":"Been having fun with this whole family enjoys it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"I got a faulty","reviewDescription":"It’s refurbished so that’s probably why mine stopped working the second day. I had to return it and just buy a brand new one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681603200000}
{"reviewTitle":"Looked great until I turned it on","reviewDescription":"The refurbished unit I received looked perfect cosmetically, but I couldn't even set it up or register it online due to non-stop headset tracking issues. Returned for refund.-------------------------------------------------------------------------------------Update: received the replacement unit, also refurbished. Looks like new and operates well (so far) but it was missing the power brick and the charging cable which were supposed to be included.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1647561600000}
{"reviewTitle":"Maybe you'll like it maybe you won't.","reviewDescription":"I really enjoyed the device and most of the games\/programs.  But after a few days I decided not for me. Made me feel sick after playing a flying game.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"Really? Come on people, wth?","reviewDescription":"I’d love to leave a review about great this product is but it arrived today with the battery completely drained. Really? Why would you shop this with 0% battery? It’s been charging for 15 min and it just reached the 1% charge mark with this “”lightning cable” seriously disappointed with that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652745600000}
{"reviewTitle":"Lenses where scratched","reviewDescription":"Lenses where scratched everything else was in working order and worked as expected and Amazon sent me a replacement arrived next day ...still inconvenient","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678320000000}
{"reviewTitle":"only one controller works.fir","reviewDescription":"first off i got this for a subscriber secondly only one ONE controller works. i am not happy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"One of the plug in adapters didn't work","reviewDescription":"One adapter that magnet attaches to for charging didn't work right out of the box","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"Scratches on Both Lenses","reviewDescription":"I was so excited to receive my Oculus today and once I unpackaged it and tried it on, there are scratches on both lenses. I’m very disappointed and I’m not sure how to go about getting this fixed\/returned. Help!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1655856000000}
{"reviewTitle":"Missing parts.","reviewDescription":"The original web page showed the product I ordered with an additional ratching-type head strap and a case for the headset.  Neither are in the box.  Disappointed that all the items shown were not included with my order, which had to be backordered at the time.","isVerified":true,"ratingScore":3,"reviewReaction":"37 people found this helpful","country":"United States","date":1645574400000}
{"reviewTitle":"Fun","reviewDescription":"Mi son was very happy at the beginning, but it doesn't fit very well to his nose, it just keeps falling down, and to much more cost of money extra for games.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659571200000}
{"reviewTitle":"no charging cord and not pairing at all","reviewDescription":"no cord was included in the package , I've been trying to connect it with my app for a week and still no go , totally never buying it again and strongly discourages anyone from buying it .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"One controller not worked since opened","reviewDescription":"When my son opened the box he linked the left controllerno problem. He tried linking the rt and it wouldn't do anything besides blink fast. Chatted with technical support and tried many different things to reset it or wake it, nothing. Yet they still want me to keep trying things. Why can't they send me a replacement? My son can't even use it and don't know when he will be able to. Nota happy customer😕","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"Dont order refurbished quests","reviewDescription":"Came broken, dirty, wouldnt turn on, tried EVERYTHING i could. Returned and bought brand new that worked great. Worst choice you can make is getting one that says Renewed, fr","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"No funciona","reviewDescription":"No sirvio y estoy esperando que me reitegren el dinero","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Can't update because it's refurbished","reviewDescription":"Meta told me directly that it will never work until they develop a fix for the refurbished ones. So it is useless without extra effort which requires technical knowhow. Lucky I know how but it isn't worth saving $50. Just buy a new one.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"Worked great for a week!!!","reviewDescription":"Product worked great for a week. I'm 41 I take care of the things I buy with the money I work my but off for. I say this because they didn't stop working from misuse. They just stopped working. Hopefully I can get a replacement!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664928000000}
{"reviewTitle":"Did not work","reviewDescription":"Could not set it up. Customer service said it’s an i.t. Engineering problem and that I should wait a week and it might be fixed and that it is a common issue a lot of people are dealing with. Horrible why sell a product you know does not work","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Basically unusable","reviewDescription":"They don’t give you the headset with the proper software update and sometimes not even native controllers making it completely useless. Would not recommend I was super excited till I got it and found it wouldn’t work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1666137600000}
{"reviewTitle":"Product did not work.","reviewDescription":"This is the first time that I've ever returned an item purchased from Amazon.  The product was not working properly upon initial set-up.  Extensive trouble-shooting did not resolve the problem either.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Double price, still refurbished item","reviewDescription":"Many people here have received refurbished items.Recently the price of the Quest 2 increased from $200 to $400.I purchased this item after the price change, and still received a refurbished item.Scratches everywhere, spots that won't come off, and grime on the controllers.Look for something else.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"Five star","reviewDescription":"I actually think the device is a five star device it’s phenomenal. I loved it what is only worth two stars and vibrated that way was because I had a Derek controller and there was no exchange policy. I had to actually return it which I found them slightly disheartening and kind of messed up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"A not like new experience.","reviewDescription":"The \"renewed premium\" tag should be removed. Not only is the quest 2 body dirty beyond all getout, the straps are stained with dirt and some type of yellow, and the lenses are insanely scratched, and it's very noticable while playing. Don't listen to their \"a like new experience\" tag line, you're getting a very used, very very used, quest 2. the one I got isn't even an meta quest 2. It's a very old oculus quest 2.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"JUST BUY NEW.","reviewDescription":"They wipe everything. You have to create a developer account, download & install the ADB drivers. Find a working firmware update.  ~750MB.  Then use the command prompt and devloper commands to install the firmware. By the time I finished my two degrees in Google & YouTube university there was 5% battery left.You're welcome Occulous & Amazon for saving you a RMA. Also after amazon hounded all my apartment complexs to install \"Amazon Key for Business\" they use it as an excuse to pile up packages by the mailboxes instead of taking them to the doors. I guess I should count myself lucky that I even got it. Despite the odds I was able to finally get my son a working birthday present.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1658793600000}
{"reviewTitle":"After 3 weeks charging port stopped charging and product would no longer turn on","reviewDescription":"The worst refund process I have ever had to go through.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"kept crashing after first play session","reviewDescription":"The headset was working amazingly for the first session, but after that it was constantly glitching and crashed several time before i gave up","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Stopped functioning after just 1 month.","reviewDescription":"This is a very delicate piece of machinery. Able to deliver an immersive imax experience straight to your living room.I'd expect that to be atleast a 14,000$ device.I got more than I paid for if you ask me. But I wish it was durable enough to let me continue playing. I didn't let it fall and i didn't let it get wet. It could have been turning it off wrong.Anyway just letting you know the risk.","isVerified":true,"ratingScore":2,"reviewReaction":"7 people found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Very heavy on head kneck & face","reviewDescription":"Heavy hard not comfortable","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Having issues already.","reviewDescription":"I bought this about a week and a half ago, after time playing it my right joystick stopped working? Randomly it'll cut on and off while playing and has a really hard time even connecting in the first place.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Older adults left out","reviewDescription":"Has no manual. Everything (and I do mean EVERYTHING) must be searched and found buried in forums. Handheld devices are designed for gamers, so you better be familiar with using touch-feel to identify multiple buttons and joysticks. App marketing is all about games, not geographical exploration. Exploration (experiences) are hard to locate and now cost on the Meta store. Clearly designed around VR games, not experiences.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"This is bad!","reviewDescription":"When I got my vr head set it was warm and the Box was ripped a little and even thought it cooled it would die fast! This is just a joke you people need to do better!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693526400000}
{"reviewTitle":"Okay for the most part","reviewDescription":"Everything working great but I payed for link cable and no link cable was included","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663891200000}
{"reviewTitle":"Not with a Mac","reviewDescription":"Does not play nice with a Mac. Also the browser is lame and lets a lot of information about you out and a lot of advertising junk in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659052800000}
{"reviewTitle":"Vision is blurry through lens","reviewDescription":"The package and accessories  look like new. Once it sets up. I test it and noticed the main issue is that vision is blurry through lens no matter how to adjust the headset or distance between lens","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1646438400000}
{"reviewTitle":"Battery does not hold a charge","reviewDescription":"Super fun to play but the battery does not last nearly as long between uses as my brand new one does.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649721600000}
{"reviewTitle":"Great product, but not for me","reviewDescription":"I wasn't able to get over the nausea, unfortunately...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667347200000}
{"reviewTitle":"Left Screen Flickers After Adjusting the IDP","reviewDescription":"I think the Quest 2 is an amazing piece of hardware, however I recommend just buying a new one for the extra $50.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646784000000}
{"reviewTitle":"Most of the good games are exspensive.","reviewDescription":"I really haven't had it Long Enough to make a Review!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Do not fit over eye glasses","reviewDescription":"Theses were very uncomfortable over my glasses","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655164800000}
{"reviewTitle":"Pretty good for a headset","reviewDescription":"Pretty good came a little dirty","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"I don’t like these companies trying to be futuristic and all that.","reviewDescription":"I don’t have an issue with having a Facebook account to use it but I don’t like how you must use your phone to play any games on it. One day in October I factory reset my quest because it kept on asking me to input a code online. I hadn’t touched my quest 2 for a while. By a while I mean 4 weeks.Anyway when I tried to input the code through my computer. Expectedly, it bugged out and didn’t work every time I tried. So I factory reset the headset. I did every normal thing that you do when you turn on your quest for the first time. Until it asks you to connect it to your phone. It did not work, I even used a different phone. Nothing ever worked. And I never got it connected that day. I was thinking hard about selling it as junk  But I didn’t. In 2 days I decided to send it to a repair shop that fixes all kinds of electronics. They fixed it in about 2 days. The best part is they didn’t charge me because they “didn’t really fix anything”. And they were nice about it. Now I can use my quest whenever and nothing bad has happened since then. The quest 2 could’ve been better.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"Not eligible for referral bonus","reviewDescription":"Honestly it's a cool vr set but if you expect to get your 30 dollar referral code don't bother with this one. Neither you nor your friend will get the money with this. Honestly I'd give a lower rating but it's not fair to the device itself. Mine did come almost dead despite the description saying 90% and my left controller didn't pair so I had to unpair the one it had and re-pair the one I'm using.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"controller drift","reviewDescription":"worked great for 1 week then controller drifts happens..big problem with refurbished games..had to return it and try again..i was being cheap and got this one for $350...should have spent the extra $50 and hot a brand new one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"Did not work","reviewDescription":"I received this VR and it would not pair with the controllers. I contacted Meta support and they could not figure out the problem. They tried to figure it out for about three weeks before I gave up and returned the VR.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Great device all in all","reviewDescription":"This device I would have given a higher score but unfortunately but unfortunately there is a yellow shadow in shadow and an upper left side. But customer service took care of it and set me out a new one and I love it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"Lied about included parts","reviewDescription":"The original web page showed the product I ordered with an additional ratching-type head strap and a case for the headset. Neither are in the box. Disappointed that all the items shown were not included with my order, which has to be backordered at the time. “Same comment I found here and I agree” This was misleading and not nice.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"Oculus quest 2","reviewDescription":"Worked for less than a year bought in june 2022. Just quit working feb 2023 very small return window. Very unhappy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Glasses","reviewDescription":"Very hard to use VR with glasses.  I loved the unit but wearing glasses caused headaches and blurring vision while playing.iy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684454400000}
{"reviewTitle":"Fan Doesn't Work","reviewDescription":"As soon as we got the device before we set it up it sent a system alert that the fan isn't functioning properly and could cause the system to overheat.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672790400000}
{"reviewTitle":"Crashing","reviewDescription":"It’s crashed 3 times and I haven’t even played for an hour. Pretty disappointing, it’s very uncomfortable. And it’s blurry when in games","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"Broken out of box","reviewDescription":"Came with faulty controller. Now have to go through trouble of returning. Probably won’t buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"Waste of money and time!!!","reviewDescription":"I got this and of course because you can't trust Amazon with any large purchases it doesn't work so I'm going to have to send it back to order a new one which will absolutely not be through Amazon because I can't trust that the product will work. One of the hand pieces will not stay paired so you can't use it at all and a lot of others have been having the same issue. Time to send it back!!!! I'm so upset about this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"My oculus meta quest 2 not activating.","reviewDescription":"Hello my name is Angel, I ordered the oculus mega quest 2 like about 3 weeks ago, I have no idea why it doesn’t wanna activate when I log into the beginning options. I need help to return these please and thank you. I can send out evidence of these not functioning the way they’re supposed to. Have a good weekend thanks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"Came with stick drift and fuzzy sun burnt lenses","reviewDescription":"Out of the box it had stick drift, also has been exposed to the sun with really fuzzy lenses","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Arrived with out dated software and no way to update!","reviewDescription":"Without the current update or a somewhat recent update, you could not hook up to the internet to update.  Spent several hours looking for a solution to no avail.  Then dealt with Amazon who for the first time (to me anyway) was somewhat rude and very unhelpful.  Would not buy anything refurbished from Amazon again.  They present the item as good as new, checked out, etc.  Yet the Oculas was a brick on arrival since it could not be updated.  My kids had saved for a year to get this.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663200000000}
{"reviewTitle":"Regret","reviewDescription":"This vr set was a pain to set up. It would starting Overheating quickly to the point the the headset itself is giving me a warning. This wouldn't be problem if i was on it for hours but im on it for like 20 to 30 mins trying to set it up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"Would not recommend  and had to return 😕","reviewDescription":"I was really excited for it, and paid fast shipping It came and when I opened it and tried starting it up. The controllers would not connect as well as it was stuck on one screen. I tried factory resetting it twice nothing worked it wouldn’t even connect to the app I talk to customer support and he told me that the serial number for my oculus was a broken \/ faulty what did I expect when buying it for $60 cheaper","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"IT DOES NOT WORK !!!!!! DEFECTED","reviewDescription":"Got it for my 10 year old birthday. Super excited to receive and just crushed her heart. From the beginning one of the controllers does not work. Then we said ok no problem but once we tried to start it up and pair it, it did not work. We tried everything, by fully charging it and resetting it. Nothing worked. Huge disappointment and had my daughter upset all night. SO DONT WASTE YOUR TIME and just go to the store and get a brand new one. Especially for this price. Disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1662595200000}
{"reviewTitle":"Corrupt software right out the box","reviewDescription":"Hi everyone, not usually the one to write reviews but I got mine and I can’t even use it. It’s stuck in a boot loop and it’s saying the files and software is corrupt. I’ve trusted everything nothing works not even factory reset","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Not cleaned as stated in description","reviewDescription":"I know this is a renewed\/refurbished piece of equipment. But it is not cleaned as stated. Remotes were covered in sticky substance. Yes we will clean it off, but next time a little bit or QC work would have caught that!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"DO NOT BUY TERRIBLE PRODUCT","reviewDescription":"If I could I would do zero stars. Worked for about a week. Absolutely no customer service help. Now out  $150 in games bc it can’t be refunded. Worst thing I have ever bought for one of my kids!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Bloatware and Inconvenient","reviewDescription":"The headset forces the installation of lots of useless bloatware and spam apps, with no way to remove them. It also requires a reinstallation of many apps every day I want to use the headset. Overall, it’s very inconvenient to use.There are several great apps, and the VR experience is a lot of fun, but Meta needs to tone back the aggression against the consumer and make the headset more usable.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Horizon Venues doesn't work.","reviewDescription":"I'm extremely disappointed that the only think I really wanted this for, Horizon Venues (for events like concerts) won't work. It gets stuck on the loading screen and never opens. I searched he web and it's a massive problem that they haven't figured out. I tried doing a factory reset and that didn't help. I might return it.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1662422400000}
{"reviewTitle":"Horrible vr.","reviewDescription":"The games are all outdated with horrible graphics, the headstrap is super uncomfortable (aftermarket headstrap in picture), it keeps resetting the boundary, the headset is bulky, and it has a small battery life.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681689600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"I had to return it because of software issues correcting the avatar my kids created which is public so not appropriate that it cannot be changed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Setup process completely broken","reviewDescription":"I got it today and I’ve been trying to set it up but no matter what I’ve been getting a black screen even after a reset very disappointed Amazon","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1683158400000}
{"reviewTitle":"Just bad","reviewDescription":"How about this and I tried for 2 days to get it to sync up to my phone I tried everything I know to do I watched so many videos on YouTube about this and nothing I was so disappointed in especially for the money I paid for it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Not working","reviewDescription":"It was good for the first day , and now it turns off after a few minutes. And this is for my daughter. It is fully charged. And it still turns off after a few minutes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676160000000}
{"reviewTitle":"Didn't realize it was refurbished","reviewDescription":"Ended up sending it back. The batter life was trash. Didn't last 20 min on a full battery.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"left stick has drag","reviewDescription":"it was fine until i notice the left stick on the controller has bad drag guess i have to buy another left controller never trust amazon to refurbish anything","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Received an refurbished oculus","reviewDescription":"I thought I was buying a brand new oculus. I gifted it to my daughter for her birthday. Nowhere did it say I was getting a refurbished one. It doesn’t turn on at all. Returning it. What a bummer it was to have to give her gift back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663286400000}
{"reviewTitle":"Horrible","reviewDescription":"Spent the better part of my sons birthday trouble shooting the app. Do not waste your money on this headache of a junk product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"Didnt even last a day","reviewDescription":"I should of read reviews before purchasing.  Very cool concept but the amount errors it gets and inability to track movement errors got annoying.  SO much so I couldnt even perform a hard reset.  Turned into a paper weight that you can wear on your head.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"Meta what","reviewDescription":"The first vr sent was already active on another account.  Amazon fixed that for us by sending a replacement.  The meta quest 2 is a decent vr for the cost.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Cool but very uncomfortable.","reviewDescription":"Hoping the quest 3 addresses that. You have to get a third party attachment and some come with batteries too. Then and only then, it's actually comfortable enough to use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"As expected!","reviewDescription":"They do not tell you that you have to purchase a charger for the controllers. Typical money hungry tripsters. That kind of stuff really pisses me off. How are you going to use it without all the equipment? BTW they rage from $33 and up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"Fan error, overheat after 3 weeks of use","reviewDescription":"3 weeks after purchase and I've got \"The cooling fan on your device is not functioning properly. Your headset may overheat or experience abnormal behavior due to insufficient cooling\" error, which went away after a reboot, but just within 3 days it started to appear just after 15 minutes of gameplay in Beat Sabre (OculusVR version). I contacted Meta support for assistance and will update the review if this is resolved.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Can bring a lot of fun, but charge doesnt hold even an hour!","reviewDescription":"Ive been using this for about a week now, and I gotta say its been fun, playing whatever I can find on the internet and that, but I dont know why the charge doesnt last even an hour. Have to keep it plug in  while playing.Beside seeing things a little blurry (prob cuz of my face structure) my only big complain is the charge hold, I cant enjoy anything for too long cuz gotta connect it to charge, what a shame.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659398400000}
{"reviewTitle":"Mic didn’t work.","reviewDescription":"Mic simply didn’t work. Although everything worked fine, there are games that I wanted to use the built-in mic for, but just wasn’t working.  So I’m going to just get a new one instead of a refurbished one. Or else I’m afraid something else will be wrong with it again. Other then that, the quality and specs on the Oculus 2 is amazing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Short battery life","reviewDescription":"Fun, but just get into having fun and it needs to be charged.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Heavy","reviewDescription":"It is a lot heavier than I tjought it would be. The picture is not as clear as the reviews from others state. I did not realize the that it was so expensive for the games. You really have to have a very large area to.use most of them. Are there anything other than kiddie games or wsr games to get? I would like European tours like you would do if on a vacation.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663632000000}
{"reviewTitle":"Great, but. . .","reviewDescription":"Loved it until it started to malfunction.  It would completely shut down.  Show nothing but a view of my room in black and white. Unit wouldn’t connect with controllers.Request for replacement was honored quickly after I returned the first one.  I would have purchased it new, that is out of my price range.  I guess you really roll the dice when buying‘refurbished’.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659052800000}
{"reviewTitle":"One controller won’t work:\/","reviewDescription":"The right controller won’t work, I can move the joystick to fast forward a video on YouTube but it will not work for typing and it won’t show in a game in a game idk what to do:\/ I tried to pair it again and I switched batteries still won’t work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"Hands down, the superior stand-alone headset.","reviewDescription":"Especially with the new updates that increased the processing power and resolution of the Quest 2, there's really no reason not to buy. No hassle, not FB login needed. It's just phenomenal out-of-the-box performance and a huge library for work, exercise, and play. Tons of free games like Population One (VR Fortnite).Seriously, just try it, risk free!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"Was surprised!  Definitely worth the money","reviewDescription":"At first I was a littlw worried bc of the bad reviews but I also saw the good reviews and videos and was like, “oh, ok it might work” So, here I am now. I had it for about one day now and this thing works perfectly. It even came out of the box fresh as a daisy. 10\/10 would recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Best Bang for your buck!!","reviewDescription":"This is my second oculus that I bought and I wanted to save a little bit of money this time. Sooo, I bought the renewed one. So far, this quest 2 works great and it comes with everything a brand new one would include. The quest 2 is very affordable and a great option for your kids or other family\/friends. This renewed one has given no problem so far and works the exact same as a brand new one. It is a great option to have some fun.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Works great!","reviewDescription":"Love this VR headset so far. I am happy with this purchase. It is my first experience with VR and so far I am impressed. I’m not a gamer but this headset makes gaming look fun. I mainly bought this to watch movies. I wish the video quality was higher but at this price point video quality is sufficient. If money was no object I would hold out for the next generation that is being released in a few months.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"Awesome","reviewDescription":"Pure fun love the workout apps","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Really good product","reviewDescription":"Even if it was preowned, it was still great. Nothing about it was broken. Everything was perfect like if it was brand new","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"A","reviewDescription":"A","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Fun","reviewDescription":"Love all the things you can do in the Meta world. Learning games explore workout chat. Loved it so much I bough this one for my 7 year old nephew. Especially after he played mine and I had to leave. So I got him his own. He’s learning and also a way for kids to stay active and exercise on a daily.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Affordable VR at its finest","reviewDescription":"The Quest 2 is an amazing headset, that being said it is made by Facebook, which takes away from it a bit but hey, it's still a great piece of technology!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Granddaughter tested","reviewDescription":"Used unto it went out of style. Always a +++","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"using a friends code to get $30 does not work","reviewDescription":"used a friends oculus, decided i might get on when thy go on sale next. friend said use my code and we both get $30 for games. set up account with the code before the oculus even shipped. synced head set and no reward balance was present. waited a few days and still nothing. sent a request to the oculus help desk about 3 weeks ago and still have not got a response from them.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1659398400000}
{"reviewTitle":"Wish it would’ve worked!","reviewDescription":"I ordered this and received a refurbished product. The controllers wouldn’t pair to the headset and blinked as if to have low batteries. Batteries were replaced and they still didn’t work. Very disappointed. I got a refund and hope to buy one from somewhere else.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1683158400000}
{"reviewTitle":"Meta quest 2","reviewDescription":"Would not unlock with code or unlock to pair with phn. I even took it to best buy they said system locked. Not phn. Returned please put money back on my card. Thank u","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Amazon bait and switched","reviewDescription":"When I ordered this, as you can see from the picture from Amazon, it was supposed to come with a case and a different strap.  They since changed the product to just the oculus 2 on the website and not what was from the original posting.  Today I got the product and no case and no extra strap came with it.","isVerified":true,"ratingScore":1,"reviewReaction":"79 people found this helpful","country":"United States","date":1645833600000}
{"reviewTitle":"Didn’t work","reviewDescription":"Item did not work. Worst customer support I have experienced between Amazon and oculus. Still waiting for a refund or replacement. Oculus Do not ship returns to forwarding companies yet it is allowed by Amazon. Had to foot the bill to ship item back and will have to foot the bill once, if ever a warranty replacement is sent. Not a cheap venture to say the least.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"Dirty and disgusting","reviewDescription":"Just get the new one, not worth it.- Visible yellow stain on the headset + sign of wear- oily nose rest- an ant inside the box","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Very pixelated display do not recommend to anyone","reviewDescription":"The head straps are very uncomfortable, and I'd recommend upgrading it. The battery life also sucks and only has 2 hours. The VR is also very pixelated, and I would not recommend buying this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"The Oculus is perfect, but the title of the product is false","reviewDescription":"2021 Oculus Quest 2 All-In-One VR Headset 256GB, Touch Controllers, 1832x1920 up to 90 Hz Refresh Rate LCD, Glasses Compatible, 3D Audio, Mytrix Head Strap, Carrying Case, Silicone Face Cover'On this title says ''Carrying Case and Head Strap'', those things never was sended to me, and I feel cheated by the companyAbout the Oculus Quest everything was ok, like new","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1647907200000}
{"reviewTitle":"Purchased April 2023 Already Broken July 2023","reviewDescription":"Troubleshooting support for headset that no longer charges is a joke. This is our second headset in 1.5 years. Extremely disappointed. Don’t waste your money","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"Lasted 5 days","reviewDescription":"This is a big disappointment because it only lasted five days. The app on our phone says it's charged at 96%, however, it hasn't turned back on in over 24 hours.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1683936000000}
{"reviewTitle":"Glitchy right controller,  support have you run around not willing to send a replacement","reviewDescription":"I have a glitchy right controller right out of box,  the headset will lose track of where it is. I have to shake the controller to have it recognize it again.  Usually happens with small movements.  A game like golfing is unplayable.  Call the support they had me do all stupid troubleshooting,  factory reset etc.  At the end agreed to replace it, but 2 days later it came back asking for video proof of the issue and other info.  It is just big waste of time.  Going to return it. and buy another one.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"Still had previous customer data; not able to delete","reviewDescription":"This is really bad.  The device I received still had data on it from the previous customer.  Who was a hospital.  No patient data AFAICT.I tried to do a factory reset of the device (via the boot menu).  It didn't reset the device fully.  I was still able to access the old data after multiple \"factory resets\".  I could also see who the previous customer was.  I am not able to put any of my own apps on the device or do anything else with it.I tried reaching out to Oculus support and the told me to return it.  Only offering a $15 gift card.  This seems like more of a worse problem IMO than a defective item.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1645488000000}
{"reviewTitle":"Inconvenient as hell","reviewDescription":"The headset immediately turned into a piece of scrap, not even 2 months in before i was dealing with poor tracking and frame’s freezing. When i returned it i have been waiting almost 3-4 monthsHorrible experience with amazon and meta👎","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Not fixed","reviewDescription":"Renewed! still with problemsOut of focus mainly caused by Fingerprint smudges on lenses ( plastic tab replaced on top)Unable to pair handsets as the 'black tabs' REFUSED to be removed on either handset.After turning it off, the headset continued to heat upHeadstrap only suitable for child sizeUPDATE UPDATEUPS has lost my return, they have officially classed it as lost and Amazon still insists on making me wait for it to arrive!! before a refund.What a bunch of crooks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Too expensive to be missing pieces and not work","reviewDescription":"I bought this for my daughters birthday she was so excited to play with it we were out of town for her birthday and when we opened it it was missing the charger and then I waited till I got back home to go buy one and then when I got it charged it was stuck on a black screen with a PIN number that didn’t work and we were never able to get it to work. Very disappointing and will not be purchasing this item from here again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679788800000}
{"reviewTitle":"Refurbished wouldn’t connect to Bluetooth to set up","reviewDescription":"Ordered for my 10 year old who was very excited to receive it. Upon taking out the box the front camera was cracked, it wouldn’t connect to the internet at first. After several tries it finally connected after a hour or so of trying. I told him to let it fully charge and try again the next day. The next day still no kick wouldn’t pair with the controllers we boxed it back up and returned. Paid the extra and ordered a brand new one","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"Be prepared to return…","reviewDescription":"I have heard good things about the quest 2 and was excited to try it. So when I found one and ordered it I was hyped. When I got it I was so disappointed though, first thing that happened was that I got the infamous Black Screen of death, and of course after trying everything I can possibly think of to no avail. So please refer to the title of this post cause I may have to do the same","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Wouldn't work with Steam","reviewDescription":"I spent over 25 hours trying to get this to work with steamvr on a Gaming PC and it would not work with steam.  Watched every youtube video I could find, bought cables that were recommended, but nothing.  I didn't download any Oculus games as the game I wanted to play is on steam only, so no comment there.  However, using PC with Steam was a NO GO, very frustrated.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Did not work correctly.","reviewDescription":"Sound kept glitching and the right controller thumb button kept sticking.  I had no trouble returning it and went with a new one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Stupid Setup Issues","reviewDescription":"What an absolute PIA this thing is to set up. Nothing makes sense. And I'm a techy guy. It won't let me past wanting to download the app on my cell phone which has nothing to do with ANYTHING.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"It's seems like it's brand new","reviewDescription":"It's super clean and no scratches or anything at all good packaging too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Works great","reviewDescription":"Seems good, works snd I love that it has 256 memory","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great vr for the price.","reviewDescription":"Plenty of free app options.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"vr works 100% legit such a steal for 256 gb","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Amazing","reviewDescription":"Quality is immaculateShipped with careIt has become my favorite way to relax after work","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Satisfied","reviewDescription":"It comes with everything you need to enjoy the oculus experience…satisfied customer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"AWESOME!!!","reviewDescription":"What a ride!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Looks bran new","reviewDescription":"No joke can not tell if this was used or not bought it refurbished premium and it has no signs of use from my point of viewOverall I don’t use it much I did love it at first but then it sad in a box for a while and now my little sisters are enjoying having a screen attached to their faces (what happened to sitting to close to the tv rots your brain)If you want to experience vr this is the best price to do so","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Excellent!","reviewDescription":"Excellent!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Like new. Love it!","reviewDescription":"This has been one of my better purchases from Amazon. I chose to purchase the renewed version because after reading lots of reviews, even some of the new devices have had issues. By purchasing the Quest 2 renewed I got a one year warranty vs just 30 days. When it arrived it was in brand new packaging. The stickers that sealed the box said it was renewed, but if they hadn't been on there I never would have guessed. I am extremely picky when it comes to buying electronics and I fully expected to find a problem or encounter an issue setting it up, but nothing. There isn't a mark on it that would suggest it had ever been used. Every piece in the box was labled, and packaged like new. Setting up the device was quick and easy. I was on the fence about getting one of these, but now I'm sorry I didn't get one sooner. The games are so much fun, one of my favorite being Walkabout Mini Golf. If you love mini golf and you don't own this game you are missing out. Also if you want to travel but can't afford to, the experiences on YouTube VR are awesome. The fitness apps are really great as well and so much fun. I highly recommend this purchase and I'm so glad I didn't buy new. With the money I saved buying renewed I was able to get a few much needed accessories. Thank you Amazon!**UPDATE **Our household has purchased 2 more of these with zero issues. They are so much fun, we love playing mini golf together.","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Remote controls didn’t connect after a week","reviewDescription":"Gameplay is fantastic. Only thing was the remotes started to disconnect during gameplay and it will say “push any button to reconnect” I did that and it never connected. Great game experience though. I’m gonna get the meta quest 3.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"VR","reviewDescription":"Very nice but this took longer to receive.  It was put on the wrong truck per customer service.  And then received around 8 the day after it was supposed to be delivered.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"I was expecting more","reviewDescription":"I mainly got the Headset for Beat saber but was more then happy to try out other apps and games. None appealed to me so I returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Love the system, hate the issues","reviewDescription":"I absolutely love the Occulus; I've owned two so far. I was excited to get this one for my birthday this year and decided to get the refurbished one. I have to be incredibly careful with it because it shuts off if I move to the left too fast or touch the left to readjust it and I am still having vibration problems with one of the controllers. Reaching out to customer support has not been helpful since I am only offered a discount on my next purchase so I have made peace that this is how it is going to be. I love the system, enjoy playing Beat Saber especially but I hate that I am having issues with no recourse to fix them.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1666396800000}
{"reviewTitle":"Not functioning correctly","reviewDescription":"I received the oculus and the day after I got it I finally got to turn it on and it popped up a message saying that the cooling fan isn’t operating correctly. So had to get a replacement.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"Everything came good except…","reviewDescription":"Everything came fine but the left lens would flicker then get dimmer then shut completely off. I looked it up meta’s forums they say just factory reset it so I did and it still flicker other than that it came fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"Left controller not functioning correctly","reviewDescription":"Everything else came as advertised BUT the left hand controller does not let me press the left joystick which I am finding out is critical to play a bunch of games! In some games I cant even get past the instruction videos because of this malfunction. Very irritating.  The refund process is absolutely TERRIBLE bouncing between UPS and AMAZON.  I will never order a gaming system through Amazon again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"Everything great but..","reviewDescription":"Everything was great it’s just the last driver didn’t listen to my instructions n took my package back but now they deliver it to me. I still need a refund on my fast shipping tho😬","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Just buy new. Refurb had issues.","reviewDescription":"Within the first week we had an issue with the right controllers joystick. I contacted Amazon who directed me to go through Meta since it was under warranty. Long story short I have been unable to use this device for almost 30 days because I was required to send in the problem controller for them to replace it. They have had the controller for most of the month now and have yet to send a replacement. Horrible experience, and while the brunt of it is dealing with Meta (Oculus) warranty department…Amazon should have handled this part and just swapped either the whole system or the controller. Other than that it’s a great system, and I have no complaints. Just go ahead and spend the extra $ for new condition.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Product came without being factory reset.","reviewDescription":"For any new user out there, this would be a big issue. When you try to turn the device on, it shows the logo, and powers off. Full charge and nothing. I tried factory resetting the device. Not everyone knows how to factory reset a vr headset, neither would they be willing too if they are buying a basically brand new product. This is embarrassing. Certified by Oculus? I don't think so. Other than that the product is great, extremely minimal wear and tear sign. Disappointed that I had to go through the hassle of resetting the device. If this were truly inspected by Oculus, or now so called \"Meta\", then the device would be ready to go out of the packaging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"Excelente producto pero le falta algo","reviewDescription":"Es un buen producto, excelente diría yo pero es que al momento de jugar y quieres conectarlo a una PC ocupas un cable de al menos 5m para que puedas jugar tranquilo porque si tienes un internet muy malo no te va a servir de nada usar el Air link así que cuando compren sus oculus también compren un adaptador de 5m para que jueguen tranquilos y sin ningún problema","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"Mexico","date":1682985600000}
{"reviewTitle":"bueno, mas o menos","reviewDescription":"Me encanto realmente, es mi primera vez usando VR y desde hace 2 años que quería uno, es una experiencia asombrosa, en verdad lo recomiendo comprar, pero aun así revisen que no tenga ningún defecto ya que encontré un arañazo (leve) en el lente izquierdo :\/","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"Mexico","date":1680912000000}
{"reviewTitle":"Me llegó sin una correa","reviewDescription":"Está todo bien pero se me hizo extraño que llegara con una manchita café en la tela del visor y sin una correa","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1681344000000}
{"reviewTitle":"halft life","reviewDescription":"queria jugar haft life pero nesetitas computadora, entre otras cosas espere para acostumbrarme a los mareos que dan el producto, pero es imposible,  creo que los mareos son por las camaras que se mueven de arriba para bajo pero tu cuerpo no y eso causa que el cerebro se confunda.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"Mexico","date":1648512000000}
{"reviewTitle":"Sus gráficos son muy buenos","reviewDescription":"El único defecto que encuentro es la falta títulos para jugar","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1675123200000}
{"reviewTitle":"Dura poco la batería","reviewDescription":"Lo compre pero creo que le dura muyyyyy poco la batería","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1668988800000}
{"reviewTitle":"Disappointed","reviewDescription":"Bought two for my kids and after having a few months while charging they both stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"NOT CONNECTING TO WIFI even refurbished and now I cannot return it","reviewDescription":"NOT CONNECTING TO WIFI even refurbished and now I cannot return it","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Junk.  Don't waste your money","reviewDescription":"Nothing but problems with this.  Right controller doesn't track properly.  Even spent the $110 on a new controller and having the same problem.  Meta customer support is absolutely useless.  Spent 45 minutes in chat, going in circles with model numbers and serial numbers and changing batteries, doing factory resets, and nothing worked.  Don't waste your money,  not worth buying.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"If you're going to buy this for PC VR, get ANY OTHER HEADSET.","reviewDescription":"For standalone it's good for what it is- but the controllers degrade extremely quickly and paying for replacements is worth more then if you just bought any other better headset.Issues:-Within 4 months, stick drift. [aka the controller walks\/moves for you at random]-Quest 2 FORCES you to sign up for a META account if you accidentally hit \"Don't ask again.\" when asking to connect to PCs. There is LITERALLY no other way to change the option.-Forces you to sign up using MANDATORY debt card AND Meta account.-Battery life SIGNIFICANTLY decreases over time. In a less then a year of consistent use, the battery life will be less then two hours forcing you buy an extended battery pack.-Charging cable doesn't change as fast as the battery drains so for longer time you'd need to buy another accessory.I regret my purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679097600000}
{"reviewTitle":"First one was DOA...","reviewDescription":"I got a chance to see how wonderful VR might be, but there were constant \"SHELLENV keeps stopping\" errors on my new toy. Looked up the error and followed the instructions; restarted it, did a factory reset, connected to the Sidekick app via otb that was supposed to clear the error according to interweb nerds, to no avail. Then chatted with Meta tech support, who didn't offer a fix, but only had me jump through hoops proving my purchase (4 serial numbers for each piece of equipment and the box) in order to send me a 12-day turnaround replacement.So, I am not sure how these \"Renewed\" items are being quality controlled (all it would take is to start it up and look at the screen), but I got a lemon this first time.Will update when the Amazon replacement gets here in 2 days. I was so excited.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1681603200000}
{"reviewTitle":"This caught fire at 2 am while charging","reviewDescription":"My child loved this but it is unsafe and could have burnt down my house.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"We oreded two of these for my son and both did not work.","reviewDescription":"The first one would never completely charge and the second one did not charge at all. So disappointing. It was for my son’s birthday present.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Do not buy refurbished","reviewDescription":"Okay so to start. We had a blast with it. We used the charger it came with and it never seemed to fully charge. So we bought a new charger for this specific one. The charger worked! But the downside is it got really hot while charging. So I kept and eye on it. Well last night my husband plugs it in to charge. When we woke up the charger was stuck to the headset and had melted.This is complete BS. Honestly, I am so upset. There obviously is something wrong with the headset because I bought the charger new. For the oculus quest 2 and now we can’t use the charger nor the oculus.Someone please get back to me on what the heck happened.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Black screen in headset of this refurbished unit","reviewDescription":"The set up instructions are not really clear outside the box. Once you find the set up section, it simply directs you to a website. When you go on the website, it sends you to the app. Once on the app, it asks to follow the instructions in the headset, starting with inputting a 5 digit code. Problem is my headset never moved past the Oculus logo, then it went black. The charging light on the side stayed on and there was no way to turn off the headset or reset since all of that is done through the menu on the headset. I googled why this happened and some thoughts were there was an update that some models did not take. I chatted with an Amazon rep who really didn't understand the product and simply said it seemed as if I had a defective unit and I should return for a refund. This purchase makes me very wary of purchasing refurbished equipment in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"Worthless","reviewDescription":"These things are ridiculously too expensive for the quality of device you get. We're constantly having issues with the controllers and games loading. You should be ashamed of yourselves for making such an expensive paperweight.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"They are good and fun if you receive it in the mail","reviewDescription":"Didn't receive it in the mail orderd a long time ago and haven't seen still mad about it","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Let controller doesn't work.","reviewDescription":"I just got this and before I could use it, I discovered my left controller doesn't work. It will blink an SOS signal and doesn't connect.Meta Support takes forever to help with the problem, I just bought a new left controller. Probably gonna buy a brand new headset too. Don't trust the thing will work for long","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682121600000}
{"reviewTitle":"No parental controls","reviewDescription":"I think it’s pretty lame that it’s limited to one login and there’sno parental controls available since it’s logged in as me, and I’man adult.  They are adding a feature where teens can request their parents set up controls, but if it’s already an adult logged in, not possible.  Which is dumb because I can put app restrictions on myself on my phone if I choose to.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660262400000}
{"reviewTitle":"Not for everyone","reviewDescription":"I personally LOVED the headset, in fact I think it was amazing. By itself it was fast and had some fun games, some. When you would connect to a computer it would always be super low res and buggy even with a 3060. Either way it’s still super fun playing DCS in an f15","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670630400000}
{"reviewTitle":"Refurbished Product","reviewDescription":"I love the Quest 2 and the experiences it brings. However I was disappointed with Amazon and its supplier because when the product arrived as it was labelled as Refurbished Product [see photo] but advertised as Renewed Premium which does not clearly indicate that the product is not new. The price paid was the same as Meta was advertising the same product [new] at the same time and Meta were providing the app \"Beat Sabre\" free with their product whereas the Amazon supplier did not provide this software included in the price. Both Amazon and Meta offered free shipping. The product was supplied with an American two pin plug and required the purchase of an adapter to allow it to be charged in Australia. The product has a 12 month warranty and because it took nearly 3 weeks to arrive from the US, I have decided to not attempt to return the product for a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"Australia","date":1664496000000}
{"reviewTitle":"Returned due to a fault","reviewDescription":"I've bought three Quests before and think they are awesome. Great VR headsets. This product was refurbished and it looked brand new when unboxing. We tried multiple times to get it to connect but it must have had a fault because it couldn't see the controllers or connect to the app on either iPad or Oppo so we had to return it. Looking forward to buying a replacement when the funds are returned.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Australia","date":1690761600000}
{"reviewTitle":"Bien, pero con pequeños detalles","reviewDescription":"Funciona bien, sin embargo a los 2 dias tuve un detalle con la conexión wifi que me costó mucho tiempo resolver, de plano tuve que volver a la restauracion de fabrica.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1687737600000}
{"reviewTitle":"Mala experiencia","reviewDescription":"Creo los voy a regresar, nunca pude vincularlos aparte un mando no vincula solo uno prende y todo pero se queda parpareando, por último ni un día tienen!!!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Mexico","date":1666396800000}
{"reviewTitle":"Envío tardío sin razón alguna","reviewDescription":"En cuestión del producto todo bien, únicamente la fecha de entrega se demoró una semana más sin razón alguna y la caja de embalaje llegó maltratada.","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"Mexico","date":1646611200000}
{"reviewTitle":"Perfect","reviewDescription":"As ordered","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"I have bought games for other this was for me","reviewDescription":"I have never liked video gamesI wanted to feel like I was in the game and nothing came closeUntil last week when I tried the game. With this game you are in the game it is all around you. Within 30 minutes of playing I ordered my game and about to buy one for my grandsons and my girlfriend. I was delivered two days ago and it is easy to learn and the graphics are very good you are in the game get one today.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Came with all pieces described","reviewDescription":"Despite all the bad reviews- (which made me quite nervous about buying..) the product came factory reset, clean, nothing broken, and no pieces missing. I’ve been using it for about a month now with no problems at all (knock on wood!) and I’m hoping it stays that way. I love it so much, and it’s even more enjoyable because it no longer makes me feel motion sickness since now I’m used to it.Little reminders:-MAKE SURE THE LENSES AREN’T EXPOSED TO DIRECT SUNLIGHT!! I know it has a warning on the lenses, but most people overlook it\/take off the stickers without reading.-Make sure to take frequent breaks and loosen the headset every now and then to avoid headaches!-Wipe the silicone piece (where your face rests in) down with a dry cloth between uses, so there’s no bacteria\/sweat buildup.Happy gaming!","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Awesome","reviewDescription":"Brought this for my 7 year old and this thing is great for him. Remember to put your kids on time management though being as though it's directly on their eyes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Grandson's Christmas gift","reviewDescription":"My grandson loved it, it was the only thing he wanted for Christmas . Plays it every day","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Birthday","reviewDescription":"Fast delivery they play with it daily","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Better than expected !!!","reviewDescription":"As a senior, was skeptical and had some fears using it, but I still prefer my my 100 inch projector and excited with some of the VR pics !!!! It can get expensive to buy apps !!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"As good as new","reviewDescription":"Ordered the 256 GB version and it came packed in a box like new. New face cover, glasses extender, original charger and everything worked perfectly. Clean and looked new.Ordered to play with my son and we are having a blast in Dungeons of Eternity together. No issues with this headset at all.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Awesome","reviewDescription":"Works awesome durable and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"A-MA-ZING","reviewDescription":"Best gift i could ever receive!! Only concern is, i have a small head and its pretty heavy but what ill do is tie my hair up onto a ponytail or a bun and that keeps the headset from falling off my face. I may get a headache i may not but if anything ill get a new strap. Anyways this thing is absolutely awesome! Buy it!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Very fun world to explore","reviewDescription":"I am an old guy (nearing 60) exploring the VR world for the first time. The experience is incredible and so realistic. If this would have been around when I was a kid I probably would never have left the house either. Very easy to set up and use and great selection of games to play. I am not connected to my computer and my son tells me there is an even greater selection of games there. I prefer the sports games and playing as an NFL quarterback or a golfer on the pro courses are amazing. I have tried the roller coasters, fighter jets and working on the International Space Station and those games have created a queasy feeling which I have never experienced while in real events. It takes some getting use to, I am told.  I recommend this for anyone - I watched the kids 80-year-old grandmother play and have a blast while on it.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1688774400000}
{"reviewTitle":"Not really happy but","reviewDescription":"I bought the product and i am going to be extremely honest.So when i got the package, it is as it said, the packaging was extremely great, smelled brand new and had everything it said it should haveThe only problem literally was that the right controller was not working. I tried everything available at the time ti fix it, i did troubleshooting and even replaced the batteries and still didnt work, i contacted amazon and got it replaced, i will make a future update with the new device and hoping for the best.Btw the amazon customer service was insanely helpful, and for that reason i am not upset as much because he really went out of his way to help out. I will be updating you all with the new one i promiseUpdate july 28, 2022So as i promised i got my new product and as i said , the customer servce did help, i got the new oculus and i have been having it for a week and so far no problems and everything is great so i do recomment getting this product cause at the end if u have a problem, customer service is there for you","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1658361600000}
{"reviewTitle":"Low priced, Perfect VR","reviewDescription":"I got this for myself, and it is awesome. Its price is 30 dollars below average, and it came in perfect condition. It looks brand new, and it comes with all the supplies it needs. It came in on time also.  This is great for any age!!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Works well","reviewDescription":"Good quality  bought for son","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"The BEST exercise EVER!!!","reviewDescription":"I bought this meta quest because I felt bored and fat...the more pounds I put on the less I wanted to exercise.  So NOW I am so crazy about playing Beat Saber!! You have to duck, dodge, and crouch while you slash at the objects coming towards you....all to the beat of awesome music.  I also have been able to see places in the world in VR that I would never be able to see in real life! There's tons of different apps you can buy from within the headset, with a lot of really cool games....I'm 61 and have a blast \"shooting\" the enemy in \"Medal of Honor\". I HIGHLY recommend meta quest 2 to any and everyone who wants a little more enjoyment out of life.  I also bought one for my grandson and he is wild about it...loves, loves it! If something ever happens to this one, I'm buying another immediately!!","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"For the man","reviewDescription":"He loves it but complains that all the younger kids are whooping his a*$ but we aren’t that old promise! 😂","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"It’s nothing like I’ve ever seen before.","reviewDescription":"My kids and I love this. It really gets us going ! Lol we love the game TOSS ! You should get it lol most definitely an adrenaline rusher lol I’ve gotten a lot of games and so far this has been the best game purchase I’ve done. It’s the 2nd game system I’ve bought. The first being the Nintendo switch.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Motion sickness!","reviewDescription":"This unit has worked perfectly with ZERO scratches or imperfections.  Family is having a blast with Beat Saber, Mini Golf, Population: One, and VR Poker.  You will definitely get some motion sickness with this if you are sensitive.  Even though the Avatars are more comic looking, it is real enough to freak your senses out.Be sure to put on the silicone cover over the foam that presses up against your face.  You will get sweaty on some games and nobody wants to share your sweat.  Also highly recommend getting the headset attachment with additional batteries.  Much better comfort than the strap that comes with it and the included batteries only last 2.5 hours.  For casting to a TV, don't recommend going through your phone.  Instead buy a ChromeCast and cast directly from headset to chromecast.  Latency is seriously reduced.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"Fun at 46!","reviewDescription":"I LOVE LOVE LOVE my Oculus!  It has so many apps!  VR is a blast!  I just downloaded some fitness apps that make working out so much fun!  I am thrilled that I decided to go ahead and get one.  I did buy the refurbished one because I am a cheap a$$ and I know that I can trust Amazon with my purchases.  It came packaged as if it were new.  I went over it with a fine tooth and found no indication that it had even been used before.  Very pleased!  No issues.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Too much fun! Everyone in the family will enjoy!","reviewDescription":"Ordered this for my son’s birthday several months ago. Our first time having a VR device. This is so much fun and easy to use. We downloaded several games and found that the hardest thing is figuring out who is supposed to go next. There’s a lot of content available whether you want to game, enjoy virtual traveling, or whatever you feel like. The home location is customizable and you can even sit down with the headset on and watch Netflix or ESPN on a big screen in front of a fireplace (all virtual of course). We haven’t even begun to tap into the full potential of what it can do.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Loading...","reviewDescription":"The problem might be more a software than a hardware problem but if you're the kind of person who likes endless loading screens this is for you, ive spent more time staring at dizzying sickening loading screens than I've spent with actual content, and that excludes when it just Starr flashing endlessly, have no desire to venture into VR again after this","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Issues with product","reviewDescription":"Controllers come with terrible stick drift. headset has never been able to hold a charge for more than 30 mins i bought this for my friend and its already almost non playable it has so many issues like the screen came burnt with sun damage I WOULD RECCOMEND BUYING THIS FROM THE ACTUAL OCCULAS WEBSITE!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Be aware that this product is refurbished!","reviewDescription":"I really wanted to get into VR with this headset, I really do, but this product came messed up twice, first time, I got a faulty controller which couldn't connect and a broken charger. OBVIOUSLY I returned it in hopes of getting a new one that worked. But today I got the package opened up and tried to configure it but this time both my controllers wouldn't connect, which frustrates me because it was a complete waste of time, two whole weeks for both of my headset getting in poor conditions. I really want to make a good review of this item but I can't recommend it unless you except broken items.I hope that they start verifying that the items they refurbish actually works and don't throw us broken tech, really frustrating...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675296000000}
{"reviewTitle":"Disappointed in Amazon","reviewDescription":"Got it on 28 Already filing a claim the  device will not will not pair reach out to Amazon was told I’ll be contact got  an email apologizing about the delivery delays and that i should wait till the 31. really how you go from the device is not working to not deliverTill  today I have not  heard from Amazon had to meta those guys were amazing but they could not get it to work so end up filing a manufacturer claim no thanks to Amazon feel I should get compensated for all the trouble I’m going threw but of course I’m fooling my self one thing is certain next time definitely not with Amazon these equipment are the same price so if you. cannot bring up the experience what’s  the point getting it from you","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1667433600000}
{"reviewTitle":"WORST PRODUCT EVER!!!!!!","reviewDescription":"Do not buy from these people! They re-sell refurbished Oculus's that only work for about two weeks before the left controller simply dies and cannot be fixed with every troubleshooting method in the book! They're a sham selling damaged goods and should be put out of business!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Los controles no funcionaron","reviewDescription":"Los controles no se conectan, no hace enlace, al parecer están dañados","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Complete P O S - did not work","reviewDescription":"Opened it and was excited to use it.  It required an immediate update of software.  Worked fine until then.  Directly after software update - no screen. Only music.  Complete waste of money, time and excitement.  Would NOT recommend. Now I have to spend all my time troubleshooting and fixing a broke *** POS that I just purchased.  Annoyed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Broken doesn't work","reviewDescription":"We got this for my son as a Christmas gift and it doesn't work. He was so excited and now bummed. We have trouble shooted everything possible. Just go to their site and get this product for 250.00 either way your paying the price for a new one that's not messed up previously, do not make the same mistake my husband and I made.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Refurbished and poorly","reviewDescription":"The description does not directly tell you this is a refurbished model, it is.  Badly (mine at least).  I've included a side by side photo of the same model but new from Oculus and you can see that the new model comes with a soft rubber face lining for easy cleaning.  The refurbished is just foam (it'll absorb sweat and you can't clean it, this will quickly ruin the lining and have to be replaced).  Returning these things are a massive pain and the price drop is only slightly less than just buying a new one from a proper store.  Strongly recommend going elsewhere for this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684454400000}
{"reviewTitle":"Sadly I tried. Don’t do it.","reviewDescription":"Had mine for 2 weeks. Sensors are incredibly off. NFL pro, is a dumpster fire and every game you get is about the same 2-3 movements. Most games are low gigs so buying the high gig meta is a waste of money. During games will move bounds to the point your never inside of your bound and will mess up most of your experience. I’ve been a lifelong gamer so the fact I’m having this many issues with this says something. If you buy expect to have some wonky experiences. That’s not even including how lotion sick you get trying to get yourself out of it. Just a heads up and warning to anyone thinking about buying it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1678233600000}
{"reviewTitle":"Refurbished product","reviewDescription":"It wasn’t clear this product was refurbished until I got the box and it said it was. I didn’t know I was buying refurbished by the post and the audio is crackling. It’s fun but I’m very disappointed and don’t know how to get support","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"Didn't work properly.","reviewDescription":"Unit would not power on. Charging the battery all night would show 90 percent power, then revert to saying 0 percent battery. Usually I trust buying refurbished. They should have been tested prior to shipping, yeah? Wouldn't recommend due to being a waste of time and a disappointment to the kids.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"Still heavy on the front and Hot","reviewDescription":"Uncomfortable if you need 100 plus upgrades to make it usable not worthy. It could have better resolution but on the old quest the blacks are much much better...going back to my old quest...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"NOT WORKING","reviewDescription":"THIS IS NOT WORKING -HAVEN'T BEEN ABLE TO GET THREW ON PHONE --THEN OUT OF SIGHT OUT OF THOUGHT --SO I'M GLAD THEY SENT ME A SURVEY SO NOW I REMEMBERED CAN SOMEONE REACH OUT TO ME THANKS KIM PEAKE","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680566400000}
{"reviewTitle":"Eye strain","reviewDescription":"When this product came one of the hand controllers was prone to glitches, on top of that, this product will cause eye strain. I expected this but expected that it would happen after prolonged wear, within minutes it can cause strain.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Don't Buy Refurbished From Amazon","reviewDescription":"I bought this for my wife from Amazon refurbished and we could not get it set up. She called Oculus and they were not helpful at all. Ended up returning it because we could not get it to function.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1684195200000}
{"reviewTitle":"Bad product","reviewDescription":"Worked for less than 3 months and just stopped.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Allergic reaction to headset","reviewDescription":"The VR set isn’t bad but my son used it for about 3 days and he had a bad allergic reaction to wearing the headset. There is something apparently in the foam that goes around the headset that cause this. Had to take him to our doctor to have him look at it. So just be aware of this.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Couldn't use the commands to update it","reviewDescription":"I couldn't use the product. The joysticks wouldn't work and I couldn't update it. Oculus support takes ages to answer. A month ago they said they were going to contact me when there were news, they wrote me but they don't answer when I write them. I'm really angry :(.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"Artículo defectuoso","reviewDescription":"El artículo llegó rápido pero yo pedí 256 gb y me mandaron 128gb y además no hubo forma de conectarlo parece q venía con defectos lo tuve q devolver y pedir otro ojalá y este llegue bien para poder cambiar la opinión q tengo de ellos","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"Oculus Quest 2","reviewDescription":"My first impression was elegant and smooth. Haven't use it but I know I will. My only issue that you need a Facebook account to use the device.  Let's have fun!","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"Limitless Capabilities","reviewDescription":"Purchased at a discount from Amazon renewed, came in excellent condition. Battery can drain quickly, can become uncomfortable after prolonged use. Other than that, great product exactly as described! Hours of fun.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Its great but…","reviewDescription":"Its great and I enjoy it, but it seems when i used it the first time it died in like an hour, which it shouldn’t die that quickly, but its still great and i love it!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"En buen estado pero podría mejorar","reviewDescription":"Me llegaron bien, pero tuve que formatearlas porque no me dejaba vincularlas a mi cuenta y después tuve que vincular los mandos manualmente porque no los reconocía, además de tener un pequeño rayón en uno de ellos lentes, no hay problema no se nota, pero podrían revisar mejor sus productos Renewed","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"Worth it","reviewDescription":"Renewed or what it’s hardly noticeable tbh there’s a crack on the right but honestly it works and saved money to buy the games I wanted and not “given” games at a higher cost. Renewed $345+tax= 375+beats saber w\/ music pack $39.99+noun town $14.99+=$430 V. brand new 399+tax=$430+ default songs on beat saber $0 (your going to want other music) $0 + resident evil=$39.99 ( I don’t play it) $0= $430.So weigh out your option to have these games or used the change to buy the games you want","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Must continue to buy games","reviewDescription":"My daughter likes it but it’s a never ending buy this and buy that..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"A lot of fun!","reviewDescription":"The future is now. Very cool lots of fun. To the people complaining that it didn't come with a case because the pictures show one. The box it comes in is literally a case. Just like a lot of products. Please stop killing our planet. Recycle when you can.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Fun","reviewDescription":"It’s fun but definitely makes your nauseous and pretty hard on the eyes. For the price it is pretty good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Started stuttering after a few months of use","reviewDescription":"It's very nice, and very liberating to play this way, but it's starting to stutter in most games, and it wasn't when I got it, but no damage has come to it","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Great options from excitement to relaxation.","reviewDescription":"We are in our 50s and the options are incredible from exciting games to get adrenaline pumping to relaxing golf or yoga. Can be a little tricky at first to figure out the ins and outs of the games and linking up with friends online but once you get through the technical things it’s endless fun even for us older people. This isn’t just for kids. I would’ve given it 5 stars if it wasn’t for the learning curve.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Amazing experience. Poor realbility","reviewDescription":"Received it in March-14 ,Used it about only a week. Suddenly got what I understand is a known ocolus issue. \"Black screen of death\" tried to clean lenses and sensors,boot the device and factory reset. Nothing helped. So I did contact ocolus for support but after some details exchange they told Me my country is not supported. Already spent 100$ on games & apps which now I can't enjoy.. I'll return this and don't think of replacement as I don't want a poor realbility product with no real support from the manufacturer. Hopefully my device will not be sold as \"refurbished\" again...","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1647648000000}
{"reviewTitle":"Could not access","reviewDescription":"We received this for our granddaughter's birthday.  It was \"connected to another account\" therefore we couldn't set it up.  We are sending this one back and re-ordering another one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"Seriously disappointed","reviewDescription":"So I got my quest delivered on time by Amazon. When using it I discovered it was slightly blurry on the right side. Upon closer inspection I saw there is a scratch on the INSIDE of the lens. It is directly in the field of vision and makes the experience useless. Soooo disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Terrible purchase","reviewDescription":"The quest worked for five minutes before blacking out, the system ram fine but I couldn’t see anything! Then there were a bunch of strange error lights. It was terrible and I’m very disappointed. I hoped to join my family with meta as we have many other systems and I took a chance on Amazon. Never again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"product was defective. I will never buy a refurbished product again.","reviewDescription":"I purchased this item as a refurbished product. I thought I was receiving an item that worked. I was wrong. I ended up contacting Meta Quest customer service and they explained that this produced was purchased at best buy, returned to Amazon, and product was defective. I will never buy a refurbished product again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1674777600000}
{"reviewTitle":"Too many kinks, should have waited a year to release it","reviewDescription":"Considering that as of the time of this writing Meta still hasn't fixed the pairing issue,  I find it incredibly embarrassing for them.  Without the ability to pair the device is little more than a sci-fi mask to a Halloween costume.  Went online to live chat technical support and was basically told, yes we're aware of the problems with pairing,, our engineers are working on it,. Good Day.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"Item did not work.","reviewDescription":"Sent product back. It did not work at all, and smelled like cigarette smoke. If I could give zero stars I would. It was a let down for my son who just turned 12 years old, and was so excited to play on it after waiting so long for us to be able to purchase one. I hope they give us our money back!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Save yourself the headache","reviewDescription":"This garbage doesn’t work. Purchased for my son’s birthday. I have been troubleshooting, installing, re-installing, downloading this device for HOURS NOW and nothing works. It pairs on my Bluetooth and says that it is connected but the app just says “pairing” and nothing else. I’m so disappointed for my son. Definitely returning this trash device","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Buyer beware don’t buy refurbished buy new","reviewDescription":"This unit wouldn’t load up after turning on. Tech support is useless on this product. Both the manufacturer and Amazon couldn’t resolve the issue. After doing research I found this is a very common issue with refurbished units not working due to software updates needed. It’s impossible to update this unit. Asked for a refund and that process is just as bad, still waiting!  BUY NEW! Fix this Amazon!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669507200000}
{"reviewTitle":"Broken item","reviewDescription":"First of all this item was suppose to be 90% charged.  But it was 90% dead.  Second the headset was locked.  We tried everything to get it to work.  We even reached out for help through the oculus company and different things to do to get it to work on line but I thing worked.  So we are sending it back for a refund.  Thank you anyway.  Brenda","isVerified":true,"ratingScore":1,"reviewReaction":"46 people found this helpful","country":"United States","date":1644537600000}
{"reviewTitle":"different app store than oculus rift, and oculus link is hot garbage","reviewDescription":"constant battle trying to get oculus link to work.  a typical play session usually involves taking off your headset 2+ times to get link to work.  They've been working on this stuff for years now and they still dont have the 'simplicity' thing downDont buy this if you're expecting to have your oculus rift (PCVR) games work natively on quest 2The UI is nice looking but day 1 of me purchasing this was just getting notified when users who werent on my friends list joined their home (like - why would I need to know that?)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658188800000}
{"reviewTitle":"Bad","reviewDescription":"It was good for a while but the right controller broke and the warranty ran out before I even got it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"So much blur it hurt my eyes :(","reviewDescription":"I don't know if I got a defective item or not. But I tried everything to get this thing to work and be viewable. I had to be centered directly at something in order to see it clear. Moving 1\/4 of an inch and then it was blur and all outside of the little tiny centered section that was clear was all blur. I really wanted to make it work. Downloaded a few programs but couldn't get them to work with the headset then finally gave up :((","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1648425600000}
{"reviewTitle":"Did not download correctly. Right controller just spins😳","reviewDescription":"Did not work properly. The screen kept going down on the picture over and over","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Thing didn’t even work","reviewDescription":"Wouldn’t connect to the controllers or my phone, said it needed an update but I wasn’t able to get past the controller screen oculus support told me to factory reset the device to force an update but that didn’t work now they’re saying a lot of people are complaining about this and that they’ll let me know when it’s fixed. Until I’m able to use this product review will stay 2 stars","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665360000000}
{"reviewTitle":"AirLink seldom ever works. Getting games on Steam to play is a nightmare.","reviewDescription":"It's a step in the right direction, but these headsets definitely still need like 5 more years time for them to work out communicating over Wi-Fi and with PC\/AirLink.400$ for this headset, and it won't even connect to my PC half the time. And when it does, the virtual space is all messed up and playing games is impossible.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676160000000}
{"reviewTitle":"Motion sick","reviewDescription":"After about 30 mins it becomes unbearably hot and not to mention the motion sickness, I’ve returned the product but Amazon keeps giving me the run around and not refunding the money, super bummed out by this experience.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Out of box was fine but didn’t work through link","reviewDescription":"Out of the box was fine and for about the first 10 minutes through link it was fine, then it started freezing constantly and it was unplayable. I tried for a week to fix it but nothing worked, even tips from the official website. Do not buy this even though it’s on sale, you’ll end up having to send it back anyway. Just get the extra $50 and buy it off of the official site.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661472000000}
{"reviewTitle":"Battery dosnt last","reviewDescription":"Its a fun lil head set but the battery im lucky lasts a hour before its dead.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Missing charger","reviewDescription":"Everything was amazing until the vr died and there was no charger found in the box!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"An arcade, gym and more!","reviewDescription":"It's like having an odd kid room in your own home. If you don't like to work out, this thing will make you work out and have fun at the same time. Playing miniature golf, real golf bowling darts. And many more games. Or do you like shooting games this is the system for you. Boxing more. It is fun to play boxing games. The games are too expensive. And there's a lot of free stuff on there too. Just remember I have plenty of  Make sure you follow the directions on how to take care of it. Remember you're dropping four or 500 bucks on this thing. Seems like a lot but it pays itself off after the usage. Make sure to watch YouTube videos on what games that play that you seem interested in.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"Great","reviewDescription":"Works great brand new in box never opened easy to set up and use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Favorite present","reviewDescription":"My nine year old twins each got one. They enjoy playing with their friends. Very heavy on the forehead. Makes me dizzy to use, so I couldn't help them get it set up, but they managed to do it on their own.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"THIS REFURBISHED VR IS AWESOME ! ! !","reviewDescription":"This Meta Quest 2 - Advanced All-In-One Virtual Reality Headset. I was initially skeptical since it is Refurbished, plus it's made by Facebook.  However, it has exceeded my expectations. I bought it for my son, and it works well.  It was very easy to set up and the battery life is very good for a Refurbished item. Very happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"A great improvement over PSVR","reviewDescription":"No tethered cable, no head tracking drift, no camera losing your position, better controllers (I have yet to replace their batteries in the months I've owned them).  Fewer games bother to use advanced textures making most games appear like the best the PS2 had to offer, but that doesn't take away from the immersion.  I play two rounds of Walkabout Mini golf almost daily and head to Pistol Whip or Ragnarok to break a sweat.  Many games have demos or trials and most go on sale eventually. A recent update has made everything feel more responsive. I lack a FB account and easily steer clear of any chat room or social apps.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Great invention","reviewDescription":"My 15 year old loves it!! The whole family loves it! It’s too cool!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Awesome Product. Highly recommend","reviewDescription":"One of my favorite electronic items I have bought in a long time. Great for a workout without much effort and lots of fun.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Love my Quest2","reviewDescription":"It does more than you know. I don't know what I'd do without it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Really great","reviewDescription":"We loved this product, it is excellent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"ITS FAABULOUS BUY","reviewDescription":"I got this product for my grandson for Christmas, he absolutely LOVES IT. Even I tried it out and what was amazing. I would recommend this product as a good buy for the family.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703808000000}
