{"reviewTitle":"A major step up from a PS4 PRO (and previously, PS3)......faster and better graphics....","reviewDescription":"UPDATE 1\/26\/2024:After using the 4K DVD player functions of the PS5, I've got to say that the over-all quality of resolution and clarity of 4K Blu-Rays beats my stand-alone 4K DVD player by a lot! The PS5 has a a very clear, noise-free output that simply excels for graphics, gameplay or whatever the PS5 is displaying. Sony did a superb job with the video output hardware of this 4K console and it will not disappoint. My stand-alone 4K player s currently in storage. If you want to see 4K Blu-ray media at its very best, the PS5 is the way to go for a do-it-all console!-----------------------------------------------------------------------------------------------------------------------------I'm not going to review the Amazon selection or delivery process. I'm just going to briefly review about why I upgraded to a PS5!First the negative....... my PRO was compact and reasonably designed in a flat symmetrical style......  The PS5 throws out the space saving rule book in favor of waves and advanced looking style and it'll not fit where your PS4 PRO was if it was in a tight space.Be aware that although the PS4 and PS4 PRO had 4K HDMI output for games, those PS4 models were limited to playing only 1080 Blu-Ray or regular definition DVDs.  The PS4 will not play 4K Blu-Ray disks. Why Sony left that feature out, who knows!  The good news is the PS5 DVD deck plays 4K movies to their full resolution. (as well of course as Blu-Ray 1080 and lower resolution\/standard def DVDs). Now I only need my PS5 in the living room to cover it all rather then the 4K blu-ray player I had to use along with my PS4 PRO.I own several PS4 games and have yet to purchase any PS5 games.Let me say that my PS4 games play better on the PS5 then they did on the PS4 PRO. Graphics are superior, speed to access any menu or just in game play is much faster and these PS4 games take on a new and improved view on screen on my 65\" 4K hdtv!I can only imagine how great games specifically designed for the PS5 will be to view and play.My initial perspective on the PS5 compared to my PS4 PRO is that although the body design for the PS5 sacrifices space and fit for cosmetics...... the PS5 blows away my PS4 PRO (my PS4 PRO is using an upgraded 2 TB SSD for more capacity and much faster access\/read speed than a spinning hard drive).....Speaking of SSDs and upgrades; the PS4 used the common SATA 2.5\" internal SSD for upgrading capacity and speed. (But) The PS5 has a soldered in ~860GB internal SSD which can not be removed. Sony added one slot for expanding the hard drive capacity using rather a plug-in PCIe M.2 NVMe SSD over a conventional SATA connected hard drive. Thus, the PS5 allows you to not replace the original hard drive, but, to add an additional on-board SSD instead.Typically, the soldered-in or card type SSDs are a bit faster then using a SATA based protocol connection and given the PS5 requires a very fast solid state hard drive, they designed it so you install an additional PCIe type SSD over replacing just the single hard drive as it was done in the PS4.Be advised that (some) PS5 games take 2-3X more capacity then a PS4 game did. Perhaps why Sony designed the PS5 to add more capacity by using a second expansion slot rather then like the PS4 just having only one slot to use for the total capacity.Google PS5 SSD upgrades and there's much info out there regarding how many games you want to be able to store on the console and how large an upgrade you need to do accordingly!Everything on the PS5 is faster........everything......menu, access, games ...graphics are better in detail, clarity.......I could go on.The other thing the PS5 asks you to do when you first set it up is a complete setup for display for best gamma, brightness, contrast, color, etc......it takes you through a complete and easy set up to -maximize- the quality for display on your HDTV. It made a huge difference on my Samsung 65 inch 4K TV.5 Stars all around! Read the pro AND owner\/user reviews on this new PS console. Yes, it is worth upgrading.The ps5 is a totally new and better gaming console. It's the first to be backward compatible with PS4 games, ...something my PS4 PRO would not allow for my PS3 games. So if you have a PS4 game collection, don't get rid of them!If you own a PS3, PS4 or PS4 PRO, yes, it is a worthwhile upgrade and substantial evolution for the PS Game Console series. You will not be sorry for upgrading and a big upgrade it will be!","isVerified":true,"ratingScore":5,"reviewReaction":"188 people found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"Was worth the wait!!!","reviewDescription":"The PlayStation 5 is an absolute powerhouse of gaming technology! From the stunning graphics to lightning-fast load times, every aspect of the gaming experience has been elevated to new heights.The DualSense controller's haptic adaptive triggers add a whole new level of gameplay that I never knew I was missing. Plus, the backward compatibility with PS4 games ensures a vast library of titles to enjoy from day one.It was definitely a challenge to get my hands on one, the PS5 has exceeded all my expectations and then some. Worth every penny for any avid gamer!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Crazy-Fast Delivery. Console Works Perfectly. Glad These are Easier to Buy Now.","reviewDescription":"If there's a chance for you to order one of these and get 1-Day shipping, I highly recommend that. Mine was delivered in perfect condition and it worked amazingly well out-of-the-box. Overall 5 stars.In case there are any buyers out there that want one of these and are new to how they work, or want to know how to set it up best for their family, here are some things to know:1. The God of War Ragnarkök game comes as a digital code, so expect that versus the physical game (I thought it would be a disc, but that's probably because my expectations of bundles are still stuck in the PS3 era). I redeemed my code, but I've not loaded the game yet (when it's nearly 100 GB, I'm going to wait on this until I've earned the Platinum of Final Fantasy VII Remake).2. The controller works REALLY well and the charging cord is efficient, though if you can get a dedicated charging stand, that wouldn't hurt since the cord can sometimes be finicky. I think these can be purchased for $25ish, so if you have the cash to spare, that's a worthwhile addition (it also apparently helps the battery life of the controller).3. If you're new to how the PS5 works, here's one thing to keep in mind: PS5 games can only be played if they're stored in Console Storage. If you plug in an external drive, PS5 games stored there cannot be played. Doing that just saves you the hassle of reinstalling them. From what I under, internal storage is expandable, but you need to buy a special hard drive chip-thing dedicated for the PS5 to make this work. I've not invested in this yet, so if you stick to the storage you have, prioritize the PS5 games you want to play.3.5. If you use an external drive, have that be dedicated to your old PS4 games. They'll play like a dream.4. When it came to transferring console data, it was done within an evening for me. If you're starting fresh on the console, don't worry, but if you are transferring data from a PS4, expect to play your games to be playable in about 2-4 hours. Make sure to look up guides if you've never done the transfer before. Videos are also really good resources, too. Also, definitely use an ethernet cable to help with the process.5. Make sure Game Sharing is turned on if you have a family. This is buried in the settings, but if you find it, this will allow you to have the various profiles play the games the others have bought. Save you money from re-buying a game all over again.6. The disc drive can run loud when it's first loading up the game. It'll make you wonder, \"is it ok?!\" Don't worry. It is actually ok.Those are the big things I think are handy to be aware of before buying one of these. Overall, I have no complaints. It's done everything I've wanted it to and it's helped my brothers and I play together far more easily.","isVerified":true,"ratingScore":5,"reviewReaction":"142 people found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"A Mythical Adventure Awaits with a Next-Gen Console","reviewDescription":"The PlayStation PS5 Console – God of War Ragnarök Bundle is a magnificent pairing of cutting-edge gaming technology with one of the most anticipated titles of the year. The PS5 console itself is a marvel, boasting lightning-fast load times, stunning graphics, and an immersive gaming experience thanks to its haptic feedback-enabled controller. The sleek design of the console is a visual treat, making it a centerpiece of any gaming setup.Now, onto the gem of this bundle - God of War Ragnarök. This title is a masterful continuation of the saga, with breathtaking visuals, intricate storytelling, and fluid combat mechanics that the series is known for. The game exploits the PS5's hardware capabilities to the fullest, rendering a richly detailed mythical world that is a joy to explore. The narrative is engaging, with a well-paced storyline that keeps you on the edge of your seat.The bundle offers a good value, especially for fans of the God of War series, providing an opportunity to dive into this new adventure while enjoying the enhancements brought by the PS5. The inclusion of additional accessories like the controller and a digital code for bonus content is a nice touch, enhancing the overall value of the bundle.However, availability might be a concern given the high demand for PS5 consoles and the popularity of the God of War series. It would be wise to grab this bundle if you come across it.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Good console","reviewDescription":"Great console. My son loves it","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Great step up from old gen","reviewDescription":"This is a very good step up from old-gen consoles and what all of us have been awaiting. The console is a bit heavy and big but has great performance which outweighs the cons. The Ps5 offers newer features and better performance than I thought as I had a ps4 slim before. The controller is the main star of this upgrade, it has haptic feedback which in short is better rumbles than before and provides better immersive feelings for us players in each and every game.The Pros outweigh the cons of the console as there are many more pros that I cannot fully list as the list would go on and on. I fully recommend this whether it'd be for yourself or a gift to a lucky person.Pros:- All next gen features including playback- New design\/ futuristic- New controllers- CustomizableCons:- Heavy for a console, being 9.3 pounds!- Easily scratchable interior\/ black glossy part.- Uses a good amount of power during play and when left in rest mode.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Great gift","reviewDescription":"Got this for my husband and the controller and game  are great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Terrific price great delivery","reviewDescription":"Perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Gang system","reviewDescription":"Worth every penny would recommend and buy again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Excelente","reviewDescription":"Excelente producto, llego un poco rota la caja pero el playstation llego en Excelente estado","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"A Mix of Excellence and Disappointment","reviewDescription":"The PlayStation PS5 Console – God of War Ragnarök Bundle is undoubtedly an enticing package for any gaming enthusiast. The combination of powerful performance, stunning design, and a highly anticipated game like God of War Ragnarök is hard to resist. However, my experience with this console has been a blend of delight and disappointment.Outstanding Design and Performance:Let's start with the positive aspects. The design of the PS5 is nothing short of exceptional. It's a true eye-catcher with its futuristic aesthetics and sleek contours. In terms of performance, this console delivers in spades, providing a truly immersive gaming experience. The visuals and speed are top-notch, making every gaming session a joy.HDMI Port Woes:My disappointment arises from an unexpected flaw: the HDMI port. After just six months of use, I encountered issues with the HDMI port. It's disheartening to invest over $500 in a premium gaming console only to find out that an additional $120 was needed to fix a recurring problem. It was even more disheartening when I learned that this issue is not unique to my console but has affected many users.In conclusion, the PlayStation PS5 Console – God of War Ragnarök Bundle offers an amazing gaming experience in terms of design and performance. However, the frustration caused by the HDMI port issues is undeniable. Sony's reputation for quality products makes such an oversight disappointing. It's a reminder that even the most impressive packages can have their flaws.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Wrong box!","reviewDescription":"The console itself is fine, I paid extra for the God of War bundle and I got spider man.. 😒.. even the box had spider man. Too much of a hassle to send it back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"After 15 months","reviewDescription":"It's only been 15 months since I bought this for my kids for Christmas and the controller I bought with this package is broken. The left thumb stick is drifting as well as the second controller we bought separately. I've heard this is a known issue but wanted to warn people before buying that you will need new controllers in less than two years.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Warehouse orders really need to be checked","reviewDescription":"Ordered this item from Amazon Warehouse due to the price discount. Upon arrival, it was immediately clear the disc drive wasn't working properly. Amazon customer support offered little help. Basically told me I could do a \"return and refund or just keep the broken system\". I ended up contacting Sony and since the system was still under warranty, they got it fixed and returned at no cost.Had the warehouse workers checked the system before selling it, they could've circumvented this entire ordeal or at least made a note on the sale item that it had an issue.System itself works great now, everything else came as advertised, minus the outer paper wrap art but that's not the end of the world.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Ordered PS5 Ragnarok, Got Horizon instead, but Amazon fixed it","reviewDescription":"I ordered the PS5 God of War Ragnarok bundle, but received the PS5 Horizon Forbidden West bundle instead. Naturally, I did not want to return the whole system and try again so I contacted Amazon customer service.  It was definitely a hassle to connect with a real person through chat as the customer service on order issues does not allow for much flexibility of issues and the initial chats were useless AI, but I did eventually connect with someone who was able to give me a partial refund so that I could but the correct game. As for the system, it was easy to set-up and it works terrific, but the games take forever to download. I am used to plugging in a system, inserting a disk and playing within minutes. The game I downloaded for this system took about an hour. Even a game I bought on disk took several minutes to download before I could play.  It's a minor inconvenience in the grand scheme of things, but kind of frustrating when you are excited to tear open a box and start playing with the new toy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677283200000}
{"reviewTitle":"Console is fine, Game coupon not working","reviewDescription":"The console arrived swiftly and was in an excellent condition.The only thing missing was the game coupon. In was shown as expired in the store, further conversations with Amazon and Sony support didn't result in anything. No game, no money back. Dissapointing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"Great Graphics , But......","reviewDescription":"Everything about the Playstation is great except for the games.  The top rated games such as God of War: Ragnarok and Horizon: Forbidden West are good games, but not great.  Graphics are great, but they are a grind to play.  A game system is only as good as their games.  I also have Nintendo Swith that I bought for my kid, and Zelda: Breath of the Wild is the best game I have ever played and is not a grind to play.  Both my kid and I have played it at least twice.  We are looking forward to Zelda: Tears of the Kingdom, which I have pre-ordered.  The Switch is also cheaper.  If you've got to have the latest and greatest system, then overspend on the Playstation or XBox, but if you're smart, you won't fall for the hype.  Get the Switch.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Artículo equivocado","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Great system, poor support.","reviewDescription":"I've had the system for about 3-4 months. I've had to reconnect the controller twice. Recently the controller has disconnected again and won't reconnect with or without the cable.I've followed the troubleshooting steps 4 times on 3 separate occasions without success. I filled out the support request form over a week ago and haven't received a response other than the confirmation.Edit: I was able to get the controller working again, only took another 2 attempts. Hopefully won't need support from Sony since they don't seem to respond in a timely manner.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680998400000}
{"reviewTitle":"PS5 is an Powerful Gaming Console","reviewDescription":"I really like the PS5, but being 73 years old and having arthritis in my hands makes it difficult to play more than 30 to 40 minutes at one time. I do feel that a lot of the games are to difficult for someone of my generation. Instructions are poor and you fine yourself searching the Internet for solutions.  My question is: Why do younger people feel they need so many bloody combat games?  I personally would like to see more strategy and puzzle solving games. Just my opinion.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681603200000}
{"reviewTitle":"Two things wrong with it","reviewDescription":"Ps5 works great but the game god of war that it comes with its already used by someone else code is already taking and next thing was there was no charging cord for the controller I’ve already returned this item bundle so just letting everyone else know thanks have a great day","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Connectivity issues","reviewDescription":"Game play on this machine is amazing. However, online activity is a serious problem on my example. It wouldn't connect to my internet initially and I had to contact my provider to set it up. So it connected after that. Now it drops the connection randomly and won't connect again. I have to turn it all the way off and back on to connect. Will probably return this soon as it's the only device that gives me so much trouble. Apparently it's a common issue. Seems like they would fix it before sending anymore out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671321600000}
{"reviewTitle":"Not happy about the help i got","reviewDescription":"I have only had my system 3 months and I got no help when my controller button went bad I have only played the game 10 times maybe and the buttons stop working. Not happy when i did get help I have to pay to send the controller in to get fix. Would not recommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Disappointed about the voltage","reviewDescription":"I don’t know what that white dot is but it’s something that’s  standing out . Also I am disappointed as the voltage says 120v and not 120v to 240 . I am taking it to Europe for a gift and I don’t think it works over there. When I googled it, it said  that its a dual voltage but on the plug it says something different  I am returning it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"The Controller is AWFUL","reviewDescription":"I have been a playstation person for the longest. But this... This is not ok. This controller was seemingly made to cause nerve damage. It doesn't make sense why they would make you apply more pressure for the r1 and l1 buttons, set aside the trigger haptic problems. I only played this thing for 3 days. My hand feels abused.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1680566400000}
{"reviewTitle":"Lector de Discos","reviewDescription":"Mi malestar al hacer esta compra por amazon warehouse, compre al vendedor en donde especifico que solo la caja estaba rota, pero sorpresa, el ps5 no funciona el lector de discos. Me siento estafado, lamentablemente no puedo pedir reembolso porque soy de Ecuador, pero si siento molestia por la accion de estafa.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Me esta dando una pequeña falla","reviewDescription":"extrañamente el juego se pausa y entra en modo reposo lo vuelvo  a encender y continua perfectamente en un inicio no le di importancia pero ahora esta ocurriendo mas seguido","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Ps5 defective","reviewDescription":"I bought the used ps5 God of war edition. It turned on but the hdmi port and controller charging port didn’t work. It’s weird it came from Amazon.com but they didnt test it. I want to get a new one but it’s charging 80$ shipping","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"No lo recomiendo","reviewDescription":"Se empezó a recalentar a los 8 meses de uso, como es una compra por Amazon en Colombia no me dan garantía, me tocó cambiar el metal liquido","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Controller quit working after 2 days.","reviewDescription":"Console works fine. Controller crapped out despite being stored on the PS dual charging dock. Amazon won't do anything unless I send the entire console and controller back which I waited months just to be able to buy. Hopefully Sony will replace it with a new one.Thanks for your generosity Jeff Bezos.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Disappointed Beyond Measure!","reviewDescription":"Let me start by saying I've been a loyal PlayStation fan for years, eagerly awaiting the arrival of the PS5. So, imagine my excitement when I got my hands on the God of War Ragnarök Bundle! It was like a dream come true, until it turned into a nightmare.For the first year, everything was fantastic. I was blown away by the graphics, the speed, and the overall experience. But then, exactly one year from the purchase date, disaster struck. Out of nowhere, my beloved PS5 started acting up. It would power on, only to shut down after a mere 2-5 seconds. Just like that, my gaming sessions were abruptly cut short.I tried everything to fix it. I checked cables, I prayed to the gaming gods, I even attempted some questionable DIY tricks I found online. But alas, nothing worked. It was dead, Jim.To make matters worse, the warranty expired just as this issue reared its ugly head. Coincidence? I think not. It's like Sony programmed the thing to self-destruct right after the warranty period ended.Now, I'm left with a glorified paperweight and a heavy heart. All those memories, all those unfinished games... gone. It's not just about the money; it's the emotional investment I had in this console.So, if you're considering buying the PS5 God of War Ragnarök Bundle, proceed with caution. While it may offer an incredible gaming experience initially, there's no guarantee it won't give up on you when you need it most. And Sony's warranty? About as reliable as a chocolate teapot.I'm heartbroken, Sony. Truly, deeply, and irreversibly.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"no vino el juego y se bloqueo a los 5 minutos","reviewDescription":"pues bueno me jugué la vida por ahorrar unos pesos, me llego una consola que desde su caja se veia super deteriorada, sus sellos viejos empaques de control y consolas que no son, aparte de que el juego ya estaba canjeado e inútil. ps ya ando a la espera de una devolución de mi dinero para comprar mi consola esta vez nueva y no tener tanto problema porque de hecho la consola se bloquea sin nisiquiera estar jugando nunca pude jugar en ella porque al entrar a la play store se bloqueo y mi paso a seguir fue reiniciar, quitar mi cuenta de allí  y llevarla al correo de vuelta muy triste porque mi consola fue solo una ilusión por unos minutos en fin me parece que si van a vender algo de segunda mano y es un bundle por lo menos deberían reconocerle al comprador su juego y una buena presentación de empacado no es tan importante como que se bloquee a los minutos de encendido pero muy decepcionado con esta compra ya quiero mi consola nueva y sin problemas pronto.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"Crashes like a morher.","reviewDescription":"Well I was excited at first; great deal and it came with God of war. Sounds great but it continuesly crashes with ps5 games. Ps4 gams work no problem, but ps5 games are hit or miss. It will crash after hours or after minutes but only ps5 games. I've done everything that doesn't void warranty. I've cleaned it, turned off rest mode, re-download software, even tried to back up my data and factory reset. All that accomplished was now I have a flash drive with corrupted data and had to start all my games over. It's basically a ps4.5 rather than a true next gen console. But worst of all it is not limited to just my console apparently this is a prevalent problem for many ps5 users. It if haded been so long since I bought it and if it wasn't a gift for my wife I'd have returned it for a refund. Honestly I'm not mad, just disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Internet connection won't work.","reviewDescription":"I bought this in November of 2022 and it worked fine for about nine months. After nine months, it won't connect to the Playstation Store or the Playstation network. I also cannot play any games that require an internet connection. The ps5 is connected to the internet. It passes all of its connectivity tests and says download\/upload speeds are optimal, but I cannot use anything internet related on the ps5. I followed all troubleshooting options and none worked, and the troubleshooting UI is garbage and nonsensical. It says there is a \"contact us\" button on their website but there definitely is not. There is a \"chat bot\" that tries to give you the same BS troubleshooting options before it gives you the option to speak to an agent. When you choose to finally speak to an agent, it thinks about it for a couple of minutes, and then says all of their agents are extremely busy and to try contacting them tomorrow.This experience has shown me that the PS5 is a garbage product and Sony is a garbage company. DO NOT BUY A PS5!!! It is garbage and you will regret it!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Why is it so glitchy right out of the box? And where is my REFUND?!","reviewDescription":"I finally buy a console expecting too much I guess. I got this PS5 thinking it is top of the line, but it was glitchy af! I got the Ragnarok bundle, and I first notice weird glitches on the menu screen. Some of the icons would be blank or distorted and would take time to fill in, or there would be lines running through the images. That was my first red flag. Well ok, so what does the game look like? After the installation of the included game, I gave it a go. It didn't take long to realize there were problems with the system. When playing the game, there would be brief pauses and skips when the action got heavy, like when swinging against multiple foes or when using a special move etc. I reset it a few times and tried updating (even though it was a really fresh install) and after about 2-3 hours of play I realized that either Playstations suck, or I got a dud. Either way, I'm not satisfied and returned it. Well its been 10 days and nothing yet as I still have no confirmation that they have received it. My UPS tracker says they received it 6 days ago in AZ. Why the delay? I can understand a refund taking a week or two I guess, but Ive never had an Amazon return take so damn long just to acknowledge they got it. Starting to feel like I'm getting screwed...","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1682553600000}
{"reviewTitle":"Probably better off buying at an actual store","reviewDescription":"It arrived and seemed fine until I plugged it in. Heard the disc drive make a loud noise and was almost certain that it wasn't supposed to (never had a PS5 so I wasn't positive). Turns out I was right, as I was setting the console up, it told me to insert a game disc and it would not allow me to insert one without resistance. All of the troubleshooting involved taking the console apart... No thanks.Also, I didn't even realize it until now that I'm sitting down and thinking about it because I never even really got though setting up the console, but I never even found the code for God of War in the box.So I was sent an incomplete box with a defective or maybe previously used PS5 (I say that because when I went and got one from Walmart, it had two stickers to open the box, one being a holographic PlayStation sticker. The one I received from Amazon did not have the holographic one so I can only assume it was previously opened).So instead of getting my console and being able to enjoy the last few days playing, I had to wait and spend another $600 to get a working console. And who knows how long it'll take to get the refund, so as of now I have what amounts to a $1200 PS5 until I get it. Will never buy a console online again, not worth the risk. Just go get it in person even if you have to wait longer for whatever reason.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"Why bother is there is no support for repairs?","reviewDescription":"Had the system for over a year and has been questionable from the start. Games crashing and reports being sent, but the same issues would keep happening.Finally bought a game from the Sony Store that it could not handle and when I tried to get support from Sony they want to charge another $230 just to ship me someone else problem. With only 90 days warranty for a 'refurbished' device. Seriously?!Not a problem, sill not be buying any more of there products or services. If you are a loyal Sony person like I was, don't bother.  You will regret buying this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"The PS5 is great. But the controllers already having pro lems after barely a month.","reviewDescription":"1st, I'd like to say I love my new Playstation 5. All the games I had for PS4 are compatible and can be played on it. That's the only thing I cared about console wise. However I bought the console in December 2022. It's now January of 2023 and I'm already having problems with the controllers.1. The left bumper gets stuck after I press it. It doesn't look stuck so I don't usually notice until Kratos decides to throw his axe randomly.2. There seems to be some sort of delay\/ controller drift with the right stick.3. I don't see the point of the Duel sense controller. It looks good, but I don't particularly like it when the triggers vibrate. It might make the triggers more prone to malfunctions. But that's more of a personal gripe I guess.If anyone knows how I can get the controller fixed or replaced please comment with the contact info. I can't play God of War Ragnorock till these problems are fixed. Also you can use the ps4 controller for the homescreen but not any games? Why Sony?Anyway all and all console is great controller is crap4\/10. You can't play games without a controller that works well.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1673913600000}
{"reviewTitle":"BUYER BEWARE. REFURBISHED NOT NEW. 4\/20\/23","reviewDescription":"Order came in a brown shipping box with a \"Thank you for giving this product a second life.\" Sticker on it. Interior box was a generic, white box with the PS logo. There was no holographic seal sticker and it was taped up with regular packing tape. GoW came as a disc and not as a coupon. PS5 has hardware issues on day one and consistently crashes while playing multiple titles (GoW, Demon Souls). Will be returning and purchasing a new unit from a retail store. DO NOT PURCHASE ONLINE. Apparently this happens when ordering on PS's own website as well. Could be a mixup, could be malicious. Better to see the unit in person and check that it is brand new before purchasing.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"Within a day it was broken","reviewDescription":"I was so happy to receive this, not sure how a seller with such low ratings is still allowed on here. Within a day I was already experiencing glitching and graphics issues. I troubleshooted with Sony before asking for a refund, so I know it's not my equipment on my end. We changed HDMI cords, tried different televisions, and all settings were changed and there were still a bunch of pixels in places they shouldn't have been. Upon doing further research it appears the GPU is bad in this model. I am highly upset. I have to wait for them to receive my device before I get a refund, and not only that, I can't even get a replacement from a different seller because it's considered a high-demand item. Highly irritated about all of this.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"⭐️⭐️⭐️⭐️⭐️","reviewDescription":"PS5 provides the best gaming experience.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"worth it","reviewDescription":"I love the price I love that it came with a game all though I dnt know how to play the game the system itself is amazing I stay up for hours playing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"It works correctly right out of the box","reviewDescription":"Since I do not play gams often the business end of the computer is the most essential part for me. Windows 11 Pro is great; function just as the information from Dell predicted.  It is fast, smooth, wireless and better with e-net (adaptor not included) voice clarity of speakers and camera are outstanding. Backlit keys are not as distinct would have been better for my eyes, however acceptable in darkened environment. Tablet form and touch screen only complete the picture though finding a Dell stylus required some effort. no number pad is the only inconvenience, but adaptability or add-on is what makes computing enjoyable! lastly, the keyboard key travel is a plus for me slight impairment of little & ring finger left hand is compensated for easily compared to others I have tried. just wonderful for this man of 70 years.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Thanks, Amazon!","reviewDescription":"So I never really do product reviews on here, but I felt this should be an exception.I requested an invite to buy this a while back, and didn't think I would get one. Lo and behold, I got an email from them confirming that I was invited. I also typically don't buy anything for myself around Christmas season but I felt like this was a deal I couldn't pass on. The delivery of this went smoothly aside from there being a delay in delivery. Out of the box, it has been working super well and I've been very pleased.I've played on a Playstation 4 for nearly eight years and felt now was probably time for an upgrade.If you get invited to buy one and you're able too, definitely go for it! It's worth every penny.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1670803200000}
{"reviewTitle":"Ps5bundle","reviewDescription":"Love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Introverts this one’s for you! Quick & easy way to snag a PS5!!","reviewDescription":"If you know how quickly the PS5 was snatched up when it was re-released than you know! It was hard to find one and all stores were sold out instantly! Low and behold Amazon and their invite only strategy. I was invited in just a few days and my system arrived shortly after! Set-up was easy and it runs flawlessly!I especially love the stand I bought (from Amazon) that has a fan for cooling, controller charging station & game holder. Perfect addition for my fellow stay at homers, easy to get caught up for hours on this thing. I love how you can also play PS4 games seamlessly! Highly recommend!!Sidenote: The God of War: Ragnarok is digital! So no disc however, quick and easy to download. Fun game!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1674172800000}
{"reviewTitle":"Best console for gaming, Period!","reviewDescription":"PS5 is hands down the best console for gaming. The graphics are top notch and the loading times are short. The controller has features that I've never seen before. For example, Call of Duty weapons all have different feelings when you pull the controller's \"trigger.\" I rarely play other systems now.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"So far a great experience","reviewDescription":"This is truly a next gen-console, compared to the ps4 the ps5 is an upgrade in every conceivable way, but maybe just maybe the design is bit of a letdown. And like any great piece of tech it has some flaws(beside the design), I have experienced this on the first day of using it. There are certain apps that do not work, perhaps do to software bugs that in my opinion add a bit of human error into something that would have otherwise been perfect. Though, I wager Sony will do something about that eventually. Overall, I think this console is worth the purchase and I recommend. One last thing. If you have a ton of games you would be wise to purchase a storage expansion, the available storage on the ps5 runs out quite quickly.","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1670025600000}
{"reviewTitle":"Has been collecting a dust since 2022","reviewDescription":"Has been collecting a dust since 2022, there is nothing to play on )","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Much needed improvement over the ps4","reviewDescription":"My ps4 always had issues since I had my first one, the Ps5 is made with players and developers in mind, hence why it loads so fast, it feels amazing playing god of war and going down rope as the controller vibrates to match how the rope would actually feel sliding down it, the haptic triggers are also super immersive, and god of war ragnorok is a amazing game","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"PS5 is the best console available","reviewDescription":"I waited a long time to get a PS5 - mostly because I play on my PC. Here's why I'm happy I got the PS5 anyways:1. Playstation exclusives are some of the best games available.It's really hard to see all of the rave reviews of games like God of War, Spiderman, The Last Of Us, Horizon, and a whole lot more, only to have to wait months or years for them to be released on PC.2. It's already optimized.Coming as a guy who waited to get into PC gaming for a long time, I guess I didn't realize how much time I'd started to spend tweaking graphics settings and finding the perfect balance between visual fidelity and high framerates. Playstation knows exactly how to run each game so that it's as perfect as it can be.3. That controller tho...I've heard people brag about the controller and it's haptics. It wasn't until I tried it that I finally understood. I'm still not sure if I find it too gimmicky or if I genuinely enjoy it, but the utter glee that welled up the first time I pulled the trigger and it had variable resistance was definitely a great experience.4. A lot of my friends play on this consoleIt should play a factor when choosing how you want to game. If the majority of your friends are on a certain console, go with that console.I don't regret buying my PS5. I don't think you will either.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Ps5 what can I say","reviewDescription":"It’s a ps5 . What more can I say? PS five is the best consul around. But getting it from Amazon everything came perfectly the way. It’s supposed to highly recommend getting your electronics from Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Love this console","reviewDescription":"I've been a playstation fan since I can remember. Console works great, love that I can play my ps4 games on it. Controller is great and comfortable to use. Would highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Great buy","reviewDescription":"Daughter is extremely happy, works great  highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Next Gen Gaming console","reviewDescription":"Full disclosure I have been looking for this since the PS5 was released. I wanted the disc version in order to upload\/play PS4 games using the backward compatibility. But I was not going to pay more than MSRP for this. Had multiple opportunities to purchase one for $800 or more, but turned them down.With tax I paid a little over $600 for this console bundled with God of War: Ragnarok. That was a very fair deal.Graphics are amazing. I have it hooked to a 4K 120hz refresh LED TV and the picture is beautiful. Games load fast because of the internal SSD drive. Running the audio through a 700 watt 7.2 surround sound system, and the console allows you to customize those settings based on speaker placement. Audio is outstanding. Transferring data from my PS4 to the PS5 did take a little longer than expected, even on a gigabit network. I suspect that was due to the limits of the PS4 network card, but can't prove it one way or another. All in all, setup and transfer of data took about 4 hours.PS4 games run upscaled look great, but there is still a huge difference in the graphics for a PS5 release.The way Amazon did the sale via invite only was great. No trying to beat bots. Didn't have to worry about getting it in my cart and have it disappear when I submitted the payment. Amazon nailed this sale process.Sign up for the Amazon invite if you are still trying to get a PS5 and don't want to pay upcharges through other sellers or resellers. It was worth the wait.","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"What's there to say, it's a PlayStation","reviewDescription":"Well worth the money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"PlayStation 5","reviewDescription":"I bought this for a Christmas gift for my daughter and her significant other. They love it especially the graphics","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Worth it.","reviewDescription":"I was kind of apprehensive about getting one because of the reviews I read about people getting “used” PS5’s or ones that broke within hours of play. The negative reviews always stand out.PS5 is well worth it for me. I am very happy with mine and am glad I got one. I got the Ragnarok Edition and I did read that it is a DIGITAL version not a disc copy. Don’t know why people leave bad reviews because of this. READ the description I guess. I have almost a month of play on mine and it’s running great. I immediately got upgrades for mine. Camo plates with better ventilation, cooling fans (highly recommend this no matter how long you play for), and LED lights.The first thing I noticed is how fast things load up. From the time you turn it on- your actually playing your loaded game in less than 45 seconds. Plus updates and initial game loads - none of them have been over 20 minutes. I remember PS4 days where game updates and initial load times took HOURS!!! So much so that I always knew I’d be playing the game either the next day or later in the day if things were kicked off in the morning.Graphics are a massive improvement. Even for remastered PS4 games.The controller improvements are substantially better too. The new haptics are much better.Overall PS5 is a major improvement over PS4. Glad I got one.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Love this console","reviewDescription":"I love the console. It is gorgeous and quiet and the controller is wonderful and it is everything I wanted it to be. I didn’t even realize you could install another SSD to expand storage until I read the manual so that was just icing on the cake for me. This might be the first PlayStation console with an HDD\/SSD that I don’t fill up within a year or so and I love that. Not to mention if you install the SSD then it doesn’t have the limitations that an external one would have so great job Sony for offering good options. The ordering process was abysmal.No real information about when\/if you’ll get the invite, no details about whether there will be a console without the game bundle available, no way to switch your preference after the fact. Seems intentionally set up to be unnecessarily difficult. In fact if you just look at Sony’s website you realize there is no shortage of these, you can buy one at any point direct from Sony with no issue and no waiting and no invite, so this is an Amazon problem. I don’t think I’ll buy any consoles or actually any games from Amazon anymore. This and their preorder failures have made me consider other options. GameStop and Walmart and other places don’t seem to have the same issues.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Great console","reviewDescription":"use it daily, great console","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"no todo lo ke brilla es oro","reviewDescription":"vino sin la base sin el juego de good of war y sin restablecer de fabrica","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"terrible ergonomics otherwise solid new console","reviewDescription":"The unit\/box is huge and aesthetically unappealing. That makes it difficult to place on and around your entertainment center, particularly if your setup is in a room that sees a lot of guests. More frustrating is that the curvature makes the unit awkward to place. The circular stand doesn’t have a secured attachment point when in horizontal mode, and I’ve already had it slip off while trying to access the back panel USB ports. Lastly, the curved top means you have to be incredibly careful even temporarily placing objects on top, such as the CD case or PS5 controller while load a disc into the system.System OS and controller ergos continue to be superior to those of the Xbox line. I have not played anything on either the Xbox Series X or PS5 that could not have been played without complaint on the previous generation consoles. We’re what? 1? 2? years into these releases, and while load times are clearly faster, I find myself playing significantly more PS4 titles (ports) than games truly made for PS5, and the same is true for Xbox, so my recommendation as of January 2023 is chill on trying to get your hands on these new gen consoles. At the moment, their appeal is more of a mirage than real - like bragging rights that you were finally able to get one.FWIW, my assessment of the games is based on gameplay using a 77” LG C2 OLED with HDMI 2.1 and a 7.1 ch surround system powered by a Denon AVR-930H. I certainly have the hardware to take advantage of next gen console gaming, but as I said, there’s nothing to play that makes the experience palpably better than previous gen consoles…yet. So still no rush to buy this thing. I would try to hold off until SONY releases a slim version, hopefully in early 2024. Good luck. Have fun.edit: unlike Xbox, games cannot be played directly from external drives, so while you can download and store them on a USB drive, you still have to manually copy games onto the internal drive, which also means having to decide what to remove to make room for the new game. it’s unnecessarily inconvenient in my opinion, but it’s typical of sony and nintendo who are both more guarded and restrictive than microsoft.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Excellent Upgrade From The PS4! No physical copy of the game","reviewDescription":"I'll start off by saying that I really like this console so far! The menus are smooth, and the gameplay (at least on the included God of War: Ragnarok) is smooth and responsive.The setup of the console was easy, although I did need a small flat-head screwdriver in order to carefully pry out the screw-hole cap that you need to remove in order to screw the console into the vertical mount. After that, attaching the vertical mount to the console was a breeze and I really like the look of having the console standing upright. It also feels sturdy enough that Im not worried about it tipping over.The controller is a massive improvement to gaming controllers as a whole. The adaptive triggers alone can add an entirely different experience to playing a game. I haven't found this feature used very often in God of War yet, but the included \"Astros Playroom\" introduces this feature, and gives you some scenarios to play where this feature is showed-off a bit more, and it's really fun. It adds a new level of immersion that I wouldn't have even thought of to the controller. The haptic feedback vibrations are a nice feature as well. Having more intense and involved forms of vibrations from the controller helps with the immersion as well.The package I purchased came with the God of War: Ragnarok game and, like the description of the item (and other reviews) mention, it does have the digital version included. This is one of my biggest complaints, is that I wish that they had just gone with including the physical copy. Downloading the game wasn't too long of a process, but having the physical copy to have and collect would have been nice without having to purchase a separate physical copy (which I won't be doing myself). Especially for those who collect video games\/manuals\/etc.Overall, I'm glad to have gotten the opportunity to get this, considering all the shortages. It's been a fun time playing through the second chapter of the God of War franchise, and so far the experience has been great!","isVerified":true,"ratingScore":4,"reviewReaction":"36 people found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Really good","reviewDescription":"Aside from the dents on the top plate. It's actually worth the purchase. The best part is the people who sold it to me for a good price instead of what Playstation or any other user was offering.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"It's a Great Console, read review.","reviewDescription":"It's a Great Console for sure, 4 Stars\/5 because God of War Ragnarok in this bundle is a Digital Redeemable Card not a Physical Copy...yeah I know that sucks lol.But Great Console, Stellar Game.You're paying full price yeah but it's better than getting scammed and everything is Brand New so..Side note - after Charging your controller make sure to update its firmware in the settings.After updating, locate the Controller Reset button located on the back of the controller, it's a Small Hole so find something long and pointy.This will help with Battery Drain issues, many don't do this after starting up the Ps5 for the first time and wonder why their controller dies quickly.Battery Life can be extended by going into Controller Settings to Dim the Lights and Trigger Haptic Feedback settings.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"It's the next gen Sony Console and it is what it is.","reviewDescription":"So after 2 years, I've finally gotten a PS5.  It is everything I expected and nothing less.  Granted I didn't have too many expectations.  Graphics are definitely a step up from the PS4. Faster load times for sure. Controllers are comfortable and familiar with a few added features such as vibrating triggers and a built in microphone.  Some not so great things about it could be led by the ridiculously expensive cost to add on to this already expensive machine.  Standard controllers start at 79usd before sales and discounts.  The built in memory storage is pretty lame and it costs upwards from 100usd and beyond to upgrade to any quality internal ssd.  Lots of good options out there for that though so pick and choose as you'd like.  Don't even get me started on the PSVR2 price tag!! If that's your thing.  I mean overall, the PS5 is next gen and it is fun, but at what cost.  However, at this point in the PS5's existence, I don't feel like my PS4 is obsolete yet. Mostly everything that the PS5 has, is just a tad better than what the PS4 offers.  If you're on the fence about the next gen systems but not suffering from FOMO(fear of missing out) then go ahead and wait a little longer.  Nothing super extraordinary about the PS5 yet.  But if you have the means to spend on it, then go ahead, you won't be disappointed, just don't expect this thing to be revolutionary as of now.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1672185600000}
{"reviewTitle":"Power supply","reviewDescription":"Although functioned for much of the time, power fluctuations had this device dead.Wonder if it couldn’t stand the variations.Had to order the related part.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"mmeehh - take it or leave it","reviewDescription":"Yes - I gave it 4 stars, Why? I'm not sure - because it's more of a 3 - 31\/2.To start; it's bulky, awkard shaped, and not impressive.I have a PS4 Star Wars edition (comes with more storage and more USB ports) sure its a special edition and that should be expected from an older model PS4, but better than a PS5?  unfortunately.. yesI use an external HD for extra storage, but I'm also using a VR (1st edition) headset which (with the VR connector to USB adaptor) takes the available USB port - no external HD.The plus - PS5 games are better (period).So I decide to purchase the VR2, and its sleaker and not as constraint as VR1 - it also uses the USB-c port opening the other USB ports for other choices.  Unfortunately, dont expect to use those PS4-VR games (not compatible).To conclude, sure the games are better, but how much better? - not much, and (in hindsight) if I was alerted about the PS5 avaialblity I wouldn't take it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"Mostly fantastic","reviewDescription":"The gripes first. So basically a ps5 is a low medium end powered gaming pc. However, since game publishers cater more to consoles in this day and age the games are usually more optimized which is good. No tinkering needed, just play and enjoy. Unless you like online gaming. A big gripe is that my PS5 seems to have a terrible time staying connected to wifi. I fixed this by connecting via ethernet cable so no problem there now. My modem is like 3 feet from my PS5 so not a huge problem.Aside from this I love my console. My wife and I love playing some co op games so this is the best way to game\/cuddle imo. When my wife ends up pregnant this Playstation will technically be much more expensive, lol, way to go Sony (or...Bony 😆) I see what you did there!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Terrible - missing controller and wires","reviewDescription":"Missing the controller and wires. Now waiting forever for a refund. Buyer beware! Do not buy!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Unable to redeem code for God of War Ragnarok","reviewDescription":"Just purchased a new PS5 however I am unable to redeem the code for God of Ragnarok. It says the prepaid card could not be redeemed. What's the deal?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683849600000}
{"reviewTitle":"Defective Item","reviewDescription":"The PS5 doesn't work. The LED doesn't light up and the console beeps three times then turns off. Unacceptable and extremely inconvenient for me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Disc reader not working","reviewDescription":"Other features works ok on this item except for the disc reader, Blu-ray’s, it’s unable to read discs even with fixing advice from PlayStation did not work. So sad. I will return it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681257600000}
{"reviewTitle":"Thought the reviews showed 2 controllers, but I’m having to order an extra one for it","reviewDescription":"😮‍💨😤 kid’s birthday gift had no code availability for downloading the game. I’ve tried looking for ways to get the game from this bundle but there’s none. I’ll have to buy it  again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Missing items. Used product","reviewDescription":"Cords missing. Stand missing. Game code missing. Box torn up. Obviously used item being advertised as new. Rip off.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Playstation DualSense Wireless Controller not working","reviewDescription":"after 3 months Playstation DualSense wireless controller does not work.  I do not want to return the console, but I have to buy controllers.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Beware","reviewDescription":"Bought brand new PS5, gow edition, and the disc drive doesn't work. Very disappointed. Playstation\/Amazon customer service is also quite terrible. I would not recommend anyone from purchasing from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1680825600000}
{"reviewTitle":"The ps5 console doesn’t work!!!","reviewDescription":"Took ps5 out of torn box, plugged it up. Then just a blank screen, nothing ever happens. I want my money back asap!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Box came damaged","reviewDescription":"They plumbing stuffs inside the same box and damage the the box of ps5. Thank god it didn’t damage the ps5 console","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682553600000}
{"reviewTitle":"Extremely poor quality","reviewDescription":"I bought this for the first time in January.  It came to me out of the box with the cord severed so I had to return it.  The second lamp I received came to me with the cord severed in exactly the same spot.  Clearly there is a design\/manufacturing issue.  I will not get a third one.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1677369600000}
{"reviewTitle":"Poor poor service","reviewDescription":"I bought this bundle with expecting to get a voucher that was good. It expired in 2015!  Got slow played buy customer service n with work its past returning it. They told me I had to call Sony...bs! Only automated service. To find out I spent 615 dollars for just the ps5 is messed up!  Never again.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Defective","reviewDescription":"Purchased the unit received the unit it was defective could not insert disc returned the unit to UPS the unit was tracked back in November and to this day I have not been refunded NEXT STEP DISPUTING CHARGE WITH MY CC COMPANY ! TIRED OF THE RUNAROUND THIS IS ALOT IF MONEY For SOMETHING I NO LONGER HAVE IN MY POSSESSION!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1671235200000}
{"reviewTitle":"PS5 controller busted","reviewDescription":"The entire system is brand new. It's great! The controller button got sticky after only the third day of use!! I must've used it for about an hour a day and already the gel connectors underneath the buttons must have damaged.  I just want a controller replacement. Can someone help me","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"More time spent on watching the movie than playing","reviewDescription":"This game is ready bad.  This is a M rate game.  I don't want to waste time to watch this bad movie.  The time spent on watching the movie is more than game play.  The game also plays itself.  If it not because that I wanted the console, I won't buy this bundle.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Not worth the money","reviewDescription":"So this is not a bag on Amazon but playstation... I was so happy to get the next gen but when it crashes way more the any other console I bought besides the red ring on Xbox... I'm truly disappointed. The only thing that make it better is the controller... die hard playstation fan. Great games by the way!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"Issues with hdmi","reviewDescription":"This product has had issues with the image on my tvs, multiple tvs. Inspected it to find metal casing around hdmi was split when I first got it, but it worked fine, most of the time  Finally it stopped working altogether. Biw I can't do anything with it🙄","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Banned console","reviewDescription":"They sold a banned console that can never be played they didn’t test product before selling and ruined my kids Christmas id rate 0 stars if possible","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Overheats took all the steps moved away from wall sit in a very ventilated room","reviewDescription":"took all the steps moved away from wall sit in a very ventilated room. Kids love the machine but only works for 5 minutes at a time.  I am afraid to reorder for fear of the same issue occurring.  Runs for 10 minutes at most then it crashes.  VERY DISAPPOINTED!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Got scammed","reviewDescription":"Not sure if it was the drivers or the sender but got a defective item. Returned it and bought another. Now Amazon is charging me for both saying the original that was defective isn’t the same serial number as the one sent. Unreal. Will never use Amazon again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686268800000}
{"reviewTitle":"Refurbished","reviewDescription":"I imported GOW bundle to Mozambique and it came refurbished not new. Due to expenses to return the parcel I had no choice but to remain with it. Not happy at all. Zero starts for it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688947200000}
{"reviewTitle":"Bad disc reader","reviewDescription":"Other features works ok on this item except for the disc reader, Blu-ray’s, games nothing registers on the ps5 straight out of the box arrived broken if if it’s unable to read discs even with fixing advice from PlayStation did not work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Power Bug","reviewDescription":"It develops power problem and stops responding after few days of usage. Unfortunately it has passed the 1 month return window and a message to Sony to activate warranty hasn’t been responded to for weeks. Now my son is left with non-functional unit. 😔😟😟😟😟","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Damaged","reviewDescription":"I received the invite and bought this item. The day before it was to arrive I received a message saying it was damaged and was getting returned to the warehouse. I would get a refund. I would rather have another one sent to me.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"I had to return it","reviewDescription":"I got a used good ps5 from Amazon warehouse but when it arrived and I plugged it in it would not stay on. I will try again but for now I just want my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683504000000}
{"reviewTitle":"Did not come with game","reviewDescription":"Save yourself the money and don't buy the bundle it doesn't even come with the ps5 box nor the game.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Was shipped a used product","reviewDescription":"Product was repackaged. Not clean. Controller malfunctioned. Sony said controller was over a year out of warranty.Returning to Amazon. Will buy from a brick and mortar store.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Constantly turned off while in use","reviewDescription":"Super disappointed. Next time I'll be purchasing through a storefront. The return process for this on amazon has been such a hassle. Hopefully the third time is the charm with getting UPS to pick it up","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"NO WAY!","reviewDescription":"I BOUGHT THIS AND MY DAUGHTER MENTIONED IT DOES NOT READ ANY TYPES OF DISKS IN THE FIRST DAY OF HER TRYING IT OUT, NO BLUE RAY OR GAME DISK... VERY DISAPPOINTING, VERY EXPENSIVE CONSOLE FOR IT NOT TO WORK.. RETURNING THIS ASAP!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Games unplayable, streaming unwatchable","reviewDescription":"I was excited for the new console; however, system network\/Wi-Fi is very unreliable. Online games are very laggy, streaming movies are constantly buffering.  Ended up switching back to the PS4 as it has no network\/Wi-Fi issues.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676073600000}
{"reviewTitle":"Doesnt come with physical game.","reviewDescription":"Very easy to setup and get going but I just would have wanted a physical game. The downloads are just too big. For me to download the one game that \"came\" with the system I have to use around 2 months of internet bandwidth. So i just cant download the game.  I need a physical copy. So in conclusion. The actual system is amazing and powerful.  The main fallback is the reliance on downloading terabytes of data which is what you end up with after getting many games and updates which are the same size as the games in many cases. I play games with no updates and only what is accessible from disc because it takes too much internet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677369600000}
{"reviewTitle":"Guess what?","reviewDescription":"The console didn't have it's original box, so reselling will juwt make it more complicated. No box, nothing to match serial numbers. Not in the description of items, maybe need to get a discount or cash back for buying a box in the future. Still thinking of returning any item w\/o its own box for protection. All i got was a brown box.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688688000000}
{"reviewTitle":"Fun game, defective console","reviewDescription":"The game seems amazing. However my console stopped working. I apparently have the \"black screen of death\" that can happen with the PS5. I've tried different monitors, different HDMI cables, I've tried power cycling the console and turning it on in safe mode, but nothing works. The console powers up but there is no sound or display. Looking online I'm not the only person who's had this happen, and now I'm having to go through the process of sending it in to Sony to hopefully get a repair or replacement. I only made it about 2 and a half hours into Ragnarok before this happened. It's just frustrating because I've been waiting so long to get the system and I barely got to use it before it bricked.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"shipped non english version","reviewDescription":"took long enough to get one,  but the waiting time and game development has been a bit slow,they had popular p.s.3 games and should have  remastered and made them better  with the originalmakers, sony dropped the  ball on this.this play station was shipped to me witha slavic language as defalut languagehad to bring it to a  ' u break it, we fix it  shop ' and have the tecnician adjust the language, luckily  no charge for that","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"Nice but with scratches","reviewDescription":"The actual box was in good conditions but the console had some scratches. Everything good so far, what I dislike is that Sony does not have guaranty outside USA so keep that in mind when buying from out of US","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Had to replace controller","reviewDescription":"Only having the console for 3 days the controller stopped working. Had to go to Best Buy and buy another one. Getting in touch with customer service regarding this issue they just pass the Buck.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"The console is not new","reviewDescription":"Hi, today the console arrived in my country but I saw the state of the box as well as the control and the console, with some signs that it was used; though it's working fine so far.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Great system “No games”","reviewDescription":"System works great I can’t find any good games just crap. I bought grand Turismo 7 - the career mode is fun but I beat it in two weeks now I want to reset Gran Turismo seven and you can’t. Let me explain you used to be able to restart the game and start from the beginning no longer an option. 😡And don’t get me started on the online mode that’s useless completely useless.I’m just unimpressed with everything.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"Excelente consola de videojuegos, pero...","reviewDescription":"Excelente la consola, rendimiento, gráficos, títulos. Sin embargo, el control wireless vino defectuoso. Se desconecta aleatoreamente y toca reiniciar de fabrica el control. Además, no siempre esto funciona enseguida, toca intentar conectarlo varías veces.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Demora en el delivery","reviewDescription":"Lo raro es que no puedo probarlo ya me llegó todo hasta los juegos pero la consola tiene una demora en el delivery ojalá mejoren eso pronto que ya me interesa jugarla","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687392000000}
{"reviewTitle":"Surprise Gift","reviewDescription":"Love the quality of the game and console, especially because it’s quite compared to the old console.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"No game","reviewDescription":"Did not include game","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680048000000}
{"reviewTitle":"Package was damaged","reviewDescription":"Great quality and easy to work and use  But package was damaged","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672358400000}
{"reviewTitle":"Kinda dumb that there's an invite button","reviewDescription":"IT was late wich sucked but I got it","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"Es excelente","reviewDescription":"Me  encanta  mucho","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669593600000}
{"reviewTitle":"Good console . But on a pricey end","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"Would be 5","reviewDescription":"This is a good gaming system but lacks games on their service. 1 PS5 game and if you're ok with PS4 games this is great. The graphics are similar to a PS4 with faster load times. The controller is next gen but that's about it. Stick to the PS4 if you just wanna play TLoU or GoW. Save your money for something exclusive, I wish I would have.... there's hardly any PS5 only games.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Finally through Amazon invitations got a chance to get a PS5 at msrp","reviewDescription":"Received the Console really fast, amazon dispatched it in a priority manner.Got the model CF-1215A (August 2022).The downside of this bundle is there simple, and no game disc - just a voucher for the game GoW Ragnarok (Sony really failed to deliver on the premise). I knew before as the description stated this, but still feel disappointed.Overall the console is silent, the gamepad is what I enjoyed the most with fast loading times but other than that the PS5 is still like a beta product after 2 years. Not much to tell after a week of usage. Could've waited another year or two until software is there.That is why an honest 4\/5 stars for this bundle and PS5 itself.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Great Console","reviewDescription":"So far great console. Exclusive games are dope can't wait to get one for myself.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Great","reviewDescription":"UPDATE - removing one star because the L3 on the controller sort of squeaks when used.Finally got this after waiting forever. So far so good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674345600000}
{"reviewTitle":"I'm very happy with the purchase of a PS5!","reviewDescription":"It's been difficult to find a PS5 available for sale so I was very happy to get the invite from Amazon to finally purchase the God of War: Ragnarok PS5 bundle.I like the new system but I took off a star because it's silly to have a next gen system with a last gen hard drive capacity, which is what you get in the current version of the PS5. Any serious gamer will likely need to get additional HD space (using the available expansion slot or an external HD). Don't be surprised when Song finally releases a upgraded version with more HD space, but I wasn't going to miss my chance to finally get the PS5 after waiting so long,","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"😗","reviewDescription":"so expensive and 70 dollar games 😭 please I can't afford gaming anymore","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Quality","reviewDescription":"The play station work good but the game code for free doesn’t work its low quality scratchers👎🏻 I think they guys did it unpurpose abut free game , just so they can make money 😠I send mail befor this review and they dident answer me 😐","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685232000000}
{"reviewTitle":"🍗","reviewDescription":"🍗","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"PlayStation 5 - God of War Ragnarok Bundle missing game","reviewDescription":"The PS5 looks brand new and works great! However, I did not receive the God Of War Ragnarok download code. I am wondering if this was a used or returned unit. A little disappointed I had to pay extra for a game I didn’t receive.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684108800000}
{"reviewTitle":"Shipping took 10 days","reviewDescription":"Didn’t even ship out until the date it was originally supposed to arrive by. I understand there’s delays this time of year but it took almost two weeks to arrive and everyday was an update saying it should arrive tomorrow. Also it was just placed in a box with ZERO padding behind what Sony provided in the actual ps5 box. Other than that, everything arrived fine so it is what it is. Didn’t pay some BS scalper price andIt’s a digital version. Finally got a PS5 and the invite came without a few days of putting in the request. Merry Christmas","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1670803200000}
{"reviewTitle":"Box was dirty and damaged","reviewDescription":"The console was supposed to be a gift. However it came in a box that was damaged and very dirty. Not just the outer box but the PS5 original packaging was visibly dirty and damaged. I couldn’t use it as a gift in such condition so I kept it.I will update review when I get a chance to play it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"It is great but the fan and disc drive noise","reviewDescription":"For gaming, It is absolutely way better than the series X but unfortunately the console I got had a annoying fan noise and extremely loud disc drive which really disappointed me. But overall I believe ps5 gaming experience is the best.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"Muy bueno","reviewDescription":"A mi me llego la version disco y el modelo 12115A ,la descarga del juego solo me fue posible al configurar una cuenta con u.s.a de pais ..pero todo bien y muy contento aunque tuve que pagar 42$ mas en aduanas","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"Good product","reviewDescription":"At first the ps5 would not show up on tv but I changed HDMI cordes and my picture showed up . So I guess I got sent a faulty HDMI cord. Other than that ps5 works great so far fingers crossed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680480000000}
{"reviewTitle":"Great bundle","reviewDescription":"The PS five was in great condition easy assemble right out of the box. The boxes in great condition and all the parts were within inside. This was quick and easy to install with the TV and downloading the game was easy to fast shipping.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Really good console and game","reviewDescription":"First off it came so gas the console, the console it self is so good and the controller makes it a whole lot better and God of War which is about 100 Gb took tips 20 minutes to download without an Ethernet and I play God of War 2018 and that was an awesome game but what a sequel this game was like the ending was great and now I’m thinking of playing the older games","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Almost Perfect","reviewDescription":"Love PlayStation, I have all my life. I don't like Xbox because of the fat controllers and I have little hands. So PlayStation is something me and my fiance have always been able to share. Love the Ps5 and it's features, but-- they made the controllers fat :( and the back of the controller has texture. this wouldn't be an issue, id just get a controller skin to put over the back to make it smooth, but the skins are Silicone, and it makes the controllers even FATTER. 😭😭 Something I'll have to deal with. But the system itself is amazing, backwards compatibility is a feature I'd never imagined. Overall 9\/10","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Se puede comprar desde sudamericana!","reviewDescription":"Para aquellos interesados en comprarla fuera de Estados Unidos (en mi caso desde Chile), les puedo asegurar que todo valdrá la pena !! Desde el precio hasta la seguridad del envío.La consola la compré por medio de invitación, y el costo total (consola + impuestos de Chile + envío) está muy por debajo del precio del mercado local. Todo junto salió aprox CLP690.000, mucho más barato que el mercado local.El envio fue por DHL y fue rapidísimo, la enviaron un domingo desde USA y llegó un miércoles a Chile. El único defecto es que dentro de la caja no venía algún tipo de soporte, como espuma o plástico anti golpe, pero como la consola dentro de su caja original viene muy bien asegura, no tuve ningún desperfecto.","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1670976000000}
{"reviewTitle":"It's a PS5","reviewDescription":"It's a PS5. If you know you know. If you want to get one, get one if you can afford it. I went with the disc version for backwards compatibility and it came with a free copy of God of War. I'm a PC gamer, and so is the other half but instead of investing to an expensive next gen graphic cards, this was my solution for single or coop games.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Awesome System","reviewDescription":"I recently after two years of trying to buy one, finally got my hands on a PS5. The console so far has been great and the gameplay is wonderful and looks amazing on a 4k 120 Hz TV. It came bundled with God of War Ragnarök which is the best game I have played so far this year. The cost is 560.00 USD for the bundle but it was worth it. I would pick up a SSD though because it has only 825GB of internal memory and you really only get over 600 to use for installs and the games are almost 100 GB a piece to install.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1672358400000}
{"reviewTitle":"Awesome","reviewDescription":"I did not miss the opportunity to buy it. When received the email telling me that I was invited to buy this PS5 I instantly bought it. This is what I wanted I'm really satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Welcome, To Next Gen!","reviewDescription":"After two years of waiting, I got the oppurtunity to buy a PS5 from Amazon, via invitation.Although it was delivered a day late, it was packaged very well and I cant stop playing it!Graphics breathtaking on my 4K HDR T.V. and the Dualsense triggers and vibration are a game changer.For me, I chose the PS Plus Extra which is $100\/year but includes a ton of great PS4 and PS5 games.This thing is massive and I had to put it on the floor! Because of the fans, I never hear it get loud at all, its totaly silent.Get one while you can!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1672531200000}
{"reviewTitle":"Súper inversión","reviewDescription":"Vale la pena. Llegó a tiempo. En perfecto estado y el juego incluido","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Great console from Sony for a good price on this bundle","reviewDescription":"I love to finally have a PS5 and the bundle came with God Of War. So for the game first, so far amazing game from Sony, great graphics improvements and frame rate. The console overall is good, a bit big but very quiet. The controller feels great but I have been having issues with some latency or maybe is me playing bad and not getting use to yet to the controller. The haptic feedback is interesting and makes the immersion to some parts of the game cool. Since the controller has new features and sound the battery life is a bit short. Overall I love the bundle price and definitely recommend it if you can find one. Is good to finally play games at 60fps on consoles.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Excellent.","reviewDescription":"Everything I wanted. Perfect! Previously I stated you can't play ps4 games with this console, however that is incorrect.  Yes you can play ps4 games on ps5.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Amazing, exceeded my expectations.","reviewDescription":"I have had the ps5 for a little over 3 months and I love it. It looks pretty nice, but compared to my series s it’s huge! For $500, it runs so smoothly. It gives great performance that I was not expecting. At first, I wasn’t too sure about the controller layout, since I have been an Xbox player my whole life, but when I got the hang of it I loved it. The controller has so many cool features, like the microphone, the speaker, haptic feedback, adaptive triggers, and the touchpad. And the exclusives? Those are so good! Spiderman miles morales was amazing, GOW ragnarok was great, and I loves Kratos’s character development for his son. I started playing horizen forbidden west, and I’m about 8 hours in. So far, it’s a great game! But yeah, I love the ps5 and would definitely give it a 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"Never Have I Made a Better Purchase","reviewDescription":"Absolutely worth it. Everyone in my house uses it, and it’s overall just incredible.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Maravilloso","reviewDescription":"Me gusta todo. Es magnífico. Y la envoltura excelente. Gracias","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Good","reviewDescription":"Very good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Amazing!!","reviewDescription":"This was my first time really getting I to gaming since the PS2 and WOW have things changed! I have had it for a couple months now and I STILL can not believe how amazing this machine is. All the games I've played are captivating and exceptional. I know there is HUNDREDS of hours to come of entertainment. Not to mention, any of the streaming apps you can think of you can also download right to your PS5! It even okaya DVD's and Blu-Ray. If you can catch this on a sale, buy it. You will not regret it! Even if you aren't an \"extreme\" gamer you will STILL enjoy it! There are games for everyone!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"its always being used!","reviewDescription":"I love it lol I mean what else can you really say I use it for everything from YouTube to tv to games and everything.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"For those who want to order it to other country than US","reviewDescription":"Well I got it in 5 days no problem with thatThe console itself is just fine the box came with no damage at all and I'm grateful to amazon and ups for making it happenLet's get to it if you are ordering your ps5 from another country, keep in mind to purchase it with a dollar bank account it'll cost you more if you do it with your country's currencyNext you have to know that you'll pay tax on it based on your country's rule on export and import, I paid around 130 dollars for taxes so yeah be careful before you orderBut since ps5 itself is so expensive in the country I live it was worth it so put some time to think about it before ordering it might cost you a lot less to just buy it from a retailerAnd believe me you are going to fall in love with this masterpiece","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1680307200000}
{"reviewTitle":"Christmas presents","reviewDescription":"I had purchased 3 of these one for each son and paid anywhere from 499.99 to 1240.00 and my middle son wanted one for his room so he purchased 1 also. Out of the 3 purchased from Amazon only one has had a problem. In the end it had to be returned to Sony and we received a new one. Something with the power had nothing at all happen and it had just been sitting hardly used at all. But as a last resort I have purchased asurion warranties as last resort. Went through outside supplier and Amazon and it was past warranty time so contacted Sony and it was still under the warranty for them. I have always purchased this warranty because I have it on my cellphones and have had to use it. Everyone was professional and responded in a timely manner. So far happy customer and hope to remain that way.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1678060800000}
{"reviewTitle":"Best console yet!","reviewDescription":"So I currently have a custom pc with a 3080ti, xbox series x, and now a ps5. My son has a Nintendo switch. From someone who's tried them all the pc is the best... however when it comes to console the playstation is far superior in gaming and experience. Ever since the first start up to all the exclusive titles this console is unparalleled. I haven't touched my Xbox In a looong time. Today I'm experiencing all the playstation only things and can tell I'll be finding myself coming back for more the Xbox lacks that for me right now. The pc will always be homebound but this console is amazing... the duel sense controller feels soo good and adds a WHOLE new level of immersion to gaming it really makes and sounds like you're in the game. Only downfall is lack of Bluetooth support. Luckily my OLED display has Bluetooth capability so I can use my Sony xm4 earbuds.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1671840000000}
{"reviewTitle":"Poor quality","reviewDescription":"Controller stopped working completely after only 8 months.  Amazon won’t accept return and PlayStation won’t repair it or replace it.  I would expect a higher standard of quality from this company than what I’m getting for this price!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"NO FUNCIONO, NO HUBO GARANTIA NI DE SONY, NI REEMBOLSO DE AMAZON","reviewDescription":"El producto no funcionó, me contacte con Sony, y despues de hacera varias pruebas, me dijeron que el ps5 estaba dañado, y me dijeron que debo contactarme con Amazon para solicitar un reembolso o producto nuevo.Me contacte con amazon por varias ocasiones y no me dieron ni un reembolso ni un producto nuevo, ya que habia pasado los 30 dias desde la compra.Ahora tengo un PS5 dañado y ningun reembolso.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"B.s....and more bs","reviewDescription":"Why is it a God of War bundle bur the game is not included and the hdmi was missing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"PS5 consoles does not read or install disc game","reviewDescription":"BAD Product I bought a PS5 consoles disc versionAnd it won't read the disc game and now I have to spend more money to get it fix because Amazon support told they will fix it or replace  a new one for me","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Disappointed  and frustrated","reviewDescription":"I was hard to find the ps5 in the market for a while, when finally got the ps5 for Amazon the delivered with the original box without put in in the package with some protection obviously in the way to delivered get box damaged,  super disappointed because I'm a collector and the product I wasn't cheaper, the star is for Amazon  the ps5 definitely got 5 star","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1676678400000}
{"reviewTitle":"Overheated","reviewDescription":"Had mine for 2 weeks with about 7 or 8 hours on it, was playing God of War for 30 min and it overheated and shut off.  Tried the next day, couldn't get it to load up without just turning off, tried the hard reset with the power button to restore to factory setting, still just turned off.  These new updated PS5's are a very expensive brick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673136000000}
{"reviewTitle":"Every sad","reviewDescription":"I got the ps5, and ordered other items with it. I got my ps5 one day before a game I ordered come. Set it all up and played gow, very fun game what I played. The next day my first disced game came in the mail. Went to play it. It never worked. Found out the disc drive doesn't work at all. Every un pleased. Will be returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Code for bundled game is REGION locked","reviewDescription":"The voucher that I received with the console for God Of War is region locked. It clearly says on the card, \"game is only available to legal United States residents with an account\". For me this is an issue as the game is for my son who lives in Japan.I thought PS5 games were not supposed to be region locked.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1670112000000}
{"reviewTitle":"Voucher doesn’t work","reviewDescription":"Good luck. Live chat talks in circles. Voucher for the game included doesn’t work. I bought the disk version and got a download code which gives you one copy of the game for one account only. Completely useless. Who is going to buy multiple copies of a game for a single console? Completely regret this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1679443200000}
{"reviewTitle":"Cannot delete a single save or save to a usb","reviewDescription":"PS5 cannot delete a single save file for a game but have to delete the entire game’s save file. Cannot transfer save file or files to usb storage but requires PS plus for backup and\/or transfer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Amazing purchase!","reviewDescription":"This without a doubt is a great purchase and I will not regret buying one. I think it is really nice that its becoming easier for everyone to get their hands on this because I know a lot of people still wants PS5's and I will be recommending Amazon as a source. Specifically here since this is now a trusted source for me. Only thing was is that mine got delayed about another 3 days so depending where you are, expect at least a 1 day delay or if not then you're fine. I now just ordered a Digital PS5 Version to a family member of mine since I know I can just come to Amazon to purchase one. Great purchase overall and buy if you are interested. I'd say it is worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"Actually available! And lives up to expectations.","reviewDescription":"My in laws \"bought\" my kid a PS5 a couple years ago, by which I mean they said \"here's the money, I don't know where to find one.\" And, it turned out, neither did I...at least not at regular price. Eventually we sort of stopped looking. So imagine my surprise browsing Amazon idly at like 9 PM to see this bundle advertised with overnight delivery. I jumped on it, and less than 12 hours later it was sitting at my door.Setup was easy and intuitive (and the system really holds your hand the whole way through). Performance is a notable leap forward from the PS4, and they system is relatively handsome despite being significantly bigger than I expected.At some point I'll replace my own aging PS4, and I want to dig in to the remote play via PS4 aspect, but initial impressions are all great.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Best Sony Console since the PS1\/PS2 era.","reviewDescription":"Got the invite from Amazon and snagged a PS5. Shipped out fast and packaging was super secure.Pros:-Good library of games (GoW, Uncharted, Stray)-Lightning fast load times (esp. on PS4 titles😳)-Solid controller\/system (Original Xbox sturdy)Cons:-Game install time (what is this, a mini pc?😄)-Controller battery life (maybe i'm doing somthing wrong?🤷)Been loving the PS5. I wasn't so sure on buying a modern console again. Had both a PS3\/360 go out on me. 😡😤Skipped the PS4\/Xbone.These new consoles have been pretty good. This and my Switch get some good use. The only problem being my backlog is piling up.😔🤣5\/5","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Value for money","reviewDescription":"Value for money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Greatest purchase I've made in the last 10 years","reviewDescription":"I have the series s xbox and I bought this expecting slightly better performance. I was pleasantly surprised to see it was far superior, the exclusive games are so far above what xbox has to offer that I'm considering selling mine. And of course the remote was mind blowing, descriptions of how haptic feedback feels don't do it justice, you just have to try it. I would highly recommend trying the free game that the ps5 comes with (Astros playroom) not only is it a nostalgia trip but it is very high quality and it shows off the ps5 and remote like no other. It has been worth every penny and then some. If you care even a little about games, it is 100% worth it. Make sure to have your graphic settings setup for performance though, 120 fps still has insane details with the bonus of an additional 60 fps.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"I love my new my PlayStation 5!","reviewDescription":"My Mother bought me this new PlayStation 5! I love everything about it! The loading for games are so fast. Graphics are spectacular, especially if you run it on OLED TV with VRR on. I have the Disc version, love old school. It is super quiet. Supports 3D Audio for headphones and soundbars, home theaters. The joysticks is so awesome, it has beautiful haptic feedback. Streaming video on PlayStation 5 is great. Picture is really good. It supports Dolby Atmos for streaming apps like Netflix.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Worthy Upgrade","reviewDescription":"The Dual Sense controller with haptic feedback is worth the price of admission.  (I do with the games used the controller speaker more though).  The sense of immersion is incredible however.  Well worth the money to upgrade from my ps4.  I got the disc edition and was thrilled to learn that many of my favorite old disc games came with a free ps5 upgrade!  A Thiefs End included a free PS5 version of The Lost Legacy.  With the push of a button I was able to transfer any digital games from my ps4 to ps5.  Most do not include the haptic feed back just better graphics.  The Last of Us Part 1 was my ps5 splurge.  I paid for the new version and it was awesome.  Especially the navigational hints option.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1678233600000}
{"reviewTitle":"Increíble.","reviewDescription":"Me dio miedo comprarlo por Amazon pero fue la mejor decisión. Llego perfecto y mi novio no para de usarlo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Ps5 Amazon Warehouse - Used Acceptable - WINNING!","reviewDescription":"Ordered the Used-Acceptable GOW PS5 from Amazon Warehouse for a smoking price $100 off...Was expecting the worst, (unusable code, missing pieces, dirty or broken cover etc.) this PS5 is in great condition more like new. GOW code works, everything is there, so far no random turn issues or psn banned problem, just a great system. Props to Amazon Warehouse, you guys did a great job and hooked it up with a awesome deal. I watched youtube videos on buying used-acceptable and according to what I saw Amazon Warehouse has a great track record, kudos...The system is amazing, the purchase experiece was awesome (the box it came in had a few rips, but I don't care about a box). 5 stars...this is day 2, will return if there are any issues but right now everything is gtg.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"Above expectations","reviewDescription":"I bought this PS5 for exclusives,  I got the GoW edition and all I can say is wow! I mainly game on PC I have a high end set up. The PS5 feels like a PC for the most part, it's smooth and loads games in seconds. I hardly notice a difference in performance, the graphics are well optimized and have great details. It's also quiet so far only making noise when booting up or downloading a game. The disc drive hardly makes any noise as well. It stays very cool in temperature it seems I can play it all day without it overheating.  Overall it's a very powerful gaming console well worth the money.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Unidad de CD defectuosa - reembolso retrasado","reviewDescription":"Estuve ahorrando por 3 meses para comprarla, al recibirlo de veía espectacular. La abrí y unidad de cd no funcionaba. No hay opción de recambio. Aún pendiente del estado de mi devolución. Amazon no contesta mi correos.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676073600000}
{"reviewTitle":"6 meses después, no enciende","reviewDescription":"Compré esta consola con tanta ilusión, se dañó 6 meses después, con el uso que le podría dar un adulto que tiene que trabajar 10 horas y dormir 8 😕.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Rapidez","reviewDescription":"Me agrado la rapidez.Me desagrada que el control dual sense no funciona a pesar de haberlo cargado y el HDMI lo tuve que reemplazar por lo mismo tampoco funcionaba, resumen el envío bien, el producto, muy mal","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"PS5 box","reviewDescription":"The box was damaged in the PS five controller were damaged","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"No funciona como esperaba.","reviewDescription":"Solo 4 meses de uso, y se pasa congelado. No funciona bien, hay que desconectarlo de la corriente para que vuelva a funcionar.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"SCUMBAG CORP","reviewDescription":"YOUR GAME PROGRESS IS NOT SAVED TO CLOUD UNLESS YOU PAY MONEY! ALL MY PS4 GAME PROGRESS IS GONE THANKS TO SCUM SONY! NEVER BUYING A SONY PRODUCT AGAIN!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Came with a damaged GPU","reviewDescription":"The unit came with a damaged GPU - it immediately had flicking black lines all over the screen at all times, even on recorded video and screen sharing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Keeps shutting down","reviewDescription":"Just got this ps5 and it keeps randomly shutting down on me for no reason, I have it up on its stand it came with on a solid surface where with no blockage of fan and it’s randomly shutting off.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"La consola no lee los discos.","reviewDescription":"Cuando intento poner un disco la consola lo rechasa,ya la reinicié y me comuniqué con el servicio técnico de Play Station 5 y no me pudieron ayudar,decepción total.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681344000000}
{"reviewTitle":"Item said new, but came used..","reviewDescription":"Returning since it was supposed to be new, but was shipped a used one… seal had been lifted and placed back and there is even visible hair beneath it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1673913600000}
{"reviewTitle":"Real and Worth it!","reviewDescription":"I’ll be honest I was a bit skeptical at first because there was only like 10 reviews at the time of purchase, but I am glad I went through with. Invite came in an email and took a couple of days from request. The PS5 (disc version) came right away brand new. God of War: Ragnarok came as a digital code. (Love the game so far and it looks great)I have been playing for a couple of days now and everything seems to be running smooth. I couldn’t be more happy with my purchase and how smooth it all went. Good luck to everyone and hopefully the wait is over for some of you.","isVerified":true,"ratingScore":5,"reviewReaction":"34 people found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"One of the best gaming consoles out there","reviewDescription":"Is there anything to say that has not been said about these consoles? I don't think so. I hear that they fixed the liquid metal issue they had on the earlier production models so time will tell if that's the case. So far working as expected. The controler is probably the best out there even if the battery life is not the greatest (only about 1.5 hours).","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1686700800000}
{"reviewTitle":"Some things are worth waiting for","reviewDescription":"The Amazon invitation system works! I first submitted my name in June 2022 (console only) and finally received my invitation in Dec 2022 for the Ragnarök version. I actually bought a PS5 specifically to play Stray but I will eventually check out Ragnarök. BTW - Stray is awesome...I am loving it! I also ended up ordering a new Sony OLED 55\" to get the most out of the PS5 experience. It's going to be a great winter to be \"stuck inside\"! In case you haven't read it already, Ragnarök is a digital download...the game is not in the box.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1671062400000}
{"reviewTitle":"Super!!!","reviewDescription":"Love this Playstation 5! 🥰","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Great deal!","reviewDescription":"Been waiting for a long time to get myself a PS5. I finally splurged and got myself this deal. So happy with my purchase. Thank you Amazon. They gave me a one time password to give to the driver upon delivery. That way nobody could steal my PS5. 👍 Worked out perfectly. Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1687651200000}
{"reviewTitle":"Finally Got a PS5","reviewDescription":"After 2 years of waiting I’ve finally gotten a PS5 strange thing was that I requested an invite but I never got an email stating my invite was approved Lol so I came on the item again randomly and saw that I was able to add it to my cart so I did and placed my order. This is sold and shipped by Amazon so the packaging was good. The system came and the code for GOW as well so I’m satisfied, the controller feels great 💯 btw this is the latest version of the PS5 the description has the old model but it’s indeed the new model you’ll be getting!","isVerified":true,"ratingScore":5,"reviewReaction":"53 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Happy Kids.","reviewDescription":"Kids love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"A New generation packed with amazing features","reviewDescription":"This is the first next-gen console i buy so I when do I start. First it comes with a preloaded game. Astro's Playroom that is fun but kinda short. Then you have the code for God of War Ragnarok that actually gives you the PS4 and PS5 digital versions. The only thing that I did not like about the console is that the controller battery does not last long. Is like 2 to 3 hours when the Dualshock 4 lasted about 5 to 6. In short good console and not so good controller battery.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Real PS5","reviewDescription":"It was the real deal! Only issue I had is that the delivery was delayed and then dropped off at 6:30am in the pouring raining. Thankfully I woke up at 7 and first thing I did was check my order status. The box was soaked but the ps5 was unharmed. Not the sellers fault but there should be a way to let amazon know it was electrical. I had a balcony with a cover they could of put it under lol so not sure what happened there but very happy with my purchase and although the delivery was delayed it was still fast shipping!","isVerified":true,"ratingScore":5,"reviewReaction":"24 people found this helpful","country":"United States","date":1669939200000}
{"reviewTitle":"Love the PS5","reviewDescription":"Love the PS5 best gaming console out","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"So far so good","reviewDescription":"Delivery said between 4am-8am but it didn’t get here till like 12pm. Aside from that the packaging was ehh. It came sealed in black plastic and then under the black plastic it was a little messed up the box but whatever. Now I haven’t tried to install god of war yet but I have played hogwarts legacy and so far so good, The ps5 works and I got it the next day.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1677196800000}
{"reviewTitle":"Aside from how it looks it’s a good system.","reviewDescription":"I’ve only had it for about a week or so but I’m enjoying it. Been binge playing GOW: Ragnarock as much as I can. Had to give it 4 stars though just because of the look of the system. It’s pretty ugly. PS4 was sleek and stylish and PS5 is a big bulky ugly looking thing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"Good product, damaged in shipping exterior box","reviewDescription":"So the exterior box and the logo box the ps5 came in where damaged in shipping - but the unit itself was fine. If you are on the fence about the ps5 vs the ps4 trust me - it’s worth it. The ps5 is that much better and truly amazing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"Christmas Gift","reviewDescription":"Great gift for those who love to game. My son enjoys his and plays on a regular basis.A bit expensive but worth it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686787200000}
{"reviewTitle":"Perfect","reviewDescription":"Finally got into new gen , love every minute of it . Great value , got delivered in about 2 days 100% recommended","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683676800000}
{"reviewTitle":"El empaque muy pobre Amazon.. muy pobre","reviewDescription":"Me sorprendió la forma en que me llegó el producto.. en una caja más grande que la de la consola con espacio sobrante y sin nada de protección solo una pequeña película de papel cartón antes de cerrar la caja. Me llegó con las esquinas golpeadas pero por suerte la PS5 funciona.Cuando compre una notebook vino con 1kg de protección adicional y con ésta compra 1 gramo.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"it arrived well but..","reviewDescription":"ok so it arrived the same day it said but the box that the ps5 came in was somewhat damage i was a little worried the ps5 was gonna have some damage or something but thankfully it was all good but the packaging could have been better overall happy to finally have a ps5","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Finally","reviewDescription":"THE PRICE dropped enough to afford it.  I like the speed and graffics on older PS4 games.  A white case? Seriously?  Otherwise all is good... so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"I love my PS5, but not my digital copy of the game","reviewDescription":"First, I'd say that I already knew that the PS5 had no physical copy of the game, however, I will keep my 4 stars review as we paid a bundle with a PS5 Disc Edition and not having the disc is like paying for half the experience, don't get me wrong, the PS5 is a beast owning already a Xbox Series X.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Amazing game, digital code redeems PS4 version, must fix!","reviewDescription":"Best game I’ve played in years on-a near flawless console the powerful PS5. Unfortunately the digital game code that comes with this bundle redeems a game code for the PS4 version of GoW Ragnarok. Not cool, we paid for the PS5 version and it says on the digital game code card that comes with the system. WTF sony????","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Delivery Dropped the Item","reviewDescription":"Product was amazing but please next time do not drop the item although it was accidentally dropped and it was recorded how he\/she dropped it. I hope the item is not damaged.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1672358400000}
{"reviewTitle":"Ripped packaging","reviewDescription":"Product complete but box was ripped","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681776000000}
{"reviewTitle":"Controller breaks easily","reviewDescription":"The controller broke after 2 months","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"What no warranty?","reviewDescription":"Never given opportunity for extended protection.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679702400000}
{"reviewTitle":"Voucher","reviewDescription":"Voucher code for the game was not included with the bundle that was purchased","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"No tengo el code de god of war","reviewDescription":"HolaCompré este play y no trajo el código del juego de god of war.Que puedo hacer?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"No voucher for God of War !","reviewDescription":"No voucher but console is fine . Upsetting !","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Console is huge.","reviewDescription":"Way too big.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678060800000}
{"reviewTitle":"Sin control remoto","reviewDescription":"No llego el control remoto del play","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Did not come with a voucher code for god of war","reviewDescription":"No code included","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"Only worked for one year","reviewDescription":"Worked great for about twelve months, then the gpu started showing severe visual noise when rendering, causing certain games to freeze and become unplayable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Very disappointing! Waste of money!","reviewDescription":"I bought this Playstation the December of 2022Only got to play with it 3 times before oily liquid start coming out from the bottom, the Playstation does not turn on whatsoever,  I can't contact the seller and when I call the number provided for Sony warranty they say I'm not able to be refunded because I purchased my item on Amazon. So I'm duped out of my 613$If anyone has any information where I can contact someone else please don't hesitate to let me know.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Faulty console and faulty controller","reviewDescription":"Less than six months after the purchase, the console started to give me the blue screen. I had to send it to repair. Under warranty so it was \"ok\" they replaced the whole base board.Last week the controller started drifting to the left, like if the stick was stuck.So now I have to send it for repair and is out of warranty, so frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"It is a PS5","reviewDescription":"Prompt shipping time. The reason I am giving this two stars is, mine must have been an open box or a return. It is missing all the cables, Power supply cord, HDMI cable and charging cord for the controller. Shipping box was un-damaged but the Sony box looked like it had seen a few Black Friday deals with multiple tape over the \"Open Here\" flap.Edit: After setting up the machine, turns out another user had set up an account on it. So it wasn’t “new” but a return. Works ok. It just isn’t “mine”.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Defective!!!!","reviewDescription":"Received it after shipping delays for it to be defective. Unable to connect to internet, could not find any networks. Did hours of trouble shooting only able to connect after buying a Ethernet cable, was told the console could be defected. the God  of war game did not come with it. I was then told I could return the whole console , since there were so many issues and get a refund. Will just order from the store next time. Still haven’t got my replacements or refund!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Ps5 didn’t work and they won’t replace it","reviewDescription":"I got this and set it up, bought over $200 worth of games, then suddenly the thing starts turning itself off and saying it’s losing connection to power. I contact amazon and do all their troubleshooting, finally they admit it’s broken. They say all they can do is offer me a refund and they can’t replace it. I had to wait over 2 months to get the invitation the first time, now I have all these games that I can’t do anything with for who knows how long until I get another invite","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"So disappointed as I received a defective PS5 console too.","reviewDescription":"I received a defective PS5 console too (5 days old). It reboots by itself while playing games. It happened few times but when I checked the system error log, there was nothing there, so I ignored them. Today after a cold start, within 5 minutes it shutdown by itself as soon as I started a game with a CD in, then it refused to start-up saying console is too hot to start. Not sure how its get too hot just after a cold start within 5 minutes. Did not even get a chance to play the game. So something seriously wrong with these units. I have bought few other games and accessories as well. Now I am so disappointed of the whole thing.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Bad advertising","reviewDescription":"Got this thinking it was brand new. Sent me a refurbished one. Pretty sucky considering I paid over $500.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Amazon warehouse its a 0 out of 10 defective consele","reviewDescription":"When ordering through the amazon warehouse you ll get a defective item,, and amazon wont take responsability of that , they just expect to send it back, dont even bother, order the consele in new condition, the amazon warehouse takes a long time to receive and definetly  u will lose your money, amazon is selling defective conseles through its warehouse store , just not worth it , you think uour saving money but no you be receiving problems","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Disappointed","reviewDescription":"I was super excited to get the invite and buy this for my husband. When we got it the console would not take a disc and after restarting and contacting customer support multiple times we were told that if it doesn’t work we could get a refund but we couldn’treplace it. Super disappointed because it’s so hard to even get the invite, the one we got didn’t work and now I don’t have the option to replace it. Now I have to try to get another rare invite.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1670976000000}
{"reviewTitle":"Good product, but I received it with the box in less than ideal condition.","reviewDescription":"It was a good purchase overall but I revived this with the shipping box ruffed up a little bit , than once I opened the box and see the ps5 and the box it’s in I noticed there were cuts and pieces ripped off . Kind of sucks cause I was hopping to have a nice fresh bod I could keep as a collection but the box is in pretty ruff condition.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673481600000}
{"reviewTitle":"Great product. Everything worked inside box","reviewDescription":"I liked the graphics of the system and effects of the new controller. I didn't like the new design of the system its very bulky. I also didn't like that the controller only charges when system is on or in rest mode and controller drains power very quickly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Missing Game Voucher","reviewDescription":"The PS5 works great but I didn’t receive a game voucher in this God of War Ragnarok bundle. I’m not sure why it wasn’t included in the packaging but it’s disappointing for sure considering the cost is included in the bundle.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Do not buy the bundle if u are overseas.","reviewDescription":"The product is perfectly fine, but the game cannot be downloaded if you are overseas. The voucher only works if you are in US. But this was not informed in the description before buying - so paid extra for the bundle but cannot download the game.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674172800000}
{"reviewTitle":"Son loves it!","reviewDescription":"The only issue is the screw for the base is missing. With the cooling system I got separately, we need that screw. I just have it sitting in the slot, but not screwed in as is. Quick turn around between setting up and playing a game.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Excelente","reviewDescription":"Llegó todo bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Perfecto!","reviewDescription":"Funciona!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Love it","reviewDescription":"I knew I’d love it, so no surprise there. Only issue I have is sometimes the controller touchpad is wonky but there’s ways around it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679011200000}
{"reviewTitle":"Missing components","reviewDescription":"This on the surface appears as a return. Didn’t include the HDMI cable or the controller cable. The box had clearly been opened previously. New is new .  Clearly what I received is not.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673654400000}
{"reviewTitle":"Great console and easy to install","reviewDescription":"I bougth the console by Amazon US and was perfect delivered at my home in the Netherlands.Works very fine but the voucher for God of War Raknarök Bundle works not in Europe, only in the US.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673222400000}
{"reviewTitle":"so far its working great","reviewDescription":"my ps5 came 3 days late i had no issues with that driver was great i mainly had 2 issues the first was the way the product was shipped not sure who boxed it but it was bad the box had visible damage to it also the box had a single piece of tape  down the center and the ps5 was visible no packing peanuts no bubble rap inside so my main concern was damage to the ps5 because of the lack of protection in the box it came in  so if it is or was tossed it would not harm the game system so far no issues with the game system no visible marks or scratches so I'm happy about that  the second thing was there was no addition warranty available at purchase i wanted at least a 3 or 4 year warranty  I'm not sure if its because of where it was shipped from or i missed where it was available but if it is available i would still like to purchase one other than that im excited been waiting 2 years to get one so thank you amazon","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Really good system","reviewDescription":"Easy to setup and play.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Patients is needed but Great Console","reviewDescription":"I waited for over 2 years to get my hands on a PS5. I did not want to pay those outrageous prices online from third party companies and so I waited until I receive my invitation to purchase.  I purchase it shortly after receiving my invitation and it came a week later. I wanted to use it right away and it drove me crazy every time I see please wait on the screen when it is importing files. When I finally got to use it,  I was impressed. I loved the haptic feature when using the controllers. You have never lived unless you feel the tension on the trigger button when shooting in Call of Duty. I also liked the remote play feature on PS5 which allows to play from pc or android devices. You can extend the useful life of that old PS4 by using remote play to play your PS5 in another room. It is great and well worth the wait. Be patient because your chance to purchase the PS5 is coming.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1670976000000}
{"reviewTitle":"Blazingly fast! Puny Hard Drive.","reviewDescription":"Shipping by USPS was fast! 2-day delivery.The PS5 is an incredibly satisfying upgrade from the PS4 Pro. Boot up is quick and game launches are too.The upgrade to 4k from 1080p is well worth the price of admission. All of my PS4 games are backward compatible and am now enjoying them to their fullest.The hard drive is too small. Which is why I took off a star. [COD Black Ops Cold War is 500GB and takes up HALF OF THE HARD DRIVE!!] I used to think Gran Turismo was bloated but, top shelf PS5 games are twice as big as the PS4 versions.Save your money. Buy the WD_Black 2TB SN850 NVMe SSD and you can store another 50 games internally.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1682467200000}
{"reviewTitle":"Great, but arrived \"DOA\"","reviewDescription":"Console is great and other than an awkward design, I have no issues with it and am enjoying my experience.Only complaint is that the console arrived \"DOA\" due to what I suspect to have been a disconnected bluray drive cable, which prevented software updates and booting to the OS. Had to do investigation to discover the issue behind the error code provided then needed to ship the console back to Sony for repair. Overall the process was simple and relatively painless, but annoying this needed to be done on arrival and needed to wait another 2 weeks to use the console. Just an FYI, sending the console in either results in your original console being repaired OR Sony will send a refurbished console instead. Fortunately I received my original purchase back.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"DOH!","reviewDescription":"I originally got a message that it would be delivered next day while status read \"Out for Delivery (by 6pm)\". My family was here as we were going to break it in, VERY disappointed. Then I took my dog out for the last time of the evening and there it was at my door (reason for 4 not 5 stars). Then once hooked up, it kept overheating and shutting down. Nearly started the return form when I realized it was upside down! DOH! I corrected that and now it runs flawlessly so....now, time to learn that controller! <ugh> Can't wait! :-)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683590400000}
{"reviewTitle":"Powerful","reviewDescription":"I like everything but the the controller. The controller tbh I wish took batteries. Also when I was playing uncharted all of a sudden I thought my controller was broken but nah its the realistic trigger feature that changes the springs to fit a certain game for firearm realism. I thought my springs were broken tbh. I played both TLOU Part 1 and part 2 and didn't have a problem. Played insurgency sandstorm and didn't have a problem but when I  played uncharted I discovered the weird trigger feature. Everything else is good especially $60 for 1 year of Playstation plus, wayy cheaper than spending $15 for Xbox games password which I recently canceled. I'm happy to have switched from Xbox to Playstation. Good product and worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677196800000}
{"reviewTitle":"PS5 is Awesome!  But the Delivery was Awful!!","reviewDescription":"PS5 is great product!  Setup was a Breeze!!  Stand was useless.  Buy a better stand!!  The Amazon delivery was disappointing.  The Amazon driver delivered the product and dropped the box on the front patio with no care what it was.  I thought the PS5 broke.  When I opened the box.  There was NO PROTECTIVE Padding, NO BUBBLE WRAP!!!  NO FRAGILE STICKER!!  Just a little piece of brown paper that covered the product!!!  Come one AMAZON, we pay so much for PRIME!!!  The least you can do is PROTECT the PRODUCT for your  Customers!  IF you know that the Item is Expensive the least you can do is protect the item in SHIPPING and DELIVERY!!!!!","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"So far so good too long enough","reviewDescription":"Unfortunately being a prime member I'm rightfully dissapointed at the retuned products n unexcusable delays, after returning a faulty renewed Ps4pro minus games I purchased 4 'em, then waiting over over 8days for the ps5 I originally purchased it finally another sent thx to customers arrived day after Father's Day. After I Dloaded Ghost of Tushima I'm glad I purchased this.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687219200000}
{"reviewTitle":"Good console;  substandard controller","reviewDescription":"I love the graphics on PS-5; a definite improvement over PS-4 – but controller they included is cheap, only lasted a month. I have, like many others,  bought costly controllers & upgrades for my PS-4 & older models, so if they’re gonna keep making them obsolete with each new model then at least make the new ones durable!! Mine is still under warranty, but now I’m forced to either buy another one (when I already have perfectly good ones for older models) or not play for 4 - 6 weeks while they fix it each time.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Very Expensive Birthday Gift","reviewDescription":"We bought this brand new PlayStation 5 and the box was damaged.  Very disappointed. When our son opened it, he didn’t even think it was a real present because the box was so damaged.  We didn’t have a choice but to still give it to him instead of a refund. Our town was all sold out of them.  Not a huge thing, just extremely disappointed and makes us question if the PlayStation is new and will work properly.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684108800000}
{"reviewTitle":"One year and 1 month after purchase- it just dies","reviewDescription":"It's a great console until it's not. I expect more than a 1 year lifespan on a $500 console.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Amazon doesn’t help","reviewDescription":"First time I’ve ever had an issues ordering from Amazon. I’m not blaming them for me receiving a faulty ps5, however all they’ve have just had me do a run around with Sony, and Sony hasn’t been help. Honestly just wanted to get this PS5 swapped out with a new one but Amazon won’t give me that option","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1670025600000}
{"reviewTitle":"Never buy any items from this seller","reviewDescription":"I bought a brand new ps5 and the controller started giving me problems and when I contacted the manufacturer they told me to contact my point of sale in this case amazon and it seems that nobody willing to help me out on this matter to resolve a damage controller and I spoke to the supervisor names Katrina and she was no help at all because my problem was not solved very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687478400000}
{"reviewTitle":"Used - Disc unit didn't work.","reviewDescription":"After transferring all data and completing the setup in my home I went to play a game. Disc unable to read. Tried a PS5 game - disc unable to read. Tried a Blu-ray - disc unable to read. Confirmed I was putting it in correctly and that the discs were clean and scratch free. No luck.Having to return the unit. SMH. Frustrated considering it was listed as Good Condition. Clearly there was little to no testing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"Taking a chance","reviewDescription":"I just bought one a few Days ago finally got it, open it up, plug in the right outlets, then bam I try turning the PS5 on but no light or nothing I try multiple times even follow on how my brother Hook his PS5 up mind's still never turn on SMH 🤦‍♂️ I'm still waiting for my money I got it on April 16.. here it is now April 27 does it take this long getting my refund back","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682553600000}
{"reviewTitle":"Playstation 5 console","reviewDescription":"All I have had is problems with this playstation... first it was a bundle and the game code it came with did not work, now the console does not connect to the tv and I bought it with a 4 year warranty","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Started overheating on me in a years time","reviewDescription":"Bought this PS5 in Feb 23. It started overheating on me a year later. It was just out of warranty. Sony wants 225 to fix it. What a joke. Good bye Sony and PS5.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Needs a 1\/2 star","reviewDescription":"Not even a year old & video is scrambled","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Unusable","reviewDescription":"I have both idiopathic and unmaskable tinnitus and hearing issues, but I can still tell that the fans and other parts of the PS5 are much louder than the game from ~10 feet away.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Works fine and works fast, but the remote…","reviewDescription":"Everything works so it supposed to however when I press the directional down pad it goes right. Amazon does not give you a replacement.  If you end up being one of the lucky few who had this issue be ready to purchase a new remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670976000000}
{"reviewTitle":"So far so good","reviewDescription":"The product - PS5 itself has been functioning properly but the shipping\/delivery was terrible. The delivery of the item was ridiculously delayed due to bad weather which was understandable but the idea of leaving an electronic in the rain is incomprehensible.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671148800000}
{"reviewTitle":"Great Counsel, Missing Voucher.","reviewDescription":"Arrived unopened. All contents present except the God of War Game Voucher.Very disappointed. Had to contact Sony and open a case file for the missing voucher.Hopefully this ends well.-Merry ( friggin) Christmas.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"Be aware....","reviewDescription":"if you're buying this product in April of '23, the \"Ragnarok\" does not work...otherwise, it is as advertised","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680652800000}
{"reviewTitle":"singapore purchase","reviewDescription":"arrived super fast in 10 days. everything works but game cannot be redeemed outside of the US.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"I don’t like bundle with god war5","reviewDescription":"Anyway I just want to get a ps5, don’t like the bundle game. If there have an other choice I prefer to bundle with an extra controller","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"Buen producto, mal manejo en aduanas","reviewDescription":"El PS5 llego bien, la consola llego en buen estado. La caja llego muy maltratada y sin caja de Amazon. Solo venía directo la caja de la play bastante golpeada","isVerified":true,"ratingScore":4,"reviewReaction":"31 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Good product but box was broken","reviewDescription":"The box was broken","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1681603200000}
{"reviewTitle":"The disc edition ps5 comes with a digital code. How does that make any sense?","reviewDescription":"Ps5 came in perfect. I wish I knew the disc console came with a digital code. I wanted the physical copy. My fault for not reading thoroughly enough. Everything came in pristine condition right away. I'm still happy","isVerified":true,"ratingScore":4,"reviewReaction":"85 people found this helpful","country":"United States","date":1668211200000}
{"reviewTitle":"Digital version of the game in a Disc version 😪","reviewDescription":"Artículo llegó bien y rápido.  4 Estrella por enviar una version digital a una consola de disco.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Very good buy","reviewDescription":"This system made it safely and I was so happy with the results it was just as they explained thanks much again.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"PS5 is good, the video game had bugs but thry were fixed!","reviewDescription":"I bought several games for the new PS5 and they work fine. At first, I thought Ragnarok GOW might be the best game I ever played, but bugs and glitches began to occur with increasing frequency. The severe cases involved main story ( so you cannot avoid the issue) villains that continuously and immediately respawn after I (my main character) have defeated them. For example, on one occasion I defeated two easy attackers and a 3rd very difficult one only to turn around and the very same 3 attackers jumped me again...and again...etc. I did escape and just avoided that confrontation, only to later encounter the \"Flame Phantom\" ( difficult to beat ) and, once again, I moved my character a few feet and out he jumped again! In tracking one of the dragons, I beat 2 trolls (protecting the path to the dragon showdown) possessed by 2 pixie-type villains (Nokkens) and, as I left the arena, I could hear a Nokken resume his chant and atroll growling again--I returned to fight again, only the pixie was frozen in place and invulnerable and the troll proceeded to bash my brains out at leisure...so, I cannot beat the troll(s) and cannot fight the dragon.In ALL these cases, I tried reloading checkpoints, restarting the console, reloading earlier saves, to no avail. Today, I tried pursuing the adventure with one of the other main characters (Atreus) but he got stuck with Thor in a dead-end ice tunnel that is supposed to open up when you point a mask object at it, but does not open up...meanwhile, villains continuously jump out of the ground and walls and proceed to bash my brains out.I prefer games that give me a fighting chance not get my brains bashed out.I am attempting a new download (which takes hours) and will try again. It's too bad...turned out to be so disappointing. If the new download changes things, I will update this post.UPDATE2 days after I wrote the above, an update downloaded to my game when I opened it. I am v happy to say that the update resolved ALL the issues I had, so I changed my rating from 2 to 5...definitely the best game I have ever played!N","isVerified":true,"ratingScore":5,"reviewReaction":"37 people found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Great product","reviewDescription":"I must say im very pleased with with my order. Everything works wells","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"i got lucky","reviewDescription":"months later I'm still putting this thing thru its paces","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"LOVE LOVE LOVE LOVE MY CONSOLE","reviewDescription":"Got this shipped overseas and it has been awesomeKudos to Amazon for quick speed and no damages nor anything wrong","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Great price, great bundle, not so great design.","reviewDescription":"For those who actually care, there are three models of the PS5. A 1000, 1100 and 1200 series. The 1200 model actually uses less energy to prevent it from overheating and its lightest version of the PS5. In the product description it says this bundle comes with a 1100 model PS5. However, when I got mine it was actually the 1200 model. Which makes sense since it was so hard to keep PS5s in stock that most of the ones you see now WILL be the 1200 version unless you buy it used.I purchased mine when it went on sale for $509, which was an unbelievable price. That means you’re getting God of War for $10! My only complaint is that Sony didn’t put any special designs on the console or the controller to indicate this was a God of War bundle. Sony have released themed consoles in the past and I was hoping that this would be one. They actually did create a God of a War themed controller but unfortunately it doesn’t come with the bundle, which is a shame because it’s pretty cool looking.Lastly I’m a person who used all of my Xbox’s as media hubs for watching Tv and movies. After hearing how PS5s were overhearing I was worried about leaving my PS5 on all day. Though I just got my PS5, I have friends who use theirs in the same fashion and they have not had any issues from their system overheating. They use their systems to watch Tv and game, it’s set to go in rest mode when it’s not in use and they have yet to have any issues.I will say that if you are planning on getting a PS5 you may want to see what deals you can get on a compatible SSD. The PS5 only has a little under 700gb of storage and games(digital or physical) can take up a lot of storage. God of War takes up approximately 84 Gb of storage. Ultimately this is a great bundle and this is the perfect time to pick them up, while they are available and on sale.","isVerified":true,"ratingScore":5,"reviewReaction":"76 people found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Been waiting forever to finally upgrade from the PS3.","reviewDescription":"As an almost 50 year old who is not a huge gamer and has been waiting forever to finally upgrade, I'm glad that I finally did. I wasn't sure if this was going to be a good decision or not, but really it's been better than expected! First, it's almost paid off due to Christmas money. Second, I was concerned about the cost of building a collection of games. But due to the fact that there's so many games and so many sales, especially on the games I like, I have a small collection of fun games already in many different genres that feels well rounded, and didn't cost a fortune to get! I'm slowly reacquiring my favorite games like the God of War franchise and the Arkham Batman games, while discovering old arcade games that are super cheap, as well as newer games like Spiderman Miles Morales, Spiderman, Ghostbusters, Creed boxing, and Stray all on sale. It's a great time to be gaming, and while I generally am not a big gamer, I went through a phase where I was gaming a lot just before meeting my wife Rebecca, and then life got busy, crazy, and wild for a good long time. But now I have a little bit more stability, and while still busy as heck, I have a couple of hours here and there to enjoy. I even bought Trivial Pursuit just to get Rebecca into the fold. She doesn't really even know how to use the dualsense controller! So I'm trying to get her involved enough to learn how to use the controller and navigate around in different ways. Anyway, very pleased with the purchase! I've played a little bit and it's a great experience. Quite a step up from the PS3, and a good time to get back into the gaming world. I'm glad that the shortage is ending, and I'm glad I did this when I did. Had I bought it in 2020 it probably would have been a weirder experience. I feel like gaming is finally at a place where oldsters, youngsters, and middle of the roadsters like myself can find something to enjoy.","isVerified":true,"ratingScore":5,"reviewReaction":"50 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Owned Every PlayStation Model Since PS1","reviewDescription":"I was lucky and got the opportunity to buy this PS5 console bundle when it came out in December 2022. I've owned every PlayStation model since PS1. This console has it all. Each generation has taken gaming to the next level. The bonus God of War Ragnarok game was a nice bonus.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"What are you wait for? If you get the invite, go for it.","reviewDescription":"Nothing else much to say other than Amazon sent me a invitation request for it on the 10th of December. And with the quickest hands in the west and the power of a credit card, snatched one up. Actually did get an invite for the regular one without the bundle not just once but twice, back in June and even further back during February. Skipped out though mainly because most of the games I cared for was multi-platform. But that's besides the point because as a lot of the futures games that I am eying are now making the jump towards this generation of hardware, PS5 Xbox Series X level, I figured I would go for it. Plus it came with  one of my most anticipated games so that was a big push.But yeah product wise, everything came as advertise: Console, kickstand, a controller, HDMI, USB C and a Power cord. On start up you have the option of copying over your data from the PS4 in terms of content, save data and games. It doesn't get rid of it, just a straight copy. I skipped this option though since I had most of my games on an external Hard drive. Fun fact is that you can change and share that same hard drive between the PS4 and PS5 and it will work vise versa as long as it's on the same account. So on the PS4 side, if you have a External Drives, makes it easy to store your PS4 games. And you want to save your PS4 games somewhere else because the main storage , although a good amount, can easily be filled.But yeah, very happy with my early personal Christmas Gift to myself and can't wait to check out more games with this nice SSD! Also the controller and its haptic feedback does make a subtle nice experience that you definitely have to feel. Sounds like a gimmick but it's completely in the background while adding to the experience.","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Bigger than I thought","reviewDescription":"Now that I have one, I realized how little I knew about it.Goodness it is large! I never thought about it so I was surprised to see it come out of its box in all its glory.Wow what a horrid PS5 stand that the console comes with! One thing I did was buy a horizontal stand which I am happy about. It has screws for vertical, but heaven help you if you decide to dust with it being horizontal.The PS5 comes off every time I need to move it. Now on the stand I do not need to worry about it.I am pleased with how it starts up..but never turns off like the PS4. So, putting the sleep to 20 minutes and leaving it took some time to get used to.I haven’t played God of War yet, but going into my account at Sony entertainment and clicking redeem game (first time ever) was simple enough; since my game collection is actual disc. Also setting up for Fortnite was straight forward.I have never transferred back-ups before, but I found the place easily that points to what I need to do; so, I am hopeful it will continue to be easy.When the manual says before turning on console plug in your controller that would be a yes. Yes, it will sync, and yes it will charge. I can’t seem to get the controller to charge on a USB C off the console; I haven’t figured out why that is.Everyone has written all about stats etc. so this is just me saying I really enjoy having it.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1688688000000}
{"reviewTitle":"Everything’s works","reviewDescription":"Was dropped off at my neighbors house, thankfully I am friends with them got i from themDidn’t come with box","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"Amazon aceptó fácilmente la devolución y reembolso del dinero","reviewDescription":"El play 5 . Tiene problemas de atascamiento del cd. Revisamos en YouTube cómo sacarlo. Y no fue posible . El cd quedó en el play. Y no lo pudimos recuperar","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"Legit! But….","reviewDescription":"After what was seemed like an eternity, I finally revived my invitation and was able to purchase Ps5. Received on time and in working condition. A huge disappointment to find that the God of war ragnarok voucher that was supposed to be included in this package is NOT here!","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"Disc reader error","reviewDescription":"Liked the product but for all the money the disc player should work and it doesn’tIt will work on certain items but not all the time","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"Good delivery, bad product.","reviewDescription":"+ Delivery Timing+ Stable Controller- Unwelcome, intrusive AI that pampers you on the User Interface.-Underwhelming performance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"Controller was broken","reviewDescription":"When received the ps5 controller was broken. The controller doesn’t work at all but the PS5 works as should. The game was kind of a hassle to redeem but it works as it should","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672185600000}
{"reviewTitle":"Deben ser más cuidadosos a la hora de lidiar con esto! 🙄","reviewDescription":"La caja vino rota, aunque por suerte el equipo no sufrió en absoluto, todo bien pero deben ser un poco más responsables 😒","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"Online Gaming","reviewDescription":"The consolé was good brand New and everything was just as is mentioned. Fast delivery great condition.But online servers for PS5 are the worst i reccomend Xbox for online playing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"Didn’t receive the god of war bundle as advertised.","reviewDescription":"PlayStation is great, fast shipping. Just didn’t receive the god of war bundle, looked through packaging and no game voucher to be found.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677888000000}
{"reviewTitle":"Got it from Amazon warehouse for a great price!","reviewDescription":"Had no issues other then the god of war gsme code being used for the Amazon warehouse deal I got","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679961600000}
{"reviewTitle":"En tiempo y más o menos en forma","reviewDescription":"Llegó antes de lo esperado , sin embargo la caja venía poco maltratada , como si el producto fuera viejo o hubiese estado almacenado por meses , por lo demás el producto no tuvo ningún defecto en su funcionamiento, el Ragnarok se pudo instalar sin problema","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1692057600000}
{"reviewTitle":"Excelente","reviewDescription":"Creí que tenia 825 gb pero no, aun así funciona muy bien hasya ahorita","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1694908800000}
{"reviewTitle":"Viene el sello de garantía roto","reviewDescription":"Recibí el producto, la caja de Amazon bien, pero el producto venia abierto, incluye la consola, control y cables, el código se encuentra a un lado de la consola","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Mexico","date":1684972800000}
{"reviewTitle":"2tb price for 825gb console.","reviewDescription":"Don't get scalped. It runs fine and is in fact a PS5, but the specs do not clarify the console storage space. It's only 825g, not the $500 2tb console you're probably looking for.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1671062400000}
{"reviewTitle":"PS5 Console","reviewDescription":"So far so good. Box was not damaged and the game started right up. It was also easy to transfer my info.Submit your invitation request because it works.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"As advertised.","reviewDescription":"Giving it 4 stars only because it was delayed twice, which made me a be a worried BUT it did arrive and everything is in order.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670803200000}
{"reviewTitle":"Disc Version without disc","reviewDescription":"Everything was great...honestly I was very disappointed having a GOW Disc PS5 Version receiving a \"code\" instead the physical disc game!!! Not cool at all!!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"gaming","reviewDescription":"great consoleevening throw I had to lay it flat but all in all great console","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Standard white ps5 with code","reviewDescription":"It's just a standard white PS5 with a digital game code I was hoping for some sort of painted or sticker etching or something like that on the case","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669420800000}
{"reviewTitle":"Works great.","reviewDescription":"Everything is good!Just not as fast I thought it would be.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Great System","reviewDescription":"The system came perfect with the game!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677801600000}
{"reviewTitle":"Finally","reviewDescription":"Arrived a couple days late but I finally got it. Kinda bummed it was a voucher and not a disc tho","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669334400000}
{"reviewTitle":"Hermosa consola","reviewDescription":"Excelente producto","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682294400000}
{"reviewTitle":"Does not read discs!","reviewDescription":"I ordered it and everything was fine. I could download a game and play and that went well. But I bought two games\/CDs and the console cannot read them. So be careful.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Everything was great until...","reviewDescription":"So everything was as expected, took 5 hours to set up, played for a minute then went to charge the controller.. and it won't charge.... for $600 it's bad enough you only get 1 controller but the 1 controller you do get won't charge?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677628800000}
{"reviewTitle":"Kept crashing","reviewDescription":"I bought this item and had it less than 3 weeks. It kept crashing since day one. Not sure if I got a defective one or it’s common issue. Had to return it to my dismay.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"PS5 broke","reviewDescription":"Had it for a few months and all of a sudden doesn't power on anymore","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Ripoff","reviewDescription":"The PlayStation bundle did not include a copy of God of War Ragnarök. What a ripoff and false advertising.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Bad cable","reviewDescription":"Cable wouldn’t stay in PlayStation. It just kept falling out. I had to use a cable from a PlayStation 3 to even get my PlayStation to turn on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Good console but the disc drive won't read discs","reviewDescription":"I've always been a playstation\/sony fan, but this console I ordered had a faulty disc drive. I returned it and hopefully this is only an exception","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679097600000}
{"reviewTitle":"Missing the God of War voucher","reviewDescription":"my PS5 god of war did not come with the voucher code inside the box to download the game. What should I do?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Watch Who You Buy Online From","reviewDescription":"Works great EXCEPT I paid for the disc version and it does not work. Not worth the hassle to exchange it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681689600000}
{"reviewTitle":"Controller Died But Bundled","reviewDescription":"It would have been nice to be able to return the $70 controller without returning the whole thing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"God of War Voucher Missing","reviewDescription":"Very disappointment. I purchased this bundle in order to get the Voucher and it came without it. Very disgusted.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"Blank screen","reviewDescription":"A couple weeks after my warranty now all I get is a blank screen","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676764800000}
{"reviewTitle":"Didn't receive the game","reviewDescription":"Got the ps5 but no God of War game","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"Console came without the controller","reviewDescription":"Console came without the controller","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Overpriced","reviewDescription":"Price is too high definitely not worth it. Would rather have gotten a digital version","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Not good keeps flickering","reviewDescription":"Not good keeps flickering","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680220800000}
{"reviewTitle":"Not worth the money","reviewDescription":"Same problem with thir controllers that was the problem on the ps4 I'm done with ps bs!They have know about  the controller  drift for years and have done nothing about it! It spins on it own and does weird crap! My xbox306 still works and so does the controller even the Xbox one works no spinning no drift or anything! Nintendo had same problem they fixed it, Playstation puts out over priced garbage  and expects me to buy controller after controller! Nope I'm with Playstation!","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"El lector de discos no funciona","reviewDescription":"Recibi el producto en malas condiciones y un sello que no era el de Playstation, ademas el lector de discos no funciona","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1688428800000}
{"reviewTitle":"No Viene el código de God Of War para Canjear","reviewDescription":"De hecho la caja venia maltratada y el código no venia incluido que estafa","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1686873600000}
{"reviewTitle":"Temperatura","reviewDescription":"El cable HDMI se calienta demasiado.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1689897600000}
{"reviewTitle":"Fallout 76 runs so smooth on this baby!","reviewDescription":"Before my gaming experience was super laggy, then my old TV broke (power surge?) and decided to do some upgrades. Found a cheap 50” 4k 120hz refresh Sony X85K (here on Amazon) and then saw they also had PS5’s in stock for a very reasonable price. Before the purchase I almost bought a 120hz TV from Target for $1100, super glad I went with Amazon instead. The X85K is way better and cost around $700 and the PS5 was $500. I like both devices can communicate with each other too, since they’re both made by Sony. For almost the same price as a high refresh rate TV from Target, I got waaaaaay better gear from Amazon. It arrived super fast, delivery guy didn’t damage anything, setup took a few minutes and so far everything is working flawlessly. Lag has been almost completely removed from gameplay and the graphics are crystal clear. Night and day to my old setup, also was easy transferring my data off my old Gen1 PS4 onto the new PS5. Didn’t lose any progress on Fallout 76, the games been running excellent, wish I upgraded sooner, Thanks Amazon!","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Have both PS5 and 2 Xbox Series X. Both consoles A+","reviewDescription":"Since I have both consoles and have no bias, I’ll tell you what I like about this console.Graphics: A+ (Same as Xbox) amazing + fastController: A+ (Better than Xbox) definitely higher quality. Both are comfortableUI: A (Personally like it better than Xbox)  Feels more streamlined to me, but similar to XBoxIf you want to try a game out to test performance, I’d recommend God of War: Ragnorak. The game has top reviews across the board and you will be mesmerized by the graphics and smoothness. I literally didn’t progress for a long time because I was stopping to look at all the details and clarity. Mind blowing how far things have come. A+ investment\/Showcase Final thoughts: Regardless of choice, PS5 and Xbox series X offer improvements over their predecessors. Better graphics and WAY faster speeds. Load times are not an issue anymore and never have I noticed having to wait for anything. That is probably the best improvement in terms of upgrades other than graphics quality. Wether you get PS5 or Xbox series X, you’ll be happy. The only reason to choose one over the other comes down to 2 things:-Exclusive games for the console-What consoles your friends have to party up. (Sometimes this won’t matter, but it’s based on the game and crossplay)","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1674864000000}
{"reviewTitle":"It’s the real deal","reviewDescription":"I don’t know how they prioritize but I got my invite within 24 hours after signing up shortly before Christmas. I was able to order immediately and have it arrive on time. A month later and we are loving it!I had trouble finding the code in the box at first but ended up finding the paper for the game. I only got this bundle because I just wanted to get a PS5 no matter what and this was the first listing that I got the invite for. I am SO glad we got this one. I never played the first game, but this has already shot to the top of my favorite games list.The storyline is engaging and the graphics are beautiful. I’m excited to use the PS5 as a Blu-ray player, as well. If you’re getting a PS5, definitely try to grab this bundle specifically. This game is AMAZING.My one gripe is that I wish there had been a bit more padding when shipped, like maybe some paper stuffing. It doesn’t matter though since the PS5 arrived unharmed.I’m very glad we were able to get a PS5 so easily through the invite system, and at MSRP! So grateful to have not had to pay a markup from a scalper.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1674518400000}
{"reviewTitle":"This item experience can't be explained with words.","reviewDescription":"This is the best item I got on Amazon for 2023 , i rate This item 100 out of 100, it's amazing 👏 👌 🙌,  the experience is remarkable,  game play unquestionably,  featuring unmentionable,  Sony entertainment systems have out done themselves with this product. I highly recommend this item to all homes. What are you waiting on , get yours today,  it's worth every penny. No complaints or what soever.  I wish I could land a dream job of playing playstation 5 games as s job.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Exactly what I wanted","reviewDescription":"I ordered this ps5 from Amazon when it finally came back in stock. It showed up right to my door and was in perfect condition. It also had the game code inside which had no issues. I was able to install the game and all my other games from my ps4 and it has been running smooth ever since. Definitely recommend getting this as a gift for a loved one this Christmas because ps5’s seem to finally be in good stock and who doesn’t love a brand new console! Runs games perfectly and the graphics look pretty great depending on the game. Hogwarts legacy is a lot of fun and so was the new final fantasy games.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Great system to own!","reviewDescription":"I love this thing. I bought the disc version and would recommend that to everyone else. You get the best of both worlds with disc version.  You can buy physical games that come in a bundle package that have rare ps5 related items! Also if you buy digital games they have amazing deals on the PS store! Look around for the cheapest deal on games, it will save you a ton of money. I would recommend buying an additional memory booster. Some of these digital games are well over 100gbs! You will only have around 600gbs when you start off with a new ps5 I believe. Memory gets used up extremely fast! I also had a pleasant experience buying this from here. From me sending a request to purchase a ps5, I had an email invite like 2 days later plus only like 2 days to send it. So I received it extremely fast! I have heard of people waiting much longer though. This can also play most ps4 games as well. Also you can get a playstation plus membership for like $15 a month that allows you to play tons of ps5 and ps4 games. There is a lot of cool things to do with this ps5!! Highly recommend!!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1671753600000}
{"reviewTitle":"FINALLY!After all these Years! 🥺😭🥰","reviewDescription":"So happy to finally be able to buy this at a reasonable price. I refused to buy it of $1800+ dollars and 3 years later here we are.  I am enjoying this game system especially Astro world. I'm a big kid inside and enjoy a lot of rated E games with option for T and M rated.Which is why is why I didn't immediately think to download the free game that came with the system.  Watch my vid of caution so you don't overlook or toss out the paper with the redeem code. Thankfully I keep my game boxes as I travel often so it was still there. But for others who toss everything this can be in the trash because it's so small. Anyways the PS5 is so much fun and worth the wait for the right price.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Just in time for Christmas","reviewDescription":"My girlfriend has been talking about how much she wanted this ps5 for months but it’s sold out everywhere!! I’ve been requesting invitations forever and never won so when I received that email that I finally got invited I was soo happy!! I hopped on it quick and placed my order and it got here within 2 days I wrapped this baby up and put it under the tree the next day my girlfriend woke me up at 8 am with it in her hand shaking it talking about I think I know what this is and asked if it was something she really wanted I said no lol then she said when I was young my parents let me open one gift before Christmas I said your not young anymore and I’m not your parents lmaoo put it back I think she knows so I told her I tried everywhere for this ps5 but couldn’t find it she looked so disappointed and sad and said it’s okay babe I wouldn’t want you to spend that much anyways I know I broke her heart but I wanted it to be a surprise lol long story short thank you soo much she is going to be so happy","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1671494400000}
{"reviewTitle":"Great system with a couple","reviewDescription":"design flaws. The two major ones: 1) Lack of initial memory. You'll need to buy a second drive but those are easy to install and they are easy to find. 2) Whomever designed to Stand for the Ps5 needs to be fired. It is terrible and should be something else a person buys at the time of purchase. 3) <Personal choice but I didn't like the bright white cover and bought a replacement Midnight Black. BUT that is a personal preference.>------------------A couple of months later and things are still moving along great. One thing I HAVE to tell people - For the love of everything , do NOT place your Ps5 in an enclosed space . Give this thing room to breathe and receive air in order to keep it cool. Make SURE you are able to at least access it in order to clear it of dust every now and then. This console is a tank. It's big. It's bulky. And it needs space .  This thing is too valuable to risk blowing up because you store it in a cabinet ; simply because it looks neat.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"Best console since the PS1","reviewDescription":"I’ve had every interaction since PS1 and every Xbox as well up to the series X and this is my favorite console to date. It’s wicked fast on load times even for old games. The graphics are insane (even old games look better) the storage can be expanded easily with an M2 or external disc drive (I’m using both and it lets you determine your install location by game type. So all my PS5 games go to my M2 and all my PS4 games go to external storage leaving console storage free for photos and software updates) there’s a couple minor bugs in the gui but those are gradually being taken care of as updates continue to roll out. Overall your best value dollar for dollar in entertainment.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Excelente producto","reviewDescription":"El envió fue bastante rápido (4 días hábiles), la caja era bastante grande, con espacio sobrante. Aparte de la ps5 venia un pequeño papel arrugado para completar el espacio (no era suficiente). A pesar de eso el paquete llego en perfecto estado. La consola y su caja estaban impecable con los sellos correspondientes, dentro de la caja de la consola estaba la factura de Amazon y el código para canjear el videojuego God Of War Ragnarok.En cuanto al hardware, nada que decir, es espectacular. Potente y sorprendentemente estilizado; El mando es increíble, viene un pequeño juego donde te muestran todas las cualidades del mando.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Love","reviewDescription":"Loyal Playstation player since ps2 and we always get the newest model not too long after it comes out.  Pleased with this system and no complaints.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Amazing","reviewDescription":"Everything was in order, easy to set up... heavier than I thought it would be but the specs are all definitely listed online. I will say, the HDMI cable included with mine didn't work so I had to swap it out but my PS4 cable fits it so at least I was able to use it without buying a new one. GoW is such a great game.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"It’s a PS5!!! Amazing","reviewDescription":"I was so happy to finally get a ps5. I had been looking for one for so long and this was a blessing to finally get one. It’s 100% legit and I had concerns with all the scalpers and fakes online. I can’t tell you how excited I was to get a perfect system! The PS5 is near perfect in my eyes. Developers are still trying to fully utilize the specs but I can’t wait to see what the future holds. If you can… get it… now…","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Made my foster son's day","reviewDescription":"My foster son had set his goals for a PS 4 and was totally out of it when he opened up the package and there was a PS 5.  The only problem is....getting him out to come for dinner.  He was thrilled though and all worked great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Excelente producto","reviewDescription":"llego mas rapido de lo esperado, una semana antes, todo fue excelente, y llego en perfectas condiciones. Totalmente recomendado, aunque es mejor estar listo para comprar algunas cosas mas si se quiere tener la experiencia coompleta, como una base de recarga o un control extra para jugar en cooperativo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"Exactly as it should be","reviewDescription":"It is what I ordered exactly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Awesome","reviewDescription":"Awesome gaming unit it's the real deal but be sure you understand that a code will come to your email to let you know when your unit will be delivered. My daughter purchased it for her brother's birthday, but she was away when his package was scheduled to be delivered WHO KNEW, and no one had access to her account it was a nightmare. PLEASE be prepared with everything you need to receive your package.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"Came in perfect condition","reviewDescription":"I was a little hesitant to order such an expensive and fragile item like the ps5 from Amazon but they delivered it with care and in flawless condition. Glad my order went so smoothly. Now I'm having a blast with my ps5!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Very happy to finally own a PS5. Amazon is the best!","reviewDescription":"I was just casually shopping on my Amazon app when I saw that PS5s were being sold by invite. I wasn't too thrilled with an invite because I've had bad luck with PS direct, but I gave it a go. Didn't think much of it but low and behold I got an email the very next day telling me I had 72 hours to purchase. I immediately pulled out my credit card, put it in my cart and I couldn't believe it. The transaction went through. Still doubting I kept checking and then \"Your order has shipped\" Then I knew it was real. Finally! I waited 2 years. No scalpers, no 3rd party. A proper PS5 purchase at retail price. Thank you AMAZON!","isVerified":true,"ratingScore":5,"reviewReaction":"78 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Fried after 13 months of use. Would not recommend this product.","reviewDescription":"Purchased this product exactly 13 months ago. Of course, as soon as the warranty ends, it stops working. Every time you launch a game, the console completely turns off as if someone unplugged it from the wall. I have spent thousands of dollars on games, accessories and the console itself for such poor quality. I have been committed to PlayStation for 16 years and I am no longer interested in giving them another dime.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Help Please !","reviewDescription":"The PS5 I purchased was advertised as a “NEW”  product, however when I received it, it was very much “USED” and there were missing items from the purchased order. It was missing the game voucher which was part of the bundle. The box was all taped up, as if it had been ripped to pieces and taped back together. The inside contents appeared to have been repacked, and the console itself was dirty and had what appeared to be hair on it and inside of it.  When I power on the console it displays an error message, and I cannot go passed it. I am desperately trying to may contact with someone to help me with this but have been thus far unsuccessful.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Producto defectuoso","reviewDescription":"Producto a los 5 meses se empezó a apagar solo, si eres de chile no lo compres. ya que no hay soporte técnico en chile si el producto lo compraste a través de Amazon, ya que no es un proveedor oficial y legal de PlayStation en chile. Mala experiencia, Amazon no se hace cargo tampoco, he perdido 700 dólares aproximadamente con los impuestos incluidos, tendrá que llevar el producto a un servicio técnico particular donde me cobran mínimo 150 dólares. Mal playstation y mal amazon por no hacerce cargo y no dar una visibilidad de los limites al comprar a través de su servicio","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"Ps5 Crashes","reviewDescription":"The ps5 would crash unexpectedly whenever I tried to play any games. I tried out all the fixes that were suggested on the PlayStation website and none of them work. I also contacted PlayStation support through phone and they said they are unable to help me since I am currently not in the US, even though I had the ps5 shipped to a US military box. They told me to call the Korean support, but the numbers they provided did not work at all. I am very disappointed with the products as I also saw many people having the same crashing issues with their PS5s.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"My PS5 was defective and it was not handled well!","reviewDescription":"After waiting a few months to get approved to buy this item I finally got it! I was so excited! Upon reviving my PS5 it would not play games and the screen was pixel-ly. After calling Sony (which was no help at all, I have never had a manufacture tell me they would not handle a defective device) I finally called Amazon cust. Service and was very disappointed with how the situation was handled. Cust. Service refused to exchange it and made me wait over 17 days to get my money back, I love Amazon but I will never order a big ticket item from them again.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1672790400000}
{"reviewTitle":"Received a defective item","reviewDescription":"I got this for my son for Christmas but he was on vacation with friends out of state for a couple weeks during college break, and when he went to set it up it this weekend it was days after return window closed for Xmas gifts.  He opened the box and the PlayStation was dirty with grayish\/brownish dust on both sides of the white tower.  We tried new cords and power strips but the system would shut itself off and never made it thru start up.  Appears they sent me a returned item which was defective and thankfully Amazon is letting me return it.  We will try another one to see if replacement works","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"SO DISAPPOINTED! (Refurbished PS5)","reviewDescription":"I bought a brand new PS5 & a refurbished PS5. The refurbished PS5 (Which I know is not going to be “perfect” ) did not work. The controller will not connect, we’ve switched chargers we’ve switched ports we’ve done the hard reset and we’ve also disconnected the other PS5 controller and tried it on this PS5 and still nothing. It’s not the controller something is wrong with the console itself! Such a disappointing experience. There’s no way someone examined this & said “YEAH, IT WORKS” I bet you anything they will ship this out again to someone else. If I could leave 0 stars I WOULD.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"Just stopped working","reviewDescription":"Got this for my son and after a year and 1 month of having it….it just cut off and won’t come back on! And of course it’s past the 1 year warranty period 🙄🙄","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Scammer possibly??","reviewDescription":"When two day delivery took over a week, I knew something was up. Didn’t even come in a box, fired the PS5 up for the disc driver to sound like it wasn’t turned off in over 6 months. I expected the console to be load but it was shaking my floor. How ever, when trying to sign into my PlayStation account, I’m immediately met with an error message stating that “This PS5’s services access is permanently or temporarily suspended”. At the price point I was really wishing it wasn’t too good to be true, but alas, I am met with bunk product once again.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Manufactor is not available by phone or email site ...Not away to conduct a business","reviewDescription":"This is a gift to my daughter for Christmas and we received a defected PS5 console and trying to replace\/exchange this item is trying to find a needle in haystack, you cannot reach the manufacture by phone, I know this cause Amazon tried 5 to 6 time both times I reach out to Amazon customer service center then I try and by email though manufacture web site could not get though either...unacceptable, VERY UPSET CUSTOMER, IM NOT RICH and VERY DIAPPOINTED in the way this manufacture conducts there business and the customer service site or by phone. This is a big business and its ashame the way you treat your customers. \" Play Station 5 Console\"","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Listed as NEW but....","reviewDescription":"This item was listed as new, but the remote appears to clearly have been used.The console works great, but I'd like a new controller.If this is stuff you don't mind, this is a good buy.Just buy the extra warranty to be on the safe side.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"No voucher code","reviewDescription":"I did not get the god of war Ragnarok voucher code. It is a game  for bundle.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"I got a refurbished one for full price","reviewDescription":"It works so I haven’t complained. It was obviously refurbished though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"Controller stopped working","reviewDescription":"Console works how it’s supposed to. Good speed. The controller stopped working after 2 weeks though. I recommend getting a extra controller.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671840000000}
{"reviewTitle":"Buy right","reviewDescription":"The redeem code of the God of war game that came with the console only works in USA","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"Did not include God of War","reviewDescription":"The box came without the God of War code for the free game.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679443200000}
{"reviewTitle":"Muy bien","reviewDescription":"Llego días antes de lo que esperaba.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682640000000}
{"reviewTitle":"Sonido interior","reviewDescription":"La consola suena muy fuerte, nada normal","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"One heads up","reviewDescription":"Items inside were moving around as I was wrapping this as a gift. For something this expensive I hope it functions 100%.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"Caja","reviewDescription":"La caja vino rota en esas dos secciones. He tratado de comprar otra peronme dicen que no hay.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1681171200000}
