{"reviewTitle":"Durable and Handy to have on hand","reviewDescription":"2 of these melted up on first use , (not able to identify rather it was the electrical outlet it was first plugged into \/ faulty electrical internally where the initial mishap took place) since that day the other 3 have not only stood the test of time but held up w the ridiculously extensive caliber of use that I put this type of item through. (Border line abuse \/ excessive usability test) I want to more clear that my 3 star rating is pertaining more to a level of satisfaction w over all situation\/event that took place from start to finish of buying process \/ receiving item and then prolonged use of product. From start to finish w what I experienced . With that said the item you will receive is more than worth money spent and efforts put forth  as well as buyer seller interaction . When speaking of that aspect the item arrived a day or two before schedule , it is quality made and though it doesn't contain any features beyond what it is descripted to be it caries out complete functionality and will serve it's purpose completely .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Okay, but they're not durable at all","reviewDescription":"I've bought these charging cords several times now.  I liked the braided exterior thinking it would make them more durable than the soft plastic ones.  I was wrong.  They're effective for a few months, but then they charging becomes slow or they just won't charge any longer.  You get what you pay for with these.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Haven't held up","reviewDescription":"They seemed great at first, but a few months later and we're down to only two working ones. Those two are so loose in our charging ports that if you bump them at all, they stop charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Lasts about a year and a half","reviewDescription":"These seemed to perform fine for about a year and a half, but now all of the wires seem to have degraded and slow charges. I have other brands that are older and still perform fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Bad batch","reviewDescription":"I must have received a bad batch. I purchased the red one previously and they still work (at least the few I still have since family members inconveniently take some). However, none of the grey ones work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Definitely not junk","reviewDescription":"Good quality. Connected data to my computers and cars where other cables would drop connection. These never did, so the quality is good. My only complaint is that they got loose at the port after 8 months so now I have to replace them. The port issue is not our 4 phones, as a new cable immediately is tight and works perfectly. I'm buying them again, just know you'll have to replace them twice a year.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Get what you pay for","reviewDescription":"I found the charging throughput to be excellent, and the price is as well.  However, one of mine that gets gentle use in a stationary location has had the type-c connecter end push into the housing in less than 3 months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Works to Connect but not to Charge","reviewDescription":"They’re very sturdy cables and seem to be great quality. When I use with my phone or Xbox controller, they work fine to connect with devices; however, they do not work in charging those things. They won’t charge my phone or controller. I verified it was the cable by switching to a different cable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Very slow charging but they are nice quality","reviewDescription":"I wanted to love these because they were such a great deal and they feel nice in your hand but these charge incredibly slow. It takes ages to charge my iPad which should not be the case. I would have paid more for something that worked properly than for something cheap that is this slow.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"USB Type-C Cable 5pack 6ft Fast Charging 3A Quick Charger Cord, Type C to A Cable","reviewDescription":"Works fantastic for charging or a power cord for a portable monitor, but don't use it for data transfer, it's only USB 2.0 speeds, around 34 MB\/sec I tested it with Crystal Disk Mark on Windows and Kdismark on Linux, same computer, different hard drives. I used it with my Sabrent portable NVMe enclosure, speeds with my regular cable I use with it was 450 MB\/sec. I even flipped the C side to make sure it wasn't a one side fast, one side slow like one cable I have. This is just a USB 2.0, but it works fantastic for charging and Fast charging.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"A Tangled Mess: Disappointing Experience","reviewDescription":"I recently purchased the USB Type-C to A Cable 5-Pack with high hopes for a reliable and fast-charging solution. However, my experience with these cables has been nothing short of frustrating, leaving me thoroughly disappointed.The first issue that became apparent was the misleading promise of \"Braided Fast Charging.\" Despite the braided design, the charging speed was far from impressive. Instead of the advertised quick charger cord, the charging time seemed slower than some standard cables I've used in the past. This inconsistency was a major letdown, especially when in a rush to juice up devices.The 6-foot length, intended to offer convenience, turned out to be more of a curse than a blessing. The cables are prone to tangling, and no matter how neatly I tried to arrange them, they seemed to develop a mind of their own. This constant battle with knots and tangles made the cables more of a hassle than a helpful accessory.Furthermore, the durability of these cables is questionable. Despite the braided exterior, which usually suggests sturdiness, the connectors felt flimsy and showed signs of wear after minimal use. One of the cables even stopped working altogether after just a few weeks, leaving me with one less functional option from the 5-pack.In terms of compatibility, these cables seemed hit or miss. While some devices recognized them without issues, others experienced connectivity problems. This lack of consistency raises concerns about the overall quality and reliability of the cables.In conclusion, the USB Type-C to A Cable 5-Pack failed to live up to its promises. The slow charging speed, constant tangling, questionable durability, and compatibility issues make this purchase regrettable. I would strongly advise against investing in these cables, as they deliver a subpar charging experience and fall short of the expected standard.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"All  5 USB Cables Failed in Just 4 Months","reviewDescription":"purchased a set of 5 USB cables back in October 2023, hoping they would serve as reliable connections for my devices. However, my experience has been profoundly disappointing. As of today, February 11, 2024, not a single cable from this purchase functions as expected.Initially, these cables appeared to be of decent quality, and I had high hopes for their performance. Unfortunately, their functionality began to deteriorate rapidly. Within a few months, all three cables have ceased to work entirely—they neither charge nor connect any of my devices. This complete failure renders them absolutely useless and makes the purchase a total waste of money.I had not subjected these cables to any extreme conditions or rough handling that could justify such a short lifespan. Their inability to perform the most basic functions of a USB cable is simply unacceptable. It's clear that the quality and durability of these products are severely lacking, making them not worth the investment.To anyone considering this product, I strongly advise looking elsewhere. The inconvenience and frustration of having to replace these cables in such a short timeframe far outweigh any initial savings or perceived value. It's disheartening to encounter such poor product quality, and I hope this review helps others avoid the same disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Terrible","reviewDescription":"These cables were worse than terrible. Not one single cable worked. Unfortunately I had some family emergencies arise so I did not get them returned within 30 days to get a refund.. I would give them zero if I could but I hope this review keeps others from wasting your money like I did.. horribly disappointed and don’t understand how Amazon could let someone sell a product that did not work at all on their site.. deeply disappointed in them..","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Don’t buy these","reviewDescription":"I bought this 5 pack of usb a to c cords for my family when all of us upgraded to iPhone 15. I got them mostly for spare charging cords snd the car. Finally needed to use one in the car two months after purchasing. It did not work. Brought it home and it does not work anywhere with any device. Neither do any of the other 4 in the pack as I realized I needed to test them. I am 4 days past my return window and out of luck. Glad they were not expensive but still this is terrible quality. Stay away. Pay a little more for cords that work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Very short useful life","reviewDescription":"I always wait a while to place reviews.  I bought these last August.Durability and workmanship can only be measured after substantial use.  Nice to have a quantity of 5 long cords, but perhaps the reason they give you five is they know they don't last long.  The first cord I pulled from the pack began losing connectivity where it plugs into the phone after a few months use.  The second lost it's turbo and started charging slowly after a month.  The third did the same after 2 months.  After setting my expectations low on cord number 4, it lasted a surprising 4 months but then lost connectivity recently.  Cord 5 is in use as of July 2022.  I use these to recharge a single cell phone.At the present rate, I will burn through all cords in about a year.  Compare that to the recharge cord provided with the phone that is still delivering a good connection and turbo recharge with no problems for the past 18 months.  I took a close look at both cord connections to the phone.  It is clear these cords show noticeable wear after a couple months while the 18 month old Motorola cord has none to mention.  They also fit more loosely even when right out of the box.  Amazon recommends this product.  Obviously they have not tested itClearly the workmanship on these cords is sorely lacking.  It's too bad because they look and feel solid...they just serially fail way too soon.","isVerified":true,"ratingScore":1,"reviewReaction":"37 people found this helpful","country":"United States","date":1658880000000}
{"reviewTitle":"4 out of 5 don't work properly","reviewDescription":"I was so excited to finally have enough charging cables for each of the rooms in my place but after trying to get them set up, I found out that almost all of the cables don't even work unless you hold them in a specific way and don't move them. They come in a package folded up and it seems like the folding of the cables makes it so that it's useless unless you sit there and hold the cable in a way that's similar to how it was originally folded for it to even charge. Even then, it's not a guarantee that the cable will continue to charge, unless you tape the cable or put something on top of it to hold it in place.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Don't buy","reviewDescription":"Two of these arrived broken. Should have returned them then, but we needed the chargers so decided to try to make the rest work.... They're so poorly made that one of the remaining ones had the metal piece pull out and get stuck in a device, one the seems fine on the outside isn't getting connectivity, and one just kind of gave up. Don't waste your money on these!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"These do not work","reviewDescription":"The family just got brand new iphone 15s, i bought these to have in our cars since the new iPhone takes a USB C and most of our cars have USB A. None of the 5 cords works. I didn't try one until the packaging was thrown away and my daughter took one with her to college so now I can even return them. The USB A end fits very loosely so not sure if that is the issue or not. Absolute junk.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Doesn't work","reviewDescription":"None of the cables in the pack worked. I connected them in several outlets and they didn't charge my phone. Only one worked for a few minutes and then went dead. I have tried my other cables in the same outlets and they all work fine. I wasted my money on this. I guess the price was too good to be true.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"DO NOT WORK","reviewDescription":"I would give this -10000 if I could!!! Upon getting the first package we tried them out and not one of them worked!!! I tried them all on multiple different outlets and they would not even light up the phone to indicate charge!!!!! We thought maybe these were defective let’s just get a replacement! Boy were we wrong. Again we went through the same process and NONE OF THE NEW CHARGERS WORKED! Out of the 10 chargers we received NONE OF THEM WORKED ANYWHERE!! What a waste of time I am very disappointed.  DO NOT BUY THESE!!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Durable and Versatile Charging Cables: Ideal Length for Convenience","reviewDescription":"I've been using these charging cables for both my iPhone and Android devices and I'm genuinely impressed with their performance. One of the key advantages is their length, which makes them incredibly practical for various settings, whether at home or in the office. This longer length provides the flexibility to use my devices comfortably while charging.The build quality is another highlight. The cables feel strong and durable, giving me confidence in their longevity and resistance to wear and tear. Their compatibility with multiple device types adds to their versatility, making them a great choice for households with different gadgets.I found these cables efficient in charging, delivering consistent power without any issues. I was so pleased with their performance and value that I purchased two packs. For anyone looking for reliable, long, and versatile charging cables, these are an excellent choice. They offer a perfect blend of functionality, durability, and practicality.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Very good charge cables","reviewDescription":"My phone is a few years old and the USBC port is starting to wear out. It is very selective of what cables will work now so usually when I purchase just 1 it is a gamble as to if it will continuously charge. So I ordered this multi pack. I figured at least 1 would work.Ripped open the first 1 and plugged it in. Phone started charging immediately! Very fast charge. What I expect out of much more expensive cables. Now I have extras! This is a great cable. Quality is as good as much more expensive ones. It feels well made and the ends are really durable where the plug meets the cable. It has good flex to the cable as well. What an amazing value.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Actual fast charge.","reviewDescription":"I bought this USB Type-C Cable 5pack 6ft Fast Charging 3A Quick Charger Cord, Type C to A Cable 6 Foot Compatible Samsung Galaxy and I am very happy with my purchase. The cables are durable, flexible, and long enough to reach any outlet. They charge my Samsung Galaxy phone very fast and I can use them with any USB-A port. The 5 pack is a great value and I always have a spare cable in case I need one. I highly recommend this product to anyone who needs a reliable and fast charging cable for their phone, tablet, watch or orher USB type C devices","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Ideal length, durable, and versatile multipack charging cables","reviewDescription":"I have been using these charging cables with my phone and various devices and am impressed with their performance. One of the main advantages is their length, which makes them incredibly practical for multiple settings, whether at home or in the office. This longer length allows me to use my devices comfortably while charging.The quality is solid and durable, giving me confidence in their longevity and resistance to wear and tear. Their compatibility with multiple device types adds to their versatility, making them a good choice for someone with different gadgets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Excellent value and impressive quality","reviewDescription":"You could not ask for a better built cable at this length. Excellent quality, thick and sturdy cord and connectors. Provides adequate power through cable regardless of length. While it may not be rated for outdoor use, I am using one of them to power an Alfa AWUS036ACH from my camper mounted under my garage. It has help up fine so far without issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Good quality usb cables","reviewDescription":"My puppy chewed up a couple of my cables so I needed some replacements. These work great, I like the braided cable feel and 2m is a good length for most of my uses. No issues yet, definitely recommend. Good value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Awesome Wire Don’t Pass It By","reviewDescription":"I bought a wile back before i got the i phone 15 pro max.I used it first on my apple phone i got three years agoIt worked wonders loved it then when i got the 15 pro max i was mad because no charger i had worked with this it took new charges so after about a week of the tiny cord they sent me i gave up on and started looking for something.Then it dawned on me to see if this would work with it well it did and very nicely to.So today i need a new portable charger also for the new phone so i decided to try the old one with the same wire.Yes indeed it worked wonders.Do don’t pass this one up i would advise you to try it out i did and it has saved me money on more expensive wires.I give this s to notch A for its use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Excellent charging cords - second purchase","reviewDescription":"This is the second time I have ordered these charging cords, and I will order them again when I need them. We all know that charging cords go bad after a while from sleeping on them, stuffing them into backpacks, repeated use, and so on. Typically the fast charging cords start to slow charge instead of just failing to work. I am rough on my cords. These cords have lasted longer than any other charging cords I have had, including original equipment cords. BUY THEM!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Reliable.","reviewDescription":"I bought these for the long length, and because they are fabric coated. I typically have better luck with the fabric coated charging wires, as they do not bend and break at the connecting point as easily as non coated ones. The same holds true for these. For the number of chargers in the pack, this is a great deal. I have used them with my Motorola phones, and my Nintendo switch with zero issues. My phone doesn't have any kind of fast charging feature, and these cables seem to charge at the same rate as the OEM cables. This is my second time purchasing these cables, as my others are in use, and I will definitely keep this on my list to rebuy for my needs in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Top-notch Charging Cables for iPhone 15 - 5 Stars!","reviewDescription":"Title: Excellent Charging Cables!I recently bought the USB Type-C to A Cable 5-pack and couldn't be happier. These cables are durable, fast, and perfect for my iPhone 15. The 6-foot length is just right, and the braided design adds extra strength. With a 3A quick charger, my devices charge quickly. Great value with the 5-pack. Highly recommend! 5 stars!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Braided Bliss: A Tech Enthusiast's Review of SMALLElectric's USB-C Cables","reviewDescription":"As a tech enthusiast, I'm constantly on the lookout for gadgets and accessories that can keep up with my demanding lifestyle. Enter SMALLElectric's 5-pack of 6ft USB-C to A cables, a seemingly simple product that surprised me with its quality and functionality.First Impressions:Pulling back the no-frills packaging, I was greeted by a tangle-free bundle of sleek, grey cables. The braided nylon design instantly screamed \"premium,\" and the connectors felt reassuringly solid with their aluminum housings. Plus points for ditching the excessive plastic often found in cable packaging!Performance:Plugging one cable into my trusty Galaxy Note 10, I was met with the satisfying \"fast charging\" notification. Data transfer speeds were zippy, allowing me to quickly move files between my phone and laptop. No dropped connections or hiccups – just smooth, reliable performance.Durability:Let's face it, phone cables endure a lot of abuse. I wasn't gentle with these cables, tossing them in my bag, snagging them on doorknobs, and generally subjecting them to the chaos of my daily life. But the braided nylon held strong, showing no signs of wear or tear even after weeks of use. The reinforced stress points near the connectors added an extra layer of confidence.Value:Five 6ft cables for under $15? That's hard to beat, especially considering the build quality and performance. Compared to individual cables from big brands, these offer exceptional value for money.The Verdict:SMALLElectric's USB-C cables are a winner in my book. They're stylish, durable, and perform admirably, all at a budget-friendly price. Whether you're a techie like me or just someone looking for reliable charging cables, these are definitely worth considering.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Decent cable, beware of the 10’ version","reviewDescription":"We upgraded phones and I picked these up due to reviews and rating.  We bought multiple sizes since we had many lightning cables to replace.The 3’ and 6’ have been great and flawless.  The 10’ cable will not charge an iPhone 15.  All 5 cables tested against 4 phones and the same result.  Sadly missed the return window before using a 10’ and thought nothing about it based on other lengths performance.Would buy again, just not the 10’ of this brand.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Great product just doesn't hold up very long","reviewDescription":"We go through 2 or 3 of these packs a year for our family of 5.  I don't feel like to durability is as good as it should be.  otherwise great product, and I'm still buying them again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Don't drop them!","reviewDescription":"This product is amazing, I have plugged nearly everything in with these adapters and only use one or two cords around the house. I've got tablets, portable batteries, phones and rechargeable fans with adapters. There are a couple of problems though, they aren't the super fast charging cords so my phone will die after constant use while ubering, and hitting bumps in the car will disconnect the cord. The biggest problem you must avoid is dropping the cord on the ground, floor or floorboard of your car. I dropped one in the floor board and had to get a set of tweesers to pick out the magnetic rocks that got stuck in it and gave up eventually. Otherwise overall amazing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Inconsistent reliability, but oh well!","reviewDescription":"This is a review for USB Type-C to A Cable 5pack 6ft Braided Fast Charging cords by the SMALLElectric Store.I use two charging cables in my bedroom and one cable is no longer working at full capacity as you can see by the pictures captured by my phone in slow charge mode.  The other cable works fine.I guess if you get 5 and 2 or three work for a great price, it's a win?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Doesn't work with my iPad","reviewDescription":"To be clear, with everything else, these cords work fine. They charge my phone. But I bought them mostly so I could have a specific cord for my iPad aaaand...they don't work with the iPad. I don't know why. I don't even get the warning about using non Apple accessories. Kinda defeats the whole point of me buying them, but oh well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Sturdy","reviewDescription":"I have no complaints about these cables. No kinks at the neck, no melting etc.They're a good cable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Good chargers","reviewDescription":"They are long and comes in good packaging, they don’t charge as fast as other but I still recommend","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Charges slower than expected.","reviewDescription":"Doesn't charge as quickly as stated.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Gets the job done","reviewDescription":"They get the job done, I was in a rush when I purchased them and didn't realize they weren't as long as I thought. Other than that, they're okay.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"So nice having 10 foot long cords! Will stop at go get a room","reviewDescription":"Nice heaven 10 foot long cords in the braiding seems really nice. I think these cables are going to last a long time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Not fast charging","reviewDescription":"I ordered 3 sets of these and gave tested cords form each pack. None of the cords I have tested register as fast charging","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"These DO NOT work with new iPhones","reviewDescription":"Quality seems pretty good, but they will NOT work with new iPhones. I wish I knew that ahead of time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"DOES NOT WORK WITH IPHONE","reviewDescription":"Does not work with IPhone but does charge other things. I would consider a different brand","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Broke within a week of use","reviewDescription":"Super cheap and broke within a week of using it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Wrong size","reviewDescription":"The cords work as described but they sent me out the wrong size I ordered 6ft cords and received 10ft cords","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Don't last","reviewDescription":"They don't last long.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Not 5 cords","reviewDescription":"I've tried this product and it charged my phone and devices. I haven't tried the fast charge compatibility yet but my main problem is mine only came with 4 cords :( other than that I think it's ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"One pack worked, the other didn’t","reviewDescription":"I bought two 5 packs of these cables and one pack of 5 worked great and the second pack not a single cable worked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"C-charger","reviewDescription":"Good quality charger very flexible could move from long distance but only thing is I bought once and taking my money out charge me 3 times I didn't got nothing so message me back according to this this transaction thank you!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Disappointed, NOT worth it.","reviewDescription":"I purchased these because they were affordable and longer. My kids are always taking chargers and somehow lose them or they brake. So having these, I gave one to each kiddo and told them that's where it stays. Well, literally 24hours later, one charger stopped working. While plugged in it would keep triggering the phone to think it wad being plugged in and unplugged every 6 seconds. Two days later, 3 went out all together. Our last one broke tonight. I really wanted to like these and purchase more but unfortunately, they were either crap or faulty.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Lose fitting never charge god.","reviewDescription":"These all fit lose took me 36 years to charge my phone. Ive long ones before and never took 36. Either would charge slow or would just stop charging then have to take out and put back in. I missed the return window on these. I just threw em away. Not worth 2 cents.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"100% fully charged!! (Scam Warning)","reviewDescription":"Works great charging my Samsung S10. A long durable cord is what I needed and what I got.Update: Beware of scams... There was an offer in my snail mail for $15 to leave a 5 star review. The product is fine but pursuing the gift led me to possibly exposing my amazon and paypal accounts.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Do not work!","reviewDescription":"I bought these in September because I was on my last cord. Yesterday my cord stopped working so I replaced it from the ones I bought. I tried all of them and not one worked. They were sealed with pieces of tape so you could tell they were all opened before I got them. 3 of them had stains on them that looked like spaghetti sauce. Hopefully not blood! Serves me right for not checking them out when I got them in the first place. So, I am out 10 bucks.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Waste of money","reviewDescription":"So I purchased these chargers because Amazon no longer carries the ones I previously purchased and have either lost or wore out through my own use. I didn't feel the need to take every cord out of its packaging to make sure they all work but that was a BIG mistake! Only about 2 out of the 5 cords actually work properly & the ones that DO work charge much slower than my other chargers and I could deal with slow charging because they were extras for my kitchen & bathroom. Unfortunately I did not find out that the other cords did not work until after the return period. I'm very disappointed with this purchase","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"None of the 5 cables worked with my apple iPhone 15 pro!","reviewDescription":"My iPhone would not charge and would not connect to my Dell laptop or HP desktop to sync with iTunes.  Other cables bought from other manufacturers work fine.  Garbage!  Do Not Buy!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Safety hazard! Shorted out and nearly started a fire!","reviewDescription":"I worried about these when they arrived because they were loose when plugged in and wiggled in the kindles and nooks used with them. They seemed to charge everything ok so I shrugged it off.I should not have. We almost had a fire start today. We’ve had these for 63 days and smelled burning plastic early in the morning. After running around trying to find it thought it was the dock they were plugged into. After extensive testing with the dock - nope. It was one of these cords. I’m throwing out the rest. This could have destroyed our family home if not caused deaths if it had started shorting out before I got up.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Almost, but do not charge properly","reviewDescription":"They seem to be made very well, braided, molded, and durable. But they do not deliver in the most important aspect, they do not deliver power well. Samsung phone shows the cable needs replacing and charging is slow or stops. Trying the 4th out of the 5 pack right now. Pretty much garbage at this point.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Not Apple Compatible","reviewDescription":"I should have read the reviews before I purchased.  Although the seller lists the iPhone 15 in the description, these cables do not appear to be compatible with Apple products.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Every single cable is bad","reviewDescription":"It sucks that i didn't check until after the return period, I had thrown these in a bag for travel. However every single one of them does not work. Total bust.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"solid","reviewDescription":"Solid material but however is not close to a fast charger or the slowest charger. And not universally compatible with all type c equipment.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"***They Don't Last***","reviewDescription":"I bought this 5 pk of USB C chargers in March. They lasted 7 months for all 5. When they worked, they were great. The length is nice to have. So is the toughness of the braided cord. But...to go through 5 chargers in less than a year is B.S. They sit in my bedroom and are never moved. Very disappointed!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Great price but won't last","reviewDescription":"Like others have indicated, these cables won't last. All cables stopped working 6 months after purchase. Since they're cheap, you can either buy multiples or just but another higher end brand and get it over with","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"N","reviewDescription":"Me danaron la entrada de mi celular ahora el horiginal le queda flojo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"They’re slow chargers but it works","reviewDescription":"I got this because my kids be destroying my charges so I got this so when they try to yank the cord off I won’t be caring if they break. They broke the Samsung originals. Type c to c is way better but the kids be ripping them off. These have stayed firm and they haven’t been yanked out and surprisingly they haven’t broke them. So they are very durable. Got this because it was a pack. Only thing that sucks is that it takes so long to charge or transfer anything with this cord. So these cords are for the kids so they can sit and wait longer for their devices.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Lasted 2 years, then don't work well anymore","reviewDescription":"They were good for about 2 years tops","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Sturdy but slow charging","reviewDescription":"Seem like solid cords but the charging speed could be better.  Using my tester,  I was only getting about 1.4 amps out of these cables while with a better cord I can get about 2.4 amps.  Wish they were a little faster","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Won’t work on IPhone 15","reviewDescription":"Ordered two sets of 5 for our new IPhone 15’s. Not a single one would work. They did work to charge some of our accessories so not completely useless but will NOT work on the new iPhone.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Be careful","reviewDescription":"I'd say these chargers work fine for the price, but can't be your main chargers. they're quick to die and one of mine even melted while not charging anything.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Does not work with Iphones","reviewDescription":"Very disappointed in these cords.  They seem to work with Samsung tablet and kindles but DO NOT work with iphones at all.Sorry I bought them.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Work half the time","reviewDescription":"Yesterday, I plugged in two cords, and they worked just fine. Today, neither cord works. I've taken them out and plugged them back in, and still nothing. This happens often, so I'd say these cords work about half the time. You should look elsewhere. I am doing that now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Not an accurate listing.","reviewDescription":"I selected these because in the drop down menu I could chose 5 items. 5 cords, just like the reviews say. But I only received 2 and scrolling down to the item description it states that it is a 2 pack. I understand I should have read the whole description before buying but I believe this listing is intentionally deceptive about the amount of cords you get.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Damaged my Samsung galaxy s22 ultra charging port.","reviewDescription":"I just had to spend $120 to get a brand new charging port because these fried mine. They are incredibly cheaply made, ususal daily bending causes damage to the wires inside which will cause it to short circuit and fry your charging port. Originally I thought it just put some dust or debris on the charging port or that the cable itself was damaged since it went from taking an hour to charge to over 3 hours to charge from 40% to 80% and would frequently disconnect. Then I bought 2 other chargers from other companies and had the same issue. Chargers fresh out the box would disconnect randomly and take over 4 hours to charge. I just took my phone into a repair shop shop and they told me what happened. Don't waste your money on this, I'm just lucky it didn't brick my phone.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Slow to charge","reviewDescription":"I purchased this product, along with new charging bricks, because I needed new cords.  Allright they are long enough to meet my needs, the phones we have connected to these cords now take over 2 hours, sometimes more that 3 hours, to charge.I now wish that I had purchased the same ones I had before. The phones charged in about an hour with those.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"Failed after minimal use","reviewDescription":"I don't think I've ever had a USB cable fail, until this one. It was used in a stationary location to charge my phone and after only a dozen or so uses, it failed. I replaced it with a different cable in the same location and it worked fine.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Won't last","reviewDescription":"The 6 plugs lasted about a month every two or 3 weeks I needed to replace them because the connector will get lose and come off","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Never again","reviewDescription":"I have purchased this product in the past in the ten ft. Size for my iPhone 14, never had one problem.I purchased the 6 ft for my iPhone 15 only 1 out of 5 works. I won’t waste my money on these again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"DOES NOT WORK","reviewDescription":"I ordered the 5 pack, I've tried 3 so far, none of them fast charge on 4 different devices and 2 of them won't stay in the charging port, they keep falling out. It seems these 5 star reviews are from a year ago and the product has gotten awful since then.Definitely do not recommend and I'm really upset I purchased these.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Total fail! None worked.","reviewDescription":"All cables failed to function at all. Never recognized by my new iPhone 15 despite using known and reliable chargers.Didn’t even work for a few minutes.I hate leaving bad reviews but the cables are totally useless.EDIT: I now see that the description does NOT include iPhones. So, despite the claim of being a universal Type C cable, they aren’t.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Melted and burned my fingers","reviewDescription":"I'm sitting here and smell something burning.  I pickup my phone and the connection burns my fingers.  The burnt melted cable falls off leaving the metal connector in my phone.  I turn off the phone, let it cool down then pull out the metal connector.  I was so worried it damaged my phone so I chrage with another cable and it smells like it burning.  My phone and seperate, different brand cable, not his cable, ended up being okay.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Not for everyone","reviewDescription":"Cables look well made and are packaged nicely, which would be impressive if they worked! Unfortunately I have discovered that they are very selective about what they will charge. My Samsung S23 charges fine, S3 tablet won't charge, Samsung A7 tablet won't charge. All used factory chargers. Discovered this problem after my return window closed so no return option. Hate to throw them away but at least they didn't cost much.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"NOT ALL USB C CORDS ARE CREATED EQUAL!","reviewDescription":"When you look at these cords compared to other cords on Amazon, you're thinking, \"yeah, what a great deal.  Let me buy a set.  All cords are the same right?  A cord is a cord is a cord\", so I thought.  I purchased a few of these cord sets.  I gave them to different family members to charge their Google Pixel devices.  Everything was working well until, at random, family members (who live in different residences) started reporting the same problem - the phone would stop working all together.  After researching online, Google engineer Benson Leung indicated that there are some USB C cords that can damage your device because they don't supply the correct voltage.  Unfortunately, I believe this is the case with these cords as well.  They ended up frying the devices so that they don't work at all.  It short circuits the device so that it's basically useless.  I had to replace a number of Google Pixel devices because of this.  I really wanted to enjoy these cords because they're braided and durable, but if it can't give the correct amount of current and damage the device, it's not worth it.  The voltage issue with USB C cords isn't common knowledge now, but I will work to inform my friends to get name brand cords and not to try to save money on the cords - it's not worth it.  Most people won't think about the cord damaging the device and think that it's the device that's faulty, but that's not always the case.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1595289600000}
{"reviewTitle":"Poorly Made Product","reviewDescription":"Purchased these cables and they did not work. Tried two of them from our package and could not get them to charge our devices. We were on vacation and luckily I had a different brand cable with me to use. Otherwise our c cable electronics would have been useless. Do not recommend!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Complete garbage.  Does not work in any outlet or USB plug.","reviewDescription":"I only tried one of the 5 cables, but the one I did try did not work.  It fits my iPhone 15 perfectly, but no electricity comes through!  I tried so many different USB ports\/plugs and then so many outlets.  The problem is not my house, the problem is this product is complete garbage.  How does Amazon allow this kind of poor quality on their listings?  Save your money and buy some other product.  I'm returning mine.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Does not work with iPhone 15","reviewDescription":"I bought these to use with my new USB C charging iPhone 15, but they don't work.  They seem well made, but if they don't charge the phone, the build quality is irrelevant.Based on other reviews it seems like they may be a fine choice for Android phones.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Don't waste your money.","reviewDescription":"Trash! If I moved my phone while they were plugged in it would stop charging. This was on three different cords and two different phones. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Waste of money","reviewDescription":"Bought these hoping to charge a kindle and Samsung tablets. I've tried all of them, they either didn't charge or was very, very, very slow. Spend the extra money on a good cable instead of trying to save money with these because all you'll do is waste your money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Junk","reviewDescription":"Worked ok for several months. Now none of the cords work. First they quit fast charging, then phone won't even recognize it. Worst charging cables I have purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Didn’t work at all","reviewDescription":"Don’t waste your money. These didn’t work at all for me and my wife.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Complete junk","reviewDescription":"None of these five cords worked from the beginning. I attempted to charge my phone, and quite literally each and every one of them failed to connect and charge. Unfortunately, I missed my return window, so I am now stuck with 5 USB cords that are completely useless.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"Charges okay","reviewDescription":"These chargers do not hold up well, break relatively easy. They also do not charge very fast.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Pretty good","reviewDescription":"One broke pretty quick.But the rest work great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Great fast charging cord!!","reviewDescription":"Does it's job and it charges devices quickly .I think they will last as they are made from sturdy tough quality materials ..thanks!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Not bad!","reviewDescription":"I'm pretty impressed for the money.  Usually I buy Anker cables because the quality is always very good but these are perfectly acceptable and a very good deal.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"They work","reviewDescription":"The charge is slow but they do charge. Good for overnight.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Pretty great substitute","reviewDescription":"Althought in comparison to others, my intent was to use it as a substitute for the broken cable I had for a drawing tablet. I had checked all of them if they work at start and yes they do. Test them on the LG tablet I had and the fast charge symbol appears, pretty neat. Although long term wise we shall see if it holds. Either way I was a bit giddy to have spares, all of them came in one piece.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"Nearly there.","reviewDescription":"Quality of the cable and connectors was fine. Shame I had to move the little Velcro straps from another manufacturer to the new connectors so I could coil up the cable. As I said nearly there.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"I'll buy again","reviewDescription":"Gets the job done","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Ok","reviewDescription":"They work but the small end is loose","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Overall Okay For Price!","reviewDescription":"We use these in vehicles to power Samsung tablets with an integrated charger. They work okay. We order 15-20 at a time, out of that maybe 2-3 will be lackluster on power supplied (Get the obnoxious Samsung \"Connect Tablet to Original Charge and Cable to Charge Faster\" message). They will discharge overtime if that occurs. But, for the price, they are okay enough to lose 2-3 at a time. The cables are nice and sturdy, but the ends leave a lot to be desired. Where the USB-C end comes out of the plastic sheath, they are a little weak. If someone bumps it with a hand or knee, it bends and is done, no wiggle room so to speak. Where they plug into to the USB-A and the USB-C, they are a nice firm positive fit, which is nice, but they do loosen up over time and need to be replaced because they will fall out.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1656806400000}
{"reviewTitle":"Great Customer Service","reviewDescription":"Charger worked great at first. Then after maybe a month it just randomly stops working and says my phone will take over 20 hours to charge. Customer service however, replaced it fully and they chargers are working great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Shout out for the customer support","reviewDescription":"Below was my original comment, however the seller got in touch with me and sent me a whole new set, even though I did not actually have time to test the durability of these new cables I want to give a shout out for the seller for taking a bad comment into account and providing customer support.Got these a few months ago and first one of them, the one we used most, stopped working. Then this happened again and again and again until all four became garbage. Terrible product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652918400000}
{"reviewTitle":"It fit the need but wasn’t that I expected","reviewDescription":"This is a package of 5 individual cords each with a type C end and USB. I was thinking that this was a single USB with five type C ends. It was needed for charging AA batteries at the same time.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1668297600000}
{"reviewTitle":"Good quality","reviewDescription":"Haven't had any problems","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Sometimes a bit stubborn","reviewDescription":"They like to spool up like a garden hose and pop out of my phone sometimes.  That can suck.  Also I kind of wish I'd gotten different colors.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670112000000}
{"reviewTitle":"got beat for 1","reviewDescription":"ad says 5...i only got 4?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Received one wrong charger (USB A to MicroUSB)","reviewDescription":"Haven't used them yet but one of the chargers I received was the wrong type. The others are fine so I'm keeping them simply for the price point but they may have been sorted wrong somewhere down the line.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668643200000}
{"reviewTitle":"Sturdy","reviewDescription":"I would recommend it product is strong and sturdy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"great","reviewDescription":"they ae not cheap kids still have them in good standing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Worth every penny I paid","reviewDescription":"Cord length is perfect for the purpose I use for.  It looks sturdy but can't rate durability at this time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Not what I want","reviewDescription":"Charging speed is slow not what I was expecting","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Functional cable, doesn't stay connected","reviewDescription":"Ordered these because I needed some longer USB-C cables and I liked the color. I do like the braded material, they're definitely a little more durable than some I've ownes... or so I thought. About a month in, the cable was falling out of my devices (phone, deck, controller) and wasn't charging. Tried several different devices and cable combinations and ruled it was the cable. There is some mild wear on the connection so maybe I got a lackluster batch. Who knows.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"Not working well . Overall not meeting quality expected","reviewDescription":"Not working well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Thick base","reviewDescription":"They have a thick base and don’t work on my devices. My husband has one device it works on so we kept.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"They're not as fast as I had expected, but work fine for the price.","reviewDescription":"I believe I had purchased these when I saw super fast, because super fast typically means a full charge in an hour and a half or less, with the right plug. But, using an 18 watt plug still takes over two hours to charge my Galaxy S23 ultra. Still, they do the job and haven't had any durability issues yet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"Just ok.","reviewDescription":"One cable went out within the first week of use and they say fast charging but will only give me about 10% charge in 30 minutes. Idk why these have such great reviews. Not that great.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684454400000}
{"reviewTitle":"Not very happy","reviewDescription":"I got these cords because I have a habit of bending them at the head and they snap exposing the wires with in.  Lasted me about six\/eight weeks.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Cheap","reviewDescription":"They don't charge fast. Cheaply made","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Not your usual charger..","reviewDescription":"I still use these chargers so I would say they are durable but maybe a little too durable. The cord does not bend. Bought these 4 months ago and they still retained the shape they were folded in when they were packaged. The device you’re charging will literally stand up because the charger is thick and hard to bend. No problem, just a little odd.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Lasts about 2 years of regular use","reviewDescription":"Works ok but after a year or two the connector to phone gets finicky and it will only charge if plugged it just right.  Slight movement can make the charging stop","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686787200000}
{"reviewTitle":"3 out of 5 Don’t Work","reviewDescription":"Update:  Raised my rating to 4 stars due to high level of customer service.  The company reached out and offered to refund or replace my chargers.  I very much appreciate their quick response and customer service.Straight out of the package 3 out of 5 don’t work for my iPhone 15. The connection feels a little loose as well.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"It's says 2pk ,but quantity says you get 5..not right","reviewDescription":"This is very confusing,  it says pack of 2 in the description,  but the quantity is 5, I thought I was getting 5 packs of 2 cables making this a awesome deal.. was suspicious at first but the reviews said they indeed got 5 so I went ahead and bought it.  Cables seem nice and pretty long.. and 2 16' for 12$ isn't bad . They just need to clarify it more.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Couple have stopped working","reviewDescription":"Couple have stopped working so i wish they were a little better. Besides that, works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"GOOD BUT NOT DURABLE","reviewDescription":"VERY EASY TO BEND, THE WIRES STARTED TO POP OUT OF THE CORD BUT POWER IS AMAZING","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"One of them stop working","reviewDescription":"Ome of the cables is making my phone charge for 7 hours.im using the fast charger that goes into the outlet","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Pretty good","reviewDescription":"Good for the price, reasonable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Good for price","reviewDescription":"I like that it came with so many","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Works as intended but not sturdy","reviewDescription":"Works good to charge but not as sturdy.  A few stop charging after a while wire inside broke near charging piece","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"works great","reviewDescription":"been using these since I got my iPhone 15 but didn’t want to buy new plug adapters and the car doesn’t have a USB-CThey have been working great so far no complaints","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"How many Watts?","reviewDescription":"How many watts does this handle? My previous chord of a different brand charges my phone about 30 mins faster than this one. However I got this for the extended length which comes in handy for laying in the bed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"They do the job, but...","reviewDescription":"I've never had any other charging cables that twist up the way these ones do.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"It works but","reviewDescription":"It doesn't seem to fully connect and make a firm grib on my phoneIt charges yes but it's flimsy so unless your not going to be on your phone as it charges its works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686009600000}
{"reviewTitle":"Don’t last long","reviewDescription":"I’ve only had these for 2 months if that and all of them are already broken or not working. My mistake for assuming I was getting a good deal! Won’t be buying these ever again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686009600000}
{"reviewTitle":"works sometimes.","reviewDescription":"idk why but sometimes it's plugged in but doesn't charge. other cables work but these are intermittant.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Not for fast charge","reviewDescription":"The look resistant but not able to fast charging","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Stopped working.","reviewDescription":"The description makes it seem durable but, is not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"They don't work very well","reviewDescription":"These cables look nice, but they don't charge very well. I've had them for about 3 months now and they started out fine, with the exception that on the second day of using it, the cable caused my phone to overheat and shut down to the point it wouldn't turn back on. About 30 minutes later after unplugging it and allowing it to sit, I finally got my phone to power back on. The phone had 40% battery when it did this, so it's not because the phone died due to lack of power. Now a few months later, they won't effectively charge my phone in the car or even if plugged into the wall. I've even tried it on my laptop. When I plug my phone in, it doesn't even recognize that it's plugged in. The charging light and lightning bolt don't show up at all. It might appear for a second and then it's gone. I've changed out the brick for the wall and the charger in the car and it always seems to be the cable. The same brick or car unit works just fine for my husband's phone cables. Yesterday, while attempting to get some tiny charge in the car, the cable caused my phone to shut down again. Thinking that maybe it was the one cable out of the pack of five, I rotated to a new cable and every single one of them have this issue. Like I said, they look nice, great material and all, but they don't actually charge anything effectively.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1524700800000}
{"reviewTitle":"Charges slowly","reviewDescription":"I have a samsung Galaxy phone and i keep getting popups telling me that the charge will be slow because it was not made my phone.  Ridiculous..  The cord is really long, - i still use it - but it's a slow charge.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"What happened?","reviewDescription":"I purchased these twice before - they were great!  So great, in fact, that they all walked off with various family members.  I ordered them again, at nearly twice the price, and they are awful!  I have tried two of them today and my phone barely recognizes them.  It keeps asking if they are plugged into a power source!!  I have tried multiple sources, same results.  Barely charges, definitely not high speed.  I don't know what has happened, but they went from 5 stars to 1 star in my book.  3 for overall quality based on the older ones only.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667347200000}
{"reviewTitle":"Ok","reviewDescription":"The good. Charge fine. Good material. Are long.The bad. Connecting to my car for Android auto, they lose the connection and bug out. If you want to use these to do anything other than charge, not the best bet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"FAILS on CarPlay in 2021 Toyotas","reviewDescription":"FYI. Bought a 5-pack for family Christmas presents to go along with new iPhone 15s...My only intended use for the cable is in our cars.WHOOPS!Does not work with 2021 Toyota OEM Carplay (Rav4 + Tacoma). Did not expect any kind of problem with older standardized tech like usb-a to usb-c. Not sure who's to blame, but this was a big miss for the Apple\/Toyota CarPlay collaboration. Sounds like its a very widespread problem (not just Toyota), so I assume its Apples mess to clean up. C'mon guys. This should not be hard. It's standard plugs on both ends w\/ no fancy computations like TB.Research suggests Apple Store is now selling a Belkin BOOST usb-a-usb-c cable that is reported to work. I've bought a couple. Now I need to return the multi-pack that failed...Caveat Emptor!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"They look good and feel like good quality but...","reviewDescription":"They don't last. In about 8 months the last cord out of a pack of 5 stopped working. All they do is plug into a magnetic charger. I don't bend them or anything. They short out where you have to wiggle them to make a connection and yes, I've tried them in other ways and they do the same thing no matter what they are plugged into.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Not compatible with iPhone 15 pro","reviewDescription":"I purchased these to keep around the house in different rooms to charge my iPhone 15 pro. Sadly they don’t work with the iPhone 15 pro. Basically I have 5 vape chargers at this point. Purchased so long ago so no sense in trying to get my money back. Just wanted to let others know it won’t work if they have the new iPhone 15.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Don't last long","reviewDescription":"They worked great until they didn't. 3 out of the 5 are already broken.  They do not charge or connect to computer to transfer info.  Shows that it's malfunctioning. So I would refer a different brand unless your in a pinch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Unreliable","reviewDescription":"I've bought these twice now. The cables are a good length and actually fast charge which is great. But they dont last more than a couple weeks. Less if your kids are always stealing them seemingly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Not horrible- Not Good- Definitely Not Great.","reviewDescription":"Every single one broke one stopped functioning within a year or purchasing. There's a reason they sell them in packs because every single one of them breaks down every single one of them chips every single one of them stops charging correctly every single one of them has the same problem","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"would not power my new iPhone","reviewDescription":"the wires are as described and power some c products perfectly well,  but the whole point of my purchase was to charge my brand new C adaptor iphone and it unfortunately, totally fails, no green charge symbol at all, as if it is too short to connect or totally incompatible.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"May damage other USB ports","reviewDescription":"I found I need to use more force to push the USB-C plug into my iPhone charging port or to pull it out. When I did that, I could hear a light click. The Apple cable that comes with the phone is smooth to plug in and pull out. I understand you can't compare these cables to Apple's quality. But I had to return them because I'm concerned they may cause damage to the female USB-C sockets of my many devices on repeated use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Prepare to replace after a year of normal use","reviewDescription":"Durability is poor.  After a year both cables no longer charge my devices.  At first i thought it might be an issue with my charging port or power adapter, but I tested these and they were all good.  I switched to a different charging cable and was able to charge my devices again.It did work great for a year, but I expected a longer lifespan.  I just leave one in the car and one in the house they weren't left outside or bent\/chewed on","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700524800000}
{"reviewTitle":"Don't last very long","reviewDescription":"After just a few months , the cords start not connecting well or not working at all.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Not for IPhone 15","reviewDescription":"I tried all 5 of the cables on my iPhone 15 and it would not charge it on multiple plug in transformers or in my cars.  May work for other devices just not the iPhone","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Breaks over time","reviewDescription":"I can see why these are on sale. There are better ones on the market","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"These cables are AWFUL! You have ONE job.","reviewDescription":"I purchased a pack of these but have been meaning to leave a review for a long time now. Right off the bat, these cables would only intermittently stay connected. Everytime I would plug a cable in to either charge or for software-related purposes, it was a coin toss between registering the connection, slow-charging or functioning properly. Incredibly frustrating when you plug your phone in to charge at night and wake up to find out it hasn't charged at all! In addition to that, trying to move files to a computer is a nightmare as the connection keeps cutting in and out closing out the files im trying to use. Again, its been a while since I purchased these but i remember the company sent me a new pack and i dealt with the same thing with the new batch. Before you say \"well it could be the charger or the usb ports you're using - that's not the case. I've swapped out countless chargers, tried connecting to car usb, pc usb, macbook usb, and others all with the same result. Ended up throwing most of these in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1657929600000}
{"reviewTitle":"Charging cables TYPE C","reviewDescription":"These cords are terrible. They just stopped working and I would like a refund, but the policy you have doesn't honor that. They came in a 5 pack so I went to use a brand new one and IT didn't work in ANY of my type C electronics... including my girlfriend's phone and my children's tablets. I'm extremely disappointed knowing neither Amazon nor this product will send a replacement or issue me credit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Do not work","reviewDescription":"Missed my return window none of them work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Junk","reviewDescription":"One by one each of these has quit working in my phone where as the oem 3 year old cord that came with the power works fine. Don't waste your money like I did","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"DON'T CHARGE!! :(","reviewDescription":"I bought these cables for my family to use in their cars after purchasing the new iPhone 15. NOT ONE OF THE CABLES CHARGES. so disappointing, do not spend your money on these.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Do not last","reviewDescription":"Worste purchase ever. They dont last more than 2 months. After that you have to qiggle it and then eventually it dies. I purchased in August and am on my final one. Horrible!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Did not work","reviewDescription":"Simply did not work. Immediate return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Complete garbage","reviewDescription":"None of the cables are working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Charge","reviewDescription":"So far so good, things are charging","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Excellent High Powered Charging Cable - NOT STANDARD Charging Capable","reviewDescription":"This cable is excellent as long as you are using a higher voltage \/ high speed charging base.  If you are using a standard usb charging base such as the ones you would find in a WalMart, Home Depot, common stationary store, or if you attempt to use the usb that's built into a standard wall outlet or splitter, you will be  sadly disappointed.  For the most versatile cable, do not buy a 'High Speed' cable.  Purchase a well made 'Standard Cable'.  This way you will be able to use it in public locations such as the airport\/planes, or the coffee shop.  This cable has a specific requirement that may not always be available to you if you leave your 'High Speed Base' at home or work by accident.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1609891200000}
{"reviewTitle":"Good overall","reviewDescription":"They were supposed to be fast charging but don't charge as fast as the manufacturer's cable. The length is good and the insulation is durable. Overall I like the product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668124800000}
{"reviewTitle":"Great items","reviewDescription":"Great items","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"They work very well","reviewDescription":"The cord length is great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"Great value, I did not rate durability yet because we have not used but for 1 day.","reviewDescription":"Love the length and charging power but durability has not be tested yet as we have only had them one day.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674172800000}
{"reviewTitle":"5 pack usb-c","reviewDescription":"Eating to see if they last","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"Heads up","reviewDescription":"4 out of five were good","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"You get what you pay for","reviewDescription":"🤩 ✨️ 😎 ♥️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674864000000}
{"reviewTitle":"If you have the Pixel 6, you will need to remove your case to charge","reviewDescription":"I enjoy them for my Pixel 7 pro, my husband has to take his very basic case off to get his phone to charge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667520000000}
{"reviewTitle":"So perfect, I've ordered multiple times","reviewDescription":"I've ordered this Type C-to-A cable four times so far from this buyer. My family uses these cords in various locations throughout the house and in our cars. Both my husband and I also keep them stowed in our travel bags, backpacks, and laptop bags so we're never without one while traveling.  It's the perfect length for most uses, and I prefer the protective braided cover (like when the cord is accidentally sucked up into the vacuum cleaner!). Happy to recommend this item.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Five Stars of Excellence: Unrivaled Speed, Durability, and Elegance in Every Charge!","reviewDescription":"⭐⭐⭐⭐⭐*An Electrifying Experience: Elevate Your Charging Game!*In the grand tapestry of charging accessories, these cables shine as a five-star masterpiece. Brace yourself for a charging experience like no other—swift, reliable, and remarkably stylish.**1. Lightning-Fast Charging: ⚡**These cables redefine speed. Your devices will power up at an impressive pace, leaving standard chargers in the dust. Time is of the essence, and these cables understand that perfectly.**2. Unmatched Durability: 🛡️**Say farewell to the frustration of frayed and fragile cables. The nylon braided armor on these cables not only exudes elegance but also ensures unwavering strength. They're built to endure the rigors of daily use, standing tall against the test of time.**3. Tech Elegance Redefined: 💫**Charging becomes an aesthetic experience with these cables. The sleek design, combined with the sturdy build, adds a touch of sophistication to your tech setup. It's not just about utility; it's about making a statement.*Why Five Stars?*In the realm of charging, these cables are a rare gem. They're not just accessories; they're essential companions that make every charge a delight. Whether you're a tech enthusiast or simply someone who values efficiency, these cables earn their five stars with grace.Invest in excellence, embrace unrivaled speed and durability, and elevate your charging game. These cables are not just a purchase; they're a commitment to a superior charging experience. Five stars well-deserved, and a recommendation without hesitation.⚡🌟","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Great product for the price","reviewDescription":"*EDIT* While everything I said in my review is true, I made it with the promise of receiving a small gift from from the seller. They have not followed through with that. If you buy these cords and receive a post card in the mail promising something for your positive review, don't believe it.These cords are exactly what I needed for all the devices my family uses. They're a great length and nice and sturdy so I don't have to worry about my kids bending or pulling on them too much.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Quick,  thick,  great price","reviewDescription":"I bought these because all my other chargers doinked out on me. Chargers can be wicked expensive. I seen this deal and thought what the heck. Welp I've thrown away every charger in my house and replaced it with these. They're thick. They're quick. They have great length and they seem to be able to hold up to time.5 stars and will order more for the office and car \/ back ups for trips, etc.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"My favorite charging cords!","reviewDescription":"I need to buy in bulk because of the different rooms and devices we have that need charging. I don't like the cords that have a L shape at the end, they break easy. These ones hold up like they should!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great cable for the price","reviewDescription":"Honestly when I first bought the cords I thought they were going to be flimsy but it’s really well made. I give it a 10\/10, defygoing to buy more in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Durable and good length","reviewDescription":"Great product. My outlet is a bit far from my couch so the living room charger always gets snagged. This new cable is durable and longer than the Samsung cable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Durable and Heavy Duty","reviewDescription":"I have been buying charging cords for a while, but the connector has always fallen apart. I found these cords and noticed the the connector was designed much stronger, so decided to give them a try. I'm glad I did. These cords are definitely high quality, strong, long lasting, and I'm not worried that my connector will tear, or fall apart. Will definitely be buying more of these, if needed, in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Perfect","reviewDescription":"I need these cords all over my home for my phones and tablet. I work often from home and need constant power to my tablet.3ft cords for me asre useless, and that was what mine came with.These cords are the perfect length and give me a steady power stream when in use!I plan to purchase more, to have back ups if I need them!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great Replacement\/Additional charging\/data cables","reviewDescription":"I needed more data\/charging cables for the family.  This 5 pack was exactly what I needed.  No issues with charging or data speed.  I recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Did not work","reviewDescription":"Not a single one in the pack of 5 worked. Plugged them all in to multiple devices and multiple outlets.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"DO NOT work with iPhone 15","reviewDescription":"Ordered all new iPhone 15's for the family (Pro, Pro Max, and standard). Every cord was tested with every phone and DID NOT charge at all. Back to back tested with both fancy Apple cords (worked perfectly) and 3 other random USB-A to C cords ... all worked famously. Don't waste your money on these.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Does not charge","reviewDescription":"I am very disappointed, all of my devices will not charge as they normally would. Example: my iPhone 15, battery percentage at 16% for over 1 hour being on the charger","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"They are very bad quality.","reviewDescription":"Not even one of these cables remain. They all stopped working.I have had cables from other brands and they all lasted longer than this.Charging speed is also slow.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Great","reviewDescription":"Great product They work well","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"didn't connect with my iPhone 15","reviewDescription":"I had to return the cables since they didn't work with my iPhone 15 (tested all 5 cables)","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Not 3 feet!","reviewDescription":"I recieved the chargers but they are NOT 3 feet long. They are short, regular length chargers. I got these bc I NEEDED the length that is SAYS they should be!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Don't fit correctly or charge.","reviewDescription":"These chargers will charge my phone but you have to have it in a certain way. If it doesn't charge, I have to turn the charger over and then it works. I tried them in my sons Oculus and it doesn't go all the way in and they use the same chargers.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Don’t work","reviewDescription":"I bought these as backup cords and all of them never worked at all. Save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"DOESN'T WORK WITH NEW IPHONE","reviewDescription":"DOESN'T WORK WITH NEW IPHONE. Will not charge or transfer any data from brand new iphone","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"They don't last long.","reviewDescription":"Out of the 5 I ordered a few months ago only 2 still work.  I wasn't hard on them at all. Simply wiggling the usb cable when connected to a device will cause the connection to die.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Does not charge my iPhone 15","reviewDescription":"Works fine for my pixel 6 but absolutely does not charge my iPhone 15 which is super annoying.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Super slow connection","reviewDescription":"I've had great 10' cords in the past.  These are not it.  They will connect and charge, but it's like the wires are bad because it will take twice as long as other cords.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Fake charging cord","reviewDescription":"Only two out of the 5packs work for more than 2weeks while the others  discharge my battery.It is better to make one or two that work perfectly for the price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"Does not charge iPhone 15 pro","reviewDescription":"These cables are sturdy and look well designed. They do charge another USB C device, but they will not charge my new iPhone despite where I plug it in. I have another USB A to USB C cable that does charge it, but none of these do.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Seems like it's loose?","reviewDescription":"Got this Item, Seems like all of the cords are loose, Have to adjust them around just to get them to work. Tried new and old Usb-c Cords in different device and all of these cords have trouble connecting it seems, where as others don't.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Didn’t work with IPhone 15","reviewDescription":"We bought this brand of cables in both the 6ft and 10ft lengths. The 10ft lengths work well but these, the 6 ft cables, do not. The cable is loose in the charging port of my iPhone. It Dallas out with the slightest movement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Very slow charging but it works","reviewDescription":"I was very excited given the great price for a 5 pack and the cords are very long. However the charger is pretty slow. Definitely not one you can use while watching videos or playing games on your phone but great for a charger u would leave your phone on at night. I was thinking of returning them but I might just use them for that however I am quite disappointed. As for numbers this charger charges at speeds of 900Ma while a fast charger is over 3000Ma.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Won’t charge iPhone 15","reviewDescription":"It didn’t charge my iPhone 15 pro. It would charge other things, but for some reason it wouldn’t work on our phones.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Charges slowly","reviewDescription":"Due to the length, the charger works slowly.  It will preserve a charge, but not charge quickly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Long cord but takes long time to charge","reviewDescription":"It takes a long time for my phone to charge  using this charger","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Updated review - Does not work on iPhone 15 but customer service is great gave full refund!","reviewDescription":"Will not charge an iPhone 15 but customer service offered full refund without asking.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701475200000}
{"reviewTitle":"Not really good","reviewDescription":"Only works half the time","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Doesn't last.","reviewDescription":"I've bought two bundles of these over the course of a few years and they seem to have a lifespan. The C end wears out because I'll get erratic charging messages on my phone so I'll switch cables and it'll be fine. I like the sturdy braided cable but wish the connectors could last a little longer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Ok for short period of time","reviewDescription":"They charge but not fast & the cords burn out after a few months of use and stop working. They're good for an emergency backup but not everyday use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Slow charging","reviewDescription":"It doesn't charge very fast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Half of them don't work properly","reviewDescription":"I bought these previously and had no issue. This newest pack has given us problems with 3 of the cords causing a \"slow charging\" error on any device we use them on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"They work","reviewDescription":"They work just fine, they do feel a bit cheaper than some alternative options though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"Stops working after a while","reviewDescription":"Several cords developed issues where the phone thought it was wet.  Had to discard.  Nice length, though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"One out of 5 didn’t work","reviewDescription":"One didn’t work out.  Wouldn’t charge.  Other seem to be fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Is not a fast charger","reviewDescription":"It doesn't charge fast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687478400000}
{"reviewTitle":"Length","reviewDescription":"I like the length of the cords.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686528000000}
{"reviewTitle":"Unhappy","reviewDescription":"3 out of 5 don't work, and some will work half the time the quit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684195200000}
{"reviewTitle":"They are okay!","reviewDescription":"They are okay. It seems like there are hardly any cables out there that last. These are as good as most of them, but they do wear out after a while.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Low Quality Charger Head","reviewDescription":"Not too much to say about it; its 6ft long and works, just unfortuante about the Usbc end having loosely attached casings. So the usbc end can bend easily if you don't pay attention to the little casing sliding off.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672876800000}
{"reviewTitle":"Great durability and length, but incredibly low charging speeds.","reviewDescription":"I have absolutely no idea why this charges so slowly, but it does work out for me as now I just leave my phone to charge overnight. This would be great for you if you want something like this, but if you want to charge your phone faster, then you should buy a different one but if you wanna leave your phone overnight, its a good deal!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668038400000}
{"reviewTitle":"Not durable. Outside looks strong but inside isn't very durable. Goes bad in a few months","reviewDescription":"Not durable. Outside looks strong but inside isn't very durable. Goes bad in a few months. Added another star. Seller did offer full refund.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"I like them but I'm skeptical of the quality","reviewDescription":"Overall, they've held up well after several months of use. I'm still using a couple of them. However, I've had one cord start smoking in my vehicle. It's possible that it had moisture from the floor get into the  USB C port, but I can't say for certain. I've also had 2 phones suffer charging port failures or related issue since using these. Was it because of these cords? I can't say for certain. I can tell you that I'll be sticking with the highest quality chords I can find from now on, just to be safe.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651708800000}
{"reviewTitle":"Check first only 4 work broke out the box","reviewDescription":"Only 4 worked started to fray","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682899200000}
{"reviewTitle":"Shorter than advertised, weirdly...","reviewDescription":"Of all the things about a charging cord that could be wrong, I never though it would be...  These \"6' long\" cords, aren't!  They're over 5', so it's not a huge difference, but, hey - size does matter!  :)Haven't had any issues with other aspects of the cords - plugs fit fine, durability seems okay after a couple of months of use, etc.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1667088000000}
{"reviewTitle":"They are ok for the price","reviewDescription":"They don’t last very long with two kids that use them for charging tablets. Not sure if it’s the cords or the kids. I have purchased twice in 3 months and all but one are broken. I haven’t had much luck with any brand lasting more than 2 weeks so I will give them 3 stars for being average","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"2 cables don’t work","reviewDescription":"Two of the five cables do not work. Edit- ordered a replacement and all of the new cables work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"They don't seem to charge very fast","reviewDescription":"The price was good but I didn't pay attention to how fast they are supposed to charge. Surely others have mentioned this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Okay","reviewDescription":"Didn't last that long, just stop charging after about 2 months. Would not recommend if your looking for cable longevity. Also Didn't fast charge like they state they do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Not working so great with my charging tower","reviewDescription":"Sometimes they work and sometimes they don't","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"claims fast charing but does not","reviewDescription":"cord length is nice, but connection and charging rate are are not up to par.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Eh","reviewDescription":"Eh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"They work","reviewDescription":"They work but on my Samsung S22 ultra if I don't have it plugged in on the \"right side\" it says it will take 4 hours to charge......","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Charging effectiveness","reviewDescription":"They came on time. I like how long they are, and the quality in the material used. However. They take a very long time to. Charge my phone. I mean very long and the delivery person never knocked on my door, and just left me package there. I honestly would have preferred to pay this price for one cord if that meant a more reliable charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"C type Charging cables","reviewDescription":"Charging cables are a great length and charge good but 3 out of 5 cables work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"They aren’t worth it","reviewDescription":"Great price don’t get me wrong but they lasted as long as it took to ship and I had to throw them all away because they quickly gave out . I loved that they were very long but besides that it wasn’t worth it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Works BUT","reviewDescription":"Works but really slow charging. If my phone is on 20% battery it will say 3 hrs to full charge. I only use this on stuff that i dont need charged fast","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Not fast charging","reviewDescription":"Ordered these for work, home and car. I first notices at work that it wasn't fast charging, I thought it was just from the dust at work so I paid a closet attention at home and that's when I noticed that it wasn't just a regular charger but it keeps disconnecting from my phone while charging. Naturally I grab my husband's phone at home, same thing. Next day at work I asked a coworker to borrow their phone and try it. For some reason if you charger wireless or direct it keeps pausing the charging process and the faster charging doesn't work. I also have tried with and without fast charger charging wall blocks to plug into.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668816000000}
{"reviewTitle":"USB C plug doesn't fit into phones well","reviewDescription":"I was very happy with the shipment, the lengths, durability, etc.  However, they have never plugged well into the USB C port on our phones (two different Galaxy 10 phones).  Every one of these cables has to be pushed in as far as they can go, and can't be off center in anyway or I get an error on the phone that the cord is not connected properly.  All other brand cables I've gotten (including the ones that come with the G10 phones) work every time with no issue whatsoever.  There is never any concern with them on whether they are connected properly.  With these, it looks like I'll have to revert to wireless charging until I find another brand that has the six foot cables.  It may work fine with other brand phones (maybe even different Galaxy phones--we have a G10 and a G10e) so can only speak to these.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1637280000000}
{"reviewTitle":"Good for a month then stop working consistently","reviewDescription":"It's pretty long, looks durable too but after using it for a month I have to angle it to get it to work. This has never happened with my other adapter cables and I don't pull the wire on it to take it out so I know it's not me. Quite frankly it just kind of sucks. There's no visible damage either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678665600000}
{"reviewTitle":"Poor product","reviewDescription":"I almost never had a USB cable fail on me before. One of the cables failed with very light use in a home office setting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Unfortunate durability or quality control","reviewDescription":"I am an engineer who uses these cables to flash code I've written on to different devices.of the 5 that I received, 2 of them have stopped functioning as proper data cables.  They still offer power to devices but the communications are broken.This is annoying because I don't put these through any day to day strain - they just stay at my workstation plugged in to my computer...  It would be more understandable if I was packing them into a backpack or something every day.While they work, they do work however.  For a charging cable I like the length, look, texture of the product enough. Just wish they worked for communications\/signals a little more reliably.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1653091200000}
{"reviewTitle":"Disappointed","reviewDescription":"I bought these for my husband and they stopped working a month or so after I bought them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"Does Not Change Fast","reviewDescription":"My phone does not take 4 hours to change.Every other charging cable I have used takes 2 hours at max.My phone tells me how long it takes to charge, and when I check a few minutes later, the time increased. I put in my other cords and it does better than this.To be returned","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"Short life span","reviewDescription":"I buy these extra long cords for my daughter. All 4 of them have stopped working after less than a month of use.I definitely do not recommend these.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"Junk Product","reviewDescription":"I ordered the 5 pack and right out the gate 3 didn't work, the 2 that did I put in my car, they worked for a few weeks and now don't work. This product is complete junk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Broke within a few months :(","reviewDescription":"Two cables, both stopped charging within a few months of being used with a PS5 dual sense controller. Cheap low quality. Stay away.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"The value of a 5 pack for so cheap will be exactly what you receive. CHEAPI returned after trying 2 cords.The are flimsyThey are don’t charge enough to keep up with normal use drain.They definitely are not fastThe ends you can feel bend.I should have seen recent reviews of them potentially changing materials.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Garbage…. 3 of 6 broken within a week","reviewDescription":"I purchased 2 x 6 packs of these. I’ve only opened the first one and of the 6, 3 have broken. The metal piece that goes into your phone comes out of the plastic housing. When the first one broke, I thought it was just a fluke and I tossed it and got a new one so now I don’t even think I can return them because I don’t have all six. Since then two others have broken. I’ve literally been using these for eight days - in the eight days three of six have broken. Don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"These don’t work! - You had one job!","reviewDescription":"I tested these cords on multiple chargers and none of them work for my iPhone 15. Other USBC cables that I have.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Not fast charging at all","reviewDescription":"I plugged, my phone has been charging for hours and still only at 50%. It is slow charging, not fast at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Extremely slow charge charging","reviewDescription":"I needed longer Cords for charging my phone and tablet. It was decent for about 20 to 30 days and now it switches itself in and out of fast charging. I provided on picture of the slow charge and another from my charger that came with my phone. It is so extremely slow charge now that it doesn't keep up when I am using it or takes all night to charge.Also, I got the double pack and both do the same thing to mine and my Fiancé phone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Slowest charging cables ever","reviewDescription":"It is partly my fault for choosing the ones that are cheaper but man,  these cables are slow. I use them on a Samsung galaxy and while every other cable charges from 10-100% in about an hour,  this one takes 5+ hours.  I don't really know what makes these cables fast but this one doesn't have it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"USB Type-C to A Cable 5pack 6ft Braided Fast Charging 3A Quick Charger Cord, 6","reviewDescription":"3 of 5 cord either did nolt work or had to held in surtian way to work will never buy agian.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"They die fast.","reviewDescription":"I've only had then for 3 months and I'm already on my 5th one. They keep dying on my while I don't even do anything. Never had this issue until I got these.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Only 2 out of the pack worked with my iPhone 15.","reviewDescription":"The value for the money would've been excellent if all of the cords worked. ;_(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Glitchy with one of my tablets","reviewDescription":"These have been great, except... upon arrival, one of them would not charge one of my tablets. Gave a warning about moisture. I followed the instructions but it didn't matter, it always gave the same warning with this tablet. It charged the other tablet fine, so I let it go and used the others to charge that particular tablet. Months later, 3 of these cords are saying the same warning with this tablet, but the tablet charges fine on other cords. It's weird for sure, but only happens with these cords. So as long as it's not giving you a warning about moisture on some of your devices, they seem to work. However, it's rather annoying that I can't charge this tablet on these cords now. That was kind of the point in purchasing them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667952000000}
{"reviewTitle":"Extremely Disappointed. What a let down!!","reviewDescription":"I was very much looking forward to a new set of charger cords for my phone. I've been surviving on old cords that aren't connecting as well anymore and won't stay connected. I got this new set hoping to replace all my old cords. Out of the FIVE (5) cords that came in this pack, only TWO (2) actually worked. Those two showed \"Fast Charging\" on my phone. The other THREE (3) show \"Check Your Charger Connection\" on my phone. I was prepared for maybe one of them being a dud, but over HALF?? Very disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679356800000}
{"reviewTitle":"Did not work well for Android Auto","reviewDescription":"Purchased these with intent to use them for Android Auto. They would work, but would spontaneously become disconnected on occasion, which was distracting and annoying.Otherwise, reasonable quality for charging and non-data tasks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Good when they work","reviewDescription":"Bought this five-pack of 6ft charging cables in March 2023. It's now May 2023 and only two of the cables still work. The rest generate a message popup on my phone as soon as I plug them in, saying I should \"check\" or \"replace\" the cable and indicating a full charge will take 7+ hours. The other two cables are fine, but most of these were\/are pure duds. So you're taking risk buy buying these.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1684540800000}
{"reviewTitle":"Not Compatible with iPhone 15","reviewDescription":"This chargers are nice but all 5 do not stay put in the iPhone 15. With any movement, the charger comes out and disconnects.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Not fast charging","reviewDescription":"Cord seems to be good quality. Connection from plug in to port is solid but these do not fast charge. Only display fast charge for brief period then revert to regular charging speeds","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"NOT DURABLE","reviewDescription":"I've had this happen with my entire order where after a few months the connections on the inside of the cord work intermittently and then cease to function. Definitely wouldn't buy again - a good deal but be prepared to throw them away in a month or two after using regularly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Charges well, but gets loose and disconnects Android Auto often.","reviewDescription":"I've used these cables in numerous different vehicles (personal and rental) and with different phones. I have constant problems with Android Auto disconnecting with the slightest bump of the phone. Charging does well, but I don't recommend for USB connectivity.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Takes too long","reviewDescription":"Going to buy different ones because it wont get to 100% after about 7 to 8 hours.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Long, fast, and durable!","reviewDescription":"I love these chargers got 6 of the for good prices.They long fast and durableWould definitely recommend anyone to try them!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great chargers","reviewDescription":"These chargers are great for in the house use and in the car. The 5 pack is the most practical for our family.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great price, works on my new iPhone model and Kindle","reviewDescription":"They should sell these by the dozen!  Upgraded 2 iPhones only to find out that they no longer use the lightning cables, but they now use USB C.  The phone included a cable, but it was very short.  Purchased this item to have a few extra cables around in case we lose or damage any.  Plus we need them for upstairs, downstairs, the recliner, the car, etc etc.  I only purchased one pack to make sure the charge speed and quality was good -- I will be purchasing 2 more packs to replace all of the lightning cables we had that are now obsolete.  Great product at a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Great for price point","reviewDescription":"Great product for the price. Kids are hard on chargers and I continue to buy these when they need the for their tablets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great value and work great","reviewDescription":"I have bought these a few times keep them in the house,cars,ect they work great and for the cash its hard to beat","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Sturdy cables","reviewDescription":"This product seems to be built out of very sturdy material. They have held up fine with no issues under adult use in my bedroom for charging my phone at night.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great quality cables. Fast charging and enough to share.","reviewDescription":"This review is for the 5 pack of 6 foot braided cables. I received these quickly, exactly as described. I love the feel of these braided cables, and they are sturdy but flexible. Great price and enough cables to share with my family!My old cable didn't fast charge anymore, I'm happy fast charging my phone again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Very good cord","reviewDescription":"I got a pack of the cords from here, and it was great. They're the longest cords that I've ever had, which has proven quite handy when I need to plug it in an outlet that's farther in reach.It's also very good quality too, which is something that I'm happy about.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Durabilidad","reviewDescription":"Son muy buenos …los más durables no me puedo quejar con respecto al precio ya q están baratos para lo q duran","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Durable & fast charge","reviewDescription":"I love this pack of chargers. They’re nice and long so I can plug them in and dont have to worry about not being able to reach my phone. They are super durable cords and don’t wear down after a few uses. The best part is they charge my phone very quickly so I don’t have to wait too long. Highly recommend, I have one in each room, my car, and work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Charging cords","reviewDescription":"The cords were competitively priced & shipped quickly. The cords were heavy & will hold up better than others I have bought.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"High quality product","reviewDescription":"Item is as described, High quality and fast charging cable. I recommend it to all who need quality products that charge fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Nice and long","reviewDescription":"Have bought these twice because of chewy puppy phase, and have worked perfectly and are just the right length to have anywhere.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Highly recommended More durable than the original charger","reviewDescription":"Highly recommend! I got a set of 5 and had to order 5 more! They are more durable than the original chargers that came with my kids tablets and phones.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Perfect","reviewDescription":"We've bought these several times to have scattered through the house and cars. Price point is perfect and there are no issues!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Sturdy cables that work really well.","reviewDescription":"The cables will definitely stand up well.  They charge quickly.  Will definitely use again if I ever need another cable!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Perfect length and durable","reviewDescription":"Cables were just what I needed! They were a good length and came with 5 of them for such a good price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"A very good cable for iPhone 15 series Phones","reviewDescription":"I recently purchased a iPhone 15 Pro Max and iPhone 15 Plus.  I am looking for USB A to USB C cable to charge my phones in the cars, which have USB A ports, and the old USB A adapters that I have.  These cables are perfect and of high quality.  I could charge my phones without any difficulty.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great accessory cord for many electronic devices","reviewDescription":"I like the price & quality of these cords.  When my grand children visit, they always want to take one home!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"3 foot USB Type C Cable 5 -Pack","reviewDescription":"I use this to power up my Samsung tablet.  Cords have a habit of shorting at their plugs, mostly through excessive bending.  Being able to buy a pack of five for the economical price that one is offered for one or two is a bargain.  The plug fits my USB \"C\" receptacle and charges quickly.  A great bargain.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"didn't fully charge?","reviewDescription":"I gave this 3 stars because they seem durable and the price was a bargain, but it did not seem to work right for my purpose.  I used one to charge husband's hearing aids that I needed a cable longer than the standard one that came with the unit.  It uses the \"c to a\" cable so thought this would work for that purpose.  It did charge the hearing aids, light turned green indicating charge was complete, but the hearing aids died in the middle of the afternoon.  Typically they work the whole day without going dead, so for some reason these are not compatible to his charging unit.  Will probably return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653350400000}
{"reviewTitle":"Seem well made, but time will tell","reviewDescription":"Just a bit stiff in use, not like you would expect braided cable to be..  note they don't work well on ALL our USB C devices.  the phones with a curve where the C port is does not allow the cable end to plug in fully it seems and if you bump the cable or phone while it's charging you can stop the charging action and not know it.  Seems like the metal end could be a touch longer or the plastic end be a bit shorter to work better.  Such a high rating by so many reviews has me wondering about build changes over the years.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655856000000}
{"reviewTitle":"Does not support 15 or 25w fast charging","reviewDescription":"Works with low wattage chargers doesn't work with 15 or 25 watt chargers","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"Updated - Sturdy but not fast charging","reviewDescription":"Updated 10\/11\/18:Seller contacted me and sent out a new set of cables. They were just as sturdy and stiff at the first bag. I'm sure the things would take quite the beating because they really are quite tough.I've still had mixed results with them. Sometimes they fast charge, but it won't come up on the phone as \"fast charging\", but I can swap to an older type C cable and the charge time jumps up by 45 minutes or so, but I can plug one of these back in and the time drops by quite a bit, but still not \"fast charging\".I've updated my review to 3\/5 \"it's okay\" because they really are VERY sturdy, and they do seem to charge well, but the fact they don't register as \"fast charging\" leaves me a bit put off. The customer service has been very good, and I would buy from the sellers again (just not this item).The cables are very sturdy, almost too stiff. The reason why I am giving it a bad rating is because they are NOT fast charging, or at least the ones I got weren't. Maybe 1 out of 5 will actually fast charge, and sometimes it does, sometimes it doesn't. I can user any of my other cables and it's fine, but these do not fast charge for me.","isVerified":true,"ratingScore":3,"reviewReaction":"20 people found this helpful","country":"United States","date":1538006400000}
{"reviewTitle":"Don't last","reviewDescription":"They work really well for the first few weeks, but slowly they conduct less electricity or they just completely break. They can't withdraw the force of an unsupervised cat either","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Not too bad, get what you pay for!","reviewDescription":"Really like them durable but lasts a few months each but definitely worth what you pay!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683244800000}
{"reviewTitle":"Not a fast charger","reviewDescription":"It charges slower than my shorter cords. It is cheaper than others. Good use if you are charging over night.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"Not Fast","reviewDescription":"I was replacing my short fast cord for a longer fast cord but my short card is 75% faster than the long cord.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Wrong size","reviewDescription":"Someone needs to make a cable that is .5 meter or 18\".","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"My cables last around 30 days each before failing.","reviewDescription":"First cable started failing right at 30 days but did not realize the window for returns was already closing. Vendor was willing to provide a full refund after hearing that cables failed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679443200000}
{"reviewTitle":"Durable cords","reviewDescription":"These are durable and good for the price. I like the length so I can read on my phone in bed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Excellent product and price!","reviewDescription":"Great product and price!  Nice to use A to C enabling me to use all my old bricks!  Thanks!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"A Tangle-Free Charging Marvel","reviewDescription":"this USB Type-C to A Cable 5-Pack stands out as a reliable and practical charging solution. The combination of charging capabilities, generous length, braided durability, and universal compatibility makes it a stellar addition to any tech-savvy individual's toolkit. Say goodbye to charging hassles and embrace the efficiency and convenience these cables bring to your daily device charging.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Good quality,  great length and spares on hand","reviewDescription":"These long charging cables work perfectly and are a great length to charge and use your device(whatever the device is) at the same time. The inexpensive price and the number of cables you get helps to have several on hand for multiple locations or multiple devices or extra on hand if you lose them often like I do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Great product","reviewDescription":"These work perfect for being able to use in my usb electrical outlets. Keeps from using up a electric socket","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"USB -C Cord pack","reviewDescription":"These work great to charge our Galaxy Phones and several other items like gaming controllers, vape, etc.  The only thing it WILL NOT work on is my iPad.  It says it is not apple approved","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Great price for the product","reviewDescription":"Great price. I like the  length and charging performance. The cord appears to be durable and does not tangle.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Excellent","reviewDescription":"Bought these after I got the new iPhone and thank god because they work great in all of our cars.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Durable and strong","reviewDescription":"These chargers are built very well. Provides a good strong connection and are designed to last through harsh conditions. I will buy again if needed in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"It's exactly what you'd expect","reviewDescription":"They're good charging cables for any USB-C device. If you need a handful for around the house or in your car then this is the deal for you.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"was NOT fast charging","reviewDescription":"All seemed great until plugging it in and seeing that it is NOT fast charging.Do NOT put 'fast charging' in the description if the cable is NOT fast charging.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Sturdy Cables (Initially anyway) But NOT for long Unfortunately (2nd Review)","reviewDescription":"~~~~~~~~~~2nd Review~~~~~~~~~~Further Below is my initial review.  Sadly after only 3 weeks of use - these cables seem to break connection near the end of the plug - just like most cables do these days.I guess if you plug them in then DON'T move the cellphone or whatever they're attached to, then they may last longer.  Otherwise be prepared for them to have an internal break - as fast as the majority of other brands of cables.  Quite disappointing to say the least.I plan to try different brands to see if any of them are better~~~~~~~~~~~~~~1st Review Below~~~~~~~~~~~~~~Most cables are so thin that the wire ends up breaking near the plug ends.Very pleased with these cables as well as how well they're packaged prior to shipment.They charge fast And the cables are much thicker than most which seems to prolong their lifespan.Seem to be very good quality as opposed to most on the market.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1681516800000}
{"reviewTitle":"Don't last long","reviewDescription":"I bought a five pack in May and have already gone through all of them because they stopped working after about a month. They're cheap enough to have as backups in your car or office but I'd get a better one fir everyday use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Not good for carplay","reviewDescription":"Used these charges to connect my phone with my car and CarPlay.Very often it disconnects randomly and then after unplugging the cable and reconnecting does it work again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Doesn't play nice with Apple","reviewDescription":"Cords appear to be in good shape, but 3 of the 5 cords will not charge my iPhone or iPad.  Works fine on lower-end android devices such as our Fire tablets, but these were for upgraded iPhones and didnt work out for us.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"They don't last long.","reviewDescription":"Don't expect them to last very long, I am down to two that still work and one cuts in and out while charging.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Cable stopped working","reviewDescription":"One of the cables stopped working under normal use. The other one is holding up okay, but I really thought they'd be more durable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Doesn't work with Android Auto","reviewDescription":"I purchased these cables to use in my 2021 Toyota Venza.  When I attach my Samsung Galaxy 23+ phone it will consistently connect then disconnect from Android Auto.  Tried all five cables and none would maintain an Android Auto connection. Purchased a Ventev cable and the Android Auto connection is rock solid and never disconnects.  Wouldn't recommend these cables for anyone who wants to use it forAndroid Auto.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"These do not work","reviewDescription":"I bought a pack of 3 ft and a pack of 6 ft. For my iPhone 15. The 3 ft seem to work ok but none of the 6 ft work, no matter what I use to plug them in such as usb in vehicle, usb on computer or usb wall power block.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Cable doesnt charge apple products","reviewDescription":"When i plugged the cable into my iPhone, iPad, or MacBook it wouldn't charge the device. interestingly though it was able to work using my wireless charging dock. none of the cables included worked with apple products either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"All 5 cables are faulty - steer clear of these","reviewDescription":"None of these cables met up to what they claim. 3 of the 5 in the pack produced a warning on multiple devices that the charge was slow and may not provide enough power to allow use while charging. The 2 that did not cause this warning charged extremely slow compared to the cables that came with my devices. I am throwing them all away once I have decent replacements. I did buy a couple Anker brand cables and have had good luck with them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"Not work","reviewDescription":"Half of these did not even work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Does not charge iPhone 15","reviewDescription":"Don’t know why but none of the 6 cables I got will charge my iPhone 15. I’ve tried them in many different bricks, computers, car chargers, usb outlets etc. and nothing. They’ll charge smaller things like flashlights but not the phone…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Works but doesn't last long","reviewDescription":"I went through the whole pack of them in a few months but still a good buy for the money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"2 of the 5 wires simply do not work","reviewDescription":"Not impressed. 2 of the 5 don’t even allow my new iPhone 15pro max to charge.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"NOT fast charging. But long cable is nice.","reviewDescription":"Every time I use this cable on my Samsung S23 Ultra I get a message saying it is slow charging, which makes it extremely inefficient. The only positive things about this cable are its length and durability.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Not fast charging, in fact, slowest charging of all my cables","reviewDescription":"When I use these to charge anything, phones\/speakers\/Nintendo switch, the devices have to ask me 'Is there something wrong with your USB cable?'  I have one plugged into my phone right now, and it estimates to charge from 37% in 5hours... My other good cable says an hourI tested all the cable to make sure it wasn't just a defect of one, but they all do this.  Buy something else.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"6 month life","reviewDescription":"So at the start these worked great. I used them just at my computer to charge my phone. About 6 months of light use is the lifespan for these. I consider light use being that they were never rolled up, scrunched up, never packed, etc. They sat on a table and were used about once every other day. I'm kinda surprised they didn't last longer. They simply stop connecting to my devices now. They'll plug in, the phone will say charging and then if you bump the phone slightly, it disconnects.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Cord falls out\/Disconnects","reviewDescription":"Google Pixel 7 Pro. Cable seems well made, but the Type C end wiggles while connected, and eventually pops out of the charging port rendering these cables useless for the purpose I bought them for. I gave them 2 stars because they stay plugged into my headphones while charging. Next time I'll pay more to buy from a more reputable company.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Inconsistent","reviewDescription":"Got two different packs of 5 and only a total of 4 of them would work with any Apple devices. I tried two different iPhone 15 pros and iPad Pro and only 4 would actually charge or register as plugged in.There must be something not to spec in these cables","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700438400000}
{"reviewTitle":"It was long enough for what I needed for","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Work  great","reviewDescription":"Good length work great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Happy","reviewDescription":"Exactly what I needed. Have to order more","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"OK for Charging","reviewDescription":"Nice Product for charging, not so good for transferring data. Should have read the details more carefully.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Felt good, but WATCH OUT FOR PACKING GOO","reviewDescription":"This is a review of ‎SMALLElectric ASIN ‎B08PQJCBGN (5 pack 10' cable).These appear to be good quality- but i haven'tgot any test time yet. I like the flexibility and my Samsung Note20 series immediately went into fast charge.My WARNING is that the packaging has some sort of nasty glue holding it together. Be ***VERY** CAREFUL pulling the cables out of the packing.  The first cable's USB-C got some of that on it and collected hair & anything else it came in contact with. I couldn't get it off using a towel and only more goo collected and am cutting it in half and throwing it away. Had i put it into my phone's charging port it would have been ruined. Throw away the packing as soon as you get the cables out.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"These are awesome! (I haven't tried any, but still)","reviewDescription":"I haven't found the necessary time to plug these in and plug into my phone, as I'm very busy and didn't have a couple of spare hours to figure this tech out.With that said, I rated 4\/5 because they look cool. They remind me of other types of electrical wires, which is amazing.The fabric encasing the wire is to die for. I will likely strip some of it off the make a fabric straw, which would be really really cool.The one complaint I have is that these don't seem to plug into the wall. I'm not sure how to power them, they should come with more clear insturctions!!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Work well, look good","reviewDescription":"Only issue is they are a bit shorter than my other 6ft cords... i haven't measured them but seem less than 6ft...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"These died on me pretty quickly after purchase","reviewDescription":"The couple I still had left (didn't lose) died, as in when plugged into a charger brick my phone will say \"22 hrs to charge\". Tried multiple charging bricks. There's no visible damage to them at all. Not sure what happened. They did work great before crapping out. Also 6ft is kind of excessive for a lot of places. Great for the bed or couch though.Edit: seller sent me a new replacement pack even after it had been over 6 months since my initial order so I'm changing the rating to 4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"Great charging cords","reviewDescription":"These cords are strong, durable and work with any C type charging device. They are the perfect length which is good when you are limited on outlets when you travel. I also like that there is different colors to separate mine from my son's.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"So far, so good","reviewDescription":"Nice, long cables.  Work well, haven't broken yet (6 months +)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"The USB C side wears out","reviewDescription":"They're a consumable, not intended to be a durable product, and they lose efficacy in charging over time. I suspect this loss of charging efficacy is because the male USB C connecter gets worn down from repeat plugging and unplugging. This is not a knock on this particular product, but an aspect of any male USB C connection point.With all that said, I've ordered the cords a few times and likely will again. The price and features are nice, but how much of it is simply because I like their little smiley face logo?","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1666656000000}
{"reviewTitle":"Ok","reviewDescription":"Not very fast. Not very slow.Pretty sturdy. That about covers these.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Durability","reviewDescription":"So far no complaints! Pairs with a Samsung box it charges my phone super fast!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"Solid Chager","reviewDescription":"Work pretty well and are a good length.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685145600000}
{"reviewTitle":"Good value","reviewDescription":"Good value for the quality and length of the cords.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Great inexpensive product","reviewDescription":"While the charge wasn't as fast as advertised, the length and durability more than made up for it. The price was decent as well. So far, I'm happy with my purchase and expect to be able to use this charger for a long time to come.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"These cords suck","reviewDescription":"These cords didn't work well for me, but the seller contacted me quickly and issued a refund.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682899200000}
{"reviewTitle":"Good product","reviewDescription":"Good product,  well packaged.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683417600000}
{"reviewTitle":"***Review Update: It is not fast charging","reviewDescription":"The company reached out to me after my review to see how could make things right. They offered a refund or replacement to be sent out. I appreciate the follow up and good customer service, so I'm changing the review to a 4 star review.Build quality seems good, but the reason I purchased was the fast charging feature. It does not fast charge on a Pixel 5a or Samsung 20+ and I've yet to find a device that does charge quickly using these cables.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658793600000}
{"reviewTitle":"okay product","reviewDescription":"gets the job done","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"They work great!","reviewDescription":"This product works great! It is durable. I use them to charge my toddlers tablets and my cell phones with a fast charging block.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Best chargers","reviewDescription":"Best chargers out there. Have purchased these twice now and they last a long time.  They are fast charging and worth the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"TYPE C CHARGING CORD","reviewDescription":"I love these cords. They are sturdy and strong. These cords should last a very long time that's why I ordered them. They are awesome. I am so happy with my cords.Thank you for making such a wonderful product.Denise D Van Ness","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Strong, durable cable.","reviewDescription":"This cable is solid. With the braided shielding its strong and can handle a lot of use. Much better than other ones with vinyl insulation. The USB-C housing is strong and doesn't feel like it can come apart easy. Connection to the phone is good and while not recommended, could easily pick up an attached phone. Good value for price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Great product","reviewDescription":"This is the second time I have ordered these.  They are qood quality and work well.  Definitely would buy again, and again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Great!","reviewDescription":"I actually love these. There were enough in the pack for each of us to have a charger, and they charge pretty fast!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Good so far","reviewDescription":"Pretty standard. I’m using these cords and my phones are charging at a perfectly fine speed and the durability seems good so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Great cords!","reviewDescription":"These cords are very sturdy. I like the reinforced ends. They charge quickly and were packaged very nicely. Would definitely buy these again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Perfect","reviewDescription":"These chargers are a great value. They are durable and fast charging. I haven't had any issues and will continue to buy this brand.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great long cable","reviewDescription":"This cable is the perfect length to reach from our recliners to the electrical outlet on our Android phones. Love having extra cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Fast charging cable (in 2022) but not as good as 2021","reviewDescription":"*UPDATE 2023*The original review was given 1-star because it did not fast charge a Samsung phone but the same brand cable bought from 2021 did fast charge. However, I found out later that the phone's USB-C charger port was collecting dust\/dirt\/debris and needed to be cleaned (see below for how-to instructions), and after cleaning, any USB-C cable plugged into the phone charger port would be more sturdy and no longer wobbly\/loose (originally thought it was the port going bad or physically damaged).So I retested the cleaned phone with the newer 2022 cable and sure enough it Fast Charges! Hence, review is updated from 1-star to 4-star, it loses 1 star because the older 2021 cable managed to fast charge a \"dirty\" port.HOW-TO-CLEAN-USB-C-PORT:You can do a Google or Youtube search \"how to clean phone usb-c port\", or here are brief instructions.1. Turn OFF your phone.2. Get a paper clip and bend it so that you have at least 0.5-1 inch of straight metal, or get any small metal pin but not too thick that will bend or touch the center piece sticking out of the USB-C port.3. Scrape along the gap of your USB-C port, avoiding the center piece of the port. Dirt\/dust\/debris collects inside the hole so that's why when you plug in any USB-C cable it will feel wobbly\/loose instead of tight if the port was clean.4. Blow on the port now and then while cleaning to remove any loose dirt\/dust\/debris.5. Plug a USB-C cable in to test that it's now snug\/tight instead of wobbly\/loose, and you are done!*ORIGINAL REVIEW*Bought this same cable in 2021 (march) and it was fast charging, bought it again in 2022 (nov) and it is NO LONGER fast charging. The pictures will show the difference between the 2021 and 2022 versions, the 2022 slow charging cable's head is slightly darker blue\/gray in color, and the inside of the USB plug is purple instead of black.Tested both cables using the same phone with the same power plug, all 6 of the new 2022 cables were SLOW charging. Very disappointed, because I recently bought a different brand which was suppose to be fast charging but was in fact slow charging, so I thought I would go back to these cables since they were fast previously... but clearly not any more.","isVerified":true,"ratingScore":4,"reviewReaction":"46 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"Didn't work for our iPhone 15 Pro and Pro Max... so confused!","reviewDescription":"So, these reviews are stellar, and the cords themselves are amazing. Great deal! BUT, even though there are reviews saying it worked with a charging cube for someone's iPhone 15 pro and pro max, it didn't work for ours. WHY! These are perfect and cost conscious. PLEASE figure it out.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Excellent customer service","reviewDescription":"I have bought these before. The first set worked fine- the second set had problems. I missed the return window, but the seller read my note and issued a full refund. That is impressive!  Will definitely buy again. Excellent customer service.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Well made, but does not power iPhone 15 using the small square charging block","reviewDescription":"The cords are well made and long enough, but it would not power my iPhone 15 with the older Apple square charging block - it did power it plugged into my computer","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Good for Iphone 15's!","reviewDescription":"The cords are sturdy and stiff at first but get softer the more you use them. For the price these are great (I also got them on prime day so a little cheaper than listed currently)!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Broke but they refunded my money.","reviewDescription":"Item stopped working, They refunded my money however.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Sturdy cord","reviewDescription":"Does NOT work with new IPad Pro. But with that said works GREAT with my phone so it’s all good","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"They get the job done","reviewDescription":"Faster charging than some others I’ve gotten on here & good price point\/durable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Good stuff","reviewDescription":"Works well with iPhone 15’s.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"N\/A","reviewDescription":"Great value for the money & durable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"They work.","reviewDescription":"Bought because my son is always losing his cables. This way I have extra just in case.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688515200000}
{"reviewTitle":"Seem Sturdy","reviewDescription":"Seem Sturdy, Durable and look reliable.Will be used in fleet vehicles.Time will tell.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"Pretty good","reviewDescription":"Perfect except the plastic cover over the connector easily slips back.  It's easy to slide it back.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686009600000}
{"reviewTitle":"Works great when you find a compatible power source","reviewDescription":"UPDATE 2\/8\/2023: Didn't work at first on one power strip straight into USB, but did work on another. Also tried with a power brick and that worked on the original strip. So, if you have issues try a couple of different plugs.---------These don't work with my Samsung A23. Tried 2 in a power strip that another device is plugged into and working. Phone says replace cable but they are brand new.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"Plugs and connection aren't perfect","reviewDescription":"Has been good for charging my phone in the car as it is durable and the right length, but trying to use it to upload photos from my phone it gave trouble staying connected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685577600000}
{"reviewTitle":"A solid set of cables kneecapped by one fatal flaw","reviewDescription":"These cables were great for about a month, then seemingly on command the metal shrouds on the charger heads (The part that says SMALLElectric) started to come off. The glue that was applied when the metal sheath was slid on must have been faulty, or something to that effect. I was able to fix all 5 of them easily with a replacement dab of super glue, but spilled some on my finger. I may never emotionally recover.Worth the buy if you have super glue handy.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1674777600000}
{"reviewTitle":"Maybe to long","reviewDescription":"I was stoked that these are 10' long. The problem is signal degradation. Slower to charge and info transfer than a shorter cable but nice to have as an option.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Good cables, Odd color.","reviewDescription":"I ordered the grey option, and I'm not sure if the grey ones are supposed to be this color, but they look almost like a navy blue color. They're decent cables, and they look good, but the color isn't quite what I expected.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1682726400000}
{"reviewTitle":"Great product for the price","reviewDescription":"This is my third purchase of this product.  Between tablets and phones we need all six. Life span is about 6 months for my teens, and over a year for us adults.  Like the title says, \"great product for the price\".","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682640000000}
{"reviewTitle":"Work with android auto","reviewDescription":"I have had a hard time finding cords that work with the android auto app. These worked still skip a bit, but overall work pretty well.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1685059200000}
{"reviewTitle":"Unreliable","reviewDescription":"Can't understand why these cables have such good reviews. I bought a bundle of them and have had virtually all of them fail to connect to devices at some point despite having no signs of wear or damage.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Nice length","reviewDescription":"Nice length but only work for a few weeks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Reviews Not Accurate: UPDATE (+1 Star)","reviewDescription":"The seller has contacted me, offline, offering a refund in exchange for the deletion or update of my negative review below. (+1 star for reaching out.) They've let me know that a new manufacturer has been secured and the issues I outlined below have been addressed.I am not sure why I'm being contacted outside of my review after all this time, but a refund is not necessary. I would just like the product that I paid for.  I will make you a deal, seller. If you would kindly send one of the 'new' cables for me to test and review? At the end of 30 days, I will update this headline and review to reflect my experience with the new product.Not sure where all the positive reviews came from. The cables I received are not rated for fast charging regardless of the device being charged or charger. Further, the plastic covers on each end (Both small and large end) are loose (Were not heat-shrunk enough) and will not stay in place, making connecting both ends difficult.My kid's S9s and our S10s all threw errors when we connected using these cables, even after restarts and trying several different chargers. Tablets, android, iPad all same-same. You might have better luck but I cannot recommend these cables at any level. Too cheap to send back - just threw them away and ordered others.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1572566400000}
{"reviewTitle":"Dead on arrival","reviewDescription":"2 of the 5 charging cables I bought did not work right out of the box.  Tried all 5 w the same charger cube and only 3 worked. Tried 2 different cubes and the same 2 did not work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Not sure about quality","reviewDescription":"Unfortunately two already broke","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Didn't last long","reviewDescription":"Bought 6 pack in August and all have stopped working except one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Does not work with IPhone 15 pro max","reviewDescription":"Doesn’t work for mine or my wife’s Iphone 15’s.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"NOT what most of Us are Looking For","reviewDescription":"These are really strong cords, really packaged nice BUT for MOST of Us I am sure these are NOT the connections we are looking for. We have a LOT of USB charged products in Our home, a LOT, and NONE of them fit the ends to these. I don't even know what these are for! Be careful, if You, like Us are regular electronic users because almost guaranteed, despite the picture looking like what You need, it is NOT . These are wider at the ends and fit NOTHING that I have found yet. Again, do NOT buy unless You are SURE this is what You need, because I searched and googled and looked at pictures and these do NOT fit my phone, my camera, my JBL speaker, earbuds,....ANYTHING!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661990400000}
{"reviewTitle":"Charges slower than smaller sizes","reviewDescription":"I like the length but unlike the others smaller sizes the 16ft charges slower and tends to overheat I've bought 2 sets already but still the same","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Doesn’t hold up to kids.","reviewDescription":"Bought these for my kids to us with their tablets. After about two months they no longer work. Worked well initially however not durable enough to hold up to daily use from kids.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Do Not Purchase!","reviewDescription":"I received a pack of 5 cables; only 1 works. However, it only works when attached to a plug, not when plugged into a USB. And the charging is SO SLOW. It takes HOURS to get to a full charge. I did not test them upon arrival, big mistake.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Hot garbage right out of the box","reviewDescription":"Every single one didn’t work. The connector on the outlet side wiggled around more than if you stuck your fist into a coffee can. Poor quality. Would only recommend as a gag gift so you can watch the recipient grow more frustrated checking every cable one at a time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"not compatable with apple ipad latest generation","reviewDescription":"my new ipad does not recognize these cables and will not chargei should return them as the ipad is specifically what i intended to use the cables for.they do charge my amazon products and do connect other items, such as external hard drives, to my computer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Don’t buy","reviewDescription":"Don’t waste your money. I tried 3 of the cables and none of them worked","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Opened the pack and…","reviewDescription":"The first cord is working fine!  The others just start charging and drop out of the bottom of the phone - too bad I can’t return them.  It’s sad because they’re really strong cables and seem they’d last a long time but unfortunately it seems like the outer housing is slightly too small to stay in the charging port (brand new iPhone 15’s)","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Nope","reviewDescription":"Stopped working almost straight out of the pack.  I do not recommend this brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"All cables stopped working after one month","reviewDescription":"As stated, the quality of these cables are terrible. They all broke after one month.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Worst Amazon purchase ever","reviewDescription":"I bought these cords after getting new iPhones for my wife and I and four of the five cords do not even work. I’ve purchased several hundred items on Amazon, and this is by far the worst quality I’ve ever received on a item through this website.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Bought these before, quality changed","reviewDescription":"I purchased these more than a year ago and needed additional cables for my iPhone. Out of the five that arrived, I tested three, all of which failed to charge an iPhone but the older five pack I bought in the past worked just fine. Either the power they supply is too low or they don’t meet the needs for iPhones to charge correctly.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Not for iPhone 15???","reviewDescription":"Straight out the packaging directly into my phone and would not connect. I tried 2 of the cables and 3 different outlets, nothing worked. Outlets worked with other chargers, and my iPhone 15 was just purchased today and works with my computer's usb-c charger.Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Great for Charging, Garbage for Data Transfer","reviewDescription":"I got these to connect my Ender 3 S1 3D printers to a Creality Sonic pad. I had cables that worked fine before, but I needed longer ones. After installing these I got constant disconnects on both printers with all of the cables in the package. I put my old cables back on, and no more problems. I'm keeping them for charging purposes as even these cables are capable of that. But I will be marking them for charging only.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"Does NOT work with an iPhone 15!","reviewDescription":"This cable does NOT work with an iPhone 15. The description should note that. I bought these 5 and one worked once and it quit. It does work with other USB-C devices; it charges my Sony headphones.I bought two Anker cables and they worked fine with my iPhone 15.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Do not fit the iphone 15","reviewDescription":"These will not fully insert into an iphone 15 and any movement at all causes them to stop charging.  I tested it with 3 different cables from the pack, 2 different iphones, they just don't work","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Fragile","reviewDescription":"Very short life.Theybare very fragile.One or two months of use and stops the fast charge","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"It did not work","reviewDescription":"I tried to plug it in on the new iPhone 15 and it does not charge. I tried it as well on the new iPad. No changes. It’s a bummer it didn’t work for me.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Doesn’t work for everything","reviewDescription":"I got the new iPhone 15 pro max and these do not charge that phone. It’ll charge other things with the c but not that phone pretty disappointing but useful for other things","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Some of them stay in the phone, Some dont.","reviewDescription":"The Bad: I ordered these because I obviously needed more charger cables. Once I received them, I opened them up and started using them. The very first thing I noticed was that the end that goes into the phone wouldn't fit inside of the hole for the charging port. So I then cut the hole bigger so I can use it. After all said and done, 3 out of the 5 I got, wont stay in the phone when's its charging. I thought it might be my phone and tried my wife's phone, which Is identical to mine, and I got the same results. Our phones are only, maybe, 6 months old. So its not the phone's.  The 2 good ones will stay in the phone like the charging cords we got with the phone. If you wanna use your phone while its charging then dont buy these.The good: When I use these cord's with the fast charging transformer, they actually do fast charge my phone. The quality of the cord is good. The length of the cord is good. The 2 good cords I got stay in and charging while Im playing on my phone.  The overall durability of them seem good, but I havent had them long enough to know 'how' durable they really are.In my opinion, next time Im honna spend more money and get a better cable.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1621555200000}
{"reviewTitle":"Does not work in vehicle","reviewDescription":"When I tried to connect to Apple play in vehicle it will not. Don’t buy if needed for use in vehicle. Most worked when used with normal plug in wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Doesn't work with the new iPhone 15 pro max","reviewDescription":"Works to charge a Samsung phone, but doesn't work with the iPhone 15 max pro. Just a heads up, since the new iPhones moved to the type C chargers.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Not the best cable I've owned","reviewDescription":"Most of my phone cords get worn out after 6 months or so. I bought this set so I wouldn't need to buy anymore in the near future. Unfortunately, these cords are worse off directly out of the package than my worn out cords that are after many moths of use. They may be ok for stationary use, but not as a phone charger. The charging cuts I. And out if I just slightly move the phone and .out often it only registers as a slow charge (5-9 hours from 30% to full). Cheap product pricewise and quality wise. Wouldn't reccomend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681084800000}
{"reviewTitle":"Look nice. Fast charging? No dice.","reviewDescription":"I like the apparent quality of these cables.  Since we have 6 Android phones in our house, I wanted thisulti pack to have a couple backups.  The length of the cable and the quality ni am happy with.  My biggest issue, according to the product description was that it fast charges; it does not.  I have multiple fast charging bases and none of them make this cable charge faster.  Samsung fast charger, newer Samsung faster charger and even a new Belkin dual charging base will change the speed.  What's worse is, it actually charges slow.  I got a 10% charge in 30 minutes on this cable vs 90% on my shorter cables plugged into the same base.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1661904000000}
{"reviewTitle":"Convenient pack of 6, but these are not very soft or flexible. They're stiff","reviewDescription":"Hoped these would be softer. They are the harder, not-as-bendy material, which is inconvenient if keeping them on the nightstand. For example, the stiffness of the cord knocks things over, if that makes sense. I prefer the softer type of cords.love that it's a pack of 6 because with children, they go through cords so quickly.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675814400000}
{"reviewTitle":"Does not always charge device.","reviewDescription":"I just started using these cables and when you connect them to a device to charge it, it does not charge the device completely.  I thought the problem was with one cable, but I have the same problem with the entire batch of cables.  I used another brand of cable and they seem to work fine.I connect the cable to a charger and device and it shows connected.  A few minutes later, the charging process has stopped and when I reconnect the cable, it will not connect.Update (04\/30\/2022):  The vendor contacted me and replaced the original cables I ordered.  The new set of cables appear to be working as designed.  I'm pleased that the vendor stood behind its product and replaced them without any drama.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650326400000}
{"reviewTitle":"Wires","reviewDescription":"Still working after 30 day","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Good","reviewDescription":"Goof working product does what it's supposed too","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"They work.","reviewDescription":"They work as expected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687996800000}
{"reviewTitle":"Great for the Cost, but not Fast Charging","reviewDescription":"With my old lightning cable it could fully charge my phone in 30 minutes. This one still takes the standard time to charge my phone, so around an hour and ahalf give or take. But for the price, it is what it is. Hard to beat having 5 charges so I won't complain too much.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"Longevity","reviewDescription":"Plenty of product, looks good, individually wrapped, and from China.  :(( let's see how long they last...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682121600000}
{"reviewTitle":"Plug is tight, but works well","reviewDescription":"The usb-c end is very tight so I need to be mindful of carefully unplugging devices that use these cables, but they seem to be working well so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"Long","reviewDescription":"Love the long cord!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Fast charging!!","reviewDescription":"This phone charger charged my phone or tablets in 1 hour completely it’s durable and has not broken and I have plenty of these chargers I would defiantly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"worth the money","reviewDescription":"Perfect for someone who doesn't want to carry the chord all the time. This order provides multiple chords for a stellar price and solves the problem with decent quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"great product for the $","reviewDescription":"I searched through a bunch of different brands for phone charging cables and kept coming back to these. so far I haven't had any issues and they work great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great cords","reviewDescription":"We've been using these charging cords at the office and they work great. Highly recommend these as it was a great deal and they are perfect for charging your electronics.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Great charging cord","reviewDescription":"They are long enough for us to sit on the couch and charge whatever we need. We use them for our phone and tablet.will buy again from them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Works great","reviewDescription":"Great set of c type charges , they have a great length and work well for charging all my kids devices.  Would definitely buy them again .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Great quality!!","reviewDescription":"These cord are a great value. They are constructed very well and the length makes it easy to connect anywhere. I would not hesitate to purchase again. Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Great Value","reviewDescription":"So far so good! Quality is great for the price point. Between losing charging cables and my dogs eating them, this is a good quality product to stock up on and have on hand. Would definitely purchase again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Good quality","reviewDescription":"Good quality fast charging. I used them for my phone and tablet and gave the other ones away to my family.  They love them as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Works great","reviewDescription":"This is my second time purchasing these. I love them so much and have given them away. I had to repurchase. Works great and charge very fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Very durable!","reviewDescription":"I like how fast my devices charge and hope strong the cord is. I feel like it will last longer than most of my devices.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"So far so good","reviewDescription":"I've used these cables for about a month.  Quality seems good. No issues yet. I'll update this review if I run into any issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Excellent!!","reviewDescription":"These cords are amazing.  They are very durable and last a long time. I highly recommend these cords. I will definitely be purchasing more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Great product, good price.","reviewDescription":"I purchased these charging cords based on price and reviews. I have had them for about a month now and I am very happy with them. I haven't run into any issues with connectivity, charging power, or cord length. I would buy these again.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Perfect","reviewDescription":"These are the perfect length. We take them on our trips, use them in our cars and by the beds to charge at night. They are made very well and won't break like other cables we have purchased in the past.  We love them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Quality charging cords","reviewDescription":"Have used cords daly for over a couple of  months now. Good quality cords, they resist fraying and connectors stay tight. Flexible cable  with ends that fit through phone case openings.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"perfect amount and length","reviewDescription":"These are just perfect for use around the home withrhe various electronic needs. Very handy to have 5 and the length is just perfect!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Variety pack","reviewDescription":"These days you need a lot of charging cords. This was a great variety pack at a very affordable price. Different lengths and they seem to be durable and not fray. I’m happy with the results and the purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"It lasted a year","reviewDescription":"The cable length was fantastic and fast charging but they stopped working after a year. Might buy again anyway since we liked the length","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Works great","reviewDescription":"The ends are made of metal that houses the plug, hopefully this will keep them from getting accidently bent. Working as expected so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Great and Inexpensive USB-C Cables","reviewDescription":"I've purchased these cables several times.  They're strong and never seem to break down.  If I could only keep my daughter from losing them.  Five stars, great buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Quality of cords","reviewDescription":"I like the quality of braided cords for ends and the actual connector is solid and not loose or bends like other brands I've had in past","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Apple CarPlay compatible.","reviewDescription":"2019 Kia Sorento still uses wired Apple CarPlay and no USB-C receptacles.  Wife’s iPhone 15 Pro Max only came with double USB-C ended cable.  Bought adapters to plug in her phone for use with Apple CarPlay navigation.  Absolutely works.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"It’s what you need","reviewDescription":"For my purposes, which is just plugging in my phone at night, it works perfectly. It’s a snug fit with a seemingly durable cord. No complaints","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Perfect if you have a new iPhone 15","reviewDescription":"I needed several new charging cords for my new iPhone 15 (around the house, in my car, etc.). These work perfectly and they're nice and long.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Good Cables","reviewDescription":"I wasn't expecting much for the price. With that expectation, I was pleasantly surprised by the quality I have noticed so far. The connectors fit as they should, the length is accurate, and the sheathing is both soft to the touch and seems to be smooth enough to glide across most surfaces easily.I have not tested data speeds bht my phone has been charging at full speed on these cables. Overall, I can recommend this product for the small amount of time i have had them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Works great!","reviewDescription":"I've bought these cables in the past and purchased more for my kids and for other outlets for guests. They still work great after several years of use and that is why I decided to purchase another pack. Great product. Durable, fast charging. Love em.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Excellent Chargers","reviewDescription":"I ordered these charger for our son and they are heavy duty and charge fast for his tablet. I will definitely order these again when needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great deal and fantastic price!","reviewDescription":"Love these cables so far! Several of my old cables were starting to take way too long to charge due to abuse and constant folding up in my work bag so I picked these up as a replacement. So far so good! Can't ask for much more for this price and I got 5 of them so even if I short one put I have backups.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Sturdy at a good price","reviewDescription":"We use a lot of this type of cable and this is the second time I've bought these. They've lasted longer than the others I've tried.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Decent cord for the money","reviewDescription":"Worked well when first plugged in. after six months or so, charging speed dropped drastically. Now, it charges no faster than a standard cord.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Mediocre cables.","reviewDescription":"Pros:Strong outside, length, work great when they work.Cons:Internals are weak. I have went thru almost 10 of these cables. I have only 1 left. They do not last. Especially the ones I use for the car. I assume the moving of the cable is just too much for it to handle.I never bend them nor do I press or squash them. Only rolled in a big circle or left laying there.The exterior is strong as these are the only cables I've ever had that the internal wires are not showing.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1678147200000}
{"reviewTitle":"Replace after two years","reviewDescription":"The cables have been terrific for two years. However, the wires at the USB fittings are now damaged, not reliable, and therefore I've begun purchasing replacements.Seems to be stress fractures of the wires at the fittings.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693267200000}
{"reviewTitle":"Bad cord connection","reviewDescription":"Loose fitting","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Ok, but not fast charging","reviewDescription":"These are ok, but they are don't have a very snug fit, and they are not fast at all. For $3 each, they are good, but use them for overnight charging.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Loose port fitting","reviewDescription":"Thank goodness there are multiple because they don't last long. I've been using the first one for only a month and already the fitting has loosened to the point that I have to hold it at a certain angle in order for it to actually charge my phone.The cord itself is nice and I love the length, but not exactly impressed by the quality. You get exactly what you pay for; a cheap, disposable cord.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Needs a fast charger to work","reviewDescription":"If you put this in a standard USB plug, it will take a day to charge your phone. In a fast charger, the results are much better. The length is great making it very handy to have around.Just know that you need a fast charger to go along otherwise not worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"Won't last for long","reviewDescription":"I bought this on the 3rd of august,today is 21 and the cable isn't charging anymore. I'm really struggling to find good quality cables in here.sigh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Won't charge","reviewDescription":"Worked well at first. 2 month later they either won't charge or they disconnect and reconnect constantly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Not fast charging cables","reviewDescription":"The quality seems ok for the price but these are NOT fast charging cables as many of the cheap cables aren't. Seem to be of decent quality though.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Definitely wouldn't recommend","reviewDescription":"When i pluged my phone into 1 of cords all kinds of warnings popped up on my phone so i unplugged it before any damage was done","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Do not work","reviewDescription":"I bought a 5-pack of these cables.  Some of them did not work upon arrival, and others failed within a few days.  Do not buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"none of the cables work","reviewDescription":"So i ordered these cables because i purchased a new iphone 15. Well to my surprise not 1 of the 5 cables actually work. Ive tried them with two different blocks l and also tried a different brand cable with those same blocks to confirm if the cables were or not. I will be returning these and ordering a different kind. Hopefully ill have better luck","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"Did not charge anything","reviewDescription":"I got a new iphone so i got these for my new charges, but nothing i have plugged these into gets any power and they don’t seem to work at all iphone or not.I now have 6 useless chargers and will be sending them back :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Charger melted my phones port. Check the added pictures.","reviewDescription":"I ordered these earlier this year and never had an issue aside from periodically getting a little warm to the touch when charging. Last night I woke up and tried to unplug my phone and it was melted together to where I had to take a pocket knife to chisle it apart. Not sure what happened. It was only charging for approx. 20 minutes. I had to get a new phone this morning because it charred the inside of my phone and I don't want to risk any further sparks or possible explosions. This was a freak accident. However, I don't wanna risk this with anyone else. When I had to go to 2 stores this morning for my new phone. No one ever heard of that happening and was taken back. The charger was not being covered, or near a heat source or anything else that could've caused this.You can see in the pictures how the charger was melted and also melted part of my phone making it unable to charge due to an insecure connection.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1667433600000}
{"reviewTitle":"Won't charge phone with any of the 5 included cords","reviewDescription":"Simply doesn't work. Kept getting message saying moisture dry phone. So I dried phone message kept coming back, so then I tried a different cord that came with this purchase wouldn't charge phone. Tried my wife's charging cord had no problems. JUNK don't buy!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Cords do not work","reviewDescription":"Look for a different item as these are defective and do not work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"QUIT AFTER A FEW MONTHS","reviewDescription":"Started bad connections and won't stay in port. Tried various appliances and same","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"All failed","reviewDescription":"Not one of these cables worked to charge my iPhones or other devices.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Horrible!!!","reviewDescription":"Save your money! These are absolute trash! They did not work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Slow charge","reviewDescription":"All cables look and connect fine.  Charge is so slow its not worth the savings.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Not fast!","reviewDescription":"These chargers take forever to charge. I was hoping for super fast but this is archaic!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Broke a few months after purchase","reviewDescription":"These cables are nice, woven and with metal ends. Unfortunately, they don't seem to be very durable, as one of them has already stopped charging a few months after purchase without a lot of strain.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Worked well until they didnt","reviewDescription":"Used for my Ipad 12\" and all 5 cables dies within 6 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Charge only, no data transfer capability","reviewDescription":"I made the mistake of buying this charger for use in my vehicle for Apple Car Play data transfer and charging. This cable will not work for data transfer, only charging.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"They did not last","reviewDescription":"Less than a year and they already need to be replaced.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Slow","reviewDescription":"Doesn't fast charge just standard and is very slow at it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Not charging right","reviewDescription":"They keep going in and out and not charging phone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Stopped working","reviewDescription":"I bought these for our tablets and they worked great to start. After a little over a month of use, they stopped working. When we plug these into our tablets, we get error messages that it isn't charging. If we use a different charging cord, it works fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"2 of 5 Did NOT work","reviewDescription":"Two of the cables, on the USB-C end do not fully insert and click and therefore DO NOT WORK.  They were dead on arrival...The other three work.  The quality and weight seems solid, it's just that I have only three working cables...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Cheap","reviewDescription":"5 cord for 13 bucks was a steal, but the cords were all very bad, didn't not charge phone fast as advertised, and were pretty fragile. First day I received them they worked well,but on the they broke down and it would take am absurd amount of time to charge my phone, I'm talking 4, 5, with 2 of the cords saying 11 hours. But still not a bad price for 5 cords.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672790400000}
{"reviewTitle":"Not reliable","reviewDescription":"Sometimes the charge good and Sometimes they don't charge good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Good length, bad ports","reviewDescription":"The length was good, they were what I was needing and happy with that part. The unfortunate part was when I tried using and plugging the usb-c part into my phone it read \"bad connect, slow charge, check connection\" due to what I feel may be a simple factory mishap in production due to the actual usb-c metal part being shorter than needed to fit into the phone correctly and charge how it is supposed to. It was 3 out of the 5 that were that way, so not all of them, but still unfortunate.  The other two that were properly made work great.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666483200000}
{"reviewTitle":"These cords suck","reviewDescription":"I have Moto 5G 2022 when I have an actual fast charge usb type-C 5v 3.1 ampvwire my phone will register as turbo charging! this company claims fast charge but my phone isn't reading them as turbo charge so with that said they maybe 5v but they ain't 3.0 amp that's for sure 5 out of 5 of these cords do not say I'm turbo charging! (which they should) so it's definitely the company's b.s. not just a single cord that was bad. I even Payed extra for same day shipping for this crap I'm not happy with them at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666915200000}
{"reviewTitle":"not very good or durable","reviewDescription":"The cords worked for a short period then stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Loose, won't stay in my phones charging port","reviewDescription":"I wanted to put one in my nightstand to charge my phone overnight, but found it kept falling out, used an older cable and it worked perfectly fine","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Bad connection to phone. Loose and fall out easily","reviewDescription":"Bad connection to phone. Loose and fall out easily.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Not all functional","reviewDescription":"At least 1 of the 5 cables does not work. Not functional when new raises concern for the longevity of this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Not 6 feet","reviewDescription":"This is no where near 6 feet. 3 feet at most.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Doesn't work for my macbook air","reviewDescription":"i bought these as a cheaper alternative than buying a second macbook charger. they fit because they're \"c type\" chargers, but every time i plug it into my laptop the laptop says charging but the percentage proceeds to go down until it dies. i don't think enough \"charge\" flows through for macbook laptops, or however that works.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679356800000}
{"reviewTitle":"Not functional","reviewDescription":"Purchased 2 packs and NONE of the cables work. Don’t waste your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"DO NOT BUY THIS ITEM","reviewDescription":"This is my second time purchasing this item bc the last chargers went out after 2 weeks I bought a second time just bc they were cheap. NOT ONE CHARGER WORKS OUT OF THE WHOLE PACK NOT ONE AND THERES 5 changers im pissed. DO NOT BUY!  So now I have to drive 30 mins away to just send them back to get back the money I would spend in gas. DO NOT WASTE YOUR MOMEY ON THIS TRASH","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Does not charge as it is supposed to.","reviewDescription":"Day one, tried to plug it in and flipped it a few times and didn't have any luck getting to charge until the 4th time and phone said it may not be properly charging or connecting. I guess you get what you paid for.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"bought 2 packages recently and none of them worked","reviewDescription":"I bought a pack of these a while back and they worked fine.  Well I bought a pack recently and none worked.  Got a replacement and again, none worked.  I don't know what the issue is - looks like there's a bad batch or something.  Clearly their quality control is lacking. What a pain to have to keep returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"I bought these for My I phone 15 and they simply don’t work 0\/10.","reviewDescription":"This product won’t work for an I phone 15 in the car nor plugged into a usb waste of money. Buy a higher quality product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Slow","reviewDescription":"Ordered these because the product description said they were fast charging. Tried them with three different phones and fast chargers, with the phones giving a slow charge warning every time these cables were used. Not a good purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"These do not fit Samsung Galaxy","reviewDescription":"Why is it so hard to make a charging cord that works?  These don't.  They either don't charge my Galaxy at all, or they charge at a very slow rate.  Wish I had never purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"TRASH! Stopped working within a few months","reviewDescription":"I bought these to use in car, at desk, etc. After just a few months they just stopped working. There's no wear and tear, they just sit there waiting to be used. Trash, waste of money, don't bother.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"The industrial chem bath is strong with these.","reviewDescription":"I cannot use these indoors as they reek of whatever chemical combination the company used in the production of making these.  Hopefully the baking soda will help it eventually to where the smell can be tolerated.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"bought 3 packs, only 1 pack worked","reviewDescription":"bought 3 packs, only 1 pack worked! the pack that works? i would rate 5 stars its great.  but TWO full packs not working? not acceptable so 1 star it is. buy at your own risk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Reliable and sturdy.","reviewDescription":"I've re-ordered this exact cord set multiple times. It's served me so well, when I need a new one, I just come back to it. It's sturdy, reliable, and a perfect length for my needs. Will be re-ordering again when I need additional USB cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Love that it a 5 pack of charging cords","reviewDescription":"I love that of my son takes one of the cords I still have extra and they charge my phone fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"AwesomI USB cords","reviewDescription":"Have purchased these cords more than once it's definitely our go-to USB cords in the house for me and my husband","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Exactly what I needed","reviewDescription":"Many of the Type C cords that come with prostheses days are very short. I like having the longer cord. Excellent!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"VERY GOOD CHARGERS !!!","reviewDescription":"These chargers are very good and charge very fast ! Love the multiple pack for the price ! 100% recommend (:","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Value!","reviewDescription":"If you go through cords, this is a great way to value up!  Multiple cords and they are long, too!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"The cord is long","reviewDescription":"I got these with the expectations of just fast charging. Not much the case. I got that and so much more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Worth it !","reviewDescription":"This product is a must have for everyone ! Good price + spare cords + good materialIt's a great combo  !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"USC to usb-c cables","reviewDescription":"These cables are well made very durable. The shipping was faster than expected. Excellent seller and will buy again from them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Great Charging Cables","reviewDescription":"These were delivered fast and work very well. The cables are stout and look like they will hold up very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
