{"reviewTitle":"Dull blades!  No returns! Don't buy!","reviewDescription":"You cannot return this item!  Side by side comparison of Mach 3 (left) and the Amazon rip off (right).  I have used the Mach 3 for years and is a good standard, but feels expensive sometimes.  I decided to try the Amazon three blade.  The first shave was okay, pretty clean, did not grab hairs.  ONE DAY LATER, it is a rough shave, misses some of the hairs closer to the skin needing multiple strokes and grabs hairs frequently.  The amazon also leaves a goo on your skin afterwards.  Normally I don't mind trying Amazon items, because there is normally a good return policy when something is garbage, not for this razor.  Make up your own mind, but I highly recommend not buying one of the big packs, like I did, thinking you are getting a deal on a Mach 3.  Look at the pictures and make your own mind up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Feel the burn.","reviewDescription":"I've been shaving since the wee age of 13. 45 years of shaving under my belt.I have to say that this is by far the worst razor I've ever used. The shave is not close and after a couple of uses, the blade is shot.I misplaced the handle today and had to use an old Schick Hydro I had laying around. The blade on that probably has a minimum 20 shaves on it. It was easier on my face with a closer shave than the Amazon razor.I had to dry shave years back in basic training. This razor brings back those memories. If you have a thick beard, this one is going to tear you up. I'm done with it. Back to the Hydro for me.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"DO NOT BUY - 1) does not work, 2) NON-RETURNABLE","reviewDescription":"The shaver head on this razor is HUGE, making it impossible to shave in the smaller spaces like right under your nose.  My Gilette razor works just fine (also three blades, but the shaver head is a fraction of the size of this one), so I ended up needing to use two razors to do the job.  Second, this one is over-lubricated - it has trouble catching hairs, just glides over them instead, regardless of direction.FINALLY, THIS ITEM IS NON-RETURNABLE, so if you have the same experience as me, you're stuck with it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"I would rather scrape a rusty hatchet across my face.","reviewDescription":"These are quite possibly the worst shaving experience I have ever had. Not only are the blades dull right out of the package, they are at the wrong angle. Guaranteed to leave you face looking like you stuck it in a box with 3 pissed off cats, bloody and scratched. It's like they made them so awful on purpose.They should come with a free Septic pencil and a box of Gauze","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Waste of money","reviewDescription":"Razor blades have gotten absurdly expensive.  For the longest time I have used the Gillette Mach 3 system.  And that has given me the most comfortable and satisfying shave.  But, at @ $33 for 15 Gillette cartridges, I decided to give Amazon’s three blade shaving system a try.  It was about half the price for the handle and 16 cartridges.  The worst shaving experience I have ever had.  The blades are so narrow that they flex far too much.  I have to go over the shaved area several times and it just doesn’t remove all the hair.  It’s uncomfortable.  It pulls.  And the design of the razor or razor blades head is too bulky that you can not get a close shave around and under the nose area.  Complete waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Not very effective","reviewDescription":"I hate to throw shade but these Amazon essential blades are a far cry from a good sharp blade(s). I don’t have a thick beard either. Just a poor economical set of blades.  Disappointed as i was hoping to find blades at a reasonable price that would do a good job. I’d of returned them but already used one out of the pack.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Doesn't fit","reviewDescription":"I would love to try them. Although the package says \"compare with Mach 3\", but doesn't fit Mach 3, ......so I guess I'm getting a new razor too!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Cheap equals cheap","reviewDescription":"LOL.  I had been using the Equate brand with low cost substitutes for Gillette Mach 3 blades.  Then I purchased these.  The blades last me about a week vs. 2-3 weeks.  Fair, they are less expensive by about 2.5 x.  But the handle and attachment system are maddening.  Clearly Gillette has some good patent protection in their super easy to use connector.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"2 blade refills","reviewDescription":"I ordered these for my son and I but they only came with the two blade refills which won’t work for our coarse hair.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Don't buy these","reviewDescription":"The worst razors I've ever used. Impossible to change blades, the shave is not close at all because it doesn't shave you, the blades are so dull it just rips the whiskers off your face. You might as well buy a roll of duct tape and pull your beard off with it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Unfortunately, not as good as Gillette's Mach 3","reviewDescription":"I generally am a fan of Amazon Basics. For the products I've tried in the past, they generally are as good as the branded version and at a much better price point. I'm sorry to say this is not the case with the 3-blade system Amazon sells. I can easily afford the Gillette blades, but their price has increased so much lately, it felt like they were taking advantage. So, I decided to try Amazon's alternative. When I unboxed it and saw that the cartridge looked very similar to Gillette's Mach 3, I was optimistic. However, after just one shave, I could tell it was inferior. Since then, I have have shaved twice, using Gillette on one side of my face and Amazon on the other, I can confidently say that the Gillette Mach 3 gives a much closer shave even with less pressure. The only other significant difference is the razor handle is a bit wider in diameter than Gillette's razor. While I don't like it quite as much, I could have gotten used to it. On a scale of 1-10 (where 10 is best and 1 is worst), I would rate Gillette's Mach 3 a \"9\" and Amazon Basics a \"4.\" Conclusion: If you want to avoid the ridiculously high prices of Gillette's Mach 3, you should perhaps look elsewhere first.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Don't rely on close shaves, just enough to get the job done","reviewDescription":"I usually get my blades from your standard big shop store and I tend to gravitate with one brand or the other. I figured I give these a try since the reviews were generally high.I will say they work great on sensitive skin, but I feel it doesn't come close to a \"clean shave\".With name brand ones designed for sensitive skin, they get close enough to provide a smooth shave. With these, not so much. I figured it was one blade slightly defective but I've replaced the blades now twice and still the same.If you need something to get the job done while keeping your sensitive face well, then get these, but I personally wouldn't recommend these.You are better off purchasing one of the other name branded ones.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Not impressed.","reviewDescription":"I’ve been using 2-blade razors for years, and the good-quality refills are getting harder to find, especially at reasonable prices. I never believed the 3, 4, or 5 blade razors would really be any better, and are more expensive. They always seemed like nothing more than manufacturers’ marketing teams hard at work to get you to spend more $ per razor refill, increasing their profits (I can say that with 40 years in marketing). When I found this 3-blade model from Amazon at reasonable kit and refill price point and generally excellent reviews, I decided to try it.After about a week of using it daily, I have to say it comes up short in most ways. On the positive side, the handle is a great design -  nice heft, and ergonomic? It handles well, and sets the expectation of a good outcome. However, the blades have already gone dull enough to not shave well - and I don’t have a thick or heavy beard. Just average. With my 2-blade brand, I’d still get at least a few more days out of it if not another full week.I wouldn’t say the shave is really any better. In fact I’d say it’s not as good from the start. Using it the exact same way as my 2-blade, it leaves areas only partially shaved. And as the week progressed that got worse as it got duller. I don’t like the way the thing tugs at my skin and beard, either. If it did a better job, I’d say that function maybe contributed to a better result. But it doesn’t.I’m glad I kept my old 2-blade razor. I’m going to trade off between them over the next couple of months to get a good comparison, but so far I’m guessing I won’t be buying more of these.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657411200000}
{"reviewTitle":"Ouch!","reviewDescription":"I'm tired of the high prices of my normal razor brand so I thought I would try these based on the reviews. The handle is heavy and well made, but the blades feel like they are ripping the hairs out instead of cutting them. I know it isn't because I'm still stubbly. Unfortunately I just missed the return window.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Single blade razors work better.","reviewDescription":"I give this two stars because it is inexpensive while being easy to handle and providing a decent shave on its first use.  After using these for awhile I certainly will not buy them again. I actually have Bic single blade razors that shave better after DOZENS of uses than these do on their second use. I can't imagine anyone using a razor just once and I have been able to use most razors 6 times or more before needing to discard them, and I dry shave often! As stated previously, I have Bic single blade razors, I bought for an unscheduled road trip, that I have had for over a year, used many times, haven't shown any signs of rust, and still shave reasonably well.  Much of my body gets shaved and so far I end up using the months old Bic razor to do the first basic shave and then use this for the final shave. If I used them for the full shave they would have to be discarded after that. Other razors might be more expensive, but they shave much better, last longer, are easier to use, and have a better design that gets the smaller curves areas easier (such as the jaw line).  You're almost better off with cheap single or dual blade razors which come packed in a plastic bag than to spend any money on these. Even in a pinch they really aren't worth it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660521600000}
{"reviewTitle":"Sharpness","reviewDescription":"Seems to lose sharpness after first use. Liked the 5 blade version better. Would return and exchange if return window had not passed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Clogs easily, doesn't shave.","reviewDescription":"I grew my hair for 5 days because I don't shave my head every day and the mach 3 still works perfectly regardless so I was looking for something that could do the same without the ridiculous price but this is just another failure. The \"anticlog\" feature is false. They do rinse out easily but they clog quickly so it took much too long with multiple passes required.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Quality of materials is lacking unfortunately...","reviewDescription":"This review just comes out of some user experience using the handle (or gripping mechanism that clamps to the Amazon Basics Razer) as it ended up prematurely breaking off after a few cartridges of use.The razers themselves are fairly decent for near one time usages, as having used a variety of other razers near this price point like Gillette, Harry, and BIC for example, these razors are the best they just get the job done however, as a person an issue for most people that shave their face everyday, even after using after shave it's pretty easy for the onset of breaking out to occur. This was infrequent with this razor, however I wasn't able to get extensive use for it outside of using just to handful of cartridges before the stem, or the mechanism that holds the razor broke prematurely unfortunately.Just throwing this out is like a \"hey this can happen\" forewarning to anyone that's kind of on the fence about this razor!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"Perfect fit with CVS pharmacy 5 blades:)","reviewDescription":"Update:  The blades suck from the first shave, then decline after. Oh well, at least I can use the CVS pharmacy 5 blades. Those are cheaper than Gillette, but the quality is about the same.Noticed CVS pharmacy 5 blade cartridges fit this. Those are excellent on this machine. I like the 2-d swivel. Will update when I try the Amazon blades on it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Cheaply made","reviewDescription":"Stay away from these razors, tried to get a refund","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Smooth... soft legs, in a fresh clean bed. HEAVEN!  BUTTT.....","reviewDescription":"Let me start by saying I've been a loyal user of Amazon razors for years, and they've been my go-to choice for a reason. The 5-blade razors, in particular, have been my holy grail, providing the smoothest, most comfortable shave I've ever experienced. Each replacement head lasts me well over a month, even with daily touch-ups and every other day shaving. I couldn't ask for more in terms of quality and longevity.A Slip in Attention:However, this time, I admit I didn't pay close attention while ordering, and I ended up with the 3-blade version instead of my beloved 5-blade razors. It was a classic case of my own oversight, and I'm kicking myself for not reading the listing more carefully. The 3-blade razors, while undoubtedly functional, just don't match the smoothness and precision I'm used to with the 5-blade razors.Personal Preference:I want to be clear; my slightly lower rating is purely due to my personal preference. The 3-blade razors are not bad by any means; they just don't align with my shaving habits and skin sensitivity as well as the 5-blade ones do. I find them a bit rougher on my skin, which is something I hadn't experienced with the 5-blade version.A Note to Fellow Shavers:So, here's a friendly reminder for fellow shavers: make sure to double-check the specifications and choose the razor that suits your preference best. Whether you're a fan of 3 blades or 5, Amazon razors are undeniably top-notch in terms of quality, sharpness, and durability. It's just a matter of what works best for your skin and shaving routine.Conclusion:In conclusion, Amazon razors are fantastic, and my experience with the 3-blade version hasn't changed that. While I might have a temporary mismatch in my shaving routine, I can confidently say that these razors, regardless of the blade count, are worth the investment. So, whether you're a meticulous reader like me or occasionally overlook details, rest assured that Amazon razors deliver quality, even if you accidentally end up with a version that doesn't align perfectly with your preferences. Here's to smooth shaving, no matter the blade count!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"My first razor upgrade, impressed!","reviewDescription":"Back in the 90s I bought the Gilette Sensor, the first in an onslaught of ever-more-expensive and increasingly multi-bladed razors.  It worked well enough, so I never jumped on the cash-vacuum bandwagon of Mach this or that next newest razor system.  Between the Sensor and electric razors I’ve been more or less good for about 30 years.  Problems: electric never got as good a shave, and the sensor was always hard to rinse out during use—blades too close to the edges or something.  This new razor is a great improvement, as I’m sure many of those higher priced would have been if I had tried them.  It cuts close, stays sharp a long time and rinses out very easily compared to my old clogging Sensor.  Plus it was way cheaper, especially the Prime day deal I got.  I’m pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Blades last a long time","reviewDescription":"Summary:  Easy to use, good quality, close shave, blades last a long time, but has a large head.Let me start by saying that I often go for long periods of time where I only shave every other day.  I am used to my expensive 5 head razers lasting 3 weeks to a month.  I have used Gillette, Schick and Harry in the past.  I have liked them all equally depending on the blade model that I buy.I bought this pack with 2 of the 5 blades, but then bought 3 blade replacement pack because I never felt like I got a closer shave with my Gillette when it went from 3 blades to 5.  It just got more expensive.This razer handle is about the same as others.  Weight, angle, etc.  It's comfortable and easy to use just as the all are.  But the head does seem to swivel better in more directions.  It gives a very close shave and although I have sensitive skin, it glides nicely and does not leave razor burn.The surprising thing...... It is now exactly 2 months since I bought it and I have not been able to try the 3 blade refills because I'm still using the first 5 blade head that came with the handle.  It came with 2.  So it will be at least another 2 months before I will be able to try and review the 3 blade version.The only negative for me is that they are very large.  There is a large area around the blades.  I have had some other brands models that do this too.  It's like a swiffer, and makes it a bit difficult to make clean lines at the sideburns and get under the nose.  I'm not sure why they do this.  But it still shaves like a dream and last such a long time that it makes the already good value even better.Some men throw their razers around or stick them in with toothbrushes and other thing where the blades get banged up.  I always  lay mine flat, blades up and very well cared for.  But these really do seem to last longer than the other brands.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1663200000000}
{"reviewTitle":"Amazing!","reviewDescription":"These are the best razors I've ever used.  They are just as good and sharp, if not better than the top razor brands like Gillette.  The only issue I have is the head of the razor is bulky and not the greatest for precision shaving, but it's good enough.  Absolutely recommend these.  They also last as long or longer than other razor companies.  BUY BUY BUY","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Good razor","reviewDescription":"Easy to use, clean, and store. Handle feels good and control of the razor is sure and easy. Price is excellent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Great for head shaving","reviewDescription":"First- I NEVER write a product review.I have been shaving my head for two years and have tried electric, several different types of safety razor blades, and Harry’s. I have trouble with razor burn and have sensitive skin. This is BY FAR the best razor for head shaving in the shower. I’m a daily shaver and will buy this from now on!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Switched from Venus","reviewDescription":"Never thought I would give up my Venus razors but they have just been so ridiculously expensive- I switched and love saving the money and these work just fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Great price for men's shaving needs","reviewDescription":"I love that these work as well as some of the top brands.  The price is great and I get almost a month per blade.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Inexpensive","reviewDescription":"Quality is decent cuts great. About 2 to 3 shaves then change blade","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Best \"Disposable\" Razor I've found!","reviewDescription":"I've been shaving my head and face together, for about 15 years. I've tried every razor and electric head shaver under the sun. The electric head shavers just don't get as close as a blade. After it became more difficult to find my go to \"careone\" razors at Riteaid pharmacy, I decided to give these a try. I thought the careones were the best razor I had found. These far surpass the quality of shave I get with those! If you shave your head like I do, you know you usually have to make multiple passes to get all of the stubble. With this razor, usually a single pass gets the hair, leading to less irritation on the skin! I highly recommend giving these a shot!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Just \"OK\"","reviewDescription":"Only lasts maybe 2 shaves before I felt like it was pulling.  Definitely not as good as some of your normal brand name razors.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671580800000}
{"reviewTitle":"Cheap, but you get what you pay for","reviewDescription":"I was looking for an option to my existing Hydro 5 because the refill prices are painful. Ordered this set to try out after reading all of the reviews. I'm not at all impressed with this razor. After one shave the blades are already dull. I normally shave twice a week, and during the second shave I could already feel dullness and pulling and missed spots. I guess I'll be keeping this as a back up travel razor, but I won't be reordering.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594080000000}
{"reviewTitle":"The blades are kinda ok but razor handle horrible","reviewDescription":"Razors were definitely bargain brand ... But got a lot of them so was ok.  But the razor handle is horrible.  Can't shave certain areas like jiat under my nose bc the handle gets in the way.  It holds the razor at an odd angle or something and is too bulky around the head of the razor.  I wouldn't recommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1631404800000}
{"reviewTitle":"Would not buy again","reviewDescription":"This is one of the worst  razors I ever have bought in my 42 years of shaving. I tried everything from shaving dry to shaving with water in the shower. This razor will not give me a close shave. I shave at night in shower (water only) and when I look in the morning I have day old stubble. Sorry Amazon, this is a big miss on your part. :-(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623888000000}
{"reviewTitle":"If you shave everyday, might be fine. Otherwise, go with another brand.","reviewDescription":"Don't be fooled by the cheap price, these blades are not for the casual shaver. If you skip several days between shaves like me, you'll be disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669507200000}
{"reviewTitle":"Didn’t work for me.","reviewDescription":"Had to make multiple passes to get a smooth shave.  My regular brand shaves much better.  I tried this Solomon brand to see if I could save some money.Will stay with my regular brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657065600000}
{"reviewTitle":"meh.","reviewDescription":"I had never heard of this brand but all of the glowing reviews had me purchase the product.  It's not a great shave - I shave in the shower and typically, when I get out in better light and see my shave I have to touch up.  I think the blades are too rigid and miss areas of my face.  I'm disappointed in this product.  You get what you pay for.  Not worth the annoyance for a deal.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1586736000000}
{"reviewTitle":"Not Top of the Line","reviewDescription":"Purchased for value but the actual shave left much to be desired. I shave at night and by morning it feels like a 24 a stubble already. Razor handle is comfy but blades do not shave close nor do they give desired smoothness. If I knew how I would ask for a refund!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633305600000}
{"reviewTitle":"The blades just aren't hardened sufficiently","reviewDescription":"If you compare these blades to typical top of the line blades, it's clear they go dull much, much faster.  Even though they are cheaper, they may not be worth it.  I'll be going back to Gillette or Schick or someone who makes a longer lasting blade.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637452800000}
{"reviewTitle":"Not worth it","reviewDescription":"The ones that came with the razor worked well so I decided to buy some refills. These refills were dull and pulled my hair by the third shave, nowhere near as good as the ones that came with the razor. The worse part is they are not returnable, one of the main reasons I use Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1622505600000}
{"reviewTitle":"Straight line cut for beard.","reviewDescription":"I'm 53 with a beard. I've used Gillette Sensor Excel razors for years, because the razor head would remain straight at the top and cut a straight line where I chose. I've been unlucky to find a modern alternative that swivels. This razor has a solid weight closer to my father's single blade razor. The head remains static at the top allowing for a straight cut where I choose to cut. The head swivels over the jaw and under the neck similarly to my son's very modern multi-blade razor. The price for this model is great, as a 10 pack of blades from Gillette Sensor Excel is 3x as much as this product. Pros: Weight, solid feel, apparent quality. Straight cut, adequate swivel. Price. Cons: None. I recommended this product to my son this morning!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"The razors are great","reviewDescription":"They shave close and smooth.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Super buena","reviewDescription":"Lo cómoda y afiladas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"nO CUTS AND NO NICKS IN GENTILE AREA","reviewDescription":"This product is as good if not better than most at less money.  Great for shaving legs and below the waist area.,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Value","reviewDescription":"Very good product for the price. Long lasting blades give a close shave over and over","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Been a gillette guy forever but this razor is at least as good at a fraction of the price!!","reviewDescription":"Very smooth- no pull!  Guess you really don’t need 5 blades!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Muy bueno","reviewDescription":"Calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Great blade for the price.","reviewDescription":"Very happy with the quality for the price. I actually prefer these to the 5-blade Amazon Basics razor refills I purchased previously.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Better than Dollar Shave Club","reviewDescription":"We were loyal DSC users for 5 years. Then they changed the razors so we tried these and they're great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Love these","reviewDescription":"Super convenient 👌","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Inexppensive shaving solution","reviewDescription":"Works fine and the price is very good.  No need to buy expensive name brands.  BTW, Temu has the same shaver for cheaper.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"A decent product","reviewDescription":"Reasonably priced and shaves well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Great value.","reviewDescription":"I'm very happy with the quality and price point.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Affordable alternative and great package size","reviewDescription":"My husband and I have been trying out many different shavers including subscription services, but something was always wrong. These work great for us and I love the pack size, so I don't have to think about getting refills every few weeks.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Excellent value!","reviewDescription":"For me, it is all about the value.  How well does the item perform for the money I've paid?Well, this razor and refills has shown to be excellent.The blades are sharp and shave beautifully.The handle has some heft and is solid but the head moves effortlessly to keep the blades in contact evenly.I was lucky enough to try these under a sale, so the price was fantastic (even the regular price is very, very good).I definitely recommend these razors & refills and hope Amazon stays with the same manufacturer!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Utterly Destroys Dollar Shave Club.....","reviewDescription":"These are so much better that the new Club Series razors from Dollar Shave Club.....They stay sharp much longer and shave closer.....and cost less.....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"More reliable than Dollar Shave Club.","reviewDescription":"It’s a solid razor. Is it better than Gillette, Schick, Dollar Shave Club, and Harry’s? I don’t know. I used Dollar Shave Club for a couple of years. Was tired of the hassle of keeping up with the subscription, but more importantly, was tired of a shipment going missing, then having the customer service rep act like it was probably your fault. When I quit, and there was a survey asking why, there was even an option to say you didn’t receive your order. That’s messed up. Realized that Amazon had a similar program. Three blade razor. Works the same as the other razor. Price was about the same as the other razor. And more importantly, you get Amazon’s reliability when you place an order. Instead of waiting if it will arrive, it’s there the next day. And if you want, you can just put in on Subscribe and Save and it’ll automatically ship on a 1 to 6 month schedule.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"It’s great","reviewDescription":"A great shave,ease of handling to shave. Blades last a long time.Cleans with ease.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Me like","reviewDescription":"I dont need 5 blades with my light beard, waste of $, but thats what i been using for decades. So i went w the 3 blade, just as good, lower price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Excellent value, great performance","reviewDescription":"I shave my head and face about every other day so I put razors through their paces.  It's getting harder to find decent 3-blade razors in the store and the 5s don't work for me as they gum up quickly.These are inexpensive, last a good while, the handle is very easy to maneuver, and unlike disposables I haven't nicked myself even once.  No razor burn either.  Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Do not buy","reviewDescription":"These blades cut me twice in one shave - I’ve been using a razor for 20+ years so I’m not a noviceStay away these are not even close to a quality razor","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"What a Drag","reviewDescription":"Too much drag on skin in sensitive areas. The blades did not glide on my skin. I use a quality shave cream and even with the lubricating strips, this blade does not measure up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1605657600000}
{"reviewTitle":"You pay for what you get","reviewDescription":"The blades are not that sharp. In fact, it is very uncomfortable shaving with these blades. I switched from DSC thinking I'd be saving money but I'm going back with DSC after these.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1598659200000}
{"reviewTitle":"Razors","reviewDescription":"These do not last long between shaves.  After two or three shaves, they are rough on my face.  I will pay a little more for a better shaver.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617580800000}
{"reviewTitle":"Disappointed.","reviewDescription":"This is my second time ordering these blades; the first time I ordered the razor with blades. These were not as good as the ones I bought originally. Not a good close shave.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1598572800000}
{"reviewTitle":"Not so good for a heavy beard","reviewDescription":"With a heavy beard these blades are effective for about three shaves, maybe four. The disposable version is much better for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1628985600000}
{"reviewTitle":"The blade is good, the engineering not so much.","reviewDescription":"The razor 🪒 shaves ok but the way it is designed does not work. Just not engineed correctly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633737600000}
{"reviewTitle":"Not worth the money","reviewDescription":"If you are not interested in a close shave this razor is ok but it takes some effort to get a smooth shave.  I'm not interested in buying this again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1590883200000}
{"reviewTitle":"Gotta work on it.","reviewDescription":"This item is right-priced but has an odd “gummy” moisturizing strip that is sticky when wet and strings between the razor and your skin.  There’s also no single blade on the back for touch ups like Gillette’s version.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1559520000000}
{"reviewTitle":"Inexpensive but not good.","reviewDescription":"The price is good. Not as close a shave as Gillette nor as long lasting.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1633132800000}
{"reviewTitle":"Cheap Razors","reviewDescription":"I usually buy Gillette but decided to try these ones. I regret my decision as these razors dull quickly. I only get 1-3 shaves before the blades have dulled and it takes a very long time to shave. The comfort strip does not make a noticeable difference in shaving ease. I am a woman and found these worse than pink razors.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582243200000}
{"reviewTitle":"Poor Blade System","reviewDescription":"Ever since new the blade handle will not firmly grip a blade.Now the handle no longer holds a blade rendering the system ineffective.This seems like a deal, but functions poorly.I’ll stick with Mach 3","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629676800000}
{"reviewTitle":"Not what we thought","reviewDescription":"They don't really cut close as you would think","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657152000000}
{"reviewTitle":"Blades are horrible","reviewDescription":"The amount of blades you receive are plenty, the handle is comfortable. However the blades are horrible.  Do not shave well at all, easily get packed with shaved hairs and must be cleaned constantly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629158400000}
{"reviewTitle":"The best a guy can get.....sort of","reviewDescription":"Way better than expected. They last as long or a little longer than top two famous brands. Easy to hold handle. Hard to load a new blade cartridge for this old guy. So tired of overpaying for razor blades- so I’ll continue to use these.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1602979200000}
{"reviewTitle":"Single blade is bad.","reviewDescription":"The main blades work well but the single blade for use on sideburns is awful!  The main blade won’t fit under my nose.  It pull the whiskers (brand new nine you).  Also nicked my cheek with the corner edge.  Not good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1597449600000}
{"reviewTitle":"Does not give a close shave","reviewDescription":"Cuts whiskers,  but shave is far from close","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660780800000}
{"reviewTitle":"Over- rated","reviewDescription":"These 3blades carts. don't work well. I have experienced more nicks than with any dollar -store razor over a five year period. I guess I need to go back to the dollar store. Thought about trying the 5-blade cart, but decided not to chance it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1588809600000}
{"reviewTitle":"Yikes","reviewDescription":"Bought this because the reviews compared it to the Gillette fusion. Lmao. Not even close. It doesn't work even half as well and leaves me with INSANE Ingrown hairs like I haven't had in years, disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608595200000}
{"reviewTitle":"Not the razor’s I needed or wanted","reviewDescription":"I wanted and needed five blade razors.  These were totally useless, and I ended up throwing them out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646524800000}
{"reviewTitle":"Should've Purchased Gillette","reviewDescription":"Very dull blades. Spend a couple more dollars for a better brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666742400000}
{"reviewTitle":"Not good enough","reviewDescription":"Replacing my mach 3, because you know, gillette...I shave my whole head and face. While this razor did not cause any irritation, cuts, or razor burn, it was a terrible shave. I had to go over areas multiple times. Seemed to miss a lot of hairs on each pass. I'm thinking it is because if the pivoting head maybe?  It took me several minutes longer to shave than usual. Bottom line - the hassle is not worth the price.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1559260800000}
{"reviewTitle":"Keep looking","reviewDescription":"They do not shave very well. Lube strip does nothing. Hard to attach to handle. Trying to find replacement for mail order blade, these were good price. Good enough to finish using what I bought but will change once they are gone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"Uncomfortable","reviewDescription":"Bought this razor a few months ago and never got around to trying it since I had so many blades for Harry's. Well I finally tried it and it was very uncomfortable. It certainly didn't glide smoothly and left my face irritated. Would not recommend this razor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Didn't  shave lose enough","reviewDescription":"Didn't shave very lose.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667174400000}
{"reviewTitle":"not what i expected","reviewDescription":"not a comfortable shave, made cheaply would spend a few bucks more for a better blade and razor","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656979200000}
{"reviewTitle":"Not a good shave","reviewDescription":"Not a very good shave.  And you can't return it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659052800000}
{"reviewTitle":"Terrible","reviewDescription":"Handle is well balanced, but the blades are terrible","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668643200000}
{"reviewTitle":"Irritation & not the best shave","reviewDescription":"These aren’t great and not worth the cheap price. I am a girl but always use men’s razors for my legs. These we’re good for the very first use of a new razor but then just didn’t work well at all. Plus they caused red bumps and a rash all over my legs. Not sure why.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1578528000000}
{"reviewTitle":"This razor wears down too easily Have to make serveral passes to trim","reviewDescription":"I am a female I just thought that this would work better than other blades cause its intinally made for the beard of a very scruffy tough bearded man ..I am wasn't really impressed ,and my boyfriend wasnt too enthused about it either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627257600000}
{"reviewTitle":"Better than expected","reviewDescription":"I have been using Jack Black razors. I want to spend less money so I tried these and they are just fine, and cost a lot less. Are they would I would say they are only slightly not quite as good but more than good enough. Very pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Reasonably priced","reviewDescription":"Just as good as a well know razor I’ve used for years.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"They work just as good as the expensive one if ask me.","reviewDescription":"I have tried many brands and shave everyday and am always looking to save money. This has hit the mark for me. For the price, I can use a new one everyday if needed but I choose to use them for about three days and then switch to new.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"Fantastic substitute for a Mach 3","reviewDescription":"Do you like the Mach 3, but don't like either Gillette or the price?  Then this is the razor system for you.  Shaves better than a Mach 3 for a fraction of the price.  Don't believe me?  Spend the $6-ish and try it for yourself.  I really don't think that you'll be unhappy that you did.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Don't hesitate they're more than worth it.","reviewDescription":"These are my Impressions after my first use.. Let me just say that I have been using crappy generic disposable razors recently because I've been leery to invest in a shaving system. Mainly because most of the blades are ridiculously expensive and there seems to be a new one every month making the old one obsolete. I decided to pull the trigger on this because I couldn't beat the price. I have a beard and only shave my neck, cheeks and mustache, which I do 2-3 times a week tops. So I figured with as little as I shave these will last me three years and by that point I think my $15 investment is well worth 3 years worth of shaving even if eventually they stop making these blades.So I ran out of the cheap disposable razors and I hadn't shaved in about a week so I was getting pretty scruffy. Usually when I get to this point I'll take my electric clippers and trim it down as short as it'll go before I actually shave. Just to save some wear and tear on my face and honestly those cheap disposable razors just couldn't handle it otherwise. Well I wanted to put this new system to the test so I decided not to do that and I just shaved fresh out of the shower with a week of stubble. All I can say is wow! This thing went through my beard like a hot knife through butter. Made me feel kind of dumb that I kept wasting money on those cheap disposable razors recently. I have no nicks, there was no pulling and it took it off with very minimal strokes. If you're on the fence about these I would say go for it, they are awesome and where else are you going to get a decent shave for less than $1per blade?","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1590278400000}
{"reviewTitle":"As good as all the name brands","reviewDescription":"I wasn't sure what to expect from these blades but I'll have to say they are every bit as good as any of the name brand blades I have ever used.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Best shavers on the market!","reviewDescription":"I personally like these razors because of the longevity and close shaves.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Multiple close Shaves","reviewDescription":"Easy to load cartridges into this razor handle. The handle shape makes use a breeze. Each cartridge lasts about a week. I prefer the three blade cartridges to the 5 or more blades sometimes packed into the cartridge. Three blade cartridges are easier to navigate.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"GREAT","reviewDescription":"good blades and way cheaper than those name brands","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"it cuts close and it’s sharpe best shave i’ve had in a while i’m impressed","reviewDescription":"i don’t have any complaints , it cuts clean and fast very sharpe good shve","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Price is good","reviewDescription":"Price is good. But quality not so much.  Only last one shave or two.  Value for money Gillette is much better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693526400000}
{"reviewTitle":"GOOD PRICE,POOR QUAILTY","reviewDescription":"These razors are of poor quality and very hard to get a close shave without putting excessive pressure on your face.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"The cartridge is to big for the number of blades","reviewDescription":"This product has razor cartridges that are better suited for four(4) or five(5) blades not three(3). It is hard to edge your side burns or mustache with these razor cartridges. Also, the handle allows too much articulation (play, flex, movement) of the cartridge. You may have had a better experience with this product unfortunately I did not. I bought the kit with 20 cartridges, big mistake. I will NOT be buying this product again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"I was disappointed with this razor","reviewDescription":"I didn’t like the 3-blade razor. My last razor I used wad a 5-blade so I’m going to try the 5blade from Amazon to compare. This 3-blade I feel doesn’t cut very well and feels like I can’t even shave once without feeling like it’s not sharp enough to do a good job.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"You  get what your pay for","reviewDescription":"I hate the \"20 blade super shave\" at $5 a cartridge trend in shaving.  These were perfect. Three blades and Super Super affordable. The first shave was incredible. Smooth and very very sharp. The second shave not so much. The third was awful, and I had to grab the old razor to get the finish  I wanted. The 2nd cartridge was the same performance.  Even at their price point, a new cartridge every other day is the same price as my others.I wanted to love them, but I can't.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638403200000}
{"reviewTitle":"Poor steel","reviewDescription":"Single use cartridge as it dulls quickly","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Better if it would remove facial hair.","reviewDescription":"Used single blade razors from the big warehouse for years. Thought I would move up to these based on the reviews. Problem is the Basic 3 blades don't remove facial hair nearly as well as the cheap ones. And don't last as long before pulling starts. Going back on this one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Not the greatest, not the worst.","reviewDescription":"Pretty mediocre razors. Not as close of a shave as I would've liked. I tried these after dumping Harry's and DSC. Both of those brands were better quality, in retrospect. These are less expensive for a reason. Three blade edges are less costly to produce, but once you've experienced a shave with 4 or more blades on the cartridge, you simply can't settle for less. I won't be trying them again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669593600000}
{"reviewTitle":"Does not give you the same quality shave as the name brand","reviewDescription":"I have always used the Gillette Mach 3 Turbo as my razor of choice, however, like many, I got tired of paying their crazy prices for blades and wanted to try Amazon's brand, which with the razors and handle, are a fraction of the price of the name brand.  While they are not terrible, they seem to require way more razor strokes than the Mach 3 and I still do not get as close of a shave.  It feels like the cartridge design does not allows the blades to connect to my face as well as the Mach 3's.  Overall, the poorer shaving experience is not worth the cost savings.  I will be going back to the better designed Mach 3.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620000000000}
{"reviewTitle":"Not quite there.","reviewDescription":"I changed to the Amazon Basics 5 blade razor and like it much better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684886400000}
{"reviewTitle":"Not sharp at all one refill per shave if you're lucky","reviewDescription":"Has anyone at Amazon quality control tried these? Very dull blades, will not cut on a down stroke only an up stroke and only after 2 or 3 passes. Can't use more than once, need a fresh refill each shave. Spend a few dollars more and get a name brand, not worth it at all. I will not buy again","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1661385600000}
{"reviewTitle":"You Get What You Pay For","reviewDescription":"The handle is decent with enough heft to feel of substance.  The blades are TERRIBLE!  The blades themselves are not even relative to the frame so on any given stroke, only a small portion of the blades contact your face.  I was never able to get a complete close shave and went back to my old dull razor to finish up.  Probably worth mentioning I tried with two different blades and had the same issue.  Look elsewhere if you are trying to find an economical razor.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1625788800000}
{"reviewTitle":"Not a good value.","reviewDescription":"I'm always looking for a budget alternative to the expensive name-brand razors and having had good experiences with other Amazon branded items decided to give these try. I was disappointed and won't be buying them again. They were rough on my face and the shave was inconsistent with my tough beard and would leave patches of stubble. If you want to order a budget razor from Amazon, the Dorco razors are a great option.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1634256000000}
{"reviewTitle":"Terrible shave","reviewDescription":"This razor gives a terrible shave.  I used two of the blades thinking one might have been defective.  After I shave and shave again,  I feel stubble in all the areas that I shaved as compared with my former razor where my skin felt smooth.  I would not recommend this product and throwing away the remaining blades and returning to my old blades and razor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1652572800000}
{"reviewTitle":"The first Amazon-branded product I wasn't thrilled with","reviewDescription":"Too late to return.  I gave it two month's worth of tries, but every single shave was pitiful.  Maybe it's just me?  Going back to the expensive brands - never had a bad shave with any of those in my entire life.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1662854400000}
{"reviewTitle":"Blades R Gr8 the handle is terrible","reviewDescription":"I really liked the blades but the handle is total crap.  I struggled to attach a new razor head darn near every time.  Finally today, after 5 attempts to attach a new razor with no luck I threw it all away in disgust.  Do not spend your money on this product unless you love being frustrated first thing in the morning.  I'm surprised because I haven't had any problem with items I have purchased from Amazon but this time they dropped the ball.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1623456000000}
{"reviewTitle":"bad","reviewDescription":"one word BAD","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Just ok not reliable clean cut","reviewDescription":"Misses a lot when shaving not the clean cut I expect like other razors I’ve tried. Will go back to dsc","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687996800000}
{"reviewTitle":"Not sharp enough","reviewDescription":"I've been using dollar store single blade razors (Bic) 5 pack for 1.69 that work well. I decided to try and upgrade to 3 blade amazon type. With three blades it should do better but did not. It was like shaving with tweezers pulling at your face. Not even a close shave as I had to go over my face over 4 or 5 times to get a close shave. My cheap single dollar store blade blow these away. Waste of time.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1623283200000}
{"reviewTitle":"Don’t purchase. Dull blades.","reviewDescription":"Blades feel dull and pull your whiskers.Tried 3 different razor blades and all felt dull and irritated skin.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Dull right out of the box","reviewDescription":"Looked like a good deal to replace the expensive Gillette razors, but these are as dull out of the box as a two month old Gillette razor. Useless","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Doesn't do what it was made for","reviewDescription":"Usually don't write reviews, but was very dissatisfied with this product.  I have to go over the same area of my face several times in different directions trying to get this thing to do what it was made do to.  It feels like decent quality in your hands, but when something doesn't do what it was made for, then what's the use of it?  I guess it would make a good paper weight.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665446400000}
{"reviewTitle":"blades are crap","reviewDescription":"I got one of these to replace an old gilette mark 3. The blades were crap. Drag, pull and tug. NO way would be go 2 days without shaving with this stuff...ITS CHEAP PRICE and even cheaper blades...total waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1681862400000}
{"reviewTitle":"Don't bother buying","reviewDescription":"The 3-blade razors don't work very well. I tried ordering the 5-blade, but ordered the 3-blade by mistake. Went to return it, and it says not returnable. The return policy is the reason I buy from Amazon. I do not recommend this product.CHECK THE RETURN POLICY FOR ANYTHING YOU BUY ON AMAZON FRIENDS!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1667779200000}
{"reviewTitle":"Too bulky","reviewDescription":"The space between the blades and the edge of the head is too wide to get into tight spaces (ie under the nose, side burns, etc.) so I have to use my old razor for those space.  I will not be using after this batch of blades.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1669939200000}
{"reviewTitle":"Terrible","reviewDescription":"This does not compare to Mach 3.  Do not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Is this thing on?","reviewDescription":"I had to make sure the blade was on correctly, as it was severely lacking any ability to shave. It's almost as bad as the electric razor that I use, but at least the electric razor cuts some of the hair. The blade on this thing barely does anything for my beard. I was really hoping for a better outcome, to help reduce the cost. But no luck, this is worthless. At least I only wasted a few dollars.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658620800000}
{"reviewTitle":"These do not work","reviewDescription":"The blades do not cut the facial hair effectively at all. I do not recommend this product at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"Great Blades","reviewDescription":"Great Affordable Blades!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Worthless waste wouldn’t shave a whisker off a watermelon","reviewDescription":"Three blades can’t get through my five o’clock shadow without multiple passes, and plenty of cheap single blade disposables have done three times the job for a third of the price; also, how do people shave under their nose with these monsters? I got a couple of nicks on smooth skin... these are just terribly made blades. SKIP THIS PRODUCT.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1661558400000}
{"reviewTitle":"Piece of crap","reviewDescription":"Handle broke pretty quick. The blades are also not great quality- narrow and you have to go over spots several times to get a smooth shave.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"Why buy","reviewDescription":"Does not give a close clean shave!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Doesn't fit Mach3 handle","reviewDescription":"When I had seen the first picture of the box that these \"Compare to Mach3\", I assumed they would fit on a Mach3 handle. They do not. Come to find out, you have to read the Q&A at the bottom of the listing to see they fit on a Solimo handle.Now it's time to see if it's easier buying one than returning these.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"Product doesn't work","reviewDescription":"I don't know if they'll even post my review because it's negative (even though it's entirely accurate) but here we go. I opened the package and it LOOKS nice, don't get me wrong. For $6 it appears as though you're getting a quality product but that's all it is, smoke and mirrors. I exfoliated, lathered up my limb with foamy soap and made the razor do it's thing. Only it didn't do the thing, my extremity was still hairy and the \"razor\" took off maybe 10% of my hair? I went over the section again and again, pressing harder until it started to feel uncomfortable. Nothing. Don't waste your time. Don't waste your money. You can't even RETURN A DEFECTIVE PRODUCT. I know it's cheap but I basically feel like I had my money stolen from me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1609286400000}
{"reviewTitle":"Very ineffective","reviewDescription":"This is the poorest razor and blades I've ever used. I'll scrape my face with it showering, and I see that beard crumbs are indeed falling off of me as expected, but when I check my face,  next to nothing has been removed. I have to give up because you can only do so much razor-surgery before your face gets too raw to continue. It takes that amount of working before I'm somewhat shaved. Kind of hard to believe that in the year 2000, and Twenty-One 🙄, someone like this are making razor\/blade sets which can't shave a face.We'd may as well get used to this sort of thing, as the flat-earth, \"post-Middle Ages pain management technology is a BAD thing\"🤔 generation take over everything.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1619568000000}
{"reviewTitle":"Not what I expected","reviewDescription":"I was hopeful that this would be an average razor set at a little better price. It is poor. The razors do not shave remotely close. I have a shave like Homer right after shaving. They do not stay sharp for more than one shave. The blades are very difficult to change, I have not experienced such difficulty in 35 years of shaving. The handle is heavy. Not good news quality. Sometimes it takes 2 or 3 of the blades to shave, they dull very quickly.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1671494400000}
{"reviewTitle":"Don't work for my beard","reviewDescription":"My beard has always been tough. Now that's it grey it's even tougher. I had been using regular double sided thin blades. They really only worked once, but were cheap. Then I switched to Harry's, which was great for maybe 2 shaves, but expensive. I thought I'd try these. I was disappointed, my face burns. These remind me of the cheap plastic razors you find at the dollar store or grocery store. Even the first shave was hard, and hurt. If your beard is thick and tough these razors might not cut it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1659139200000}
{"reviewTitle":"Gap between blades and razor.","reviewDescription":"This was my first time ordering Amazon brand razors. I order four blade with my normal brand. The three blade has a gap on both sides of the blades. See picture. I ordered a set of the five blade and was much more pleased with my purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Not bad, but should have went for the 5 blade","reviewDescription":"Update: the more I use these the more I hate them.  They deposit hair clippings all over ny face and I can never get a close shave around my lips and nose.  This is a hard no for me.Original review: This was ok, but did not get as close as I hoped.  I thought I purchased the 5 blade ones.  I will try those next time.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1678924800000}
{"reviewTitle":"Terrible, choose another budget razor","reviewDescription":"Thought I’d give Amazon’s 3 blade option a try after using another economy 3 blade for years. The razors themselves are trash and dull very quickly. 3 months in, the handle broke and no longer will hold blades. Avoid, there are better options","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682899200000}
{"reviewTitle":"fits my head perfect","reviewDescription":"I shave my head every day and this blade is the one I've found that does it well. I only cut myself if I go too fast and get my other hand! I have these  stored up so I don't run out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Just as good as the name brands.","reviewDescription":"Good quality for the amount works just as well as the name brands.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Was worth it","reviewDescription":"affordable and worth it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Good","reviewDescription":"Good dog.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Great for those that loved the Kirkland razors","reviewDescription":"Husband used the 3 blade Kirkland razors before Costco stopped selling them.  He really enjoys using these, but he does need to replace the blades more frequently.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great Product","reviewDescription":"Great private label product IF used with compatable AMAZON razor blade holder.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Was skeptical but great choice for men’s razor","reviewDescription":"My husband is very picked with his razors always had to buy the expensive Gillette ones money was tight so I got these hoping for the best my husband loves them and there 1\/2 the price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Razors fit on and come off handle easily","reviewDescription":"Over all price for the money good, sharp,lasts for quite a few shaves","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"3 blades universal cartridges","reviewDescription":"Like 3 blades cartridges even more than 5-blade ones: it's durable, works perfect on Amazon shave tool","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"It's a nice razor","reviewDescription":"I like the way it shaves me.  And the blades last a long time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Not Very Sharp","reviewDescription":"Blades are not very sharp, need to repeatedly go over an area to get a not so close shave.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"It's no Mach 3 blade","reviewDescription":"Been using Mach 3 blades for years. Thought I would give these blades a try to save $. Not even close. I've shaved several times now thinking it will get better. Nope. Every shave I nick myself. They grip \/ pull the skin to much. Doesn't get a close shave like Mach 3 does. I need to use my electric shaver to get what the blade missed.Will be going back to name brand razor and spend the extra $ for better shave. Now I have a pack of 20 blades I can't return.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"I tried really hard to like these razor blades...","reviewDescription":"As a general rule, I avoid buying Gillette products, not because they're low quality (they're not) or low value (also not) but because I recognize that a portion of every dollar sent to Gillette is used to fund the New England Patriots. I can't have that on my conscience. So when I saw that Amazon was backing a new razor manufacturer, I jumped at the opportunity. I tried really hard to like these razor blades, but I just can't. It's difficult to get the blades onto the handle. The blades look like they could fit either way. Even if you get them attached, at first it looks like you've got it backwards. The little moisturizer strip at the top of the blade is just a little too wide for me to be able to get the blade on the mustache hairs directly below my nose. I inevitably miss those hairs and I can feel them every time I exhale through my nose - that irritates me all day. Finally - and most importantly - the blades just aren't as sharp as Gillette and they dull significantly faster, leading to me having to cover the same area three or four times, irritating my skin. Please Amazon, fix these things so I can try them again!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1653350400000}
{"reviewTitle":"Felt dull, pulled alot","reviewDescription":"The 3 blade razor I've been sticking with for possibly 20 years now has jumped in price yet again!!!  Amazon has a lot of house brand products that are pretty decent and a great value so I thought I would try this.  The handle itself felt exact to the quality and weight that I am used to.  I did the same prep that I am used to and the shave did not feel good at all to say the least.  No cuts, but I ended up using a blade from the previous brand.  Keep in mind I normally would have thrown out the blade I finished my shave with, but it was still better.To be honest, the shave reminded me years ago when I tried a sensitive skin version of the brand I am used to.  I don't know if the angle is changed on the sensitive skin razor or what makes them different.  I really like the price, quality of the handle, and if amazon is listening please change the angles or something.  Send me an email when you do and I will try again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664668800000}
{"reviewTitle":"Maybe I got a bad batch","reviewDescription":"Was not impressed with these razors, didn't last more than a few shaves. I shave my face and head, dulled fairly quickly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Doesnt cut as Mach 3","reviewDescription":"I used this product to shave my head. When I compare the brand new blades with thr Mach 3 head that I have used for several months, it was not shaving as smoothly. Stick with Mach 3.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Bad blades","reviewDescription":"These razors do not cut well, they just pull your hair. Also, the border around the blades is very big which makes it hard to shave with precision and get to tight spaces around the nose etc... I do not recommend these. Only good thing I can say is the price and comfort of handle, but those are not important if it can't cut hair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"very difficult to load new cartridges","reviewDescription":"I can only give this product two stars because of the extreme difficulty of loading new cartridges into the handle.  It requires a great deal of squinting and swearing before the handle can be properly clipped into the new cartridge, and the cartridge forced out of its plastic case.  Once the cartridge is installed, it shaves great, and the blades last a long time.  5 stars for the shave, 0 stars for the difficulty of loading new cartridges.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"does not shave close","reviewDescription":"Hi, I read the reviews and most people were satisfied with this razor Solimo 3-blad?  Some stated however it doesn't shave close. I'm here to tell you it doesn't come close to saving close although it can pass on the first day meaning although you will feel peach fuzz as we call it the face still looks clean. On the second day no such luck.  You begin to see the visible peach fuzz left on your face. The third day using the same blade while you're shaving the peach fuzz shows because you can't get the shaving cream to shave off your face.  In short your face especially if your beard is grey like mine is visible and you can't even shave the cream off your face.  Sure it shaves smooth and you don't have to worry about cuts because the blade glides over your skin and facial hair.  Sure the razor handles well look good but that's all.  You have to be careful with reviews some people will deceive you for some secret discount or work for the company.  Here is the good news, if you change blades every day your shave will have peach fuzz but not visible to the naked eye and truly maybe that is why you get so many blades.Thank youTruth finder","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1625875200000}
{"reviewTitle":"What happened?","reviewDescription":"The first shave with the cartridge that was already installed in the handle...I'm, this is the best shave I've ever had...finally, after a lifetime of looking for THAT razor...here it was! It was so good I got 9 or 10 shaves out of it...ok, 1st cartridge out of the sleeve...huh?...it feels like a store brand...got 3 shaves, all of them C minus...a fluke?...onto the 3rd one...does two establish a pattern?...it does for me, I mean, I got 17 more to go, if so, it was a waste of money! Now, they wouldn't load up the 1st one with an ace...and the rest with duds to take its place?...I'm hoping this is an anomaly but I'm gonna have to wait and see!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"Not what I had hoped","reviewDescription":"When I first saw this product offering and the awesome deal Amazon had going at the time (January 2023), I was excited. I bought two of the 21-packs, which meant I had 2 handles and 40 cartridges. The value seemed insane! And the reviews I read were overall pretty positive so I was looking forward to it.Quick backstory: I've gone through a good number of razor brands and models over the years. For whatever reason, it seemed like after I had used a particular option for a while, my shaves got worse. i.e. Dollar Shave Club was great for a long time but after a while the shaves started sucking. Similar story with Gillette Mach 3 refill cartridges, even when they came from different sources (i.e. Amazon, Costco, grocery store). Tried Gillette Mach 3 Sensitive disposables and those worked pretty good but wasteful\/expensive for regular use. Then I found my way into Harry's 5-blade razors and those work great but a little too close and not sensitive enough (I think 3-blade razors are my thing). Although more expensive than I prefer, Harry's is still my preferred option over these Amazon Basics 3-blade Razors.Onto the Amazon Basics offering... overall I don't like them. The first shave is kinda rough. 2nd shave is actually \"okay\" and makes it seem like the blades just had to break in on the first shave. But then by the end of the 3rd shave it's dragging hard and I have to dispose of the cartridge. Also the blades seem to clog more than any razor I've used before which means it takes longer to shave. So far I've gone through ~30-35 of the Amazon Basics 3-blade refill cartridges so I'd say my assessment is fair.For my use case (decently thick beard, shave every-other-day) I wouldn't recommend these. Even getting 3 shaves per cartridge the value is still reasonable but I'm only still using them to not be wasteful.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"I like the weight and feel of this razor.","reviewDescription":"This razor is worth the money and performs satisfactorily. I believe a 5 blade model would give you a better shave.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Good not great, but still a good value","reviewDescription":"Not as good as the category killer brands but functional and always a good price.  Weirdly, I have to press harder to get a close shave with these.  no nicks though.  Will go back to brand name ones when these are done.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Just okay for me!","reviewDescription":"They work but must be replaced often. I don’t know if it’s better to buy the more expensive razors that last longer or use these. It’s a preference thing for sure. There are only 3 blades so I assume they wear out quickly. I actually didn’t mean to purchase but figured I’d give it a shot","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Just ok","reviewDescription":"⭐️⭐️⭐️","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Just OK","reviewDescription":"for the money it's just ok, I rate it way below the Big Brand. there is no trimmer on back of razor. The handle is cheaply made.. You get what you pay for","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Disappointingly inconsistent quality","reviewDescription":"After using five cartridges, I'm having to completely re-do my review, because I'm very disappointed. The first cartridge, which came already installed on the handle, was of stellar quality, delivering excellent shaves for more than two months, inspiring a five-star review, which I have now been forced to erase. Every subsequent cartridge has varied somewhere between mediocre and miserable. Two of them actually started out duller than the ones they replaced were at the end of their run, which is simply unacceptable. I have fifteen more cartridges left, but I'm not sure I want to subject my skin to them. One thing's for sure. I won't be buying these again.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Razor blades","reviewDescription":"Good shave for the cost","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Two blades feel dull","reviewDescription":"The two blades seem dull and don't cut as skin smooth as I'd like.  It's a good price and handle send strong. B","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Not bad, but not good","reviewDescription":"While I'm aware I have coarse facial hair, these blades last about 2 shaves for me. That's not too good. Gillette blades (while more expensive) last at least 5 shaves for me. That gives you an idea for comparison. These blades are a good deal, but don't expect to much from them if you have coarse facial hair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"not even close to Gilette. worst blades","reviewDescription":"Worst shave. i need to go over my face 4 times just to match what my \/trac 3 Gilette does in one movement. The money that is saved is not worth the pain. Dont buy it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Check if it will fit your razor handle","reviewDescription":"was not explained that the only razor to fit these blades was not gillette or schick. In fact these blades fit nothing I have. I am not inclined to spend additional money on this prodouct.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Can’t replace blades","reviewDescription":"This thing is straight garbage. It’s impossible to set another blade on it. Trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Dull blades","reviewDescription":"Maybe the worst razor blades I’ve used in years, maybe since the safety razor when I was a kid. Amazon is usually the best but they need to check into these. Threw them away after two tries.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"false ad","reviewDescription":"THIS IS NOT A GOOD RAZER ADVERTISED AS 3 BLADES ONLY HAS 2","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Better to cut it with a butter knife","reviewDescription":"I just tried these blades cut worse than using my dull bic blade. Don’t waste your cash  just to get a rash.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Junk !","reviewDescription":"Cheap garbage and they sent it out knowing it’s junk refused to fix make you jump thru loops  beware with Amazon brand","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Godawful...","reviewDescription":"The product came in as described but these are the most pathetic blades I've ever used. I rarely review my purchases but needed to say something about this one.I ordered these because it seemed to be an amazing deal and I've always had good experiences with Amazon Basics products. The handle looks and feels fine but I go through 2-3 of the blades per shave. I've somehow gotten razor burn every single time I've used these. It's possible that I somehow just got a garbage batch or something like that but I'm definitely disappointed.Taking recommendations on decent, affordable blades!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"Terrible","reviewDescription":"I really don’t review products, but this deserves public awareness. They are almost completely useless. Somehow you can use them to shave and then you’ll look yourself in the mirror and it doesn’t look like you’ve shaved at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Ugh. Poor quality product.","reviewDescription":"It’s not a Mach-3 quality replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Not a close shave at all","reviewDescription":"First the handle is a pain to attach to the blades. I got past that only to have the shave no where near to close. A total waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Item does not work with Mach 3 razors","reviewDescription":"This item is either falsely labeled or someone does not understand what the Mach 3 product looks like. These cartridges in no way, shape, or form are able to attach to the Mach 3 razor. The socket does not match Gillette products. I was able to easily get a refund, but look elsewhere if you are considering buying off brand, or just buy Gillette's refillable razors.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Worst! Time consuming","reviewDescription":"This quality, construction of this blade is excellent. The biggest flaw is that the blades are so closely placed that the hair gets stuck and we constantly need to rinse, re rinse (waste of time and water)The other thing is the blades are mounted towards inside therefore it doesn't make good contact with skin and you need to run the blade several times in order to get a clean shave which still leaves patches here and there.ALL THESE ISSUES DON'T EXIST IN THE GILLETTE MACH 3.Therefore going back to expensive mach3 unless this manufacturer addresses these issues.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"These razors SUCK","reviewDescription":"I have never had such an uncomfortable shave as I experienced with this razor","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"The worst","reviewDescription":"Don’t buy.  Impossible to reload blade.  Not nearly as smooth as Gillette","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Bad blades","reviewDescription":"These are terrible, they pull on your face, not sharp at all!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Not worth the aggravation","reviewDescription":"Cheap cheaper cheapest.Difficult to snap blade. Blade comes off easily.  Not a clean shave. You get what you pay for.  Staying away from the 3 blade. Junk","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Like shaving 30 years ago","reviewDescription":"I’ve tried several brands of razors recently because the three bladed brand I’ve been using for 25 years now costs nearly $10 a week to shave. I’ve used several of amazon branded products now. Some are really good, some aren’t, but these were, in my opinion, the worst of amazon brand products I’ve tried. These are the worst of the razors I’ve tried recently. They scrape me. They feel like razor blades did before the 3-blade ones came out in the 90s.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Too good to be true","reviewDescription":"Got tired of paying loads of money for the Gillette Mach 3 blades, so figured these blades would be a affordable alternative. Not even close! These are the worst blades I've used. They were dull and did not glide smoothly over my face. My worn Gillette blade finished my shave with a closer cut. Going back to the pricy Mach 3 blades. At least they work!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Horrible","reviewDescription":"So I tried switching from Gillette in hopes this would be more economical and let me say…don’t do it!!! Horrible razor burn it’s not smooth at all and you’ll end up regretting ever switching just to save a few bucks.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"New go-to razor","reviewDescription":"I've tried them all and this is bar far the best razor I've owned. After owning single blade disposables, double-edged, double, triple, and 5 bladed razors....this one stands alone.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Smooth","reviewDescription":"I have been looking a inexpensive alternative to the pricy brand names , i have tried many different razors but this one really does the job . I have been using the same cartridge 3 weeks and in still works good . Many times i need a quick shake with out soap or lather and it still works good . I'm sold .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Pleasantly Suprised...","reviewDescription":"I bought the 3 blade razors. I am bald so I do a bit of shaving and I am pleasantly surprised with this set. Works very well and the blades last longer than I expected. I seem to always have an issue rinsing the 5 or more blade systems but these rinse well.Planning on purchasing again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Sure works as good as Gillete & much better price","reviewDescription":"Does a nice clean shave & price is right! The only proble was getting the blade cover off","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Always smooth","reviewDescription":"Always gives a smooth, cut with no issues and the blades last a long time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Fantastic Blades","reviewDescription":"They are sharp and stay sharp for a long time. I have yet to cut myself. Absolutely the best I have used at a fair price. The handle is sturdy and well made. You will not be disappointed. Much better than the name brands.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"excellent product overall!","reviewDescription":"An efficient product at a very good price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Great find","reviewDescription":"My husband had been looking for replacement blades for his razor that he had for a long time and the store quit carrying them, so he looked for an affordable and effective replacement razor and decided on these. He told me that they were the best razors he's used in forever and better than the more expensive name brand stuff.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"no nicks, good smooth shave","reviewDescription":"Well, I have been using this with the 3 blade cartridge.  I like the feel and I have not nicked myself in several shaves.  I have always had a problem with other brands with nicks. Great job guys!4 months now and still no knicks,  Took about a week to get used to the razor handle because it is a different design but shaving is great!  Thanks guys!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Better than Gillette, With No Moral Lecturing","reviewDescription":"I got tired of Gillette whining instead of trying to sell me a razor.  I tried these, and found they gave a better shave, with a more ergonomic grip, cheaper. It took a bit to get used to the cartridge mechanism, but it works fine.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"A good value triple blade razor","reviewDescription":"I've used Mach3s for many years so I admit my bias.  I tried this razor because of the great value.  Functionally everything works well and I'll probably stick with it.  Three things I've noticed:  1) the blades are thinner and spaced much closer together versus the Mach3; this has the affect of requiring more pressure to get a close shave and you need wetter\/thinner shaving creme on your face; 2) the angle of the blades is shallower versus the Mach3 which is another thing that makes getting that close shave just a little more difficult; and 3) the cassettes are very wide making it difficult to shave completely under your nose; I have to go back with a trimmer to get those last few hairs every time and it's annoying.It's a good value and you can get a decent shave with it but, though it may be safer for folks who don't have good technique or finesse, the Mach3 has a better blade design for a close shave.  For me the whole fancy swivel head thing is a pointless gimmick.  I'd be willing to pay a couple bucks more for a slightly better blade design.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1604707200000}
{"reviewTitle":"Bought these for my lady’s razor - FAIL!","reviewDescription":"Ok.  I read a review where these are cheaper than the lady’s version, so I thought I’d give them a try.  Epic fail!  These do not even compare to the lady’s version of cartridge replacements!  I could shave without any shaving cream with the lady version.  The men’s feel like I’m dragging a piece of rubber along my leg!  After a few attempts to shave, I did decide to try with shaving cream.  They do a fine job with shaving cream, but I will not be buying these as a substitution again.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1665187200000}
{"reviewTitle":"Non-disposable razor","reviewDescription":"The the box says you're supposed to get 20 blades but only received 16. So where's the other four?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684022400000}
{"reviewTitle":"Good price; a little heavy","reviewDescription":"A bit heavy and not as good as the product it claims to replace …","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"Disappointing Product.","reviewDescription":"Like: Packaging is straight-forward, and not difficult. Slip the razor handle into the new blade, click it out of the plastic holder, and now it's ready. Almost.Dislikes: it's not easy to tell this three-blade razor refill from other competing products, and which handle fits which blade refill. I bought other refills and handles, but only one handle fits this refill, and all handles look alike! So I now have a set of difficult handles and their \"orphaned\" refills, but none of the handles seem to fit the refills I bought for the Soligor handle. So it's a three-star rating overall, one for non-differentiation of the handles, and two for trying to please the customer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636761600000}
{"reviewTitle":"Better than the 5","reviewDescription":"Better than the 5 blade. Not as good as the mach 3.  Plucks hairs. Not worth the savings over the mach 3","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678579200000}
{"reviewTitle":"Spotty shave, handle also works with Solimo 5 blade carts though","reviewDescription":"I want to give this razor credit for having a pretty satisfactory handle, and the expanded head motion (which wasn't a feature I was really looking for) seems to compliments my shaving technique well. Unfortunately despite those points I was still left with a rather choppy shave which was simply unacceptable to me. I'd say the problem is the blade spacing but it's not impossible that these carts simply aren't a good fit for me.This was also still better for me than the variety of cheap bic razors (which still cost more than this on Amazon) I tried out right before this, so if you're using something like a Comfort 3 or generic disposables and they're almost good enough for you then this might work out.  For the time being I've actually settled on the Solimo 5 blade carts (which this handle works with) and am reasonably satisfied with them for whatever that's worth...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1587772800000}
{"reviewTitle":"Twice","reviewDescription":"The first batch I got I told myself these are the best. They cut close and left me clean shaven. On the second batch I must have got some dull blades, Even after a new blade I am left with a lot of stubble. I will use up what I have left and probably not buy this brand anymore. Its a shame as I really liked them","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665360000000}
{"reviewTitle":"Decent but not great","reviewDescription":"Typically use Gillette razors, thought we would give these a try since those have gotten more expensive. hHusband did not like them. He said the handle is a little too large and not comfortable to hold and razors were only sharp for a couple of shaves. They were cheaper but not cheap enough to only get one, maybe two shaves with one blade. I’ll stick to the Gillette.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"Not too sharp","reviewDescription":"The price is good, but these razors are not as sharp as name brand razors and tend to pull\/tug and cut the face a little more than name brand razors.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Not as good as Mach 3","reviewDescription":"I got it since it was much cheaper than our Mach 3 refill but unfortunately it was not at all better. Super bulky and doesn’t maneuver as well as the Gillette mach 3.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1594080000000}
{"reviewTitle":"Not my favorite razors.","reviewDescription":"Had to buy a replacement hand because the other on I had broke in the first month. I don’t plan on buy these again for myself.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"Works ok","reviewDescription":"Overall pretty good and cheap product. However it doesn’t shave very well. I would choose other brands over this one. But for a cheaper brand, it does it’s job","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1580860800000}
{"reviewTitle":"Check your order when received","reviewDescription":"3 stars because I ordered the three blade refills but I received the four blade refills.  I didn't realize the mistake until weeks later when I needed a refill.  The four works but not what I ordered.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1570147200000}
{"reviewTitle":"Three blades are okay. But 5 blades are much better","reviewDescription":"Just realized that they are three blade and not five.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Very hard to line your beard up with these, other than an ok shave","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622678400000}
{"reviewTitle":"Okay for the price","reviewDescription":"They work well just can’t get in close.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1630972800000}
{"reviewTitle":"Good razor, lacking third blade.","reviewDescription":"Really good razor. I’ve been a Dorco user for quite some time and this is comparable. Only complaint is I only got 2 blades, not three.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577664000000}
{"reviewTitle":"They’re ok.  Not the closest shave in the world though.","reviewDescription":"Mediocre shave","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Better than Gillette","reviewDescription":"Good value for the money.  Better than Gilette, would be better if this was an American made product.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1584748800000}
{"reviewTitle":"Not what I was hoping for","reviewDescription":"Not a close shave and feels clumsy and bulky to hold","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651795200000}
{"reviewTitle":"Good but not great","reviewDescription":"Handle is good, 4\/5. It has decent weight and balance. Material and craftsmanship feels good.Razor has room for improvement. It's comfortable. However, If Gillette proglide is a 5, this would be 3. It just does not give me a close shave like proglide or mach 3 turbo.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584921600000}
{"reviewTitle":"Just Ok.","reviewDescription":"Not a big fan of these blades. While the handle is nice the blades just do not feel sharp enough. Also the cartridge itself is rather thick this makes it hard to shave under nose.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616630400000}
{"reviewTitle":"Get what you pay for","reviewDescription":"They’re inexpensive, however it’s extremely difficult to get the blade on and if it falls from a low height, the blade pops off and is almost impossible to clip back on.I’ll be spending a bit more for a better razor next time","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"solimo razor 3 blade","reviewDescription":"never expected to be a difference in 3 and 5 blade razors.....there is","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635033600000}
{"reviewTitle":"Blades Could Stay Sharper","reviewDescription":"The razor is a good value, though the blades could stay sharper longer, though the design is very comfortable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629158400000}
{"reviewTitle":"Cheap","reviewDescription":"The price is low but don’t seem to be as sharp as Gillette or Schlick razors.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631232000000}
{"reviewTitle":"🤔","reviewDescription":"The blades are useless dull not a smooth shave I will get rid of it. Would not recommend or buy again","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625788800000}
{"reviewTitle":"Good for about 4 shaves","reviewDescription":"I can get about for shaves before they are too dull to use. Not worth the money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634688000000}
{"reviewTitle":"Not for me","reviewDescription":"Just doesn’t work for me.  Neither do off brands or Harry’s, so it is definitely my scruff.  I go over my face multiple times and can still feel stubble.  Have to press harder then normal so ending up with scrapes.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576540800000}
{"reviewTitle":"Sharp!  Great blade, cuts well and lasts long","reviewDescription":"I bought this to replace my mach 3 razor.  This is better, so sharp and comfortable and it lasts a long time.  Perfect clean shave every time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"DIFFICULT TO PUT TOGETHER","reviewDescription":"The blade is very difficult to put onto the handle.  Can be used once. It get dull","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"price","reviewDescription":"works great good price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"High quality but not expensive","reviewDescription":"Nice smooth shave but the price is about half of what the name brands want. I am extremely pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great Quality!","reviewDescription":"These Blades are Great for Generic Blades Great Price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Good bargain, Great razor set.","reviewDescription":"Fantastic 2-blade razor set at a very reasonable price. Ships fast. Good feel, close shave.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"The 20 count package is a great value for your hard earned money!","reviewDescription":"I am signed up for the subscribe and save option for these and buy the 3-blade 20 count package.  That makes these even less per blade.  At well under a buck per blade these work quite nicely on my 50 yr old whiskers.Not sure why anyone would continue buying the name brand ones after trying these out.  I get about 3 shaves per blade and then toss them since they are so cheap.  They do tend to dull a bit after the 3rd shave which is also typical of the big brand name ones as well.The handle has a little weight to it so it feels good in your hand \/ fingers.  It has a somewhat soft rubber applied to the handle that makes it easy to hold and maneuver around your face. The blade head pivots enough to fit all the contours of your face with ease.Not much else to say about these except give them a try and see for yourself.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"Smooth","reviewDescription":"Very close shave","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"UNBEATABLE","reviewDescription":"I'm one of those guys who hates having to pay 3 to 4 dollars for a single blade that is over engineered.  A blade with 5 cutting edges is too big and is ridiculous.  I've tried most of the lower priced blades out there and found them disappointing.  Poor quality, don't hold their sharpness beyond a a single shave, cheap feeling handle, etc.  However, when i tried the Amazon Basic 3 blade I finally found what I was looking for!  Well made, sharp blades, a price that hard to believe, and a good hefty feel to the handle.  Plus the 3 blades suits me perfectly.  The blades are long lasting and sharp.  Simply these are best low cost blades I have tried....and believe me I've tries a lot of them!  Try them and I'm sure you won't be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1690675200000}
{"reviewTitle":"Great deal!","reviewDescription":"I pretty much have to shave every day to be clean-shaven. Of course I have a very fast growing beard I can get three shaves out of one blade before I have to change it and I have a very close beard so this is really a super good deal just do the math and you can see a good deal this is","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"As good or better than expensive brands","reviewDescription":"Decided to try these Amazon basic razors because the price is good.  I've now found my new razors as ill be using this brand from now on.  They're as good,  maybe even better?, as top dollar razors out there so it's a no brainer for me","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"The duel lubricating is great","reviewDescription":"Shaving my face. like the three glad cartridges and the feel of the razers when using it .very easy to handle","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Great value and quality","reviewDescription":"This product is good quality and beat value for money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Best Razor Ever","reviewDescription":"I would always cut myself but this curavable razer is amazing","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Good price","reviewDescription":"Excellent razorsWorth the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Great quality","reviewDescription":"Love these razor blades they work so well. I have these refill blades even set up on auto ship that come every 3 months and they work well. I use them my husband uses them my dad uses them and never get razor burn the qualities great. The quality of the actual handle of the razor is sturdy and heavy and good quality not cheap at all definitely last a long time with all the refill blades.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Opinion","reviewDescription":"Great razor for the price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"A Crazy DEAL- I'm impressed!","reviewDescription":"I refuse to pay the Gillette prices, i've purchased every multi blade razor deal out there, Dollar Shave Club, Harry's, and the Amazon 5 blade razor.  To be honest I find the Amazon 5 blade much better than everything and the price for 16 blades + a handle and 1 more blade at $20-$25 has been fair given it has been the best of all that I've tried.  Last night I was shopping for refills and found that 12 packs of 3-blade cartridges were around $2 when purchased through Amazon Fresh, that was too good not try, I was hoping that they fit my 5-blade handle which they do.  I shave every 2-3 days, have an average beard, and at $0.21 per blade I needed to try one out this morning.  It's not quite as good as the 5 blades (I'd say 90%) however, its still great, lubrication is great, the blades were sharp and my face was smooth and nick-free.  The only question is how many shaves I can get from a blade but today, I feel like I struck gold.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Great razor","reviewDescription":"Used with an electric razor, this razor last all week.  Does not easily clog.  Sturdy and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Excellent sharing","reviewDescription":"Clean shave","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Unhappy with it's performance","reviewDescription":"I guess I was expecting a little more from this Amazon Basics brand. The blades dont last very long. But the razor handle does feel good & solid. However, the blades go dull fast And the tendency of clogging fast. However, we all learn from our mistakes and this is one of mine.Not worth it., Save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1652832000000}
{"reviewTitle":"ineffective blades","reviewDescription":"I had high hopes with all the high reviews but these didn't work for me. these are great if you like re-shaving the same area 6 or 7 times.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"Not good","reviewDescription":"Not a direct Mach 3 replacement very disappointing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"1 shave then trash","reviewDescription":"1st time use was acceptable but the 2nd shave was more like a Scraping!  My face is still sore!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1685318400000}
{"reviewTitle":"Need a refund","reviewDescription":"The blades were dull and the razor was awkward. It was advertised as satisfaction guaranteed and I am having a hard time either returning or getting a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Bad","reviewDescription":"Not very good razor blades","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"These razors are horrible","reviewDescription":"The original razors were awesome I went to order again and they have these new ones and they don’t shave as good and I am going back to the hydro 5 razor blades these razor blades suck! Yes you save about $10 but you can’t get a decent shave so what’s the point!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1652400000000}
{"reviewTitle":"NOT FOR ME","reviewDescription":"I really do not like these razors.  They don't shave close at all.  I do better using the cheaper disposable ones at CVS or Walmart.  Will not buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Did not like at all","reviewDescription":"Would not buy again. Gave it a fair try. Used half the blades but my face can’t take any more. I had to use two blades every time I shaved. Rough on my face. Not a close shave at all. Pulls the hair instead of cutting it. I do like the handle but that’s it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1631491200000}
{"reviewTitle":"Blades Are Dull","reviewDescription":"I'm not sure if what I received were old stock but the blades were dull. I had to replace them every day and went through my order in less than a month. Every time I shaved (and I used shaving cream), I had to make 3-5 passes to cut the hair on my face, and even then, I still could feel some facial hair when I ran through my hand over my chin and upper lip.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1610496000000}
{"reviewTitle":"Not compatible with Mach 3; don't last very long","reviewDescription":"Despite the advertisement that says \"Compare with Mach 3,\" these blades do not fit on any Gillette handle; I had to buy a compatible handle made by Amazon as they would not accept returns for the blades. Also, I can get just about any blade to last 4-5 months by shaking them dry and storing the razor away from the shower. That is not the case with these blades as I went through my first blade in just 15 days and I'm about to replace my second blade after another 15 days.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Dull","reviewDescription":"The package that this razor was in said to compare it to a mach 3, so that is what I will do. It feels like a Mach 3 after 4 shaves. It's not any where near as sharp. It feels more like it's trying to pull the hair out rather than cut them. The search continues for a cost effective razor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"For use only on the lightest of beards\/hairs...","reviewDescription":"Yeah these are just not good... I don't have a particularly tough beard and these struggled to give me a clean shave... Lots of going back over spots, etc.  The blade is only good for maybe one or two shaves.  Not really a value.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Go with the gillette for a much better shave","reviewDescription":"Definitely won't buy this again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Fair, not good","reviewDescription":"Comparison of this product to the Mach 3 is not good.  The handle of this product does indeed swivel, that does not make it better, it is simply a feature shared.  It does not stay sharp for as long nor does it shave as close as the Mach 3. Using it I felt that I had to go over my face with more stroke to get a good shave.This product is less expensive, if that's your only criteria....buy it.  I will not purchase it again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686096000000}
{"reviewTitle":"Terrible shave","reviewDescription":"I had one of the Harry’s razors.  It was good, but I left it in a hotel shower.I bought this set.  Using these new blades, my first shave feels like the 10th with same blade.  Very rough shaves, not up to par and I will not buy more.Yes my beard is heavy and coarse.  These blades can’t hack it.  Ugh, disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687478400000}
{"reviewTitle":"Worst razor I ever used.","reviewDescription":"I purchased these razors to save money over Gillette. These blades did not cut my beard. I had to go over the same area 3x. To late to get my money back. Hopefully if you buy one you will get better results. My wifes lady razor did a better job. I gave 2 stars because of the lower price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Doesn't work well for me","reviewDescription":"I don't seem to have any luck with 3 blade or more razors and this one is no exception.  I just can't seem to get a clean shave and it makes it really hard to get some of the spots on my face.  Additionally I have to go back over my face getting areas that it missed.  My two blade will get all of that with no issues.  So I am going to throw it away like all of the others I have purchased.  If 3 blades work for you, this might be fine, but this one and several other brands do not work for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679702400000}
{"reviewTitle":"Not a mach 3","reviewDescription":"Maybe 1 use for each blade. I'm going to a straight edge by leaf.. ordered both razors got 10% off $120 but can use regular blades that cost pennies. The cartridge market has terrible blades. Hopefully this new system works.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Not close shave","reviewDescription":"I bought the 3 blade option due to good value. It's about half the price of my normal Schick 5 blade brand, but it definitely doesn't give a close shave and tends to pull.The blades appear to have a large gap in front and behind the 3 blades. I think that might affect performance and increase the pulling of the blades. It's an unusual design since most safety razors don't leave large gaps, particularly in front of the sharp leading edge.I can't say how long the blades will last, because I just started using them. That's one of my other concerns since I've had trouble with off Rand rasors in the past not holding an edge for more than a couple shaves.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1647648000000}
{"reviewTitle":"Cheap, but doesn't last or stay sharp","reviewDescription":"I've used Gillette Mach 3 for a long time and I like everything about it except for the high price, which keeps getting higher.  So, I saw these Amazon branded razors for a pretty good price; however, these razors won't even last half as long as my older Gillette razors.  These are a fail and I won't be purchasing again.  The quality of the handle and swivel mechanism are also poorly made.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Decent for the price.","reviewDescription":"You get what you pay for with these razors.  They dull fast and don't shave you close enough.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Not worth it!!","reviewDescription":"Got it as a part of amazon prime days at a discounted price but when I used it it was still not worth it!!Very rough to the skin and even fresh blade seems like it cannot be used after 2 or 3 shaves. I have been using Gillette  \/ Harry’s  product but this is no way near. Another disappointment was i tried to return this product after buying but amazon didn’t let me to return this and thus end up using this product.Still not bad for a back up option just incase but not for regular use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662336000000}
{"reviewTitle":"Disappointingly dull","reviewDescription":"Sadly, I was disappointed with the sharpness of these blades. I usually use Dorco razors. Compared to the Dorcos, these blades have a hard time cutting and require 2-3 more passes. On the plus side, Amazon's return policy is amazing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Ok I guess","reviewDescription":"Blade seems dull after only a few uses. Won’t buy again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Dull blades and non-returnable","reviewDescription":"Dull blades and non-returnable - so basically a double whammy.  Now calling customer service to see if they will issue a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Gillette is very expensive and rightfully so. But if your tired of paying $45\/12 Refills, prepare yourself for a far lower quality blade.Cons:-These razors do not have the singular blade that I'm used to on the back of the Gillette razors, I miss it ;( ...less precise.-The blue gel stuff leaves an inappropriate sticky residue, more noticeable than Gillette.-These will cut your hair, but it may take more strokes than Gillette (even w\/ the 5  blade).-Leaves razor bumps quite oftenPros:-You get what you pay for.These are not great, not good either. They meet the bare minimum requirements for a shaving tool in the 21st century. I would not recommend these. Stick with the name brands or look elsewhere (not Solimo).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632009600000}
{"reviewTitle":"Ok for daily use","reviewDescription":"These razors do not shave a man if the beard growth is more than 24 hours. Not good for every other day or more","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Dull","reviewDescription":"This is my second purchase of these. This batch also fulls after 1-2 uses, and doesn’t seem to work all that well for the initial use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"Hard to get connected","reviewDescription":"Good shaving but very hard to get connected. I will not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Razor blades","reviewDescription":"3 blade vs 5 blade. I've used them both and got a great shave from both. Nice alternative to Gillette. Personal I like the 3 blade better. It seems to give more room between the blades to grab and cut the hair. Just a preference, both work well and last a decent amount of time, depending on the toughness of you beard.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Smooth cartridge shave for near DE prices","reviewDescription":"I've been shaving with a double-edge razor, brush and lather for years, because of the unbeatable prices of double-edge razor blades.  But of course, double-edge shaving takes lots of preparation, time and care in order get even a passably close shave without nicks and razor burn.  Cartridge razors are smoother, faster and easier, but prohibitively expensive.  Until now.I've used the Solimo three-blade twice now: once with my lather and mug, and once with just plain old soap.  Each time, I got a closer, smoother, faster shave than I could ever hope to get with my double-edge, with no risk of cuts.  And with cartridges at less than a $1 a piece, I can finally save time shaving without wasting a ton of money.The build quality and hand feel is, in my opinion, just as good as my old double-edge or the Gillette Mach 3.  The handle is substantial and heavy.Lastly, don't let the cult of double-edge shaving fool you.  It's utter nonsense that a double-edge razor gives you a \"closer\" shave than a well-engineered three-blade cartridge.  A double-edge is putting a bare razor blade against your skin and dragging: a cartridge keeps a steady angle, perfect depth and has lubrication strips on the top and bottom.  All the double-edge has going for it is nostalgia.  Sometimes, modern technology really does build a better mouse trap.  And Amazon built it for less.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1596758400000}
{"reviewTitle":"5 stars","reviewDescription":"5stars","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"As good as Mach 3, maybe better..","reviewDescription":"The Gillette Mach3 has been my standard razor for more than 10 years, but at (Costco's) price of $46.99 for 20 (and even when discounted are still about $38\/20), I've been shopping for a substitute. The Kirkland 3-blade was pretty good, but would pull and catch when new. I've tried Schick, Bic, disposables, generics, and nothing could surpass the Mach3. Until I tried these Solimo 3-blade razors. $16.39 for 21 razors and a handle is less than 1\/2 the Gillette price. And, I got a smooth shave with no nicks and no pulling or catching on my stiff and thick beard. The handle isn't bad, but has some exposed \"chrome\" that can be slick. I just needed to change my grip slightly. Do yourself a favor and give these a try.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1658966400000}
{"reviewTitle":"Quality","reviewDescription":"Cut well highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Best razors ever!","reviewDescription":"Just purchased and could t be happier. Shave head\/face daily and have used everything from Gillette Fusion, Schlick Hydro, DSC and Harry’s. These seems to blow them all away and at least half the cost. Handle has nice weight and great swivel in the cartridge head!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"Great Clean Shave","reviewDescription":"Great Clean Shave, second time ordering, nice heave razor, easy to swap out blades.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Quality","reviewDescription":"Best razors for the money. Close shave without irritation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Great first impression...","reviewDescription":"Well, so far I'm pretty impressed.I only shave with water while in the shower, and this razor handles that with no problems.  I know there are other people who say they cut themselves a lot with this...but I am guessing they do not know how to properly shave, were in a hurry, or were caught in an unfortunately timed earthquake.  Everybody's facial hair is different, of course, but as long as you go with the grain on the first pass, this thing performs like a champ.  Zero cuts, even without shaving cream.The handle is much bulkier than the Mach 3, which took a little getting used to, but arguably makes it easier to hold on to in wet environments like your shower, a Polynesian jungle, or the deck of your deep sea fishing vessel.There is not as much plastic around the blades as there is on a Mach 3, so it makes it much easier to shave in tight spots, like right under my nose.  It seems like a closer shave than the standard Mach 3, too.  It has been 24 hours since I last shaved and I just barely have stubble again.The only thing that remains to be seen, as far as I am concerned, is how long the blade lasts.  I shave, on average, every other day, and a cartridge from a Mach 3 will typically last about a month before I need to take out a bank loan to replace it.  Given how cheap these are, though- even if they do not last as long, they seem like a solid investment.I really do not think you can do wrong here.","isVerified":true,"ratingScore":5,"reviewReaction":"50 people found this helpful","country":"United States","date":1566086400000}
{"reviewTitle":"Excelente calidad","reviewDescription":"EL rastrillo me parecio de excelente calidad en cuanto a los materiales y el diseno. El filo de las navajas no duran tanto como otras marcas pero en general esta muy bien.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Horrible","reviewDescription":"I've used these for a couple of weeks now.  I first thought that the bad shave was due to a possible bad blade.  I tried another.  Then, I tried another.  The only way I could get an okay shave was to press the blade hard against my skin.  It's as if this razor and blade cartridge was designed for someone who doesn't know how to properly use a razor.  I get a better shave with the bulk 100 pack of Personna brand twin blade cartridges that fit the Gilette Atra razor.  This was just a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"DULL RAZOR BLADESPro","reviewDescription":"These blades were so dull I could not use them!! I would not buy this product, I am returning them","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Worst blades ever!","reviewDescription":"These are the worst blades I have ever used in 70 years of shaving.  And, you can't return them!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Glide over the face without giving a close shave.","reviewDescription":"The rotating head requires significant pressure to bring the blade into contact with the skin.  Too little pressure and the blade cuts the hair too long, too much pressure and the blade nicks and scrapes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Bought by mistkae - these are NOT Mach 3 replacement blades.","reviewDescription":"No issue with product, cheap and serviceable, but beware, these are not Mach 3's.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Crap knockoff gillet razors","reviewDescription":"These suck. The blades are spread out so it’s easy to cut your skin.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Cheap imported product!!","reviewDescription":"Does not work. The lubricating strips shredded after using 2 times. What a shame.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Poor Shave","reviewDescription":"I was here for the same reason you are…trying to save a buck.  My beard is average, certainly not heavy.  Having used both Schick and Gillette blades with satisfactory results I thought I’d give these a shot and save some money.  Sound familiar?  Big mistake.  With these Amazon blades at least it it looked like I’d shaved but that’s about all.  You will never get a close shave.  Even backstroking won’t get it done.  And this comes at the price of some discomfort in the process.  They also don’t last as long which figures into the bottom line.  Naturally I was committed in using them up because like you I’m frugal.  Thankfully I’ve served my time, with apologies to my poor face, and now I’m off to the store for a return to a close and comfortable shave.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1678147200000}
{"reviewTitle":"Bad choice","reviewDescription":"I have been using Gillette Mach 3 for  the last 15 years but recently I decided to try this Amazon’s blade and it was a big disappointment. I can use it only once and that’s it while  Mach 3 would give me at least 4-5 shaves.Switching back to Gillette Mach 3  regardless of the cost.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Stick with the 5 blade style","reviewDescription":"Thought I would save a couple bucks by going with the three blade style. Bad move. The 5 blade option is much better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"You get what you pay for .","reviewDescription":"3 shaves and they are done, it must be a lady's razor. I will give them to my girlfriend and stick with  MY MACH 3 'S.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Horrible product","reviewDescription":"This has to be the worst product I have ever purchased on Amazon. I take chances with new things on Amazon and am almost never surprised by poor quality. These razors are flimsy and do not stay in the razor handle. I didn’t use them until yesterday and sadly I’m passed the window of return. Do yourself a favor and do not buy this inferior product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Not so great","reviewDescription":"Feels like the razor pulls and drags on my face like a dull blade. Disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Very uncomfortable shave","reviewDescription":"This is the most uncomfortable shave ive ever experienced,and very difficult to load blade","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Not sharp as expected!","reviewDescription":"It's an average razor. It's not as sharp and effective as it should be. After the second shave, I need to throw the blade.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Not happy with the razors","reviewDescription":"These razors constantly make you think that it’s time to change the blade again. I just thought so today when the blade felt like it was really irritating my skin - only to remember that I had put a new blade on just yesterday (and not shaved with it yet).Honestly - what am I supposed to do with a razor that feels like it rips my skin open on the very first shave? These are a total waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"Junk","reviewDescription":"Junk","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Read the fine print!","reviewDescription":"Had to discard. Not returnable! Thought it could be used in Gillette product. My bad!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Worst blades I ever bought","reviewDescription":"It just sucks! Somehow everytime I shave later on a can find spots It missed specially corners. The blades also falls off the handle sometimes when shaving. Don't buy!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"NOT for Gillette Mach 3 razors","reviewDescription":"These blades do not fit Gillette Mach 3 razors.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Great value, not a very good shave.","reviewDescription":"Sadly disappointed. Certainly a great value I won't argue that but nothing about it was designed to give a good shave.The head swivels way to much, some may find it useful but it makes it a pain to get ya upper lip n sideburns.The bottom of the handle is very light and the top is heavy...opposite of what you want in a razor.Meh, great value for the money. Not a very good shave though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584144000000}
{"reviewTitle":"Larger and heavier than standard razors","reviewDescription":"I bought this razor to try a less expensive option to Gillette Mach 3 handle and blades. Both the handle and blades are larger, heavier and less comfortable to use than the Gillette. While the price is a good value, it won't be worth buying these in the future until they streamline and lighten the design.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618099200000}
{"reviewTitle":"This razor works just as well as the Gillette three blade disposables.","reviewDescription":"This razor works just as well as the Gillette three blade disposables.  I like the heft of the handle but it is more difficult to hold without slipping than some others I have used.  So far I am generally happy with my purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626652800000}
{"reviewTitle":"ok if you shave every day, other wise it irritates","reviewDescription":"had better","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669507200000}
{"reviewTitle":"run of the mill performance","reviewDescription":"This razor gives a comfortable, safe shave , however it does not shave any closer than my old style safety razor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649980800000}
{"reviewTitle":"Not satisfied","reviewDescription":"These blades did not stand up to use, they got dull very quickly, I have a very thin beard and I was lucky to get one shave per blade","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"yes but...","reviewDescription":"blades ok blades too close.. very different to clean","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660694400000}
{"reviewTitle":"Worth a try? Maybe.","reviewDescription":"No quite. It pivots too far from skin and doesn’t give a close enough shave. I believe because of location of “hinge” located at the end of razor. I’ll have to try with old fashioned shaving foam. Sometimes less slick foams allow for closer shaving depending on the razor. This is the 3 blade razor. Haven’t tried 5 blade.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1587513600000}
{"reviewTitle":"Nice Price, but....","reviewDescription":"Pricing was excellent.  But I find replacing the cartridge to be more difficult than others.  Blades don't seem to last as long as  my previous brand.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628467200000}
{"reviewTitle":"Not dab","reviewDescription":"Yup it shaves you","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654905600000}
{"reviewTitle":"Not the best, not the worst","reviewDescription":"disposable blades work better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1570579200000}
{"reviewTitle":"Good","reviewDescription":"Nice basic Razor","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1568764800000}
{"reviewTitle":"I thought I was getting a 5 blade razor. Works ok but not as efficient.","reviewDescription":"When shaving my head I have to go over sections twice unlike I do with a 5 blade razor","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"Not as described","reviewDescription":"Doesn't really shave well and easily nicks you.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Mediocre","reviewDescription":"This is a mediocre blade. I was excited about tying this new  system. It fell short of expectations","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620691200000}
{"reviewTitle":"Average","reviewDescription":"I did not enjoy my shave. I will go with Harrys","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1608163200000}
{"reviewTitle":"B","reviewDescription":"Mas o menos","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610928000000}
{"reviewTitle":"Decent razor along similar lines as Gillette","reviewDescription":"It's interesting to see the Solimo brand expand to include various products. I'm currently using a Gillette razor after my electric shaver finally bit the dust. With the Solimo brand, the look of the razor is pretty similar to the Gillette one.  With the three-blade razor, you can get a decent shave and while it won't win any awards. It will get the job done. I also used the Solimo five-blade razor and that was definitely a better shave as it caused a lot less cuts and left a smoother aftershave. This is of course with brand new blades so it will be interesting to see how the blades fare once they start getting older.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1552953600000}
{"reviewTitle":"Basic Blades, Better than Basic Handle","reviewDescription":"I usually buy men's razors because they're much cheaper than those \"pink\" brands they make for us ladies. Cost wise, this Solimo 3 blade razor fits into that \"bargain\" category for me.Unfortunately, the blades are just basic blades, and I didn't find the shave particularly close or smooth. BUT the handle is great. It's easy to grip and stays put in your hand. It also pivots in a way that makes it easy to glide over knees and around ankles when shaving.Overall, I'd say this is an inexpensive basic razor with a handle that is better than basic.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1552521600000}
{"reviewTitle":"Good Shave - Good Value","reviewDescription":"For a three blade razor, this does very well. The blades rinse easily and don't clog between strokes. Handle is easy to hold and doesn't slip when wet. Pivots well around curves, and the lubricating strips do a really good job at preventing nicks. I find the current price of $6.49 to be cheaper than any name brand, non-disposable razor - you get two blades and the handle. There is a $1.00 off coupon to make it a little easier on the pocketbook. The refill package is a good value at $9.89 for 8 razors. For those of you who belong to a shave club, this really rivals it's membership prices.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1552089600000}
{"reviewTitle":"Affordable but poor quality","reviewDescription":"As others have noted, in comparison to the Mach3, the blades are a lot closer together.  This means they get clogged with shaving cream and hair a lot faster and take longer to wash out between strokes.  Shaving with the Solimo will take longer and use twice as much water.  And this only gets worse as the blades begin to dull.  You go through these a lot faster than Mach3 blades.  I switched back to Mach3 after trying these for a month.  Also, it's a matter of taste, but I'm personally not a fan of the larger handle and head.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637452800000}
{"reviewTitle":"Well made, but don't cut close enough for me.","reviewDescription":"I like them and they are a good value.  I wish they cut a little closer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Just spend the extra$","reviewDescription":"I like the handle, but the blades are trash! I'm so glad I didn't order more than the two the handle came with. They were dull right out of the package and pulled hair as if it had been used. I know it hadn't, but I really hate that I can't find any cartridges that are compatible with the handle, but with quality blades.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662508800000}
{"reviewTitle":"Blade sucks","reviewDescription":"The handle is easy to grip and has some weight which I love however the blades themself rust within a week and get dull very very fast I should have stuck to Gillette it may be more expensive for the blades but I can use one blade for a couple months versus a week however these blades are a lot smoother and give less razor burn and bumps then the Gillette razor","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"Good value but...","reviewDescription":"The blades just don't seem to be as sharp as others I've tried. I have normal shaving needs not some heavy beard growth and the blades pull hard and scrape more than cut. All kinds were tried with the same shaving cream.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Not what i expected","reviewDescription":"Update: The three blade razors work really good (5 star for them but still a zero for 5 blade).Razor came with two three blades and 10 five blades. Have not tried the three blades. The five blades are horrible. I do not have a sensitive head but these things tore me up. Tried twice with same results. Will they the three blades but will likely go back to my Gillett mach 3.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"A great value! But..","reviewDescription":"I usually shave with a 2 blade razors, but it's almost impossible to find replacement cartridges so I thought I'd give this 3 razor a try. After about 4 shaves I realized that it does not shave as well as my 2 blade razors. It seems to float over my skin whereas I can actually feel the razor when I use my 2 blade, and I have better control and able to get into tight areas .This is a bargain but I'll stick to my 2 blade razor .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630627200000}
{"reviewTitle":"Easy to use but I think I'll stick to 5 blades","reviewDescription":"I plan to return these and get the 5 blade set instead. The 3 blade set just didn't cut it for me, literally... If you find yourself sliding your razor over the same patch of skin too many times then you might want to try different styles of razor blades or a razor with more blades.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Doesn't shave close, bulky handle","reviewDescription":"Not ergonomic. Difficult to hold in the proper position. Three blades are too many for me but may work for others. I've tried to get used to them but it just doesn't feel right.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669593600000}
{"reviewTitle":"Seems to shave well, but good luck getting near your nose","reviewDescription":"There is so much material above and below the blades that is is pretty difficult to shave the upper lip and get close to one's nose. Also, at some angles I found that I was only scraping the lubricant or the rubber part against my skin, not the blades.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649203200000}
{"reviewTitle":"Not up to Pace standards","reviewDescription":"Workable product provided a comfortable shave but has no trimming blade and is far outclassed by Pace razors.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606694400000}
{"reviewTitle":"Really have to work for a close shave.","reviewDescription":"Pretty much like all others.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624579200000}
{"reviewTitle":"Just ok - nothing great","reviewDescription":"Just ok - not really that good - comparedTo Discount razors at drugstores","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606003200000}
{"reviewTitle":"Good enough but not great.","reviewDescription":"For whatever reason don’t last as long as my other brand.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1599782400000}
{"reviewTitle":"Not bad for the price!","reviewDescription":"Blades are sharp, but I feel the cartridges could use more lubrication to prevent razor burn.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579996800000}
{"reviewTitle":"just not that good of blades","reviewDescription":"blades are not that good. not sharp.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621814400000}
{"reviewTitle":"Get the 5 blade","reviewDescription":"These don’t do nearly as well as the five blade cartridges.  5 blades are excellent.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1577750400000}
{"reviewTitle":"It's just barely average.","reviewDescription":"Typical cheap semi disposable razor","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613952000000}
{"reviewTitle":"Tried to give a detailed explanation. , unfortunately I could not. . it sucks","reviewDescription":"It a piece of crap","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1596931200000}
{"reviewTitle":"A little disappointed","reviewDescription":"Does not give a close comfortable shave","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606089600000}
{"reviewTitle":"scratchy shave.","reviewDescription":"they work. not as well as a good disposable. gave them away.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"The smooth shave","reviewDescription":"Well it doesn't matter return not a smooth shave at all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Average blade","reviewDescription":"How it should be. a bit plasticy but works good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Almost but,","reviewDescription":"These are good, but I dont get the shave I was hoping for.  Good for the money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Shave for Less","reviewDescription":"These are the replacements for the generic Amazon Shaver. I decided 3 blades this order other than the 5 blade cartridges that came initially. There is a difference. The 3 blades don't last as long. I'm getting three shaves out the 3 blade other than several more with the five blade replacements. There are 12 total blades in this kit. Quality overall is excellent but sometimes tricky to load into the handle. I like the trays as you can save the used blades with the new blades. 3 stars overall!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684022400000}
{"reviewTitle":"Not as good as Harry's Razors.","reviewDescription":"I like the price, but have to make multiple passes to get a fairly clean shave, with no stubble.It will take some time to use all the blades. But I think I,ll be going back to Harry's","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Good for a beginner","reviewDescription":"Will get the job done. Gave it to my high school son. I used it once, and once was enough. Rate it at the same level as the single use-throw away razors. The set should include more than one handle. The connection to the razor is thin plastic.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"Good, but not as good as Pace3.","reviewDescription":"I have a razor in each two bathrooms, both have been equipped with Pace3 razors. When one Pace handle, stopped holding blades (it was over 10 years old), I saw these on sale and and used in one of the bathrooms. It gave me the opportunity to directly compare, as I alternate usage. The Amazon Basic is certainly able to give a good shave at a great price, however the Pace 3 is smoother, pulls a little less, and stays sharp longer.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Way too aggressive","reviewDescription":"Was excited for the packaging and price, but the shave is not great for my skin. It’s far too aggressive and burns easily. I have sensitive skin, so it may work for you, but it didn’t for me.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Does not shave as well as my old Gillette sensor twin blade","reviewDescription":"This is a well built quality piece but for my face, the shave is poor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Best Razors","reviewDescription":"Best ones I've found,  swivels up\/down left\/right good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"This is a GREAT razor, but don't ditch the disposable razor you already have!","reviewDescription":"So far, 37 great shaves with COLD water & Cremo Cooling shave cream. I'm an 80 year old retired white male and shave every 5 days.Consumer Advocate Clark Howard's website reports that he shaved for 1 entire year on a really cheap disposable razor.  He said the secret is to clean and dry the razor after each shave and store it in a dry place.  News Flash! Stainless steel does rust!  So..... BEFORE you trash the razor you have & switch to another brand, it's possible that ANY QUALITY disposable razor can deliver hundreds of shaves by cleaning, drying, and stropping now and then (see YouTube). If this works, you'll save a lot of money thanks to Clark Howard.I DO recommend Amazon 3 blade Basic disposable cartridge razor. The pivoting gimbal head keeps blades in perfect contact with contours of my face & neck.  I'll take meticulous care of the razor which includes using the back side of a regular leather belt to strop the blades a few times to sharpen the blades when necessary. YMMV.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Excellent quality and price","reviewDescription":"This product beats the brand name one by a lot and works better.Excellent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Don't Drink The Gillette Kool-Ade!","reviewDescription":"This isn't complicated.  They work just as good as anyone else's, and, you're gonna throw em away just as often, for a lot less money! Keep it simple!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Great razor for the price","reviewDescription":"I’ve used these razors for years and they hold up well, last a while, and are super sharp.Pro tip: When you’re finished shaving, rinse and dry off your razor by smacking it against a hand towel. My razors last 2 weeks minimum using this method.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Great value razor and blade","reviewDescription":"Works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great razor and blade","reviewDescription":"I have tried too many different razors and blades.  I have settled on the Amazon 3 blade cartridge.  It is very easy and comfortable to use and does a good job.  I like it better than even the Amazon 5 blade.  I shave every day, and this is even economical.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"NIce shave","reviewDescription":"Love the weight of the handle. The blade is very smooth and cut very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"💖💓👍💪 FINALLY - Perfect Shaves w\/o Costing me an 💪&🦵😋😋😋","reviewDescription":"For years, if not decades, one of the most frustrating thing for a man is: why do we have to pay so much just to shave???? I mean the brand names like Gillette costs more than $3-5 PER cartridge, and then you got the Dollar Shave Club whom provides a slightly cheaper alternative but you're bound to a subscription model whether you need more replacement cartridges or not. Well, this dilemma might have been solved with my recent orders of Solimo 3-blade Shaving Kit.This kit comes with a Razor plus 20, YES - Count 'em, a whopping 20 additional 3-blade cartridges. This means each 3-blade cartridge is only costing me <$0.8, YES! It only costs me 80 CENTS! And you get the razor for free! Believe me, I never believe 4- or 5- blade cartridges shave any more effectively than the 3-blade counterpart! Yes, it definitely performs better than single blade razor, but once you reach 3- blade, anything more is just marketing, in my own personal experiences, they do not shave any better than THiS 3-blade Solomo Razor kit. And this razor + 3-blade cartridge kit shaves as good, if not better, than my previous experiences with Gillette, which I used to pay upwards of $20-$30 for a bundle, this 20-cartridge kit can last me at least 6 months, now shaving no longer needs to cost me an arm & a legForget brand Names which are extremely costly, while the subscription model alternatives are not very flexible, I highly recommend this kit to any man, you get perfect shaves every time, and save $$$$!🙏🙏🙏If you enjoy this review, please let me know 🤞🤞🤞💓💖👍💪 HIGHLY RECOMMENDED👍💪💓💖","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1629676800000}
{"reviewTitle":"Just Want a Great Shave, Not a Lecture, and I Found It","reviewDescription":"I was getting my razor blades, shave gel and post shave items from a subscription service.  It was convenient and the products were of generally high quality. Several months ago the email from the supplier became quite strongly political in a manner that did not agree with my political views.  I do not wish to look at myself in the mirror every morning knowing I am supporting a company that actively promotes views that disagree with my own strongly held beliefs. Therefore, I have changed my subscription to the Amazon Basics 3-Blade MotionSphere Razor and blades for Men which provides better quality than my previous blades and costs less.  I have also subscribed to Nivea Men Sensitive Shaving Skin Care Set, Sensitive Shave Gel and Sensitive Post Shave Balm, 2 Pack from Amazon, which are superior and less expensive than similar products from the former subscription service.I do not understand how a company can survive in business when their marketing practices offend approximately 50% of their potential customer base.Therefore, I am happy to have started two Amazon subscriptions which fully meet my needs at a lower price and do not push offensive political propaganda at me as a so called part of their service.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1666137600000}
{"reviewTitle":"Only Okay","reviewDescription":"Price is great, but the razor has issues.Not a big fan of these blades as they tend not to shave very close. While the handle is nice the blades just do not feel sharp enough and they do not reach the ends of the cartridge.  Blades end an  1\/8” from each end.  The cartridge itself is rather thick making it hard to shave close next to beard and mustache.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633910400000}
{"reviewTitle":"They don’t seem to last long","reviewDescription":"They don’t seem to last long.The blade that came in the razor felt like somebody had already used it before me. I won’t be buying these again","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663718400000}
{"reviewTitle":"Decent razor","reviewDescription":"Decent razor, good alternative to the very expensive name brands.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673136000000}
{"reviewTitle":"Nice for the cost","reviewDescription":"Saved some money with these over the Mach 3. Was looking for a cheaper option. These are cheaper, but do not provide the one swipe and done. Around the blades is a little thick so I had some trouble getting around my ear and nose. It was nice on the head, but did not cut nearly as close as Mach3","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632614400000}
{"reviewTitle":"They're cheap!","reviewDescription":"I've used DSC for about 5 years and was happy with their product. Then along came COVID...Shipping became sporadic, and Customer Service became non-existent. For the price, these blades have performed adequately, but not on par with the \"Big\" players in the razor game. I may try the 5 Blade version before I give up on this product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631750400000}
{"reviewTitle":"The three blades are wider and closer together than my previous brand.","reviewDescription":"The blades on this razor are about 4-5 mm wider than my last name brand blades. So you get a little more coverage. The blades are also closer together. This should help raise the hairs up for a closer shave. It also makes the blades get a little more clogged.  Certainly worth trying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633046400000}
{"reviewTitle":"Handle glue isn’t durable","reviewDescription":"The razors are good. The glue used to keep the rubber on the handle attached degrades too fast and makes the handle sticky.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662854400000}
{"reviewTitle":"They do the trick but not much more","reviewDescription":"I like the three blade format which seems to be easier to use than the five blade. I never know how long they last. Sometimes 10 days, some other 4 weeks. I guess you get what you pay for...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"Handle Great, Blades Subpar","reviewDescription":"I was hoping the blades would be as good as I am used to from Daily Shave Club but they are not.  Good enough to shave with but not super comfortable, a bit of pulling.  Does give a smooth shave so might be good enough for many guys.  The handle is perfect though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633564800000}
{"reviewTitle":"Cheap but not good","reviewDescription":"I bought this item because reviews were good but either reviewers are paid or I received bad batch. First thing space between blades are to close therefore you have to press harder and few times more to shave properly, second blades doesn't keep  sharpness after few times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633737600000}
{"reviewTitle":"Poor Quality Compared to Gillette","reviewDescription":"I bought these for my husband because he wanted to save money on razor blades. It does NOT give a close shave at all. In addition, it pulled on his skin. He shaved with the gillette razor on one side of his face and this razor with the other side and what a noticeable difference.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668384000000}
{"reviewTitle":"Many other good reviews but didn't work for me.","reviewDescription":"Maybe my beard is too coarse for this cartridge razor.  Based on a lot of reviews this seems to work for some.  Performance was marginal with new blade.  After one or two shaves it was completely done.  The \"silver lining\" is that I changed to a DE \"safety razor\" and will never go back to any cartridge type.  Should have done that decades ago.  Superior performance and more cost effective.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638489600000}
{"reviewTitle":"Get the 5 blade.","reviewDescription":"Get the 5 blade.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Blades stink","reviewDescription":"The handle is great and feels well made.  The blades however, even brand new, offer a much worse shave than my 30 day old Schick. You get a lot of blades for the money, but unfortunately they're garbage. Will be paying a little extra for better blades.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667174400000}
{"reviewTitle":"Attaching the handle to the blade is poorly designed","reviewDescription":"These razors work ok once you can actually attach the handle to the blade. I have used Gillette mach three and dollar shave club razors and never had this much trouble attaching the handle to the blade.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Just meh! not worth the few cents you save...","reviewDescription":"I have a thick beard so... maybe i'm not a good judge... but wasn't happy giving them away.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679097600000}
{"reviewTitle":"Only good for one shave.","reviewDescription":"I was a little disappointed in these. The blade refills are only good for one shave. I can get cheap razors that last a entire week","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Everyone is different, but doesn't deliver a close shave for me.","reviewDescription":"After using it, I pick up the M3 blade to finish the job.  The handle is heavy and easy to use.  It also provides lots of lubrication, but it leaves a lot of rough stubble after using it.  If you drop the blade, the handle will separate from the blade but it is impossible to reattach unless its back in the plastic blade carriage.  The price is right and delivery is convenient, but I'll go back to using my previous M3 shaver.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1600646400000}
{"reviewTitle":"Good price, not a good shave","reviewDescription":"It's obviously a good value, it's Amazon brand.  Unfortunately the shave isn't good...especially on the neck area.  It just can't get into certain spots.  Even on the cheek I have to go over the same spot multiple times.  TBH the disposable razors work better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652832000000}
{"reviewTitle":"Not a close shave","reviewDescription":"We thought we'd try saving money on expensive blade refills and bought these. Not worth it, the shave isn't nearly as close as the expensive blades (and you can't return these, so it ended up costing more to try to save). Didn't work well for either of us (male and female).There was also so much \"vitamin e\" on the blades that every time the blade was pulled away there was a slimy string from the blade to the skin. Gross.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617235200000}
{"reviewTitle":"Amazon Basics Razor","reviewDescription":"a different feel from my previous razor, but not hard to get used to. seems to work well though. Gives a good shave, and definitely less expensive than the one I was using.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Does the job well at an attractive price. A great combination!","reviewDescription":"Shaving is a necessary activity. This shaving system gets the job done well without nicks and with acceptable comfort. The price beats that of its competitors by a long shot which was what drew me to try it. I will be back for refills when the time comes . . . but the shaving cartridges have a long working life. They could work on improving the cartridge attachment mechanism as I have continuing difficulty mounting the cartridge in the handle.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"The shaving cartridge could be slightly thinner","reviewDescription":"Only product from amazon brands that I detectable noticeable though slight difference compared to comparable established brands.  The tip of the head is slightly too wide, and could be narrower.  It’s petty flaw though at compared to the Gillette version with one extra cartridge since I got additional 20 cartridges for twice the price at $15, but an easy permanent improvement to make indistinguishable the shaving experience.  Why not make these types of items available in local drug stores since most major drug stores like Walgreens, Duane Reades, and CVS have a membership card that could potentially discount more than regular price on Amazon.com.  I certainly don’t care about a brand of a shaver, as long as it shaves - it’s not like basketball or running shoes where the brand image might matter from being subject of social consciousness.  Why not add into Amazon Essentials regular soap bars also, since most houses probably still use soap, based on Google.com, over 250 million Americans still use soap bars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Fine for the price","reviewDescription":"Fine for the price. My dollar shave club blades from 10 years ago finally ran out, they felt sharper then these. But these are cheap.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Very good for the price","reviewDescription":"Being a semi bald man, I shave my face regularly and my head about twice a week.  That's a lot of shaving over the course of the last 40 years.  The good news is we now have decent options when looking for cartridge razors.  When I first saw these, I was skeptical, but because of the cost, I decided to try them out.  I'm glad I did.  They're not the best razor I've ever used but they've been doing a very nice job for me.  And at about 1\/2 the cost of some of the other brands I've used - that's good enough for me!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"there good","reviewDescription":"A little clucky","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Pleased So Far","reviewDescription":"Can be a little rough but works fine.  Price is great however I've had had smother shaves.  Have bought on more than one occasion so that says it all.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Good razor","reviewDescription":"Clean shave and doesn't cause me to have razor bumps","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"as good as named brands for 1\/2 price","reviewDescription":"best value in a triple blade razor","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Love the 5 blade figured I’d try the 3","reviewDescription":"I have used the 5 blade refills for some time with good success and have used other 3 blade systems with success so decided to give these a shot.  Value is there but I don’t find them as comfortable to use as other 3 blade systems and will likely purchase more of the 5 blades.  The 3 blade seems to be a little rougher on my face causing more ingrown hairs than a higher blade count, which is strange since the 5 blade tend to cut the hairs lower.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"They are good","reviewDescription":"They are good","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Rod connector","reviewDescription":"Like","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692316800000}
{"reviewTitle":"Nice to find inexpensive blades","reviewDescription":"Nice to find affordable razor and blades...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"Pretty good shave for reasonable money","reviewDescription":"Shaving decent quality","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Good","reviewDescription":"It’s fine to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Ok","reviewDescription":"They are good value, but I still prefer Gillette","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Good for what they are.","reviewDescription":"My husband goes thru razors like crazy but these are a good price for what they are.  Will keep buying.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680307200000}
{"reviewTitle":"Just like Mach 3– slightly larger head","reviewDescription":"This worked just as well as the Gillette Mach 3 , and for much less money. The only real difference I noticed was that the head a slightly larger, so if you’re getting into *certain* areas, it can be a little bit trickier.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"Sad to say...the Mach 3 is still champ...","reviewDescription":"It was a good try for Amazon to try to topple the 3 blade champ Mach 3 tho but it would seem they just removed the outer two blades from their 5 blade version and fell short in their aim. A tad more space between the blades would have made cleaning out the stubble MUCH more easier. The three blade version of Amazon's does NOT have the single trimmer blade  ( like the five blade version ) but would have been a nice touch to at least try to outdo the Mach 3. The price is better with the Amazon version and blade and shave quality are there, but to be king of the 3 blade shaver's, Amazon needs to make these two changes without changing the price and a NEW king of the hill will be born. But until they do...Mach 3 is the fairest in all the land!!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1603152000000}
{"reviewTitle":"Great quality","reviewDescription":"Great razors. Not quite as smooth and nice as the blades I was getting from a shave club subscription, but also drastically cheaper. Much nicer than any disposables for sure. I got tired of paying for the higher cost blades. These will do just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672963200000}
{"reviewTitle":"Okay razors","reviewDescription":"They are okay razors for the price.  Remember you get what you pay for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Price","reviewDescription":"Can’t beat the price, good performance","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Not Quite Fusion but Pretty Darn Good","reviewDescription":"We were tired of paying the prices for the big name Fusion razor folks... you know the one so we gave these a try.These are not quite as sharp as those others but the difference in price makes doing a couple more swipes well worth it.I do wish they would make some without the gel strips for those with sensitive skin, but at least we have an alternative and they beat the heck out of the cheap disposable razors.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Good value.","reviewDescription":"Nice razors great price. But would recommend getting the 5 blade over the 3. Still best razors I've come across for my skin.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"A decent razor","reviewDescription":"This razor gives a decent shave and seems to be well made. The handle is very solid. The only negative I can find is that the little plastic blade guards (found on each blade) are very hard to pull off....I actually pulled the blade off the handle trying to remove the blade protector.I would buy these again.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Finishes buttery smooth","reviewDescription":"Blades are very sharp and it shaves as well as any I have used.  They last about 50% longer than any other blades I have used.  The only downside is the handle.  The blades are a bit cumbersome to change, and difficult to hold at the right angle.  You have to \"choke up\" and hold the handle close to the head.  To be fare, there are small notches to hold on to, but still a bit strange","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Pretty good shave","reviewDescription":"Not the same as a 5 blade razor but pretty close. Can usually go weeks without shaving and a 5 blade will whip my beard right off. 5-6 days and this razor struggles.  Great for daily shaving though.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Good enough","reviewDescription":"I tried these blades over the Gillette, and I could say that I'm satisfied but I'm still wishing a little bit more from the razor, because it is losing its sharpness over a short time, considering that I'm not fully shaving, only outlining my beard. Regards to the price, you're taking and excellent tool home.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Works well","reviewDescription":"Works well cuts close","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Works ok.","reviewDescription":"Single blade for shaping up not the best.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Great product for the price.","reviewDescription":"These razors are a lot better quality than I expected. They are sharp, durable and last for a few weeks. I shave daily so I run through razors like crazy. They have held up pretty well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629072000000}
{"reviewTitle":"Perfectly good shave","reviewDescription":"It loads the cartridge in easily and does a really good job on my face. I guess I would have a medium beard but, retired, and usually it is shaving at least a two day growth","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1627689600000}
{"reviewTitle":"It left my skin dry and not smooth","reviewDescription":"I did not like the way I t left my skin feeling, that’s th reason I purchased for sensitive skin.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Quality Razor","reviewDescription":"Glides well and holds up against coarse hair. Not the absolute best I’ve ever had, but it hits all the bullet points and is a quality razor for the low price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628467200000}
{"reviewTitle":"Great for the price","reviewDescription":"They don't stay sharp as long as some of the other brands I've used, but they are quite a bit cheaper too... over all, they are pretty good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634774400000}
{"reviewTitle":"Not the best","reviewDescription":"Not the best razor. Wouldn’t purchase again","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661558400000}
{"reviewTitle":"So far so good.","reviewDescription":"I was a little worried, read some bad reviews, but so far no complaints. I’ve used them for a month, a descent shave 🪒 in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633737600000}
{"reviewTitle":"Good Value Razor","reviewDescription":"Good razor, shaves nice and close, very smooth.  Would give it five stars if it had a top blade for close in trimming.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625788800000}
{"reviewTitle":"Amazon blades","reviewDescription":"Not bad for knockoffs I usually use Mach 3 blades, these are very close but for the price you can’t beat em","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628294400000}
{"reviewTitle":"Spend a little more and buy the FIVE blade razors.","reviewDescription":"Good value for the money.  Did not give me the closer shave I can get with a five blade razor, so think I will go back to a five blade razor after I use up this three blade razors.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613001600000}
{"reviewTitle":"Excelente","reviewDescription":"Muy buena afeita perfecto","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Great razor for the price!","reviewDescription":"Great razor for the price. I had already purchased the 5 blade razor and that one is even better.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687910400000}
{"reviewTitle":"Price","reviewDescription":"Have bought these razors for months now. Works good good price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Mach 3?","reviewDescription":"I bought these razors for my Mach 3 handle. Unfortunately the razors were not compatible with my handle. I wound up purchasing the Amazon basic handle which are compatible with these razors. All in all it’s a great purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Better than 5","reviewDescription":"So far I find there superior than the five blade version.  My beard is not so heavy but I look grungy if I do not shave daily. The five blade version does real well day 1 and declines rapidly even though I clean it out daily. They just do not last too well, planned obsolescence. The three blade version does a good enough job for me but seem to be more durable.  I prefer getting more uses out of a blade than the 5 blade was providing me.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1672963200000}
{"reviewTitle":"Best value for three blade razor","reviewDescription":"I highly recommend these three blade Mach 3  style razors. They don't last quite as longas the name brands, but the value makes up it . For the most part, they shave just like the name brands don't waste your money on Harry's or Gillette buy these razors","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"Razors","reviewDescription":"Great razors and great price","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Good shave for the price","reviewDescription":"I have always used Gillette brand razors and was hesitant to try these. I only use them to shave my head, not my face so this review is solely based on head shaving.The price on these was great in comparison to the bigger brand names. The razors shave nice and I cannot say I notice any major difference in the shave when comparing to Gillette brand. The handle feels similar to the Gillette fusion razor handle. I have now used these razors a few times, even once after not having shaved my head in 4 days. I am still using the same razor as well, I usually use the same one a few times before switching it out.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1663632000000}
{"reviewTitle":"good -- but not the best feeling razor on your face","reviewDescription":"had other Amazo razors -- that were a more comfortable shave - but for the $$$ these are good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"Incredible value if you can purchase them at the Amazon Fresh price","reviewDescription":"I live in the Seattle area and through Amazon Fresh, the price is $6 for the 12 cartridges which is an incredible deal. Otherwise, I don't think that they're worth the $17 list price. But, if you are paying $6, you won't find a comparable product at that price. I mainly use this for my legs but have also used it on my arms, pits, chest, and nethers which the blades had no issue with. For my legs, I was able to get three comfortable shaves out of one cartridge.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1669680000000}
{"reviewTitle":"Great value.","reviewDescription":"I am on the Subscribe and Save program for these replacement blades.  My daughter, husband and I use them.  They give a nice smooth shave.  My husband is very happy with them since he shaves daily.  My daughter and I prefer these over the woman's blades for the Solimo razor handle.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646784000000}
{"reviewTitle":"Hand Razor","reviewDescription":"Works great well balanced easy to shave with great value for money I believe it came with 10 good sharp blades. LOVE IT!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1665532800000}
{"reviewTitle":"Good but","reviewDescription":"They don't last as long as name brands but even with that they are cheaper and a better deal","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664236800000}
{"reviewTitle":"Great razor!!","reviewDescription":"I took away a star because the newest blades do not have the trimmer on the one side to get your sideburns. I still love the razor though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660435200000}
{"reviewTitle":"Handle","reviewDescription":"Best weighted and ergonomic handle of any shaver for me.  Used with 3-blade cartridges.  Very good shave but blades dull quicker than my old standby shaver.  Also there are better values with competitors.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1654214400000}
{"reviewTitle":"Good buy","reviewDescription":"I really like this set. It's cheap and the razor and blades are well worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662249600000}
{"reviewTitle":"Just as good as the more expensive brands","reviewDescription":"I’ve used these for yearsThey are sharp and durableI’ve avoided the big make razors for years because these are great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660176000000}
{"reviewTitle":"Why did they go from $5.99 to $19.39 for 12 pack in less than 2 weeks?","reviewDescription":"Blades are pretty good and better than Gillette blades.  I am wondering why did they go from $5.99 to $19.39 for 12 pack in less than 2 weeks?","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1652400000000}
{"reviewTitle":"Work OK, good value.","reviewDescription":"I like the value.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670976000000}
{"reviewTitle":"Beats the Mach 3","reviewDescription":"Pretty damn good razor. Trying to get away from Gillette I tried several different ones and none of them measured up to Mach 3 until I tried these.I love the extra weight the handle has and you can't beat the price of the refills either. Lasts me about four shaves before I change the cartridge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626652800000}
{"reviewTitle":"Incredible price for decent blades","reviewDescription":"Wow, I'm happy to have these blades for less than $1 per blade. Compared to my old Gillette blades that cost 4X that, these Solimo 3-blade cartridges deliver about 90% of the Gillette experience. I take 10% off the experience because there is no blade on the back for sideburn work, and there is an excessive amount of sticky gel left on my face - even after my fourth use of one cartridge.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1605225600000}
{"reviewTitle":"Quality & Price","reviewDescription":"This razor gives a good shave.  Price point beats all competitors in it's class.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654819200000}
{"reviewTitle":"Works well but a little bulky","reviewDescription":"A good value and shaves close without irritation. Only issue is that it’s rather bulky and heavy. Blades last about the same as the 3-bladed Gillette and cost less.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645833600000}
{"reviewTitle":"Nice shave for the $","reviewDescription":"These blades provided a pretty close shave and didn't cause any nicks or cuts.  I would prefer a closer shave, but for the money they did pretty well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Not P&G!","reviewDescription":"So happy not to finance the woke clowns at P&G. This product is pretty good. The Personna is the only thing better, but since the above mentioned bozos changed the Mach 3 handle, this is the only alternative unless you have some old Mach 3 handles lying around.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"close shave","reviewDescription":"These blades are just as good as the Gillette Brand and cost more then half the price. I`ll purchase and use the Solimo blades over Gillette razors from now on.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648598400000}
{"reviewTitle":"Better than 5 bladed version","reviewDescription":"I switched back to the three bladed version because I can't shave under my nose with the 5 bladed ones due to depth of plastic between  top of plastic and first blade. Blades are as sharp as Gillette but harder to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626480000000}
{"reviewTitle":"Nice razor, good value.","reviewDescription":"Recently bought this razor because of the ridiculous price of the name brand blades in my local store. It's my first time using a razor with 5 blades and it seems somewhat overkill to me but I was happy to see the the 3 blade refills I purchased also fit this razor handle so I'm all set for a few months. The handle has some heft to it and makes shaving very comfortable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1602460800000}
{"reviewTitle":"feels cheap","reviewDescription":"difficult to change razors and handles feels cheap","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Great Value!","reviewDescription":"Great razor and blades for the price. They might not last quite as long as the expensive name brand, but it is pretty close, and at a fraction of the price. I have purchased this twice and will continue to do so if the price remains this low. You really can't beat the value.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1612915200000}
{"reviewTitle":"The 3 blade did not give me a smooth shave.","reviewDescription":"The 3 blade did not give me a smooth shave on the first pass as I'm am accustomed to. I'm going to try the 5 blade. Shaver handle is easy to control and pivots as it should.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623456000000}
{"reviewTitle":"Great value!","reviewDescription":"The price is great, better than Harry's not quite as good as gillette but for money I think it's a great deal. The razor itself doesn't feel cheap shave isn't bad, but not as close of a shave is the Gillette razor.I will buy this brand again!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1589241600000}
{"reviewTitle":"Average performance but great price.","reviewDescription":"Under what I consider normal usage the blades performance is average. I usually have to go back and touch up areas around my chin and sides of my face. Although it is a bit inconvenient I have no plans on switching to another razor brand. The price to quality is more than acceptable for me.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1583539200000}
{"reviewTitle":"Nice razors.","reviewDescription":"Amazon seems to be doing a pretty good job with their Solimo stuff and these razors are very good.  Kind of a weird construction with the gaps between the blades and the lube strips but you don't notice any difference.  The swivel head is kind of nice too.  Will buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1569542400000}
{"reviewTitle":"Love the price","reviewDescription":"Not as good as Harry's which I was previously using but it was a great price and it doe's the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625788800000}
{"reviewTitle":"Darn good for the price! Will purchase again.","reviewDescription":"Love love love the price and less waste being thrown in the trash","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631491200000}
{"reviewTitle":"wrong razor and refills","reviewDescription":"I ordered the three blade razor and got five blade razor and refills in a three blade box some one stuffing boxes can't count. Update: Gave the five blades to my wife, she likes it. reordered and got the right product and am liking it shaves fine and great price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1566086400000}
{"reviewTitle":"A good 3-blade razor","reviewDescription":"No bells, no whistles, just a good quality 3-blade razor, priced well below the more famous competition. As I've gotten older, the need for more than 3 blades has faded and economy has become more important.  Used with Nivea shame cream, I get a close non-irritating shave. Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1581465600000}
{"reviewTitle":"Decent razor at a good price","reviewDescription":"For the price it's a good item and does a good job","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623456000000}
{"reviewTitle":"Good quality and value shave.","reviewDescription":"The blades are sharp enough and they're a great value. Handle is comfortable. Overall another rock solid amazon branded product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608422400000}
{"reviewTitle":"good value, hard to change blades","reviewDescription":"Overall this is a great value and a nice razor. Changing blades can be a struggle sometimes. Smooth shave with good feel.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"big razor","reviewDescription":"Great razor and much cheaper too. Definitely better than any disposables. I'm tired of paying for blades that cost more. .","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Great quality","reviewDescription":"Great razor. Not as smooth and nice as the blades I subscribe to from the shaving club, but also much cheaper.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Good quality razor","reviewDescription":"For the price, these work very well.  They are comfortable and the blades have lasted many shaves (7-10 each).  I was previously using an old Gillette razor, and the replacement blades were only good for 2 shaves, so these are a much better value.  My only gripe (and why 4 stars) is that the razor head shape makes it difficult to shave under my nose.  Would need the blades to be slightly higher on the head.  A quick \"touch-up\" with the electric after I'm done is all it takes to have a perfect shave.  Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1626134400000}
{"reviewTitle":"Works","reviewDescription":"Handle is good for the price. Razors not good for sensitive skin","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Good shave.","reviewDescription":"Good value for money","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678665600000}
{"reviewTitle":"These are fine","reviewDescription":"The blades give a close enough shave for me.  A little less close in the thicker beard areas, but close enough, I mean how close does it have to be as long as it is  acceptable , and it is.  Mach 3's last me about 3 shaves before they get useless, these will last me 6-7 so that is a bonus.  I don't find them irritating at all.  I had to find the correct handle angle to get the closest shave.  A down-side for me is I have to really maneuver it to get underneath my nose, it seems that the distance between the blade edge and the edge of the cartridge is pretty wide.  I will probably buy these again.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1580947200000}
{"reviewTitle":"Hit n miss","reviewDescription":"For the most part they work well. There have been a couple that were either dull or the guard was simply too thick. I will continue to purchase as long as I don't recurve an entire set that are unusable. They do last as long if not longer than higher priced razors!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1647129600000}
{"reviewTitle":"Good value, but","reviewDescription":"Articulates ok but the steel blades are cheap and rough.  Doesn’t give a clean smooth shave like it should.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"I like it.","reviewDescription":"I love the way it shaves. I shave my face as well as my head. But I don’t have sensitive skin","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670544000000}
{"reviewTitle":"Good quality disposable razor, great value for money.","reviewDescription":"Seems to be a very good blade. I have a beard and only use a razor to clean up the edges but so far the blades have lasted several clean up sessions without dulling. Cuts as clean as any Gillette blade at 4x the price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Good razors for the money","reviewDescription":"Even if I only use each cartridge a few times, these are a value.  I like Jeremy’s razors as well, these were bought to test out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"good value","reviewDescription":"the feel","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Razor does it’s job","reviewDescription":"This men's razor is a game-changer. The precision of the blades ensures a smooth, close shave every time. The ergonomic handle provides a comfortable grip, making the shaving experience effortless. It navigates contours seamlessly, leaving no stray hairs behind. Durability and a sleek design make it a top-notch choice for grooming. Highly satisfied with the performance.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Dollar Shave Club Replacement","reviewDescription":"I used Dollar Shave Club for years. But when they kept hiking their prices and the handles broke when dropped, I looked for alternatives. This is the one I settled on.The handle is sturdy and the blades provide a close shave. This is a great value, relatively. I change out blades weekly and shave daily.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Good alternative","reviewDescription":"As sharp a Gillette Mach 3 but I don't get as many shaves. Still they are worth the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Why are these so much better than Gillette?","reviewDescription":"The blades work so well I’ve given up on Gillette blades after 40 years of shaving. Over the years, I tried every variation of blade and settled on Gillette  but even with their advancements in handles and blades, they never got my face quite smooth enough. I’ve tried canned shaving cream, fancy brushes and lather, pastes, and oils. Oil comes closest.I originally ordered this brand by mistake, though they didn’t have the Amazon label. When I realized it, I figured I’d get a handle since they were cheap.I can’t believe the closeness of the shave and the smoothness it leaves behind.I have two problems with the product, which prevents me from giving a 5-star review: First, the handle really is cheap-it’s difficult to get the blade connected. And second, once you get it connected, it disconnects when trying to get it out of the blade holder. A coupe of times I set the razor down and the blade popped off and it is hell getting it reconnected.I might look at a new handle to see if that fixes my issue.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"I like them","reviewDescription":"seem to shave as well the expensive brands I was buying. They last about the same time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Pretty good shave","reviewDescription":"Affordable razor with blades that delivers a decent shave. Meets expectations. Always looking for a closer shave though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Smooth","reviewDescription":"I like these. They don’t last too long, and obviously don’t shave well when they’re starting to dull down, but they’re good. It might be because I don’t change the blade often enough. Maybe 1 blade per month is a good habit to have.The shave is smooth and fairly close. Reminds me of Gillette, but a little better in terms of smoothness. Gillette does last longer though. And Gillette does still shave decently when it’s dull.I’d still get these again. It’s basically a buck per month to have good shaving sessions. Try em out","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Broke almost instantly","reviewDescription":"One of the clasps broke as soon as I put the first blade on. Now I'm stuck with all these blades for a cheap junky razor I'll never repurchase. Seriously, Amazon; this is the best you could spew out?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1661385600000}
{"reviewTitle":"Use a switch blade for a better shave","reviewDescription":"These are the worst razors I have ever tried! They scrape the skin off your face, the handle is even uncomfortable.I shaved once and will never use them again. Now I have to throw out 20 blades because THEY WILL NOT LET ME RETURN OR EXCHANGE THESE BRUTAL< DANGEROUS BLADES.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1650844800000}
{"reviewTitle":"Not happy","reviewDescription":"Not happy with these so far I finally ran out of my other razors I was using and started using this razor yesterday the very first time every time I use it it cuts my skin my face and other places that I shave.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1655856000000}
{"reviewTitle":"they don't fit my razor","reviewDescription":"They're unusable because they don't fit. I don't know what else to say.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Bulky and dull","reviewDescription":"Bulky awkward design and very dull blades. Couldn't get a smooth close shave. Dorco is wayyyy better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687651200000}
{"reviewTitle":"Not worth it","reviewDescription":"Horrible waste of monies, will look elsewhwere.Packaged for overseas shipment that was hard to open, razor was not sharp,  handle hard to hold when wet , hard to hold unbalanced handleA rather cheap dollar store type item which is better not using..better off with a like product only different vendor. A reminder thst all Amazon products are not qualified to be good products...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1617667200000}
{"reviewTitle":"Terrible shave","reviewDescription":"After using my last Mach 3 blade SEVERAL shaves, to the point of intolerable dullness, I switched to this. It was duller new than the overused Mach 3.  Using this razor was very uncomfortable and left visible stubble. The next day I tried the second blade that came with this razor. Same bad shave. Then the thing went into the garbage.  A minus 5 rating would be about right.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1612483200000}
{"reviewTitle":"Didn't work","reviewDescription":"Didn't work well at all","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Not a close shave","reviewDescription":"I have been using Dorco blades and ordered a set of these to compare. Unfortunately, these blades are unusable. I cannot get a close, smooth shave with them. Very disappointing product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Bad razor - Don't Buy","reviewDescription":"Poor shave quality, dulls very quickly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692576000000}
