{"reviewTitle":"Sound amazing but very uncomfortable","reviewDescription":"I own almost everything Apple, will swear by their products, but the 3rd gen AirPods physical design is awful. They sound great across the frequency spectrum, especially the bass. But they are enormous compared to the 2nd gen AirPods. They’re constantly coming out of position and falling out. These complaints have been so frequent that Apple even released a “tutorial” on how to make them fit better by rotating them towards your face while they’re in but it doesn’t really work. Any movement such as even just chewing will make them pivot out of position. It’s just disappointing considering how convenient and ergonomic previous AirPods have been.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"You better have big ears to wear these!","reviewDescription":"I've had \"regular\" AirPods for years and never had a problem (until they died).  I was so excited for these new AirPods but I swear they are so big that they won't stay in my ears.  They literally JUMP out of my ears - like multiple times during a zoom call! And I keep pushing them into my ears hoping they'll stay and now my ears feel bruised.  Definitely think twice before paying this kind of money for a product that you may or may not be able to use.  I wish I had worn them more during the return window because now I'm stuck.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Nothing will make these stay in-ear","reviewDescription":"My return window closed two days ago. That's after waiting over two weeks for the earbuds to be shipped, and then deciding to give them one more try by buying an accessory that would help them not fall out. That accessory arrived today so I'm screwed, as they say. I had the first generation airpods and at least those would stay in the ear. You couldn't run or do heavy workouts but they would stay in. But the microphone and battery life deteriorated (aka planned obsolescence-d) so I needed new ones for calls and such. I tried wearing the new ones around the house, walking the dog, or just sitting down and taking a call - I have to keep them in my ear with my hands if I don't want to lose them. I tried the over-the-ear plastic thing (another $10 wasted), but the fit is still so loose that they eventually fall out. Also, if you want to hear anything with these, they have to be right up against your ear canal, otherwise the sound dissipates and the volume is too low to hear - enjoy holding them both pressed up to your ear if you want to use them. I'm so disappointed... I'm an Apple fan and would pick their products before any others but lately they've had a lot of fails. I wish I could return these...","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Apple Trash","reviewDescription":"Complete garbage. They didn't even last me 5 months. I obliterated the left bud because it would CONSTANTLY disconnect. And I mean CONSTANTLY. Imagine trying to workout and only hear your music through one ear bud EVERY FEW SECONDS and having to constantly reset it??? No thanks. Never again. Over-priced, over-rated and irritating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Disappointing","reviewDescription":"The sound was not at all what I was expecting for the price. I am so underwhelmed and disappointed! I liked the earbuds that came with my iPhone 11 Pro Max better, but they don't work with my new iPhone 15 Pro. Also, they are constantly falling out of my ears. I have ordered Yurbuds, and if the sizing isn't right, it's going to be an absolute nightmare finding a solution. I have been a loyal Apple customer for years and I just can't believe they would put their name on a shoddy product like this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Keep disconnecting","reviewDescription":"I’ve had these for 4\/5 months and they started cutting out and disconnecting every few minutes. I have to manually reconnect them to Bluetooth. I have the newest iPhone available, everything is updated. I keep the AirPods in a case and charge them as needed. It’s getting really annoying, considering these are expensive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Not very good quality.  Fall out easy.","reviewDescription":"The quality wasn't very good.  Noise cancelling not great and they fall out very easily.  Returned them to Amazon and the Amazon customer service was very poor.  BEWARE - the return process was difficult and Amazon wouldn't credit back my $$ for 14 days - even though I was charged immediately when I bought the product.  Showed on line that they had my return, but, Amazon waited before crediting my account.  I'm sure that's their policy to hold on to client's $$ for as long as possible, but, it's lame.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Not geared for all ears","reviewDescription":"I have bought multiple $99 AirPods for myself and kids. Decided to splurge an extra 50 bucks for myself. Ouch!!! Definitely too thick. I had to switch my child for the cheaper ones and give them the “pricier\/better” AirPods, per the price and description.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"They do not stay in my ear","reviewDescription":"Sound is great,  but the pods do not stay in my ears. They slip all the time or fall out completely. I’ve even lost one at a point. They’re still brand new because i barely use them for fear I’ll lose them.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Sound Quality & Fit","reviewDescription":"Honestly, I believe that purchasing this product has been a complete waste of money because I am still trying to find that good quality\/magical music sound that is so widely talked about. My old apple wired earbuds sound way better plus, they keep popping out of my ears. The most feasible way to keep them secured in my ears is if I’m wearing a head wrap to pull down over the buds.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Love these! So glad I decided to buy","reviewDescription":"I had the 2nd gen & loved those but my husband borrowed them & broke one. So I decided to upgrade. Headphones with the rubber tips never stay in my ears so I decided to go with these 3rd gens. I love them and the sound quality is amazing. But they don’t seem to fit as well in my ears as the 2nd gens. These seem a little bigger and it’s hard to keep them in place if I’m talking or eating while wearing them. Another thing I don’t like is that you no longer tap to pause, it’s a little awkward to find the button on the AirPod. I purchased a used pair marked “acceptable” so I was nervous they’d be beat up or dirty. They came in in the box in perfect condition. They looked brand new & they’re still covered until Apple warranty until 10\/24. For anyone whose hesitant to buy a used pair — don’t be. I saved $60 and they looked brand new even though they were marked as acceptable. Highly recommend even if there are a few small cons :)","isVerified":true,"ratingScore":5,"reviewReaction":"45 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"The best apple audio product by far!","reviewDescription":"I got these as a christmas present and these are the best Apple audio product they have. I have tried their Airpod Max's and they are not worth anywhere near the price these are worth. These AirPods are super cool. They're super easy to set up with my iPhone, and the sound is amazing!  Plus, they're comfy to wear, and not complicated to change the settings. The best part is that they last all day, and the case charges them up super fast. Whether I'm listening to music, playing games, or chatting with friends, these AirPods are my go-to. If you want sound and reliable headphones, these are the ones to get!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Great product!","reviewDescription":"Comfortable, Clear, and Convenient.Comfort, clear sound, and convenience. Excellent sound quality perfect for music, calls, and everything in between. Durable and reliable, they're the ideal companion for your everyday adventures.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"If You're Not Sure, This is Your Sign to BUY","reviewDescription":"I was looking to replace my 2nd gen, when I saw these were on sale.  Between the sale and my rewards, the 3rd and 2nd gen were the same price so I treated myself.  I'm so glad I did! It's a little adjustment getting used to the different size.  They kind of felt like they weren't secure in my ear but they were, and never fell out.The sound quality is great.  I don't know any other way to describer, other than saying it felt like the sound was all around me and not just in my ear.  I was waiting on my car to be serviced, watching a show on my iPad.  I was so paranoid and kept taking one out.  I just new they weren't paired properly and everyone in the waiting room could hear my loud tv show.  That's how good the sound is.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Great quality but hurt my ears and didn’t stay in","reviewDescription":"Don’t get me wrong, the quality of these earbuds are great. They just wouldn’t stay in my ears. No matter how I tried to love them they just ended up popping out. Initially I wanted a pair for when I’m working out so as my music isn’t blaring for everyone else to hear. I ended up giving them to my son who is now enjoying his Moms unfortunate circumstances. He’s really happy with them.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Like all (my) Mac products","reviewDescription":"These AirPods are no exception. The fit takes some getting used to. Being my first pair I felt I had to  be careful of not losing one. In fact the portability feature of their compact profile and to this loss preventative anxiety. I’m confident I’ll get better accustomed to them as they’re worth it. Like all Mac products (I own, MacAir Pro, watch, iPhone and other accessories services and apps) work exceptionally well right out of the box, they’re easy to configure, and the fact they all work so well together add even greater value.  Worth noting I was a reluctant converted PC user from as early as DOS 5.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Don’t Buy, Fall Out; Stick with Gen 2!","reviewDescription":"I would have rated these 3 stars, but figured 5 would get more views to inform people.The Oval shape, makes them feel like they’re going to fall out, before you start moving. - having to ‘click’ the short stem, really makes them fall out.The primary problem is, by the time you’ve’Grabbed it’ & ‘Clicked it’, you’ve ‘Dislodged it’ & need to ‘Reinsert it’. Repeatably.I often have gloves, dirty gloves, or dirty hands, getting me or them dirty trying to click the audio controls.Just as pleasurable as it is to listen to someone’s loud personal cellphone calls, that’s similar to listening to someone barking out Siri commands all day… it gets lots of comments from unsuspecting listeners, colleagues, & clients. I prefer the light touch. I can control them with the back of my hand, wrist, or shoulder.I’ve used many sets of AirPod Gen 2;  if you have, you barely tap them to control them.For 3rd Gen Spatial AirPods Apple says to place your thumb behind the stem and slide your index finger along the “Force Detector”. (FYI, a force detector, is just a click switch, just like a mouse… just say that). What it should really say is, ‘click it like a mouse’.“Apple’s Support” typically gives stupid names and directions. If I’m ever looking for help on Apple Products, I do all I can to avoid their support directions because they rarely help directly. I look for “Real, Normal” people answers on YouTube or Quora.They sound great! Just don’t move.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"There is nothing better in the market","reviewDescription":"There is nothing bad about these headphone. There is literally no downside to airpods pro.here is why :1- 30 hours battery backup. Makes it perfect pair for listing to music entire day2- quick charging.. so that you are always covered3- its sturdy.. and durable.. highly reliable4- its a perfect giftmost importantly: ITS INVESTMENT! I don't think I will need another headphone in near future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"best headphones ever !!!","reviewDescription":"so glad i decided to splurge on these beauties. i've been struggling to find wireless earbuds that 1) sound good and 2) actually connect to my phone 😵‍💫 these fit the bill 1000%. absolutely no issues connecting and the sound quality is out of this world! they also fit my ears perfectly (super comfy) but i can see how the size might be an issue if you have petite ear holes. i've only been using them for a day so i can't speak on battery life just yet, but it seems that they'll last quite a while on one charge. yea if you have an iphone and don't have airpods yet, wtf are you doing !!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Great product","reviewDescription":"Nothing to dislike. Been using corded headphones for far too long. I tried the inner ear Dre beats but the cord wasn’t long enough and would stick to my neck during workouts. Decided to get 2 of these for myself and wife. If you’re thinking about it, buy them. I got them on sale, I don’t even know the luck behind it, better price than what Amazon day and Black Friday prices were. They are great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Mediocre, At Best","reviewDescription":"Bought these to replace my Sennheiser headset that didn't have any noise cancellation. For as many folks I see wearing these things, I took it for granted that these would work for me, as well.My beef with them is that they do not stay put in my ears. They fall out. That sucks. To fix that, I bought some silicone devices that I thought would work. As long as I sit still, they work work well, but moving around or even walking gently is risking having them fall out of my ears.As far as sound quality, they sound pretty good. Noise cancellation, I am told by people I am on calls with, is better than the 20 year old Sennheisers. Integration with a WinTel device and iPhone was super easy..Battery life for me is more than adequate. Charging time seems really fast.Overall, I would not recommend buying the Gen3 Airpods. I will not buy them again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Apple AirPods (3rd Gen): Worthy Upgrade or Overpriced Tweak?","reviewDescription":"The 3rd Gen AirPods refine the formula, but is it enough to warrant the upgrade? Here's a quick rundown:Pros:Improved Sound: Fuller bass and crisper highs deliver a more enjoyable listening experience compared to the 2nd Gen.Spatial Audio Immersion: Head-tracking Spatial Audio adds a cinematic touch to compatible content, especially movies and music videos.Comfy Fit: Slightly redesigned fit sits more securely while remaining comfortable for extended wear.Sweatproof Durability: IPX4 rating makes them resistant to splashes and light workouts.Seamless Apple Integration: Easy pairing, automatic switching between devices, and convenient Siri access remain unmatched in the Apple ecosystem.Cons:Price Tag: At $179, they're still a premium option compared to other wireless earbuds.No Noise Cancellation: This deal-breaker for some can't be justified by the slight sonic improvements.Mediocre Call Quality: Mic performance is still just decent, not great for noisy environments.Lightning Only: No USB-C charging might irk some, especially Android users.Limited Design Change: Not a drastic departure from the 2nd Gen, which might disappoint those seeking a fresh look.Verdict:For die-hard Apple users and audiophiles seeking a subtle sound upgrade, the 3rd Gen AirPods offer a decent improvement. But for those on a budget, needing active noise cancellation, or wanting a more dramatic design shift, looking elsewhere might be wiser.Overall Rating: 3.5 out of 5 stars","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Massively Big In Your Ears Falls Out","reviewDescription":"While the spacial sound is a nice perk, it’s not worth the money over the Gen 2. While neither Gen 2 nor Gen 3 have active noise cancelation, since Gen 3 have a looser fit and leave more room between your ear canal, outside noise like people speaking or gym radio is approximately 35% louder than Gen 2.  The ear piece itself is much larger than previous models. I have a big head and big ears, and these feel like they’re about to fall out constantly.  Definitely do not fit snuggly in your ear even after learning you should twist the pod slightly upward towards your face. Apple removed the tap controls and replace with a physical plastic button that you have to hold with 2 fingers, otherwise pushing it with one finger could cause the unit to fall out. I’m still within my 30 days and highly considering sending back and getting the Gen 2 again.  Apple… do better.  Your plastic toys are too expensive to be this poorly designed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Ordering from Amazon does not provide the same quality level of support as ordering through Apple","reviewDescription":"After I finally realized that I could not get the apple AirPods Generation 3 to fit my ears, it was beyond the Return Date. Fifteen days wasn't enough time for me. So, decided to plead my case to Apple and Amazon respective Customer Support. Apple attempted to be helpful to allow a return; however, apple could not provide a Return label because Apple Post-Sales Support needed an Apple Store (online or brick-mortar) Order number and because the product was ordered through Amazon, I only had Amazon order number. My only option per Apple and Amazon was to go to a physical AppleStore and plead my case.Perhaps typical post-return date' issues, there is no difference when ordering from Amazon or direct through Apple. However, it was an unexpected difference in this case and knowing this before purchase would have been helpful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Beautiful sound…on the ground.","reviewDescription":"Apple loves to make everything shiny and smooth intentionally so we lose or drop their devices and have to buy replacements.  It’s my right ear.  The AirPod kept falling out constantly! Yes these work great the sound is amazing the base is incredible I was so happy until the right one kept falling out on to the ground.  So if you have had issues with AirPods  staying in your ear don’t buy these.Thanks an apple Thanks for making phones so smooth they fly out of hands and break.  Thanks for making AirPods so smooth they fall out and get lost.  They make billions in damaged product they’re not about to stop.  They know what they’re doing.  I returned them next day.  Apple, make the material rougher so they stay in the ear.  Or hire a designer with bigger ears so they make these slightly bigger next generation!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Not as good as advertised","reviewDescription":"Ive had 2nd and 3rd gen, and I could say that I liked the most the 2nd one.1- On this 3rd gen, you have to press a button to command it. The 2nd gen was about a simple touch. 2nd gen win!2- you can recognize the spatial audio on 3rd gen but it doesnt feel that the sound quality is as clear as the 2nd gen.2nd gen win!The 3rd gen supposed to be an upgrade of the 2nd, but instead I feel that it doesn’t. There’s a few things the company should consider, specially making the sound much clearer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Headphones don’t charge fully","reviewDescription":"I’ve been so frustrated with these headphones the left side consistently won’t charge ! I will leave them in the case all day and plug the case in and it only charges when when it feels like it. Has something to do with there “ optimize battery” feature which who cares about if your headphines are dead every time you go to the gym! Honestly just Over priced headphones that don’t work properly sound quality is okay spend your money elsewhere you can get a better deal and better quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Good sound quality, poor fit","reviewDescription":"Great sound quality and love that they are more compact than the last generation. My only complaint is that it does not have adjustable ear sizing. I have small ears and they do not sit comfortably. They are much too large for my ears and always feel like they are going to fall out of my ears. They are fine for working or poolside, but would never wear them to exercise in fear of losing them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Nice AirPods","reviewDescription":"Apple’s AirPods are truly revolutionary. With a sleek design, exceptional sound quality, and seamless integration with Apple devices, they elevate the listening experience to a whole new level. The convenience of AirPods is unparalleled, thanks to their instant connectivity and impressive battery life. Moreover, their active noise cancellation technology provides complete sonic immersion, making them ideal for use in any environment. If you value quality, convenience, and style, AirPods are definitely the right choice.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Not like gen 1 or 2.","reviewDescription":"Just got these in and tried them. Have had all generations now. Without the ear tip piece like the others these fall out with ease and are quite uncomfortable. Sound clarity is great even without the noice cancellation option which I was sad to find out these don’t have either. I’ll have to use my Gen 2 for workouts and these for leisure.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Small ears beware","reviewDescription":"I upgraded to these from gen 1 air pods. In terms of battery life, sound quality and phone call quality these blow the gen 1s away. The spatial audio feature is pretty neat and is a noticeable difference. I mostly use these for phone calls, whether I’m on teams meetings or having personal conversations. I’ve had people mention how much clearer I sound and how there’s zero background noise thru these vs my old one (that’s saying a lot as I’ll be in meetings while out in the chemical plants). They’re super easy to use. Just open the case and pair them, you can switch over to them during a live call or meeting in a matter of seconds.Now on to the bad; these suckers are waayy bigger than the gen 1s. With all the good I mentioned, if you have smaller ears I would 1000% not recommend these. They can start to hurt insanely bad and that’s if they stay in your ears. Through talking and walking they constantly fall out of my ears. I work at a chemical plant and wearing hearing protection is a normal everyday thing, so I know how to properly insert things into your ear but these guys will not stay in. Then falling out your instict is to catch them and push them back in, but the touch buttons pick that up to hang up your phone call or kick you from your meeting, there is a setting to change the hang up touch from 1 touch to 2 touches- thankfully. The gen1 air pods fit perfectly, idk why it didn’t occur to me that they would change the ear bud size that drastically.2 lessons I learned-1) don’t take all the good reviews for granted and wait to try them incase you have to return them2) these will be the last headphones I buy that don’t have rubber ear buds to allow for size adjustabilityOverall a great buy if you have normal to large ear canals. If you prefer the small rubber ear bud adapter on other headphones DO NOT BUY.","isVerified":true,"ratingScore":4,"reviewReaction":"188 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Amazing sound but shape hurts my ears a bit","reviewDescription":"I love Apple products but to be honest my latest AirPods are slightly disappointing. Unfortunately the shape does not fit comfortably in my smaller ears. They feel uncomfortable and a bit large. Sound is great! Talk is great. Just large","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"OUCH! Small ears beware!","reviewDescription":"Someone recommended the Pro version of these to me, but I was cheap and didn't want to spend the extra money. It really bugs me to have to buy these anyway with the newer phones, but we are stuck. Well, now that I bought them, I learned they can not be returned but these are incredibly uncomfortable! I can only stand to wear for them for a short time before I have to take them out and give my ears a rest. I alternate left and right so keep them from hurting, but it's pretty bad. In addition, they fall out all the time. I'm sure I will lose these eventually. It's really a bad design forcing us to spend more money just to have the ability to assure comfort. I am so sorry I bought these!","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Not as comfortable","reviewDescription":"I bought these for my daughter because I thought a newer gen product would be better. And in some aspects they are. She complained about these “hurting” her ears, so I bought her the 2nd gen pros and kept these for myself. I guess it depends on someone’s ear size and shape, but these were also harder to keep in my ears and were not comfortable. Im hoping there may be a way to add a more flexible silicon cover with smaller tip to add better fit and comfort. The sound quality is there, just a comfort issue. I should have read the reviews which explained this. My bad.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Small ears not comfortable","reviewDescription":"They are good 👍🏾 I like the sound and Spatial Audio and also like that they are wireless for charging. I gave it 4 stars because they are not comfortable in the ears and they also fall out so if you have a small ear canal you might have to purchase some ear tips on Amazon for them, besides that I would recommend","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Excellent Quality...but.....","reviewDescription":"I wanted to try the newer set to see if the quality has improved.  It absolutely has.  There's more base coming through.  It's great for EDM.  That said, they have one major drawback.  They are much wider than the previous versions and fall out of my ears constantly.  I decided to by the silicone covers in the hopes that they keep them in my ears.  So far they do.  We'll see how it works when mountain biking.  For additional data, I'm a female of average height and weight.  There's nothing unusual about my ears.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Falls out of your ear way too easily.","reviewDescription":"These have some good sound, but it's our 3rd pair because they fall out so easily and get lost\/ruined.  If the wind catches them just right while biking, along with the sweat, they seem to come out pretty easily.  We might switch back to the Android version we had since they stayed in our ear just fine.  However the build quality is great with these and the sound is top notch - I just wish they had some kind of silicon body or wrap to make them stickier.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Great sound.  A little bit thicker than the prevous generations","reviewDescription":"They have a great sound, but they are a little thicker in the ear than the previous generations.  As a result, they don't seem to fit as well.  They still stay in the ear, but I feel that I need to push them in periodically.  Putting them in vertically, then twisting the airpod bottom towards your nose helps.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Crystal Clear Sound with Comfortable Fit!","reviewDescription":"I recently purchased the Apple AirPods (3rd Generation) and have been thoroughly impressed with their performance. The personalized spatial audio is a game-changer—it feels like I'm in my own personal concert hall with a full range of sound that is just astonishing. The earbuds fit snugly and comfortably in my ears, and I've had no issues with them falling out, even during my morning jogs, thanks to the sweat and water-resistant design.Bluetooth connectivity is seamless, with no noticeable lag when I'm watching videos or taking calls. Speaking of calls, the call quality is pristine; I've received comments on how clear I sound. The battery life is also a standout feature; I can go nearly a full day without needing to recharge, and with the charging case, I have up to 30 hours of listening time, which is perfect for long trips.The only slight downside is that they don't have active noise cancellation, but the sound quality and spatial audio more than make up for it. They're so intuitive to use—just a simple setup with my iPhone and I was good to go. The Lightning Charging Case is a sleek and convenient way to keep the earbuds powered, and it's small enough to slip into my pocket.Overall, the AirPods (3rd Generation) have been an excellent purchase, providing a combination of great sound quality, ease of use, and robust battery life. They're an ideal choice for anyone looking to upgrade their listening experience. Highly recommend!","isVerified":true,"ratingScore":4,"reviewReaction":"28 people found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Pretty expensive, great quality","reviewDescription":"The rechargable case is nice. The battery life so far has been great. They do often feel like they're about to fall out of my ears, but they haven't fallen out yet!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Awesome product!","reviewDescription":"I use these every single day! They are light weight and sit in the ear perfectly. The battery on them is incredible compared to my previous ones. I would recommend these headphones over any on the market right now.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Worth buying over the 2nd gen.","reviewDescription":"The difference in battery life is at least double. I’m in long calls (2hrs) often and was very impressed by the battery life. After I bought the 2nd gen I went back to wired. Once I bought these I haven’t used them since. Expect 3 hrs of voice call use before putting it back in the case to recharge.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Second pair","reviewDescription":"First pair was bought at Walmart and wouldn’t charge properly. Was going to take them to the Apple Store but they got washed in the washer. This pair works great and they are comfortable and sound great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"i like them","reviewDescription":"they aren’t better than the pro edition but it’s a nice upgrade for gen 1","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"good fit","reviewDescription":"i got it for my grandson,he likes them","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Audifonos","reviewDescription":"Buenos de calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Los amo","reviewDescription":"Súper lindos, excelente audio","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Great deal","reviewDescription":"Very great deal and  great product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"came in as expected","reviewDescription":"the sound quality is soo good and i love the feel of the 3rd gen pros bc it dosent have that rubber piece at the end, love these.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Best product ever","reviewDescription":"These are great they’re great product for using just about everyone using flying traveling everything they’re just wonderful definitely would recommend getting some AirPods for anything you need out there","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"The Fit and Feel","reviewDescription":"I liked that I could run and workout all the while  keeping the AirPods in my ear.I thought that by them having a weird shape that u would run into many issues with them falling out but they don’t so I would definitely recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Me encantan.","reviewDescription":"Buen artículo, buena calidad. Buen precio. Lo recomiendo!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Perfect","reviewDescription":"Perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Other than the price, an excellent product","reviewDescription":"I'm not an Apple person, but these were from my son for Christmas. And yup, he loves them.  The main reason is just because he can take calls while working on the roofs without needing his hands.  It keeps him safer and allows him to get home sooner since he takes 10-15 calls a day while on the job.But this is for an Apple product - who's going to read this review anyway?  😄I'll tell an Amazon dad-joke to see:Why did the dad bring a ladder to the Amazon warehouse?Because he heard they had the best \"prime\" selection, and he wanted to \"climb\" his way to the top deals!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Muy bueno","reviewDescription":"Colmo mis expectativas, al menos inicialmente, veremos con el paso del tiempo, seguro no me va a defraudar","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Air pods ++","reviewDescription":"These sound great and easily pair with all my apple products.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Worth it","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Not the PRO, but works for me","reviewDescription":"My AirPods Pro started making a horrible static noise while in noise cancelling mode.  I bought these, not knowing that noise cancellation is NOT what they do.Still work well and has a few methods for setting up the sound.  You can check your hearing with an app that creates a profile for YOUR hearing.Highly recommend them, especially if you use Airplay in your car.  Nice handoff from ear to car use","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Good product","reviewDescription":"Product arrived as stated.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great delivery","reviewDescription":"I loved it the product , everything right! Brand new… AirPod 3th generation I am in love! Listening to music all day 😍thanks for a great delivery 👏🏻","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Extremely comfortable","reviewDescription":"These are such a comfortable fit that I fall asleep with them in, callers no longer complain that they can’t hear me and I have no troubles hearing them. Easily pairs with my devices.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Good quality","reviewDescription":"I truly did need these for work. My job requires me to use ear buds and none of the other ones I had purchased were good enough quality. This is the best for any iPhone user. Don’t buy off brand for sure 10\/10 recommend these AirPods","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Apple Airpods (3rd Gen.)","reviewDescription":"I've used them twice and they fit perfectly and I'm happy with the sound. I like that I can walk around without worrying they'll fall out. I actually have another brand of earbuds that are so big they fall out if I turn my head.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Clean!!","reviewDescription":"It’s sooo clear what the artist\/character is saying that it feels as though they are right next to me! A little scary.The connecting is quick and clean","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Spatial Audio…","reviewDescription":"The have so many pros…spatial studio, how long they stay charged etc. The only con is they might fall out of your ear depending on the ear shape you have.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Works great!!","reviewDescription":"Husband got them for me for Christmas and they are awesome!! If you take one out the other one will pause the music and you can change what you’re listening to by tapping the bottom part. The sound is good on them. I don’t know on the base side but it’s really strange when you can’t tell if you have head phones on or not and you can hear your phone perfectly. Until someone tries to talk to you and you can barely hear them. I love them tho!!Only down side is I have small ears and if I was running or walking around I don’t think I would have any issues but god for bid I have a little strand of hair or something it will just rip the thing out of my ear. Definitely a hair up kind of wear 😂 I still love them tho even if that is my only ick.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Immerse Yourself in Wireless Audio Bliss - Apple AirPods Redefine the Earbud Experience","reviewDescription":"The Apple AirPods (3rd Generation) are the epitome of wireless earbuds, delivering a remarkable audio experience that combines convenience, style, and cutting-edge technology. With their sleek design, seamless connectivity, and impressive sound quality, these earbuds take your music, calls, and entertainment to a whole new level.The standout feature of the Apple AirPods (3rd Generation) is their effortless wireless connectivity. Simply open the charging case near your iPhone or any other Apple device, and the earbuds instantly connect, ready to deliver your favorite tunes. With the Apple H1 chip, the AirPods offer a stable and reliable wireless connection, ensuring uninterrupted audio streaming and crystal-clear calls.The AirPods (3rd Generation) are designed to fit comfortably in your ears, thanks to their ergonomic and lightweight construction. They come with three different sizes of silicone ear tips, allowing you to find the perfect fit for enhanced comfort and a secure seal. Whether you're running, working out, or simply going about your day, the AirPods stay in place, providing a hassle-free and comfortable listening experience.When it comes to sound quality, the AirPods (3rd Generation) excel. The custom-designed high-excursion drivers deliver immersive sound with rich bass, clear mids, and crisp highs. Whether you're listening to your favorite music genres, podcasts, or audiobooks, the AirPods reproduce the audio with impressive clarity and detail, allowing you to immerse yourself in your content.The Apple AirPods (3rd Generation) feature built-in beamforming microphones and an updated speech-detecting accelerometer, ensuring clear and natural-sounding calls. Whether you're taking work calls or catching up with friends, the AirPods capture your voice with precision and minimize background noise, providing a seamless and efficient communication experience.Siri, Apple's voice assistant, is always just a \"Hey Siri\" away with the AirPods (3rd Generation). With hands-free access to Siri, you can ask for directions, control your music, send messages, and more, all without reaching for your iPhone. The voice-activated convenience adds another layer of functionality to these earbuds, making them a true smart companion for your daily tasks.The AirPods (3rd Generation) offer impressive battery life, keeping you entertained and connected throughout the day. With up to six hours of listening time on a single charge and an additional 24 hours of battery life provided by the charging case, you can enjoy your music, podcasts, and calls without worrying about running out of power. The quick charging feature provides hours of use with just a few minutes of charging.With their seamless integration into the Apple ecosystem, the AirPods (3rd Generation) offer a seamless and effortless user experience. They automatically sync with all your Apple devices, allowing you to switch between them seamlessly. Whether you're listening to music on your iPhone, watching a movie on your iPad, or making a call on your Mac, the AirPods connect effortlessly, providing a truly wireless and versatile audio solution.In conclusion, the Apple AirPods (3rd Generation) redefine the earbud experience with their sleek design, effortless wireless connectivity, and impressive sound quality. Whether you're a music enthusiast, a busy professional, or an on-the-go individual, these earbuds offer convenience, comfort, and outstanding audio performance. Immerse yourself in wireless audio bliss with the Apple AirPods (3rd Generation) and elevate your everyday listening experience.","isVerified":true,"ratingScore":5,"reviewReaction":"107 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"AirPods 3rd Gen: The Earbuds That Have It All (Except Maybe a Coffee Maker)","reviewDescription":"In the whirlwind of technology and endless gadget releases, Apple's AirPods (3rd Generation) stand out like a beacon of simplicity and sophistication - much like a well-written piece of code in a sea of programming chaos. As someone who's no stranger to the tech world (hello, countless hours of coding and debugging), I've found these AirPods to be an essential accessory, almost as crucial as my laptop.First off, let's talk about the personalized spatial audio. It's like having a surround sound theater plugged directly into your ears, minus the bulky headphones and popcorn kernels. Whether I'm immersing myself in my favorite tunes to escape the monotony of debugging or catching up on tech podcasts, the sound quality is nothing short of stellar. It's an auditory experience that makes you question if these earbuds secretly house a team of tiny musicians.Sweat and water-resistant? Absolutely. For someone living in sunny and sometimes sweaty Florida, this feature is a godsend. It means I can go from a coding marathon at the University of Florida to a literal marathon (or, let's be real, a brisk walk) without worrying about my earbuds throwing in the towel before I do.The convenience of the Lightning Charging Case is like having a portable power bank specifically for your earbuds. It's compact, efficient, and ensures that my AirPods are always ready for action - much like my trusty laptop, always charged for those unexpected coding sessions.Now, let's talk battery life. Up to 30 hours? That's longer than some of my longest coding sessions (which is saying something). It's reassuring to know that my AirPods will likely outlast my laptop's battery and my own energy levels.In the world of Bluetooth headphones, the AirPods 3rd Gen are like the sleek, high-performing sports car everyone wants to drive. They pair seamlessly with my devices, ensuring I'm always just a tap away from crystal-clear audio, whether I'm taking calls or drowning out background noise to focus on my work.In conclusion, Apple's AirPods (3rd Generation) are more than just earbuds; they're a lifestyle upgrade. For tech enthusiasts, coders, or just about anyone who appreciates quality sound and convenience, these AirPods are a must-have in 2023.","isVerified":true,"ratingScore":5,"reviewReaction":"131 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Best AirPods","reviewDescription":"The person who delivered them was really nice didn’t damage them there base is really good the case and box was in good shape didn’t get thrown over all these are good AirPods and thank you for the guy that delivered them","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Los mejores que comprado","reviewDescription":"Son geniales tienen un buen sonido ambiental no se despegan de tu oído facil y muy cómodos me encantaron después de tener los airpos 2 generación el 3 son mejores","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Great gift for my boyfriend!","reviewDescription":"I ordered these Air Pods 3rd Generation for my boyfriend's graduation gift and he absolutely LOVED it! He did mention that at first the fitment was weird but to just give your ears time to adjust. This would be a great gift for any occasion.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Really good Airpods","reviewDescription":"There is many things to love about these the sound is amazing and crisp. The AirPod fits in my air very nicely and is comfortable even after hours of use. The battery life is amazing. The only down side is the case feels cheap in a sense the click when you close it feels like plastic.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Overall pretty good","reviewDescription":"So overall the Airpods are great! I gave a 4\/5 because the box has dirty smudges on the front that I cant seem to get out. Like literally the smallest thing ever ik but it was the first thing I noticed.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1688774400000}
{"reviewTitle":"Great sound quality!","reviewDescription":"The Apple AirPods are my favorite.  Better sound quality then Beats products, which Apple also owns.  The only negative issue is, the left AirPod occasionally falls out of my ear.  I’m looking to get a rubber sleeve to place over it to keep in more secure. Also, solid construction, no damage after falling out of my ear a few times.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Good battery life","reviewDescription":"The sound quality is not as good as Airpods Pro 2nd Generation, but the battery life is fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"Decent product","reviewDescription":"They work great and stay in just fine but hurt my ears after about a hour","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Big for your ear.","reviewDescription":"I Love the AirPod they just a little bit bigger than the old ones but I love them.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Larger than the 2 series so a bit more difficult to get in my ear.","reviewDescription":"See above.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Greatt","reviewDescription":"Product great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"Good to have","reviewDescription":"Need them for work so I don’t have to hold the phone the only uncomfortable thing is that they fall out of your ear easily","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Good Earphones but not great.","reviewDescription":"I wish I had gotten the pros. Would be nice having the silicon dub piece for better comfort. But overall, good for daily use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Squeeze sensor","reviewDescription":"Maybe I didn’t read enough about the new AirPods but they have a squeeze sensor, not a tap sensor. They sound great but the squeeze sensor is a huge L for me. I loved the tap sensor.  I work on cars for a living and wear my AirPods all day and the tap is perfect for when I have grease and dirt on my hands. The squeeze sensor is going to ruin these headphones quick.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"To large","reviewDescription":"I sent these back because they were made for bigger ears. They wouldn’t stay in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Miss my Plantronics","reviewDescription":"These headphones are taking a lot of getting used to after having the Plantronics Bluetooth fitbits for the past five years.  The sound quality is good, but they fall out easily. I’ve changed the earplugs and they stay in even on the treadmill but I miss my ear clips for peace of mind. Also, the noise canceling gave me a severe headache, so I just use them on transparency mode.  Also, if I use them for a long time, I will get a pain in my ear. It feels like it’s burning. I assume this is due to the Bluetooth frequency. I’ve never had this before. Maybe it’s just me but it’s weird.The best part about these headphones is the superb phone quality. No ambient noise to the person on the other end.  Wash dishes, use the restroom, they hear nothing.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"No noise canceling???","reviewDescription":"I like my 2nd gen much better.  Never had a prob with them falling out.  I wear to gym to run and workout and these feel so uncomfortable and fall out.  Doesn't have the soft tip to ensure a good solid fit ! Still stunned no noise cancelling feature.  My gym is loud.  Ugh.  Back to Gen 2.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1699833600000}
{"reviewTitle":"Too big!","reviewDescription":"Or, I suppose, the issue could be my ears are too small. I only wear these sitting in my recliner in the evening otherwise I would be afraid of losing one of them. I had my 1st pair for years, but I know this pair would not last as long. Presently looking at hooks to keep them in place.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Weird Smell on Box","reviewDescription":"Straight out the shipping box the headphones box had a terrible funky smell all around it. Smell like that wiped their butt with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"Clear and loud, does not fit like 2nd gen","reviewDescription":"These work as expected, but I am disappointed they do not fit as comfortably as the 2nd gen earpods. The audio quality is the same as the 2nd gen, in my opinion. I wish I would have bought a replacement pair of 2nd gen instead of upgrading.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Not good headphones","reviewDescription":"I'm an Apple fan and had a great set of the 2nd pods. These don't do well. The charging is whacked. The phones and the case don't charge at the same rate.  I often have the pods die after 30 minutes to find the case is at zero.  Even with the high speed cord, the case takes overnight to charge and even then it may not be fully charged.  Bought another charging case and that couldn't seem to keep the pods charged either.  They are fine when working, but they only work 30 minutes and then at least 4 hours to charge when it should only take ten minutes.  Very disappointed with these.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Be aware, does not wirelessly charge","reviewDescription":"I had a prior pair of 3rd gen airpods and assumed (my mistake I suppose) that these were the same product. I was mistaken. These do not wirelessly charge with their delivered case. It took me awhile to adjust to the fit of the 3rd gen but now I can’t go back to the smaller, older design. Also be aware that this is my 6th airpods of any stripe because despite mic cleaning suggestions, the right mic has failed on all versions within a year. I keep buying them however… so that is something to consider because they really are a good product when in new condition. Overall, I’m lukewarm because its a good product (but expensive) that doesnt last.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Great Sound","reviewDescription":"Great sound! Good connectivity. I like the ease of use on the 2nd generation as opposed to the 3rd generation. All and all a good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Goos pods","reviewDescription":"Great pods, good sound. Long lasting battery and will charge from the case on the go.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"The ear plug is larger","reviewDescription":"Although the AirPods are a superior product, the 3rd generation does not come with an option of the size for the ear plugs themselves. These are larger than the second generation, so they are more apt to possibly fall out the eat if your canal is smaller.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Good but bad packaging","reviewDescription":"Before buying you need to know that they fall out easily so I’ve gotten quiet the bit of scratches but all good sound quality is amazing but the packaging was horrible no insolation it was just in a big box being tossed around and when I opened it the box was hot! So I’ve had it for more than 2 months and has been good","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Great product","reviewDescription":"the only problem is they don't fit my ears very tight","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Great sound harder to hold","reviewDescription":"These have much better sound than 1st generation. Only thing I don’t like is that the iPods are a bit shorter and are harder to hold. I find I drop these often because they are harder to hold. Not ideal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Love These Buds - Still Fighting with fit","reviewDescription":"These buds work as expected. The sound is great. They connect when I open the phone and apps.The fit i struggle with. If I lean one way or another one inevitably falls from my ear. Not Apples fault but still frustrating!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Good ear buds","reviewDescription":"Great sound.  So so noise cancellation.  Don't fit snugly so would not recommend wearing to the gym or bike riding with them.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"they’re loud","reviewDescription":"they’re coo it’s js the battery goes out kinda really fast n falls out my ear when it’s in for like 45 mins but overall it’s good the quality is really clear i like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Good","reviewDescription":"Good, great battery, sound, what you'd expect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Airpods","reviewDescription":"The only thing is that they are hard to keep in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Previously Owned?","reviewDescription":"These were for my younger teen. They came like brand new, wrapped up like something you’d buy right from a place like, Best Buy. What I found very inappropriate was that at pairing them with my teen’s phone it came up as “SUP BI$&h.” So left me wondering if these were pre-owned or ? We shall see how well they work. I paid good money for this older version of iPod. So we shall see.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"disappointed","reviewDescription":"these were my first pair of airpods, and i wish i would have gotten the airpods pro instead based on what people are saying. the mic quality is extremely terrible 😭 though one feature i really like is how they immediately connect to your device as soon as you take them out :) wouldn’t buy again though","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Read the fine print before buying…","reviewDescription":"Make sure you understand there is no noise canceling… and in fact the 2nd Gen fit better in your ear. It’s a better seal and of course you can block out the noise around you. It’s so worth the extra cash. They still sound good. Probably better for cycling hence being able to hear people around you.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Gen three airpods","reviewDescription":"Had I waited just a few days I could have gotten a better price alas I paid more for a product I needed sooner than later. The pods are great, I really enjoy this new generation, they are smaller and have been upgraded since my first pair of when they first arrived on the market.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Less comfortable than the previous version","reviewDescription":"I thought the AirPod 2 were extremely comfortable but the AirPod3 (which I purchased due to the waterproof feature) are borderline uncomfortable—I will hopefully adjust … or they are going to be returned!  Also the case is less user friendly than the previous version—doesn’t have a light indicating the charge level.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Nice Ear Buds","reviewDescription":"A friend had purchased the same eye buds prior to me receiving my delivery. I tried on their ear buds and found them to be too big for my ears. They kept falling out. When I received my delivery Never I returned them unopened to Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Speaker blew","reviewDescription":"Speaker in one blew out within 2 months of having them randomly, was fine when I took them out and next morning when I went to use them I couldn’t hear anything out of one. Now I can buy barley at all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Don't get for quality","reviewDescription":"Hear me out. I had bought these AirPods after years and years of anticipation for getting some. I've always wanted them forever and finally stepped up and purchased them. When I took them out the packaging, the design and appearance of the overall product was immaculate (not to mention the fast shipping). But once I connected them to my iPhone and played music with immense bass and quality, I was instantly disappointed.  I have previously used AirPods Pro (2nd Gen) and the audio containment\/quality could not compare. Even using $20 wired headphones with earpieces hold the sound and immerse you into the song. I'm assuming this is the absence of earpieces on these AirPods, but regardless, the sound is crisp but not amazing. Don't get me wrong, everything else worked out fine, from the connection to the battery life, but if you are looking for studio quality headphones and decent noise cancellation, there are plenty of better options.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Not as good as Pros","reviewDescription":"Not as good as Pros","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Good sound","reviewDescription":"It has good sound, it eliminates outside noises completely, the only thing I don't like is that sometimes it slips a little out of the ear, so you have to insert it quite a bit into the ear which can cause some discomfort, the charging time is long.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Good purchase","reviewDescription":"Work better than my Pro’s","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"The sound","reviewDescription":"The fit & comfort","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"The product description is misleading!","reviewDescription":"The Apple Airpods Gen 3 are amazing in terms of quality and fit. HOWEVER, this listing says they come with a Magsafe charger, and they DO NOT. The pair I received was lightning cable charging ONLY. So beware. The price is still good for what you get compared to the Apple website for the same item, but you are NOT getting magsafe charging with this item.","isVerified":true,"ratingScore":4,"reviewReaction":"21 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Gifted","reviewDescription":"Purchased as a gift. Owner seems happy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Bigger than expected","reviewDescription":"I like the sound quality and happy for the, now, longer battery life.  My ears must be smaller than most and I have a hard time keeping the ear buds in if moving about much.  I would never wear for running or workouts.  Might give these to hubby and go back to Gen 2.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Nice sound","reviewDescription":"Better quality than the other generation","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Beware small ears","reviewDescription":"The pods are bigger than the 2nd gen - kind of a weird fit but the sound is better with more bass. I have average sized ears and they fit well. My SO has smaller ears - they fall out but we have 2nd gen’s that fit her better. Is the extra $50 over the 2nd gen worth the cost? Probably not.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Love them but they are too big for my ears 😞","reviewDescription":"I have the 2nd gen AirPods and I love them they are great perfect for my ear, but I wanted to buy the 3rd gen for the features, and they are amazing, I love the quality sound, the battery life is great, but they are too big for my ears, I am afraid they might fell down, they are not comfortable, sorry apple","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"The Pros are better","reviewDescription":"I like the sound quality but it's kinda like the regular AirPods where you can't turn up in quiet spaces because the sound can leak through. They can also be quite uncomfortable and I can't lay on my side with them in without getting annoyed and they tend to fall out my ears when they get waxy (I clean my ears almost every day but when I have these in my ears for a longer time they tend to get like wet I'm not sure why??). I think getting the regular pros is your best bet because of their noise cancellation, the lack of sound leakage, and they're more comfortable to have in your ears.","isVerified":true,"ratingScore":4,"reviewReaction":"34 people found this helpful","country":"United States","date":1690675200000}
{"reviewTitle":"Constantly falling out of my ears","reviewDescription":"Constantly falling out of my ears. The shape is not very form fitting and doesn’t snug into your ears. I wanted the apple pro hat for the pairing simplicity but from an ease of use point of view I think next time I will get another brand.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Confused?","reviewDescription":"Just bought these AirPods and they just arrived but the moment I tried connecting them this pop up shows up I thought they were going to be new? I looked everywhere to where it says previously owned and no I didn’t buy a refurbished one seems a little misleading to not say they were previously owned","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Good sound but bad design.","reviewDescription":"The sound is great and it is very user friendly with setup and everything but you have to sit still if you’re wearing them. I bought these for my morning walks and there is just nothing holding these in. They fall out non stop","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Beautiful sound, terrible fit","reviewDescription":"The sound quality is incredible, but they are an awkward size and shape and fall out of one ear or the other on a regular basis -- unlike my earlier 1st generations.  Sad to say I have to return them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Not impressed with the size","reviewDescription":"This does not compared to the first generation. Although the battery life is better, it is too big for my ears and they fall out constantly so unfortunately I don’t get to use them. I will be re-gifting them to someone else.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Like the 2nd gen better","reviewDescription":"There aren’t silicone earpieces that snap on these that I can find. So what you see is what you wear and it isn’t as comfortable.  Wished I would’ve ordered the 2nd instead.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Love them so much!","reviewDescription":"I love listening to music with these because the audio quality is so good. I was so happy with these for a month. The battery quality was long and they weren't super bulky. My issue is that I lost one of the airpods and when I try ringing them- I can barely hear the sound in the airpod that isn't missing when it's in my ear, so there's no chance I would be able to hear the other earbud while its lost. Also, it says my lost earbud is at my friends  house (which is really far away) even though the last time I used it, it was at my house. I can't seem to find it anywhere. Another issue I had was that whenever I ran- the airpods would fall out of my ears. I'm really disappointed that I lost the earbud and maybe if the ringing was louder I could find it- but it's also my own fault. I would recommend these airpods if your not forgetful and clumsy like me.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Pricey, easy to lose them, but they sound ok.","reviewDescription":"First issue I have with these is that they never seem to stay in my ears, they want to come lose and fall out, and they have..  they are really small so if they fall out on the subway during rush hour. You can say goodby to them. I keep my ears pretty clean but ear wax builds up on the screens from constantly having to shove them back into my ear and find a position where they stick. Not an easy task. And a little gross. Sound is ok but some of the quality is lost  since they don’t quite sit in my ears properly. For the price not worth it. I would rather have gotten a pair of wired Sonys. Live and learn.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Nowhere near the fit of the 2nd gen.","reviewDescription":"One of my current (2nd gen) AirPods only holds charge for about 20 minutes now.. so instead of paying $50 for Apple to replace 1 AirPod I decided to upgrade and managed to get the 3rd gen for $129 on prime day.These are larger than the 2nd generation - As a result, if I’m doing anything other than sitting or laying still I will feel them slowly moving towards the outside of my ear and I will have to push them in again.If I’m running or holding things then good luck not having them drop on the ground..I tried adjusting them according to the Apple instructions but nothing seems to be keeping them in place. They are just not as snug as the previous generation.The sound is AWESOME but unfortunately due to the poor fit I will be returning and reordering a new pair of the 2nd gen :(","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Not good for smaller ears!","reviewDescription":"I've used several sets of the 2nd Gen AirPods and really enjoyed them - all of which I used to destruction.  I was ordering a replacement when the 3rd Gen came across my search so I thought \"newer must be better\", but in this case not so much.These are substantially larger and clunkier than the 2nd Gen IMO, and they fall out of my ears pretty easily, making them practically unusable.  Further, the stems on them are shorter and the \"tap\" feature from the 2nd Gen has been replaced with a button you press on the shortened stems.  So every time I reach to squeeze the stem to push the button they fall out even more easily.  The \"tap\" feature would at least reinforce keeping them in my ears!I'm returning and ordering a new set of the 2nd Gen and will wait until I kill those in a year or two.  These newer ones are just not a good fit for me.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"Falling off easily, very uncomfortable...","reviewDescription":"I have been using AirPods Gen 2 for more than 2 years, and they were great. I use them mostly everyday. Right-side mic stopped working and I thought it's time to upgrade. Ordered Gen 3 despite the \"falling off\" reviews... Those reviews were right, they stay if you stay still. However, in every mimic you do, they move and if you laugh or something they just fall off. Returned them the next day and ordered another pairs of Gen 2. Sound quality doesn't matter much if it doesn't stay in your ears. I am a male and don't have small ears. This is the first Apple product that I disliked. Apple, please don't stop producing Gen 2 AirPods.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Too big in ears","reviewDescription":"The sound is great, just like 2nd gen. MY two biggest problems are:1) they're too big for my ears. Not a good fit, sort of loose and I'm afraid they'll fall out if I move too quickly...or at all.2) I don't like that you have to actually push the little button on the airpod to skip. You can't do it with one finger so you have to basically pinch the stem, which just loosens the thing from your ear (see problem #1).Stickin' with 2nd gen...just wish they weren't so long and dorky looking.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Stopped working days after refund expired","reviewDescription":"One of the ear buds just stopped working. Won’t charge, just won’t work. Just one of them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Ear buds fall out","reviewDescription":"These Apple air pods do NOT come with any way to adjust the ear buds for my ears, as apparently earlier versions have. And Apple support was zero help. And I just tried them today, about 3 weeks after receipt, and I’m out of the return window. I had to turn volume much higher than other brands due to poor fit. I took a walk and one fell out. I exercised and both fell out numerous times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"Beware","reviewDescription":"This item is not new. I didn't read the :small print\". I will be returning.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Ear buds are too big","reviewDescription":"The 3rd generation ear pods are too big. The first generation fit fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Not worth it, even Black Friday discounted price","reviewDescription":"There small, pop out of ears easily and not noise canceling","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"These hurt my ear","reviewDescription":"These hurt my ear because they didn’t sit in the ear properly so I returned them and purchased the pro 2nd generation which has the lil silicone ear piece which is much better and have much better sound than these. Go with the AirPod pro 2nd generation instead of these if you’re looking for AirPods.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Don’t fit in ears","reviewDescription":"Very uncomfortable in our ears for my daughter and I","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Damaged","reviewDescription":"R pod stopped working one to two weeks into using","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Too big","reviewDescription":"Idk if my ears are too small but these keep cutting the inside of my ear","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Larger size does not seat well in the ear","reviewDescription":"The size of the gen 3’s has gotten larger compared to the two previous versions, and now they are just a little too big for a comfortable fit.  I was constantly thinking these were going to fall out and be lost forever.  I put them back into the case to prevent their loss.In addition, the sound quality was\/is not substantially better than the gen 2’s of my past.  I returned these and purchased a second pair of the generation 2’s.What’s more, a different charging cable is provided, one that does not fit the ‘standard’ usb charging port. Yet another problem.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"Work great but covered in wax","reviewDescription":"I bought these “new” but received them covered in ear wax. These were a Christmas present for my teenage son. After deciding to just clean the ear pieces off really well, they work great. Son chose to use these vs waiting for return and another potential new” pair.  Work well but definitely not new!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Loose, vastly inferior to Pro 2","reviewDescription":"I have no idea how this product has gotten a nearly 5 star average review. After someone who used AirPods Pro to do using these, these are terrible. They are extremely loose no matter how many different configurations you try in your ear or how many articles you read on how to make them fit. Noise cancellation is nearly 0 and for $150. I would expect noise cancellation to be pretty great. For an apple product, This is like a zero out of five. For regular product. I’d give it a two out of five for the price.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Preowned","reviewDescription":"The AirPods themselves are great and in great condition however, since they were bought preowned the previous owner failed to remove the AirPods from their apple id and now i can tracked by the previous owner. i’ve contacted both apple support and amazon support and neither of which can help due to apple’s security :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"They were okay","reviewDescription":"I didn’t like the fact that they didn’t have the ear cushion because they would fall out pretty easily and hurt my ears. They didn’t change much from the first generation of AirPods just made them smaller. I wasn’t very impressed, the noise cancellation feature didn’t even work for mine either.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Earbuds Did Not Fit for My Ears","reviewDescription":"I had the 2nd Generation AirPods which I lost in an airport.  I should have reordered the 2nd Generation, but decided to step up to the 3rd Generation.  I read that the shape of the ear bud was a little different, but thought it would be ok.  Unfortunately the ear piece was just a little too large for my ear and wouldn't stay in my ear.  Also, the 2nd generation charging cable was USB on one end so I could plug it in my computer to charge the AirPods. 3rd generation is lighting, and I don't have that port on my computer.  3rd Generation has a longer charge from the description, and that would have been very nice; however, they just didn't work for me.  I ordered a replacement 2nd Generation, since I like my AirPods.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Box was greasy","reviewDescription":"The AirPod box was greasy and looked old but unopened. I was also told it would require a signature when delivered but instead it was just left at front door where anyone could have taken it. Just because the delivery driver took a photo of it at my front door does not mean that it was properly delivered.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Too big for small ear openings :(","reviewDescription":"Do not buy these if you have small ears and ear openings! They do not work sadly. Tried all the twisting methods and everything. Don’t work for small ears. Returning to just buy the 2nd gen again. Sound is amazing though if you can put them in your ears.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"I already wrapped it due time restraints with christmas","reviewDescription":"Becareful package came damaged. And the actually product box was damaged and a whole in the box but not sure if they would of been back in time so I guess we will see what happens christmas day but do better on taking care of the products we purchase","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Excelentes","reviewDescription":"Son los segundos que compro ya q los anteriores los perdí en el trabajo me encantan estos audífonos cómodos y larga vida de la batería los uso a diario en el trabajo y a todas partes q voy. Apple 100% recomendados","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"buy this you won't regret it!!!!","reviewDescription":"This product is perfect, I've had it for approximately 4 months and I use it at the gym, to clean the house, for phone calls, among many others and it has never let me down! excellent value for money, if you wanted to read a review to decide if it is worth it and if you should buy it, here it is: buy this you won't regret it!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Works well with all components","reviewDescription":"Good Apple quality…. As usually","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Sounds great","reviewDescription":"Bigger than gen 2 so it feels different in your ear holes","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Airpod","reviewDescription":"I liked them very much","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"great headphones","reviewDescription":"very good sound quality and fits snuggly into my ears definitely recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Works great!","reviewDescription":"Purchased these for my teenager, she uses them everyday without issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Awesome","reviewDescription":"Puts my gen 2 to shame! Very clear sound and definitely recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Nice","reviewDescription":"Love controlling things on my airpods and not having to open my phone to do things. It charges your airpods really fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"airpods","reviewDescription":"so amazing, the airpods work really good⭐️⭐️⭐️⭐️⭐️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"NEVER BEEN MORE DISAPPOINTED!!!","reviewDescription":"I was very happy to get these airpods....I have had every manner and design of bluetooth headset \/ earpiece, etc. Been using them for easily 20 years. So - when I decided to get the stupid little earring looking things from Apple so I could look like a hipster doofus....I was dubious to say the least!!! However, I purchased the Airpod Gen 3 without looking at reviews - I figured the latest version is the best, right!?!? WRONG!!!!! These stupid things will NOT stay in my ear. I have tried all the stuff I've read on line - little silicone coverings, little hooks, little this, little that....bottom line - the stupid little things will NOT stay in my ear under any circumstances. I have lost count on how many times I have had to dig around under my desk, under my bed, under my car seat.....haven't dropped it in the toilet, YET.....but it's coming. I have no idea if the little rubber tips on the gen 1 & 2 make a difference, but given my experience with these stupid things....I will NEVER purchase another ear ANYTHING from Apple. Maybe I have little elf ears or something, but after looking on line at reddit threads and reviews on Apple and Amazon.....it does not appear I am the only one that has this problem!!! Hate them w every fiber of my being!!!! would not recommend - not even to my worst enemy!!!","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Defective, Return Policy not what I expected.","reviewDescription":"I already own a pair of the Gen.3 Airpods. I like them, so I decided to purchase a pair for my wife for Xmas. No problems pairing with her Iphone or charging with the provided cable, but the case would not charge wirelessly. I tried doing a factory reset and also tried using 3 different wireless chargers. All of the chargers worked with my own Airpods, but not with the new ones. OK, I understand that these things happen. Amazon returns have always been easy for me, but not this time. When I initiated the return process, I found that this item cannot be returned by dropping them off at a UPS store using a QR code. I had to initiate a chat with an Amazon representative, who told me the ONLY way to return the Airpods was to have them picked up at my home by UPS. This makes no sense to me, as it would have been a lot more convenient for me to drop them off at UPS myself. I was more than willing to do that, but that wasn't an option..... So right now I'm sitting home all day waiting for UPS to bring a shipping label and pick them up. Hopefully UPS will show up. Complete waste of my time.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Product defective and the refund delayed yet again","reviewDescription":"AirPods did not charge even though it was a returned item before by previous customer and  Amazon stated the item was ‘like new’. I initiated the return within 36 hours of receiving the defective item. The AirPods were picked by UPS on the second day later. Amazon has had this item in their possession from the start of return at 6 days. First refund of monies was after the AirPods were sitting for 17 days in the warehouse. (yesterday) Now today they have delayed for another 3 days overwritten with a new date like the previous one never existed. And now it has been delayed once again to 4 weeks of having the AirPods returned.Really Amazon? Like I and my family only spend multiple thousands of dollars with you every year.I would recommend that customers get their AirPods direct from Apple instead of having their money tied up by Amazon on the chance that the item proves defective.February 8th I still have not gotten my refund","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"NO MAGSAFE!! Cannot return. Buyer beware.","reviewDescription":"The AirPods themselves sound and perform flawlessly, just as you’d expect from the AirPod line. The issue I have is that every review I have ever read or seen says that AirPods 3 are MagSafe and Qi wireless charging compatible. These are a sneaky ‘save-a-buck’ option Apple released without telling anyone. So they have a lightning charging port, but no wireless and no magnets to stick to a MagSafe charger.The next issue is that there is no easy way to return them via Amazon. They want you to troubleshoot the item and it’s an endless loop that keeps telling you to try something different instead of just letting you return.I will never buy another Apple product off their Amazon store again. Waste of life.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"FALL OUT OF EARS!","reviewDescription":"These were purchased in October as a Christmas present at one of Amazon's sales but they were not opened until Christmas and that is when we discovered they do not fit, they fall out of your ears very easily. The return window was 2 weeks later which I did not realize at the time so BUYER BEWARE!!. I called Amazon customer service and explained the issue and was told sorry I can not do anything for you. I told customer service I wanted to purchase a different model but I was still told that they could not help me. I have learned the hard way not to purchase your grandchildren Christmas presents in a timely manner but to wait until just before and hope they are not out of stock or you are out of luck returning it. If Amazon customer service could help me with this I would really appreciate someone getting in touch with me.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Returns are a nightmare with Amazon","reviewDescription":"The AirPods are great. However the 3rd generation has a wired lighting cable charging case that’s not wireless charging compatible and a wireless charging MagSafe case that’s more expensive but worth it if you invested in wireless charging.FYI if you figured out the difficult way you got the wrong AirPod edition, Amazon’s return for AirPods is different from most other things. If you set up a return you have to call them to authorize the return and then they set up a delivery with ups with no time except the next day. The drivers will attempt 3 other days. I call ups and they don’t give me any window except be on standby till 7. No option to drop it off at a ups store. Absolutely a nightmare. So you’re better off just going to an Apple Store than dealing with Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"I regret this purchase","reviewDescription":"The product description says up to 6 hours listening time.  they definitely did not last that long for me. I’ve tried it several times I would say tops they made it to about 2 1\/2 hours I received them on February 5 I reached out to Amazon on February 24 and they would not help me so now I am stuck with AirPods that are not great. If I had to do it again, I would certainly not buy AirPods from Amazon again I would just go straight to Apple Store.  There was no benefit or advantage to using Amazon. I really regret this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Buy them new.","reviewDescription":"I bought mine refurbished as it was slightly cheaper, turns out that once an Apple product has been connected to someone’s iCloud account, only they can remove the item. When I received my pair of headphones they worked fine but I eventually got a pop up later in the day informing me that they were connected to a different iCloud account. It turns out the previous owner still had them connected and could see where they were, this means my location was being shared with someone. I immediately turned them off and contacted Amazon. Amazon did not see the location tracking as big of an issue as I did and requested I return them. After the whole process was completed, I was informed I needed to wait longer for a refund as the Apple product refund process is more difficult and complicated. BUY THEM NEW.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Junk","reviewDescription":"What a waste. For the money that Apple charges for these 3rd Generation AirPods, they truly aren't worth the investment. I purchased these because I was looking for improved sound from my 2nd Generation AirPods. First, the sound is a very slight improvement over the 2nd Generation AirPods and definitely not worth the extra $$. However, several months after purchase, the AirPods started experiencing intermittent charging issues. I spent hours on the phone with Apple Support trying to fix the issue with no luck. Finally, they had me send the AirPods back to Apple for bench testing. What a waste of time, Apple plugged the unit into their bench testing unit and determined that there was nothing wrong, they literally had the AirPods for two hours and returned them without being repaired or replaced. Several days ago, after one week of non use of the AirPods, I went to use them. Once again, the AirPods were at zero charge, even though the case showed 63% battery. These things are expensive, yet Apple doesn’t support the product, and they simply don’t work. Also, their bench test is a complete joke. I’ve provided photographic proof of the issue, yet Apple continues to deny and accept their responsibility for shoddy manufacturing, oversight, and quality control, even though these AirPods are still under warranty. Bottom line, don’t waste your time or money on this poorly designed, manufactured & supported product. In the future, I'll take a very long look at competitors products before purchasing another Apple product again.","isVerified":true,"ratingScore":1,"reviewReaction":"57 people found this helpful","country":"United States","date":1683158400000}
{"reviewTitle":"Do not buy these are used AirPods","reviewDescription":"Bought these for my daughter for our for vacation out of the country tomorrow for her to wear  on the plane. They were taped shut with scotch tape when my daughter whose name is Mackenzie connected them to her phone. It came up that they were Brianna‘s AirPods. It also stated that Brianna had my daughter’s location when she connected them. We had to hurry up and figure out how to reset the AirPods to get the location shut off because we were at home. This is a really scary situation and I’m extremely mad, then we went to check the warranty on the AirPods in the app and it’s only good till September. It’s supposed to be good for a year so the warranty is connected with whoever had the AirPods before us. Buyer Beware.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Okay I guess","reviewDescription":"It’s no better than any other version they’ll still fall out your ear. This must be a tactic to get you to lose one so you’ll purchase another","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Make sure you check the return date!","reviewDescription":"One thing it hurt my ears did not fit well, and it did not block the outside noise well, wish I had checked the return policy sooner","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Apple AirPods 3rd generation review","reviewDescription":"The Apple AirPods 3rd generation deliver a good not great wireless audio experience. Sound quality is good but not ideal, claims they have noise cancellation but I could not hear the difference. Are uncomfortable due to the fact they don’t have the soft tip, they do happen excel in everyday use. The compact charging case and impressive battery life further enhance their convenience. Is it worth the price? No, I would just spend the extra money to get the AirPod pros.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Refuses to stay in my ear","reviewDescription":"No matter what I try, they don’t fit my ears. It wasn’t clear to me that this version doesn’t support adding tips.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Fall out all the time","reviewDescription":"These AirPods have decent sound. They do not have noise canceling technology and it’s annoying to hear the music and everything around you. My biggest gripe is THEY DON’T STAY IN and they feel like they’re always going to fall out!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Way better choices out there.","reviewDescription":"I was really excited about these since everyone had been raving about them. When I received them, the only thing I had to compare them to were my Beats headphones and holy cow they didn't even come close.... The noise cancellation was non-existent and the audio in the left AirPod was more prominent BY FAR, in comparison to the right AirPod. I do not recommend. Will be selling these.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Apple AirPods (3rd Generation) will keep falling out of your Ears","reviewDescription":"The Apple AirPods (3rd Generation) will not stay in your ears.  Highly recommend that you choose to purchase the Apple AirPods PRO (2nd Generation) and you will be very happy.  By mistake, I wasted my money by purchasing the Apple AirPods (3rd Generation).  I then switched over to the Apple Airpods PRO with the custom tips which are very comfortable and now stay on my ears.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Google \"Airpod 3rd gen don't fit\" before buying","reviewDescription":"If you google the fit on these, you will find THOUSANDS of complaints. Bad design for people with small\/average ears. I wish I'd returned them in 30 days but kept trying to make them work. They will not stay in my ears no matter what I do. I have purchased different accessories but they all are problematic. These are much fatter than my old airbuds and I cannot move my head at all without them falling out. I think Apple should offer a recall, it's that bad. Google it, you'll see the thousands of complaints. I'm selling these on ebay and have ordered the Apple AirPods Pro (2nd Gen) that have the rubber tips.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"LEFT EARPHONE DIES","reviewDescription":"As with all AirPods the left doesn’t seem to ever last more than a week before dying","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Not a fan of the fit or the new button...","reviewDescription":"I really tried to like these but I just don't like the fit in the ear like the first generation. I wish I could exchange them for different ones but missed the return window. Also, I am not a fan of the button to pause, answer calls, etc. I prefer the tap on the ear. The button can be hard to press at times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Falls our way to easy","reviewDescription":"I love the mag charging case but these fell out my ear way too much  going back to the second generation. The sound is as amazing and the find my works way better but Did not feel like they would stay in in cases I need them to so before i loose them they are going back","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Slides off ear","reviewDescription":"These slide off your ear as easily as you chewing your food. The sound is good but I couldn’t catch this flaw because the reviews were still 4\/5 stars even with that issue? I did read someone elses tip to switch the ears and place them upside down for them to stay down. So far so good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Battery life and comfort","reviewDescription":"I’ve been wearing them for about 3 weeks now, they’re pretty uncomfortable and battery life is kinda poor… the case lasts about two days when wearing them all day and charging at night. Can wear a full day without charging. Do not recommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Overpriced gadget","reviewDescription":"Audio quality is 100% dependant on placement in the ear. I had ear buds made by Phillips that sounded better I bought 15 years ago for $7.95.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Small ears no!!!","reviewDescription":"I lost my first AirPods from 4 years ago and decided to upgrade.  Not fully upgrade but at least get one better then I had.  Holy crap these are thee most painful things I have owned.  7 minutes in the ear and my ears hurt.  They are not for the small ears peeps.  I just reordered the AirPods 2nd Gen due to the pain I was having.  Plus since they didn’t fit me I brought in outside noise to conversations.  Basically if you have small ears don’t buy them go back or go forward.  This line is not for you.Side note I didn’t give them 1star bc it’s a me problem but yet a design problem too.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"The button on the earpiece is not working","reviewDescription":"The button that you turn off and on, on the earpiece is not working. I want to return it. And get a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"they definitely work, but they’re very uncomfortable","reviewDescription":"the simple compatibility with apple products is great, but the battery life leaves something to be desired (they do charge very quickly though).  headphone and mic audio quality are acceptable but won’t knock your socks off. they’re very convenient to carry around and pop in, but they really hurt my ear cups after a few hours; i find them very uncomfortable. i wish i’d gone with the pros or another soft tipped earbud instead of theses.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Uncomfortable in ear","reviewDescription":"good sound quality and easy to connect to iphone. but they didn’t fit comfortably in my ear. I had some friends try them on and they said they fit perfectly so it might just be me. i would go for the pros instead.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700438400000}
{"reviewTitle":"Disappointing","reviewDescription":"No noise cancelling and still fall out of your ears way too easily. Not sure why these are not getting better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"All They Do Is Fall Out Your Ears","reviewDescription":"Do not recommend at all, all they do is slide out and don't event think about working out with them.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Horrible","reviewDescription":"Bought these 6 months ago, the have been crap the whole time but I kept thinking Apple Support would release some kind of update that would fix the issues.  They DO NOT stay connected to my iPhone no matter how much battery life they have.  Constant disconnecting, or robot voice.  Stay away!  Stay far away!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Poor sound quality and not honoring return policy","reviewDescription":"Sound quality is very poor. Attempting to return within the 15 day window and not allowing me to!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Falls out of ears","reviewDescription":"Sound quality and battery length doesn’t matter if they don’t stay in your ears. Many reviews all have the same problem, they fall out of your ears. Returns are a nightmare.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"I wouldn’t recommend!","reviewDescription":"The sound is great! That’s the only thing good about them. I a truck driver and I use them for phone calls and I listen to a lot of podcasts. I used to have the 1st generation AirPods but wanted to try the 3rd generation because they are sweat proof. Anything I listen to will play for several minutes but then it just stops. I have to keep hitting play either on my phone or on the AirPods itself. It’s very frustrating and I think I wasted my money for the price! I’ll still to the cheaper AirPods that work.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"painful for my ear and my husband's ear","reviewDescription":"it is bigger than the 2nd generation and the pro one.my ear and husband's ear would hurt while wearing them.return option was only picking up at my house by ups.it was picked up already couple of days ago but the website is still showing it's not picked up.today ups driver came for pick up again. it's busy season for delivery company so i'm hoping that it's just taking longer to return update. not lost in somewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Absolutely terrible 0 stars","reviewDescription":"These are absolutely terrible. Do not buy them they do not fit in anyone’s ears. Fall out even more if working out. Rate 0 stars and complete waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Didn’t last","reviewDescription":"Purchased for grandson as a Christmas 2023 gift but under two months of use, stopped working correctly. Glad I purchased apple care warranty since return window closed January 15 2024.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"No good","reviewDescription":"The AirPods keeps falling out of my ears and they are not letting me return them","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Don’t stay in your ears","reviewDescription":"Bulky and fall out of your ears due to its wide design. Go with another gen","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Came broken","reviewDescription":"item came broken - cracking noise in the ear. Have yet to been able to return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Good on everything… except for one","reviewDescription":"I don’t know if it’s just my ear type, but it can not stay in my right ear. It always falls out and I don’t know why. If you want it to be assured that it stays in your ear, get the pros instead.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Easy to pair.","reviewDescription":"Great sound. Buds are a little too big, they don’t stay in my ear. Walked out to get my mail and one fell out.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"The sound is amazing but…","reviewDescription":"I’mBlown away how great the sound is! I had generation two and these are so much better BUT they hurt my ears so bad, they are super big and uncomfortable and I don’t even have small ears. I feel like previous style was so much better even though the quality of sound nearly not as great, Wish the design was better, still trying to decide if I will keep them.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"They’re great!","reviewDescription":"I thought I was buying the noise canceling, wireless charging air pods….but I didn’t lol and that’s on me. But with this particular model, it doesn’t have the updated ear shape so they do bother your ears if you’re sleeping or wearing for a long time. But it’s so minimal. They do tend to slip out of my ears if I’m working out or running. But again it’s so slight it’s not that annoying. With that being said. I still wear them so much.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Decent Overall","reviewDescription":"Not better than the AirPods Pro, but nonetheless get the job done. If you're into collecting your boxes I wouldn't order from here. There was a fat sticker on the front of the box and the adhesive got stuck on it and messed it up. Other than that the product itself is fine!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Not recommended for small ears","reviewDescription":"Not matter how I place them in my ear they will not stay and hurt. I have very tiny ears so that part of the issue","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"decent","reviewDescription":"apple sets the standard, but as far as quality goes, they're just alright; pro better","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Go for the Pro","reviewDescription":"I have the pro purchase these for my daughter tried them wasn’t impressed will probably upgrade her to the pro. My advices if you’re on the market for Apple AirPods, go for the pro.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"They work well","reviewDescription":"Kinda pricey for what they are and they stay in less well than the gen 1's.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Work great, but keep popping out of my ears","reviewDescription":"These paired immediately with all my devices, and are fun to interact with- but, they keep popping out of my ears. I give it a week before I lose one or both irretrievably.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"I mean, they’re AirPods 🤷🏻‍♂️","reviewDescription":"Yeah. They’re great. They’re exactly what’d you expect. Recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"A Symphony of Innovation and Quality: Apple AirPods (3rd Generation)","reviewDescription":"Purchasing the Apple AirPods (3rd Generation) from Amazon was an absolute breeze, and the moment they arrived, I could not wait to experience the audio magic I had heard so much about. Right out of the elegantly designed box, these AirPods exuded a premium feel, synonymous with Apple's reputation for quality and innovation.Pairing them with my device via Bluetooth was effortless and instantaneous, paving the way for a remarkable auditory journey. The personalized spatial audio is nothing short of revolutionary, encapsulating a surround sound experience that makes you feel at the center of your music, podcasts, or calls. The clarity and richness of sound are unparalleled, providing a depth of audio that is crisp, balanced, and utterly immersive.Comfort is evidently a priority in the design of these AirPods. They nestle into the ears comfortably, providing a secure fit without any sense of intrusion or discomfort, even during extended use. The sweat and water resistance feature is a practical addition, making them my go-to choice for workouts, runs, or even a walk in the drizzle.The battery life is impressive, providing up to 30 hours of playback time with the lightning charging case. This ensures that my audio companion is ready to serenade me throughout the day without any interruptions. The case itself is compact and sleek, making it easy to carry around.Charging is quick and efficient with the lightning charger, ensuring that I'm back to my audio haven in no time. The intuitive touch controls on the AirPods are responsive, making it easy to control playback, answer calls, or activate Siri for hands-free functionality.In summary, the Apple AirPods (3rd Generation) is an epitome of what modern audio technology should be—effortless, robust, and delivering a superior sound experience. They have become an indispensable part of my daily life, whether I am on the move, working out, or simply unwinding to my favorite tunes. The satisfaction derived from the product, coupled with the seamless purchase experience on Amazon, adds to the allure of owning these extraordinary wireless earbuds.","isVerified":true,"ratingScore":5,"reviewReaction":"118 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"No difference","reviewDescription":"I don’t hear a difference between Gen 2 and 3. But the cheaper ones.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Sounds great","reviewDescription":"My son kept borrowing mine.So, I decided to get his own. He loves the newer generation model.  They fit perfect in his ears.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Air buds","reviewDescription":"Gift for son. He was pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Sound and charging...","reviewDescription":"The sound is fantastic, a big improvement in lower tones, over my previous pair 4 years ago.  It takes 6-7 to charge when brand new, as the case charges first, then the ear pods. After the initial charging it goes very quickly. They're comfortable - no rubber knobs to bother with. One size fits all because they're tapered.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Delivery","reviewDescription":"Delivery was same day! I was impressed! And of course, product is amazing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"AirPods","reviewDescription":"These have worked great for months no issues sound is awesome very comfortable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Grandson loves them","reviewDescription":"All the kids prefer the airpods vs any other. They also like them because they hide well under hair and beanies so they can listen to music in class 🙄.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Different versions charge different","reviewDescription":"Like that there cordless but not compatible with the three in one charger","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Still connected","reviewDescription":"They were in fine condition but they were used and the old owners Icloud was still connected to them which makes me unable to track them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Just stopped working","reviewDescription":"Yeah Apple products.  15 months and one side just stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Too big to fit into ear and stay in.","reviewDescription":"Too big for them to fit into ear. They constantly fall out","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Did not fit my ears","reviewDescription":"Fell out of my ears constantly even when I was just sitting at my desk. Horrible experience. Will be purchasing the second generation instead.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Made too big","reviewDescription":"Made too big for my grandson‘s ears. Bought AppleCare to go with them and so far  impossible to get a return on that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Stranger danger","reviewDescription":"Purchased & received \"new\" Gen3 air pods. Upon my teen connecting, showed \"Eddie\" still connected to the supposedly new air pods. Major hassle for refund. Ruined the literal ONE gift I got my daughter for Christmas.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Very poor sound","reviewDescription":"They don’t stay in your ear.  The sound is terrible","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Apple AirPods (3rd Gen) Waste of Money","reviewDescription":"I have always heard so much hype about how good AirPods supposedly are but these are an absolute waste of  money. The battery life is substandard, the sound cuts off on the left side (sometimes the right) when the volume is at max. I tried all the recommended fixes from Apple forums on that issue but to no avail. The noise cancellation is the only thing that works as it should. Honestly, I have cheaper earbuds that sound far better, have better battery life and no issues with abrupt cutoff or disconnecting. That is another thing, they fail to connect all to often even though that had been paired. Apple products have normally been great for me but I will avoid any of the AirPods from here on out.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"Have a buzzing noise on the left side after a couple of days use","reviewDescription":"I bought these AirPods for my mom's birthday while it was on sale. But after a couple of days of use, it has a buzzing noise on the left side. Now I need to return the AirPods and buy another one for her but this is not on sale anymore. Feel sad and don’t know if this bad quality because this is a sale item??","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"WORST PRODUCT","reviewDescription":"received and worked fine until I needed to charge for the next day.. I would not trust or buy from this seller again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Stopped Working in less than a month","reviewDescription":"Never buying apple products from amazon again. The airpods were working fine for the first 3 weeks until the left bud was just undetectable. I waited a day and the issue was still happening so I factory reset it. Now both buds and the case won’t connect back to my phone. I’ve contacted support and their only solution is to buy new ones since it passed the 2 week return limit.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Don’t recommend","reviewDescription":"It fall down of the ear all the time im work in construction and those fall like 20time a day so and to fix that issue u have tu boy a silicon fittings and it doesn’t fit in the charger anymore so thas why i say 0 stars","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Missing air pods in box","reviewDescription":"Received air pod box but did not receive the actual air pods. Was opened for Christmas  and the my kid was super excited and then opened the the box to  connect to phone and there were no air pods. I’ve never had this happen, and now their is no way for me to file a claim. I received them on December 11 but my child didn’t open it till the 25th. For Christmas. This is really sad.  It’s missing air pods and it’s little charger.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"New pods","reviewDescription":"They broke after only using them for 2 an half months. Will not answer calls nor can u hear out of them.  They are crap.  A they will not exchange or discount me anything.  I don’t recommend buying from this place","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Too Big For My Ears","reviewDescription":"The earlier generations were great, perfect fit. These are too large and fall out of my ear. If I don’t wear a winter hat they won’t stay in. They are worthless to me. I’m going back to the earlier model.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Small","reviewDescription":"They sound good, but are so small they fall out of my ear all the time . I like gen 2 better with the longer stem. I thought the more expensive would be better but it’s not.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Poor fit, they fall out","reviewDescription":"Would not recommend for smaller ears. I tried these out past the 15 day return window and Amazon won’t take it back. Now I’m stuck with earbuds that don’t fit. What a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Would not stay in my Ear.","reviewDescription":"I needed To replace my old ones and upon looking around ai found get 3 .. and thought, wow, these will be even better. NO ! They would not stay in my ear. Completely useless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Earbuds were blocked by previous user or owner","reviewDescription":"Earbuds seemed to work well, however an annoying message from the surten saying that previous user can see my location is continuously appearing on my mobile. The earbuds were blocked by another user.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Too big for my ears","reviewDescription":"I thought I would be able to change the tips on these in order to fit my ear. No can do. Amazon only allowed a two week window to send them back. After googling and making a trip to an Apple Store and discovering there was nothing I could do, the two weeks were over. I think I am more upset with Amazon over this. I have been a prime member since day one. This is an expensive mistake that will probably push me out of prime. Next time I will just go to Best Buy for this type of a purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Ambient Noise AMPLIFIED","reviewDescription":"I purchased these with the intention of upgrading from my very worn 1st generation AirPods that I bought refurbished. They worked great, just were starting to get a little grody. There are a number of issues with the 3rd generation AirPod pros that make them basically unusable.1. The background\/ambient noise is amplified through the microphone. If you’re talking on the phone, the person at the other end is assaulted by any small noises going on in your background. So if you’re loading the dishwasher, taking out trash, or god forbid TYPING on a keyboard the other person will hear those things MORE than your voice. Apple support seems to know this is an issue, and all the “fixes” have done nothing.2. The tap sensors do not work. I used these on my 1st Gen model to pause music and hang up the phone. These sensors are not responsive to do either of the functions even though they are enabled on the settings.3. The AirPods will randomly disconnect and reconnect. There seems to be no rhyme or reason as to why or when this will happen.Needless to say, I am disappointed that I thought this would be an upgrade. I thought that the stereo sound would be cool, and it is, but not cool enough for me to overlook the other issues. Wish I could return, but no luck with an opened\/used product here.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"Caused my ears to ooze","reviewDescription":"Similar to airpod pros, I join the ranks of people who have an allergic reaction to one of the materials in these.  I've called Apple support who deny that this is even a problem. You can do the Google search yourself.Now that I am trying to return back to Amazon (within 30 days), Apple is making me jump through hoops to justify a return (I've spent over an hour now on the phone with their support and Amazon's support). They don't allow return dropoffs - only pickup, and you have to print a hazmat label and return authorization and tape to the box for pickup. This is ridiculous!Unfortunately, I have to stick with airpod gen 1 or 2. What a bummer and bad experience.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"BE CAREFUL! Apple will charge you a restocking fee and Amazon will not support you.","reviewDescription":"It took 2 months for Apple to refund me for a set of AirPods (3rd Gen.) and charged me $30. Amazon said that Apple said the AirPods were damaged but couldn't tell me how they were damaged. I had the AirPods out of the box for less than 20 minutes, just enough time to check the sound quality.... all while sitting at my desk at home. I'm very disappointed as I'm a responsible person and would not return a damaged item. I'm 70 years old and have only had a few encounters with bad merchants. It's sad to think Apple and Amazon treated their customers like this. Apple has always had great products and service and Amazon... the same., but I can see things are changing.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Defective item and hard to return","reviewDescription":"It did not work when we received. Past week I am trying to return but it is a giant hassle with apple products. You have to schedule a pick up and UPS never comes to pick it up. They basically don't want you to return it when it does not work. I am still awaiting my refund. Very tired of this system.Update: we finally returned it and now they told us apple products take up to a month to process and get refunded. This is insane. I bought it Feb 14, now to get my money back it goes up to end of March…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"More than used and broken","reviewDescription":"When I got them I was shocked to see the package they came in open with clear usage.It took me 40 minutes to finally connect them (I’ve had every generation of air pods so it’s not new to me)They were already registered in someone else’s name\/email.Let them charge over night. And when I woke up to take them to work the right pod was dead. I cleaned the port, cleaned the pod, watched tutorials on what to do. Nothing, the right one was just dead and wouldn’t charge.I get it’s a gamble buying used, but seriously? Thankfully I figured this out quickly and initiated a return. But if I would have bought these for someone else as a gift and they didn’t open them in 14 days they would just be SOL?I expect better from both brands.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Upset granddaughter","reviewDescription":"Ordered AirPods in Oct 2023 to give to granddaughter on birthday March 1,2024. Never thought to check to see if they work. She opened up on birthday & so excited but turned into disappointment when we could not get them to work. A lot of money to spend for something that did not work. WARNING!! Please check them out right away and do not wait and be disappointed. Have to give a 1 rating would not let me pick 0","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"DON\"T BUY","reviewDescription":"After a month and a half one of them didn't want to charge. They also started having connectivity issues (didn't automatically connect to my iPhone as they usually did). I cleaned them and the case, reset the settings, disconnected them and re-connected them as the Amazon Support videos instructed and nothing changed. Now they don't let me return them and recommended I buy AppleCare to fix it. Meaning I have to PAY to get them fixed. You don't pay so much money for some headphones so they stop working after 1.5 months!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"No funciona , NO LOS COMPREN","reviewDescription":"1—- Me enviaron unos audífonos usados y que ni siquiera se escuchaban bien, muy mal por parte de Amazon o Apple deberían controlar mejor los productos.2—- DEVOLUCIÓN : no acepta que uno mismo lo devuelva , tiene que venir UPS hasta tu casa con el label , no te informan horario ni nada y solo tienes 3 intento para devolverlos, los que trabajamos se nos hace imposible esperarlos.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Absolutely hate these","reviewDescription":"These are SO uncomfortable in my ears. I can’t keep them in to save my life. I’m constantly trying to push them back in my ears. They’re too big for the size of my ears, and won’t stay in my ears without me constantly adjusting them. They also hurt after wearing them for a while. The only good thing about them is the sound quality and the battery life.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"They don’t fit at all","reviewDescription":"These really suck for staying in your ears. I even purchased two different covers so they would stay in my ears and they keep falling out and now I lost one because they wouldn’t stay in my ears. I’m so upset that I paid that kind of money and now I lost one!!!!! It hasn’t even been a freaking month and I don’t even have the right earbud anymore it’s been 2 weeks and I basically threw away $140.00 more with buying the covers!!!  thanks a lot for nothing. I wouldn’t recommend these to anyone EVER. I purchased two different kinds of covers so they wouldn’t fall out and low and behold the right one fell out and now it is gone!!! DO NOT PURCHASE THESE UNLESS YOU LIKE HAVING JUST ONE EAR BUD!!!! I’m so mad and SO DEPRESSED. Don’t listen to them saying they’ll stay in because They don’t!!!!! Even spending more money buying covers for them to stay in place because it’s ALL LIES Thanks alot Amazon and apple I love throwing away my money!! Because being disabled on disability I love giving my money away!!! WOULDN’T RECOMMEND THESE OR THE COVERS TO ANYONE EVER!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Just the best!","reviewDescription":"Tried sooo many less expensive EarPods ..these are buy far the bast… worth every penny!A must have … clarity, connect ability and sound block out is superior!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Airpods","reviewDescription":"13 year old loved them ..works well with his iphone 14","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Justo lo de la DESCRIPCIÓN 👍🏼","reviewDescription":"Excelente producto , justo lo que esperaba, volvería. A comprar 👍🏼","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"ORIGINAL APPLE PRODUCT CERTIFIED ✅","reviewDescription":"Sometimes the battery not lasting long enough for the excessive use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Good buy","reviewDescription":"It was a gift for my 13-year-old son, he was happy with its features, size, audio quality, ergonomics.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"For sound 5 * but…","reviewDescription":"For sound 5 stars .  For moving around 1 star. I have spent more time looking for my ear pods than listening through them. At first I looked at all the don't fit my ears recommendations and tried them. No joy. Called Apple as I did purchase AppleCare .  There is no solution except I should have bought the Max for fitting options.  Guess I will try the air phones.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Really great","reviewDescription":"My husband loves these. He previously had the first gen ones and says these are a great upgrade.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Perfect!","reviewDescription":"Packing, shipping and price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Lindos","reviewDescription":"Excelente calidad de audio","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"awesome","reviewDescription":"love these airpods fit in ear perfectly. very good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"They Don't Fit Mine Or My Wife's Ears","reviewDescription":"I can't get them to feel secure in my ears, so I asked my wife to try them on and same thing. They don't fit her ears at all. I was sitting in my home office trying them out for around 15 minutes and I got up walked two rooms away to a bathroom and while passing a mirror I noticed the Right one was missing. While I was walking back searching the floor for it, I found it on the chair I was sitting in, but it's a good thing I didn't go anywhere far. Not only don't they fit my ears, but the case is the most slippery thing I ever held in my hand, and I'm constantly dropping it. Once I picked up the case and it immediately slipped out of my hand and when it hit the floor, it opened, and both AirPods slid about 20 feet across the floor. Then when I picked the case up from the floor it immediately slipped out of my hand again.I can't have things this crazy in my life so I have to return them.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"I don’t recommend","reviewDescription":"Doesn't charge or connect to iPhone. I returned the item.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"don't buy used","reviewDescription":"didnt connect to my phone plus have to wait 30 DAYS to get my money back  never again will i buy any apple products from amazon again  i hope you do watch and see","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"For the perfect ear?","reviewDescription":"Really liked the pros I used to have but the noise cancelling started to make the right one fade in and out so decided to upgrade to the 3rd gen without noise cancelling. This design is a huge step backwards. There are no changeable ear tips so there is a lot of noise leakage. I travel a lot with long haul flights and need something that drowns out the world. By the time I get these to volume, there is so much sound leakage that it would bother other passengers. Besides that these always feel like they are one sudden movement from falling out - think falling asleep on plane and waking up missing one. The sound is good on these which is why I am so disappointed that they are basically unusable for me. Going to try adding the $13 in ear holder see if that helps.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Sound and feel terrible","reviewDescription":"These sound and feel terrible what a rip off","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"It not as good as I thought","reviewDescription":"The volume on these were good at first and got worse as time went on sometimes I can barely hear them","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Never again.","reviewDescription":"Defective and had to return. So disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Don’t buy","reviewDescription":"I brought my AirPod October 27, 2023 and they stop charging not even a month later. I contacted them about my AirPod and they told me it’s nothing they can do my return date ended on November 11, 2023 it haven’t even been 30 days. I paid $159 for these and there’s nothing they can do. Don’t buy off here.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Could never get them to connect","reviewDescription":"I bought these in June. I would love to return them but I’m afraid it’s too late. I could never get them to connect to my iPhone. So they are completely useless","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Terrible product .. i would NOT recommend","reviewDescription":"I've had gen 1 airpods and had no issues, upgrading to gen 3 was a painful experience, everyone tells me they can't hear me, clarity was miserable, ok if you're listening to music, many time only one ear worked at a time when i switch between my iPhone and Samsung .. and no luck upgrading the firmware ..","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"I didn't want to buy them, but I love them!","reviewDescription":"I wasn't sure to buy them but I did and now I actually love them and they make my life easier!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Very helpful","reviewDescription":"Yes these are amazing and the voices are so very clear! I recommend these AirPods! I no longer have to listen to all the TikTok videos being played while I work!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"my wife loves them","reviewDescription":"work great and long battery life","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Muito Bom, recomendo.","reviewDescription":"Ótimo produto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Satisfecho","reviewDescription":"Muy bien producto y de muy buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"If you’re thinking of upgrading, do it.","reviewDescription":"There’s a clear difference between gen 2 AirPods and gen 3 AirPods. Sure second gen is $100, but the sound quality is so much better than you realize, and once you get a third generation you’ll understand. The new features on it like spatial sound is really cool. The buds are slightly bigger than my ears, but that’s really the only complaint I have about it. Spend that extra $60 and get the third generation AirPods","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Good","reviewDescription":"Works good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"👍","reviewDescription":"Works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"i love it","reviewDescription":"i love everything about this product 💕","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Me salió un poco ruidoso pero está bien solo uso ino","reviewDescription":"Muy bonito sii","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"UNSAFE delivery option!","reviewDescription":"The product was fine but the delivery option of having to give a delivery code in person to the delivery driver is HORRIBLE and UNSAFE!  My wife had to wait all day for delivery which came at 10:00 in the evening.  She had to open the door to a stranger that late at night.....VERY unsafe.  I would not buy a product from Apple again if I knew this was a delivery requirement (they don't tell you this until you complete your order)","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Left earpod can barely hear after 2 months","reviewDescription":"The left ear doesn’t charge the way it’s supposed to and now I can barely hear the left earpod when I put it in, so I just stopped using them and I’ve only had them three or four months","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"horrible do not buy","reviewDescription":"had sennheiser MTW3 before this so that’s my standard. no tip so they don’t stay in your ears. audio quality is average. pinch controls are an inconvenience and have limited function. no noise cancellation. 0\/10 do not buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Annoying","reviewDescription":"The part that goes in your ears are to wide. I have small ears, so they are not one size fits all. They are not made for everyone. They will not stay in my ear and it is annoying","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"They’re not for small ears 👀","reviewDescription":"My first generation AirPods finally succumbed to the abuse and injuries I’ve inflicted on it, and it was time to buy some new ones.Pros (?):- no ear plugs that stick into your ears- ok sound quality (for a normal person. Audiophiles should take the pros).- the stem is shorter so it doesn’t get caught in my hair as much as the older generations (it still gets caught tho)Cons:- It’s made out of slippery material that even just sitting there makes it fall out.- not compatible with a general wireless charger. You have to find one that’s compatible.- Mic quality is about the same as previous generations.- control features aren’t easy to do, and I often have to do the action multiple times to pause\/play musicNgl I regret buying it 🤧","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"Defective","reviewDescription":"Ordered this for a Christmas present. January 13th one of the air pods wouldn’t charge.  Called to Amazon to troubleshoot. Unable to solve problem. Requested a replacement, rep stated that we could not get a replacement but had to return item for a refund. This is very frustrating. A brand new Apple product ordered for Christmas, stopped working on January 13th. Ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Bad","reviewDescription":"If you plan to pair to android don't get this product. I've never had this much trouble with Apple earbuds. Won't connect. Says I need another app in order to connect, but won't tell what app. Tried multiple, none worked. Tried looking through support, they only gave for other apple devices. I have officially lost all hope for Apple products. I'm done.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"does not come with a working adapter to charge and fit is awful","reviewDescription":"Fit is awful.  Do not buy this product.  I don't know if it will work or not as this airpod set does NOT come with any type of USB to charge it.  I have to go to a store to see what it needs.  And I need to note that this item was NOT delivered to my door.  It was left outside in the rain with other very large boxes that belong to someone ese.  It is by chance that I even found the amazon box at all.  My package that was left out in the rain and floods here by Amazon driver can be verified by the photo they took - not very bright at all. After I go out and buy what I need to even charge it then maybe we can see if the item even works.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"I՛m disappointed","reviewDescription":"I՛m disappointed. When I speak with headphones, I hear clearly, but on the other hand, they do not hear me clearly. Some of the words are clearly heard, the other part is muffled.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Nightmare to return or repair","reviewDescription":"The seller doesn't care about their customers. Worst customer service and return policy ever. Item arrived defective and seller insist on repair when I wanted a return. Amazon shouldn't sell these products.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Falls out of ear","reviewDescription":"I could never work out in these because they fall out.  Fine for sitting down and listening to music.  Even then, I need to push them in again.  They sound great tho","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Didn’t fit daughters ears","reviewDescription":"Purchased these for our 16 year old daughter. Hoping these Pro’s would be more user friendly, they weren’t. They just kept falling out of her ears like the previous versions, our son who’s 19 tried them and same problem. Guess our kids ears are just too small.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Awkward shape that doesn’t stay in my ears","reviewDescription":"Regardless of which way I turn these, they will not stay in my ears. I like to move around (walking, exercising, shifting in my chair, taking the occasional deep breath) while I have in ear buds, and these do not lend themselves well to any movement. I didn’t try out any rubber tips. But, since the sound quality seemed the same as the 2nd generation, I opted to just get a newer pair of 2nd gen pods and return these.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"They keep falling out of my ears","reviewDescription":"You can't really enjoy it when the buds fall out of your ears.  They don't account for natural movement of your head to stat in place. Everything else is great.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Falls out easily","reviewDescription":"I’m going back to my old AirPods because these ones won’t stay in your ear. I try to position them better, but the damned things have giant buttons on the side that get clicked anytime you do. You can no longer tap-touch to switch songs, you have to press the physical button or use Siri to switch songs. The button sits against your face, so in order to hit it you have to move it away from your face, which then forces you to reposition the AirPods again in your ear; a tedious process.You can see in the photo that the new ones are much larger and oblong shaped. Shame.And now I noticed the right earbud has a static noise that I’ll always notice. Nope, these are now my backup AirPods. Sad.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1684195200000}
{"reviewTitle":"Un poco incómodos","reviewDescription":"Son muy anchos y no se ajustan como deberían al oído , se caen mucho , quedan flojos .El sonido si es muy bueno","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Hard to fit in ear","reviewDescription":"I love these AirPods I used to have the 1st generation and the sound quality is completely different. With the 3rd gen I feel like I’m at a concert and it’s great. The only bad part is when I go on runs it’s hard for the AirPods to stay in and I try to adjust them but every time they fall out mostly when I do sprints or run speed 7 or up on treadmill which is a bummer. But overall I like the AirPods. Came in perfect condition and worked perfectly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Good with major drawbacks","reviewDescription":"The sound quality is amazing. The spatial audio is fun, but its not really needed for anything. There is no noise cancelation for airpods that are not pros, so i'm not sure why it is advertised this way. I am not keeping them though, they wont stay in my ears. I can't do anything- from walking to running to just sitting down without them falling out or feeling like they are falling out. Sucks because the sound quality is so good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Little disappointed","reviewDescription":"I was hopeful after using a competitor brand for a while that these would beat all others. Whaaaa whaaa. The newest versions are trydoesn’t have interchangeable silicone tips to perfect the fit so they barely stay in. They no longer have noise cancelling and the sound isn’t very loud either. And the battery life is short. Sad. Guess I’ll go back to a competitor. I can get 2 for the price of these so when they inevitably give out","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Ear fit is a bit different","reviewDescription":"Ear fit different from the previous version doesn't seem as snug. Hope I don't lose them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"These air pods could be defective when bought new","reviewDescription":"Used these air pods only one time. Put them on the charger that night to make sure it would be fully charged when I got up. Got up that next day and the charge wouldn’t go over 45%. Thought that was really weird. Then I decided to leave them on the charger for a few more hours. Still didn’t work. Called Amazon support to get a refund on these air pods they told me they do not offer a new label for return because it’s an apple product. Also stated they would have a ups driver come to my house to pick up the defective AirPods but never gave me a day or time when they will be here. So all in all do not buy any apple products off of Amazon it’s not worth it all. It’s just better going to the store to get Apple products.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"They never charged","reviewDescription":"Bought these for my Grandson for Christmas. I never opened the box until today Dec. 23, so they would be ready to go. Only they wouldn’t change. Now I am stuck with these and they don’t even work. I bought another pair from Best Buy. I suggest you do the same.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Terrible","reviewDescription":"I hated it. It always falls out of my ears, I couldn't even use it for more than an hour. Horrible experience. The 2nd generation is much better.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"they are not small ear friendly","reviewDescription":"so i’ve so far have had all 3 type of airpodsthe first ones weren’t bad at all no complaintsthe airpod pros we’re by far my favorite they were comfortable and didn’t fall out as long as i used the small silicone tips i wouldn't have changed them if i didn’t lose them i had a trip coming up and i had a budget that i could just fit these airpods i have pretty normal ears if anything maybe on the small side put these were painful to fit in always fell out and just not as god but i mean they are alright but if definitely advise just spending the extra money for the pros","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Bad items","reviewDescription":"When I received the Airpods, they were scratched, dirty and looked like they were used.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"NO FACTORY RESET FOR USED ITEM","reviewDescription":"The used airpods did NOT get a factory reset. When we first turned the AirPods on, they said they belonged to (name of person). A message popped up saying that because it’s (name’s) AirPods, they could now  see our location!!!!!!! Never again buying from this manufacturer","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Don't fit my ears","reviewDescription":"These were way too big for my ears and kept falling out. I like to use them primarily for when I run or for working out which was not possible. I ended up returning them. I had the first generation ones and liked those ones so much better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"I regret it","reviewDescription":"I have never bought Amazon  returns 15 days with this  and it no longer works and you can no longer return them, very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Died after one month","reviewDescription":"I have had these AirPods just over 30 days, previously had Gen1 for 4 years, the right airpod totally stopped charging and they will have to be sent back to Apple… hopefully they don’t die again. I only use them to work out, they don’t get but about 1 hour of use 4-5 times a week. Not happy that I can’t just return them and get my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Never got money back","reviewDescription":"I order this long time ago and product had issues after a short amount of time. Ive been waiting for months end to get my money back and ive never got it back. DONT BUY THIS PRODUCT!!! I’ve bought this over 2 months ago.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"NO NOISE CANCELLATION","reviewDescription":"I am so mad, these frickin things don't have noise cancellation, you would think that the 3rd generation would but it does it has some crappy spatial ear crap. If you want noise cancellation order the 2nd generation and get your moneys worth, I want to get the 2nd generation but I can't return them cause they have all ready been opened it's so stupid, don't waste ur money on these get the 2nd generation!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Unreliable","reviewDescription":"These earbuds are not reliable.  They cut in and out during calls, music, podcasts, it doen't really matter what I'm listening to.  The one thing I can say that is poisitive is that they hold their charge.  I bought these because I left my other applie airbuds (which worked perfectly!) in my rental care and of course they were \"not in the car\" when I called the rental company.  But this pair that I replaced them with has proven to be very disappointing.  Save your money, buy directly from Apple.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Airpods 3","reviewDescription":"Immediately fell out of my ear. I bough 3 separate pair of ear tips and none of them fit or they would not fit inside the charging case. I had to return airpods 3 and all the additional ear tips and accessories. Waste of money. I should have stuck with airpods 2.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"BROKE AFTER 2 DAYS","reviewDescription":"Earbuds stopped charging after 2 days with minimal use. Tried using another case, wireless charger, and different wires. Nothing worked.Don't waste your time and buy it in person from best buy or the apple store.P.S. it's a pain in the ass to return lithium ion battery products","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Former owner still tracking these pods","reviewDescription":"Purchased pods for kid, former owner started tracking these again as alerts are coming up on my kids phone.  Did not know there would be creepy situations.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Defective","reviewDescription":"Defective Christmas gift.  Right Ear bud does not charge.  Went through all troubleshooting & factory reset.  Apparently you can't just return it.  They make you jump through hoops and eventually will refund the item, but I'd have to repurchase and the price is now $30 more.  You should offer a discount for the inconvenience of a defective product, let alone seriously think I should pay more.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Advertised as new and sent me used ones","reviewDescription":"I ordered 2 of these as gifts for my employees. Both were advertised as new Airpod Gen 3, but when the box arrived I knew something was off. Neither of the Airpod boxes were sealed in the cellophane packaging like new ones are. Protective plastic was missing from the interior of the boxes, cords were haphazardly coiled up in box and the cases has dirt and hair on them and fingerprint smudges.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Worst apple AirPods ever","reviewDescription":"They've completely change the size and shape of them. These ones are enormous next to the first and second generation. These are made for men or people with huge ears. They are definitely not made with women in mind. They are way too big and won't fit in my ears. They fall right out. The control buttons don't work at all. There is no way to disconnect the phone call Once you're finished talking without touching your phone. Absolute crap. I'm quite sick and tired of things only being designed only for men !I'm throwing these in the trash.Stick with the second generation design or the first but do not go with the third unless you have enormous ear canals.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Sound is good BUT. . .","reviewDescription":"I haven’t even had these head phones for a year, let alone the past few months, and they’re all crackling trying to put them in my ear. So similar to wired head phones back in the day trying to get a good connection.There’s also no noise cancellation!! Can’t wear this to work. Our metal shop will be brutal.Apple did dirty when they took the cushion out from the head phones. Without them, the head phones fall out if I’m being careless.EDIT: 11\/26\/23The right head phone just stopped all together.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Do not buy","reviewDescription":"I loved the old AirPods and I lost them. So I thought I would get the latest. These are just awful. Keep losing connection multiple times and I end up just putting phone on speaker. Also give me a headache.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Very good quality","reviewDescription":"Great value. I use on construction zones and in the gym. They have been splashed with sweat and water and have not been damaged. The battery life is very good and the case holds very good battery for charging.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Good headphones","reviewDescription":"These are great, my ears are small but I was able to buy some covers to go over them and they fit like a glove. the sound is crisp and has great noise cancellation capabilities.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great Product","reviewDescription":"Great product for a great price. Does not have noise canceling.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Love the watch bands.","reviewDescription":"Love them might have to order the pastelColor set.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Exactly as advertised","reviewDescription":"AirPods came exactly as advertised. And delivery was extremely fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Large size of ear piece","reviewDescription":"Ear piece larger size, makes secure fit in ear impossible.  Beyond that they sound great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"AirPods","reviewDescription":"Excelente producto de muy buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Excellent Product","reviewDescription":"Gift for my wife, the sound on calls is super clear. Connecting was simple. Ear fit perfect.  Absolutely no complaints","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"compatable","reviewDescription":"I purchased this because I had the wire ear phones but I didn't like it. Firstly I had trouble connecting to my apple phone which was strange . The ear buds fell out of my ear. I contact customer service and they helped me return it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Llegaron bien","reviewDescription":"Todavía no los pruebo","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Disappointed 😔","reviewDescription":"This is the worst they glitch a lot doesn’t read out the name fully and when I’m getting calls and I tell it answer it cut off the calls  and they keeps dally out my ears I’m so disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"DO NOT BUY IF YOU HAVE SMALL EARS","reviewDescription":"The sound quality is great and connection is great. Basically just AirPods. But they changed the shape and even with the correct twisting method, they will not stay in your ears I’d you move your jaw in the slightest.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"I have tried to love these -","reviewDescription":"I wanted to upgrade my old AirPods - actually, I thought I had lost them, and by the time I found them, I had replaced them! I just don't care for these. I can't return them, but I wish I could. They fall out so easily and never feel secure, so I hate wearing them outside of the house. I was in a public bathroom and one just *boop!* popped out and fell onto the floor and bounced out of the stall. They also don't transition from one device to another as seamlessly as the old ones did.if anyone has any suggestions, I will sure take them -","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Used item.","reviewDescription":"I read through the entire listing, not once did I see that it was a used\/refurbished item. Got these as a Christmas gift and when she opened the package they weren’t horrible but you could tell they weren’t new and when she went to connect them, they were still set up to someone else’s name\/phone. So they weren’t even fully reset.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Good thing it had Apple care warranty","reviewDescription":"Product came and looked fine but the right side was very quiet, tried resetting and cleaning and adjusting sound to that side but couldn’t hardly hear it.  Luckily apple care was still active and I was able to send product in for repair under warranty.  It was not described in the listing that they were defective.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Horrible Fit","reviewDescription":"I find these to be much worse that the original Airpods that I had. They just don't feel good in your ear, and don't fit as snuggly as the generation previously. There is no touch any longer, there is a button, just seem cheap. I am going to try and send these back and buy something else.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"TOO Big","reviewDescription":"These AirPods are very bulky and fat in your ear.The generation twos fit fine, but these are way too big.Definitely buy a silicone retainer necklace for these, unless you like to hear them hit the floor and then you’re doing deep knee bends. They just won’t stay in !!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Annoying","reviewDescription":"The ear pieces are huge, I can’t wear them walking or running because they will fly out the moment I move my head, and my ears are on the smaller side I’ll admit, but my boyfriend and my dad have larger ears and the don’t fit in their ears either. Also they die extremely fast compared to the previous generation. And for something that won’t even stay in my ear they’re very expensive.What I will give them is that the sounds is good, and I think they sounds better then the first generation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"I’m so disappointed","reviewDescription":"i’ve been waiting for these to come in for a while and they don’t fit my ears. the sound quality is amazing if they would just STAY IN MY EARS. i’m literally sitting still having to readjust them every few minutes. they also hurt my ears bc they’re so big. bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"falls out of ears...","reviewDescription":"which kind of defeats their purpose.  I purchased 3rd generation believing that they would be superior not only to the originals, but also better than the 2nd generation.  Not so!  Buy the 2nd generation, which come with silicone pieces to make the fit better in the ear.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Sound quality is great but it doesn’t fit the ears as well as gen 2","reviewDescription":"The sound quality is great but it doesn’t fit my ears as well as the gen 2 EarPods","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Trade offs","reviewDescription":"Great sound, much improved over my 1 Gen AirPods. Much less ergonomic. They keep falling out of my ears when I’m not sitting still. There’s a stress or uncomfortable feeling when they are in my ears. I’m so sad because I love the sound but think these will drive me nuts for long listening sessions. My old AirPods are so comfortable, it’s like having nothing in my ears. I may shop around and see if another company makes a comfortable earbud with this quality of sound. These definitely would only be worth the discomfort if I’m listening to music, if I’m on a phone call, watching YouTube, or listening to a podcast, I prefer my old airpods. Sadly I think I need to return these.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"Not as good as the gen 2 air pods","reviewDescription":"We bought these  to replace an old pair and my son hated them.  One of the air pods wouldn’t stay in his ear which was annoying.  Even when his music was on a really low volume, which is infrequent for a teenager, I could hear it.  We had to return them for the gen 2 air  pods that he loves.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Good sound and battery life is good but","reviewDescription":"Great sound quality and battery life but terrible fit and the pinch control is the worst downgrade I ever seen in an Apple product. I got to grab on to the little tail and squeeze it and dam thing will fall out . 2nd gen is better you just got to tap it and it will do what ever .","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"They fall out of your ears.","reviewDescription":"Poor design. But they sound great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Sorry avg for me","reviewDescription":"After reading the reviews, I thought they were good. I hated they couldn’t fit into my ears. They kept falling off. The sound quality is clear but lacking of depth and bass. The sound quality is not different from the old wired Apple earphones except they are wireless and expensive.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"They don’t stay in my ear nicely","reviewDescription":"I wish the ear portion wasn’t as bulky because it doesn’t stay in my ear super well. Sometimes I have to worry they will fall out especially if I’m sweating. Other than that I like how short they are compared to the original look of AirPods.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Size","reviewDescription":"My ears are not overly small for a woman but these ear buds are to big for my ears I have to use them with extreme care because they fall out often when I tilt my head down or when I am talking or chewing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Works Well but uncomfortable","reviewDescription":"I loved the look of it and the sound quality. Unfortunately they were extremely uncomfortable to wear. Maybe I just have small ears but they hurt. I had to return them since they just did not work for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Fit Horribly, Sound Great","reviewDescription":"Bought these to replace my 2nd gen airpods that quit working.  I wanted something that was more comfortable to sleep in than the airpod pro.  These gen 3 sound as good as the pro but unfortunately these don’t stay in my ears as well as the gen or the pro.  The slightest touch whether an accidental brush of the hand or trying to press the button causes them to fall out.  I ended up returning them and getting a pair of refurbished gen 2’s.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Convenience at the expense of durability","reviewDescription":"They only lasted 37 days and will no longer pair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"These do not hold a charge for very long.","reviewDescription":"Does not hold a charge for very long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Uncomfortable, bad case design, skip\/hang up doesn't work","reviewDescription":"Designed for ab adult male ear apparently, they are large. Sound is great. Airpods will fly out if the case if it falls to the ground, whereas the OG airpods fit tightly and the airpods never or almost never fell out. In my case the skip song\/hang up feature doesnt work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Still waiting for refund","reviewDescription":"Airpods would not connect.  I believe they were used bc they didn't look new. Still waiting on a refund","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Low Sound","reviewDescription":"Less than 3 months of use and now I can barely hear any sound from the left airpod. checking with supportUPDATEapple support shipped a replacement left airpod in 2 days. $77 hold until I return the defective partUpdatethe replacement airpod lasted almost 2 months. got another replacement today","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"Unstable in ears. They feel like there gonna fall out","reviewDescription":"Really no bass at all and they feel like there gonna fall out","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"I don’t recommend","reviewDescription":"They fall out of the ears. The classic AirPods are better and cheaper","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Don’t stay in","reviewDescription":"They don’t stay in, sound quality is no better than the 1st gen. I suggest not wasting your money on these and buying either the 1st gen or the Pros","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Eh","reviewDescription":"There’s no way they made these AirPods bigger l. I can’t get through a full workout without them falling out 30 times. Sounds great when they’re not falling out though","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Horrible fit","reviewDescription":"They fall out of my ear constantly. I know my ear is smaller so it just doesn’t work for me but there’s no way to adjust in any way.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Kinda uncomfortable","reviewDescription":"They may take some getting used to. I guess it depends on the size of your ear holes. My left side tends to fall out and disconnects my call when that happens. That said, it makes a nice hands-free alternative to using the speaker.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"They great but…","reviewDescription":"If you have small ears they won’t fit as well as they should. I have to keep readjusting them. They are rounder than the previous AirPods gen 2 I had. The sound is very good though.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Better than the 2nd gen’s","reviewDescription":"They are better than the second gen’s in terms of the quality of sound and noise cancellation but the second gen’s has a more comfortable fit in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"good","reviewDescription":"good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Work as advertised","reviewDescription":"quick connect does not always work. Charge fast and lasts a long time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"They are good, but not great","reviewDescription":"They last long, but use to the 2nd generation where you can tap to skip songs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Perfect for my ear.","reviewDescription":"Love this product. However the price could be more competitive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Too big","reviewDescription":"Item would not stay in ear. Too big for ear canal. Excellent sound quality!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Worse fit compared to 1st generation","reviewDescription":"Better sound quality and faster connection, but the fit is worse compared to the 1st generation of AirPods.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Too big","reviewDescription":"If I tilt or band forward they flow out","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Feels cheap and lightweight","reviewDescription":"Ipods 2nd generation is better. The problem i have is it wont connect to my bluetooth. And the return policy to have UPS pick up on the next business day is annoying. I just want to drop it off at the UPS store now and have a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Great headphones - used weren’t great","reviewDescription":"Bought used, they arrived defective :( needed for a trip","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Left your bud no longer works after a few months","reviewDescription":"They work great, but I probably would’ve been just as happy with the basic ones. But I decided to spend a little bit more.  Three months went by and now the left earbud not working as well. So I had to buy another pair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"One of the AirPods has static, but the box to return them has been discarded","reviewDescription":"I like them, one is defective.  It has static","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Don’t buy","reviewDescription":"Started glitching and lost sound in less than a month","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Too much treble","reviewDescription":"I sent these back and got the 2nd gen instead. The 3rd gen just didn’t  sound good to me. Not enough base\/too much treble. I didn’t like the way they fit in my ears either, I kept pushing them in to try to increase the base but i always felt they could fall out. The spatial audio that moved with your head was annoying but when you set it to “fixed” it sounded pretty good, just not enough base.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699833600000}
{"reviewTitle":"Do not work properly","reviewDescription":"They do not work properly. They make a high pitched sound in your ears, the left earbud does not connect half the time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Great sound quality but very noisy microphone, compared to gen 2","reviewDescription":"Sound quality for listening is slightly better than gen2. But microphone quality is significantly worse compared to gen 2, which is excellent for phone calls on the go and in noisy environment.But gen 3 picks up and amplifies even the slightest surrounding noise to the point others cannot hear my voice. So had to switch back to gen 2 for practical purposes.  Gen 3 does not have any microphone sensitivity adjustment at this point.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Size Big Big","reviewDescription":"small ears figure out how to make them fit so it can stay in your ear cause 5sec they gone fall out","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Don't Fit Well!","reviewDescription":"I needed to replace my first gen Airpods because the sound was no longer working well. I decided that I would get a newer version thinking that newer would be better. Unfortunately they are not better and I am very disappointed. I kept hoping they would work for me, and now I can no longer return them. The problem is they are chunkier and don't fit very well into my left ear. As I begin to feel it starting to fall out and I push it back in, whatever I am listening to gets turned off because of the controls! Very frustrating. I wish that I had gotten the old version, or spent the money on the Pro.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Love these airpods","reviewDescription":"I've never had airpods but only airbuds.  But I the cords kept getting tangled in my purse and I always had to have my phone near by and couldn't leave it and be on the phone. But with airpods, I'm free to walk around without my phone.  I can be handsfree from my phone when driving. I get voice text messages and when a call comes in I'm asked if I want to answer it or not.  Can't do that with airbuds.  I highly recommend getting airpods and they were a great price too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Love the sound and functions.  Happy with purchase!","reviewDescription":"Love the sound and functions.  Happy with purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Love them","reviewDescription":"I’ve been needing new AirPods but always put it on the back burner since my old ones worked okay. I’m glad I went out and upgraded. The quality is so much better than my old ones. It’s impossible to use anything that’s not apple so it was definitely worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Amazing sound","reviewDescription":"Easy set up.  Just perfect!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Terrific","reviewDescription":"These AirPod 3s sound amazing.  As good as my AirPod Pro 2s and they don’t stick into your ear.  Sound and fit much improved.  These actually have base which was my complaint from earlier versions.  If you can afford it buy them.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Stay in place","reviewDescription":"Purchased for my husband and he loves the way the stay secure in his ears","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Effiency","reviewDescription":"My son likes them. Uses them during workouts.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Great price and quality sound","reviewDescription":"Bought one for my daughter and ended up getting a pair for me. Totally recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Crystal clear","reviewDescription":"Never had such earphones such a long charge….⭐️⭐️⭐️⭐️⭐️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"10\/10","reviewDescription":"They’ve worked great , no issues . Have had them almost two years .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Function","reviewDescription":"First time using one of them blew. Have to return","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Dont like them","reviewDescription":"There slightly too big and everyone can hear my music.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"poor fit and quality issue","reviewDescription":"the earplug is significantly chunkier than former generation, unless you have deep ears i guess it falls out of your ears quite easily..Also one of the airpods stopped working in only 40 days.Overall worst apple product i ever purchased.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Make sure they are returnable.","reviewDescription":"I love my first and second generation AirPods. These personally were too big for my ear. They caused irritation in my ears immediately, so I had to return them. The new features were less than you would expect. You have to pay extra for wireless charging.  I also found them harder to handle because of the smaller size mic, but bigger ear part. They were clumsy to put in the case. Be careful who you purchase these from, and what there return policy is.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1688688000000}
{"reviewTitle":"Sent back","reviewDescription":"Would not fit in my ears","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Dirty","reviewDescription":"Is very dirty","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Did not fit, returned","reviewDescription":"I gave these over a week returned the last day possible. They did not fit my apparently tiny ears and kept popping out.  Not just while walking but sometimes just smiling would pop them out.  They do admittedly sound great though.  I switched back to a fresh pair of Gen 2.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Do not fit well. 2nd Generation ear pieces much better.","reviewDescription":"The qaulity of sound and the location\/find my earbuds is great! But they changed the design of the ear pieces and they hurt. They do not fit well and the right one falls out. Just a matter of time before I lose it because of this. I tried to return but they would not let me. Don't buy this product. Get the 2nd gen","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"No mag charging. Uncomfortable.","reviewDescription":"Maybe I’m missing a feature, but when I place it on the charger that works for every other mag, it won’t mag and it won’t charge. It falls out of my ear constantly and I’ve yet to find the noise canceling feature that was easily found on the 2nd generation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Doomed to the waste bin. Greedy Apple.","reviewDescription":"I like these, but they are loose fitting, and you can’t easily replace the battery. And sadly, they will probably wear out and I’ll be forced to throw them away.Why can’t Apple be more responsible and design products that last longer? Other companies do. They are greedy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"They do not stay in the ear","reviewDescription":"I have to older models. Loved them. These are smaller and I thought better but that’s not the case. They tend to slip off. They fall off when running or with a lot of movement. I would not recommend these.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"Keeps falling our of my ears","reviewDescription":"The 3rd gen Ear Buds do not have the Silicone cups, and they keep falling our of my ears.  Had to buy the 2nd Generation Pro Ear Buds, that still have the Silicone cups and work better for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Headphones","reviewDescription":"They always drop….. can’t hear well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"They do not fit at all like the 2nd generation model!","reviewDescription":"I had to replace my 2nd gen AirPods so I stepped up and am very sorry I did.  They are incredibly uncomfortable and fall out of my ears.  They are larger than the previous model, and were a huge waste of money.  I can tell that the sound quality is better than my previous ones, but it doesn’t matter because they just don’t work for me.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Apple losing its quality","reviewDescription":"I've had cheap 60 dollar too earbids sound 10x better then these 3rd gen ipoo's. They barely set in my ears without wanting to fall out and there is no right bass to these turds. Not to mention no wireless charging. Come on apple all the above you get with almost any brand now a days and yet you charge 150.90 dollars. What a joke..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"no wireless charging case","reviewDescription":"We bought this with the assumption that all of the 3rd gen AirPods came with a wireless charging case and these do not.  If you are looking for wireless charging, look elsewhere and don't waste your money!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Fall Out","reviewDescription":"I would not buy these again the consistanly fall out of the ear . Very frustrating","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Received the wrong airpods","reviewDescription":"The quality of these is fine, but they definitely sent gen 2 AirPods and not gen 3.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Prefer the 2nd gen","reviewDescription":"I bought these after the microphones went out on my old 2nd gen pair, which I had for over 2 years and used quite a bit. I loved that pair but wanted to try an upgraded version. Not a fan of how these 3rd gen fit in my ears. I only tried them for about an hour and decided to return them. They constantly felt like they were going to fall out, and at one point one of them did fall out when I bent over. I purchased another 2nd gen pair because they fit me significantly better and are durable if you take care of them","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Poor fit","reviewDescription":"The font fit properly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Hurts my ears, but overall great!","reviewDescription":"I don’t really know but these headphones hurt my ears when having them in for a hour or so. It could be because I’m not really a AirPod person but they do cause a little discomfort. They have spatial audio which is amazing when your watching a movie, it gives you feel like your at a movie theatre. These headphones have good battery life and good  sound.","isVerified":true,"ratingScore":4,"reviewReaction":"22 people found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Not noise cancellation","reviewDescription":"Great for making phone calls and listening to music in a quiet place. Not great on the plane and isn’t effective for cancelling noise. Overall nice headphones for the money, just understand their limitations.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Good quality","reviewDescription":"I like them a lot, my only exception is that they are chunkier than the AirPods 2 so they fit a bit big on my ears and tend to slip off.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"The sound is good","reviewDescription":"But for me personally, they fall out of my ears. Annoying. The older version with the longer outside ear part is my go to. But the sound is good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"Great product but problematic shape","reviewDescription":"Awesome product. The sound quality is great, and the battery life is amazing, among other things. However, there's one major issue I have with this product - the earphones won't stay in my ears. Even a slight movement of my head causes them to start falling out. I regret choosing these instead of the second-generation ones, which worked much better for me.I already lost one a couple of month into owning them and switched back to my 4 year old second generation airpods :(","isVerified":true,"ratingScore":4,"reviewReaction":"56 people found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"They Work","reviewDescription":"These iPod-EarPods, or whatever they’re called work just fine. The previous ones worked good too, until they didn’t.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Superior Sound","reviewDescription":"The sound quality is what I noticed first about these Airpods.  After owning various other brands over the years, the sound caught me off guard as I didn't expect such theater quality sound.  Easy to adjust in the ear so they won't fall out and works well with iPhone notification alerts - location, battery, tips on how to use.  I also like the shorter stem.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"They hurt my ears","reviewDescription":"Quality- they were great, they're airpods. I thought they were going to be different than the original airpods and overall they were pretty much the same. I ended up returning them because they are slightly bigger than the original ones and they hurt my ears. I'm sure my ears would have gotten use to them, but instead I ordred the original model.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Almost perfect","reviewDescription":"I do wish they had some adjustability at the ear with maybe a silicone piece but I love them anyway. They do slide out occasionally when working out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Very good EarPods.","reviewDescription":"Very comfortable while wearing them in your ear. Sound is very good.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Really Apple?","reviewDescription":"Getting a refund is like pulling teeth.I decided to try the airpods after the rave reviews of my friends. But they didn't fit me ears so I started the return process. Very strict return policy didn't allow me to drop them off at a UPS store but I had to leave the return outside my front door without a shipping label. After seeing no action on the return I called Amazon. They were able to confirm with UPS that the package was delivered. They then put me on hold to talk with Apple. They were able to confirm with Apple that they did receive the package and it would take 7 to 10 days for a refund. So, I waited!After two more weeks of waiting, I called Amazon again and explained the situation. They put me on hold to talk to Apple. I was told that Apple takes a month to issue refunds, but since the shipping process started a month ago, I should be receiving my refund tomorrow. Well, it's been a week and I'm still waiting on my refund from Apple.How are they so big if this is how they treat their customers? I'm still waiting!","isVerified":true,"ratingScore":1,"reviewReaction":"29 people found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"Unfortunately I missed the return deadline by just a few days...","reviewDescription":"These hurt my ears so bad after just 30 to 45 minutes of wear. I don't think these are one-size-fits-all. These have no noise cancelling ability at all, I had to have the volume up to 80% or more to hear anything at all through these things when I'm on a plane. I wish I could return them and get my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Unfortunately the product didn’t work.","reviewDescription":"On the description it said the product was new, but it was actually a used AirPod. One of the the EarPods didn’t work, I immediately return the product and the refund has taken over 3 weeks, they got the AirPods on the Jan 3 and it’s the Jan 26th and still I haven’t got my refund they keep changing the date . The worst part of it, it was supposed to be a Christmas gift for my goddaughter. I’m so disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Customers be aware","reviewDescription":"If you have any issue with the airpod it will be a huge pain to return. Do not buy air pods from Amazon, it is not worth it. Apple make it almost impossible to return products even if they are prime.  You only have 2 weeks to return them instead of the typical 30 days, ups driver has to come to your house, you can not return the item from a ups store or partner store so if you work good luck. I returned mine on October 17th, we are november 21st and I still haven't received my refund.  I have had to call Amazon twice already. I read many comments of people being in the same situation. Customers be aware. Do not buy apple from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Disappointed","reviewDescription":"The quality of the AirPods were very disappointing to say the least. I’m not sure if all the products through this store is refurbished and if so it should be advertised as so I paid for “new” AirPods rather than “used” which is actually a bit cheaper. The quality in sound of these AirPods were very poor, I had to have the volume setting almost at the absolute highest so that they can sound decent. If you lower the volume setting to about half ways it sounds like you have it at its lowest setting. I also realized kg doesn’t offer any of the features real AirPods would offer.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Love them but not the best fit","reviewDescription":"This is my second pair of Airpods. My first pair lasted 7 years.  The fit was better in my old ones, so am not enjoying the fit of these...they do not fit snug and I have to constantly reposition them. Otherwise, they are really nice.So, I have had these since October and they do not fit. They keep falling out! There is no way to fix them or anything I can do about them.Make sure you know what you are buying. Good product. Awful fit!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Impossible to return","reviewDescription":"I got them and they don’t fit in my ears. I like the AirPods will earpiece on the ends. They never fall out. But beware: get hese only if you know you’re going to keep them. I’ve been trying to return them for three! weeks now. They say UPS has to pick them up and that they have the label with them. I would love to receive a label and take them to UPS myself but they will not supply one. Amazon customer service can’t print the label and tells me to call UPS. UPS says it’s am Amazon issue. I am so unbelievably frustrated","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Too big","reviewDescription":"They can’t stay on my ears at all. I wanted them to listen to music while I workout but it’s impossible, they fall off at the slightest movement.I have a very bad habit of throwing the boxes away as soon as I open products, before trying them on. I won’t even be able to return them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Volume went down after one month","reviewDescription":"Volume went down low after a month. Randomly! I barely used these. Never got them wet. But some how for some reason they barely work. Even when I turn my phone volume all the way up the sound coming from the AirPods is super low. Do not buy. Don’t waste your time or money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Are you actually meant to wear these in your ears?","reviewDescription":"Am rating this with lowest possible stars. Why? The functionality can't be fulfilled if they won't stay put in your ear.When you realize this, you will inevitably Google search a solution. Apple says you should spin the earbuds forward towards your face. This has zero impact. Mostly, I think it's an excuse by Apple toward CYA.My recommendation: buy older versions that have better design towards actually fitting the user's ear.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Se  ve perfecto estado","reviewDescription":"Todo bien por el momento se ve perfecto estado lo unico que veo un poco mal es que en ocasiones se desconecta solo pero Depues todo bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Christmas","reviewDescription":"Once again I love the quality of the item.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"First time upgarding from Apple AirPods (2nd Generation)","reviewDescription":"So I kept delaying upgrading because 2nd Gen worked perfectly for me. So far I have tested 3rd Gen in my phone meetings, walking, and running. The sound quality is definitely better but there are some things that bother me.First, I always had issues keeping the airpod in my right ear. The 2nd gen stayed in OK unless I do some excercise lying flat. 3rd gen is a bit more loose but was still ok running and walking.Second, I really don't like the replacement of tap with click for the controls. Tapping was so easy and convenient. NOw when I run, I have to slow down to find the end of the airpod and carefully click on it, and if I rush there is a good chance I will knock it out of my ear.","isVerified":true,"ratingScore":4,"reviewReaction":"39 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"No Instructions","reviewDescription":"The EarPods work great however there is very little instruction on operating the EarPods. I had to search online to find out how charge them and how to increase the volume. Very frustrating!! Not sure why they couldn’t give you that information with the EarPods!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Lasted about 6 mouths","reviewDescription":"Lasted about 6 mouths till the right ear bud gave out and stopped working properly. First six mouths were great tho!Lol","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Awesome sounds!! Bass is satisfying","reviewDescription":"Perfect sound although no ANC. Much better than the first or second generation AirPods. Good bass for a change. CON: despite looking and fitting like the original AirPods, the 3's always (always!) fall out of my left ear. Uncanny. I hate the in-ear Pros but they're better than the 3's falling out even with idle listening.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"No wireless charging case","reviewDescription":"Bought this for my wife, because she doesn’t like the silicone on the pros. Good battery life (6 hours) on a single charge and she says they’re very comfortable. She used to wear the Bose QC II headphones all day, but they get uncomfortable after extensive use. The case doesn’t have wireless charging, which was surprising. Also no USB-C charging for the case. If they fixed that and could 8 hours of battery life on a single charge, this would’ve been the perfect product. Overall feels overpriced even at $140, which is $35 off.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Owners need to clear from their ICloud","reviewDescription":"Air Pods look and work great. Only issue is Vincent was the apparent original owner and didn’t disconnect from his ICloud account. Without doing that I can’t register with mine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Returned","reviewDescription":"I can not seem to find air buds that are right for me. I tried these for a few days and although they sounded great they were uncomfortable and didn’t fit my ear. A good friend recommended them after I returned my Bose so I took a leap. I wish they would have worked.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Air pods","reviewDescription":"Good sound as you expect from Apple products.  Easy to use and fits well in your ear. I have heard the beats are good but we are an Apple family and have always been happy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Case doesn’t have wireless charging","reviewDescription":"Case dies not charge wireless","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"EarPods","reviewDescription":"Great sounds, buffers outside noise very well. What I dislike is that when I workout or even go for a walk my right pod falls out, more than 5X now.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Seems good!","reviewDescription":"My daughter loves, it should be sent with a c port block charger! FYI, order the block charger at same time!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"genuine ear buds","reviewDescription":"Fit well, sound great, work as advertised.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Its good","reviewDescription":"Works but not the clearest","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Missing some features but great overall","reviewDescription":"These are great overall, it’s got the same great sound quality you’d expect from Apple. It also adds the new spatial audio, which in my opinion is not needed, but it is a cool feature if I am listening to music as it makes it seem as I am there. The shape of the AirPods do not agree with my ear, they might not fall out but after using them for a short period of time I really feel like my ear is sore. It also has indent on the “shaft” of the AirPods and it’s located on both sides. Coming from the Gen 2 air pods, I really miss just the double tap or tap feature of the air pod. You need to grab the indention on the AirPods and from there you need to squeeze that indention to do it. I’d rather have the control system from the Gen 2’s but overall not bad. Would buy again but not without comparing the Gen 2’s first again.","isVerified":true,"ratingScore":4,"reviewReaction":"51 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Pretty good","reviewDescription":"Of course it’s “apple quality” so no problem with that buuut I feel like they be a little too big for the average person ears. They also came dead but that’s fine, battery life is GREAT","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":".","reviewDescription":"the airpods get low after a while","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Great sound","reviewDescription":"I like the quality of the sound coming out of the headphones. The base is on point and the noise cancellation feature is superb. The pods don’t quite fit my ears. They could easily fall out without knowing. Battery life is average.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Sound is great","reviewDescription":"I’ve been a big fan. I have AP2, the Pros, and the AirPods 3rd generation. The battery life is so good on the 3rd gen that they’re my go to these days. I really like the shorter stem (vs the AP2) and the battery life blows the Pros out of the water. For me, the AP2 get used for workouts, I use the Pros if I need to be on a call or meeting and I’m somewhere noisy. Otherwise I always reach for the 3rd gen ones. Spatial audio is great, they’re comfortable to wear for long periods, and as previously stated, the battery life is outstanding, just I think they are a little big","isVerified":true,"ratingScore":4,"reviewReaction":"47 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Love it","reviewDescription":"Love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700524800000}
{"reviewTitle":"Pretty good","reviewDescription":"I prefer the feel of the 2nd gen. Took some time to get used to the controls and at first I didn’t like the button style but now I love the button style over the tap. The battery life is not as good as advertised.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Hard to keep in ear","reviewDescription":"Great listening quality but the part that goes in ear is larger that original model and doesn’t fit comfortably. I have to continuously push them back in ear\/position. Otherwise, noise canceling works extremely well.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"It is an Apple. You can't say bad thing about it","reviewDescription":"We purchased it for my boy birthday, it sounds great and it works as described. We tested against one of the knock off earbub ($30), besides the build, the sound quality is relatively the same.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Size","reviewDescription":"They slip out my ears when doing movements. The quality is great just the size of the buds.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"Excelentes","reviewDescription":"Me encantaron","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"They are perfect except that they don't fit my ears as well as the old airpods","reviewDescription":"I have always loved how well the apple earbuds and original apple air pods fit in my ears.  Its almost like they were designed for my ears specifically!  Now I bought these hoping for an even better experience.  They are better in most things...battery life, versatility, etc.  But they changed the shape in such a way that they are more prone to fall out of my ears from time to time.  Not constantly, but just often enough that I knocked off one star.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Too big to fit in ear and sound great","reviewDescription":"Battery life and sound are great, but these are not comfortable sitting in the ear. Definitely engineered poorly for sales and flattery.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Recommend","reviewDescription":"Came fast and works fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"AirPods are pretty good","reviewDescription":"They slip out kind of easily at times which is annoying, but the sound quality is nice.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Son lindos!!!","reviewDescription":"Son de buena calidad y traen un buen sonido 👌... el único problema que tuve fue la entrega de mi producto!! La caja de los audífonos venia mojada, espero que eso no dañe mi producto...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Good sound","reviewDescription":"Great sound, excellent bass, you can hear the fullness of whatever you’re listening to, however if you’re active and do a lot of movement these earbuds do NOT start put","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Do not block out noise- I miss my other ear pods","reviewDescription":"My noise blocking air pods died on me after 6 years. I bought these. Should have spent the extra money on noise blocking. They work - but not as good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"The sound is great the fit is painful","reviewDescription":"If you like the for of the classic Apple AirPod or headphone these are not for you. They are too wide. They make my ears hurt.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Sound amazing, but....","reviewDescription":"They won't stay in my wife's ears. Apparently only the \"pro\" version comes with different sizes fittings. That's lame. I would not buy these again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"They fit different than the 2nd Gen","reviewDescription":"I was looking forward to the new ones when my second gen died but these fit differently. I recommend trying in an Apple store first.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"AirPods don't stay in my ears","reviewDescription":"I had an older set of AirPods that started to have some charging issues, so I purchased this newer version as a replacement. The main problem is that the actual AirPod pieces don't stay in my ears very well! An AirPod has even fallen out onto the street before unprompted. I almost have to wear them sideways to get them to stay remotely in my ear. I did not have this problem with my older AirPods. Because they don't fit properly in my ears, the sound quality and noise cancellation are not great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Nice but don't stay in the ear","reviewDescription":"These would get five stars if they didn't keep falling out of my ears. Concept is good, execution leaves a lot to be desired.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Good sound-shorter battery life","reviewDescription":"The sound is good. Clarity good.I don’t think the battery life is very long. I would look into this and compare products.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Fuzzy noise","reviewDescription":"Ordered the refurb product and got one that has background static in the right airpod. Had to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Buyer beware...","reviewDescription":"I ordered these for a Christmas gift, and when it arrived, it was a refurbished set of Airpods (Gen3).  I'm not one to use or give anyone anything you put in your body or (ears) that has been refurbished.  I looked throughout the page and did not see anywhere where it said these items, (sold at new prices) would be refurbished.  So if you're like me and don't want refurb items, you may want to check your packaging when it arrives and if there are non-Apple stickers on it and not the fancy Apple peal away stickers, you may want to send these back.  There needs to be a disclaimer stating whether or not these are refurbished or that you may get a pair of refurbished Airpods.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Great sound but..","reviewDescription":"Battery life is only about 10-12 hrs..sound is terrific but I may send them back because don’t last long. My soundcore liberty earbuds lasted all day and night no problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Sound quality is perfect but…","reviewDescription":"Like how they feel in the ear, sound quality is perfect but… my big two issues is “nothing to block out the background noise and the common thing you probably hear is they keep falling out of my ears”, guess this happens with people who have bigger ear loop. Don’t wanna run the risk of losing them even buying a rubber grip on them not worth it because the case can not close on them. Very disappointed and don’t know why Apple over look this design flaw not everyone has big earlobes.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Not quite what I expected","reviewDescription":"They are okay for what they are but they are lacking bass and they can get a bit static","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Pods","reviewDescription":"Does or did not come with ear pieces to help hold in place. They fall out very easily.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"I like the old generation better","reviewDescription":"My hubby bought me these and I gotta say, I like the older generation better.These are too chunky and you can’t tap to skip a song.I’m a big runner and really miss the easy tapping ability.I also feel like I sm charging these more often than my old ones.They also seem to fall out really easy when I barley tou much them.I’ll take my old ones back!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Great sound but terrible fit","reviewDescription":"The sound is SO much better than the generation 1 or 2. But the fit is completely different. The AirPod Pros hurt my ears after 30 minutes, the airpod 1 and 2 don’t - they fit so well. The generation 3 fit JUST like the AirPods Pro’s and hurt my ears in the same place (even tho there isn’t the silicone piece). Unfortunately have to return these because of the poor fit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Too big","reviewDescription":"Quality is great but they’re larger than previous versions and don’t fit in my ears.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Too big for women's ears!","reviewDescription":"The sound is great with these headphones, but there is no way I could wear them except when sitting at my desk since they are way too big for women's ears. When I move around too much, they fall out!  I wish the description would have said something about that - the older ones fit much better. I should have saved my money and just bought the older ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Apple AirPods (3rd Generation) Wireless Ear Buds, Bluetooth Headphones,","reviewDescription":"So far the fit on these air pods is a problem.  After watching a number of videos it appears that these may not work.  Time will tell. Update.....these will not stay in my ears and the ability to improve hearing for conversations is unacceptable.  The previous 2 generations are much better for hearing conversations and tend to stay in my ears a little better. Not a good purchase for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"These don’t fit my ears very well.","reviewDescription":"The one for the right ear keeps falling out about every 4-5 minutes. I spend a lot of time outdoors taking care of my pets. For the price, I expected to be able to do all my chores while wearing them. The third time the right one ended up lost in the straw, I decided to go back to over the ear Bluetooth headphones.  Another all hype product from Apple.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"not for me","reviewDescription":"nothing wrong just the design is not for my ear, they fit loose i guess will keep using the first generation","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Ya ni me gustan  p q se me caen muy seguidos me arrepentí de comprar","reviewDescription":"El producto no me cabe en el oído se me cae muy seguido","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Doesn't fit well","reviewDescription":"Good quality but doesn't fit well like Gen 2I'll be returning it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"falling out","reviewDescription":"I would love it if it stop falling out of ears.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Amazon piss poor search strikes again!","reviewDescription":"its really annoying to be specific on the search request and that not being the first option to buy - all the other crap others want to sell you. I wanted to replace\/get a second set of the PRO.  The PRO is only 30$ more which is what I wanted .  For some reason this basic pods don't seem to want to synch with either PC I have, which the pro had no problem doing.; synch fine with ipad and iphone  This will be the last Christmas that I do 100% shopping on Amazon!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Don’t fit my ears","reviewDescription":"Just like the Pros, the Gen 3 AirPods do not stay in my ears. I have used the Gen 2’s at the gym for years with no problems and thought I would upgrade for some of the new features. Unfortunately, just like I experienced with the Pros, the design change makes them fall out of my ears. Had to return.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Not compatable for individuals with small ears","reviewDescription":"I really wanted to upgrade from the 1st gen and I thought they would've been similar in regards to comfort, but I was very wrong. These really hurt my little ears and keep falling out or feel like they're going to fall out. Also, I was very upset that they weren't compatible with MagSafe charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"AirPods are too big for my ears, second generation fit so much better","reviewDescription":"I bought the third generation after one of my second generation AirPods stopped working. The size difference is very noticeable. These airpods don’t fit my ears. It constantly feels like they’re going to fall out and if I tilt my head during exercise or yoga, they actually do fall out. Super frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Sounds great but doesn't fit my wifes ears","reviewDescription":"They would have been given a better score but she can't use them 2nd gen would probably been better choice for her as she has smaller ears. They fit me ok but i used different style but I think they sound great. I have no issue. Just wish they were smaller.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"My first pair","reviewDescription":"Not sure how to rate it, and not sure if it is a flaw with this pair I bought but one ear is definitely not as audible as the other ear.  I looked up how to fix an ear that isn't working, but in the end, it is working, at a much lower decibel than the other and there isn't fix for that.  Can't turn it up to match the other so feels like it isn't working.  Got it on an Amazon flash deal in July, so not sure if this was a new product of a returned product, but it definitely isn't what I would have expected having never had them before.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Too big","reviewDescription":"These are the first Air Pods I have owned. The one in my left ear falls out a good bit. It’s just too large. I hate to return them.  But it looks like I have too.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"It’s ok","reviewDescription":"Very easy to lose but reliable and easy to use. Great battery life and easy to connect to phone. Performs nice but I feel they are a little loose in my ears","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"felt insecure in my ears","reviewDescription":"didn't like not having a silicone piece to more securely stick inside my ear. Ret'd to buy the Airpods Pro 2 when they were on sale for $189.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"No ANC","reviewDescription":"These are missing features that the 2nd generation have. The price has also increased within a week since Christmas is near. They were $30 cheaper last week.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Too big","reviewDescription":"The sound was amazingly clear and crisp, however, they would not fit properly in my ears and kept falling out.  Returning for refund.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"Downgrade from previous versions","reviewDescription":"Sound quality and battery life is great.  However, I am disappointed in two changes they made with this generation.  First, they changed the shape of the part that goes into the ear.  The previous shape was my favorite thing about Airpods...they fit my ear perfectly, never fell out when running, biking, etc.  These fit, but not as tight, and while they haven't fallen out yet, I could see it happening in the future.  The bigger complaint though is they changed how users interact with them.  Instead of tapping them, you now have to press the stem.  This may not seem like a big deal, but I loved the old Airpods where if you were wearing a hat and gloves, you could still tap on them through the fabric to pause\/play\/answer the phone.  I think Apple would argue that you could use Siri to do this hands free, but I feel Siri gets worse and worse over time.  Even basic commands like \"resume podcast\" will sometimes trigger no response from Siri and I end up having to take off my gloves and resume on my phone.  Really disappointed in these two changes and will go back to the old version.","isVerified":true,"ratingScore":3,"reviewReaction":"23 people found this helpful","country":"United States","date":1672617600000}
{"reviewTitle":"AirPods","reviewDescription":"The sound is great but the buds are uncomfortable in my ears. The shape is too big for my ear & fits poorly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Earbuds continuously, fallout","reviewDescription":"My husband said that earbuds kept falling out and he has bigger ears, and they still fell out-so I had to return them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Made for big ear holes","reviewDescription":"I’d give it 3 1\/2 stars if I could.It is nice, sound quality is great, links to my phone almost immediately- it is also HUGE. It’s made for big ol’ ear holes. I have teeny ear holes so I adjust it and sometimes it pauses the audio when I do. Oops.Overall good, works consistently.Cons are the size and sometimes you have to hold it in front of your phone and open it the case if you want to use it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695081600000}
