{"reviewTitle":"Good Hair Dryer","reviewDescription":"Lightweight, sleek model, space-saving, works well.I chose pink, however it is more of a dark rose, so there's that.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Great, affordable hairdryer with a couple caveats","reviewDescription":"This is a great little hairdryer, with a couple caveats.  It does feel a little cheap; however, I am through buying super expensive luxury hairdryers, as they break just as often as the cheaper ones.  I bought a very pricey hairdryer that only lasted 2 years!  So from now on, I'm buying affordable dryers, as I'm pretty hard on them.  This little dryer has excellent heat and speed control.  There are three reasons I gave it 4 stars:  1) I have very curly hair, so mainly use the diffuser attachment, and it's very small compared to most curly hair diffusers.  It also blows the air a little harder than I like, but it still works pretty well.  2) There were some rough edges on the teeth of the diffuser the first time I used it, and they were catching my hair and pulling it.  I scraped those off and it's been smooth sailing every since.  3) No hanging loop.  Overall, I recommend this dryer, just be aware that it does have a cheap feel and a very small diffuser for curly hair.","isVerified":true,"ratingScore":4,"reviewReaction":"18 people found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Mom loves it","reviewDescription":"My mother does not hold back when she like's something so here is what she described to me, turned to words the best I could. My mom seemed to be in love with her new Wavytalk Professional Hair Dryer I gave her as a Mother's Day gift. As someone with curly hair, she struggled with finding a dryer that enhances her natural waves without causing frizz. This dryer is a total game-changer.The diffuser attachment is amazing! It helps to define and dry her curls without leaving them crunchy or frizzy. The dryer itself is powerful but doesn't feel too heavy. The ionic technology is a definite plus as it leaves hair feeling soft and smooth. Plus, it dries hair surprisingly fast.We are impressed with this product and would highly recommend it to anyone with curly or wavy hair! Or with hair, period!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Blow dryer","reviewDescription":"I’ve only used this blow dryer once and it works really well for the value. It’s lightweight and has a cool setting. It’s a little loud especially when using the highest setting, but luckily I can blow dry my 4c natural hair in under 40 minutes using it. I only wish the comb attachment had smaller bristles in order to get the hairs on the ends a little straighter.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Light weight","reviewDescription":"I like it because it’s light weight as I have weak forearms due to wrist deformity, though it’s not not as powerful as my previous one, it came with a diffuser which I needed for my curly hair and couldn’t find one to fit my other dryer. The only drawback that my other one did is that it doesn’t fold in half so I had to find a different place in bathroom to but it. That would be my only negative.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Good hairdryer.","reviewDescription":"I like the size of this hair dryer. Works well and gets the job done. Occasionally mine makes a funny whistle noise, though. I am not sure if there is a defect or if they all sound like that.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Nice size","reviewDescription":"I like the size and weight of the dryer. The settings are easily accessible. There are 3 heat settings and 2 power settings. When the high heat setting is used on the lower speed it’s not as hot as when used in the highest speed setting. I’d like it better if the lower speed was hotter. The high speed tangles my hair too much.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Very liaght","reviewDescription":"This dries very quickly.  I gave it 4 not 5 stars because it isn't as hot as others I have had.  Love that it is light weight and easy to manage.  It leaves my hair nice and soft and less frizzy than others I have used.  I would recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724112000000}
{"reviewTitle":"Great for curly hair","reviewDescription":"I love this new hair dryer as it is great for drying curly hair without causing frizz and without straightening the curl!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"I just like it","reviewDescription":"This is a good dryer but I don’t understand all the hype which got me to buy it. I have wavy hair and the diffuser does a good job. I do wish the diffuser was locked into place instead of loosely spinning around because I used to like to put it against my scalp and turn it diff directions to get a lifted look. With this I must lift my hair with my hand to do what I need. The paint is super thin and even though I don’t throw it around, the dryer has lots of scrapes on it. So the cute pink grey is now pink grey and black (scrapes). It’s lightweight and balanced in my little hand. The cord is sufficiently long. I’m keeping it because it does the job, but I’m not all rave about it like others are.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Broke in less than a month :\/","reviewDescription":"This dryer was worked pretty well although it caused me to blow a fuse 4 times. I started unplugging everything else when using to avoid blowing the fuse and that helped but then all of a sudden it stops working mid use. I feel the plug and it is SCORCHING hot. I tried the test on the plug box and it failed making a buzzing noise. It’s been a few days now and still doing the same and won’t turn on.Im glad it didn’t cause a fire it seems like it could’ve happened had it not turned itself off but it did break from that. I was using it for over 30 mins at that point so I think it just shorted out and died. It worked pretty well before that and I’ve only used 10 times or less so I’m not sure what happened although it is quite cheap so seems like a get what you pay for situation. Maybe worth investing in a better one.My revlon brush dryer (around the same price) works way faster and better and have not had any issues of blowing a fuse or it shorting out regardless of how long I’m using it. Buy that instead of a standard dryer like this one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Stopped working after first use","reviewDescription":"This travel blow dryer is powerful and easy to pack. Beware — the suction end is incredibly strong and if you have curly hair like I do and diffuse your hair upside down, be careful to not let your hair get anywhere near the suction end … it’ll end up inside the dryer and can possibly be ripped from your head. My hair ended up tangled inside and I had to cut it out. Because of this and how I need to use the dryer, it’s a pass for me. If you don’t flip your head upside down (curly haired people know what I’m talking about) then you should be ok.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"It worked good until it didnt. VERY POOR QUALITY.","reviewDescription":"I bought this dryer for my wife and daughter. At first, it worked good until it stopped working after just 4 months. My wife was using it and she said it started to overheat. She said it shut off and didn't start back up. I tried to find warranty information on it, but is non existing. Save your money and buy something else that will work better. I remember being a child and my mom had a cheap hair dryer that lasted her over 20 years. This one only lasted 4 months. VERY POOR QUALITY. Will not ever buy again from this brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724716800000}
{"reviewTitle":"Not recommended for long hair","reviewDescription":"I’m going to be generous and give one star for being compact and one star for the magnetic attachments.I purchased this dryer for an upcoming vacation (didn’t want to haul my big one with me) so the first time I turned it on was at the hotel. It lasted maybe 15-20 seconds then blew up. Literally. It singed my bangs and blew the fuse in the hotel room. What the heck?! Since I purchased it in advance plus had to wait to get home, I’m outside the 30 day return window. Bummer. I had high hopes for this hair dryer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Heat setting burns out quickly","reviewDescription":"This is my second purchase(bought awhile ago but just opened recently) and appears same problem exists. After several months of using, the heat setting won't go to high- seems \"stuck\" on medium and the air is almost warm-cool. High heat np longer works!  Thought first one I purchased maybe was a lemon but the same thing is happening again. I like the dryer but not worth it to have the same thing happen again. I have shoulder length hair so it's not like I've had the dryer on forever......search is on for new brand!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"DEAD after 4 uses, less than 6 weeks, now the Product us useless with No Customer support","reviewDescription":"Defective product. The product is dead after 3 - 4 uses within 6 weeks, and outside the return window, Amazon is not helping with the issue, referred to reach out to external support on to their website. When we try to get Product support, This item is not eligible for this service.If you need help with this product, visit Amazon’s Customer Service Help page. Amazon customer service is even not taking accountability referring to warranty which doesn't even exists.DO NOT Waste your time and money on this Product, not worth it totally.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Stopped Working","reviewDescription":"I used this dryer sparingly only my daughter's hair to keep it healthy. It stopped working mid-drying session after about 1.5 months. I let it rest for a couple of hours before trying it again and it started smelling like burning plastic. The heated coil inside was glowing red (even on the cool setting), but the fan just gave up. I'm not willing to give this another try because now it's a safety issue for my child. Unfortunately, this was just outside of the return window and I'm stuck with useless clutter.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"No power","reviewDescription":"Used the blow dryer for just under 120 days and the plastic is melting. I use the dryer for my beard and hair (not much up top daily) so not exactly a whole bunch. When the blow dryer says it has technology to regulate temperature - I'm not convinced Additionally, I am trying to reach out to seller regarding a warranty claim and it hasn't been easy to find a way to reach out to them to see what's up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"CRAP Stopped working after less than 1 hour (total) of use","reviewDescription":"So cute but crap. Loved it the first time I used it (maybe 30 minutes). The second time I tried to use it, it cut off after about 15-20 minutes. IT HAS NEVER TURNED BACK ON. Tried resetting GFI plug. NO GO. Complete waste of money because I had to leave on a trip and so I didn't immediately contact Amazon. Now I missed the 30-day return window, so I guess I'm poorer but wiser.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Turned on and stopped working after 30sec!","reviewDescription":"Unfortunately the item worked for all of 30 seconds before shutting off and never powering back on. There was an awful smell when unpacking, as if it had already been used and fried hair. I took the chance to try it out but unfortunately could never get it to start back up.Of note: the weight of the dryer is great and the cord length is decent. The diffuser was not deep enough for my liking. The air holes in the diffuser were also quite large - this can often cause frizz on my curly hair","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Love the dryer but cheap attachments","reviewDescription":"The Dryer does what it need to do. It dries my hair and wigs very well. I use the comb attachment the most. I have had the dryer for within a month, Brussels on the comb broke off; within in about 2 months, the clip on the attachment broke to the point where it will not grip. It’s hard to find a replacement on here. Don’t work with other attachments.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Multi-Use Hair Dryer","reviewDescription":"At first when I bought this product I was a little skeptical but once I received it I put it to the test and it was great! You can use it as a hair diffuser if you want to define your curls or if you simply want to dry your hair. It is also not as big as a usual hair dryer so if you travel a lot this tool is definitely travel friendly! Great product, I loved it.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Lightweight and does the job!","reviewDescription":"Dries my hair fine! Love the diffuser","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Bought as a gift","reviewDescription":"It works, drys hair reasonably fast. I bought it as a gift for my gf, got it on sale and she says it works well and likes it. So can’t complain I’d recommend if you find at a good price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Noisy after power off","reviewDescription":"It works the same as any cheap basic blow dryer. I don't like that you can hear the fan unwine after powering it off. I do like the three settings for heat and speed. Kind of heavy. Otherwise works the same as a $15 conaire brand.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Good product","reviewDescription":"I love the color and how light it is…. Wish cord was a little longer","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"aMaZiNg ✨","reviewDescription":"This product is so great! I had gotten my hair done by a professional stylist who specializes in curly hair (which is what I have. I have half wavy and half curly) and she used a Dyson or something. I know it was an expensive hair dryer\/diffuser. And I had been on the search ever since then and I got something that is less pricy (this product) and it’s the same thing! It’s definitely a tad bit louder but it works pretty great to me! It’s super easy to hold and super easy to pack away for travel or storage. So yea it’s super great I 100% recommend!!","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Works well, but 🔥 🥵","reviewDescription":"Works well, seems quicker then my old dryer. I wouldn't say it any quite of a dryer. If so it's not noticeable to my old Revolon.  Use a heat protector as the high setting is very very hot.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Mostly love this","reviewDescription":"I’ll start out with my only complaint - location of the buttons.  I have found I hit the cold blast button inadvertently and sometimes hit the other ones while drying.  My daughter and I have thick hair so I usually have a death grip on the dryer and I am just really easily hitting those buttons.  Kind of annoying.  Other than that I love this dryer for the quick dry on my hair and the add-ons for different styling.  My last dryer (different brand) burned out within a year so hoping this one actually lasts.  We will see!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Not as quiet as I would have liked, but great smaller hair dryer.","reviewDescription":"FAR from the quietest hair dryer on the market, but the heads stayed nice and tight despite heating up quite a bit with use. If you're looking for a cute, affordable dryer, this one is a good choice for the price point.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Awful product","reviewDescription":"I bought this to replace a dryer I had for several years. Purchased in March 2024, it stopped working the 1st week of July. I only used it 2-3 times per week. Extremely disappointed….","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Buyer Beware","reviewDescription":"Comb attachment is flimsy. The base cracked after having it for 7 months. Customer is not available for getting a replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Only lasted 7 months","reviewDescription":"This was great until it started shorting out and literally blew up in my hands. Flame and sparks shot out of it. I'm lucky I didn't get seriously hurt. Do not recommend this blowdryer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Defective","reviewDescription":"Had this hair dryer for approx 3 months, it was operating normally and did a nice job drying hair but this morning a flame came out of the base where the wire goes into the dryer. Scared the hell out of my wife and the unit stopped. This shouldn’t happen on a unit 3 months old. Very disappointed. I am outside of the window to return it but hoping the manufacturer sees this review and stands behind their unit.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Died after 4 months","reviewDescription":"I had this for 4 months and I don’t dry my hair every day. Just died and started smoking.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Broke quickly","reviewDescription":"Stopped blowing hot air after 1-2 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Was good but broke....","reviewDescription":"I ordered this hairdryer on the 26th of October. It worked rather loudly from the start but it didn't concern me as I thought it was just the type of hairdryer. I plugged the hairdryer into the same plug when using it and before Christmas I tried it in a different plug in the house and it tripped the fuse. This proceeded to happen when using the dryer in any plug other than the one I have used for the first couple of weeks. Seems to be some kind of electrical issue and its now too late for me to return the product...","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1705190400000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Product will not turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Heating stopped working after 8 months","reviewDescription":"It was working great initially but the heating strength decreased all of a sudden and it doesn't dry the hair anymore. Would have wanted it to last longer than this.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Broken after a year","reviewDescription":"Its broken after a year","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Incomplete","reviewDescription":"I love this blower! It’s compact, dries my hair quickly and looks great! So worth the money! I did notice that it was missing one of the attachments. I had already used the blower so I figured it was too late to return it even though I still have the box. I should’ve been more vigilant. It is wonderful though, overall.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Good","reviewDescription":"I like it. It came with a little scratch, but no big deal. Does the job","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Blow dryer","reviewDescription":"I did just receive my dryer, but first use it did take longer than 5 minutes to dry my hair.  Haven’t used any other of the attachments yet","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Blue Wave","reviewDescription":"It works really well. Only reason not a 5 is it is kind of heavy and a short cord.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"very fast","reviewDescription":"I have long hair, down to my waist and it dried my hair in like 5 minutes.  I used the comb attachment and switched to blow attachment with ease and never turned the dryer off.The only reason I didn't give 5 stars is because it is a bit loud.  But dealable.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Drys your hair very fast","reviewDescription":"Love this and all the attachments it comes with. It has different heat settings and hair settings. I have thick curly frizzy hair, and this doesn't make my hair frizzy. Dries quickly and when using the hair attachments make my hair look great. The purple color was a plus. Will repurchase and\/or buy for gift","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Hair dryer","reviewDescription":"This hair dryer is small but powerful. It is sleek and has three different control seating of temperature. The cord is long enough for me to move around and the attachment are great for when I am in a rush.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Cold air","reviewDescription":"The air wasn’t as cold as expected but other than that I like it and the style is cute and easy to hold. The functions are also nice","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Attachment came damaged","reviewDescription":"I was excited about this hairdryer but disappointed that one of the main attachments is chipped and dirty. It seems to have a sticky film on it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great dryer, HORRIBLE brush","reviewDescription":"The dryer, diffuser, and towel are all PERFECT for the price, but the brush is absolutely horrible. Used once for a blowout and it tangled my hair and created the biggest knot. Threw it out immediately. But besides that, everything else is great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Small lightweight Hair Dryer for Travel","reviewDescription":"I decided on this hair dryer as I was looking for something small and lightweight.  It checked both the boxes on that.  It is not super powerful so if you are looking for something that will give you the blowing power of a more expensive brand this might not be for you.  It does the job though, quickly and efficiently.  Glad I made the purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"21 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Cute and gets the job done. I’d recommend.","reviewDescription":"pros: lightweight, made my hair shiny, comes in nice colors, dries my hair relatively fast, and comes with 3 attachmentscons: while the other 2 attachments pop right off when needed, the comb attachment is very hard to get off. i had to look up a video on how to.its easy to accidentally be pressing the cool shot button and the grip in general isn’t the best because i have to be conscious on where i put my hands so i don’t accident knock up the heat or turn down the speed.","isVerified":true,"ratingScore":4,"reviewReaction":"40 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Cute small and powerful","reviewDescription":"Cute small and powerful product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"It dries fast!","reviewDescription":"This hair dryer I’ve had for two days  so far it’s been amazing. It literally takes no more than 10-15 to dry my hair.  It doesn’t  leave my hair frizzy or feeling wet.  It instantly dries my hair quick. Leaves a bit of shine to the hair. Its  not heavy to hold which I like. Doesn’t have any heat sitting which I don’t mind cause it already heats hot enough for me. Yeah it’s loud but not to the extent it over does it, so the noise doesn’t really bother me. I say you have to try it for yourself and if you don’t like it, just return it simple as that.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Light weight","reviewDescription":"Very light weight and fairly quiet. I bought this for my mom and she’s really liked it so far. She said it dries her hair fast.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Small but powerful","reviewDescription":"I like how it is small, yet powerful, quick and easy to use and it gets through mine and my daughter's thick hair","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Light and easy to maneuver","reviewDescription":"Really give my hair a shine and easy to manage; especially for someone who had arthritis.  Good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Best hairdryer to reduce frizz!!","reviewDescription":"I asked my hairdresser for suggestions on a hairdryer and she recommended this one. I have never had a dryer this great and my mom also ordered one after my review and she loves hers!! If you have curly or frizzy hair, you need this pro-type dryer!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Works well","reviewDescription":"I like the dryer,  works well i use it on my hair and my daughter's. My hair is thick and course, My  hair is a lot more manageable using this dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"50 people found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Amazing product","reviewDescription":"This is by far the best blow dryer I have bought. It dries your hair extremely fast. With the different attachments it cuts down some time especially with the comb attachment. I also love all the different settings. The cool setting actually gets cool. I would definitely recommend this product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Dying after 2 months. Weird noise and smell","reviewDescription":"I really loved this dryer for the two months it worked. It now is making a weird noise like something is stuck in it (very screechy loud noise) and I’m no longer able to use it.I tried to record the sound and it made a DIFFERENT SOUND (see attached video) and started smelling like smoke.I am hoping to get in contact with WavyTalk for assistance","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Regular loud blow dryer","reviewDescription":"This blow dryer looks like the newer more advanced hair drying blow dryers, but it’s not! It’s loud, takes a long time to dry my hair for 2 to 3 times the money. Save your money and don’t buy this one!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Broke after 4 months","reviewDescription":"The air was so hot and intense during the first use that I put it on its lowest heat setting. Used to to blow-dry only my bangs for about 90 seconds and the plastic on the front completely melted. Definitely do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"I got one of the ones that doesn't work properly.","reviewDescription":"I expected it to be powerful based off of the reviews but when I got the hair dryer it was much weaker than expected. I had an old hair dryer that was very cheap and it was much stronger than this one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Did not work","reviewDescription":"I order this products a few months ago for a rainy day. The “rainy” day came yesterday and oh surprise: it doesn’t work.  Definitely learned a lesson… always check upon arrival!  :(","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"The hot cycle eventually wears out","reviewDescription":"This hair dryer is dangerous. If it’s set to hot setting it sparks and blows cool air which is not powerful despite being on high. I threw mine out for fear of catching fire","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Already broke 6 months after buying it","reviewDescription":"This hair dryer was great at first but I noticed it started losing power about 4 months after buying it and now, 6 months after I bought it, it doesn’t have the same power AND it isn’t blowing hot air anymore.I don’t even blow dry my hair every day and I’m the only one using it so it definitely shouldn’t have broken after 6 months.Now I have to buy another hair dryer. Ugh","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Stopped working","reviewDescription":"I’ve had this hair dryer for 6 months and it’s no longer blowing hot air. It turns on and blows cold air but not warm or hot. I use the hairdryer about 2-3 times a week. It should have lasted much longer than 6 months! Unfortunately, I’m well past the return window now. I would not recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Bad hair dryer!","reviewDescription":"This hair blower is a piece of junk. It does not get hot enough to dry hair. The box came in the mail all tapped up with all kinds of tape. I should have not opened it. I tried to use it once and then put it away on the closet. I feel really bad that I lost $35. Getting really disappointed with Amazon. A couple weeks ago my husband got some expensive Blue dog food and it was totally tapped up. I really do not want to give it to my dog, but he would not take it back or complain.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Disappointed","reviewDescription":"The dryer worked great for two weeks then it started making a noise like it was falling apart on the inside. It will blow hard then it will quit blowing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"No!","reviewDescription":"This is not for course hair. Does not get hot enough and takes long drying time. The appearance is nice but I would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Not reliable","reviewDescription":"Bought the hair dryer for my mother, she used it a few times it never blew any hot air! Then the safety plug stopped working so now it does not turn on.I should have know better, don’t buy it","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Incredibly Disappointed","reviewDescription":"I was so excited for the blow dryer. I did so much research into getting a new dryer due to the fact I’ve used the same kind for probably 10 years. I finally decided to get a different kind. I read 85% of the reviews on this one so I chose it. I have an incredibly thick head of hair but based of reviews this dryer is powerful. It is not! It unfortunately wouldn’t even blow\/move my hair. This could just be a bad one I’m not sure but at this point I’m not willing to risk it. Something is up with the heat as well. It’s not getting near as hot as it should be.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Not worth the purchase","reviewDescription":"I’ve had this for less than a year and it stopped heating. Waste of money, incredibly frustrating because now it is essentially useless","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722211200000}
{"reviewTitle":"STOPPED WORKING","reviewDescription":"I used it for a month and it stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Stopped Working","reviewDescription":"Have had this since October 2023 and it just stopped working. Only blows cold air now. Have had less than a year.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Heavy","reviewDescription":"This hairdryer had great settings except it was heavy to use compared to other hairdryers. I wouldn't recommend due to the weight.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"It broke in under one month","reviewDescription":"I thought this was going to be the perfect hairdryer, but it is not well-made and it’s already making terrible noises within the motor compartment and I am one day past the return limit. :-(.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Broken","reviewDescription":"The blow dryer motor died after the third use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Defective product","reviewDescription":"I ordered two of these dryers within the same month of each other. After less than one month of daily use the dryer started sparking and would turn from hot to cool air. Tried the second one and did the same thing. I lost $80 on these two dryers within one  month! Amazon would not give me a refund since they said it was past the return window. Do not buy this dryer if you intend to use it daily!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Just not worth it","reviewDescription":"I picked this hair dryer in November of last year (it is now late August) with the hope that it would replace my old Revlon dryer and look a bit more sleek. Ultimately, it had too many problems and I have just ordered a replacement. But I hope my experience can prove useful.The first issue with the dryer was that it lacks a loop. I hang up my dryer with a loop, and I should have known right away this was going to be irritating to me - especially given that part of the reason for the purchase was aesthetic.The second issue was that it didn’t seem to be even a mild improvement from my prior hairdryer even though that one cost a fraction of this one. It wasn’t faster. It wasn’t quieter. It was weaker, so I did find it was better on my hair, but I’d rather have a full speed dryer I can just make cooler.The last issue developed over time. Within the last few months, I’ve noticed that the handle gets hot. Others have mentioned that here as well, so it’s not just a lemon. Something about this dryer is sending heat into the handle, and it’s deeply concerning to me. I have a sneaking suspicion something is about to break or melt in the unit, and I don’t want to risk it happening while I’m using it.Honestly, I’d just stick to the more reputable brands. These private-label brands are a dime a dozen on Amazon, but you’re not actually getting a deal. Get a reliable hair dryer from a reliable brand that will stand behind their product.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Only great if you have a lot of time on your hands or extremely thin hair","reviewDescription":"I own and LOVE the CONFU 2200w. But it's a bit heavy for traveling. I wanted a more compact\/lightweight  but affordable option for travel. (Overweight bag fees suck when you have a heavy dryer)  SO in my search i came across the Wavy talk hairdryer and it seemed super promising after looking at tons of other options.. it filtered in the high wattage category somehow but now i see it is only 1500 watts but plenty of thick haired ladies gave it great reviews. My only assumption is that their hair either is not very thick or they have not experienced the magic of a 2200w hair dryer. I know the new technology of the dyson type hair dryers have lower wattage so it still should have been slightly better than it was. But at the rate of dying time the WavyTalk dryer gave me i may as well not pack a dryer and use the conair cheepy hair dryer that come in a lot of hotel rooms. But vacation time is precious and i don't want to spend an hour in my room blow drying my hair if i have a special event i need to use it - most of the time i will let y hair go au naturale curly\/wavy but i want a hair dryer with me just in case which is why its important it was not heavy. which it wasn't too heavy but its lightweightness didn't match the weak drying.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Disappointing. Not faster, not really quieter, and much heavier than my 25 year old hair dryer","reviewDescription":"This hair dryer did not live up to the hype.  I purchased it to replace my 25 year old revlon hair dryer. I was hoping for a quieter, faster drying time with a cool air option.  The cool air option was really the only success in my view. Both dryers are 1875W, but the wavytalk takes much longer to dry my hair than my old dryer, even after I turned the heat to max. It also doesn't sound any quieter than my old dryer. I measured with a sound meter app, which said that the wavytalk is 85db on high\/cool setting and not the 69db claimed in the ad above. The old revlon is 88db.  Last, old dryer is 10.5oz and this new one is 15.5oz, much heavier.  I don't see enough benefit over my old hair dryer to justify replacing it, so will send this back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"RIP Little Hair Dryer","reviewDescription":"I loved this little hair dryer when I got it. I liked the size. I liked the short snout because I didn't feel like the attachments made it longer than my arm. It dried quickly and it wasn't damaging my hair. I was a pretty big fan all around.  After a couple of months the temperature became very inconsistent with only short bursts of heat even when it was on the highest setting. Then I started to notice a weird noise every time I shut it off and that continued for a few months. I should've realized that it was a sign of a bigger issue. I'm saddened to report that this hair dryer died in my arms this morning approximately 35% through my hair routine. I was mildly inconvenienced at the time but that grew exponentially when I realized that I'd  only purchased it about 6 months ago. I would never expect to be able to use the same hairdryer for 30 years like our foremothers but come on! I didn't even use it every day! 3\/10 would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Not for coarse hair","reviewDescription":"This blow dryer is certainly not for thick or coarse hair. The attachment is a lot smaller than I'd hoped and it has a burnt smell on high. The placement of the buttons is strange if you intend to hold it eith the handle and its too hot to hold it by the head. Dont like the way hair feels after either. Got it to replace my pattern blow dryer because its wuite heavy but I dont think this is it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Nothing good","reviewDescription":"I’m not sure why there are such good reviews on this. For starters, it doesn’t have great blowing power. However even though it didn’t have good blowing power, it didn’t seem to take any longer than my other hair dryers did to dry my hair. The second big fail was the placement of the button slides. I kept pushing them up or down constantly. Unfortunately I will be returning this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Disappointed","reviewDescription":"Loved it at first! Feels great, works great, attachment heads are great. However after just one month of use it broke. I only dry my hair once or twice a week at most so haven’t even used it very many times. I heard something pop inside the dryer about a week ago but everything still worked so didn’t think much about it. But today while drying my hair the whole thing just stopped. The heating element still works, but it no longer blows out any hair. Very disappointing!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"I would not recommend the product","reviewDescription":"I purchased this hair dryer since it was less bulky than my Conair and the Ionic feature was appealing. The size is great, easy to handle. It doesn’t feel to heavy that my arm gets tired from blow drying my hair. It comes with two add-ons, a concentrator and a difusor. It also isn’t as loud as an older hair dryer which is a nice feature as well. The reason I would not recommend this product is because your hair gets sucked in and caught on the motor on the back of the hair dryer. I have never had this issue before and it is become an issue every time I use this product. I began to notice this issue when I would use the difusor. I have long, curly hair so I enjoy using the difusor option. I was bending over, had my hair flipped over my head and began diffusing my hair. Since you have to diffuse your roots, I moved the hair dryer close to my root which the rest of my hair fell over the hair dryer. I started to feel a tug on my hair and noticed that the motor on the back of the hair dryer had pulled my hair in. Even though the hair dryer has a cap that covers the motor, it still is able to pull your hair through. Additionally, since my hair ended up getting caught in the motor, the strands started to burn. Even if you remove the cap, you can’t access the motor so I was unable to pull the strand of hairs out from the motor. When I use the hair dryer now, it emits a burnt smell since my hair is still wrapped into the motor. It’s unfortunate that you can’t use this hair dryer to its full capabilities. It also raises a concern that the motor can get tangled in the strands of hair it sucks in. I should be able to place the hair dryer in and out of my hair to be able to properly diffuse so not be able to diffuse my hair makes me regret buying this hair dryer. I would prefer to spend more money on a quality product that works to its full capacity.","isVerified":true,"ratingScore":2,"reviewReaction":"10 people found this helpful","country":"United States","date":1662940800000}
{"reviewTitle":"Died after 6 weeks use","reviewDescription":"Worked fine until it didn't.  30 day warranty not enough as the hairdryer stopped working after 6 weeks.  Quality not there for long term use.  Beware, you may be stuck with buying another one when your's dies.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724803200000}
{"reviewTitle":"Not What I Expected","reviewDescription":"I’m still uncertain how I feel about this dryer. I was expecting faster dryer time with less frizz. Have used 4 times and so far no less frizz. As for drying time, no different than my conventional dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"one nozzle dirty one nozzle can't take out","reviewDescription":"the small nozzle came in without any package and dirty. the other nozzle once click in, can't take out. this may not impact the effectiveness of the hair dryer. but the improper design and cosmetic problem really make it a return, and not sure if i will buy any product' from the company","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Not worth it","reviewDescription":"Bought this dryer back in March expecting it to last at least a year like my other dryers have- motor shut down on me 3 months later. Not surprised the return time is only 1 month after purchase. I’m tired of buying $40 dryers that crap out on me after only a few months of usage. If you’re looking for a dryer that’s going to last you, this one isn’t for you.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"Quit working after a few blow drys","reviewDescription":"I loved the dryer when I first started using it. Last time I used it, the dryer glitched and went half power before shutting of completely. My return window is closed, as I waited to long to unbox it and start using it. Only used it a handful of times.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Missed the mark with quality control","reviewDescription":"Recieved Used-Defective blow dryer. First clue, there was an issue should have been the packaging.  Plactic wrapping was in the bottom of the box. Burnt smell to unit, persists even when not in use.  Wasn't albe to use long to see if it was any good.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Only worked for 6 months, now only blows cold air. - UPDATE was given a refund by seller!","reviewDescription":"UPDATE:  The seller contacted me and offered me a refund or a replacement, stating they stand behind their product and they think I just got a lemon.  I appreciate the seller doing this so much, it shows that they stand behind their products and do the right thing.I bought this hair dryer in January of 2023.  It worked fine, nothing special, but no complaints.  It is small and compact and did the job.  It did not have the greatest blowing power, even on the highest setting, but it was ok.However, today when I went to use it the heat setting would not work.  It will only blow out cold air, no matter what setting I try.  It only lasted 6 months!  I am so disappointed.  I take great care of my products.  The dryer hung on a hook in my bathroom.  I have pretty wavy hair and the majority of the time I let my hair air dry, I probably only use the blower dryer once a week for about ten minutes and with that little use, it still stopped working that fast.  Very poor quality.","isVerified":true,"ratingScore":1,"reviewReaction":"62 people found this helpful","country":"United States","date":1686096000000}
{"reviewTitle":"It doesn’t even work…","reviewDescription":"I liked that it was supposed to be less noisy than a traditional hair dryer. But I never even got to see for myself because the one I received doesn’t work! I’m very disappointed. I really needed something to help dry my thick and curly hair.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"No funciona","reviewDescription":"Lo malo: Me duró dos meses y dejo de funcionar. Es pesado para un secador chico como lo describen. El ruido es el de un secador normal.Lo bueno: seca tu pelo en 10 minutos si lo tenes a media espalda de largo","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"0 stars","reviewDescription":"DON’T DO IT. I just bought this hairdryer a month and a half ago, and tonight the motor broke down and blew sparks out the barrel. I could smell the inside burning itself and it would have caught on fire if I hadn’t quickly pulled it out of the outlet. It’s no wonder the return window is only 1 month…joke’s on the buyer, clearly. HARD PASS.Update: I’d like to acknowledge that the company did reach out and refund my purchase, so the company gets a 3 stars. However, I still wouldn’t recommend this hair dryer.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1713484800000}
{"reviewTitle":"Quality","reviewDescription":"Very cheap material. The attachment was so hard to remove. The item didn't was not in Amazon box. The item was left outside the mailroom. It was outside the mailroom bldg which anyone could have stolen the packages","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Used","reviewDescription":"Be careful purchasing..mine was obviously used. There was hair and dandruff on one of the attachments and inside the bag that was holding it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Do not buy!!","reviewDescription":"After 1-1\/2 months, and only used about 10 times, the hair dryer overheated after less than 1 minute on and stopped working. Window for return is closed they only give you a month to return.Buyer beware","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Broken","reviewDescription":"This product broke the day after the return window closed. I tired restting the device, but it only makes a burning smell. Not recommended.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Poorly designed","reviewDescription":"I’ve had this for one day and it’s already giving me issues. After drying one side of my head it dies and I have to wait before being able to continue. You get what you pay for I guess.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Missing piece","reviewDescription":"Great product but it is missing a piece.  There are supposed to be 3 attachments and only 2 were in the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Sparks shot out and stopped working","reviewDescription":"I was just in the middle of drying my hair when suddenly it stopped working. Good thing I took it away from my head to see what happened,  maybe it unplugged I thought? I turned it off,  and back on and sparks flew out and burned my wrist. Before this it worked nicely,  but after that, I don't recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Arrived Broken","reviewDescription":"Unfortunately, this blow dryer arrived broken and appears to actually be used. Will be returning this right away.I was trying to replace a $250 blow dryer that still works but is outdated, I’ve had it for 10 years and just wanted something new.I guess you really do get what you pay for.This blow dryer feels super light, which is not great. As you can see, it’s made of cheap plastic and broke before it even got to me. Although, the breakage could’ve been from someone else using it as it does look like it was already used.Super disappointed, will continue to search for a new blow dryer.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Almost burned my house down","reviewDescription":"I ordered this hair blow dryer after seeing great reviews and after seeing that this was an Amazon pick. It’s a sleek design with a variety of different attachments and I was excited to try it out. I plugged it in and turned it on and immediately smelled a chemical burning smell. Oh well, it’s new, I thought, and I haven’t had a hair blow dryer in awhile, maybe this is just how it smells. Well the smell got worse and plumes of gray smoke started billowing out of the blower. I quickly turned it off but moments later, every smoke detector within twenty feet of the bathroom started blaring. My cats hid under the bed and my kids started retching from the smell. It may be awhile before I’m brave enough to try a hair blow dryer again. Sadly, I will be returning this product.","isVerified":true,"ratingScore":1,"reviewReaction":"32 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Don't waste your money","reviewDescription":"Plugged it in to use and it would not turn on, it just began smoking a little bit and got very warm.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Stopped Working","reviewDescription":"This hair dryer stopped working in the first 3 months, after only a couple uses. I would not recommend it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Couldn’t keep using it","reviewDescription":"I thought this was a great deal until I noticed it get so hot that it’s melting it’s own parts!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"2 month later it doesn’t work","reviewDescription":"Had this for 2 months. Used it maybe 8 times and this morning it won’t come on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Junk","reviewDescription":"Lasted a month.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Not what it claims","reviewDescription":"I received this product today, and I am returning it. The reason is that all those things mentioned in the product description do not exist when the actual box arrived. Not a word about the dryer being \"ionic\" or having \"low magnetic wave construction technology helps reduce electromagnetic field radiation by more 50% than other general 1400-1600W hairdryers\" written on the box or in the product manual. If you'd like to have just a regular hair dryer, this can be it. But I have zero tolerance for misleading descriptions, so I am returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Loved it but broke out of no where.","reviewDescription":"I used it maybe 3 times and really liked it but it broke while using it one morning, just completely stopped and now it won’t work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Stopped working 2 weeks in","reviewDescription":"It was great until it stopped working 2 weeks in. The quality is exceptionally poor","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Fire hazard !","reviewDescription":"At first I loved this . Light weight and smaller with power . It’s only been about a month since I’ve been using it . Tonight the cord was so hot to touch and was burning my hand . My dad is was an electrician and said unplug it and throw it out immediately. He said it could have cause a fire and worst case it could have spread to inside my wall . Something is very much wrong with this . Miss my old one I had for so many years .","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Eh","reviewDescription":"If you wear rings it scrapes the pink and leaves so many grey streaks","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"ITT’S NOT WORKING ‼️‼️‼️","reviewDescription":"Love the HAIR BOWER ‼️‼️‼️ But NOW IT’S NOT WORKING ???? Can I return????","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Quit after 3 weeks","reviewDescription":"This dryer was pretty good when it worked. I liked the speeds and temperatures (both lower than my old dryer), but it stopped working after about 3 weeks and began to smell like burning. Now it appears that I cannot get a refund, which is disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Doesn’t last","reviewDescription":"Bought this in November and gifted for Christmas to my daughter. I used it twice on her and now it doesn’t work. Don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"VERY HEAVY! NOT lightweight as described at all!","reviewDescription":"This is the heaviest hair dryer I've ever had! And it's described as lightweight in the title! Nope.Mine also arrived with scratches in the pink color so it looks used. Or just poorly made.I still tried it once to see if I could deal with it because it's super cute looking and supposedly does all the things I want. BUT the defuser is VERY small and did not work for me at all. Also it was hard to get on and off the nozzle too. However it would never fall off on you if you left it on all the time like some though. If you don't need a big diffuser and don't mind the weight it would be great for you.I'm returning this because I can't get past the 2 major flaws since those are my only 2 reasons for buying a new hairdryer!Lightweight and good defuser still needed....Now I'm back in the hunt for another one to try...sigh.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1641600000000}
{"reviewTitle":"Poor design, sucked up my hair in back of it.","reviewDescription":"It works well, but I have a little longer than shoulder length hair and the motor sucked my hair into the back of it.  It was so bad I had to cut my hair to get it out. Now I have a sizable piece of hair in the back and I can’t get it out because the piece it got caught in doesn’t come off like the filter does. I can’t use if for fear of it catching on fire. I’ve never had a hairdryer do this. My cheap Conair was $20 and is about 20 years old and this never happened. Really disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"got a used product","reviewDescription":"The hairdryer came with scratches and dirty. Didn’t want to turn on and when it did the air it blew out smelt super burnt although it does have a strong blow and not as loud as a typical hairdryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Disappointed","reviewDescription":"Very disappointed.  Does not have much power so struggle to get hair dried and it seems kind of awkward handling.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Not as powerful","reviewDescription":"This hairdryer is meh. Does the job just not as quick as I was looking for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Super cute and compact but a major flaw...","reviewDescription":"Dryer is really cute and compact in size. The diffuser is extremely tiny so it took me a little while to dry my curly (2c\/3a) shoulder length hair. All was going fine until the back filter sucked up a piece, thankfully just a tiny bit, of my hair! I did see a review that it also happened to someone else but I didn't think my hair was long enough to have that happen. I had to cup the back of the dryer to protect my hair the rest of the time. I had my previous dryer (an ion brand from sally's beauty) for maybe 8+ years and that never ever happened before. Safe to say, this dryer isn't the one for me or my hair length.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"Nice design","reviewDescription":"Unfortunately one of the accessorize was always stuck in and I had difficulties to remove it.Also the highest heat burns while the voltage is lower than the one I have at home.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Mid","reviewDescription":"This is a decent hairdryer. I got it on prime day and it came on time. The only problem I have is with the diffusing head on, my hair goes down in it and it pulls my hair and it is extremely scary. I’ve had to change my way of diffusing my hair.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Broken","reviewDescription":"It looks used, clips for the back side were broken.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"It’s heavy and handle is straight hard to use.","reviewDescription":"The dryer is too heavy. The handle is straight and very hard to use. Save yourself some money and buy a diffuser for your old dryer. I bought it for my curly hair.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"It's hot","reviewDescription":"It does scratch easy.  The handle gets hot,  but it dries in a good amount of time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"comb broke immediately after one use.","reviewDescription":"Comb\/attachment broke after one use. FYI","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Problem first day with attachments.","reviewDescription":"I love the power and control of the dryer but I tried the comb attachment and can’t get it off. It should NOT be difficult to switch attachments. Now I am sorry I  bought it.Poor customer services. They have not answered two emails over the past two weeks. I am returning it if they don’t respond by next week. Not acceptable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"LIKED but...","reviewDescription":"Worked great for about a month or so.  Then the heating element went out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Product description says it's ionic but I don't think it is.","reviewDescription":"It's a nicely designed product that's lightweight and easy to use but several places in the description it says it's ionic and I don't think it is. I wish somebody with the company could tell me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Didn’t last","reviewDescription":"Bought last July, started using in September. Only used it 2 to 3 times per week. And it’s already broken, coils. Unfortunate , it was my favorite hairdryer, but I wouldn’t buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Great for two months- then stopped working","reviewDescription":"Loved a lot of features on this hair dryer. Small, compact, powerful, quick drying on long hair, and temperature control. Bought it on March 21 and it broke down today- June 28.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Love it but sadly the heating element broke","reviewDescription":"I have curly hair and just recently got bangs. I thought this would help set my hair in the mornings. It was awesome! Small, pretty quiet, light and did a great job. Except it is now June 13th and the heating element broke on the dryer already. Only had it for 3 months. So just be aware you may have a great hair dryer for 3 months and then it might break. :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Dont be sensitive if you want it.","reviewDescription":"For starters. The colors are amazing! Will give it that. But the heat options are way to hot to keep close to your head. I am a wavy girly myself but i cant keep the difusser up for longer than 5 seconds, and thats not even on the hottest setting. I cant keep it close to my ears because my piercings  will burn my ear. Its just not working for me. Would have send it back if it wasnt for the high rate. There are better ones out there.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Broke after a month and a half","reviewDescription":"It was the best hair dryer I ever had initially. After a month and a half it stopped blowing warm or hot and only blows cold.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Not good","reviewDescription":"I dont know how i feel about this one. It’s not hot enough. Ill be returning.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Dries the hair...","reviewDescription":"But it was a challenge to get the hair straightened enough from the drying. It didn't meet my expectations based on my former blow-dryer. Next, I'm going to try the Shark HyperAir blow dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Worked ok, died after 4 months","reviewDescription":"This hair dryer was ok, wasn’t anything special. It overheated often, I burned myself on the prongs from the plug a couple of times. After 4 months of use, it completely died.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Overheated","reviewDescription":"I used this dryer twice and it overheated and the speed of the fan didn't work well anymore. Unfortunately I waited too long to ask a refund","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"No European plugs","reviewDescription":"My search was for a hair dryer with a European plug, but I was surprised to receive one with American plugs! :( I may return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Cute but ..","reviewDescription":"Lasted 3 months before sparking and almost catching fire.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Quit working after 5 months!","reviewDescription":"It stopped working after just 5 months!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Didn’t turn on","reviewDescription":"I used this hair dryer for two month, I liked the way it dried my hair because it did it much faster than my previous one. But today when I plugged it in, it didn't turn on again, just two months after purchasing it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Warning","reviewDescription":"First and foremost, beware, do not touch the attachments! Extremely hot and burnt me. Also, on the pink blow-dryer the attachments are NOT magnetic and very hard to remove. The blow dryer is no better than my Walmart one. It does not make my hair soft, shiny, or control fizz. It is a cute color and I will keep it for a travel\/extra blow dryer, but only because my daughter likes the color. I will continue using my Walmart blow dryer, as it does a better job with friz control and shine (I have straight long hair). Both blow dryers drying speed is the same. Needless to say, I was disappointed because I researched and read a lot of reviews.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Compact","reviewDescription":"Can not get the nozzle off the dryer so I can't place it back in the box for storage.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Dries very fast","reviewDescription":"Like the attachments and different settings.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Daughter loves it!","reviewDescription":"Bought for my daughter and she loves it. Says super powerful and works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Dries fast….but","reviewDescription":"I like it, it dries fast and it’s lightweight. The only thing I don’t like is it’s really hard to change the attachments. I made the mistake of putting on the comb attachment to try it and I like it, but I could not get that thing off to put on the regular attachment I can’t think of the name of it, concentrator. I pulled, I pried, I tried putting a screwdriver in the crack. Finally, I pulled hard enough and I got it off so the next time I used it I didn’t put it all the way on.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Good  compact hair dryer","reviewDescription":"This hair dryer is compact and works well on my thick hair.  I love all the attachments.  I wish it got a little hotter, as I feel like it takes longer to blow dry my hair.  Definitely worth the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Salon Finish","reviewDescription":"Although it was not stupid easy to figure out how to turn on the hair dryer, once I did figure it out the experience was worth the wait. It is comfortable to hold and use. I love all the attachments and the color.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Worth it","reviewDescription":"I needed a new blow dryer and didnt want to buy an expensive one. This is worth it and does the exact thing as an expensive one lol","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Great for my baby fine hair but not for thick hair girlies!","reviewDescription":"Quiet, light weight and worked fine for my thin hair but it is not greatly powerful so would take forever to try thick hair!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"It's ok light weight","reviewDescription":"It's ok so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great but…","reviewDescription":"Other than having some difficulty taking the attachment pieces off, I really love this lightweight blow dryer. It works extremely well and is powerful.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Very cute","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"The Same as Most","reviewDescription":"No difference than a normal hair dryer. It gets very hot that's about it, the straightening effect definitely not there. Drying time is quick that's all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Used and has scratches","reviewDescription":"I was given a used or returned one. The label was slapped on the box and was delivered as is on a rainy day. Box was not sealed. The dryer itself looked used - it had scratches and sticky spots. Cute color but ordinary.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Short lived","reviewDescription":"Worked great when I purchased last year in August.. Then  suddenly motor blew out. Completely broken now. Didn’t last one year.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Breaks easily","reviewDescription":"I hadn’t even had this product for 6 months and the comb attachment broke and won’t stay attached the blow dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Heat stuck on low","reviewDescription":"I loved this hairdryer for the first year I had it, but one day the heat got stuck on low temperature.  It doesn't matter where I put the heat setting, it stays at the low level.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Used and Dirty","reviewDescription":"I pulled this out of the box this morning to see that the hairdryer was filthy and covered in small dings that cannot be cleaned off. Not happy at all with this purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"La dted only 8 months","reviewDescription":"I love this product in the beginning but as you can see it is February 29 and my blow dryer has already stopped working.. it’s been eight months… not very happy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"I bought the pink kne.","reviewDescription":"LOUD.Looks nice","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Died","reviewDescription":"Worked well for 6 months. Now no hot air. What a waste. Won't be buying this brand again. Don't trust these unknown brands with no track record. I've learned my lesson.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Lasted 2 weeks","reviewDescription":"When it worked it was great and very powerful, but after about 2 weeks of daily use, it started smelling like burning plastic (even on the cool setting)","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"No hot air after 4 months","reviewDescription":"I bought this in October- by February it would no longer blow hot air.Pretty disappointed because I liked it other than that it stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Love the style","reviewDescription":"low is pointless sorryhigh is okthe accessories and style are greatwould recommend for anyone sensitive to heat only","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Not strong enough","reviewDescription":"Takes forever to make my hair dry","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Did not last a year","reviewDescription":"Hair dryer was great for the first 7 months but the heating element died after eight months.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"broke down less than a year use","reviewDescription":"Bought this 2023\/5\/30. Last week weird sound appear. Yesterday it smoked and now completely out.....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Missing comb","reviewDescription":"Bought this for my daughter as a birthday gift. She’s just now opening and it’s missing the comb. It works well but she really needs the comb to it.Hopefully one can be mailed to us!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Need better Grip","reviewDescription":"For a professional hair Dryer Blow, the handle has no grip and its not easy to man handle. I would not recommend this for person who has natural hair. First time using it the comb would pull-off easily and second time its stayed on a little longer. I am not happy with this product","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Daré mi opinión muy honesta!!!","reviewDescription":"Daré mi opinión muy honesta ya que siempre me guío por los comentarios de las personas antes de hacer cualquier compra y me gusta mucho cuando son honestos para que así uno puedo tener una compra exitosa.El secador es muy lindo si, no pesa mucho, es moderno. Bien!Vale la pena? Mmmm es posible que se consiga uno mejor por el mismo precio o quizás un poco superior. Tarda mucho en dejarme todo el cabello seco y soy de poco cabello y lo tengo corto. La apariencia\/TEXTURA del cabello una vez que ya está liso es FATAL!!! Al menos para mi gusto y mi experiencia con otros secadores de cabello. La apariencia y textura es similar a la del cabello de una barbie muy antigua. Áspero!!!Regresare el artículo? Pues no voy a perder mi tiempo haciendo eso. Luego de cada uso, utilizo mi cepillo secador revlon y mejora mucho su textura.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1655769600000}
{"reviewTitle":"So Heavy!!!","reviewDescription":"Looks small but is super heavy and get hard to hold","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Product is not new","reviewDescription":"The dryer I received is used not new. It had dents on the on\/off button. And the back of the dryer had a burn coil smell in it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Nice Big Diffuser","reviewDescription":"I like the size of this diffuser! Otherwise, it’s not much different than your typical drug store hairdryer. So far so good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"This is still working","reviewDescription":"I have purchased several of different types and this one is still working it is small light weight and has several attachments","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"Not that lightweight","reviewDescription":"I’m not good at styling hair at ALL, so I really cannot provide a fair review of its quality in that regard. I can only say that it seems to be a good drier with options for both temperature and air intensity.Be advised, though, that this is not a very small drier and it is not lightweight in my opinion (compared to my last drier which was quite heavy).I got the rose gold, which a pretty color.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"it's ok buthard to change the parts.","reviewDescription":"I thought I was going to break my hand first time I put on the diffuser. Very hard to get on and off. The comb thing was even worse. It needs to be easier to do without using all your strength! It dries fine and has cooler heat at the bottom switches.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Works","reviewDescription":"The hair dryer works just fine, but in the picture there is a comb? and I never received one....also the extra attachments work fine is just very hard to take off. 7.5\/10","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great price for quality","reviewDescription":"Blow dryer is very nice for the price. Very light weight. Doesn't get as hot or powerful as some I have used in the past. Overall a good product for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Decent but wish it had more power","reviewDescription":"I looked long and hard before buying this dryer. I chose it because it had great reviews at a good value. I mostly like it but I wish it was more powerful. I have a Rusk W8less and am much happier with that one.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Nice dyer","reviewDescription":"Overall nice hair dryer. I do like each of the attachments. It’s a little heavier than I expected but not too bad. Pretty rose gold color.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Blow Dryer","reviewDescription":"Love it! It’s fast and lightweight!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"It’s light easy to hold","reviewDescription":"Nice looking, light weight. Different colour options - my only complaint is that it doesn’t get as hot as my other hair dryer. It gets hot but not very hot. I will look for another one through my hairdresser-","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Works well","reviewDescription":"I got this dryer because my other one broke when I dropped it. This is easy to use and adjusting the strength and heat are done by a slide switch in the handle. Leaves my hair smooth after drying. It is lightweight and dries my hair fairly fast. Nice pink color!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1724457600000}
{"reviewTitle":"Simply obsessed!","reviewDescription":"I absolutely love this hair dryer! I was looking for some thing with a great diffuser to use on my curls. This product came highly recommended on tiktok. I was excited to find it for only $30 on here! The small size makes it super easy to travel with. I was also surprised by how powerful it is and how it cut down my drying time. Besides the diffuser, I’ve actually come to love all the other attachments. I feel like I can finally style my hair using this hairdryer!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"So ergonomic and cute","reviewDescription":"Absolutely love it. Light in hand yet powerful. Adjusts easily from hot to warm to cool. Very compact - so superior to my previous tank, which is about 35% larger, yet it dries hair more quickly, thus exposing it to less heat. Easier to maneuver. And inexpensive!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Great blow drier","reviewDescription":"I live this blow drier it's kid friendly it gets hot but it does not burn the ear or scalp it's gets the hair so straight and shiny if you turn it to the max also I live that if u set it to medium it doesn't take your curl pattern away light weight the comb actually stays attached you will bit be disappointed with this purchase","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Great product","reviewDescription":"Love the power and settings on this dryer. It has high\/ low, and cool\/warm\/hot. The three attachments are an added bonus, and all have given me great results. It's lightweight and smaller than my previous blowdryer for easy storage or travel.  An overall great buy.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Great dryer","reviewDescription":"The size, power and volume of this dryer are all great. It’s balanced well in your hand while using. It’s very powerful and dried my thick hair in half the usual time, I live in a humid climate and this has cut down on my time spent drying my hair. The price of the dryer is great, I highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Pleasantly surprised! Less than 1 min\/per section on 4a long hair","reviewDescription":"I used this for the first time last night. I presectioned my hair into  4 quartes for 8 sections total with those split in half. Sprayed a Whole Blends moisturizing heat protectant and put them in bantu knots until time to blow dry. I have hair that is completely shrunken when air dried. I'm talking higher than shoulders. When straight in is within 3 inches of my bottom.  I was extremely impressed with this blowdryer. I spent less than 1 minute blow-drying each section. I used a small pump of Garnier fructise frizz\/ sleek serum and went to work. It's not as straight as using a paddle brush. I started with that but my hair is took kinky for that. I swapped to this with the comb attachment. That comb is strong. Detangle first and you will be fine. I put tension on the hair by pulling on the section. I straighten my hair twice a year for a trim to even it. This is a champ. I have recommended it to others. We all have rather dense thick curly hair. It's small enough to travel with if that's your thing. My hair feels pretty smooth no doubt aided by the serum used. The cord length was sufficient. So far there isn't anything I dislike. I do wish it came with some kind of storage box or bag to keep it contained. None of them do though. It's a simple, yet strong little blow dryer. It should get the task done for all types of hair.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Cutest dryer ever!","reviewDescription":"I never make reviews but after 2 months of having this cute pink blow dryer I came back to share. I have curly hair and the diffusers that I normally buy always end up tangling my hair or they break and fall off, but this one is the perfect size and sturdy. I like that the dryer isn’t too big so it’s easier to pack and the colors are cute of course. The heat options are great and the different head attachments that come with it for this price was cool too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Works Great!","reviewDescription":"I have been needing a hair dryer for a while, but was overwhelmed with the super expensive options that are out there! I saw that this one had good reviews, and decided to give it a try! I have been so impressed with how quickly it dries my hair, and I love all the different attachments it came with! It was also really important to me to find a blow dryer that wouldn’t damage my hair, and I’ve been so happy with the different temperature setting options on this hair dryer and how it hasn’t damaged my hair at all! I’m super happy with this purchase and the value!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Would recommend","reviewDescription":"I have long hair, so drying my hair can take up to 20-30 minutes. Using this hair dryer, it only took me about 10 minutes! The heat and temperature was great! The pressure and power was great too! It’s on the smaller size so it would be easy to pack up for travel. Is came with different attachments, but I’ve only used one so far. It was super easy to use and handle!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Not hot enough","reviewDescription":"Very powerful blow dryer, however it doesn’t get a hot as I would prefer. I have very curly and fine hair that needs a lot of heat to get straight but this one just didn’t do it. It is also very heavy for how small it is.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"already broke after 9 months","reviewDescription":"Even though I didn't do anything special, it broke.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Don't recommend","reviewDescription":"Maybe I received a bad one, but the motor made an awful grinding noise and vibration. Definitely something was wrong. I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Change in Model NOT the Same","reviewDescription":"I bought one of these in July 2023 and it had a switch for the ion setting. I loved how it worked and since I keep it at my partner's house I wanted one for my house as well instead of carrying it back and forth all the time. I received one for Xmas 2023 and it did not have the ion switch and the first time I tried to use it, all I could smell was something burning and it set off my smoke alarm. Going to have my partner start a return on the new one and will not purchase again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Great while it lasted.","reviewDescription":"I bought this about a year ago and it was great. Then this morning the heat stopped working and the temperature button couldn’t be moved. So. I now need a new hair dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Not very powerful","reviewDescription":"This dryer was disappointing.  It had weak airflow even on the higher level.  My 7-year-old Conair that I was replacing had a significantly stronger flow.  I cannot invest the amount of time needed to dry my hair with this unit as it was tedious with the weak air output.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Quit working less than a year","reviewDescription":"I like the style and how light weight it is but the air doesn’t stay hot anymore and I’ve had it less than a year :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Attachments aren't secure","reviewDescription":"I really wanted to love it. I was looking for a dryer with a comb attachment, diffuser & nozzle for my 3c\/4a hair. I tried the comb, which works pretty well if you detangle your hair first. 2 minutes in the comb popped off. I decided to use the nozzle, so I swapped them out & grabbed my brush. (I got the version that comes with the wall mounted holder.) I put the dryer on the holder & when I went to pick it back up, the nozzle fell off. I decided to take a closer look at the attachments & noticed that the notches that are supposed to secure the attachments don't secure anything at all. You don't hear a click, & the attachments just keep spinning when you try to lock them in place. I will be returning this after just one use. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"el producto parece estar usado","reviewDescription":"el producto fue comprado como nuevo pero llegó así","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Hair dryer","reviewDescription":"It started to fall apart after a few months3","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"unsafe","reviewDescription":"The high heat setting is way to hot and fries my hair.  I burned the side of my neck when I bumped it with an attachment nozzle while blow-drying.  Went to the setting 1 lower and it wasn't enough to do much.  The big thing is it made LOUD NOISES WHILE TURNED OFF and plugged into the outlet.  Thank God I heard it before I left.  Who knows what would have  happened!  I have not used it since that day.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Hair dryer has no on off button","reviewDescription":"I was excited to recieve my hairdryer and diffuse my hair with it, however when I went to plug it in to the outlet no matter what I tried the hair dryer would not turn on and their was no on or off switch anywhere.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Hair Dyer","reviewDescription":"Make a loud humming sound when I use it! esnt get very hot takes forever to dry my hair.  Would not recommend at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Caught on fire second time I used it.","reviewDescription":"Please be careful if you order this! Bought this because it is smaller than the one I’ve been using, and was easier to pack and travel with. Unfortunately, it caught on fire the second time I used it and burnt out immediately.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"BUYER BEWARE","reviewDescription":"Highly disappointed. I bought this for my mother as a gift. Only was used 5 times and it quit working. DO NOT WASTE YOUR MONEY","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"Motor blew out","reviewDescription":"Bought in May and now here in August it no longer works.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"A lemon.","reviewDescription":"This hair dryer stopped working after using it maybe 5 times . It’s a bummer because I can’t even return it because the return window was very short. So I am stuck with a lemon and can’t even make lemonade .😡","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Died less than 2 weeks old","reviewDescription":"It started off great as it was small and I loved the diffuser but it shorted out and would not turn on with turning off the breakers, resetting the GFI outlet as well. Ended up returning the product with no issues.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"DONT BUY THIS","reviewDescription":"Received on June 13 and used it 4-5 times!!! Doesn’t workkkkkk doesn’t turns on!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Disappointed","reviewDescription":"Bought this for my daughter’s birthday. She went to use it for the first and it’s broke. It makes a horrible, loud buzzing\/vibrating sound. Super disappointed as my return window is close due to buying it ahead of time.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Just wasnt for me","reviewDescription":"I have a lot of thick 4c hair and when trying to comb through it was yanking my hair and the way i had to hold it to get it all the way through my hair felt very strange i couldnt get it together by just holding the handle and holding it by the nozzle part i was burning my hand so i had to return it. The dryer gets very hot and im sure will work great for other textured hair but not for mine","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"No retractable cord, attachments don't stay on","reviewDescription":"For any hair dryer to be made without a retractable cord wrap or something to wrap the cord around is ridiculous. The dryer dries okay, but the attachments fall off if you bump it or put under the sink, etc. Cumbersome...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Be very careful","reviewDescription":"I wanted to love this but wound up giving it away. It is way too hot and my hair became dried out. Not good at all for me. Sorry!UPDATE: the Seller contacted my after reading my review. They asked me how they could help and I replied the only thing I could suggest was to receive a refund since I had already given the blow dryer away. Kudos and many thanks to this Seller! Great customer service and I appreciate it!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Gets the job done!","reviewDescription":"I have a lot of hair, I was looking for a dryer that didn’t suck my hair into it! Well look no further, however it is top heavy.  Overall happy with the purchase and would recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Not impressed","reviewDescription":"It had a strange smell, heavy to hold compared to any previous one I have had","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Bad Diffuser","reviewDescription":"The diffuser is just to small in circumference and not at all deep enough to effectively make curls \/ waves \"pop\". It is a travel piece so being compact is the point.  If volume and ringlets or waves are the desired result,  stick with the regular sized diffuser,  etc.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Sparking after only a couple months","reviewDescription":"I got this end of Jan and it’s already sparking beg of April. The power isn’t that great either. It worked and I would still use it but not sparking!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Look out!","reviewDescription":"I've had this for a few months and it shot sparks out at my hair! I liked everything else about it but really don't want burnt hair!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Fan wouldn't run at first","reviewDescription":"Fan didn't operate as received.  After checking the ALCI a couple of times I finally slapped it smartly against my hand which freed the fan and it started to work.  It now seems to act normally.  I guess I'll take a chance and keep it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Not very powerful but….","reviewDescription":"I like the attachments. I have fine hair so it works well but slower than what I was used to. Nice size for travel and smaller hands.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Does not Work","reviewDescription":"I am very disappointed in this product. I was extremely excited to receive it and use it! I saw it on tik tok and it looked super great! However, when I plugged it in and turned it on, nothing happened. Item did not turn on at all. Tried it again another day, smoke and a burning smell came out of the dryer. Extremely annoyed because it didn’t even turn on or make any noise.  Do not recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Not for thick hair!","reviewDescription":"I would not recommend for black women with thick hair. I couldn’t fully get my hair blown out. 2\/10","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Disappointed","reviewDescription":"I have had for 6 months and the cord shorted out and smells like it’s going to catch fire. It was an ok dryer, wish it would have lasted longer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Sparked & Died","reviewDescription":"Disappointed that hairdryer sparked and died after only 9 months of light use. Would not purchase again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Do not buy this Dryer","reviewDescription":"I received this dryer as a gift: however when opened the box one of the attachments was missing. I sent it back , received refund and got another dryer from them. The new dryer once plugged in ….it starts smoking.Please do not purchase this dryer it’s a safety hazard. I just threw it away and chopped it up as a lost. Don’t waste time purchasing this dryer it’s so awful.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Just died after 90 days","reviewDescription":"Bought this in mid October, it died yesterday, & it was used sparingly. Some weeks it was used once a week, sometimes it would be every other week (because I have a 2nd hairdryer). And when it was used, it was only used with the diffuser for a few minutes, to get excess moisture out of my hair. Then I finished up with my other hair dryer.The fact that that this dryer died, after very sparse use, after 90 days is ridiculous. Don’t waste your time or money. I’m going back to the same Conair unit that this dryer replaced, after that Conair unit died after 10 YEARS!!  Don’t waste your money on this unit!!  I wish I could give this unit ZERO stars!!","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Broke after 9 months","reviewDescription":"The heating element stopped working after 9 months of use.  Occasional use, only a few times a week. I ordered a new one and the one they sent me didn’t work either.  I just received the replacement for that and it is working, for now.UPDATE: They sent another one and offered a full refund.UPDATE: They changed their mind about the refund!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Died after a month","reviewDescription":"I’ve only had this for a month and it completely died. Super disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Died after 9 months","reviewDescription":"I loved this hairdryer but after using it for 9 months, it died.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Stopped Working After A Few Uses","reviewDescription":"I’ve had this blow dryer less than 5 months. I haven’t even used it a dozen times and it already stopped working. Based on its lifespan, that makes this one of the most expensive hair dryers you can buy. Very disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Quality","reviewDescription":"Great blow dryer for less cost.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Muy bueno","reviewDescription":"Definitivamente este secador es una joya,excelente.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Gets good and hot","reviewDescription":"Blow drys with ease, very hot","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"poderoso","reviewDescription":"excelente secador de pelo, buena potencia","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Blowdryer","reviewDescription":"So in love with the product. Works amazing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Good companion","reviewDescription":"The dryer is a good companion for those who have thick 4c course hair like me! Shampooing my hair takes hours but the drying time was shorter thanks to this effect dryer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Great smaller size hair dryer","reviewDescription":"I read a lot of reviews before I purchased a new hair dryer after 10 plus years. I liked the look of the hair dryer the fact that it came in cool colors, and was reasonably priced. It does everything the people in the reviews says it does. I would recommend this. I'm over 60, I have natural thin curly hair. My hair tends to frizz. This helps with that problem. I hope this helps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Secadora de cabello","reviewDescription":"Todo un espectáculo, la amo","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"LOVE LOVE LOVE","reviewDescription":"I didn’t even realize how badly I needed a new hairdryer until I tried this one! I got it because it was on sale not even because I needed it and it is a game changer! As someone with long hair that would never blow dry it because my shoulders would hurt… trust me this one is worth it !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Great and light weight","reviewDescription":"If you have arthritis or can’t light heavy. If you have small hands and can’t hold larger objects, this is perfect 🤩","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Weak motor","reviewDescription":"The hair dryer is highly disappointing. The motor is weak, making it take significantly longer to dry hair compared to other models. The heat settings are inconsistent, and the high setting is often too hot, causing discomfort and potential damage to hair. Additionally, the build quality feels cheap, with a plastic casing that feels like it could crack or break easily. For a more efficient and reliable drying experience, invest in a higher-quality hair dryer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Had such high hopes, but seriously let down","reviewDescription":"I purchased two of these units: 1 for me, one for my daughter to take to college.  The first unit was used maybe 8 times and now does not blow hot air and only stays in low power.  Naturally it stopped working properly 2 days after return window, and it's impossible to reach anyone at the company.  I'm seriously disappointed and praying the second one doesn't do the same thing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Defective hair dryer after a 3 weeks of use.","reviewDescription":"I just began using this dryer 3 weeks ago. After 3 weeks of use, the dryer became hot to the touch on the handle when blow drying my hair. And began smelling hot and electrical. My return date was August 20. Unfortunately today is August 24. I guess it was a big waste of money. Please be mindful when deciding to purchase. I don't trust this dryer and won't be using it again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Buy if you like the frizzy look","reviewDescription":"I bought this because my old dryer quit working. I made a mistake buying this. I have long wavy hair. The only good thing about this dryer is that it is light weight. I don't think it has enough heat to not frizz my hair. I like to have the natural curls. This dryer just made my hair look like Anne Hathaway's in Princess Diaries before she got her make-over.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"No stars here","reviewDescription":"I've only had this dryer since mid April, blow dry my hair once or twice a week and this thing outta nowhere started with a battle scream then finished off with some smoke and a couple of pops. NEVEREVEN TRIPPED THE SAFETY IN THE CORD. Dangerous as heck and can't get my money back because it's been 30 days and I definitely don't want a replacement flame thrower!! Don't waste your money and if you already bought it; dry with caution!","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Beware","reviewDescription":"I ordered  thos Blowdryer  on April14th of this year. I maybe use it 3 times a month.  Lets say naybe 10 times since April 14th.  Yesterday  I was doing my daughters  hair and it started smoking .  Spend the money and get something  better.  This could have ended  badly.  I'm glad it didn't.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"absolutely HORRIBLE!!","reviewDescription":"I ordered this hairdryer and paid extra attention to the fact that it was an \"Amazon Choice\".  I presumed that it would be a superior product.  After 3 weeks and extremely little use, it no longer works !!!  It is now too late to return and Amazon will not help in any way.  I would HIGHLY recommend you NOT purchase this item!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"It doesn’t get hot","reviewDescription":"If you want a cool blower, this is the dryer for you.  I used this for my wash and go and after an hour my roots were still drenching wet!  The air only blows out warm. I kept checking if I had it on cool setting. The diffuser attachment was difficult to remove.  I quickly returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Very beat up and unable to use","reviewDescription":"I was very excited to order this product because I’ve seen a lot of good reviews about it. However, upon receiving it it’s very damaged. I’m afraid I won’t be able to use it. The box it came in was opened and torn up. The prongs of the plug in were very bent! I tried straightening them out but I’m still worried to use it because I’m afraid it’s not electrically sound and may be dangerous to plug in.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Fire hazard!!","reviewDescription":"The handle gets too hot to hold after only about 3-5 minutes.  I also noticed it smells like smoke at times.  If I saved the packaging, I would return this.  It’s a huge fire hazard.  Spend a little more and get a better quality. This is one unsafe.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Ok, lasted only a year","reviewDescription":"Liked the diffuser attachment. Didn’t feel like the ionizing setting did anything, but disappointed that the dryer stopped blowing hot air at the one year mark.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Not what I expected","reviewDescription":"It was heavy not light weight.  Color is great. Attachments are great.  However I do not feel it gets very warm.  Great to dry your Hair, not meant to help much for styling. for it does not provide a heat hot enough to do much.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Doesn’t last long","reviewDescription":"It’s good when it works. Haven’t even had this for a whole year and now it just sounds like it’s going to explode. Made sure it was kept clean per instructions it came with.","isVerified":true,"ratingScore":2,"reviewReaction":"17 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Diffuser Attachment Breaking","reviewDescription":"After less than a year of owning this, the diffuser attachment is falling apart. It’s the main attachment I use and the little knobs on it are breaking off one by one. The blow dryer works well but I’m frustrated that the diffuser is so poorly made.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Part Missing","reviewDescription":"Supposed to come with a comb attachment but it wasn’t in the box. The box was also pretty beat up and half open so maybe the product I got was a return? Either way, disappointed I didn’t get everything that I was supposed to.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Overrated","reviewDescription":"Bought this hairdryer based on Amazon recommendation on Apple News.  Big mistake, this dryer looks, feels and performs like a $25- hair dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Update: Fire Hazard","reviewDescription":"1 Year Update:Sparks flew out of the cord today while using it and burned my arm. It melted the cord insulation and part of the rubber part that keeps the cord from kinking. Thankfully it didn’t cause and damage to my hair or my bathroom.Original Review:I was prepared to hate this product and return it. But I wanted to give it a shot. I’m glad I did. It’s super lightweight, the settings are perfect, and the diffuser pops on and off easily. I have short (jaw length) 2c hair and it takes a bit of both diffusing and regular drying to get my style right. I love that I can go back and forth so easily.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"broke 6 months, pieces fell off the adapter electronics","reviewDescription":"Lasted 6 months.  Started coming apart at the adapter about 3 months and finally just fell apart... Very cheaply made.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Not very powerful, slow dry time for curly hair","reviewDescription":"I bought this after reading reviews because it seemed like it would be a powerful blow dryer for my curly hair. I returned it because it did not decrease drying time at all. I was still blow drying 30 minutes later.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"stopped working after 2nd use","reviewDescription":"at first, it was a great hairdryer! it had a weird kind of smell coming from it and the second time i tried to use it, it didn’t work. i tried multiple outlets and restarting the circuit but it still wouldn’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Nice and compact, but difficult to change attachments","reviewDescription":"The Good:Short barrell (no longer smacking myself in the head like I was with my super long old blow dryer)Heat Settings - The warm setting is warm enough to gently dry your hair without frying it, and nice to have a dedicated cold setting in addition to the 'cold shot' buttonEasy to clean the filter on the backThe OKHandle vibrates a lot more than any other dryer I've used. For short use it's not an issue, but I could see this being a problem for someone using the dryer for long periods of time.The BadI really struggle popping the attachments off. My routine starts without attachments, then I switch to the diffuser. The first week or so I STRUGGLED getting it off. It's a little easier now that it's sort of 'broken in' but can sometimes still require a little wiggling to disconnect.","isVerified":true,"ratingScore":4,"reviewReaction":"59 people found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Nice attachments","reviewDescription":"I really like this dryer and its features. My only issue is the location of the controls. But that is an issue with just about all hand-held dryers I have tried. While using the dryer, my fingers accidentally slip and turn the unit off. This will probably not be an issue as I use the dryer more and gain more experience.The attachments are useful. The teeth of the comb are nice and long.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Really fast drying","reviewDescription":"Machine is loud but very effective and dries hair fast! Recommend!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Great size","reviewDescription":"Great size but seems to be a little heavier than I like but for most people it's probably just fine!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great heat!","reviewDescription":"Great heat!  Compact size, but I constantly hit the buttons while using which requires me to stop and reset.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"It’s great for my 4c hair but hard to hold","reviewDescription":"This product is awesome with the compact size and multiple attachments but it’s still hard to hold like most blow dryers. If you hold the handle you turn the switches on and off and if you hold the barrel it’s too wide and hard to grip if you have small hands like me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Decent dryer for the cost","reviewDescription":"I bought this to use for travel and I've been pleased. I would not want to use it as my main dryer for regular use because it does take longer to dry my hair. For the price, it is a solid backup and travel dryer and I would purchase again. I especially like the diffuser attachment.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Nice","reviewDescription":"It's a nice blow dryer but as others have said it does need to be more powerful. Gets the job done though. Bought 2 and both still working well after several months.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Mostly Great, Bigger Than it Looks","reviewDescription":"Mostly like this hair dryer but the photos of the product make it look much smaller than it is. Looking at reviews I should've known, but it's closer to an average sized hair dryer than the newer, smaller ones. We paid about half the listing price ($50 at the time of the review) on a sale and felt it was worth it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Liviano y hace el trabajo","reviewDescription":"Es un secador liviano y seca el pelo rápidamente. Aún estoy aprendiendo a estilizarlo pero voy por buen camino. Es facil de usar. Los otros dos accesorios quedan un poco apretados y son difíciles de quitar pero del resto todo bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Amazing","reviewDescription":"Amazing ! Not too big, no weird noise and POWERFUL enough to dry my afro hair !!I LOVE IT !!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Great product","reviewDescription":"I need a defuser so I purchased this . It's nice looks exactly like pictures,  preforms as expected,  small size so I can take with me if needed for travel.  Gets hot and cold . Smooth texture","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Good deal","reviewDescription":"I like it a lot. Doesn’t dry as fast as other I’ve had but for the price it’s cute and does the job! Easy to travel with and not super loud at all.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"Great","reviewDescription":"Very good so far","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Dries hair quickly, less damage, more body & bounce!","reviewDescription":"Liked the attachments, especially direction nozzle and diffuser. Dries my thick hair quicker with less heat. Love the cool setting to finish. Power and heat settings are easy to use. Doesn't pull hair into filter. Great price for a better blow dryer. Would recommend. I don't dread drying my hair now.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"Lovely Hair dryer","reviewDescription":"No complaints so far. I have really thick, waist length hair and this dryer can dry\/style my whole head in about 30 min. I thought because it was smaller it wouldn’t have the “power” or “heat” but I’ve been able to do blow outs with ease. Plus the purple color is beautiful.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Nice and compact little hair dryer, my wife loves it and she is very hard to please","reviewDescription":"My wife uses it everyday and she is very happy with it, we only had it for a few months","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Blow hair dryer","reviewDescription":"This has been a fantastic blow dryer, not that it’s lightweight but it’s small in your hands so it’s comfortable, really gives a good blow dry the best blow dryer I have ever owned","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Fast Drying!!!","reviewDescription":"I was surprised and happy how fast my hair dried! I have long hair (goes to mid-back). Although it's fine hair, there's a lot of it. Definitely recommend!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Versátil","reviewDescription":"Me encantó 😍😍😍😍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"My wife loves it","reviewDescription":"Was a great price and it dries a lot faster than my wife's old hair dryer she loves it a lot especially with the attachments","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"As described","reviewDescription":"This is a good product. It operates as described. The hair dryer is compact and easy to store. I purchased the light pink and it looks as pictured. I received all 3 attachments.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Es súper comodo","reviewDescription":"Aparte que me en cara el color. No es tan pesado. Deja elCabello súper bien. Realmente meEncanto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Really gives my hair the smooth volume I like!","reviewDescription":"I haven't bought a new hairdryer in, well, MANY years.  My old one was a well known brand, it did the job, I never thought to replace it.  Then the switches started being almost impossible to move from one position to the next (the switches that control temperature and the strength of the fan output).I'm so glad I tried this one!  It has all the new technology that is now incorporated into hairdryers, it's lightweight so easy for me to maneuver to all angles around my head as I dry my hair.  I particularly like the texture that my hair has after using this dryer.  It is smooth but my hair is fuller, and has more body to it.  Perfect!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Dries hair super fast!","reviewDescription":"Love this hair dryer. Has different settings, light weight, and dries your hair in minutes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Dry time majorly decreased!","reviewDescription":"I have long, generally straight hair, that usually takes all day to air dry. I used this dryer, without any attachment, and it took less than 5 minutes to dry my hair! It is amazing! I did use a small amount of Argan oil on my hair after I towel dried it, so possibly this helped. The only down to this set it the attachments - they are almost impossible to remove once attached to the dryer.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Great blow-dryer and diffuser","reviewDescription":"I have softer and less easy to keep tight curls, so can only speak from my finer hair type experience. That said - I like this a lot. Really easy to define curls without frizz with the curl diffuser attachment and the regular attachment is great for days you want to blow dry it strait or just have loose wave or curl as well. There's another volumizing attachment that only my daughter, who has fine and straight hair, uses and she likes it a lot and says it works well for her purpose of giving volume to straight and fine hair that normally lays flat. The speed and temp options are wonderful and the lowest speed at 2nd highest heat is perfect for defining curls on my hair type without frizz ruining it. I definitely recommend this.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Love this","reviewDescription":"This is one of the best blow dryers I’ve ever had to use. I usually only diffuse I haven’t blow dried my hair down, but it’s so good. I diffusing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Nice","reviewDescription":"The temperature is perfect and works very well the power is on point just like the shop leaves my hair nice and shiny","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Fantastic Blow Dryer","reviewDescription":"I have very thick hair that retains water. This dried my hair super fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Stopped working after second use","reviewDescription":"I bought this blow dryer on Prime Day because it had good reviews and a decent price, but it’s not worth the purchase. Now it’s a hassle because after trying to use it the second time, it wouldn’t change the heat setting and the air only would blow out on the lowest fan level. I wouldn’t even think about purchasing it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Best purchase ever!","reviewDescription":"I have dry corse curly hair….a hair dryer is not my friend….but this one is my BFF…lightweight… dries my hair quickly without gettting too hot…leaves my hair smooth and shiny!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Did not last two years","reviewDescription":"Used this dryer one to three times a week and it failed after a year and some months. It was not expensive but I hoped it would last more.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Weak airflow and heat","reviewDescription":"I have had this just over a month now and am not too happy. The airflow is weak and it doesn't get very hot, even on the highest setting. Takes me much longer to dry my hair than the 10 drugstore blow dryer I had previously.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Too small","reviewDescription":"It’s not what i expected it to be. The handle gets hot while using it and you can’t get a good grip.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Heating element stopped working","reviewDescription":"It’s a shame because I would have given this blow dryer 5 stars before, but unfortunately the heating element stopped working after about 6 months. So now, the blow dryer still works but it only gets warm and doesn’t blow as hard as it once did. It takes double the amount of time now to dry my hair.I’m not sure if this is a common thing to happen to these or if it’s a weird one time thing. I don’t use it that often only about 1-2 times per week. I’m sad because I really liked this blow dryer and how small it is and easy for travel. I hope they can make it right and send me a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Takes a long time to dry","reviewDescription":"This blow dryer has a lot of power to it but it takes so long for my hair to dry. Usually it takes about 10 minutes and with this blow dryer it takes almost 30. I would recommend spending your money elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Ok hair dryer","reviewDescription":"Ok. But does not smooth out naturally frizzy hair. And doesn't dry in 10 mins like all the ads say.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Worked well for about 5 months…","reviewDescription":"I was happy with this product initially.  I really like the bowl diffuser; the blow dryer is quiet.  However, about 4 months in the “head” started getting wiggly.  I tried to tighten the screws on the handle, but it didn’t help.  The heat (hottest) setting has slowly deteriorated to being warm (at best).My take away is to stick with the tried and true brands that I know.  I’d also say that just because the price looks good, be aware.  HOWEVER, the reviews in this were good; it seemed like a good value at first.  I’d likely not buy something like this online again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"It’s fine… til it isn’t","reviewDescription":"So I’ve had this hair dryer for less than a year, 9 months to be exact and it’s no longer working. Here’s the thing about that, I’m a very low maintenance curly girl, I air dry my hair 85% of the time, I’d like to say because it’s better for my curls but, honestly it’s more that I hate standing around with hot air in my face and nothing to do. Point is, that means I only blow dry my hair 2-3x a month max. So it has lasted about 25 uses before it went out…. And it wasn’t exactly the best before then. Just avoid it, and if you want a cheap one, run to Target and pick up a Revlon or a Conair. They aren’t as compact or cute BUT I had my Conair for 8 years before it started dying and honestly it did better on its last dying breath than this one did out of the box.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"It has a cool setting","reviewDescription":"I love the setting options. Cool to hot also 3 speeds of blower. It is nice that it comes with 3 attachments","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Smooth dry","reviewDescription":"I am impressed by how quickly this dried my hair. My hair feels much healthier and smoother in comparison to the old, cheap hair dryer I have used for the past 10 years.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Super","reviewDescription":"Nice size, easy to handle.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Excellent","reviewDescription":"Good blow dryer for low cost","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"it is purple","reviewDescription":"It's cute i love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Awesome little dryer.","reviewDescription":"Love using this blow dryer! The attachments fit snug which is a good thing since I use more than one. My hair is fine & this dryer gives me more lift than my previous one. An extra bonus in the lift is I’ve discover my natural waves again. If you are in need of a dryer, this one does not disappoint!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Great size","reviewDescription":"It has great power for the size! My expensive dryer is bigger and has the same power in my opinion! Great price point too! I recommend this dryer 💯","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Recomendado","reviewDescription":"Lo utilicé el mismo día que me llegó. Tengo pelo en abundancia, por lo regular el pelo me queda abultado cuando me seco con blower.  Pero con el secador Wavytalk el pelo me quedó sedoso y lacio. Aunque no tiene mucha fuerza en el secado como los demás blower si calienta suficientemente, seca el pelo rápido sin dejarlo abultado.  Lo recomiendo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Excellent!","reviewDescription":"Love this dryer! Attachments work so well and the dryer is fantastic! Lightweight and drys hair quickly, even my granddaughters very thick hair. So happy!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Such a great dryer!","reviewDescription":"This dryer is amazing. It's a great price, super easy to use, has great temperatures, and is so easy to store. I recently got curtain bangs and this has made it so easy to maintain the style. I love it and am so happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Strong product","reviewDescription":"This blow dryer packs a lot of power but it knocks out power too.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Pretty decent for the price","reviewDescription":"I like it. Was hesitant but preforms as expected for a dryer this cost","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Nice but slow to heat up","reviewDescription":"This is a nice hairdryer and gets the job done but it heats up slowly. Since I only use low heat it works fine for me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"2 things","reviewDescription":"I’m keeping this hair dryer but…I found the handle to be quite heavy.  I have arthritis in my wrist so the heaviness of the handle is a disappointment.  Also, the comb attachment is extremely hard to get off.  My husband had to do it for me and it wasn’t easy for him either.  The other two attachments came off easily.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Pretty good!","reviewDescription":"The dryer is not loud! I do feel the airflow could be stronger. The purple is beautiful look like the picture. It doesn't feel super cheap either! The attachments stick on very well and don't fall off while in use on your hair! So far so good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Worked well","reviewDescription":"The first one I got did not work, but getting it replaced was easy. The diffuser worked so well for my curls. Would recommend!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"It’s a good product!","reviewDescription":"This works good, blows out my 4C hair good! The comb 🪮 is too short tho so I have to part my hair and blow while combing over and over again 🙈. And it’s exhausting. Leaves my hair still feeling natural and good but not as I want!🙈. I love the color tho. And it isn’t a loud dryer","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Works good for price","reviewDescription":"Nice little hair dryer for the price, gets all of my hair dry within 10 minutes (long hair, lots of it). It's extremely lightweight and easy to use with roller brush styling. One of the biggest criticisms I have is the outside of the dryer (save the handle) does get extremely hot and stays hot for several minutes following use.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"Lovely and practical","reviewDescription":"The pieces are a bit loose but it works like a charm","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"The time it takes to heat up","reviewDescription":"It's a great product works well I have no problem with it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Great hairdryer","reviewDescription":"This dryer dries fast, easy to use and fairly lightweight. Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Great!","reviewDescription":"Powerful hair dryer! Heats up very quickly. Perfect size for travel! Not too loud also.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Best blow dryer ever!!!","reviewDescription":"Great speeds and cooler and hot buttons work great.  Best dryer ever!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Nice !!!","reviewDescription":"I should have bought this sooner . Great price great hair dryer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Small but powerful","reviewDescription":"I love it. Its inexpensive, powerful,  and dry my hair fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Curly hair approved","reviewDescription":"Barely any frizz, dries my hair very fast and not too loud","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Awesome hair dryer.","reviewDescription":"Really nice hair dryer, it’s lightweight and heats up really good.Works as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Compact, Lightweight, and Powerful","reviewDescription":"This is a great blow dryer. It's small and very light, and still very powerful. I love how the attachments snap into place so they won't fall off during use. And even though the attachments snap into place they are still easy to remove. It's exactly what I needed.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Good product","reviewDescription":"I like how it sure my hair without snarled hair","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Excelente calidad","reviewDescription":"Excelente producto,  calienta bien. El tamaño es perfecto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Love it , must buy !","reviewDescription":"I was totally wrong about this product it actually works great ! I didn’t push the red button in after I performed the safety test so the  whole thing was unresponsive. I finally figured it out , great design , great power , great size love the comb extention","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"lovely","reviewDescription":"Love that there are multiple individual settings for fan speed and heat. Heat temp is just right (not too cold and not extra hot). Attachments hold well onto the dryer. I like that there are multiple layers to the filter.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Great for curly\/wavy hair","reviewDescription":"Wish I’d bought this long ago! It makes my curls so nice (not quite dry for best results) but has regular hair dryer options too.Good price and pretty color. Only drawback is it’s tricky to get the various parts off without breaking. I just leave the diffuser on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Love it!","reviewDescription":"Had my old dryer for a decade and it finally quit. Got this one as a replacement and I love the power and how much smaller and lightweight the handle is compared to my old dryer! Would buy again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Very lightweight!","reviewDescription":"I love my new hairdryer...and I do not do many reviews....but I like that it is lightweight, manufactured as an Ionic hairdryer, and has all the styling tools. The price is great too!Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"GREAT PRODUCT","reviewDescription":"I love this set! Great power and heat and only takes me 4-5 mins to dry my thick curls (: very happy with this product !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Lovely","reviewDescription":"I used one of these for years until it broke, I bought a new one and it works exsactly the same. It came in perfect condition, not damaged at all, unlike some of the other ones I have tried. And the settings are perfect for all types of hair, the first couple of tries getting used to the new one did not turn out the best but after a while I got a hang of it and it looks amazing!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1722211200000}
{"reviewTitle":"Bunch of style options","reviewDescription":"It works really well right when you get out of the shower, especially the diffuser. I use the comb-like part on my bangs and it basically acts as a straightener, so now I can style my bangs the way I like them while also having my beautiful curly hair. Definitely a recommend from me, super good for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Best Purchase","reviewDescription":"Worth it! I've only used the Yellow and Silver Bird. Both are great products, however I was like for something a little more compact.  Not only is it is compact, it's mighty and most of all cute in design. Love it! My new obsession hair tool!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Great for diffusing","reviewDescription":"I have only used the diffuser on this hairdryer but it works so well, it pretty light, the price is good, it can go really hot and cold","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"The cool air option is not that cool...  La opción de aire frío no es realmente tan frío....","reviewDescription":"[Mis comentarios en Español están al final del texto en ingles]I must say this is a nice small and light weight hair dryer. I loved the perl pink color and the warm air power options were good; I bought it after doing some research based on reviews. However, I had another hair dryer before from a different brand which had the cool air option and that dryer had a really cool blow even when being used at its maximum blowing power. Before that dryer I never looked for this feature before when using other dryers but I must say it is a VERY nice and refreshing feature to use before finishing your hair drying. Therefore, I definitely wanted to have it with my new hair dryer but the \"cool\" air was just less warm, never really cold or cool, and, as mentioned, felling the cool air before finishing is just too good to not have it. So, I am returning it to probably get one from the brand I previously had. No picture or video can actually show what I am pointing out, but those who have used a really cool air blow option may clearly understand what I am referring to.Debo decir que este es un secador de pelo pequeño y liviano. Me encantó el color rosa perla y las opciones de potencia de aire caliente eran buenas; lo compré después de investigar un poco en función de las reseñas. Sin embargo, antes tuve otro secador de pelo de una marca diferente que tenía la opción de aire frío y ese secador tenía un aire realmente frío incluso cuando se usaba con su máxima potencia de soplado. Antes de ese secador, nunca busqué esta función cuando usaba otros secadores, pero debo decir que es una función MUY agradable y refrescante para usar antes de terminar de secar el cabello. Por lo tanto, definitivamente quería tenerlo con mi nuevo secador de pelo, pero el aire \"frío\" era menos cálido, nunca realmente frío o fresco y, como mencioné, sentir el aire frío antes de terminar es demasiado bueno para no tenerlo. Entonces, lo devolveré para probablemente obtener uno de la marca que tenía anteriormente. Ninguna imagen o video puede mostrar realmente lo que estoy señalando, pero aquellos que han usado una opción de aire realmente frío pueden entender claramente a qué me refiero.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Hair Dryer Disappointed, Here is Why…","reviewDescription":"First, I think this ionic hair dryer performs admirably for the low price point of $40.00. I like that the cool button delivers cold air promptly unlike my current hair dryer. Also, I like that it has a cool temperature setting, so u can move the switch to this setting and not have to worry about holding down the cold button. It’s convenient for when I want to wrap up my hair styling by locking the follicles in place with blasts of cold air.Moving on, the hair dryer has a moderately powerful engine that delivers a satisfactory amount of air to your hair, but it is less powerful than my current hair dryer.There are two settings for controlling the amount of air flow. Honestly, the slower speed is just too darn slow to be effective at drying my hair in any kind of timely basis. It just doesn’t move enough air even for a slow setting. That leaves the high speed option. For me with hair that isn’t too long, the high speed setting it is good enough. However, others might find having a much less powerful slow air flow setting as problematic.Another downside, for me at least, is that this hair dryer is heavier than I had expected. It’s not like it weighs a ton, but it does weigh almost exactly as much as my larger professional mid-ranged priced hair dryer, much to my surprise. (After re-reading my review, I think that I should cite the cost of my current hair dryer since I’m using it to compare; it cost me $60.00 two years ago.)This is minor, but I also don’t like the power cord on this unit. It’s a regular cord that u might have on any low-end hair dryer. It’s no comparison to the thick long protective power cord on my current hair dryer that resists getting tangled, which is a handy perk.I hadn’t even considered looking at the hair dryer design to check that it had some kind of loop to hang it in my bathroom, which is exactly how I have stored a couple of hair dryers I have gone through over the years. That’s a big problem for me as space is at a premium in my bathroom. I definitely don’t want to have to pull out a hair dryer from below the sink every day to use it.Now, I did by chance find a possible solution while looking at alternative hair dryers. There is a small plastic shelf that u can stick to your bathroom wall. It has an opening in the middle of the shelf for this hair dryer and many types of ionic styled hair dryers to easily slide into; it costs less than $10.00. So that’s a good option that I’m probably going to go with on my next hair ionic hair dryer.Consequently, bc of the weight that I consider to be too much, sadly I’m returning this hair dryer. I have looked at other ionic hair dryers and I selected one that had thousands of positive reviews and that has a price point of $120.00. Obviously, that is a sizable jump in price from this unit; however, I figure I need to spend more if I want a lighter hair dryer with a thicker protective power cord that will not twist itself into a tangled mess.For the price point of just $40.00, u get what u pay for with this hair dryer. It’s not going to be a light weight ionic hair dryer, but it is an ionic hair dryer that will likely deliver much better results to your hair than a similarly priced regular hair dryer that u might find on Amazon or at a box store like Target or Walmart.You know from my review that u aren’t getting a super powerful hair dryer here. It is not bad but it’s still less than great. Therefore, if u have a lot of hair that u need to dry, this unit is not for u. It comes with a couple attachments but no magnetic interface on the dryer. You cannot hang this dryer from a loop on the unit, but u can buy a plastic shelf for a small amount of money that will serve u well I imagine.","isVerified":true,"ratingScore":3,"reviewReaction":"60 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Effectiveness","reviewDescription":"I don’t usually leave reviews but I can’t lie it got the job done . How long will it last ? I don’t know but used it on my hair and it felt so smooth after. The settings made it easy to control how much heat goes on my hair . For those who are black natural girls ya know how important that is . I would give 5 stars but the extensions are hard to come off once it’s on and","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"This item seems heavy","reviewDescription":"I had a nice, compact blow dryer for many years without problems.  One day, while using it I smelled smoke!  I unplugged the unit…began an online search for another.After reading about pluses and minuses for a simple little necessity I found this blow dryer!  To my surprise it is twice as heavy to use and a bit awkward.  It works well other than size\/weight of unit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Great color","reviewDescription":"I have curly hair and well.. there are really expensive blow dryers that I did t want to spend the $ on. I thought this would be a great starter. It is durable, the diffuser has short pegs.. that took some getting used to. The dry time is shorter than my other one. I like it but not love it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Not bad, not great","reviewDescription":"As a diffuser\/blow dryer for a beginner, this one works and gets the job done. It's very lightweight, has two speed and heat settings, and is relatively quiet. I also love the way it looks, the purple is really sleek and elegant. However, it just wasn't hot or strong enough, and it took me 40 min to diffuse my curly 3a-3c hair (15 min more than my Shark diffuser). I also felt the entire blowdryer vibrate the whole time I was drying my hair which gets that annoying feeling in your hand. I didn't try the other attachments besides the diffuser, but based on the heat the blow dryer reaches, it would make my hair really frizzy and not straighten it. Overall, it was alright, but I will be returning it.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Doesn’t seem like a brand new product","reviewDescription":"Just received my hair dryer, however, it seems as though it’s not new, looks like it’s a product someone returned. There’s something weird and wrong with the paint and hair stuck on it (not mine since I haven’t used it yet).","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Don’t like the diffuser","reviewDescription":"The blow dryer itself works fine. I like the small size. However, I have thick, curly hair. The diffuser is very small, shallow and creates a lot of frizz in my hair. I will be looking for a universal diffuser to replace it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Cute but not as functional as I’d like.","reviewDescription":"This did not have near the power as described. Still took the same amount of time as my old dryer.  Maybe my hair was a little smoother but still a little frizzy too.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Broke quickly but refunded","reviewDescription":"It’s only been 4 months and it just stopped working 😕 but the seller offered me a full refund. Way to stand behind your product!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Great Hair Dryer!","reviewDescription":"Thank you to the ladies who took the time to make a video of this hair dryer in action. It lives up to all your claims in the demonstrations. I would like to add that the dryer is quieter than it sounds in the videos. I give it the 5 stars with a warning. If you choose to change the concentrator to another attachment before you finish styling, It will be Hot. Use a hand towel to remove it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Pleasantly surprised","reviewDescription":"So I’ve used it a couple of times since my purchase and I am purposed how well this works. The heat was good, and the compactness of it is amazing. Small bathroom space and fits right into my large toiletry bag with the accessories. The volume was a regular sounding blower. I used it for my curls and straightening my hair and it was a pretty smooth situation. I would say for curls the diffuser was small but I had my own that fit right on it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Great blow dryer","reviewDescription":"Bought this for my daughter’s hair, it works great. She’s 5 and I’m a single dad so I needed something that was easy to use, quick and gets her hair perfect. I appreciate the included attachments and that I can get all the tangles out of her hair. It has more than enough power and keeps her hair soft","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"LOVE IT","reviewDescription":"I absolutely love this blow dryer. It cuts down the time it takes to dry my hair by more than half. My hair is long and usually takes 2.5 hours to dry, but with this blow dryer, it's dry and straight in just 30 minutes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great Options","reviewDescription":"This hairdryer has the BEST options for temperature and air flow. I prefer the cooler setting but high air flow. So many hairdryers combine the settings. For example high air flow is only available with high heat. I don't need the heat but if I did it's available. Additionally, the attachments are GREAT and don't fall off! I use the diffuser. The hairdryer is a little heavy which might be an issue for some. It may be a little heavy and bulky for travel. Overall it exceeds my expectations!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Fantastic product!","reviewDescription":"I have long, curly hair and this blow dryer is the best I have ever used to define my curls. My curly haired sister in law agrees. I don't know if the ionic whatever makes a difference, but bottom line, it works. Plus, it's just really pretty. (-:","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Works great","reviewDescription":"This blow dryer works very well. I love the attachment for the dryer depending on what hair style you want. The heat isn’t too hot and it’s not too cold. So far it’s been working great. This was a good purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"My new favorite brand","reviewDescription":"I am a salon owner and im loving everything wavytalk, even more than my professional tools. Fell in love with the curling iron so decided to get the blowdryer.. love!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"So far it’s better than my expensive Shark!","reviewDescription":"I got an expensive shark dryer about a year and half ago.  I liked it fine but then it started turning off due to over heating. There was no removable filter to clean so i had no choice but to blow in it and turn back on 10x to get my hair dry.This cute and inexpensive dryer dried my hair as quick (or quicker!) than the shark (even when working right) and has a removable filter to clean.  I’ll never get a dryer without one!I hope this little thing works a long time - but even if it doesn’t the cost makes it worth it. I’m a big fan!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Perfect dryer","reviewDescription":"The airflow is strong and warm enough to dry my shoulder length hair quickly but without frying it. It’s small, light, and has a short cord that fits neatly on my counter. Perfect all around.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"One of the best blow dryers","reviewDescription":"I have thick 4c hair and this blow dryer is perfect!!! The comb doesn’t detach and it blow drys so easy! I don’t even leave reviews but I was so shocked I have never used a better blow dryer tbh.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Great product","reviewDescription":"My 16 year old was looking for a diffuser, I came across this one with great reviews. Was delivered next morning before she left for school. She is in love with it. Quality is amazing and air flow is great. Highly recommend. It’s also small so it can fit just about anywhere.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"A Perfect Blow!","reviewDescription":"This hairdryer is the best by far. I would definitely recommend purchasing. What used to take 15 minutes now takes me on about 6-7 minutes. I hated drying my hair because it took me too long. Not with this hair dryer. I’m thinking of buying one as a spare.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Works super well","reviewDescription":"This hair dryer dries my hair so fast!! The heat settings are warmish or lava hot though so the cool blast is definitely needed lol. Even using the highest temperature doesn’t create fly aways as long as you aim the hairdryer downward to smooth them. I’d recommend this absolutely!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"I was skeptical…. But WOW!!!","reviewDescription":"I was very skeptical with this not being a known brand to me. I took a chance and ordered this to dry my mane. I have medium length thick hair and on average it can dry it in under 5 minutes! I was sold! Great blow dryer! And the attachments all fit well also. Great size and not heavy at all! Great buy!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"Reduces Frizz","reviewDescription":"I read about this type of hair dryer technology can reduce frizz and for me it definitely helps. I dry it on the low heat setting and it works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Lightweight and Powerful","reviewDescription":"I bought this on a whim and I'm glad that I did. It's lightweight and quieter than my old hairdryer, but it dries my thick hair in a timely fashion. Very happy with this purchase and have recommended it to others.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Get my hair dry fast","reviewDescription":"Easy to handle.  Doesn’t take my 4c hair long to get dry. I keep hitting the buttons on the hadle and turning the heat down.  And the comb doesn’t fly off. A definite buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"yeah its good","reviewDescription":"there’s actually nothing bad i can say about thisit has good heat control, good weight, good air flow and power, and the buttons are easy to control","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Amazing dryer!!!","reviewDescription":"I’m so surprised how quickly this dried my hair without making it crispy or frizzy! Out of all the hair dryers I have had this one is the best. I highly recommend this dryer if you’re looking for a replacement.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Great hairdryer, opt for a better round brush","reviewDescription":"Hair dryer works great, it’s lightweight and efficient. I purchased the package that includes the round hairbrush and it’s simply awful. Rips my hair out even when working in very small sections.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"AMAZING LOVE MY HAIR LOOKS SO ANWZJNG","reviewDescription":"This has made my hair so dry and look so good the piece keeps falling off though but that’s fine I LOVE ITTTTT","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Funciona muy bien","reviewDescription":"Me gustan los aditamentos","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Works well","reviewDescription":"I do like it but it is a bit heavy for me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Good blow dryer 😋","reviewDescription":"Like the attachment!❤️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Awesome","reviewDescription":"I fell in love with it from the first time I used it but only 1 complaint. It is a little heavy but I can deal with that. Definitely would recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Fast drying !","reviewDescription":"I’ve been looking for a blow dryer for a while..this one is great it has 3 different attachments & dries pretty fast. I love the color too.i like that it has the Velcro tie to wrap it up when you’re done using it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Powerful","reviewDescription":"Small but powerful dryer, my issues are the attachment are hard to get on and also to remove is a bit of struggle. But a good dryer over all.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"A little disappointing","reviewDescription":"The dryer is good. I have had it for about a month. But today I went to use the diffuser attachment and it won’t stay on. This was the first time that has happened. I do take the diffuser attachment off and on a regular basis. I guess this wasn’t such a great purchase since now I can no longer use the diffuser piece.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1714262400000}
{"reviewTitle":"Multiple settings","reviewDescription":"I love the multiple air flow and temp settings. Size is great however the dryer is a bit heavy. I have adjusted but believe some will find thie weight prohibitive. If it was lighter, I would rate 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"No Longer Heats Properly","reviewDescription":"I've used this dryer almost a year, but only when I didn't have time to allow my hair to air dry... so maybe twice a month tops. I loved it for several months; small, lightweight, quick drying (I have long, thick hair), multiple settings. However, one day the heat selection button was stuck in the cool setting position. I worked with it for several minutes and was able to free the button, but now it no longer heats above slightly warm. I will buy a different brand to replace this one.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Disappointed","reviewDescription":"Blow dryer is a little heavy, loud, and awkward. Drying speed not as expected. I had high hopes and keep trying to give it a chance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Didn’t get hot enough for me","reviewDescription":"It is a good hair dryer but it didn’t get hot enough for me which is better for your hair but not for my style.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Not for use in a professional setting","reviewDescription":"I bought this with the intention of using it as my work dryer when my trusty dryer broke. While it does get hot, I don't feel the air gets blown out with enough force. The attachments have too much open space for the air to flow through. The combination of these two things causes frizzyness and more work trying to get hair smooth. Another issue I found was that the attachments and buttons are very loose and I needed to readjust constantly.I also wouldn't recommend this dryer for home use on textured hair for the same reasons above.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"Low setting doesn’t work after 10 months","reviewDescription":"This dryer did the job and it seemed a little less loud than my last, also had good heat. I purchased this in Feb ‘23 bc I wanted a diffuser attachment again. 10 months later the low setting doesn’t work for some reason. Low setting is best for waves and curls. I never dropped it or banged it against anything, just randomly stopped working(see video). I probably used this hair dryer 3-4 times a week. Real bummer!","isVerified":true,"ratingScore":3,"reviewReaction":"28 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Color difference","reviewDescription":"I have now purchased two of these blowdryers, one for me and one for my friend. I absolutely love the quality and the size of them, BUT I ordered the sapphire blue and it was a violet purple. I didn't check it before I gave it to my friend so she just got the purple instead of blue. It's not blue and rose gold, it's pink and purple.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Little heavy","reviewDescription":"Nice compact blower just thought it would be lighter stops working!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Hairdryer","reviewDescription":"The dryer itself is a bit heavy. Does not dry like a 1875 watt dryer, as far as the heat. My hair is at my shoulder and not very thick. I use a roll brush to dry and style together and I don't get a good style with it. Might be well suited for short hair.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Need to return..:(","reviewDescription":"NO matter what..I'm unable to remove the comb attachment. The add-ons have clips that keep them in place. Even when turning to the designated area of the nozzle..I'm unable to release the comb . i would need to remove to pack for a trip or use the diffuser. So it's going back for me to find a new dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Dryer","reviewDescription":"The hairdryer itself was ok… but I have curly hair, hence the name! The big attachment for curls is made of a very hard plastic, if it was made from a heat resistant silicone or something softer it might not hurt your head, it was very painful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"this is heavy","reviewDescription":"This is not lightweight.  Also, they have a bad return policy and can charge you a restocking fee.  Buyer beware!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Not great, not bad","reviewDescription":"I ordered this blow dryer after reading reviews.  With the reviews I was excited to good dryer at good price.The dryer color is beautiful and it is a nice compact dryer. However, it does not dry my hair as fast as other dryers have done, this may be due to the lack of air it puts out and temperature!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"Buttons Get In The Way","reviewDescription":"This blow dryer is Just OK. The buttons to turn on & control heat are on the entire length of handle so it makes it hard to use. Your finger are on top of them while trying to dry you're hair so it’s hard to avoid pushing on cool button. Also theheat isn’t that hot for course hair.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Broke","reviewDescription":"Stopped working within a month","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"It Shuts Off During Use!","reviewDescription":"I was super excited to order the blow dryer. Cute color! Wonderful attachments! HOWEVER, the very first time using it, it just quit working. It would just shut off. I hold it a certain way, it would stop working. This occurred many times!Though I will say, the customer service was great and very helpful when they reached out about the issues I was having. They assisted in making an irritating problem better. So, thankful for that.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Secador Pelo","reviewDescription":"Pense que era ma potente","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Prongs break off easily","reviewDescription":"Love this diffuser, but the prongs break off super easy. It has worked well for me so far, but if you apply too much pressure, the prongs break right off. Wish it was sturdier. Other than that, the blow dryer itself works great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Meh","reviewDescription":"Not the best, it takes a long ass time to dry my hair and it is really short, so if you have a long hair you might want to think twice before buying this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Mediocre at best.","reviewDescription":"I bought this because I had to go out of town, 8 hours away and my husband didn’t want me to take our Dyson hair dryer because he uses it everyday.Anyway- I bought this because I needed a blow dryer with a diffuser as I have thick naturally curly hair (Caucasian- just to specify texture and type). This blow dryer takes forever to dry my hair and the diffuser attachment wiggles around. It overall feels very cheap… even cheaper than the $35 I paid for it. It gets the job done, but it takes a while.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Hair dyer","reviewDescription":"The unit is heavy,  the attachments are very hard to put on and take off. Because used it. Therefore can't return so gave it away.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Unsure","reviewDescription":"My vote is still out on this. Usually an ionic dryer leaves your hair soft. I still not sure it did that. Only use once.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":".","reviewDescription":"Purchased in February and rarely used it. It heats up pretty well but it stopped working and I can count the times I’ve used it","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Not enough power","reviewDescription":"I was expecting it to have a little more pressure and airflow. It is good quality just not exactly what I was looking for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"okay not really impressed","reviewDescription":"bought this to replace my 10 year old dryer and i honestly think the old one works better than this one does.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Good fan","reviewDescription":"Works well. Only downside is little heavy in my hand. I got white color, nice aesthetic it has.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Blower NOT Powerful-so sad 😢","reviewDescription":"Second update!!!!!-this thing just gets weaker by the day.  So just a few months and I'm searching again for a good blow dryer.  If this was a cheapie I picked up at the supermarket, I wouldn't be so upset but if you pay over $30, you expect it to work!!!  And it was a lightning deal!  I'd be even more upset if I had paid full price.  These good reviews must be from people that had had it less than a week because mine is total junk.  😔I waited a month before posting a review.  I done so much research before deciding on this dryer.  My John Frieda bit the dust, and every dryer I found after that just couldn't compare to the power.  My hair is bra strap length and fairly thick.  I don't have forever to spend drying my hair due to arthritis.  I was so hopeful based on reviews for this one.  Turns out, it doesn't dry any faster than the $12 one from the local dollar store.  It gets hot.  The problem is the blower just isn't strong enough.  There's simply not enough air being blown out to dry my hair quickly.  😭","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672531200000}
{"reviewTitle":"Works, but doesn't have a lot of power","reviewDescription":"It's very light-weight, and it does dry my hair (it's a hair dryer, after all), but it doesn't have as much power as I'd hoped.  It's too late for me to return it, but I would if I could.I like the attachments that came with it.  It's got a few settings for temperature and power, and a cool shot button.  I like all of those things too.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Not that good","reviewDescription":"Not as good as the 18 year old Conair that died.  Wouldn't buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"Is this ceramic?  - textured gray model.","reviewDescription":"I first bought the black one, but then saw a deal for the textured grey (towel+brush), returned black\/bought text grey .They are not the same, this text grey is not ceramic, but the description seems misleading. I guess it is a good hair dryer, just overpriced for the plain technology.I will return it, and have 3 stars as I have been asking customer service for details with no luck.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Not very powerful","reviewDescription":"I expected it to have more power. It is fairly weak.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Not bad","reviewDescription":"I killed my last blow dryer that I loved by overheating it drying out my car carpets.I was looking specifically for quiet hairdryers, and it seems kind of loud, plus the handleis skinny and slippery, and feels a litle top heavy.I wish I would of gotten another type of 'quiet' hairdryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Good Dryer, Cheap Plastic Plug","reviewDescription":"I bought this dryer 6 month ago.  The dryer itself is great.  The plug however, is made of cheap plastic that easily cracks and falls apart making the dryer useless.  If the manufacturer can step it up on the plastic used, this really would be a really good dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"7.5\/10⭐️","reviewDescription":"it’s okay. Not the best but it gets the job done if you are looking for something on the cheaper side. I really like the brush attachment. I feel like it gave me a blow out look with my front of my face.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Not the same…","reviewDescription":"I had this dryer for a year and it broke. No biggie as it’s affordable. So I ordered a new one—completely different. Does not have the option of ionic or no ionic and not working as well on my wavy hair.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Sirve para lo que lo quiero, esperaba más calor","reviewDescription":"Lo compré para secar mis rizos, por eso no me preocupa tanto si es muy caliente. Si lo estás buscando para estilizar lacio y quieres un blower potente, este no es la opción. Para cosas más soft funciona bien.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Broke with in a year!","reviewDescription":"I liked this hair dryer a lot, but the button on the left is stuck and the dryer will not get hot. This literally just happened a year later after I bought it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Not very powerful","reviewDescription":"Took too long to dry my hair. Tried the comb, very awkward. Used the diverter attachment otherwise it felt like no air flow. Not worth the money to me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Broken and busted product","reviewDescription":"Fresh out of the box, doesn’t work and the back side is completely broken. I ordered a replacement because all previous reviews said it was a great product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"It's fine but NOT quiet","reviewDescription":"I do not notice any exceptionalism about this hair dryer, in either being more quiet or faster to dry.It is fine and positively, absolutely nothing special.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Not the best","reviewDescription":"This hairdryer was heavier than I expected and uncomfortable to hold while drying hair. The handle you hang on to is slightly slippery. It’s also rather loud.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Sleek looking and powerful","reviewDescription":"Easy to use, powerful and functional with multiple temperature control options","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Great Blowdryer","reviewDescription":"All parts arrived safe and secure and the blow dryer works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Wavytalk Negative Ions Hair Dryer","reviewDescription":"Love, Love this sleek hair blow dryer. I recommend this dryerWanda","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great Hairdryer","reviewDescription":"Love this a lot! Cute my drying time in half!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"So light, I love it","reviewDescription":"Great dryer, it's so light and so powerful. Has acold setting that I prefer to use because it leaves my hair shiny.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Good power","reviewDescription":"Dries hair fast, Great power Great temperature control.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Very good","reviewDescription":"Good choice.my hair looks nice and easy control!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Very convenient","reviewDescription":"I love that there a choice for the blow dryer temperature. It's light and it isn't too big. It's convenient and drys efficiently","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Que espectaculo","reviewDescription":"Es excelente, las opciones sin super útiles","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Dries hair quickly","reviewDescription":"Great for drying hair very quick","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Beautiful, but doesn’t last","reviewDescription":"Product died in two months. Purchased one previously and had to return that one due to a structural defect. Waste of money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Cute but not very powerful","reviewDescription":"On high speed there is not much airflow. It's not very powerful and it did not dry my hair faster.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Not bad for price and size","reviewDescription":"So far, I don't totally dislike this blow dryer but I don't love it.Pros:- It is powerful and blows a lot of air for being as small as it is.- It's pretty and small so it doesn't take up a lot of space.Cons:- The handle is a little too short so it's easy to hit the 'cool' button while drying your hair.- It doesn't seem to get very hot even on the highest setting","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715904000000}
{"reviewTitle":"weird lightning","reviewDescription":"sometimes this sort of lightning comes out when its at its full speed, kinda scary","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Don’t get me wrong, I like this hair dryer","reviewDescription":"But… I only received two out of three attachments. I didn’t receive the most important one in my book the comb attachment. Otherwise the blower is powerful but not too loud and it is lightweight. It’s so difficult to find comb attachments that fit and are sturdy. Can someone point me in the right direction for the correct size attachment?","isVerified":true,"ratingScore":3,"reviewReaction":"16 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"NOT RECOMMENDED FOR MEDIUM TO LONG HAIR WHEN USING DIFFUSER.","reviewDescription":"Please see below of review for updated complaints.So far I love this hair dryer. It's nice, it's a little slimmer then traditional dryers. The color is vibrant, the attachment pieces (diffuser & concentrator nozzle) fit snug. Please follow the directions on the box it comes in, because I noticed it mentioned NOT to use the highest heat setting & the highest air flow setting at the same time with the attachments on. I will include that other buyers have complained of their hair getting caught in the back end filter NOTED that this complaint is stated on the back on how to avoid that, but I do understand that girls with long hair will most likely have this problem. I have medium length hair that is dense but fine and I wanted something smaller then traditional hairdryers due to my arms being short. I will update if something goes wrong with this product.Complaints:1.The switches to turn on the hair dryer do not match up with the air flow\/heat setting you're going for. That could be more of a spot on thing.2. When using the diffuser I have to section my hair & diffuse that way or else my hair will get sucked onto the vent. (You would really have to try to get your hair caught into the fan, but its possible through the vent. So the fear of my hair being sucked to the vent is a huge downfall to me.I tested both hairdryers ( this one and my 10yr old Conair) & this one sucked my hair to the vent more than my Conair.","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1683763200000}
{"reviewTitle":"Bigger than it looks, heavy, and not powerful.","reviewDescription":"Bigger than it looks, is heavy and isn't very powerful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Stuck","reviewDescription":"Ok... I've used my dryer around ten times, and I can't take the comb off, and I have to press really had on the switches to control the heat, and powering. The switches get stuck badly... It dries well, but it's hard to remove the comb once on if you have any type of arthritis, or wrist problems.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Not recommended for professional use","reviewDescription":"As a full time hairdresser this dryer is heavy. It was advertised as light.The cord length is really to short.It blows really good and is easy to use.For home use it’s good.I ordered and received 2 dryers, one as a gift one as a replacement at work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Was Great while it lasted","reviewDescription":"I bought this Sept of 2023 and now it’s April 2024 and it started smoking and died. I don't even use it every day and always on the low setting. Think it should last longer than that!Update: this is the best company, they contacted me and refunded my money without me even asking, I didn’t even ask for a refund. They stand behind their products and are just great. I will definitely buy from them again in the future!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"My blow dryer stopped working 🙁","reviewDescription":"My blow dryer was doing great I loved it! But yesterday when I plugged it in it did not work… I press the reset button and did all the troubleshooting, it is totally dead!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"3 out of 5 stars","reviewDescription":"I am giving the product 3 out of 5 stars because it arrived scuffed up and scratched. It’s obvious this wasn’t a new product I purchased. The blow dryer works just as it should.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"The diffuser isn't snug and hair gets caught","reviewDescription":"This blow dryer is good if you don't have to use the diffuser. The diffuser snaps in place but there is a small gap where hair can get caught. If you are someone who doesn't use the diffuser every time and will be taking it on and off, it won't last too long. The small plastic edge that snaps it in place will break. There also is not a hook to hang this dryer. There are positives: it dries quickly, the size is great, the back of the dryer has very small holes and doesn't snag hair or suck it in.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Works well but beware","reviewDescription":"This blow dry works well. However, beware that it could be dangerous around long hair. This blow dryer has sucked in hair twice. The first time it happened I put it down to user error and in the future I had to be more careful. However, today I was drying my 5 y.o. Nieces hair which is super long and it happened again. This time the suction power of the dryer pulled her hair in from a good distance. I was being careful, running it on the lowest settings and I was not distracted. The damage was minimum because it was only 10 strands of hair but the fear was real. It pulled the hair in with force. I was lucky that I reacted quickly and was able to turn it off before it pulled closer to the rest of her hair and sucked more in. It’s a great diffuser hair dryer for rollers or scrunched curled hair but I won’t be using around young children or to blow dry loose straight hair. I think it’s due to the lack of a rounded back air intake and removable filter. I warn folks to make sure young children aren’t allowed to play with the blow dryer or be allowed near it while unsupervised and it’s plugged in. Save yourself the tears.","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"Good but mount doesnt work","reviewDescription":"The product itself, and the attachments that came with it were both good, while not as quiet as I was, hoping for, much quieter than my last one! Fairly happy with the different options, and the appearance of the hairdryer. However! The wall mount that they send with the hairdryer will not support the hairdryer itself, i was moving and so waited a few months to mount the hair dryer and just recently had the opportunity to. It was one of the reasons I purchased this particular model in order to get that additional benefit of being able to mount it on my wall. Unfortunately I attached it to the wall. Left it for a full 24 hours to adhere.  Then put the hairdryer on it and came back to find the hairdryer and the mount on the floor with the hairdryer having sustained damage in the fall. I hate this, as this is one of the reasons I purchased this particular option, and now my hairdryer is damaged due to using the products that were all included.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Cute not not that effective","reviewDescription":"For a brand new dryer it isn’t very powerful, it heats nd cools well but it doesn’t push air much. It’s very cute though","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"No heat anymore","reviewDescription":"I bought over 3 months ago. Today the heat went out. The dryer works still, just no heat anymore. I'm so bummed cuz i loved this dryer. I'd say it's a 5star dryer, but the fact that it didn't make it to 6months when It cost $40 is ridiculous. I'm outside of return window, $40, & a hair dryer during a work week. I use a dryer 5-7days a week. Thank goodness I had an old $10crap basic dryer that's yrs & yrs old that still works for backup. I just like a dryer with features like this one. I'm so bummed it didn't last...***update** the seller issued me a new dryer free of charge. I'm glad to have a blow dryer again& appreciate the extra mile that was done by seller to make things rightm","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Not worth it","reviewDescription":"Had it for a year and a half worked well until it starting sparking. Was hoping it would have lasted longer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Seller doesn't respond","reviewDescription":"I read the reviews on this product and several others before I finally made my decision.  For the first week or so the hairdryer was great and the attachments were exactly what I wanted.  A few weeks ago I messaged the seller asking what can be done as the attachment I use daily just falls off as I'm using it.  I have to wait a few minutes to attach it again as it is very hot.  Its to the point now it falls off every few seconds I'm using the hairdryer.  The thing that bothers me the most is the seller just ignores your concern .  The hair dryer is decent and does what I was hoping to find but the hair attachments is what I really am aggravated about since I use it daily to eliminate frizz.  Do your homework before buying from this seller.","isVerified":true,"ratingScore":3,"reviewReaction":"82 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Outlet plug issues","reviewDescription":"Unfortunately The outlet plug doesn’t stay in the wall. It falls out when you’re using it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Attachment","reviewDescription":"I found the dryer to be satisfactory, however, as someone with curly hair, the diffuser attachment broke after only four uses. The other attachments functioned as expected, but the diffuser's durability was lacking.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Not very powerful","reviewDescription":"Takes me a long time to dry my hair. I wish I would’ve purchased another Conair dryer because they are much more powerful. It also shows scratches really easily because it’s matte.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Not a great quality dryer","reviewDescription":"It works but the two switches that are almost one switch is some what flimsy. It works but isn't near as good quality as most of my past dryers.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Loose nozzles","reviewDescription":"The various attachments securely attach, but they don't stay still, meaning that they rotate during use. This is particularly frustrating when using the directed flow nozzle","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"It's a good hair dryer!","reviewDescription":"I do think you get value for money with this hair dryer. I wish the user manual was a bit more user friendly, I could have missed it but I didn't see how to attach & remove the different parts. I wasn't sure if I should screw it on\/ off or pull. I eventually figured it out. I haven't use the diffuser attachment as yet but the other two attachments work fine. I wish there was a carrying case that came along with this hair dryer. Also, I know it says in the user manual what the cool button is for but i still don't really get or feel any difference but I'm also not very knowledgeable in hair care styling. All i know is a hair dryer is to dry hair...lol. But all and all I think its a good hair dryer and value for money. I think its a good buy & it seem like it will be one that will last me awhile. I'm happy with my purchase, maybe I use need to read more on the product description to understand the cool button.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"The COMB NOZZLE is stuck. Can anybody help me?","reviewDescription":"I installed the nozzle for the first time, like the other accessories...But I can't take it out anymore. Maybe it happened to someone? Help please.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Cords too short","reviewDescription":"As a professional of 20 years, I absolutely HATE how short thr cord is. It ruins the entire blowdryer for me","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Beware","reviewDescription":"Have not had a year and this morning I had Sparks coming out of the cord thatis inside dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Disappointed... it is not quiet at all","reviewDescription":"It will dry my hair, but it is NOT quiet.  Won't fall for this brand again","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Wanted to love it..","reviewDescription":"Stopped working after a month and a half! Awesome product but not worth it!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Does not work for all hair types","reviewDescription":"I brought this dryer for daughter who has thick 4b hair.  It didn’t work well at all😔","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Heavy","reviewDescription":"Left my hair frizzy. Really heavy. I really do not recommend this blow dryer","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"It was just OK","reviewDescription":"The dryer is very cute and I really like the color.  It has 3 heat settings and 3 speeds which is very nice.  It seems to take much longer to dry my hair than with my old dryer and my hair ends up much more frizzy and poofy. I ended up ordering the same one I used to have and will be donating this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Worked great until...","reviewDescription":"I had this blowdryer for a little over 6 months. For the most part I was happy with it. My only complaint was that I kept accidentally turning it off due to the location of the buttons. However, tonight I went to turn it on and it wouldn't turn on. I reset the cord and finally I got it to work. After 10 seconds it sparked and burnt my arm. I smelled smoke and immediately unplugged it. My husband tried turning it on again and the same thing happened. I will not be using it again. Not taking any chances and burning myself again, let alone possibly burning my house down. Unfortunately it's outside of the return window. I wish I would have gotten more than 6 months out of it. Giving three stars because I didn't have a problem with it until tonight.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Works same as Al do","reviewDescription":"Not really impressed. Advertises makes waves.Works like all hair dryers","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"It’s okay","reviewDescription":"It’s cute, however the quality isn’t the best. My hairdryer sort of fell like a foot and a half off the table and I caught it and after that the mesh filter on the back refuses to go back on properly. Pretty janky product. The temperatures are good and easy. I wish it came with a wall mount of something.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Mid","reviewDescription":"It was okay but the shaft that you have to hold is too short. My hands are average size and when just holding the blow dryer while using  I often accidentally push the switches.  I have never experienced that with any other dryer. This might be good for a pre-teen's first hair dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Cheaper hairdryer","reviewDescription":"I had high hopes for this hair dryer just it seemed to fail in a lot of categories. While the dryer is very light and small it takes a long time to dry hair and had a funny smell to it. The attachments felt cheaply made and overall didnt meet my expectations.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Why no hook?","reviewDescription":"It seems petty review but, sometimes we hang blow dryers on hooks, don't we? I have to lay it on the counter when not in use. Thinking about cable ties, maybe a rubber band. Kind of hate it for that reason.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Good little blow dryer but….","reviewDescription":"This is a good little blow dryer but one slip into the sink from the counter and 2 of the 3 little prongs that hold the back on broke.  It is made with very light weight plastic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Stopped working 3 months in","reviewDescription":"Update: 1 star to 3 stars. The company sent me a new hairdryer free of charge. They did not ask for a review change, but I think it is worth noting that the second hair dryer works just as well as the first. I'm still using it and love it. It might just be a bit of a gamble whether or not the one you get will work long term. But it's a really good hair dryer for the price!Original: I would have given this 4 or 5 stars, but one day the highest speed stopped working for no apparent reason. I only used it twice a week heavily, and maybe a minute each day. So I can't attribute it to overuse. My husband actually took it apart and said it was a component issue, and not something that could be fixed or was somehow knocked loose.Bummer because it was pretty amazing at first. Dried my hair fast fast and the ion part was nice.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Breaks if it falls on floor","reviewDescription":"Dryer was good but it fell on my bathroom floor one time and now it won't turn on.  That is looney.  I have dropped my phone 6 times in the 3 years I have had it and it hasn't broken and that is much more delicate.  This should expect to be accidently knocked off a sink and survive.  Wouldn't recommend for traveling because of that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not for me","reviewDescription":"The dryer is heavy and didn't concentrate the airflow like I had hoped","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Love the product BUT..","reviewDescription":"Love this hair dryer.. all the temp and speed settings the weight the ease of usen all the things BUT I did Not get what I ordered and paid for! I got the hair dryer and one attachment(the difuser).. the comb & concentrater attachments were just missing🤷🏼‍♀️ but bc I ordered it for a trip I can't return it bc I had to use it the day it came I had no other choice so I am VERY irritated that I paid for something but only got a couple pieces of it. It sucks that I have to leave a not so great review for a product I really do like but can't love it all the way bc I don't have it all","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Not as freat as some of the reviews stated","reviewDescription":"Pros: it’s lights weight. The best come attachment that I’ve used in awhile.Cons: button placement causes you to accidentally adjust settings while using.Cord is very short for a blow dryer.Those are deal breakers with me, and why I will have to return.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Cool button in an awkward spot","reviewDescription":"Works well and not too noisy but it is kind of heavy and the cool air button is right where you hold the hair dryer, so I find my dryer going cool a lot since I’m accidentally pressing on that button with my hand.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Very heavy dryer - had to return it","reviewDescription":"I didn't even use so I can't comment on how it works. As soon as I opened the box and held the dryer, it was the heaviest styling tool I've ever held and it's just not practical for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Practical, but diffuser gets caught on my hair.","reviewDescription":"I love the functionality of this hair dryer. I bought one previously at a higher price point and this one works just as good. The only complaint that I have is that due to the diffuser being made of a cheap plastic material it has not so smooth edges. My 3c curls some times get caught in the diffuser when pulling the diffuser away from my hair, which disturbs my curls and cause some frizz and could pull my hair out if I’m not careful.  I wish that the edges on the openings of the diffuser were smoother. But this is my only complaint.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Gets hair dry but not smooth or shiny.","reviewDescription":"I was really excited about trying this dryer based on reviews for the price point after my Chi died. I was highly disappointed. My hair was not sealing with cold shot so it was not smooth after 5 minutes or so and became frizzy and wavy. Good effort but it's a cheap blow dryer.I ended up returning this and got another Chi that always added shine and kept my hair straight with low EMF. Considering another Chi for Ulta beauty is only $10 more I shouldn't have tried to be cheap, you get what you pay for!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Doesn’t blow well","reviewDescription":"I think this would be good for curly hair and using a diffuser. The air it blows out is not powerful. I returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Great Dryer","reviewDescription":"I was very surprised that this works so well. It has a lot of power for a small dryer. Dried quickly. The only downside is if using the attachment, the attachment gets quite hot but hot where it would burn the hairI would definitely recommend it and would purchase again","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Good power bad cool placement","reviewDescription":"Love the blow dryer power, wish it had a better comb attachment and the cool button placement sucks because where I need to grip the handle is where it's at so I'm constantly pushing it and having to shift the way I hold it which doesn't feel as comfortable for me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Disappointed---- revised","reviewDescription":"I always wait a bit to do my review to make sure it holds up and this has not. Delivered Dec 30 and its March 24 and it already has messed up. It seems to have lost high speed and only has low. It is not a good blow dryer and now i have to go buy another one. Not happy at all!!!Customer service contacted me and made it right. Hopefully the next one works longer than this one. Was very nice and helpful.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Millenial Pink During 2008 Recession","reviewDescription":"I literally chose this brand (among similar items) because of the color. It's more of a muted pale pink color and it was peeling as soon as I opened it. Other than that, it gets the job done, and I only plan to use it 4-6 times\/month (4C natural hair).In true millenial cringe core, I will be saving the box.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Works well","reviewDescription":"I needed  a new hair dyer that was strong and compact. This one is perfect for me. My daughter used it and was happy with how fast it dried her hair. Good buy worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"I like the color but do not like how it turns on","reviewDescription":"I am not sure how to use some attachments .  Mostly I'm pleased with my purchase","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Really like this","reviewDescription":"I've used the same giant Revlon hair dryer since High School, so over 10 years now, and wanted a new lightweight one. This did not disappoint! It's light, easy to use, and I like that the barrel is shorter. My only gripe is that the cool shot isn't very cold.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Easy to use","reviewDescription":"Nice lil blow dryer . I like the use of the attachments, they also easy to take off or put on","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Burning Smell","reviewDescription":"I've had this dryer for 7 months. It's different than any dryer I've ever used. It does have a strong gust, but it isn't concentrated for good styling precision. I can just blow all my hair around like a whirlwind and it does get fairly dry. It's strong, but not directional if that makes sense. I use it 2-3 x a week on partially air-dried hair, so it doesn't take long. I used it tonight and I put it on high heat with high blowing and immediately it smelled toasty. Which kinda worried me. It smelled like something was burning. It wasn't right. I bought a new dryer after that. (Edit) company was very gracious and offered me a full refund of the purchase price of the dryer. Added 2 stars for excellent customer service. I didn't even ask for the refund.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Great dryer","reviewDescription":"So I’m new and finally embracing my crazy frizzy mess of hair that I have brushed out daily for years after a shower. I don’t really like air drying because I’m still learning what to do. I decided to order a dryer with a diffuser and tried it out as soon as I got it. Definitely a back breaking process, but I love the different speed options and heat options. It did a great job drying my hair and look at the lil baby curls I got going on 🤪 Cant wait to continue using this as I learn more about how to do my hair!","isVerified":true,"ratingScore":4,"reviewReaction":"41 people found this helpful","country":"United States","date":1706832000000}
