{"reviewTitle":"Bought two. Neither one worked well","reviewDescription":"The first one creaked every time I pushed any button. The buttons didn’t react. They did noting when I pushed. So I chalked it up to a bad remote and bought another. It worked okay for a couple of weeks. Then nothing but frustration. I can push a button 6, 8 times and nothing happens. This thing is a piece of junk. All I want is a remote that works and all I got was a rock in the shape of a remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Terrible product","reviewDescription":"The reviews that this remote got are honestly quite unbelievable, the terrible quality immediately presented itself as soon as I pulled it out of the packaging.  Not only did it feel really cheap but when I put batteries in it they would slide around not always making contact with the metal prongs, and yes I put the correct batteries in before you ask. This problem would make the remote next to unusable because 90% of the time the batteries wouldn't make contact to carry out the input when pressing buttons.  Overall terrible product, just stick to the name brand Samsung remote and not this 3rd party universal garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Buy literally any other comparable remote","reviewDescription":"We had to purchase a replacement remote for our Samsung tv and figured it didn’t matter where the replacement was purchased from. This remote barely works, the sensor is trash, so you have to try over and over to get it to work. The buttons stick and you have to press really hard, multiple times. It truly shouldn’t be this hard to hit pause\/play on a tv in 2024.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Great at first but stops working","reviewDescription":"I purchased two remotes within the time span of a year. At first the remote works great does its job but after a few months or weeks it stops working entirely. I had to mess with the batteries from time to time with the first one and would fall apart completely if it hit the floor. The second, none of the buttons were responding after a three weeks of buying the remote it was tricky to turn off the tv or change the channel. The remote is affordable but I would not recommend!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Cheap junk. Poorly aligned battery connections, that don't quite fit AAA batteries.","reviewDescription":"Horrible junk.Get it out of the package, try to put the AAA batteries in the remote. They won't stay in. They don't even make a solid contact with the connectors.Had to strech out the connectors and then tape the batteries into the remote to get it to work.Absolute TRASH.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Doesn't work!","reviewDescription":"I bought a remote a week ago, but unfortunately, it didn't work. I thought maybe it was just that one remote, so I tried another one, but that didn't work either. They both only worked for a few hours and then stopped completely. I wouldn't recommend wasting your time or money on this product from China. It's just not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"HORRIBLE","reviewDescription":"The cover was almost impossible to open, almost returned it, when i finally got it open the batteries dont fit. Like literally the battery space is bigger than the batteries. Unfortunately my 30 days to return have passed and am stuck with a remote I never used.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Main circle button in operations from the box","reviewDescription":"Not a quality product.  I was looking for an inexpensive replacement for my Samsung Frame TV, but the quality on this is low. Direct from the box the main circular button is in operational unless pressed with tremendous force.  Just product, avoid it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Did not work","reviewDescription":"This was not the product I ordered, and it did not work. The volume control button on my original Samsung remote quit working, so the only reason I ordered this one was for the volume control. Pushing the volume button only muted\/unmuted the TV. I returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Don’t waste your money.","reviewDescription":"Purchased in October’23. They barely work at this point.(Yes, new batteries were installed and didn’t help.) The buttons are mushy and sluggish, and it’s nearly impossible sometimes to maneuver unless you hit the buttons precisely (which changes all the time). Cheap junk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Works out the box. Good remote.","reviewDescription":"I purchased this remote due to we lost the original one and we can’t find it. This does the same thing as the original with some minor inconsistencies. The plastic feels like hard plastic, not soft like the original. Ours came with the CH smudged like it was a return and sent to us but for all these minor issues. We can’t complain for a $9 remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Good replacement","reviewDescription":"Our senior dog had a senior moment and destroyed our original remote, this worked as soon as we put the batteries in. Only complaint is the buttons are much firmer and make a clicking noise every time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Easy to use","reviewDescription":"This remote is super easy to use! All you have to do is insert the batteries in the remote and point to the television! Great item!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Sometimes you'll need to press the button a few times","reviewDescription":"I'm on my 9th remote,  dogs love the crunch. Reminds me of these books at poochville.store","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Easy to set up","reviewDescription":"This universal remote is great. Batteries are popped in and it’s ready to go. Would recommend this remote is need a new one","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Arrived scratched","reviewDescription":"Remote arrived with a scratch on the dial pad, but otherwise, it works great, and connected automatically.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Good","reviewDescription":"works, buttons are a little hard to press","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"It does what it is supposed to do.","reviewDescription":"We have purchased it twice.  It works well but over time loses its accuracy.  The first lasted 8 months until we had to purchase the second one recently.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"That is can work on any television","reviewDescription":"Great remote highly recommended","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Good Replacement (Samsung Q60A 43)","reviewDescription":"Good replacement for my original remote that had the solar recharge panel in the back. Accidentally spilled hot chocolate all over the controller one night and immediately putting it in rice for days did zilch.Downloading an app like Smart Things irked me as to why they need so much access to my personal info. 👎Search results offered a bunch of uncertain knockoffs asking an insane $80-$130 for an identical remote that’s made in China. But that working wasn’t even a sure thing? Nope, didn’t appeal to my sensibility.Then comes this baby. Legit reviews convinced me enough to try it. Tada! It was like magic, it worked straight out of the box right after inserting new batts and without pairing. All the buttons like Netflix and Prime Video work nice. Escape road to TV heaven reopened. 🥳The controller is a bit thicker due to needing batteries. I’m fine with it not being solar\/usb rechargeable.(Someone mentioned being unable to open the back to insert batteries— it’s a one piece unibody design so the entire backside has to come off. Maybe they were looking for a small little panel to remove?) 🤷‍♀️Happy.—UPDATE—Docking a star because the circular directional pad started feeling super sticky within a week. Must push down rather hard to get things moving. Sometimes the reaction is delayed a bit so I end up scrolling too far. :( Also the tactile feeling of pressing up, down, left or right isn’t there anymore. Not sure what happened to make it feel this way suddenly, like I spilled hot choco on it again. Anyway, all other buttons are fine.Btw, this is a must-point-directly-toward-TV remote, unlike the original… in case this is important for your decision-making.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1645142400000}
{"reviewTitle":"It never worked right.","reviewDescription":"Multiple issues.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Doesn’t work as advertised","reviewDescription":"I returned the first remote because it did not work. No red lights, no activity. I used two sets of new batteries and it didn’t turn on nor responded when I pressed the return and play\/pause buttons together. No blinking red light showed when I tried it to pair it to my TV. Then I returned that one and just got the replacement, same thing. Wouldn’t work.My TV is listed as one that works with this remote and I just need to put the batteries in and it would work, but it didn’t.I won’t order a third one!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Hit or miss!!!!","reviewDescription":"I bought 2 remotes and one works and on the other the buttons don't work properly.  You have to press several times for them to make contact. The up volume button also doesn't work. So I'm keeping the one that works and returning the defective one.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Stopped functioning after 4 months","reviewDescription":"You get what you pay for. Cheap crap. Don’t buy it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"They won’t even power up.","reviewDescription":"They won’t work. I bought 2 to be safe but put batteries in and can’t pair because no power.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Don't waste your money","reviewDescription":"The buttons on this thing is literally the worst","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Stopped working 2 days after purchase","reviewDescription":"Remote stopped working after two days of purchasing the item. Not worth it wish I could return it in order to get a refund but I lost the packaging.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Buttons don’t work","reviewDescription":"Avoid this product. The right direction function started breaking after a few weeks. If you enjoy pressing a button 8 times to have it work one time then this remote is for you. Please make better products.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Dont Buy This Product!!!","reviewDescription":"really horrible device. complete waste of money. the unit arrived on time as usual but literally broke into pieces just trying to slide the battery cover plate off to install the batteries. straight into the garbage...Dont waste your time or money on this..... suggest tracking down an OEM remote if youre going to spend the money...youre not getting any sort of deal on this...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Doesn't even turn on","reviewDescription":"Doesn't work at all. Don't waste your time ordering and returning a defective product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Poor Quality Control","reviewDescription":"Batteries do not fit tightly.  They actually rattle.  As a result, they don't make reliable contact.  The control doesn't pair with the TV.  Very poor quality.  Not recommended.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"I had the tape the AAA batteries down because they were loose in the compartment. Ordering a better one but have to keep this one to at least turn my TV on.Volume doesn’t work and neither do theButtons for Prime and Netflix.Will return after receiving a better remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Buttons that don’t work = play \/ pause, return, 123, mute.  So if you’re happy with a controller that doesn’t control much - this one’s for you.  Else, don’t bother.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Stopped working in less than a year","reviewDescription":"Worked great when we first got it. Now, about 11 months later, the buttons are terrible and sometimes don't work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"It literraly broke in 1 month","reviewDescription":"Half the button is not working after a month of using it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Don't buy. Can't even open the battery case cover","reviewDescription":"Ridiculous! Impossible to open the battery case cover. The catch doesn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"So-so","reviewDescription":"Bought this twice. First time was great, after 6 months bought again and quality was terrible, do not work properly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Broken","reviewDescription":"The middle button does not work properly and needs to be pressed multiple times or held down to work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Sucks","reviewDescription":"This remote sucks. Does not work & Lasted for a month. Buy it if you want to waste your money.  I can’t return, what a scam!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Remote works half the time, and only when youre up close","reviewDescription":"This remote is entirely frustrating. It works, but only if youre really close to the tv. I literally have to get up and walk to the tv to change the channel. Just a bad and cheap product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Doesn't work properly. Never buy again.","reviewDescription":"Not all the buttons work on this product, some work intermittently.spend 3 more bucks and get the genuine Samsung made remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Absolute Garbage","reviewDescription":"Looks exactly like the original remote that came with the TV, and that’s where the similarities end.The first thing you’ll notice is the toggles on the volume and are stiff and awkward to push up or down, and feels extremely cheap in your hand. Hard to imagine that could be an issue, but it absolutely is. I don’t know how it has good reviews. Maybe i got a lemon. Anyway, the remote has completely stopped working after like 2 months. Avoid this thing","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675987200000}
{"reviewTitle":"Buttons no good","reviewDescription":"Received this remote and after a week the buttons stopped working properly. Have to press super hard for it to work sometimes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Waste of money","reviewDescription":"Not good remote botton is very hard not working properly waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Garbage","reviewDescription":"My wife lost the original and in a bind, I went to a big box store and bought an el-cheapo $20 universal (not this one) and it works kind of. Purchased this one here from Amazon since it is for the model of TV I have (). No programming is needed but it performs terribly. You constantly have to mash the buttons repeatedly to get it to do anything at all. Throwing it away and going back to the $20 el cheapo from the big box, at least it works all the time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Defective within 2 - 3 months","reviewDescription":"Initially I was very pleased with the remote, as it worked every bit as well as the original.  After about two months, I absolutely HATED the thing.  I have to push a button on average about four times before the remote “recognizes” that a button has been activated.  It’s so incredibly annoying, and I’m back on Amazon today to find a similar remote by a different company.  (I did try changing out the batteries, but to no effect.)  I recommend you steer clear of this one!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1659312000000}
{"reviewTitle":"Numbers Stick after a month","reviewDescription":"Pretty horrible. The numbers stick and essential it does not work!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"Samsung remote","reviewDescription":"It’s totally garbage. Do not buy this remote. cheap Chinese stuff.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Remote is not working","reviewDescription":"Remote worked only for 4 months, it is not working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Item doesn't work","reviewDescription":"Received faulty remote. Brand new batteries inserted and still doesnt work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"do not buy these style of remotes, go old school for longevity","reviewDescription":"Edit - do not buy the sleeker\/minimal style of Samsung remotes whether OEM or replicas.Whether USB-C rechargable or AA\/AAA batteries - they are all built to be disposable.I thought this was a Samsung flaw per what came in the box, but I know now after buying many varieties of this kind of remote over the years that they are just a cheaply made design.Between their bluetooth connection issues or the fact the main circle which will quickly degrade and eventuallly stop responding despite fresh batteries, I've had it.I have never had such a consistently awful remote control performance for a TV in my entire life.Do yourself a favor and stick to the older-looking, original Samsung remotes with the video game buttons on the bottom.They dont look as cool but they dont require bluetooth and the arrow keys last how you would expect TV remotes to last.I replaced all newer-style remotes with the older model and have had zero issues.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1655510400000}
{"reviewTitle":"IT'S A GAMBLE!!","reviewDescription":"I've fon we thru several of these in the past month all thanks due to my pup. I've received some good,, some iffy and a dud. So it's a gamble! This last one worked terribly and then stopped working. They want you to pay to return it or you can take it to Satples for free if you still have the original packaging. So roll the dice if you order this,  you might get one of the good ones.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Feels cheap","reviewDescription":"It feels really cheap. I had to put something between the cover and the batteries because they we not making contact. The batteries last about 6 months which is very short for a remote control.You have to point the remote straight to the TV. Most of the times you have to press multiple times on the bottoms.The only positive point is that it’s pre-configured, so as soon as you put the batteries on it starts working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Horrible!!!","reviewDescription":"This remote is not worth it! The select button area and button sucks. Moving left to right or up and down requires you to position the remote in all kinds of ways to get a signal to the tv. I would return, if I didn’t have it this long. 😑","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Technically works, but terribly","reviewDescription":"Does it work with my Samsung Frame? Yes. Do you have to click whatever button you want to use 2, 3, 7 times? Also yes. Worst remote I have ever had.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Buttons hard to push horrible","reviewDescription":"Horrible","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"STAY AWAY!!!!","reviewDescription":"I bought this two months ago and after six weeks the buttons are hard to use and doesn't work unless you hit in many times.  Complete piece of junk and can't return it.  STAY AWAY!!!  I never write negative reviews but this was necessary.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Doesn’t come with batteries.","reviewDescription":"Device came completely apart when the poorly designed battery cover was removed.  The pieces refused to go back together.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"cheap junk","reviewDescription":"The left-right rocker broke within a week, and the power button no longer works after two months. Do not buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"If you ABSOLUTELY need a remote...","reviewDescription":"This is NOT a Samsung remote. It works, but barely. I'm having to press the buttons ridiculously hard to get a response. I should've known with the low price. Save yourself the trouble and get a genuine Samsung remote or a Logitech universal. When I do, I'll be burning this POS with extreme prejudice.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Didn't work","reviewDescription":"As soon as pulled the remote out the bag it didn't work. Buttons were too sticky to move !👎👎","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Does Not Work","reviewDescription":"Inoperable and seller does not accept returns.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Not worth it","reviewDescription":"Second time i bought it, and having same problem, its not working again, not even 3 month","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Poor quality!!","reviewDescription":"Poor quality remote. The battery compartment is too loose to hold the batteries securely. You can shake the remote and see the batteries rattle inside. Not to forget when batteries lose contact with the metal parts, the remote will not work until you reposition the remote.I don't even want to bother returning such a poor quality remote. Don't buy!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Stopped working in couple of months","reviewDescription":"Horrible quality . Regret buying it stopped working in 2 monthsAvoid this at all cost","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"This remote broke the voulme wont work","reviewDescription":"Had it one day and it broke the voulme don't work please refund this product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Crap","reviewDescription":"Crap. In order to installbatteries, had to pry the back off with a number of different instruments. This is what it opened to! 😡 Going to a local store to buy a real remote tomorrow!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Works for a while","reviewDescription":"Update: buttons have failed and this is now junk.  I went to the Sony website and ordered a true OEM remote $$$ which I should have done in the first place.  Learned my lesson with these knockoffs.After accidently dumping my Sony OEM remote in a glass of bubly, I needed a replacement quick.  Ordered this one.It does work right out of the box.  All the buttons are there.But, it needs two AA batteries, unlike the original which had solar\/USB powered rechargeable internal battery.And after a few months of usage the up\/down audio buttons are failing.  So will likely be shopping for a replacement sooner than I'd hoped.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"The price reflect quality.","reviewDescription":"Channel button is broken.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Stopped working in less than 3 months","reviewDescription":"Saw the price and had to grab it. Took me about a month to remember to get batteries and now 3 months after I bought the control, it doesn't work anymore. Of course, the return window is closed. Super bummed I'm going to have to invest in another one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Never works","reviewDescription":"Every time I turn off my TV, the remote has to be reprogrammed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Bad button","reviewDescription":"The buttons are not sustainable.After a few weeks, they stop working properly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Buttons don't work","reviewDescription":"Volume and channel buttons don't work. Don't purchase this item. I had to return it and purchase the 13.99 remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Terrible remote","reviewDescription":"This replacement remote is worse than the remote it replaced.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Don’t buy","reviewDescription":"This remote control is hard to use. It’s horrible. When I go to use it, I have to literally point it right at the TV  when trying to turn it on, it takes several times, pushing the power button for it to finally turn on or off I have to hold it down very hard in order to even do so. It literally is a painful product too late for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Terrible","reviewDescription":"This remote “worked” for about a week. Quotes being used because even during that week the remote still only worked about half the time, requiring buttons to be pushed 5-10 times sometimes to make anything happen on the TV. 0\/10. Would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"It’s better than not having a remote","reviewDescription":"It paired with the tv out of the box so that was nice but this thing is kind of garbage. The buttons only work about 25% of the time so you have to repeatedly push them to do anything. This is paired with a delayed response time so often you push the button several times and nothing is happening but then it all happens at once. This is especially annoying because it frequently leads to opening the wrong app. The volume and channel buttons are a notch above worthless. You have to fight with it to get it to change the volume and when it finally does budge it frequently gets stuck turning the tv volume all the down or (my favorite) all the way up. This is wonderful during the babies nap time. This remote is better than not having a remote at all but just barely.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"Garbage","reviewDescription":"Remote did nor work at all.  It didn't even light up when batteries were placed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Piece of junk","reviewDescription":"No instructions. Cannot open battery compartment.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Bad remote don’t buy","reviewDescription":"They don’t even work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Was not compatible with my Fire stick","reviewDescription":"Upset it did not work the tv channels only volume.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Horrible Product - Did Not Work for Me","reviewDescription":"The replacement remote that I bought for my Samsung TV does not work. I tried to use it but it had several issues and I had to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Half of the buttons don't work","reviewDescription":"The remote works, but barely. Half the buttons don't work and I cant change the HDMI with these buttons which is what i would use it for. Turns on and controls volume, and you can use the D-pad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"TV remote","reviewDescription":"This is so bad. It was not working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Not well made","reviewDescription":"Battery terminals did not make contact with the batteries. The well for the batteries are far too large and the batteries rattle around, audibly, within the unit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693267200000}
{"reviewTitle":"Don't purchase!","reviewDescription":"Batteries didn't sit inside the remote.  No instructions for pairing, not to mention it didn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"Stopped working after 3 months","reviewDescription":"It worked for 3 months.  Buttons stopped working.  No Prime controls. Look elsewhere, this is a joke","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Prepare to click your life away","reviewDescription":"By far the worst remote I ever bought I'm so upset that my original broke.No matter how close to the TV you are you need to click rapidly and hold for buttons to work.The volume control feel stuck and tightIt just a hassle to constantly have to click and hold and click and hope that what you're trying to do works.Forget using it to search for anything.Bad all aroundThe only similarity is the look of the remoteDO NOT BUY","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1660262400000}
{"reviewTitle":"Inutil.","reviewDescription":"El motivo de comprar el control remoto fue para substituir el original de la Smart tv, porque el boton de cambio de canales dejo de funcionar, quede sorprendido de lo barato que me costo este control nuevo y lo estaba esperando con muchas ganas, le puse baterias nuevas y de inmediato se comunico con la tv, sin embargo el boton de cambio de canales en el control nuevo tampoco funciono, me comunique al centro de atencion de los fabricantes de la television ellos me indicaron que podia hacer para tratar de hacerlo funcionar pero fue inutil, las indicaciones no sirvieron para nada, adicionalmente el producto es chino y no es la primera vez que me pasa esto, completamente desagradable compra.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1628121600000}
{"reviewTitle":"The directional pad partially stopped working.","reviewDescription":"When pressing down on the remote that I had for roughly two days, the “clicking” function is not longer working. It makes it difficult to press down directionally, and I have to press it multiple times. The remote wasn’t damaged in any way, it just stopped functioning properly. Might just be a one time dud, but it still is kinda lame all things considered.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1672704000000}
{"reviewTitle":"All main buttons work. Streaming buttons didn't work","reviewDescription":"Netflix, Amazon buttons didn't work. Everything else was flawless.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1609804800000}
{"reviewTitle":"Good price","reviewDescription":"It worked just fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615161600000}
{"reviewTitle":"It works on a 2020 Samsung QLED","reviewDescription":"We bought this remotes for our Samsung QLED that we bought earlier this year. The remote connected right away and we were able to use instantly. The only thing is that it will disconnect from the TV every once in a while so you have to reset again but it only takes a few seconds. Overall it’s a great replacement for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1606003200000}
{"reviewTitle":"Not bad","reviewDescription":"I didn't like that the shape is different than the original because the photo makes it seem identical. One other difference is that it needs to be pointed directly at the TV, unlike the original, for some reason. But otherwise, yeah, it does the job and is fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653004800000}
{"reviewTitle":"No voice to text","reviewDescription":"It's a good little remote. I wish I was able to speak into it to find shows....","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670544000000}
{"reviewTitle":"Great Budget Replacement","reviewDescription":"Works with my Q60. Compared the the OEM remote the quality feels cheaper.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1616716800000}
{"reviewTitle":"It works good","reviewDescription":"It works good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629158400000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656633600000}
{"reviewTitle":"Great for price!","reviewDescription":"It would be perfect if it had a source button. Besides that it works better than the original remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620345600000}
{"reviewTitle":"Next best thing to Samsung remote that comes with TVs","reviewDescription":"I would have given this 5 stars except for I didn't care for the odd sloped angle shape of it because it slips out of my hand easily.  Otherwise it's a perfect replica of the remote i love that came with my newer Samsung TV.  But for the price I 100% recommend it!  And there's no setup, just put in the batteries and it works instantly","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1661385600000}
{"reviewTitle":"it works but the remote has to show infront of TV.","reviewDescription":"it works when I face the remote towards tv. real remote would work without facings towards tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"It works but is not exactly like OEM remote","reviewDescription":"See my photos, on the left is this remote, on the right is Samsung OEM.  The biggest problem I have with this remote is the Netflix button is often mistaken for the back button.  Not a big deal but if you are used to the Samsung button placement you may find yourself starting up Netflix by accident.There is no voice control button, not a dealbreaker for me as I never used it anyway.Other than that the button click is louder but everything does work if your looking for a cheap replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1622592000000}
{"reviewTitle":"Great replacement","reviewDescription":"The power button doesn't always work on the first push but other than that, it's a great replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Not exactly replacement, doesn't work exactly like original","reviewDescription":"Not an exact replacement to Samsung Remote you get when you buy a Samsung TV in the US. Also the signal strength is weak, has to be pointed directly at the TV with nothing at all in its path. This was not the case with the original remote. All in all it does its job 85% of the time. Not bad for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1646611200000}
{"reviewTitle":"Worked right away for our Samsung TV.","reviewDescription":"Works fine for Samsung TV. Changes channels and volume but the 3 buttons on the bottom for NETFLIX PRIME AND ROKU do absolutely nothing. But the home button takes me to the screen to pick.  No directions to make those buttons work either.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1662076800000}
{"reviewTitle":"Works great Samsung TV","reviewDescription":"Took it out of the box and it worked great. Dog chewed the factory remote and needed a new one. I am sure I will have to buy this again and would do so in a heartbeat.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Not a smart remote","reviewDescription":"I bought this to replace the original pen remote that got broken. We have an Apple TV attached to the RV and the original remote will control both the RV and the Apple TV. This remote will only control the tv.  If you don’t use accessories it is a great remote but if you want to control other devices like the original then you need to order an own controller","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635292800000}
{"reviewTitle":"FAST shipping","reviewDescription":"After our dog chewed up the remote, we needed a replacement. This I've arrived several days early (which is exactly what we needed)!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669852800000}
{"reviewTitle":"Buttons are oddly firm, however it works.","reviewDescription":"Sometimes the power button will seemingly \"double tap\" so my TV turns on & off again. Other buttons will also require a good amount of force and do a bit more than what was intended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653436800000}
{"reviewTitle":"Works great and simple to connect!","reviewDescription":"My wife hated the remote that came with our tv! It was one of those universal remotes that can be programmed to control several devices which we don't have. I was looking for a remote that was simple to use and this one has been great! right out of the box, placed two AA batteries in it and it connect seamlessly!  The only thing I don't like is the volume button uses a lever action for up and down and press for mute. it just feels a little awkward, but ease of use has outweighed that one small detail.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Worked right away once batteries are installed","reviewDescription":"Getting the top to slide off to install the batteries is extremely tough.  I need to get a very thin knife and went around the remote on the creases to get it open. Once I got through that, the remote worked great!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Works straight outta the box! No set up.","reviewDescription":"Take about easy! I removed it from the box, added batteries, pointed it at my T.V. And BAM! It works without ANY setup. I’m not sure how that’s possible. It’s a lot more simple than my last remote, which I appreciate. One pointer, I’ve seen someone in the reviews say their volume and channel buttons don’t work. When I tried it at first, I thought the same until I referred to the instructions listed on this page. You’ll need to push the button up and down, not straight down.I have no complaints!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Finally!!","reviewDescription":"I am so happy. I no longer need to get my lazy butt up to use the volume or turn off the tv. I was shocked when it came with no directions. But that is because it is not needed. I came right into my room and turned on the tv. That’s it. I live in an apartment with shared WiFi. It’s is like magic that it automatically worked for my tv. So happy. It works for the tv functions and my fire stick with no set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"So Far So Good","reviewDescription":"Just got my product today, took a chance after the review that I saw.  My remote got broken by my toddler and I need one that would like me to turn on Neflix.  So far so good, easy to use, battery fits well and the back is easy to remove, although a bit tight.  The product was made in China, it says so on the shipping label.  Wouldn't complain, let's see if it breaks within the month, then I need to return it, if it doesn't, I'm keeping it, cause it is 9.99 only.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"The remote arrived fast and in good condition.","reviewDescription":"Hopefully it lasts longer than the last Samsung remote. The one I got with my TV started dying pretty quick when certain buttons stopped working, but I'm hoping this one is better. The volume button is a little stiff, but overall it seems like a good remote so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Works on Samsung OLED also","reviewDescription":"I dozed off the other night on the couch and my tv remote disappeared when I woke up and I live alone. I know this sounds ridiculous and yes I’ve been through my couch 4 times now looking for it but I’m tired of looking and I ordered this remote. Plugged in a couple of AA batteries and it worked immediately on my 2023 Samsung S90C OLED television. Highly recommend for $10.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Saved me $$$ on with my Samsung TV","reviewDescription":"This was a super cost effective alternative to buying an OEM Samsung remote.  It worked perfectly right out of the box!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Works great and syncs easily","reviewDescription":"My dog loves destroying these remotes. Im sure n my 4th one. I’m glad I can get replacements easily. I wish he’d stop eating them :(","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Works great","reviewDescription":"It worked on my tv as it was on the list of compatible devices. I’m happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Soooo much better than the stock remote.","reviewDescription":"The stock remote was literally all buttons so we bought this remote with less clutter. Never misinput anything again.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1631318400000}
{"reviewTitle":"Wish the buttons lit up","reviewDescription":"I wish it lit up. All the buttons are black and the remote is black so in the dark you can’t tell what is what","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625011200000}
{"reviewTitle":"It’s a good one","reviewDescription":"Obviously it doesn’t have the speed of function like the original one. Takes few days time to get adjusted","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631404800000}
{"reviewTitle":"Does the job.","reviewDescription":"Cheap build quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"Works great","reviewDescription":"It works great just like the original, only drawback is it didn’t come with the microphone feature the original had.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623715200000}
{"reviewTitle":"Good remote for the price","reviewDescription":"Good little remote, cant seem to get the netflix button to work but i havent looked into how to get it to work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620777600000}
{"reviewTitle":"Good purchase","reviewDescription":"Great just wish it came with batteries for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630886400000}
{"reviewTitle":"Works well","reviewDescription":"Good replacement","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644710400000}
{"reviewTitle":"Ease of programming","reviewDescription":"Great product easy to program. Can’t beat the price!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624147200000}
{"reviewTitle":"It works","reviewDescription":"Works well.  Battery back doesn’t fit well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618876800000}
{"reviewTitle":"Works with my Samsung curve TV","reviewDescription":"It works with my TV. However, sometimes it does lag.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"This is not bluetooth. It has to directly point to the samsung TV.  works well otherwise.","reviewDescription":"xx","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Worked great with our Samsung TV","reviewDescription":"Worked immediately out of the package.  No issues at all.  My only minor complaint is that the battery or something inside rattles pretty bad but that is a small inconvenience.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Just like the factory.","reviewDescription":"You can't tell the difference between this remote and the facory original except that it is way lighter. Feels kinda cheaply made but works as it should.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"I haven’t had a remote in years…","reviewDescription":"I haven’t had a remote in years but finally decided that it was time to buy one. This remote is great, immediately connects to your tv after you put batters in it. But, it is hard to get the back off so that you can put the batteries in. Plus the Netflix, prime and Roku buttons do not work and it takes a while for certain buttons to work. I have to continuously press them before they work.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Remote","reviewDescription":"Works good as a replacement remote for smart tv","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"NO MIC otherwise works fine","reviewDescription":"At first glance, I saw the mic hole in the pic and thought it had a mic. Without looking more, I bought it. Turns out, it DOES NOT have a mic. Or maybe it does but there isn't a mic button.Maybe there is a way to map a button to be a mic but I don't know how to do that.Otherwise, it worked seamlessly. Put 2 AA batteries in it and started pressing buttons and it did stuff. I have a Samsung q60 smart tv or something like that.If you want a mic, don't get this one. I have kids so I'm gonna keep this one as they already broke 2 remotes.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Doesn’t wrk with all Samsung smart TV","reviewDescription":"It looks very well made and looks just like a factory remote. I’m sure it probably works for a lot of Samsung smart tv’s just not mine. But with Amazon’s easy return policy, try it and see if it works for your needs.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Works ok but the original is better","reviewDescription":"Great deal but the quality is not as good as tge original. I have to press the buttons twice at times and point it directly at the TV to get where I want.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"It does what it’s intended for","reviewDescription":"So the remote is ok. It works as intended. You do have to push the button 2-3 times to get it to respond though. I have changed out my batteries and it didn’t fix the problem. Like I said though it works and more than that what is it really supposed to do.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Everything but Volume Control through to the Optical Outline Works","reviewDescription":"My Samsung solar\/internal battery is flaking.  This replacement takes real AA batteries.  Two things: (1) the button pressing is much more cumbersome and does not move with ease.  I can live with that. (2) ALL buttons seem to work accept for the volume up and down with the optical line out to the Sonos.  Basically, if I use the volume control for the internal tv speaker it works fine!  Weirdly, as the TV passes through the signal to turn up and down the volume to the Sonos sound bar it takes like 100 pushes to the 1 push on the native remote.  What gives with that?  For $10 as an emergency back up to turn it on\/off (and then use with internal speakers), I'll probably just keep it but need to find a real replacement","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Not all functions work","reviewDescription":"It paired with my tv when the batteries were out in. It could turn on\/off, adjust the volume and click through apps. The buttons are stiff even after a month. When I select Apple TV the remote no longer works, even though the previous Samsung remote did work. It won't select it won’t toggle, the Netflix button doesn't open the app either. If you were hoping for a one and done this ain’t for you, if you can app with your phone but just need to adjust the volume or power on, maybe this is just what you need.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Buttons sloppy and unresponsive","reviewDescription":"This is a very cheap product.  Unfortunately there are way to many to pick from and if you strictly go off of reviews you might think that this is a fairly decent remote control.  However, when I first took a look at it it seemed to be exactly what I have been looking for, however I soon found out that the buttons that control scrolling and volume were broken and worked only if you pressed them on multiple occasions. I still have it but it is way to much of a hassle to send it back to amazon, get a refund, and so on, thus I just threw the darn thing out.  I am definitely much more skiddish when it comes to buying electronic products from Amazon.  I do NOT think there is any kind of quality control. I would also imagine that some robot grabs it from a shelf and then takes it somewhere for packaging and distribution.  Amazon is really going down hill fast.  Amazon used to send you paperwork for returning a product hassle free and you could use the box and packaging it came with to send your product back to Amazon with little or no hassle.  However, Amazon is making it more and more of a hassle to return a product.  In other words, they better get it right the first time or your screwed....If the buttons worked properly and it would have been much easier to return the product I probably would have done that.  Heck, your lucky to get a package inventory\/receipt in the box any more.  Come on Amazon, you should not take your customers for granted.  You, like many other companies can go under, especially when your customer service has gone down hill so fast and so far.  Good customer service is the BACKBONE of every company!!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669939200000}
{"reviewTitle":"Faulty Right Button","reviewDescription":"Love the design and how sleek the remote control is however the right - click button does not work properly for me. Maybe I got a faulty one but it’s been like that since I received it. Will have to buy a different remote or stick with sore thumbs.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Has sticky buttons","reviewDescription":"This remote is the least expensive one I found and I got what I paid for. Not worth saving a few bucks.  I have to press the buttons multiple times to do one command most of the time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Doesn’t last long. Poor reaction time.","reviewDescription":"Many reviews talked about this but I didn’t think much of it… but let me assure you that reaction time goes down drastically. I suspect some cheap part due to which this happens but can’t be sure.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Works .. but","reviewDescription":"It works … barelyThe batteries feel loose and the buttons are hardAnd sometimes have to press several times for it do something","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Delivery poor","reviewDescription":"Product appears great, but delivery was not. Delivered to mailbox and that is not what I pay for with Prime.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"It does not change upon selecting  channels","reviewDescription":"It's worst than the one I replaced it with. And it's the same remote","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Lasted about 6 weeks","reviewDescription":"The remote worked great when we first put the batteries in and paired it to our Samsung TV.  It's been about 6 weeks and the remote has died completely.  We can't change batteries, re-pair it to the TV, nothing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"It Works","reviewDescription":"Lost my original remote. This is a Great Replacement.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Which one would you choose.  The one I can easily read","reviewDescription":"So much easier to use.  I've probably not used all the ways to operate it.  But of course I chose the slimmer readable one.  Easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Bingo","reviewDescription":"Just what we needed. Thank you Amazon","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Works!!","reviewDescription":"So far so good! It worked right out of the box no pairing necessary.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Works like new","reviewDescription":"Cheap and effective. No BS. Just pop in the batteries and GO!  Automatically marries to the tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Works great","reviewDescription":"Works great. I have had it for some time and have no issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Easy set up","reviewDescription":"Great remote! No issues and no set up, insert batteries and u r all set","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Good replacement remote!","reviewDescription":"It’s a good remote, the volume and channel buttons are a little louder than the original.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Hassle Free replacement!","reviewDescription":"Our original tv remote just stopped working one day - oh the horror! I ordered this, it came within 2 days, it is the EXACT same. I just put batteries in and it worked. I didn’t need to program or do anything to set it up, I was shocked. So easy. You’d never know we changed the remote.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Llego rápido","reviewDescription":"Llego rápido, bien embalado y compatible con la tele","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Disappointed","reviewDescription":"This remote looks just like the original,  but it's not really.  For it to work you can't be more than loke 5' away from your TV at most. And you also have to have perfect line of sight","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"The buttons stick and do not work properly","reviewDescription":"The buttons on this remote stick very badly and don’t function properly. I can’t move my apps to where I want them and I get frustrated every time I use this remote. What’s even worse is that I have decided to go back to the remote that came with my TV but now I cannot unpair this one. So I am stuck with the worst remote ever","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Very low quality","reviewDescription":"It functions adequately, but the material quality leaves much to be desired, as it's constructed from low-grade plastic that feels very unpleasant to handle.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"It does not have a volume button & the cover was a bear to remove","reviewDescription":"I've read numerous reviews saying they can't get the cover off to insert batteries. Me included. I have a disabled left hand to boot. No one from Amazon helped. Finally I took a chance, placed it on my palm upside down and pushing the remote in the opposite way.So I finally got the batteries in. Only to learn that there are no volume control buttons. I could care less if it has useless app buttons, such as Netflix & Prime,  since I can always access apps from within the TV. All that volume button controls is mute and unmute, w\/o a volume control. I haven't a clue what the single single channel button controls.  It also lso no up and down. Completely useless.I'm hoping there is a way, because although some had problems most didn't. I am guessing this is probably more a problem with the lack of instructions than the remote design. Still unless the company who designed this contacts and helps me, the remote will be returned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674950400000}
{"reviewTitle":"Buttons are frustrating","reviewDescription":"Buttons and wheel are frustrating. They need multiple presses and hard presses. It makes your TV watching experience worse. Specially when you need to traverse through multiple options or fast forward\/backward.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Very small and unsubstantial","reviewDescription":"I felt like it was sort pf cheap feeling amd looking. It did not work. I put 2 sets of batteries in it and still nothing. It is going back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Doesn’t work well","reviewDescription":"It didn’t last more than a few weeks. After a few uses, one of the buttons stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Not very responsive","reviewDescription":"Unfortunately this remote is not very responsive and not the same as the original in all features.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Button stops working","reviewDescription":"I purchased 2 of these and both times the left button stops working within weeks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"The remote is not working properly","reviewDescription":"The remote from the beginining was not always connecting to the the tv. The remote needed  the batteries to be replaced constantly. I do not like this product just ordered myself another brand","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Works as Described","reviewDescription":"They work fine out of the box bought three of them for different Samsungs. If you do have an issue where it says it's not connected to your TV ignore it for two or three seconds it comes back it seems to only happen when our dog or somebody sits on it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Very Happy with the product","reviewDescription":"My puppy chewed our solar remote which was the same one as this one but had a solar charging back to it. I ordered the solar remote again for over 100 dollars and it stopped working. I was so upset because I didn't want to spend that kind of money again so i ordered this remote and as soon as we put the batteries in it was already connected and ready to go! Much better than the solar because it's annoying to charge it and you have to wait. The remote came quick, is compatible with my QLED and works great. Im very happy","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1664496000000}
{"reviewTitle":"Works as advertised - just add batteries","reviewDescription":"I lost original OEM remote within days of buying my Samsung tv. Price to replace at the time was $100…This works just as well as original and no setup required. Just plug in some AA batteries","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Lost our remote","reviewDescription":"The original Samsung remote was so small it kept getting misplaced. Ordered this one and it worked as soon as it had batteries. It’s a little thicker than the original so it’s less easy to misplace.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Great buy for the money!","reviewDescription":"Worked immediately after installing batteries. No need to program it or anything.Price really good as well.Has slight difference in button feel but nothing major.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Samsung Perfect!!!","reviewDescription":"Have 3 Samsung TV's.  From QLED to cheapo's.  I bought this because the cheaper samsungs has the worst remote on the planet.  I bought this because it is a very familiar layout for the nicer Samsung TV Remotes.I was upset that this came with NO Instructions. Silly me, this thing just WORKS.  No programming, codes, etc.  It just works with all my TV's.I could see an issue if you have multiple tv's in the same room since this will turn all of them off since your not syncing to a specific TV.BUT i'm super happy with it.  5 Stars.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1647734400000}
{"reviewTitle":"Works just fine","reviewDescription":"Works fine with my Samsung","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"No programming needed","reviewDescription":"It’s exactly what it’s intended for. Nothing sketchy. I pressed the power button just to see and it immediately turned my TV on. I have had no problems with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Point and click.","reviewDescription":"Unit was easy to program. I lost my transmitter,, and my TV has no buttons on it anywhere. I bought 3 remotes, programmed them all, put one at the head of my bed, one on the shelf at the foot of my bed and velcro strip one on the back of the TV. When I come in, I turn TV on with velcro remote, change channel with shelf remote and use headboard remote to turn TV off when I go to sleep...","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1662163200000}
{"reviewTitle":"Very convenient","reviewDescription":"very convenient and easy to use, I was a bit confused with the volume and Chanel  Botton but once I figured that it goes up and down instead of left and right I thought it was cool the way it was done .Recommended for easy use and convenience","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Quick replacement, mid quality","reviewDescription":"We've had the remote for less than a year, and it is getting difficult to press some of the buttons. Sometimes the buttons \"feel\" like they press\/click, but it doesn't actually register. Random directions on the \"wheel\" directional buttons will be easy while the opposing sides will require a lot more force. We don't even use the TV this is for everyday, so it's not exactly from heavy use. I'd look for a better one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Button don't all work","reviewDescription":"The remote looks like the Samsung original remotes except it does not have voice search. My issue is that one of the buttons does not bring up the menu for the 123 button with three cooked dots.This is the second of these remotes I have purchased. I got it three first onefor my wife so can control volume and change programs. She never uses any other features so she never used the 123 button. I use it on mine but the new remotes do not activate the 123 button. It doesn't work on either of these remotes. I bought a new one for me, when my puppy got hold  of my original and chewed off the IR signal on the remote, so it no longer works on any controls for my TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"once you get the cover off and put batteries it is great","reviewDescription":"To get the batteries in1. Remove the front lenses (use a knife and pry it off)2. Use a thin knife around the enter end pry open ( it will stick about the middle section  (be aware the volume & volume buttons may pop out (replace same (may go in backwards easy to check)3. Pry the battery carrier out - the unit may open with either the battery carrier stuck or opens the right way4. Install battery (not right way as shown in the diagram - note they are a little loose)5. Check the fit of the rubber buttons and all the hard buttons in place6. snap closed ( if the volume and ch buttons are backwards ( one of mine was open again and turn around)7. Replace the lense8. It works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Works ok in a pinch, but not the best quality.","reviewDescription":"The remote that came with our Samsung television quit working after about 3 years. I had a difficult time locating a reolacement and came across this one. I appreciated that it was inexpensive, but I guess you get what you pay for. It synced with our tv quickly, but it seems like we have to re-sync it almost every time we use the tv. It also doesn’t seem to be made with the same durability if materials as our first remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"It works but feels wrong","reviewDescription":"The remote works but the volume and Ch buttons are \"clicky\" they are noisy y sometimes it takes more than 1 try to recognize the inputThe wheel buttons are noisier than the original remote that came with the samsung TV and sometimes you have to press it more than once aswell","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Works with a few turn-offs","reviewDescription":"Looks and feels like the original Samsung remote. However, the frequency broadcast is narrower. This means you will have to aim directly at the TV without obstacles. The original can be pointed backwards and control the TV. My next issue is the keys need a firm press, like a very firm press otherwise it won't register... This firm press and direct pointing make it very frustrating to use.. 1 month later in still using it like my last remote.I would choose something else if I could do it over.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Works but clunky","reviewDescription":"The remote works fine. The buttons on parts of the controller are clunky when you push them. The signal from the remote to the tv is weak at best. It has to be directly pointed at the sensor on the tv to work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Works but buttons are hard.","reviewDescription":"Had to get a replacement for my mother's tv since she mashed the buttons and they kept sticking on the original. The new one works fine and the buttons are more pronounced but they are a bit hard to push down on, especially the left and right button. So it's a 3 star for the annoyance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Defects on key buttons","reviewDescription":"I never write reviews on products at all but when I order something new and it arrives as if it’s second hand then I’m not happy about it. It took me a good 10 min trying to open it to put batteries in because it doesn’t lock perfectly. Then I saw the defected key button. Someone just didn’t double check the product before shipping.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Lego Bricks","reviewDescription":"It works for a bit and then you have to push the directional buttons so hard to register the keys it makes it feel like you've put together a 3000 count lego by the end of the night.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"This remote needs to 'warm up'...","reviewDescription":"About 80% of the time, this remote does not work when the tv is turned on. It could take upwards of 10 minutes before the remote will connect with the tv (yet it turns the tv on). We've tried everything we can think of yet still cannot get it to work consistently!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"It stopped working","reviewDescription":"It stopped working after a year of use, impossible to navigate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Does not last","reviewDescription":"The forward button gives out after 3 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Buttons sunk in & hard to push down","reviewDescription":"I liked that it works for my 50” Samsung smart tv. I dislike the fact that it is made to look like an original manufacturer part but it likely is not. Yo have to press the power button twice to turn on the tv. You have to fidget with the left side of the ring button that surrounds the center circle button because it is severely sunk in. Not too happy with it but it isn’t worth the hassle of returning. I’ll just order an original Samsung remote soon!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Some buttons stopped working","reviewDescription":"Not the best quality, don't recommend. Some buttons don't work anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"TV remote worked mostly the same, but I could never use it to adjust my volume","reviewDescription":"My audio setup is a little complicated, I am using a Sonos Soundbar, and it needs IR signals to adjust the volume.  I wasn't ever able to do that with this remote (even though the remote that shipped with 2 Samsung TVs worked just fine).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Not that great","reviewDescription":"For some reason it will disconnect from the TV.  You will have to wait a couple of minutes to get a connection.  There is no voice search feature on this, so searching for anything will have to be typed in.  I wouldn't consider this remote.  Keep looking.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"The Buttons Stick and Have to be Pushed Repeatedly","reviewDescription":"It took me a while to realize this, but I found myself repeatedly hitting a button to activate a function. The circular ring button often stuck when I pushed it to navigate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Stopped working good","reviewDescription":"The left and right directional buttons only works sometimes.  Worked great for about a month.  Tried replacing batteries but not working good.  Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"Buttons do not work smoothy or easily","reviewDescription":"The remote works if you have the patience to deal with the control buttons.  Most of the time none of the buttons work the first time unless you are really careful to press it just so.  Even then it's a crapshoot whether the TV will do what you think you are telling it to do.It's junk.  Look for a different one.  I gave it 2 stars because it does communicate with the TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Is your TV 5 ft from the couch?","reviewDescription":"If so, then go for it. The range is so small that it's impossible for us to use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652918400000}
{"reviewTitle":"Cheap imitation of original.  You have to press hard on buttons.","reviewDescription":"Buttons had to be pressed hard to work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669939200000}
{"reviewTitle":"Lags","reviewDescription":"This remote lags and is very inconvenient","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Faulty after the first 30 days","reviewDescription":"The buttons stopped working after using for about 1 month","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Buttons don't respond well","reviewDescription":"Buttons have to be pushed hard and don't respond well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"This remote constantly unpairs from tv","reviewDescription":"Not a good product for any money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659398400000}
{"reviewTitle":"This is not IR controlled","reviewDescription":"This is not the IR controlled remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"Direction Control quit working. Remote Control useless. Just after Return window closed.","reviewDescription":"See title. Sums it up","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668470400000}
{"reviewTitle":"Buttons quit working in one day","reviewDescription":"Product not worth price","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668643200000}
{"reviewTitle":"$17 for a remote that doesn’t come with batteries?!","reviewDescription":"I quickly purchased this remote before seeing the same one from other sellers, for literally half the price, same shipping speed. My lost. However I was EXTREMELY disappointed once it arrived with no batteries.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"Tv remote","reviewDescription":"This remote was very hard to open for put no the batteries.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684195200000}
{"reviewTitle":"Didn't last long...","reviewDescription":"I was very pleased at first, but now I'm having a lot of trouble with side to side scrolling. It's not even 3 months old and I'm already needing a new one..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676764800000}
{"reviewTitle":"DIDNT WORK!!","reviewDescription":"This remote control did not work on our Samsung smart TV. I had to return it and get my money back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679097600000}
{"reviewTitle":"Have to buy a new one due to the layout of the buttons","reviewDescription":"After a couple of uses, found out the button layout of this remote control is different from the original one I am used to. Netflix, Prime Video, and Samsung TV plus buttons are below the volume bar instead of above. Not comfortable using that and decided to throw it away and buy a new one with the same layout as the original one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"Only worked correctly for about a month","reviewDescription":"This remote worked fine for about a month, but then gor some reason I had to start pushing the select button several times to get the TV to respond.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671148800000}
{"reviewTitle":"Would not recommend","reviewDescription":"Looks exactly like the Samsung remote i neededHowever, the circular button going left, right, up or down, rarely works!!Volume works fine, back button is fine, power is fine, just the dang circular button, the one I need the most hahaIt did connect to the TV and Roku","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658880000000}
{"reviewTitle":"No funciona como dice","reviewDescription":"Solo sirve para cambiar los canales no sirve para Netflix u otra aplicación","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"Pass on this one.","reviewDescription":"Works , but is a terrible device.  Push left 10 times to move once.  Or 2 times to go 4. And so on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670803200000}
{"reviewTitle":"Buttons wore out quickly","reviewDescription":"Remote worked fine, but the volume buttons wore out after average use after just a few months. Poor quality \/not durable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"Functions fine, frustratingly low quality","reviewDescription":"It works like 80% of the times on the first go. Remaining 20% you gotta push the buttons multiple times. Made of cheap plastic. When I try to extend the control to my console connected to the tv, it is an absolutely trash experience (unlike the original remote which worked seamlessly).","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1644192000000}
{"reviewTitle":"Product has no instructions","reviewDescription":"Product didn’t come with any instructions. Should have provided battery","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Poor connectivity","reviewDescription":"Worked... sometimes. I often had to press buttons multiple times to get a response, or sometimes it just didn't work at all. Too unpredictable and I had to return it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1656547200000}
{"reviewTitle":"Slow response","reviewDescription":"Not responded immediately when command was applied!Slow!I have to press multiple times to get a response,Could be better","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663200000000}
{"reviewTitle":"Works but Have to reset","reviewDescription":"Works but is slow at some task cant use on xfinity box at all, it is so slow there. Volume control works but again really lagging. works well enough to get you by. will buy the more expensive one from Samsung soon. Have to reconnect it daily, doesn't take long but shouldn't have to.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"Not bad","reviewDescription":"The remote is not high quality and the buttons don't respond sometimes. I have to press some of the buttons twice or more to make them work. Anyway it is not bad purchase for the money spent","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647129600000}
{"reviewTitle":"Works great but doesn't have Bluetooth so it's just and ir remote.","reviewDescription":"The remote works great if you're in front of the TV. It's unfortunate that it doesn't have the Bluetooth technology in it so you could use it for any room like the original remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647388800000}
{"reviewTitle":"Not universal","reviewDescription":"Not universal!! My original remote broke. We I tried this one on certain functions .. like turning on the cable box this remote says use the original remote. I can’t it’s BROKEN that’s why I bought the “universal remote “","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"It worked immediately when I got it.  Stopped working couple of weeks ago","reviewDescription":"Too hard to work with, only worked for a short time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"Not a great replacement","reviewDescription":"Doesn’t have great range and you have to really push the buttons in with more force than should be necessary for it to register. Also, the art display does not work for the frameTV","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645228800000}
{"reviewTitle":"It does the job","reviewDescription":"Overall it does the job but quality is very poor…  volume and channel buttons are wiggly… I just got it so have no idea how long it will last…","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657843200000}
{"reviewTitle":"Works well","reviewDescription":"As advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Easy!","reviewDescription":"Synced with my TV immediately. Soooo easy and for a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Works perfect","reviewDescription":"Work great for tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Love!!!!","reviewDescription":"The original remote for my TV had several buttons that had stopped working. This remote is amazing! I just put the batteries in and pointed it at my TV. No syncing, no programming. Works great! So glad I bought this. Worth every penny.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Very good","reviewDescription":"Works perfectly with my tv, the remote feels very smooth and a lot better than others. As for battery, that just depends on what batteries you use. The sleek design of the remote is also very nice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Works flawlessly","reviewDescription":"My dog has decided this is her new favorite snack 🙃. I have gone through 3 in a week. I'm glad they are a good price. Practically identical to the one that came with the TV. Light weight, fits well in your hand. Easy to use. Literally just popped in batteries & it worked.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Perfect replacement","reviewDescription":"I bought this because I prefer this remote over the older style one that came with our 7000 series tv. Received it  put batteries in and it worked with no programming involved. The tactile feel of this is remote is much easier to use rather than the traditional button remote.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"50TU690 It works!","reviewDescription":"Although it’s not specified this remote immediately paired up with my 3 Day old Samsung 50” TU690T Crystal TV. The remote that came with TV is a nightmare to use.  This replacement is easy to use and not toosensitive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Great","reviewDescription":"Found original","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"👌🏻","reviewDescription":"👌🏻","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Buttons don't work","reviewDescription":"Would give 5 star but Amazon and Netflix buttons don't work.  When asked why,  we were told our TV is too old. Funny thing,  brand new Samsung TV. How is it too old?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614556800000}
{"reviewTitle":"Functional issue","reviewDescription":"Remotes works tv but could not get it to work direct tv receiver or sound bar. Also Netflix and prime video buttons don’t work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615161600000}
{"reviewTitle":"Good little remote","reviewDescription":"This remote worked just fine except the netflix and prime buttons did not work at all so I am sending back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617667200000}
{"reviewTitle":"Not satisfied with quality","reviewDescription":"The device is not stable. It is often necessary to give a command several times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"It works but not Amazon Prime button","reviewDescription":"OK product. Amazon Prime button does not work. Otherwise, replaces old remote enough to get TV working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619913600000}
{"reviewTitle":"It’s ok","reviewDescription":"Looks just like the one that came with the TV, but it’s sluggish operation","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613952000000}
{"reviewTitle":"Not a true Samsung remote","reviewDescription":"Have to resend to tv every time I turn the TV on","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1608940800000}
{"reviewTitle":"Sometimes works bad, i don't kow why but that feels like low quality product.","reviewDescription":"Half quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Easy set up","reviewDescription":"Easy set up just add the batteries and go.  Unfortunately it only worked for 10 months at least at the price it’s easy to replace.  You get what you pay for.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Functionality","reviewDescription":"Does not always respond to the functions when button pushed!","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"It’s ok…if you don’t mind sticky buttons.","reviewDescription":"Couple of the buttons stick which is pretty irritating. But it does turn the tv on and off and lets you navigate as you need. So it’s pretty ok.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Fine BUT not","reviewDescription":"It works for the most part, but is not totally compatible so you can not enter password for YouTube or others, so I would NOT recommend as a fully compatible device.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Cheap Knockoff","reviewDescription":"I wasn’t expecting much and I wasn’t disappointed. I purchased this in Jan and as usual I wait awhile before posting a review. It is now July and time for a review. First, the back cover is difficult to remove for battery replacement. Second, the distance from the TV is a lot less than the Samsung remote. Third, the volume control quit working. All other features work. Of course it came with no warranty and a 30 day return window. I would never purchase this except it was $15, but you would be better off with an original Samsung remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"didn't last two weeks, quit working","reviewDescription":"liked it is small, easy to  work. it didn't last two weeks one button stop working then another and then all quit","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"Netflix and Prime Buttons Do Not Work","reviewDescription":"The remote is good and it has a quicker response with the TV than the original Samsung remote control. As other reviewers mentioned already, the Netflix and Prime direct access buttons do not work. My original remote did not have them, and I imagine this might be the cause.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686960000000}
{"reviewTitle":"This device do not work.","reviewDescription":"This device would not work, returned it for a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Not Really Universal Since It Only Controls The TV.","reviewDescription":"Everything works fine on the remote plus it has the Netflix and Prime Video buttons that my original didn't have. So if you only need it to control the Samsung TV I think it's a great replacement for the price. But if you have a soundbar or receiver it's not going to change the volume for you even if it is a Samsung. I thought since it said universal I'd be able to add my Samsung receiver.So again if you just need a remote for your TV functions it's a great deal. All the buttons work well even the Netflix and Prime buttons. You will have to point it directly at the TV also which most people are going to do anyway. I'm happy enough with my purchase and having a nice spare remote. I can live with using the Comcast remote to change the volume.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651795200000}
{"reviewTitle":"worked ok","reviewDescription":"worked fine when picking what we wanted to watch but the volume and channel button didn't work right maybe just my tv.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Has a bad button","reviewDescription":"Has a button to take you to Rakuten for some reason. Didn't even know that's a thing. Button is useless.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"It’s getting the job done.","reviewDescription":"My dog was upset I left her at home so she decided to eat our TV’s original remote. Found this one on Amazon. It’s been ok. The power button has to be pushed multiple times to keep the TV on and all the buttons from the original one aren’t on there. Somethings take a few extra steps to get to. Setup was easy enough. Popped some batteries in and it work immediately. Not bad for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683072000000}
{"reviewTitle":"Have to hit main buttons 3+times to work!","reviewDescription":"This remote looks just like the original, but the select button (in the middle) has to be pressed at least 3, if not more times to get response to select whatever. The three buttons at the bottom, that say, “Netflix”, “prime video”, and “Rakuten” don’t work at all! So instead I just go the long way to get to them. Vokune works good. Unfortunately, I waited too long to return, as I was willing to tolerate it. My husband-not at all. So I am keeping it and ordered another.  But be careful! It’s not the <$15, it’s the principle.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Most buttons do nothing","reviewDescription":"Top right button and all 3 bottom buttons don’t work. There’s no way to change input sources with this remote, I have to go get the other remote from the bedroom to change it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Get ready for carpal tunnel","reviewDescription":"The design of this remote is very similar to the OEM for Samsung TV's, but it lacks responsiveness. In order for the tv to register a button push you have to push the button multiple times, angle the remote \"just so\" and keep pushing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Buttons just won't press most of the time","reviewDescription":"I don't know if it's a lack of button sensitivity or a problem with the remote's connection to the TV, but about 80% of the time I have to push a button 2 or 3 times to get it to respond. In addition, for some reason it doesn't have the ability to clear the TV's cache - on the remote that came with this TV, I could hold down the power button for 30 seconds and the TV would reset its memory. On this if I hold down the power button it just turns off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668211200000}
{"reviewTitle":"Ok remote","reviewDescription":"Works good unless you want to go right then nothing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Buttons stopped working after six months (I use forward and backward clicks a LOT to skip ads)","reviewDescription":"Buttons stopped working after six months (I use forward and backward clicks a LOT to skip ads)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Probably better options","reviewDescription":"It worked alright for a year, some times it would only work from pointing it at different angle? It’s cheap but you’re deff getting what you paid for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Buyer Beware","reviewDescription":"The buttons are way too hard to press & I always have to aim remote directly at the TV to work. Plus it is super hard to open the back the first time to put the batteries in.  Thank goodness this is a second remote and not a replacement one.  If it was the latter I would have ordered a different brand remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672012800000}
{"reviewTitle":"Poor quality","reviewDescription":"The remote looks like the original but it functions poorly.  After one week the large function button was difficult to depress - sometimes it worked and sometimes it did not.  This unit is much more sensitive than the original remote that came with the TV.  It needs to be pointed directly at the TV to make changes using the back button.  Very frustrating to use after not giving positioning a second thought after years with the original remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668729600000}
{"reviewTitle":"Remote function work great but poor design.","reviewDescription":"The remote funtion work great but it wont close properly with the AA battery. I will continue try to force close it. Hopefully,  it wont break.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Stops working well after only a few months","reviewDescription":"Not a bad option for the price but I’d recommend buying 2 because it began to work less and less after about a month and a half.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"So so","reviewDescription":"It works, but I am unable toControl the Sonos volume to my speakers.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Use?","reviewDescription":"Feel used and doesn’t communicate with tv property","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Cheap but ok.","reviewDescription":"The main concern I had as I waited for it to be delivered was whether or not it would pair up with my TV. When it arrived, it took me two or three tries and it paired up.  What I like about it is it’s size and shape, but if you’re like me and you manually type searches in YouTube, Netflix or Amazon video, it leaves a bit to be desired.  The circular directional button for which navigates to each letter for your search is a bit hard to press, and rather than it pressing down like the Samsung remotes, you have to press down pretty forcefully and it makes a little “click” sound, and feels like it broke each time.But that remains to be seen, and for $10 bucks, I’d say it was worth it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"Price was okay, quality questionable","reviewDescription":"I lost the Samsung remote and couldn’t find it so I ordered this. From a far? Yeah it passes. In your hand? It’s very obviously not a Samsung product and it feels almost comically cheap. Functionally, it does what you’d expect it to do but (at least mine) doesn’t work from some angles you’d expect it to.. The button clicks are weirdly loud and clunky. The size is about right and the device almost looks identical to the original. The battery life seemed on par with expectations. Just using it left a lot to be desired. I’ve got it in a drawer in case I need a backup but if I had to do it again, I’d just buy the Samsung one 🤷🏻‍♂️","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"Almost","reviewDescription":"It works but only with IR. There isn't any bluetooth connectivity which I just didn't realize before buying. So this one you have to point at the tv to work. Once in a while my tv would ask me to pair the remote but that's impossible with this one so that was annoying. I don't know if there is a way to shut that notice off, I didn't look. The buttons work fine, the clicks are a lot louder but still fine for what it is. We ended up ordering an oem remote but will keep this as a backup for when the kids lose the real one..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Buttons hard to push","reviewDescription":"I have another Samsung TV with same style remote that came from the factory. My TV my other room has a different style remote so I decide to buy one just like this. This remote while the setup is easy the buttons are extremely hard to push the hate it !!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Works","reviewDescription":"Only works if it’s pointed directly at the tv receiver","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Works for infrared but not bluetooth","reviewDescription":"The description says it has \"function 100% the same as the original\", but that is not true. The original remote uses bluetooth and infrared to communicate with the TV, so you don't need line-of-sight with the TV's infrared receiver. This remote only uses infrared, so you need line-of-sight and you have to carefully aim it at the TV. Also the original remote supports voice control and this one doesn't.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Great for a minute.","reviewDescription":"Ordered October 6th and got over night delivery because remotes these days are getting smaller and smaller and they just get lost to the void as soon as you find them.I got tired of constantly searching for the remote and asking my kids FAM FOR THE LOVE OF ALL THAT IS HOLY WHERE IS THE REMOTE every five minutes.I ordered two for back ups.Opened this one, slapped some batteries in the thing and it worked immediately for my tv. It’s slightly thicker than the original remote to my tv so it doesn’t slide through the couch cushions as easily. So that’s a plus. Still small and gets lost, however I have another back up in a drawer waiting for that day lol.My son just brought the remote to me October 21st (that tells you how long I’ve had it) and showed me the power button fell out. 🙄🙄🙄I have a crawling 10 month old so now I have to scour every inch of the floors to find it so she doesn’t eat it.Awesome. 5 starts for Amazon sending it out over night, and the product working as it should. 3 stars for durability I guess. And 0 stars for the fact I now have to crawl around looking for something super tiny before the human vacuum finds it before me.Wish me luck.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1666310400000}
{"reviewTitle":"Life saver!","reviewDescription":"My Tv was unresponsive until I got this. Works great and was very helpful to have.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Great remote","reviewDescription":"This is a great remote for the price. It’s a generic brand but works just as great!! Save yourself money by just getting this one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Buenísimo","reviewDescription":"Buenísimo","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Better simple replacement for existing remote","reviewDescription":"I loved that this remote was able to work well with our existing Samsung TV, but is a much more simple design without all the extra unneeded buttons. When I’m using this at night, I’m no longer accidentally switching in to a bunch of apps or hitting random buttons. Still works great when navigating streaming apps and settings.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Great Remote Replacement","reviewDescription":"The remote works just like the original.  It was seamless to use this report.  Great!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"I grab this over the original","reviewDescription":"Great remote; I find it easier to use than the original Samsung remote, especially the volume toggle. Honestly, I prefer my Roku remotes for our other tvs with the volume button on the side but we had to get this one for our Samsung smart tv as it's compatible. I'll probably buy another because I don't like the thin small design of the original Samsung remote; this one feels better in your hand.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Perfect replacement","reviewDescription":"Same remote,  same setup, no difficulties getting it to work.  TV recognized it right off.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Works great","reviewDescription":"Works perfectly with both my samsung q70 and q60. Also has the ambient button for easily displaying art. Great purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Batteries in ready to go","reviewDescription":"Easy battery insert. Remote work’s great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Perfect","reviewDescription":"I needed to do away with my clunky remote which came with the TV I bought in 2022. This did not require any synching and worked as soon as I placed the batteries in. The TV I had is no longer being made (should’ve known that’s why Samsung marked it down) but hey, it’s 65 inches of viewing pleasure for me. I would highly recommend this remote. Just ensure you check the compatibility of your tv and this remote as I did.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"remote control","reviewDescription":"works just like the original","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Nice","reviewDescription":"Always good to have a spare on hand. ✅","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Exact replacement","reviewDescription":"Replaced the original perfectly with not a single problem. Same quality too. I would recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Remote","reviewDescription":"Great love this","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Quick and easy!","reviewDescription":"I don't know why I waited this long to order a replacement for my dead samsung remote.  I received this in 1 day, put batteries in, and it was automatically synced to the tv, ready to go!  Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"The exact same remote that came with the television","reviewDescription":"No, no learning curve was needed.The button layout and everything else was identical to the original equipment remote.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Works like the original","reviewDescription":"Works almost exactly like the original Samsung remote minus the voice functionality but for 10 dollars it's the best remote you'll get for a Samsung smart tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"I like it","reviewDescription":"saved my butt I need a new one and I'm glad I found one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"So good, buying twice…and probably again after that","reviewDescription":"Works great. Maybe make a little more resilient to dog attack.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Works fine","reviewDescription":"This remote works perfectly fine with my Samsung’s tv, and very affordable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Fantastic!!!","reviewDescription":"Remote works perfectly!!! Item was packaged very well, back came off easy for battery installation. Setup was a breeze!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Fast and Fantastic😁","reviewDescription":"The remote control came very fast and it works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Fantastic","reviewDescription":"This replaced my nonsense solar powered remote control for my Samsung...stop working or charging by the sun or charging cable...Samsung wanted $70 for a new one...this fixed it seamless for a fraction of the price and can stay working with actual batteries...win","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Amazing setup!","reviewDescription":"Probably the easiest remote to program, I didn’t have to do anything it just worked!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Worked rite away","reviewDescription":"Love it works so good as a replacement","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Great Remote","reviewDescription":"My expectation of this remote was everything I had hoped it would be.  Great decision to buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Works just like the original - INSTANTLY!","reviewDescription":"Given the nature of many “generic”  low quality replacements for remote controls, I wasn’t expecting too much from ordering this replacement remote for our Samsung “Big” LCD TV.  The right arrow in the round arrow selector keypad on our old original Samsung remote had failed working, so the search for a new remote was ON! We settled on this one as it looked outwardly 94% identical except for the shortcut buttons to Netflix and Amazon at the bottom row of the keypad.The remote feels solid and the button action is good.Short version: Plug in a pair of AA batteries and you are back up and running instantaneously! No programming needed,  except maybe for the shortcut buttons to Netflix or Amazon that I would never use anyways!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1685750400000}
{"reviewTitle":"Perfect","reviewDescription":"Works perfect right away","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Perfect","reviewDescription":"Perfect replacement remote","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Easy Install","reviewDescription":"I was skeptical that this remote would work. I bought this, and put batteries in and BOOM, it worked immediately. I didn’t have to do any programming. It just worked. I actually am considering buying a couple more just to have one at every table in the living room. No more searching for the remote.  I 100% recommend buying this replacement remote.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Great remote!","reviewDescription":"Very happy with this purchase, works just like the original. Cannot beat it for the quality and price. Highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Works well.","reviewDescription":"Works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Great buy and value and ship time!","reviewDescription":"My friend's four year old lost our tv remote.Thankfully, this was able to be delivered same day! Works well! 2 AA batteries and it was good to go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Great for when you lose your remote","reviewDescription":"If you find yourself in a situation such as me where your toddler hides the remote so well it’s been three days and you still haven’t found it, this will solve your problems! Not only will it arrive quickly and work well, but you are guaranteed to find the lost remote as soon as you receive it. If you think you’ve looked everywhere and haven’t found the original, be sure to check the bottom of the toy bin in a completely different room, but until then, this is a great replacement!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"It’s working great","reviewDescription":"Exactly what I looking for","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Great Replacement for Samsung Remote","reviewDescription":"This remote is easier to you and then remote came with my brand new TV. Even better it’s difficult to lose the cover over the battery holder on the back is why I had to replace it.i the first place!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Great","reviewDescription":"Worked right out the box, works on any tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Perfect!","reviewDescription":"Didn’t have to do anything to set it up. It worked with my Samsung TV immediately.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great product","reviewDescription":"My dog got a hold of my old one, so I bought this as a replacement and it works great! 😬","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Delivered as promised","reviewDescription":"Promptness","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Terrible","reviewDescription":"Nothing like an original. Lasted like 2 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Doesn't work at all!!","reviewDescription":"This device will be returned with great dissapointment!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Nice looking piece of plastic that doesn’t function","reviewDescription":"Not sure if I accidentally got sent the version meant for my daughter use with her dolls to watch make believe TV… But I received the remote, put batteries in it, and it just doesn’t do anything. Wonderful.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Garbage","reviewDescription":"Not easy to use. Had to press down really really hard. We threw it awsy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Some of the functions\/ buttons doesn’t work.","reviewDescription":"Some of the buttons doesn’t work. Some other are hard to press. Mover gonna recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Poor quality","reviewDescription":"Buttons began sticking and not working slightly more than a month later. It’s not unusable","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Does not work","reviewDescription":"Ordered this after my dog ate the one that came with my Samsung TV, this remote worked the first day and hasn't worked since.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Buttons are iffy","reviewDescription":"Many of the buttons work... sometimes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Stopped working after 4 months","reviewDescription":"Stopped working after 4 months","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Won’t control optical volume","reviewDescription":"Controller generally works fine, but if you utilize external speakers connected via optical, this controller won’t work.  The original Samsung controller automatically controls any external speaker via an optical cable.  This controller recognizes the external optical and even prompts the screen to say optical out, but won’t let you turn the volume up or down.  Would not recommend as a replacement for the original Samsung remote unless you are only using the TV speakers.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669334400000}
{"reviewTitle":"Works like it should","reviewDescription":"Favorable review","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Works as advertised","reviewDescription":"Installed batteries and worked as advertised","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Works perfect!","reviewDescription":"Works great right out of the box, no programming. Very happy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"Worked immediately!","reviewDescription":"Lost the original remote so I bought this and it worked right away w\/o having to program. 2 days later, found the original. Now we have 2 and they both work at the same time. Only difference is this one the buttons are slightly harder push and make an audible click.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Works Great","reviewDescription":"It works great. My TV wasn’t listed but took the risk and bought it anyway. My TV is older so I knew the Netflix, and  Prime buttons would not work anyway. But this was cheaper than remotes listed for my specific TV. Everyone complains about the click of the buttons are louder but maybe that also has to do with its brand new. Maybe over time it will be quieter. I bought this remote because my dog chewed up the original one. Also I got several days earlier than expected. It works for my settings and everything I wanted it to work for. I think someone said it doesn’t have voice control but my voice control on my original remote didn’t work with Netflix and other apps on my TV, so that didn’t bother me. Happy with my purchase. Worked as soon as I put batteries in it. Didn’t have to program or anything.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1623628800000}
{"reviewTitle":"Does it’s job","reviewDescription":"This controller is cheap, good quality and works well. It looks almost identical from my original. It doesn’t have the mic ability but that’s fine because we barely used it anyways. It wasn’t fully set up on our TV anyways. Just put batteries in it and pointed and it worked. Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Perfect, Ready to use","reviewDescription":"Worked perfect for my Samsung Smart TV that I bought in 2019. The remote did not require any programming. Just put in the batteries and it’s ready to go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Easy set up","reviewDescription":"My old remote stopped working as it should. It wouldn’t toggle right. I made the purchase. Just put the batteries in and point at your tv. It works. I purchased after reading the reviews. It doesn’t have a microphone but that doesn’t bother me. I extremely satisfied with my remote which also came with a reasonable price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"Great Replacement","reviewDescription":"For the cost you cant beat it. The buttons are a bit stiff and loud at first but they break in over time. I've had the remote ~3 months with no issues. Bought a few extras for spares at this cost. Thanks!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"OG Remote Tasty For Pups","reviewDescription":"Our original remote met its untimely demise due to our boxer pup. I think she was trying to watch some puppy drama show after we went to bed, but alas her love for noms won out and our poor remote barely stayed connected to the TV. Our replacement remote has been working well. No pup encounters yet.. It changes the app, selects the show, and adjust volume like a champ. Buttons were a bit stiff at first but works quite well now.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1677974400000}
{"reviewTitle":"Worked right away","reviewDescription":"No setup needed. Put in batteries and start using.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Works Great!","reviewDescription":"I've been so happy with the remote. The last remote I had got chewed up by my family's puppy and was no longer usable. This only issues I've had have been when I occasionally turn on the tv it will take a few moments for the remote to connect. that and there's a button that I can't use, the RakutenTV button. Those issues might have to do with my tv, rather than the remote though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682294400000}
{"reviewTitle":"freezes a bit","reviewDescription":"freezes a bit","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Not perfect, but it was inexpensive.","reviewDescription":"The remote arrived with no instructions\/paperwork at all. I was not able to program the Netflicks or Amazon buttons to work even though both apps are on my Samsung TV.It does turn the TV on and off and gives access to the applications such as netflicks, you tube, Amazon ect.The volume button works OK, just a little stiff and sticky. The Channel change button is so stiff that it only \"kind of\" works. All that said, this is an inexpensive replacement and works as I needed.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Slow response time but original cost 70 so this isnt too bad for 10 bucks","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Good, but not great","reviewDescription":"Fewer buttons, so it's far easier to use than the stock Samsung remote.  Have issues with constantly having to push buttons twice to get the TV to respond.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"All basic funstions work as expected","reviewDescription":"Purchased as replacement to original one. All basic functions work pretty well. Except power button which needs to be pressed twice for some reason. Not very convenient but Ok.Buttons Netflix and Prime don't work. Maybe I need to pair remote somehow with TV. Not sure.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"Works, but volume button sticky","reviewDescription":"I sent the first one back because the Volume Up had very little play. You basically had to press down and then up. Even then it only travels very little. Volume Down worked normally. So I asked for an exchange. Got it really quickly! But same issue with the exchanged remote. Not a huge deal, but I thought it was a defective remote. Since both act the same, I guess it's just how they manufactured it. Will keep. Work great otherwise and quickly paired with my TV.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1673222400000}
{"reviewTitle":"Works great!","reviewDescription":"Since my remote basically broke in 2, I needed a replacement and this worked like a charm. I have an older TV and made sure it was compatible first, but very happy to have a working remote again!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1682467200000}
{"reviewTitle":"Works well, one suggestion","reviewDescription":"Put in battery and it works fine.  The power button could have light-colored contrast, similar to the others.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684108800000}
{"reviewTitle":"Great replacement remote one thing though","reviewDescription":"The only thing I can say is that it has no voice control, but other then that it's super great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664582400000}
{"reviewTitle":"Hot-keys not work","reviewDescription":"Everything works good except hot-keys","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669766400000}
{"reviewTitle":"works well but after a while the buttons stick","reviewDescription":"buttons stick after a month or so;  also I may be stupid but it was not easy to put the battery in. I broke one of these trying.  I think there is a better way to load batteries. It's a good price though and works reasonably well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622592000000}
{"reviewTitle":"Another okay Amazon product.","reviewDescription":"Not having to put in a program code for our model tv was handy, but the specialty buttons for prime and Netflix don’t function at all. Another issue I don’t like is needing to push the power button twice for on and off.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626480000000}
{"reviewTitle":"Streaming Buttons Don't Work","reviewDescription":"Purchased to replace my OEM remote that was no longer functioning.  I liked the idea of the streaming quick buttons, unfortunately, they do not work with my Samsung Smart TV.  Disappointing.  All other buttons are working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629504000000}
{"reviewTitle":"Worked good for a few weeks","reviewDescription":"Worked well as a substitute for a few weeks and then buttons started to get stuck and not work as smooth as the OEM control.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"Very Glitchy and slow.","reviewDescription":"I thought this worked with a Samsung TV.  It was so slow and glitchy, I gave up and bought an iOS app.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639440000000}
{"reviewTitle":"Decent but not like the original","reviewDescription":"The remote needs to be carefully pointed at the rv from a closer than normal range in order to work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639353600000}
{"reviewTitle":"Cheap remote but works fine just slow","reviewDescription":"The remote was “okay” it was just a back up one since my original tv remote broke. Everything works but the control itself it works “cheaply” . It work slow not fast like the original remote","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621900800000}
{"reviewTitle":"Has no source button","reviewDescription":"It works well and easy. However, it lacks a source button which is essential our days. Furthermore, Netflix and Prime buttons do not function.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632268800000}
{"reviewTitle":"Extra features","reviewDescription":"The Amazon Prime, Netflix buttons do not work.  Waste of money!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"Good controller","reviewDescription":"It worked right after I turned it on. The only I could not get to work are the little bottom buttons that are just short cuts to pay channels like Netflix. Outside of this works good for me.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1623456000000}
{"reviewTitle":"Works, not as well, but works.","reviewDescription":"It works with my boob-tube aaaaaaand has a couple extra features the original didn't.  Dropped a star because the original would work no matter the direction it was pointed in and this one has to face sensor.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1623196800000}
{"reviewTitle":"Good remote","reviewDescription":"It works pretty well but beware. It is not very durable so if you have kids that like to drop things or knock them off of tables the back pops open and starts to have diff staying closed.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1622592000000}
{"reviewTitle":"Good substitute!","reviewDescription":"A good substitute if you lose or damage your original remote. There is a few seconds delay in the signal between the remote and tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636848000000}
{"reviewTitle":"Lost samsung frame tv remote? This is a good replacement","reviewDescription":"Easy replacement when our Samsung frame remote went missing! Worked out of the box no need for programming or anything. Not exactly like the original but gets the job done!This does need to be directly pointed at the tv to work.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1617840000000}
{"reviewTitle":"the remote was as per the descriptioon","reviewDescription":"no issues, seller was responsive, international shipping went well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656374400000}
{"reviewTitle":"Works well, just a bit small and no “mic” button","reviewDescription":"Good but no mic button","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1656115200000}
{"reviewTitle":"Not very responsive","reviewDescription":"A so so option…Seller did good.Manufacturer need to readjust the remote ,,sensitivity”!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638403200000}
{"reviewTitle":"Great remote","reviewDescription":"Could use a input button but other then that this remote is a great difference. Sleek and it connects to your TV as soon as you available point the remote towards it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618272000000}
{"reviewTitle":"Difficult to use","reviewDescription":"You have to press the center button with purpose for it to work, and the other buttons can be super sensitive. But it does auto-pair, which is nice.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687478400000}
{"reviewTitle":"First remote malfunctioned","reviewDescription":"I am returning the first remote because it’s malfunctioned. The right side of the circle to scroll to the right stopped functioning. I already put in for a replacement device. Hopefully the next one will be more reliable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682380800000}
{"reviewTitle":"Not As Effective As OEM","reviewDescription":"This is an acceptable replacement, but know that the range is nowhere close to the OEM remote... it must be pointed straight at the TV, no blockage, and limited angle.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"Connects, but doesn't have all of the features needed.","reviewDescription":"You aren't able to access a FEW things, that is on the original Samsung remote, such as the Hub, and spelling.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686614400000}
{"reviewTitle":"Not OEM","reviewDescription":"I bought this after we moved because we misplaced the original remote.It virtually looks the same as the OEM version but the volume button is difficult to work with, along with the navigation buttons. For example, when I tap it 3 times to go right, it'll go 4 or 5 spaces to the right which makes it difficult when I'm using the keyboard on the TV. Same goes for the volume controls: you tap it up and it does nothing, so, you tap it harder and the volume skyrockets!Overall, it's just an okay remote... Wouldn't really recommend it though since I have used the OEM version.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653868800000}
{"reviewTitle":"Soso","reviewDescription":"Sometimes it works sometimes don't","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Not a \"Smart\" Remote","reviewDescription":"So, this remote works fine with the TV, and is an adequate substitute for the samsung smart remote.  Note I said substitute, not replacement.  Dispite having a \"pairing\" instruction under the battery cover, this remote in fact doesn't pair, and is IR only.  As a result it is slightly less responsive than the original samsung smart remote which came with the TV.All that said, I'm keeping it because it works well enough, and this TV is a spare\/rec room TV with light use and this remote will function fine for that use case.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659916800000}
{"reviewTitle":"Buttons don't work as well as original","reviewDescription":"This is a poor substitute for the original remote. Looks exactly the same as the old one, but half the time it doesn't do anything until you hit the same button 5 times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"Works….kinda","reviewDescription":"Remote connects to tv no problem. It works, but you often have to push a button 2-3 times before it does. The volume up\/down button is especially hard to get to work properly. Spend a couple extra bucks and get a better one, I wish I had.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677628800000}
{"reviewTitle":"Gt what you pay for","reviewDescription":"This is just \"compatible\" with Samsung TV. It is definitely not the same as OEM. It needs batteries instead of solar recharge. The volume buttons are not well-made. It takes some finesse to get them to work. Otherwise, works as it says.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Works just like the original Samsung remote","reviewDescription":"It's very similar to the remote that came with my Samsung smart tv (except no voice control). It connected immediately with no set up, which was nice. One big flaw in this remote and the original Samsung remote is there's no way to fast forward or rewind at a faster rate on Netflix. If you want to fast forward 20 mins into a movie, it only goes 10 seconds at a time so you have to hit the fast forward button 120 times. Holding it down doesn't do anything. It works fine with other apps like Hulu and Prime. Not sure why there's a problem with Netflix.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613260800000}
{"reviewTitle":"3 across the board","reviewDescription":"I like this remote, its good as a replacement, not as great as the Original but as long as you point this one directly at the sensor your fine, but I mean you have to point it directly towards the sensor or it doesnt really register anything is being clicked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660867200000}
{"reviewTitle":"It work but..","reviewDescription":"I didn't like the curved design.The volume up and down is a hard press.And it didn't have Alexa. That was my fault for not checking the details before purchasing though.Other than that it works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"For it to work","reviewDescription":"The remote doesn’t work very well, you need to push on the center controller multiple times for it to work. I think I need to return for a replacement. 🤨","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670889600000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Out of the box it worked just fine. Then it started to take 2 buttons to get the remote to do any thing. Scrolling through movies I have to select down then down again and the tv finally reacts to the remote. Build quality is good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655856000000}
{"reviewTitle":"The Netflix\/Prime Buttons Aren’t Functional","reviewDescription":"I should’ve looked more carefully at the description before purchasing because then I would’ve known there is no voice command button.  Obviously it’s not an actual Samsung remote, but I didn’t think to look for that button.  The Netflix and prime buttons are not functional.  It’s a good remote if you are in a pickle and can’t use your Samsung remote any longer.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1636934400000}
{"reviewTitle":"Not very sensitive","reviewDescription":"It works,  but you have to be close the to TV and point it at just the right angle. Our old remote worked from another room.  I like that it has quick link buttons for Amazon Prime and Netflix.  If it was just a little more sensitive I'd give it a 5.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Closer to the same thing but leaves much to be desired","reviewDescription":"Decent replacement, especially with one or two-day delivery. The buttons are hard to push so it's difficult for kids to use. The extra features buttons (prime, etc) do not work so it's just a gimmick. Overall, it's decent and good in a pinch since the tv does not have easy-to-access manual buttons.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653091200000}
{"reviewTitle":"Works fine, IMPOSSIBLE to open to install batteries.","reviewDescription":"King Arthur had an easier job drawing Excalibur.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677628800000}
{"reviewTitle":"Works... ok, not great.","reviewDescription":"Works ok. I think the IR sensor is not aligned as I need to angle it to the right, while pointing at the TV,  to work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663459200000}
{"reviewTitle":"Some buttons don’t work","reviewDescription":"The Netflix and prime buttons do not work. Also some apps on my tv it will not open when clicked on. Poor product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"Channel feature doesn't work. Everything else seems to work","reviewDescription":"It works except for the channel feature. Guess I'll have to return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651881600000}
{"reviewTitle":"The volume switch is horrible, you can barely change the volume!!!","reviewDescription":"The volume switch is horrible, you can barely change the volume!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660089600000}
{"reviewTitle":"Volume control and Channel changer bottoms  stick since day one.","reviewDescription":"Volume control and Channel changer bottoms  stick since day one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653696000000}
{"reviewTitle":"Does not pick up the signal easy","reviewDescription":"You have to point this remote directly at the intake signal for it to work. All other samsung remotes work if you have it pointed anywhere in the room. Cheap product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627344000000}
{"reviewTitle":"Does not work unless you are 2 ft from tv","reviewDescription":"I literally have to literally press what ever button two or three times in front of the tv to actually be able to do something. For some reason it does not sync with the tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622505600000}
{"reviewTitle":"Missing major functionality","reviewDescription":"There is no input button. Everything works except there is no way to swap between inputs which basically meant this remote isn’t functional for me. There’s no way to swap between tv and my gaming system or hard drive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617408000000}
{"reviewTitle":"Not a \"universal\" remote","reviewDescription":"Doesn't work for external devices such as surround sound, xbox and so forth like the original.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615852800000}
{"reviewTitle":"Not vompatable","reviewDescription":"Some of the buttons won’t work with the tv","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620345600000}
{"reviewTitle":"Try a different remote.","reviewDescription":"This is to slow and I don’t recommend it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613952000000}
{"reviewTitle":"Good item","reviewDescription":"Gray item works as soon as you load the battery in the one thing it doesn not have is the sprang button did not realized when purchased you should put it in bold not a break dealer but wouldHelp price is great inexpensive","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"Great substitute - middle button hard to press","reviewDescription":"This remote works great but I noticed the middle button can prove to be difficult to work. Sometimes we have to press it hard or multiple times. Every other function works great though! Also… it’s just as easy to lose as the last one LOL","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"Good alternative","reviewDescription":"Good alternative","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"So far so good.","reviewDescription":"It is working so far. Still a little confusing on what does what though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668038400000}
{"reviewTitle":"Works well.. except","reviewDescription":"It works well for our 2015 Samsung model (un65jsxxxx series). The only hiccup and the reason I gave 4 stars instead of 5 is that the Netflix and prime video buttons don’t work with the tv. Unsure if it’s because our tv is considered an ‘older’ model but it doesn’t matter to us (as of now) however, heads up to future buyers who may have same model as we do.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1615075200000}
{"reviewTitle":"It works.","reviewDescription":"Has lag and awkward shape. It works, but when you press a button you may need to wait a few seconds.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"Good cheap replacement remote for the Samsung tv","reviewDescription":"It works.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667606400000}
{"reviewTitle":"Great condition","reviewDescription":"It was shipped on time. Great price and quality","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659225600000}
{"reviewTitle":"put the batteries in and it auto connected itself. no setup neccisarry","reviewDescription":"auto connects, same functions my old remote did. Netflix and prime buttons don't work but I didn't have that before so no disappointment.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645056000000}
{"reviewTitle":"No voice command","reviewDescription":"Works well for a replacement remote.  Only thing missing is the speaker button for your Alexa °","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1650585600000}
{"reviewTitle":"Dogs love it","reviewDescription":"This was a replacement. Lasted a week because my dog didn’t learn from the first one. So now I’m buying a second one. Works better than I expected it to. Volume button isn’t as smooth as original factory one, like it’s kind of stubborn when pushing it up or down, but still works.Would buy again and will probably have to buy again. Love my dog. Lol.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"excellent remote!","reviewDescription":"Once you can get the back, cover off to put the batteries in very good remote. It will test your patience..","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680825600000}
{"reviewTitle":"Great for the price","reviewDescription":"The main reason I gave this a 4 star review is because it does not work as good as the remote that came with the TV. My child broke the remote and we replaced it with this option. For the price it is a great substitute but sometimes when you try to navigate menus by clicking left or right nothing happens.The original moved seemlessly with what I wanted to do but sometimes this remote does not respond to the actions you want. I started using the smart things app more but my kids need a remote to use the TV. I saw the price of the Samsung remote and figured I'd try this instead. I am pleased with this purchase overall and saved a lot of money compared to the Samsung one","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1614988800000}
{"reviewTitle":"Compatible","reviewDescription":"This universal remote is good because it's ALMOST the same as our other Samsung tv, and it's not stupid like the 1980s remote that came with the new Samsung.  The only difference is that volume and channel button row is actually one row (in row of buttons) is actually one row below the other samsung remote.  So if you're using the remote by touch AND comparing it to the other actual Samsung remote, you'll have to keep that in mind, or just look at the buttons.  Other than that it's great and no programming required.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1642118400000}
{"reviewTitle":"Work but it’s a little stiff","reviewDescription":"The volume and channel buttons are stiff so you really have to push them hard (up or down) and that sometimes makes it jump a couple numbers. Other than that it great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675296000000}
{"reviewTitle":"It works well","reviewDescription":"My one concern is that it doesn’t quite feel the same as the original one from the manufacture, when using the keys. Functionally though it works right.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"Works","reviewDescription":"The first one had to be returned because the back would not come off. The second one didn't have that problem and works great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1674518400000}
{"reviewTitle":"It’s okay","reviewDescription":"Remote was easy to program. It works as expected. My only complaint is that it occasionally desprograma itself and I have to hold down 2 keys to reconnect to the tv. It doesn’t happen too often so I decided to keep it for the price and the fact that it’s not hard to reconnect it. Otherwise it works okay.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1669593600000}
{"reviewTitle":"It was easy to pair","reviewDescription":"It looked nice one. We used several weeks or so and my kids dropped it few times . It got broke and we trashed it. To me it should be more durable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675555200000}
{"reviewTitle":"Love this remote","reviewDescription":"Truly universal and worked great for our Samsung tv. Good quality, works as original remote did.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"It does work","reviewDescription":"However, I had to tape the batteries in place to keep them from slipping and having to undo the plastic back to keep the connection","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Confused on Volume!! Need help","reviewDescription":"This is an awesome remote, BUT.. when I try to turn up or down the volume, it mutes immediately. It either mutes or unmutes when I hit the volume button. I’ve never had a remote do this, so I’m assuming I’m doing something wrong when pressing the volume button. You would think it would turn the volume up and down but instead it mutes\/unmutes. Please let me know if this is a problem for others!! Thanks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662681600000}
{"reviewTitle":"Not fully functional","reviewDescription":"Bought this to use with our 2021 Samsung frame TV after my toddler dunked the original in water.No instructions are provided but the description said no programming required, however I can only get it to turn the TV on and off. No other functions. Also the little light does not blink when you press a button which is confusing. Junk sorry to say.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664150400000}
{"reviewTitle":"Starting to break","reviewDescription":"The left directional button started to seize up. Pretty cheap quality. Price is hard to argue with though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Works for a hot second but sucks","reviewDescription":"The quality on this thing is horrendous. Volume and channel switches are almost unusable out of the box and get worse from there","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"Hard to use","reviewDescription":"Only works when you point the remote directly at the TV","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"SAMSUNG UNIVERSAL REMOTE CONTROL","reviewDescription":"The control is easy to use and its commands are excellent, unfortunately the volume button is too hard, and it is difficult to increase the volume, it must also be said that although its finishes are very similar to those of the Samsung controls, the quality of its material,  is quite poor and sometimes noises are generated when using the buttons.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657152000000}
{"reviewTitle":"The remote does not change the TV channels.","reviewDescription":"My TV is a Samsung model QN75QN85AAFXZA. It is on the list of models compatible with this remote;however, no matter what I try, the remote does not change the TV channels. Very disappointed and returned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Volume control only half works","reviewDescription":"Volume control key does not increase sound.  Only decreases.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Volume button is stiff & signal to tv is very poor!","reviewDescription":"Volume button is stiff & signal to tv is very poor! You have to get really close and point several times before the button works. The quality & feel of the buttons is cheap!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Works as expected","reviewDescription":"Works without having to spend time programming anything.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Samsung replacement remote","reviewDescription":"Works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"Works just like the OEM one","reviewDescription":"The OEM remote is solar but very expensive. I bought these low-cost battery operated ones and they work the same as the OEM one. The OEM has speed buttons: Netflix, prime video, Samsung TV plus, and Disney. This one comes with: Netflix, prime video, and Rakuten TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"Works great with any TV","reviewDescription":"I have a pet that keeps on taking these in hiding them or take them out and join them up so make sure you play at least three","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Worked right out of the box","reviewDescription":"To my surprise, this remote worked right out of the box as soon as I put the batteries in.  I have another TV that I lost the remote for and you had to program the new remote to work with it - this one didn't require any programming.  My Samsung Frame recognized it right away.  Good buy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Easy to use","reviewDescription":"This came ready to go. All I had to do was point it at the TV and it was ready to go! And it’s so much better than the original remote for the TV. Went from 40 buttons to 10! Remotes shouldn’t be complicated.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1683676800000}
{"reviewTitle":"Works","reviewDescription":"It was a match for the solar tv remote I needed to replace which was no longer charging, rendering my tv unusable. Now all I’ll need to do is replace the batteries","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1687132800000}
{"reviewTitle":"Easy to sync, easy to use, and looks great!","reviewDescription":"We love our new remote that was way easier to sync than I could have imagined. We unwrapped it, put batteries in it, synced it, and are now in business. With toddlers in the house, it’s always good to have extra remotes so we’ll definitely come back for more if this goes missing!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Worked right out of the box - just added batteries","reviewDescription":"Was a little concerned that the remote wouldn't work on my tv but this was a seamless replacement after misplacing my remote several months ago.  The battery compartment also seems to have been crudely modified to make it easier to slide down.  It's an awkward to open but feels great in the hand for easy control.  Very happy with this one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1678492800000}
{"reviewTitle":"Perfect!!‼️This remote works like a charm.","reviewDescription":"At first I was skeptical about this purchase because the price was so much lower compared to the original remote replacement for my tv which is well over $100.  I am glad I took a chance and tried this one. It is simple to use, no programming of any kind. All I did was add 2 AA batteries and we were back enjoying our tv channels and apps.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"Hardly works","reviewDescription":"Got as a replacement to the original remote- looks almost identical, but hardly ever works. It seems like it cannot connect to the TV unless you angle it correctly, so its very hard to use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Does the job!","reviewDescription":"I bought this to replace a lost samsung remote. The remote works, but the shortcut buttons for things like Netflix, do not work. Also the tactile feedback you get when increasing the volume is super stiff and has little travel.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"Play\/Pause button doesn’t work","reviewDescription":"I have the original remote for my Samsung TV and it still works but it’s the one with a billion buttons on both sides and my kids are always accidentally pushing buttons they don’t mean to.I got this remote because it’s the same as my other Samsung TV and my kids are familiar with it.It works right out of the package which is nice but the play\/pause button doesn’t work and since it came with zero instructions I don’t know if there is a way to troubleshoot it. We shall see I guess.Maybe I’ll edit my review later if something changes. For now it’s just gonna have to do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632700800000}
{"reviewTitle":"Buttons hard to operate","reviewDescription":"It is not nearly as smooth as the original Samsung remote that came with the tv. Volume and channel buttons are hard to push, and side\/up or down button requires multiple tries to respond.As a positive, it paired with my Sonos bar, which the origami remote would not do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671235200000}
{"reviewTitle":"Works for apps, not for cable","reviewDescription":"This worked out of the box for cable and tv functions, but the cable functions stopped 2-3 days later. I’m glad we can switch between streaming and such again with this, but not being able to change the channel on cable is frustrating. We had some channels “favorited” and just get an error saying to use our Samsung smart remote.If you just need this toggle between streaming\/tv and change the volume, this would be a 5 star product for you.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640304000000}
{"reviewTitle":"Meh","reviewDescription":"Barely gets the job done. Have to push multiple times for it to work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"The volume button is broken to turn volume up have to press very hard but everything else is great","reviewDescription":"The volume button is broken to turn volume up have to press very hard but everything else is great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Worst design ever","reviewDescription":"Whoever designed it, should be fired. It is next to impossible to get the back of the remote off, to replace the batteries.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"different from the original","reviewDescription":"The remote doesn't have a button to talk into like the original remote. The remote is also a lot less sensitive and HAS to be pointed in the direction of the tv. First remote was not like that","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664928000000}
{"reviewTitle":"Very unresponsive volume control","reviewDescription":"The remote connected without any effort and works well except it takes a really long time to increase or decrease the volume. It's really weird. The icon shows on the screen but the volume barely changes. I think the increments are just really small for some reason and I'm not sure how this is effected by the remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655337600000}
{"reviewTitle":"Hit and Miss","reviewDescription":"Purchased for the Crystal 7 Series, did not program immediately. I had to change some backside tv settings and it finally worked - but its hit and miss. It powers up and off no problem, but then it will quit working and I have to use the original remote that came with the tv. I like the simplicity of this remote, its not full of buttons that you have to look at when wanting to change channels or programs. Just wish it worked 100% of the time","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607472000000}
{"reviewTitle":"Poorly Made","reviewDescription":"Very bad experience, clearly we can say its poorly made. Especially after using it, i am really disappointed with quality. The buttons are very hard to press.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659657600000}
{"reviewTitle":"Remote Buttons Don't work Properly","reviewDescription":"After a few months, the remote still worked - but you had to press the button's very hard to get a response on the TV.The netflix button also didn't work as advertised.Just ordered a generic replacement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655683200000}
{"reviewTitle":"Keep clicking...","reviewDescription":"Requires multiple keystrokes (at times) in order for it to work.Horribly light\/cheap device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Remote don’t work on tv !","reviewDescription":"Remote came broke","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"Doesn’t register your input.","reviewDescription":"Some buttons require a more firm click. Sometimes it just doesn’t register. Very annoying. Will not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"Additional buttons does not work and there a delay on all functions","reviewDescription":"Additional buttons does not work and there a delay on all functions","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"Battery installation - A challenge!","reviewDescription":"Separating the 2 halves so that the batteries can be inserted is nearly impossible!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Netflix, prime, and roku buttons do not work.","reviewDescription":"It works out of the box for my TV but the netflix, prime, and roku buttons DO NOT work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657584000000}
{"reviewTitle":"It works ok.","reviewDescription":"Moving the curser to the right is difficult  and it takes a while after TV is on to start working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660521600000}
{"reviewTitle":"Okay","reviewDescription":"Losses connection every now and again. Not made by samsung fyi.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626393600000}
{"reviewTitle":"Malfunctions","reviewDescription":"Hardly works","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634515200000}
{"reviewTitle":"Faulty!","reviewDescription":"Picture, Netflix, prime video, and rakuten tv buttons do not work","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1605830400000}
{"reviewTitle":"Doesn’t work for our tv","reviewDescription":"Tried it on our Samsung it only worked to turn it off and on did not change or anything else. Unfortunately, it’s past the return window.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"One button missing and two buttons that do nothing","reviewDescription":"I received this remote yesterday. Upon inspection this remote doesn't have a button for a microphone and it has a Rakuten button that doesn't do anything as Rakuten is no more. The button on top to the right doesn't do anything either. The Netflix and Prime buttons do workI wouldn't have purchased this remote had I realized that there is no voice command button and that two they buttons do nothing. At least replacement remotes are inexpensive so I'll most likely purchase a different one.I'm really surprised by so many 4 and 5 star reviews","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667692800000}
{"reviewTitle":"Doesn’t work well","reviewDescription":"This remote does not work well. We have to click it several times and hold it down for it to actually move to the next page. We have only had it a year and are going to replace it. Not worth it.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681516800000}
{"reviewTitle":"You will lose your mind","reviewDescription":"What are the two things you do most often with your remote control? Turn on\/off, volume up\/down right? This remote will make you LONG FOR THE RELEASE THAT DEATH WILL BRING before you are able to do these things. Sure, on\/off is easy. But that bar that has a plus at one end and a carrot at the other? Press the plus sign and it MUTES the tv. Press it again and JUST FOR A NANOSECOND the volume control comes onscreen before vanishing. You will never see it again. Press it again and sometimes a bar with 1 through 9 appears on your screen but the numbers are meaningless, they are not related to volume, or for that matter, to anything at all. You will search on the Samsung website for a remote control guide and when you find it, you will read a childish description of how to press a button up or down to make your volume increase or decrease. BUT IT WILL NOT SHOW YOU THE BUTTON IT IS DESCRIBING. You will hunt through user groups for hours before finally learning that the video control button also controls volume IF YOU PRESS IT NORTH OR SOUTH. That's correct. A tiny button that was made to pressed by a Korean child's fingers has to be pressed at the top or the bottom to control volume.I HATE THIS REMOTE SO MUCH IT COURSES THROUGH. MY BLOOD LIKE POISON","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1637020800000}
{"reviewTitle":"Many of the buttons do not work+no microphone button!","reviewDescription":"The buttons for Netflix, Amazon, etc and the multi-colored dots that control A\/B\/C\/D for other tv functions for the smart tv do NOT work. And there is NO microphone button.If I had to do it again, I would shell out a few extra dollars for the real brand that is compatible with my smart tv and ALL the buttons work. It’s just ok for channels and volume -  that.is.it. Hence the two star rating. It’s pretty much junk compared with the real remote.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"This remote sucks","reviewDescription":"This remote sucks. Only work a few function","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606176000000}
{"reviewTitle":"4 of the buttons don’t work.","reviewDescription":"4 of the buttons don’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618876800000}
{"reviewTitle":"Buttons are very hard to push","reviewDescription":"The remote works as advertised, but it is very difficult to push buttons consistently. Sometimes they simply stick and you have to jiggle the whole remote to get the buttons to work. I do not recommend this unit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"You get what you pay for","reviewDescription":"It’s a cheap replacement tv remote, that works like a cheap replacement tv remote. The tv doesn’t register Im pushing a button 90% of the time, takes forever to do anything simple because you’re clicking the same button over and over again.Pulled the batteries out multiple times, paired and repaired it. I don’t know maybe I just got a dud","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"I’m sure there’s better","reviewDescription":"Bought as a secondary living room remote so I have one when my husband falls asleep.Ok, it works. However, this thing has been bugging me for quite a while. Doesn’t always register the button you have pressed. I press 2-3 times & wave it around A LOT. Had it at least a year & I decided life is too short. Amazon has a genuine remote for my TV so I just ordered it. Isn’t much more than this was. Wish I would have found the genuine one back then.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Click, click, click","reviewDescription":"Does not work well. You have to click several times and point directly. The buttons are stiff. Me no likey.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Buttons are VERY HARD to click","reviewDescription":"Overall, the remote functions well, but the buttons require substantial force to operate. Navigating channels or adjusting the volume can be quite frustrating due to the stiffness of the buttons. Though the remote is functional, potential buyers should bear in mind that it necessitates a significant amount of pressure for use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Remote works but buttons suck","reviewDescription":"Remote works well with the Samsung tv. Only issue is the buttons are very stiff and do not click. The volume button is very hard to maneuver as well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Bad after market Samsung remote","reviewDescription":"The remote buttons are very hard and it takes long time for the actions to take place.  I wish Samsung sells their remotes on their site.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Very stiff buttons","reviewDescription":"Remote came paired and ready to go with my Samsung. There is no microphone button, but I  didn't expect one. The main issue is that the buttons are so stiff they are actually difficult to push. My kids can't push hard enough, the elderly may have an issue as well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Perfect samsung tv remote replacement","reviewDescription":"UPDATE year later: unfortunately the volume button is weak plastic and sticking at times.  All the buttons are unreliable often pressing a number of times until the channels change or app selections onscreen move.  The aftermarket quality shows its true colors a year later.  I originally had the positive post below.We have a 55” Samsung 4K UHD Flatscreen TV that still works fine since 2016.  The original Samsung remote’s buttons started to act up and either was delayed in raising the volume or turning on\/off.  This was after a couple of new batteries switched out.  So we figured it wasn't the batteries.Anyway long story short, right off the package - this new remote worked as advertised!  Its not a generic model but it responds just as a new Samsung remote.  I also like that you can feel some buttons more since there are rubber surface buttons, unlike the original.  My only CON would be that the up buttons for volume and channel are stiff compared to original.  For example, I have to dig in with my fingers a bit to activate volume up or channel up.  Overall, it does what it supposed to do.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1658102400000}
{"reviewTitle":"Works but very difficult","reviewDescription":"I like that it works right out of the box, initially a pretty easy set up\/pairing with the tv. Eventually, every time I power the tv on, something pops up on the screen saying I have to pair the remote by pressing pause\/play & back arrow buttons. Every. Single. Time.Minor issue is the “quick” button at the bottom, rakeu tv, does not work (my original remote had Hulu). If I accidentally press it, tv says that it’s not an app available in my country so not for USA customers.My other majorly frustrating issue is that I have to push some buttons so hard just to get it to function. I did have a similar pairing issue with another non-Samsung remote but not as frequent. Trying another brand remote because I just can’t stand putting up with these frustrations any more!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683072000000}
