{"reviewTitle":"Good for the money","reviewDescription":"The Amazon Basics 256 GB Flash Drive is a reliable and cost-effective choice for users seeking a good balance between capacity and performance. It excels in basic tasks and is a great option for everyday data storage needs. While it may not offer the highest speeds or most rugged design, its practicality and value make it a solid choice for those who prioritize functionality and affordability.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Slow, but work well","reviewDescription":"Purchased 2 of these for my car stereo. The expensive, top of the line brands seem to work great for a few minutes, then stop unexpectedly while the stereo displays, \"unsupported.\" I thought maybe it's bcuz my car is 13 years old and the top of the line, fastest flash drives may actually be too fast for the mp3 player to handle. So far it appears I was correct.These Amazon branded flash drives haven't stopped once, even while constantly playing for hours on long drives. All the tracks are high bit rate 278-320kbps mp3 as well. So far, so good. 👍Write speeds are REALLY slow. It took two entire days to transfer 100GB of music onto these, while the exact same data only took two hours with new Samsung drives. 🐢 I've had numerous other brands fail during long write sessions in the past, so this was very positive as well.Read speeds are in that Goldilocks zone where they're not too fast and not too slow for my needs.They're slow, but reliable. For the price, I can't be happier.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Good!","reviewDescription":"good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Good electronics, bad mechanics","reviewDescription":"Like nearly all flash drives with retractable connectors, this one closes about half the time it is shoved in the USB connector.  Really, can't someone design a reasonable latch?  Holding on to it during insertion should not be necessary. I've had worse, especially the drives that have a regular USB connector on one end and a mini on the other.  Those get to collapse two ways.  The memory works and generally writes around 28 MB\/sec.  I have filled the whole drive in a single session so it doesn't overheat.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Muy funcionable","reviewDescription":"Trabaja muy bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Easy to use","reviewDescription":"Using it separate from all other USB’s for my Etsy downloads. I put an orange stripe over it too 😁There is a spot for a key chain but it’s plastic and I don’t think I would keep one on it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Computer Stick","reviewDescription":"So far I have just loaded the flash drive and retrieved a couple things with no problems.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"False description","reviewDescription":"I ordered a 128gb but it’s actually a 116gb. i’m fine with it just Irritating.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Good product","reviewDescription":"Does the trick with a ton of storage!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Sometimes it don’t go fully out","reviewDescription":"You’ll have to double check it’s all the way in the USB Port or all the way out the shell:\/","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Write speed very dissapointing, read speed is very good","reviewDescription":"This drive writes at about the same speed as my cheap ones. I noticed that the 1st time I loaded a couple of hundred meg into it, so I set up a little test. My computer has a USB 3.2 port through which I commonly read and\/or write multi-gig files, usually to or from the fast SD cards that I use in my cameras, usually at several hundred+ meg\/sec. It will go up to close to a thousand meg when writing to my SSD backup drives. BTW: The destination and source folder in the test is on a 2 T M.2 NVME card.Point of all that being that any bottlenecks in the system are far above the ratings on the Amazon Basics flash drive.I did a full format on the flash drive and loaded a few folders of images averaging a couple to a few gig. Plugged directly into the port with no cord, every one of the files wrote onto the Amazon card at a speed of slightly less than 10 meg average, peaking at no greater than 24 meg but dropping immediately. I did a screen grab of a sample and attached it above.I'm an engineer in addition to a photographer and moving large files around is common. My office is limited to a 2-3 meg internet upload speed until I finally get fiber in a few months.But when I turned it around and read from the card to a file on my computer, it was at least the rated speed, faster in fact. The 2.5 gig test file loaded from the Amazon flash drive onto a very fast M.2 drive  in a around 3 seconds. That's unbelievably fast, I'd have to duplicate it a couple of more times before I could accept that. In any case, the Amazon thumb drive reads very fast. But 10 meg\/sec into the thumb drive sucks.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Doesn’t work with my Onn Google TV.","reviewDescription":"I purchased this USB thumb drive to give more storage space to my Onn Google TV device.  I must say it seemed to work at first (even though I was never able to migrate my apps to it) but about a week later it stopped working with the Onn device.  The Onn Google TV device recognizes it is there but cannot make use of its storage space.  It can’t even read the amount of space available on the usb drive.  The Onn device only shows the statement “General USB Drive is safely ejected” every time it is installed and the device is rebooted.  So I have resorted to formatting it and using it with my laptop.  I’m disappointed I can’t use it for the purpose for with it was purchased, but it still has a use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"speed oscillates","reviewDescription":"This USB flash is good for volume storage (although some here are upset about claimed vs actual), but I found the speed pauses or oscillates too much when moving a large folder. I was using a USB 3.2 type A port (blue inner bar of the opening).  The USB 3.0 Flash Drive or card reader will work at the speed of the port, for example if you use a USB 3.0 Flash Drive in your USB 2.0 laptop, it will work at USB 2.0 speed.The top thing to consider is that MS Windows gets file info before moving and this takes about the same amount of time for each one; thus the drive is engaged in a bunch of small non-sequential reads, which are relatively slow. This image shows the progress in moving a larger file from an internal NVMe drive. It starts out fast and one tends to think \"it won't take long,\" than it throttles down on copying the file.  Imagine carrying 300 books from one room to another INDIVIDUALLY vs carrying those 300 books in boxes with 30 books each. The boxes will be much faster.CrystalDiskMark (CDM) is a free and easy-to-use storage benchmarking tool that some have posted here. Most reviews show a < 400mb\/s, so how do you interpret? In terms of ranking, this is in the bottom 20% of speed across competing flash drives, but the faster ones (700-1000 mb\/s) are going to be more expensive.If you want a cheap USB flash drive, you are going to wait longer to get larger amounts of data over the connection. If speed is important, spend more!","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"May have to Reformat the File System","reviewDescription":"While the large storage space is useful, this drive's file system will not let you transfer files over 4 GB without reformatting from exFAT to NTFS.  It is a simple process to reformat but disappointing that the drive still runs on a less useful system.  If you are trying to transfer files to the drive that are over 4 GB and you receive an error message saying the drive does not have enough storage, simply reformat the drive's file system.Speed is very good, and storage (128 GB) is more than enough.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Too much work","reviewDescription":"Had to format to actually be able to use all 128GB. Already had stuff on here, took like 10 minutes removing and copying back my files.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Had to reformat to copy files from laptop","reviewDescription":"My (very standard) laptop uses the NTFS file system format and this drive is only formatted to FAT file format so wouldn't accept all the file components of files I wanted to copy from my laptop without reformatting.I had to look up how to do it and it wasn't difficult, but in the confusion with several drives open, I reformatted the wrong flash drive and lost a large group of irreplaceable files.  If this would have been correctly formatted that wouldn't have happened.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"112gb","reviewDescription":"Very fast however I took two stars because the description of 128gb is a lie","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"No as advertised","reviewDescription":"Advertised as fast loading, however it too 2 days to load pictures from iPhoto to the drive.  Would not recommend this product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"This is a SLOW flash drive.","reviewDescription":"I bought this to run Linux ubuntu off of... Did not realize it was the 30mbs max write speed.It runs like a snail.  I had to get a Kingston stick for $10 more, its write speed is 1050mbs max, and has enough speed to run Linux... Just wish I didn't waste so many hours installing it just to realize it's to slow to be of use.  Oh well, if you just want to store basic documents on it, then it's great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Extremely slow data transfer","reviewDescription":"Handy but extremely slow data transfer rate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"HORRIBLE - LOST ALL MY DATA","reviewDescription":"I transferred all my data from another flash drive to this.  I checked to be sure all the files were on the drive before I ejected it.  I ejected it to add a label and plugged it back in and my computer could not find it.  I tried multiple slots and computers to no avail.  I took it to a computer repair center and after paying for analysis, they told me that the disc in the flash drive was broken and to retrieve my data I would have to send it out for forensic data retrieval which could be very costly.  In all my years of dealing with flash drives, this has NEVER happened to me and this was right out of the box.  This item is trash and has cost me ALOT of money.  DO NOT MAKE THE SAME MISTAKE I DID IN PURCHASING THIS ITEM.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Randomly connects and disconnects, corrupts data","reviewDescription":"I got one in 128GB capacity to use for backing up photos and documents. The drive is plugged into a USB 3.0 port. The transfer speeds were in line with the specs. However, the drive appears to randomly disconnect and reconnect during copying process. After each copy I also ran a compare and discovered that out of about 4000 files copied, about 100 were corrupted (didn't compare identically to original). Some of the corrupted files were plain text and I could clearly see the garbage characters.I used tons of flash drives over the years and this is the first time ever I saw data corruption on a brand new USB sticks out of the gate.To make sure this wasn't a problem with the host computer, I reran the copy on a different one - corrupted again. I also did the same copy onto an old SanDisk USB stick I had laying around - no problems.As with all Amazon Basics products, the manufacturing origin is obscured, and I didn't feel like prying them open just to find out. It is possible I got a bad sample, but flash memory or USB controllers are not exactly a bleeding edge of technology anymore and the expectation is that they just work, without a fail.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Fast - SOMETIMES FOR A WHILE THEN PFFT GONE","reviewDescription":"Arrived, plugged into my USB 3 hub where my USB HD is, which is reliable but has a startuo delay after idle. I need FAST response as I DJ for s streaming station and SAN Bradcaster does NOT like loading waits, it can cause an audio hiccup during broadcast - yecch.Crystal Diskmark 8 showed avg. 260MB\/s read, more than enough.. BUT..Started copying my 100GB broadcast library to the device.. decent burst performance so was modestly happy.AND THEN THE ERRORS BEGAN.Files refused to copy. Retries failed.  Then the damn new drive WENT OFFLINE, with a nice 'media not ready' error. Just.. vanished.Had to unplug\/replug it to get it working.Also refused to format as NTFS. Yaay.Drive repeatedly scanned with zero errors detected, so, what the heck?Copying a small set of directories at a time seemed to work. At least so far.  Who knows when this unreliable junk will fail next?NOT RECOMMENDED FOR TASKS REQUIRING RELIABILITY. My guess is very poor drive firmware as I didn't see a single actual media write or read error.I see why it was so cheap, last time I buy a Basics product. Waste of my money.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"UPDATE: Didn’t work. Software would not load.","reviewDescription":"Update: called Amazon customer service and reached a very helpful representative. She accepted the items back for return and sent me a QR code. However, the return amount was 20% less than what I paid. I understand that the return policy says only 80% refund for returns past the date, but I feel if the item was defective and not useable then a full refund should be made especially since it was an Amazon Basics photo stick.Took this on a trip to Europe but didn’t try it out until I was there. Software would not load and very brief instructions with the drives. Tried both and neither worked. I am very disappointed that I missed the return window as I arrived back in country after the deadline.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"So Annoying, barely usable.","reviewDescription":"Update: BAD, BAD, BAD. The Amazon Basics 256GB key won't mount 80% of the time. To make matters worse, it has always been very slow, so 10's of minutes can be wasted while figuring out if it's just the \"normal\" slower than any other key I've ever purchased or if it isn't going to mount.Original review: I successfully use other brands of USB drives on my TV all the time. This Amazon Basics 256GB drive is SOOOOO slow to come up, I can put away a full load of dishes from the dishwasher and it still may not be up! Even more annoying, no activity light, so I don't know if it's even doing anything (while I'm waiting for it to come up). It eventually does come up. When there was only a few gig of content, it came up a little faster, but still slowest of them all. It's not even a quarter full now.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Not As Advertised!! BEWARE","reviewDescription":"I bought three of them. All three right out of the package had only 116GB. As per Amazon's suggestion, I formatted the drives (although I don't know why) and they still only had 116GB. You are paying for 128GB. On top of that, I tried using one...they are NOT FAST at all. Once it got to about 60gb, it said there was no more room although it showed 50 something GB free. I tried to add another 4gb, said it was full.So advertised at 128GB, yet only 60GB can be used out of 116Gb that actually show on the item.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"Reports a larger size than actual capacity.","reviewDescription":"I bought the 128 GB version of this USB drive, but the drive would not accept even 8 GB.  Windows clearly sees the drive as a 128 drive, but I tried to copy 2 files to it, one of 3.7 GB and one of 4.2 GB.  I received repeated errors that the drive did not have capacity for both files.  Even after formatting and using different file systems, the drive clearly doesn't have the reported capacity.I will chalk this up to some kind of defect for the sake of politeness towards Amazon since it is one of their branded products, but this feels quite dishonest and indented to fool customers into thinking they've bought something larger than they actually have.  In short, don't try to save money with these thumb drives.  Just buy a name brand you can trust.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Ultra slow","reviewDescription":"I spent about 1 hour trying every tip to get this drive to run faster with no luck. (switch ports, turn this off, turn this on, etc...)It is very slow , not fast at all. With write speeds of .5mb to 1.4. Bought the name brand card and the same files wrote at 17mb\/s.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Doesn't Achieve Advertised Read\/Write Speeds","reviewDescription":"The advertisement says \"up to\" 130MB\/s read and \"up to\" 30MB\/s write. My practical experience using the drive with two different computers was more like 90 MB\/s read and 0.5MB\/s write.  The 30% loss in read time is disappointing, but acceptable.  But a 98.5% loss in write time?  That is either defective or false advertising.As I said, I tried this USB drive on two seperate machines with the same result.  Just to confirm there were no outside issues, I tried a different USB drive on the same USB port.  The different USB drive wrote at 25 MB\/s.  So, it isn't a problem with the computer or the USB port.  There is definitely something wrong with this USB drive's ability to write at advertised speeds.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Lo barato sale caro","reviewDescription":"Por ahorrarme algunos dollar, compro esta memoria de 128GB probando y para ayudar a AMAZON compro esta memoria pudiendo comprar otra sandisk que ya eh comprado de esa  misma capacidad, compre 2 de 128GB tengo de 16GB tambien que es la que uso para instalar el windows, y pedi otra de 64Gb sandisk en los dias que pedi esta de amazon basic de 128GB, y tambien pedi luego una de 256 que estoy esperando que me llegue, que ojala y no me pase como esta de 128GB  que ni la puse bien cuando ya estaba dando error y se quitaba sola cuando comence a copiar las peliculas, cada vez que la conecta a los varios segundos se quita sola y me dice que hubo un problema, como voy a tener algo que me de ese problema, le pedi 2 memorias una de 128GB amazon basic que ya probe y mire como me salio, y la otra de 256GB amazon basic que espero y no me de ese mismo problema, no me gusto esta compra, si van a fabricar algo haganlo bien para que sus productos se vendan y las personas quieran mas.. si fuera para mi esta memoria no estuviera tan enojado, pero esto fue que me pidieron que se la pidiera para pasarle peliculas y ahora que le digo yo a esa persona.. ahora quedo yo mal","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Your Portable Data Powerhouse","reviewDescription":"In the age of digital dominance, having a reliable and efficient storage solution is paramount. Enter the Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive, a portable data powerhouse that promises to securely store and transfer your important files. Join me as we explore the design, speed, durability, and overall value of this compact storage device that holds the key to your digital world.The design of the Amazon Basics USB Flash Drive is sleek and straightforward, prioritizing functionality and ease of use. Its compact size makes it highly portable, allowing you to conveniently carry it in your pocket or attach it to a keychain. The protective cap safeguards the USB connector when not in use, minimizing the risk of damage or dirt accumulation. While it may not boast extravagant aesthetics, the focus on simplicity and practicality is evident in the design.When it comes to speed, the Amazon Basics USB Flash Drive shines brightly. With USB 3.1 technology, it offers ultra-fast data transfer rates, ensuring that you can quickly move large files between devices. Whether you're backing up important documents, transferring media files, or working with high-resolution images, this flash drive accelerates the process, saving you valuable time. Say goodbye to sluggish transfers and embrace the swiftness of the digital age.Durability is an essential factor to consider in any storage device, and the Amazon Basics USB Flash Drive holds up well under everyday use. Constructed with sturdy materials, it can withstand the occasional bumps and jostles of daily life. The protective cap adds an extra layer of defense, preventing dust and debris from compromising its performance. While it's always wise to handle any electronic device with care, this flash drive can withstand the rigors of typical usage scenarios.In terms of value, the Amazon Basics USB Flash Drive delivers solid performance at an affordable price. With a generous storage capacity of 256GB, you'll have ample space to store your important files, photos, videos, and more. Its high-speed data transfer capabilities ensure efficient workflows, making it a valuable tool for students, professionals, and anyone in need of portable storage. Considering its reliability, speed, and capacity, this flash drive offers excellent value for money.While the Amazon Basics USB Flash Drive ticks many boxes, it's important to note that the design may not appeal to those seeking a more visually striking or unique storage device. Additionally, the absence of additional security features, such as encryption or password protection, may be a drawback for users handling sensitive information. It's advisable to consider your specific needs and preferences to ensure this flash drive aligns with your requirements.:The Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive offers a reliable and efficient storage solution for all your digital needs. Its sleek design, blazing-fast transfer speeds, and durability make it a practical choice for on-the-go professionals, students, and tech-savvy individuals. With its ample storage capacity, this flash drive becomes a trustworthy companion, freeing up space on your devices and providing peace of mind. Embrace the convenience and reliability of the Amazon Basics USB Flash Drive and unlock the power of portable data storage.","isVerified":true,"ratingScore":5,"reviewReaction":"89 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Quick, efficient, and plenty of room for my needs","reviewDescription":"I had my doubts about a 'store brand' thumbdrive but it seems to be working well for me.  It is fast enough for me to do command line processing directly to and from the drive so I am happy.  I had to reformat it to NTFS to allow larger files and most efficient use on my particular operating system and it is doing magnificently.  I do not hesitate to recommend this for a cheaper but reliable storage option.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1722211200000}
{"reviewTitle":"Great product","reviewDescription":"Worked great. Super fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Reputable brand, reasonable price","reviewDescription":"You get a good amount of storage space for the price, and it's an Amazon Basics product, so I doubt it's spyware. Overall, it's a good value. I got it for a school project, and it's worked like a charm ever since.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"128GB Ultra Fast USB 3.1 Flash Drive - Amazon Basics","reviewDescription":"In the digital age, where time is of the essence and efficiency is key, the Amazon Basics 128GB Ultra Fast USB 3.1 Flash Drive emerges as a reliable solution for swift data storage and transfer. This review delves into the merits of this flash drive, highlighting its speed and performance.Right from the outset, the Amazon Basics Ultra Fast Flash Drive captures attention with its promise of speed. The USB 3.1 technology it employs sets the stage for an impressive data transfer experience, making it suitable for a range of applications, from simple file transfers to more complex tasks like archiving.One of the standout features of this flash drive is its remarkable data transfer speeds, reaching up to 10 Gbps. This speed represents a significant leap forward from the more conventional USB 2.0 drives, delivering nearly ten times the velocity. Whether you're moving large multimedia files or essential documents, the Amazon Basics Ultra Fast Flash Drive completes the task in the blink of an eye.Beyond speed, the flash drive's usability shines. Its plug-and-play functionality ensures easy integration with a variety of devices, eliminating the need for intricate setups or additional software installations. This user-friendly design caters to a diverse user base, from tech-savvy professionals to those seeking straightforward solutions.Quality isn't compromised for the sake of speed. The Amazon Basics Ultra Fast Flash Drive maintains the integrity of your data during transfers, ensuring that your files, images, and documents retain their original quality. This attribute makes it a versatile tool for both personal and professional use.In terms of efficiency, the flash drive's rapid data transfer becomes a significant time-saver. Whether you're a student needing quick access to study materials, a photographer transferring high-resolution images, or a business professional exchanging important files, the Amazon Basics Ultra Fast Flash Drive streamlines your workflow and optimizes productivity.To conclude, the Amazon Basics 128GB Ultra Fast USB 3.1 Flash Drive is more than just a storage device; it's a testament to the ever-evolving technology landscape. As technology continues to advance, tools like this flash drive bridge the gap between speed and reliability, catering to the demands of today's fast-paced world.While this review provides an overview of the flash drive's potential, it's important to remember that individual experiences may vary. Nonetheless, the Amazon Basics Ultra Fast Flash Drive sets a promising standard for what modern data storage and transfer solutions can achieve.","isVerified":true,"ratingScore":5,"reviewReaction":"31 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Reliable Performance in a Sleek Package","reviewDescription":"The Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive is a true gem in the world of storage solutions. From its sleek design to its exceptional performance, this flash drive exceeds expectations in every aspect.Let's start with its performance. \"Ultra fast\" is not an exaggeration; this flash drive delivers lightning-fast transfer speeds, making it a breeze to move large files or backup important data in no time. Whether you're transferring documents, photos, videos, or even entire folders, you can count on this drive to get the job done quickly and efficiently.Furthermore, the generous 256GB capacity provides ample space for all your storage needs. Whether you're a student, professional, or simply someone who values having extra storage on hand, this flash drive offers plenty of room to store your files securely.In addition to its performance and capacity, the design of the flash drive is both stylish and practical. The sleek black exterior not only looks great but also feels durable and reliable. Plus, the compact size makes it easy to carry with you wherever you go, whether it's in your pocket, bag, or briefcase.Overall, the Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive is a top-notch storage solution that delivers on its promises. With its great performance, ample capacity, and stylish design, it's a must-have accessory for anyone in need of reliable portable storage.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Lots of storage","reviewDescription":"It has tons of storage, I was able to put TONS of songs on it.I made my Dad a playlist for his truck, the only issue I ran into was that it wasn't compatible with his truck. His takes a 2 and this is a 3But uploading and downloading off of it is super quick and easy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Muy buena inversión","reviewDescription":"La mandé para cuba y me dijeron que estaba muy buena que corre muy rápido y están muy contentos con ella gracias","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Perfect to expand FireStick memory","reviewDescription":"Just what I needed to expand memory on FireStick HDs in house!  Instruction can be found on YouTube.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Muy bueno y rápido.","reviewDescription":"Muy bien y rápido, uso en una pc un tanto desactualizada. Se recomienda mucho. Por el momento. Llevo ocupados 40 gigas de 232.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Good","reviewDescription":"Brought to move my photos and videos from my phone. Works fine & had no problems so far …","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United Kingdom","date":1724544000000}
{"reviewTitle":"affidabile","reviewDescription":"archiviazione ad alta velocità","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Italy","date":1714867200000}
{"reviewTitle":"Gran capacidad con una velocidad más baja de lo esperado","reviewDescription":"El pedido llegó muy rápido y debidamente protegido, el pendrive de 256 GB se corresponde con las imágenes del anuncio (26.10.2022).Reseña: Capacidad 256 GBContenido: Se presenta en una caja de cartón donde se indica la capacidad, la versión, su origen y la marca. Dentro de la caja tenemos una bandeja de plástico donde esté alojado el pendrive de 256 GB.Es un pendrive con carcasa de plástico de color negro, en la propia carcasa se indica la marca, la capacidad y su número de serie, pero no se indica que sea una memoria 3.1, este dato solo figura en la caja.Este modelo viene de fábrica en “FAT32”, por lo que, si queremos guardar archivos más de 4 GB, es conveniente formatearlo en “NTFS” o “exFAT” (Windows). La capacidad real con la que viene es de 231 GB y no 256 GB (Esto es debido 1 kilobyte son 1024 bytes y no 1000) y debemos aplicar la siguiente fórmula: 0,9313 x GB, es decir qué multiplicando nos quedaría así: 0,9313 x 256 GB = 238,41 GB, pero este pendrive viene con menos GB “231 GB”.En el anuncio se indica que tiene una lectura de 130 MB\/s, cosa que cumple perfectamente, pero no está indicado la velocidad de escritura que es lo más relevante, que siendo un Pendrive 3.1 debería superar los 600 MB\/s que es el estándar máximo de un USB 3.0. Pero en todas las pruebas que he realizado me ofrece una velocidad de 80 MB\/s, en el mejor de los casos, siendo lo normal 60 MB\/s. Con los TEST, me pasa exactamente lo mismo.El hardware que tengo emplea puertos USB 3.2 (MSI X570 CREATION + Ryzen 9 3900X + 32 GB RAM), por lo que no es problema de mi hardware, además tengo otros pendrives que siendo 3.0 superan la velocidad de escritura de este modelo de pendrive en su versión 3.1 (Empleado S.O Windows 11).Características:Marca: Amazon BasicsOrigen: TAIWÁNASIN: B0B61DGG18Color: NegroMaterial: PlásticoTipo: USB Tipo AVersión: 3.1Nombre dispositivo: General USB FlashCapacidad: 256 GB (Real 231 GB)Formato: FAT32 (De fábrica)Velocidad escritura máxima obtenida: - 80 MB\/sVelocidad lectura máxima obtenida: + 200 MB\/sDimensiones: 56,97 mm de largo x 20,13 mm de ancho x 12,44 mm de grosorPeso: 8,3 gramos (Pendrive)* Es un pendrive USB tipo A de 256 GB (Mucha capacidad), ahora la velocidad de escritura es bastante lenta para ser un pendrive 3.1, ya sean archivos grandes o pequeños.** En el anuncio solo se indica la velocidad de lectura, pero no la de escritura.*** No le doy las 5 estrellas porque es un pendrive bastante lento para ser USB 3.1, ahora por capacidad esta bastante bien de precio (-20€).","isVerified":true,"ratingScore":4,"reviewReaction":"168 people found this helpful","country":"Spain","date":1666742400000}
{"reviewTitle":"Great product","reviewDescription":"Best use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1725062400000}
{"reviewTitle":"Ism","reviewDescription":"Osm products best performance High speed","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1724630400000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1724976000000}
{"reviewTitle":"Almost Best","reviewDescription":"When I opan this in my laptop storege space is 115gb here not 128gb","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1724716800000}
{"reviewTitle":"Good","reviewDescription":"Little slow compared to other 3.0 models from other companies but value for money","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1723766400000}
{"reviewTitle":"Like it","reviewDescription":"I am using this since a month and giving me good performance","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1723766400000}
{"reviewTitle":"Good value for money","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1723852800000}
{"reviewTitle":"Good Space, SLOW write speed","reviewDescription":"Has a nice amount of storage space but the write speed is SNAIL SLOW. Peaks at 30MB\/s and sustains about 4-5MB\/s. My Sandisk USB 1TB SSD writes at 300MB\/s sustained through the same USB Hub. Even the internal SSD on my super old Microsoft Surface Pro 3 sustains 100MB\/s. This Thumb Drive is just ridiculously slow. I bought it for music because it uses the FAT32 File System and my head unit cannot read exFAT to which almost all of the new USB Drives are defaulted and can't be reformatted to FAT32. But the default File System should have nothing to do with the write speed of the Thumb Drive. Very disappointed in the write speed. Hopefully the read speed can at least maintain 10Mbps.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"I'm not sure!","reviewDescription":"I bought this USB just to store my blink cameras videos locally.But almost everyday I get a notification saying that the backup failed to complete, I've checked and the USB is only at 14% so it's not a storage problem.I'm not sure if its something related to the USB, sync module or the blink app itself, i've tried several troubleshootings with no solution.So that's why I'm rating 3 stars, plus now i've seen other USB's with much more capacity at similar prices so not that great value for the money","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Did not work with Buick Infotainment system","reviewDescription":"I purchased two of these (both 128gb).  One for my music, and one for whoever else might be with me.my 2020 Buick Regal Infotainment system would not detect the thumbdrive at all.I formatted each with FAT16, FAT32, exFAT, and NTFS.  nothing worked.they work fine in the computer so i am keeping them, but that's not why i bought them.I wouldn't buy again.  Back to buying name brands :(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Buyer beware! False advertising!","reviewDescription":"I bought this 'Amazon Basics' supposedly \"256GB\" flash drive based on the good reviews it received. This is NOT a good value nor is the storage capacity any where close to the advertised amount. As soon as I put it in the USB port, I saw all I had was a mere 230GB space available to me. (What the Hell?) Then trying to use it almost gave me a blister trying to open and retract the USB end of it. Just so tight as to be painful to my fingertips. I won't return it to Amazon, but I'm surely going to replace it right away with something else.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"So it is only 32GB according to my new Win 11","reviewDescription":"So it is only 32GB according to my new Win 11 backup process. I plugged it into my new Lenovo 13th gen destop and asked it to make a recovery disk. It took an hour to do it and when it was finished, the properties of this drive showed total capacity 32gb, with something like 10 gb used for the recovery data.Pretty expensive for a 32gb thumb drive.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Big but slow","reviewDescription":"While it's called ultra fast it's pretty slow to me, hell for a lot of my files I have to wait literal hours for it to download inside this hard drive and it's even a bigger nightmare if it's 1 GB or more but giving credit where it's due yes it is very spacious","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Not terrible read, slow to write, as spec'ed","reviewDescription":"I am not sure where these reviews of fantastic performance is coming from. Someone must have taken chill pills by dozens... Read\/Write speed is right along advertised, as in it does write painfully slowly at 30 MB\/s. I was hoping that was under-rated, but it...All plastic outside build feels flimsy and side does take up space enough to interfere with similarly chunky dongle\/connector in adjacent ports.I suppose that's okay if user is writing only few times but reading often. Given $5 more gives significant write performance increase, often higher quality build, I'd skip it for frequent users.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Seems ok for bulk storage","reviewDescription":"I bought these without really paying attention to the read and write speeds and holy crap is this thing painfully slow. I did the mistake of running my raspberry pi off of it and I ended up swapping it out for something else.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Works fine, wrong size","reviewDescription":"I ordered the 128gb model to use it for os installation media. It works fine but the computer identified it as a 32gb. The casing says 128gb on it. I'm not going to go through the effort of returning because it's not worth my time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great.","reviewDescription":"Very slow.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Amazon basics 256gb Flash Drive","reviewDescription":"All good. Inexpensive and works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Feels cheapish but works","reviewDescription":"Definitely not up to the build quality of what I keep on my keys or anything but it works just fine. I just wouldn’t want to trust the key ring","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Does not fit in PS4 slot.","reviewDescription":"The design is to wide for the USB drive to reach the PS4 USB slot. The PS4 slot is slightly recessed and this drive will not fit into the gap.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1672963200000}
{"reviewTitle":"Convenient","reviewDescription":"Affordable and convenient to have. Good for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672876800000}
{"reviewTitle":"Good price","reviewDescription":"Good price and good quality so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675555200000}
{"reviewTitle":"Please update specs","reviewDescription":"It is listed as having 130MBps write speed. I barely get 40MBps for writes.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1671062400000}
{"reviewTitle":"Cheap price but slow","reviewDescription":"Good money value but slow.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674604800000}
{"reviewTitle":"Make sure you reformat the drive in order to transfer files greater than 4 GB","reviewDescription":"One of the reviews complained about not being able to transfer large files like 93 and 100 GB. It says in the description \"FAT32 is the factory default drive format which is read\/write compatible with Windows and Mac OS. If you are transferring a file size over 4GB, please reformat the drive to exFAT or NTFS.\"You can't transfer large files right out of the box.If the drive still won't take large files then there is a possibility that it might be defective.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Pretty good!","reviewDescription":"It can hold a ton of data! It’s pretty good for my picture and video needs and the price isn’t half bad too.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Big","reviewDescription":"Great amount of storage for a great price. Writing 10GB of mixed files to this drive was particularly slow. The speed to copy those files back to my HDD was OK.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Oddly Shaped","reviewDescription":"Bought this for my PS3 and the casing is so thick around the flash drive it wouldn't fit into the USB plug-in. I had to sand down about an 1\/8\" to make it thinner just so it would fit. Other than that, it works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Is ok","reviewDescription":"Bit slow in writing compared to sandisk that i own","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Inexpensive, and works in a pinch","reviewDescription":"It works just fine, and it's a pretty good value for the price... but that's all the good stuff I can say about it. Despite being advertised as USB 3.1, it's never peaked higher than 30 MB\/s (well within the USB 2 spec). The case is also weirdly large and bulky; it's made from what feels like a quality plastic, but man is it ugly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Instantly Loaded and worked , funny business on the capacity. (Full Review Pending More Testing)","reviewDescription":"Intitial Reveiw 1\/23\/2024Overall ***Storage Capacity ***Easy to Use *****Value for Money *****I will write a more thorough review later. I will do about 20 to 100 hours of testing on these drives.But right off the bad, I see some funny business with the usable capacity vs the advertised capacity. I highlighted it here. It is usual for A drive to look like it has less capacity than advertised because two different but similar units are used, one called gibibytes and another called gigabytes, but the problem is even accounting for that, the capacity is ever smaller (another possibility is that they included the cache outside the usable space but I don't know about that)A 256 Gigabyte drive will show up as 238.4 GB on a Windows computer. The problem is that these drives show up as only 231.1 GB, over 3% less than expected.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Not fast. A usb 3.1 with 32.5 MB\/s on the PC's usb 3.0 port is false advertising.","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Huge amount of space but, too long to be formated too long to save files.","reviewDescription":"Huge amount of space but, it takes way too long to be formated and way too long to save files.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"connectivity issues","reviewDescription":"I’m not so well versed in the world of flash drives. My iPhone needed space. Quick YouTube search suggested I get an OTG to connect to my iPhone and Cinnect the flash drive to the OTG to transfer files to it. Well, it seems to have uploaded but I’m having trouble opening the files to check. Under the dukes folder in my phone, I would see the flash drive folder. I would press on it, try pressing a photo then, poof, the folder would “disappear” only to temporarily appear seconds later. My phone would sometimes freeze if try to press on the flash drive folder itself.Again it could be issues with my lack of understanding of how flash drives work but, it isn’t working for me in particular .Maybe my products defective","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Not compatible with iPhone 14 Pro Max","reviewDescription":"I was excited to get this considering I’d just bought a different one with the same memory capacity for $50. I figured, of this worked out, I could return the other one and get two of these with twice the memory. I even purchased an adapter for it… alas, the phone doesn’t recognize anything has been plugged in when I use the adapter. I even made sure it wasn’t an adapter problem by plugging in the other iPhone flash drive through its usb part to the adapter and it worked just fine. So I know the adapter works, but this just doesn’t. I’m sure it’s a great product for use with a computer but as far as using it with an iPhone, it’s a massive fail.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"This is not 128GB.","reviewDescription":"Good value, but item is listed & labeled as 128GB, but actually only 116GB.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Spend a bit more - get much more","reviewDescription":"Good - it works. Bad - it's slow.There are netter sticks for just a bit more.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Fits Tesla","reviewDescription":"It fits a Tesla for dash cam etc","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Sturdy and Unique","reviewDescription":"This USB is very fast and sturdy, I like that you can retract it and the amount of storage is exactly right for file management.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Speed","reviewDescription":"It works very well and the price was right.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Affordable Storage","reviewDescription":"I used this to transfer photos to my client and was able to deliver several large albums that they had been involved in with more than enough extra room on the drive for them to use in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Works good so far","reviewDescription":"I have a quality & durability issue with usb thumb drives, i have tried every major brand out there & they all crapped out over daily wear & tear & use. Legit regular use I am not particularly hard on them. This one seems to be outlasting all of them so far so needless to say I am very suprised & pleased. Its about average when it comes to read & write speed, that may be an important factor to certain people. I use this one to transport business files J documents so my biggest need was reliability & durability, if those factors is also your priority then I would recommend this line of thumb drives.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Good flash drive for the money.","reviewDescription":"Flash drives typically last three to five years, so I personally try to find the best quality for the least price since I know it's only going to last that long. I've not yet been disappointed by Amazon basic products (I also buy the rechargeable batteries) and this is a good example of that. Time will tell if the duration quality matches its decent build.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Very pleased...fast and flawless","reviewDescription":"For something described by it's seller as 'basic', it certainly performs like a pro. I recommend these flash drives without reservation.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Just what I needed","reviewDescription":"I have so many flash drives but was unsure what was on each. I needed one to dedicate just to important work files. This fit the bill, the price was right and it delivered quickly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"great item","reviewDescription":"would buy it again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"good product","reviewDescription":"good product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Excellent","reviewDescription":"Buen artículo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"256GB at a killer price","reviewDescription":"Definitely worth getting.  Never know when you need the extra storage space.  👍🏻👍🏻","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Storage","reviewDescription":"Easily save your files. Fre up some space on your phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Does what it needs to do","reviewDescription":"Great USB drive that seems sturdy and has a lot of space. No bells and whistles, but I do appreciate that the usb shield (metal part) is retractable for safer keeping.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great deal for portable data storage","reviewDescription":"Needed , bought it and Happy with it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Muy bueno","reviewDescription":"Exelente calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Just as GOOD!","reviewDescription":"Worrh the money for this USB drive","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Great zip drive","reviewDescription":"This a wonderful zip drive with plenty of space. Would buy again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Thanks For that 256GB","reviewDescription":"Perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Great value drive for storing my images.","reviewDescription":"I purchased this drive to store images of projects I have completed for my portfolio. The size of each image is small, usually 1MB or less, so I can store tons of them on the drive, in addition to many distal photos, documents and even videos. It’s a great alternative to some of the well-known brands for these products. So far, it’s been very reliable. I also use it interchangeably with a Mac and a PC.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Fast data transfer.","reviewDescription":"Took 6+ hours to move 24 hours of video files (approx 16GB) from my security camera NVR's USB1.1 port to the card, then less than two minutes onto my laptop with a USB3.1 port.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Plug and play","reviewDescription":"Got this in 24 hours. Works exacly as expected, no formating needed. Plug and play","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"works great and a ton of storage availible","reviewDescription":"Hey if you need a lot of portable storage space this works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Just as described","reviewDescription":"Exactly what I needed with plenty of storage to update my software.  Handy to have around.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Works great for movies on my TCL - Roku TV","reviewDescription":"I bought to play MP4 files on my TV and it works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Unidad flash","reviewDescription":"Es un producto de muy buena calidad, con caracteristicas exactas a las prometidas. Buen funcionamiento.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Great value","reviewDescription":"We bought this when it was on sale and it was Great value for what we wanted.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"FANTASTIC!","reviewDescription":"I HAVE BOUGHT THIS MANY TIMES AS BACK-UP STORAGE!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great Deal!","reviewDescription":"Super high volume!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"It Works","reviewDescription":"While this is a usb 3.1 drive, the write speed is only hitting the advertised 30 value which is slow when you are writing gigs of data to it.  For smaller transfers it’s probably a bit faster, but I copy 50-100 GBs of movies to mine regularly to watch from my TV’s USB port.  I just know that it’ll take a long time so I start the copy operation and just let it run while I do other things.  The drive is reliable, both of my TVs can read it perfectly fine and the price point is good for this type of storage.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Happy with the purchase","reviewDescription":"So far I’m happy with the purchase. I use it two-three times a month and haven’t had any issues. No issues with compatibility with my laptop or MacBook. Size is good, easy to find","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Storage capacity not accurate","reviewDescription":"The storage capacity was listed at 256mb, but actual storage capacity was 231mb. Not a majordifference, but we would like what we pay for please and accurate descriptions in the ad corrected.Other than its easy to use and convenient.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Good, light false advertising","reviewDescription":"The flashdrive itself is pretty good. But false advertising is often the problem. A lot of people might just care about the storage size and the quality and both are fantastic. But the fact stands that the flashdrive is still a 3.0, not 3.1 as advertised.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Llego lo pedido","reviewDescription":"Producto muy bien echo, se nota una calidad buena. Muy rapido puesto en un puerto 3.0","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Ok","reviewDescription":"Does what it’s designed to do. Convenient","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"El botón de eyección","reviewDescription":"Rápida, liviana y económica pero el sistema del botón de eyección no me parece buena idea porque puede llegar a fallar en un futuro y luego sería complicado meterla en la ranura","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Works, but no access light.","reviewDescription":"This product is fine and transfers everything I wanted to transfer amazingly fast.  I took one star away in the overall rating because the flash drive lacks a simple access LED.  I felt that for the price it should have included an LED.  A minor detail if you don't know when the transfer has completed vs. checking when the program has finished the transfer.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Pretty good, but not as fast as some are claiming","reviewDescription":"It's a pretty good drive and a very good value at about $10 for \"128 GB\".Some things to note: On my machine this device shows up as a block storage device with 124,623,257,600 bytes, which I might generously round up to 125 GB if I were describing this product... but not 128 GB. This whole rounding up to the nearest power of 2 thing in advertising storage devices is false advertising and it really isn't necessary. Just say what it is... it's a good value without fibbing.Speed: The *Interface* speed is great, sure, but devices like this use a small write cache to hide the fact that the actual flash media is way slower than the interface. If you write a little bit of data, you can rapidly move it to the write cache and the device can claim it finished while slowly finishing the actual write in firmware. If you write a lot of data you will fill the write cache and the transfer will slow down to approximately the speed of the actual flash media. On this device I seem to get about 20.5 MB\/s once this happens. This is the speed you should expect if transferring a large amount of data (although lots of tiny files will always be slower so you may see somewhat slower speeds IRL). This isn't too bad for a budget drive, but it's nowhere close to a high-performance thumbdrive or a USB SSD. Just set your expectations accordingly.In summary, this is a descent drive and is pretty fast for a budget drive. A very good value at about $10 \/ 125 GB.","isVerified":true,"ratingScore":4,"reviewReaction":"52 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Good capacity for a good price","reviewDescription":"The flash drive was advertised as having 256 GB of storage capacity, but upon testing, it was found to have only 248 GB (Windows displays it as 231 GB due to translations). The average read speed during testing was 150 MB\/s, and the average write speed was 43 MB\/s. Despite the slightly lower storage capacity, this flash drive is still a great purchase given its performance and affordable price.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Works like it should","reviewDescription":"Works like it should","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"The Floridian","reviewDescription":"This product absolutely sucks. Disconnects randomly.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"This is garbage plain and smiple.","reviewDescription":"Its already dead. just keeps being recognized and then not recognized and then redetected - all without toughing the thing.  Talk about \"YOU GET WHAT YOU PAID FOR\". These should be sold for $1 and the price clearly shows the seller (Amazon) is well aware these drives are garbage and knows it's \"Amazon\" and these customers (suckers) will pay $20 for 1 box of pasta or but a 12-pack and the pack is really super small cans (lol) then they obviosuly could care less about customers and more about profit. Overpriced Amazon garbage.  I will NEVER buy amazon brand again.  How do you feel about that Amazon?  Oh ya you have Millions of others who will.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Defective out of the box","reviewDescription":"Tried it initially and didn't work. Tossed in a drawer until now and still won't accept files. Keep getting 0x800703EE error message. Tried reformatting, including different file systems and still won't work. Wiped partitions too, same result. Ordered a Samsung flash drive. All the other flash drives work fine in the same port. Partitioning software won't even open (including Windows 11 Disk Mgmt) if it's plugged in. Waste of $20. Oh well...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"SLOW DATA TRANSFER","reviewDescription":"This \"Ultra Fast USB\" is anything but fast.  I set up a copy an hour ago for 58GB.  it is still copying.  Very slow","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"DID NOT WORK.","reviewDescription":"When i put it into my laptop, it freezes my laptop when im trying to open it. Also, this thing wasn't even delivered to my house. Amazon delivery delivered 2 packages of mine to my neighbor's house for some reason. The dude came to give it to me and i returned it. I understand it's holiday season but 2 PACKAGES TO THE WRONG ADDRESS within the same week is not acceptable. The delivery guy was definitely on something. This happened on Friday and then on Sunday. It's freaking ridiculous. PLEASE FIRE THAT GUY.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Didn’t work after a month","reviewDescription":"It stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Deceitful!","reviewDescription":"I purchased two of these just in time for Christmas.  One for each of my children.  I am transferring all digital video files from my personal 64 GB flash drive onto each of these 128 GB flash drives.  Both of them presented an error message stating that the largest file would not fit because there isn't enough space.  That does not compute!  These will definitely be returned and exchanged for something that isn't deceitful, most likely even from different store.  What a shame.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"This is junk!","reviewDescription":"I've never experienced a drive this slow. Something is very wrong.  Using latest Mac OS.  Total Junk!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Not advertised capacity","reviewDescription":"I bought tow of these to backup photos for family members and laid for higher capacity than I needed. Says I have 78gb free but says full when trying to add 4 gb. So now I need to purchase new cards that actually have the capacity I need.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"The Size is a lie","reviewDescription":"The product clearly labels 256GB but in reality there's only 231GB available, false advertising. When you get the product the instruction manual says \"Actual storage capacity shown is less than indicated on label...\" Bruh. like don't say its 256GB when the actual size is so much less.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Works, value good","reviewDescription":"Works, value good, retractable, not much more to say.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Good quality","reviewDescription":"Good sturdy shell, good price","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Watch where your package is left, this was stolen","reviewDescription":"Would love to see read and write speeds I'd bet they're awesome, too bad someone stole the package.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Works great","reviewDescription":"Works great and can hold lots of photos and slide shows. Only qualm with it is that you cannot rename it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Works well for the price","reviewDescription":"The usb is pretty good for the cost but it does take a while to transfer large files or to turn it into a bookable usb.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Nice Quality","reviewDescription":"Very decent read speeds. Write speeds were only around 20 - 25 MB\/sec with mixed data, as expected for a flash drive. Reliability seems good, too. Arrived quickly. Packaging was very high quality. Very good deal for the price, but don't expect this to perform like an actual SSD, which can can sometimes read and write up to 20X faster.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Thought it was a Scam, turns out that was Windows Media Creation tool's error","reviewDescription":"I was angry at first, it failed to write, and reported an incorrect storage capacity. Turns out, windows media creation creates a 32GB partition without asking.... So I amend my review to 4*. It still loses 1 star, because the write speed is painfully slow. Sub-30MB\/s. But read speed is great.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1683763200000}
{"reviewTitle":"Good","reviewDescription":"Just started using and so far no issues. Waiting to see how long it lasts before I buy more.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Great value","reviewDescription":"Great value, no problems transferring or accessing files. I am not cautious with it and I have to say, it can take a beating.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Good value and works well","reviewDescription":"I am rewriting this review with an update and rating change. At this point I have now bought many of these, still a good deal and overall good quality...but I want Amazon to note one problem...the key chain hook on the end breaks very easily and that needs to be fixed. I cannot use these as a key chain now because of this. Again, a good deal...especially on sale.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Is not 256 GB","reviewDescription":"It’s advertised as 256 GB but it has 231 GB. Not what I paid for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Terrible","reviewDescription":"I didn’t realize a USB could be terrible until I bought two of these. They do not stay connected. It’s ridiculous","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"only 32 GB on a 256 GB","reviewDescription":"The flash drive states 256 GB on it, but only it only had 32 GB.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Returned","reviewDescription":"Didn’t like the quality of the build on this one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Tried to flash Linux Mint to it Instantly failed and stopped being recognized by the drive","reviewDescription":"This is cheap trash I bought to flash linux mint lasted all of 10 minutes until it crapped out and wasnt recognizable by my pc. Tried formatting it every which way to avail. DO NOT BUY. Stick with established brands like sandisc and dont cheap out this amazon branding means jack its the same ol cheap wish.com tier  trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"This USB key will give out on you very quickly if you write on it too much ...","reviewDescription":"This key didn't stand up to a few hours of file writing. It gave out on me while I was copying some files onto it.It became unusable and I lost all the files I had stored on it.I haven't even reformatted it, it's no longer recognized by the system.Avoid, unreliable: you don't know when it's going to give up on you, it can happen very quickly and you could lose everything.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Storage is misleading","reviewDescription":"I bought it so that I could have more space on my ps4. When I plugged it in to my ps4 it said that there was only 248 G of space and the ps4 requires at least 250 (which is why I bought a drive of 256) so it's not usable to me at all. Very very disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"didn't work won't format","reviewDescription":"I got this to add storage to my firestick. It wouldn't be recognized by firestick so I tried formatting first on laptop (an extra step usually not required) but even though it was recognized by my laptop, formatting kept encountering errors and would not complete, I waited too long to try it and missed the return window. I guess I should tried it as soon as I got it but  I have never had a flash drive not work before.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Garbage! Do not buy","reviewDescription":"Originally bough for a smart TV. The drive keeps corrupting and will not allow me to reformat it. Amazon will not allow me to return the defective drive. Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"Lost important file","reviewDescription":"I had the same thumb drive carrying some important info (backed up on another device). I decided it was too old and I needed a newer thumb drive so that it's more reliable. Within a couple weeks of purchasing this one the file that I rely on almost daily is GONE. Nothing left. Did all the right things, ejecting when done etc. Never had a problem with a thumb drive until now. This one is garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Stopped working for me.","reviewDescription":"I am disappointed as these stopped working for me.  I bought two a year ago and both no longer work.  I am just glad that I had copies of my data on two other flash drives (which are not Amazon Basics brand.)","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Terribly damaged.","reviewDescription":"Arrived in hellish shape. Box is mutilated and the drive itself is warped and completely unusable. Some of the damage in the photo is caused by me trying to be able to use it, but the warped metal arrived like that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"dont buy, terribly made. switch falls off immediately, bricking the thumb drive","reviewDescription":"this is a ridiculously cheap housing that ruins the unit. There is a super cheap switch to move the usb port out. the switch is not glued, and just falls off easily.Note: this review was rejected for no reason besides negativity. This product is so flawed it needs to be redesigned. Do not buy. And now I have to wonder about amazon reviews as my last one broke no rule.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"TERRIBLE!","reviewDescription":"Doesn't work at all. I got it a few months ago and put my files on it and didn't try to use it till now. It keeps ejecting itself from my computer. Maddening! So I put it in my other computer and it won't even open it. I have lost all that I put on it. That is a BIG DEAL!Wish I could get my money back, at least","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Malfunctioned after one use","reviewDescription":"I bought the USB drive in April. Used it for the first time a week ago by backing up some files. Today I plugged it in and the drive mounts and then dismounts in a continuous cycle. I rebooted my laptop but that made no difference. I tried the drive on another computer with the same results.Warranty is only for 30 days. These are probably made by some no-name company using inferior chips which is why these Amazon branded drives are much cheaper than the name brands.Kiss my money goodbye and learn my lesson about \"too good to be true\" pricing. LOL.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"Quit working after 5 months.","reviewDescription":"I used it for my blink camera. Then blink stop recognizing it. My computer said there was something wrong with the drive. I reformatted the drive. It worked for a short time and did the same thing. Did it all again. Same result. Tried a different flash drive. Haven't had any issues. Amazon says there is a possibility to return it or replace it for up to a year. I tried. I don't know what those magical circumstances would be.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Not bad","reviewDescription":"Good speed , but size not 128 g ,, it 110 g ,, when i put 5 g , free space is 47 g , I don’t recommend 👎🏼","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"7 months of life","reviewDescription":"After a short span of time it quit working consistently, it continually unmounts whenever transferring data to\/from the drive. Not sure what's burned out, but it seems like there's some piece of electronics in that shell that stops working once it gets up to temperature.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Not 256GB","reviewDescription":"The product is advertised as having 256GB of storage both on this website and on the packaging, but this isn't true.  The USB only has 231GB of storage.  Total scam.  I've had this same problem with other USB's from different brands as well unfortunately.  They do tell you in the description that it holds more than 230gb, but your computer won't recognize this when you approach the 230gb limit.  So it's either wasting 25gb of storage being unusable or it's a complete lie.  Also how inconsistent can digital storage metrics be at this point?  Why are you selling a product if you can't verify the storage claim accurately?","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Not 256 GB","reviewDescription":"100% not 256 GB, USB is only 32 GB I figured for the price I would not be getting 256 GB so I'm not that disappointed but just warning the others that actually need that amount of storage. luckily for me I am just using this as a window install drive","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Not USB 3.1 transfer speeds","reviewDescription":"I bought this because it was an Amazon product so I thought it would be high quality. Moving files from my PC through a USB 3.1 connection is giving me around 3 Mbps speed. Moving 112 Gb of files has taken over 3 hours so far. Amazon should check with their manufacturer - they might find they aren't getting what they expected. The speed should be at least 100 Mbps or more with this setup.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Needs to be partitioned to NTFS storage type to make the total storgae accessible","reviewDescription":"As my title states, the drive comes partitioned as a FAT32 storage type, making the maximum file size 4 GB, but the total storage was only 32 GB. After repartitioning it to NTFS with the mini tool partition wizard, I was able to access the total storage listed. It's a good value for the amount of storage if you already know how to repartition a drive. If you don't know how to or don't want to learn how, just get a 32 GB drive. Also, don't expect this drive to be highspeed. It's still a USB connection, not SATA. Max download speeds are around 4-4.5 MB\/s. If you just want to use it for a lot of pictures and\/or documents, it's the perfect fit for you. My 2 stars are due to the drive not being partitioned correctly when sent out to customers, and positively, it has a good value for the storage amount if you know how to unlock it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"NOT Ultra Fast","reviewDescription":"Transferred a large 8 GB file to another thumb drive and it took about 30 seconds. With this thumb drive it took about 3 minutes. This thumb drive was giving transfer speeds of about 40-50 mbs and the second was giving transfer speeds of about 300 mbs! So, this thumb drive is not \"ultra fast\" I don't think I would even call it fast.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Mine didn't last long","reviewDescription":"Maybe I just got a bad one because there's a lot of good reviews for this. Mine won't even get recognized by any computer anymore(Linux or Windows) and I hardly even used it the six months I had it. It feels super cheap, but maybe that's to be expected since it is super cheap. I haven't had the best of luck with Lexar\/Longsys flash memory so I'm not really too surprised as they manufacturer this item.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Keeps disconnecting from my computer","reviewDescription":"Although this thumb drive was working well and had lots of storage, after a few months it started disconnecting from my computer every time I plugged it in. I tested it on another computer as well to make sure that the thumb drive was the problem and not my computer, and it still kept disconnecting. I now have to purchase another thumb drive and transfer everything over to the new one. Hopefully it can stay connected long enough for me to do this…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Actual capacity less than advertised","reviewDescription":"We needed a drive that had minimum capacity 256GB for transfer of data from a game console. Purchased this drive. Upon inserting into to computer, the disk read only 248GB capacity, rendering the disk useless for our task. Had to return. Gave 2 stars instead of 1 because it arrived overnight for our urgent need.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Not 256 GB","reviewDescription":"The flash drive is easy to use and compact.  However, I really wish manufacturers would put the REAL capacity on these drives: you get 10% less, or just 231 GB, vs. the listed 256 GB of storage.  That makes a difference in trying to size the correct flash drive to backup certain files and folders.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Slow to write","reviewDescription":"I normally buy SanDisk products, but thought I would try the Amazon Basics (AB) 128GB drive. That was a mistake just to save a few dollars. The AB drive was difficult to format to NTFS and failed the process twice before Windows 11 finally sensed the drive was not defective (or is it???) I ended up with a littl over100 GB of usable memory instead of 128GB. The transfer of video backup files to the drive is excruciatingly slow over a USB 3.1 port. Reading back is faster, but my faith in the reliability of this drive is shaky, at best. I will keep the drive since I've already loaded up 4GB of files on it, but I'll leave Amazon Basics for things like housewares and not digital storage. I'll use it mostly for temporary backup and transfer, but nothing critical.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Very Slow","reviewDescription":"I bought this drive to store pictures. I was unable to move all 100+ at one time. I tired 12 at a time. 10 minutes later, still waiting! Definitely worth it to spend more for a device that may be faster with transfer speeds. Too bad it's too late for me to return the device.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"WAY TOO SLOW","reviewDescription":"I would not purchase this USB again. I've had tons of USB sticks and external hard drives over the years and this is by far the slowest I have used. In 2024 technology should not be this slow!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Fails on large transfers","reviewDescription":"I wish I would have sent it back the first time it happened. I use f3 \"Fight Flash Fraud\" on all the SD cards and USB drives I get to verify capacity and as a gross speed benchmark. It failed once and I thought it was because I plugged it into the front-panel on my desktop. The failure was it looked like it has been removed from the PC before it finished copying all the files.  I restarted f3 after plugging the USB Drive in directly to the motherboard. It worked and verified the files. Later I was attempting to transfer files totaling 209GB and it failed part way through on 3 of the 4 PCs\/Laptops just like the first failure. My guess is that it's over heating as it get pretty hot when plugged in for a bit.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"Shipped used gear and won't refund\/replace.","reviewDescription":"Zero stars if possible.I ordered two of these in June of 2023.I opened one drive and used it immediately; it was 256GB w\/o issues, blank from the factory.The other drive was opened outside the 30-day return window, and it was clearly used.It had been formatted with a 36GB primary partition and a 200+ GB hidden partition.Fortunately, I worked on it on an isolated linux VM and after wiping the USB drive entirely, I erased and rebuilt the VM to avoid compromise, but it was an obvious security risk.Amazon won't replace it and won't acknowledge that it represents a security risk.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"SLOW READS AND WRITES","reviewDescription":"This usb3.1 device is at a good price but at the expense of exceptionally slow Reads (avg 145-150MB\/s) and Writes (5.5MB\/s) compared to alternatives which typically perform at >300MB\/s Read and >100MB\/s Write (just for USB 3.1s).Of a dozen USBs tested, unfortunately this Amazon Basics is the worst performer by a significant margin.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"NOT The Capacity Described","reviewDescription":"It says 256 GB in the description, it's printed on the case drive too, but it's really only a 32 GB drive. These scam drives from Amazon Basics are a disgrace.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Not recognized on windows 10 cpus.","reviewDescription":"I bought this due to price. I tried it on my custom built pc with windows 10 pro pc with an ssd and it would not recognize properly. It would show up then not show up and repeat the process constantly. I bought it twice. The reason why is because I gave it the benefit of the doubt that the first one maybe faulty. Nope. Same problem with the second one. It is recognized on windows 11 cpus but all my windows 10 pc has problems recognizing and accessing it. Transferring files also is slow on windows 11. Definitely get what u pay for. I would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Could NOT Write Data!","reviewDescription":"I am returning the two (2) USB Flash Drives as they BOTH are defective!  Cannot transfer data. I get \"Failure to write to the specified item as it does not exist.\"  Both drives (128GB & 256GB) kept opening a window in Explorer so as to accept data transfer but then suddenly closed!  It kept doing this and no matter what I tried, I could not get either drive to accept a data transfer.  I even tried to Troubleshoot the drives as shown by Amazon but even these efforts failed. Very frustrating and disappointing!  All I can say is \"DO NOT WASTE YOUR TIME AND MONEY ON THESE DRIVES! Good luck if you do.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1688688000000}
{"reviewTitle":"It was a used stick with other stuff recorded on it. No good. Wouldn’t work.","reviewDescription":"Unusable. Total waste of money. Would give it zero stars, but your program makes you give a rating.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Is not the product they advertised","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Write rate too slow.","reviewDescription":"Disconnects, cheaply made.  USB 3.1 is not helpful on write\/read rate.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"died in 3 months, lost all my documents","reviewDescription":"I never even thought this \"backup\" device would fail, let alone after only 3 months. I lost my most important document, which now will not open. So upset.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"Horrrrrrrrible speed.","reviewDescription":"I bought these as a cheap back up solution for some old computer files.Read \/ write times are horrible.Horrible.34 GB should not take four hoursFWIW, these are freshly apple formatted.In a brand new Mac studio computer","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Fails macOS integrity test for an EFI installer","reviewDescription":"Needed to create a macOS installer flash drive. The installer fails to boot after the EFI boot picker using this drive.Don’t waste your money on this, buy name brand. I also did NOT get 3.1 speeds using this at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Died after 5 months","reviewDescription":"About 4 months after I bought this in November 2023, it started randomly ejecting itself from my computer. Now on April 2024, it only stays mounted for a few seconds, and many devices can't even read it. Reformatting didn't help. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Do not BUY!!!  Does not function properly.","reviewDescription":"This USB drive does not accept files and does not work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Bummer","reviewDescription":"Bought this for more memory on my fire stick but it doesn’t work because of the fire stick isn’t compatible with the fire stick","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Failed after 6 weeks of use!","reviewDescription":"Windows reported the drive had to be repaired, but was unable to repair the drive.  I have reformatted the drive and will see what happens now, but to have this failure after only 6 weeks is very bad.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Failing after 5 months","reviewDescription":"This thing worked great at first and had a ton of storage, however 5 months later and I'm limping along with it barely able to get it to connect on multiple machines.  It will connect, show its working and then when I go to open a folder or access a file, it crashes.  Does it on multiple machines so I know its not that.  I did manage to copy the contents of it using powershell to my computer and tried a complete format of it, however two weeks later its doing the same thing.  While tempting at this price, I'll stick with the Microcenter ones or just use a portable SSD going forward.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Failed as Time Machine back up","reviewDescription":"I bought this to back up my show files. good thing I always back up twice. if I had entrusted my career to this POS I would be out the job up said creek with put a paddle","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Disappointed","reviewDescription":"Stored two files on here for 7 months (one time use) and the drive is already failing. It will not show up as a device occasionally and at other times it will not allow me to add files or remove them. I am truly disappointed with this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Trash. Dead on Arrival.","reviewDescription":"I don't expect a lot from Amazon Basic but I do expect that the product function at least a little bit. Product arrived dead. The USB stick's shell was the expected cheap brittle feeling plastic but that was intact . The slider felt like it would have broken eventually from normal regular use but that would have been acceptable for my project. The packaging was also cheap but should have been more than enough to protect the item during shipping.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Usb 2 speeds","reviewDescription":"Your typical cheap usb. Was hoping for usb 3 speeds, but I only get 30 mb\/s.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Does not work with Firestick Max","reviewDescription":"I bought this to extend storage on my Firestick.  I tried multiple times to get it to work before finally giving up and returning.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"May work if I can figure it out","reviewDescription":"I ordered this to get more storage space with my Amazon 4K Max. I just could not get it to work. I look at YouTube videos, downloaded through Google and just get to work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688256000000}
{"reviewTitle":"slow as ussual, but ok","reviewDescription":"its slow, other than that it works good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Pendrive lenta","reviewDescription":"Esta pendrive permite almacenar lo que indica pero es demasiado lenta con respecto a otras de menor precio y mayor velocidad.La entrega se postergo 2 veces.No compro más en Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687132800000}
{"reviewTitle":"Very slow","reviewDescription":"pay the extra $5 to get the Samsung Bar. Its much faster and worth the difference in price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"116 gig not 128","reviewDescription":"116 gig not 128.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Worked 1x, failed after overwriting","reviewDescription":"Worked once for transferring a 200gb backup to a new PC, but after that it kept erroring out and disconnecting when I tried to put anything new on it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684540800000}
{"reviewTitle":"Works fine as a Flash Drive but not too well if you want to plug it on TV to play videos","reviewDescription":"I tried to use it to play videos on my google tv but it errors out frequently, if you want to buy it to plug on TV to play movies and videos then I don't recommend, if you just need a flash drive to store files then buy it, its good value","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671494400000}
{"reviewTitle":"If you are buying this because it looks like it is metal, it isn't metal. It's crap plastic.","reviewDescription":"I dislike that it looks like it is sturdy, but is in fact crappy breakable plastic.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"waste of money","reviewDescription":"these are USB 2.0 speed at best. very slow transfer speed.  I think I just want my money back to buy a different memory stick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Bought 256GB flash drive and would only be able to use 30GB","reviewDescription":"I bought the 256GB flash drive model and when I plugged it into my computer it said that only 30GB of storage was available. When I talked to customer service over the phone they said that I was past the warranty and that there was nothing that I could do. I would steer clear of this flash drive and choose another option.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"Doesn't work for long","reviewDescription":"I got this USB drive to extend storage on my FireTV and it worked for about 4 weeks before it was no longer detectable by the TV. Would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Pretty cheap plastic","reviewDescription":"The plastic was extremely cheap and broke in my hand. No way on earth would I trust my data with this product. Amazon should select another Chinese vendor. Pure garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"DO NOT BUY, bait and switch","reviewDescription":"only 32GB capacity but labeled 128GB","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"No longer works","reviewDescription":"After a few months it doesn't work anymore. I have some usb drives from 2006 that still work... Avoid.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Received a used flash drive with somebody's personal data...","reviewDescription":"Bought a new one but received a used flash drive with somebody's personal data inside the .Trashes folder!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Not true 👎🏼","reviewDescription":"This product says it's 256GBs the plastic cover even the container it came in claimed it, but when being used in any computer, tv's laptop tablet anything it is only 32GBs very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"No recomendado","reviewDescription":"No sirvió no puedo meterle videos. Que supuesta mente está muy grande de 3G y la usb es de 128g. Saca tus cuentas 😂","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"slow write speeds","reviewDescription":"max i've gotten is 14mb\/s and not sustainable. coming off an nvme drive that goes a few gb a second. this is ridiculous","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Less space than stated?","reviewDescription":"Why does it have 2 different statements of space? I needed more storage and I thought that's what I was buying.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"False advertising on storage","reviewDescription":"This is labeled as a 128gb storage drive. It only has 116gb available, so take that into consideration when buying.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Disk is Write Protected","reviewDescription":"Disappointed customer here.  My Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive came write protected. I cannot save ANY files to the flash drive. Not even a simple text document.  I have searched the internet for techniques on how to solve this problem and NONE of them have worked.  The USB drive will NOT format. I have tried using the \"attributes disk clear readonly\" command in diskpart as administrator. I have tried making a change to the Windows Registry for USB drives on my computer.  I noticed that when I check Permissions on the flash drive that \"Write\" is not an option nor is there a way to add \"Write\" as an option.  What a waste of time and money.  I guess I will be purchasing a flash drive from Samsung or another brand.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Just STOPPED working for no reason.","reviewDescription":"Bought this USB and put a lot of my personal memories inside. Then I had a bunch of issues with permission? Like why?? Now two of the folders are completely corrupt (had huge memories I am hoping to God I didn't just lose) and I can't open the USB on any computer now. I'm going insane and I've been dealing with this for months. Get a more expensive one please, this is stupid.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"very slow","reviewDescription":"it took 2 hours to transfer 1gb on this drive, while it took 5 minutes to transfer the same file on a different usb 3 thumb drive...did I get a dud?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"USB got corrupted by using only one time.","reviewDescription":"I used only once. I copied some files on USB. When I wanted to read or copy son backup, the files are not possible to copy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Corrupted Files--would NOT buy again!","reviewDescription":"Worked fine for a week or so before not correctly saving multiple excel spreadsheets.  Files corrupted and ultimately lost...along with a substantial amount of work.  Do yourself a favor a skip this garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Isn't full 256 gigs","reviewDescription":"I was going to use this as a way to transfer saved game data from ps4 to ps5, but you are required to have a storage space of 250 gigabytes to format and transfer data. The ps4 read that there was only 248.3 gigabytes of storage, I was unable to transfer data.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Constantly Disconnects","reviewDescription":"Flashdrive worked well for a few months. I have probably filled it halfway before started to eject itself. Completely unusable now. I would return it if I were still able to, but unfortunately, I am out of the return time frame. I will be buying from a name brand now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Putting in the flashdrive","reviewDescription":"I disliked that I had to hold the flash drive a certain way on order for it to work with my hp laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Decent little flash drive","reviewDescription":"This is a decent little flash drive in a plastic casing. It doesn't feel particularly sturdy, but it does the job.To push out the USB plug, just slide the little plastic slider. To pull it back in, push down on the plastic slider and pull it back. It's not super smooth, but it works.I copied 3.35GB of audio files to this, and it took just over a minute. I'm on a MacBook Pro M1 Pro with 16GB of RAM. So it works decently fast, though if you're putting lots of files on (and this baby will hold a LOT; I got the 256GB version), be prepared to go grab some coffee and read a book while the computer does its job.Are there nicer thumb drives out there? Of course. But this is small; it works; and the price is great for the amount of storage you get.","isVerified":false,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"Its not that fast for ps5","reviewDescription":"I was trying to get my gaming pictures for 1700 photos and clips(14GB) it took more than an hour. I think it's sluggish for PS5. But it genuinely works and it's exactly 125GB.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"A Great USB for the price","reviewDescription":"I used this USB drive for extra storage for my console and it works amazingly and I love it although it has 114 GB and is a bit wobbly with using it with my computer but not that noticeable but it works great and it’s worth the buy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Its fast but build quality isn't that great","reviewDescription":"It does its job and does it well. It has good capacity and has fast read and write speed, but it has a fully plastic body and I am afraid that a little bit of improper force and this thing will just pop in half.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1722297600000}
{"reviewTitle":"Ottimo prodotto","reviewDescription":"A diversi mesi dall'acquisto la sto ancora utilizzando e funziona benissimo. Trasferimenti anche molto rapidi.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Italy","date":1719792000000}
{"reviewTitle":"Une clé USB de qualité","reviewDescription":"Cette clé est de bonne qualité, utilisée pour des transferts.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"France","date":1717977600000}
{"reviewTitle":"Gutes Produkt...","reviewDescription":"Tolles Produkt\/Artikel. Kann ich empfehlen! Gutes Preis\/Leistungsverhältnis!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Germany","date":1721260800000}
{"reviewTitle":"Excellent value for money. Like","reviewDescription":"Like the storage capacity. Easy to transfer data between computers.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United Kingdom","date":1718150400000}
{"reviewTitle":"Yo lo compraría","reviewDescription":"No lleva la 5ª estrella porque la carcasa no es muy robusta, pero funciona de lujo, lo recomiendo","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Spain","date":1724371200000}
{"reviewTitle":"A 128gb pendrive with 117gb Storage","reviewDescription":"The main concern is it comes with a 117gb storage mostly 8-9gb is gone. The quality of the pendrive was good and it is very easy to use. The Body of the pendrive is also rigid. The movement of the pendrive is also smooth with the button type system. Currently I didn’t observe any heating the only problem is there is no light indicators on the pendrive. The appearance is also very simple. Coming to the transfer speeds it is quick with the 3.1.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"India","date":1723680000000}
{"reviewTitle":"Missing space","reviewDescription":"Bought it because I needed a 256gb specifically and it only has 231GB of usable space. How is this not considered false advertisement when it's clearly listed as 256gb but only 231 is available?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Quality control is questionable for this product.","reviewDescription":"One of two ordered arrived missing an integral piece if the product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Stopped working after two rewrites.","reviewDescription":"Granted, I could have just been unlucky, but the drive slowed to a crawl after writing a large amount of data to it a few days after purchase.  It them proceeded to seemingly die with Windows constantly throwing a \"Please insert a Disk into USB Drive (E:)\" message while it's plugged in.  I was able to unmount it from that drive letter and try to see what was going on in DiskPart, but aside from being able to see that there is a drive plugged in, it cannot interact with it at all.It was great up until this however so as I said, might have just been bad luck.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"Slow picture processing","reviewDescription":"Live view is very slow, 20 seconds after you click on it. Not very much range Doesn’t detect very well but it is easy to set up. Had a Swann system but went out of support, should have just bought another Swann.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Works fine.  Keychain holder broke of after 2 months of use","reviewDescription":"Keychain holder broke off after 2 months of useamazon could have figured out how to make the holder stronger, either metal or stronger plasticif it broke of with regular use, no abuse or aggressive use. that means it too flimsy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"30 MB Write Speed","reviewDescription":"Please research on why they don't advertise the write speed before your purchase!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Dreadfully Slow","reviewDescription":"Averages around 20-30MB write speed which is just USB 2.0 speed.  There's a reason it's this cheap.  But for Amazon to list it as \"Ultra Fast\", that is an insanely over-wrought description.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Breaks very easy","reviewDescription":"The piece you put your thumb on broke after two weeks of regular use. It is now very sharp and I have to be very careful using it. Not going to replace or return because I don't have somewhere else to store my files while I wait for a replacement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Not 128 gb only 116 gb","reviewDescription":"Works fine,just not 128gb . It's 116gb","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Functional but didn’t last long","reviewDescription":"This was a solid drive initially. Still functional too (to an extent) but the drive cover cracked easily and now the thumb drive pulls out of the casing.Perhaps mine was just faulty","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Stopped working after a few months","reviewDescription":"Product worked great for the first few months but now will not show up on any computer. So now all the data on that is gone. Avoid the amazon crap and just spend the extra bucks for a SanDisk","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"It broke in less than a week.","reviewDescription":"It seemed good enough and then today I tried to open it and what you used to open it snapped off.  Fortunately, I only saved a few files on it, but I did pay around 14.00 for it.  I would avoid buying this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Not DJ friendly","reviewDescription":"Purpose: to be used as a my main USB to hold my music when djing at clubs.I was exporting my library to the USB, and it was taking a painstakingly long time for it to finish. About 20gb of music took 7 hours to export. All for the USB to corrupt.Just want to point out that I: formatted the usb the to fat32, wiped it, retried, wiped it retried. The USB would not be recognized. It would just keep corrupting. This the first usb I’ve had this happen to not sure if I got one that’s fault but would be willing to try a different one","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"False size. Says 128GB but is only 32GB.","reviewDescription":"Would have been nice to get what was described as a 128 GB flash drive but plugged in \"Properties\" says it's a 32 GB drive.  Using Windows 11.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Good memory. The slide button fell off making it awkward to use. 🙄","reviewDescription":"I always liked the \"Basics\" products until this memory stick. The slide button fell off never to be found. It still works but is awkward to slide in and out.🙄","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Very slow and data becomes corrupt","reviewDescription":"Way too slow for a USB 3.x product. Has corrupted multiple times and had to use a 3rd party tool to resolve.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Very Slow","reviewDescription":"I had to write a 40Gb file to this USB and it took over 1 hour. Giving it the benefit of the doubt and sending the data to another machine, I'm already at 1.5 hours with about 25% complete. The worst part is, I can't stop the process as it is a firmware update and I'd risk bricking it. So, it looks like I'll be waiting 6 hours or so for it to finish. I only came back here to see if anyone else had this issue or I accidentally ordered the wrong type of USB drive. You get what you pay for I guess.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Not connecting anymore","reviewDescription":"It was connected to my laptop, I left it like one hour, after coming back it wasn’t connected anymore, I tried with others USB drivers but it’s just this one. When I connect it, it sounds but it’s not longer detected.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Taking MUCH longer than expected to save files to it","reviewDescription":"A little flimsy in that the slider button immediately popped off on first usage (but fortunately clicked back on once I found it again).More importantly the write speed seems to be slow. I've been writing about 230 files totaling 120GB to it on USB 3.0 interface (from Linux system) and although it started at 65 MB\/sec it seems to quickly stabilize at 1 MB\/sec so it's taking MUCH longer than expected to save files to it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Not USB 3.1","reviewDescription":"I love the idea that it's a 256GB flash drive for under $20. That alone is worth the price. However, it is not USB 3.1. I used two different flash drives in the same port, formatted both flash drives the same way (exFAT), and used the same test. The results are pictured and they speak for themselves. Don't expect fast transfer speeds because this flash drive is not USB 3.1.The Samsung flash drive is a 512GB 3.0 I bought 3 years ago for $200 and it is WAY faster than the Amazon \"3.1\" flash drive.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Wouldn't buy again","reviewDescription":"Poor quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"256GB more like 231GB","reviewDescription":"I wouldn’t mind if it was a few gb less than what advertised but 25GB of missing storage is unacceptable and not very practical. The advertised amount should be what is sold.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"SLOWWWWW","reviewDescription":"I have used floppy drives faster than this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Not 256 gb of Data","reviewDescription":"This is advertised as 256gb of data but in reality it is 231gb. There is no programs or unallocated space needed to run software like in hdd or sdd so this definitely needs to be changed to 231. Be aware when buying. Pretty fast but not as fast as my SanDisk one. Still a decent product and time will tell how long it lasts.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"Does the job but wiggles in port","reviewDescription":"As title says, it’s wiggles with the slightest touch within port. All together it’s a mediocre function with abysmal quality.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"I dont know if it just me but I plugged this drive in and formatted it before use and it would just randomly un-mount from the computer. Luckily it was just junk files but I use these for work, I can't have drives that just quit half way thru a transfer.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Sorta works, not confident in it's longevity","reviewDescription":"Storage is 116gb. Works on my laptop well but doesn't work on my desktop, it freezes loading the file explorer. My ports are 3.0 and drivers are updated too and I can't find solutions online even through chatgpt.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"Memory available was far, far below labeled amount","reviewDescription":"The memory stick I bought was supposed to be 128 gb.  When connected to my desktop, it registered at only 31.9 gb of memory. Not even remotely close to advertised memory size.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"This is not a 25GB thumb drive","reviewDescription":"When I plugged in my new 256GB thumb drive I was surprised to find in the settings it’s only a 32GB thumb drive. Not very happy about that! Luckily it worked for what I needed to use it for at the time.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1682121600000}
{"reviewTitle":"Slow and not 256GB","reviewDescription":"This USB was only 230 GB instead of the advertised 256 GB. Very slow.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Amazon basic pending drive","reviewDescription":"Pathetic product from Amazon its worst then any local product ,guys don't go on to the specification and rating it's fake but the reality is that the product will make u sweat to copy a simple file","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1708214400000}
{"reviewTitle":"Scam","reviewDescription":"I have order 128gb and in pendrive down also writen 128gb, but after connecting to the laptop it showing usb drive 116 gb, WTF man","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1710374400000}
{"reviewTitle":"No coincide las GB qué dice","reviewDescription":"El Producto llegó antes de tiempo, funciona correctamente, la falla y error está está en la capacidad de almacenamiento, pedí una memoria de 256 GB, y repente tiene 231, más de me 20 GB menos. No puedo devolverlo por que lo necesitaba con urgencia.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Spain","date":1717372800000}
{"reviewTitle":"Faulty product recieved","reviewDescription":"I've bought this a few months ago and now that i've filled up more and more space, after 60 gb filled up it won't take any more files with the error saying that there is no more space...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1713398400000}
{"reviewTitle":"Just a average product","reviewDescription":"Amazon clame that this pendrives is version 3.1 and speed it on 120 mbps after buying this product I find this speed of this pen drive just 30 mbps and after sometimes use pendrive got heated.So I highly recommended if you use this for data storage purpose then it was good otherwise don't consider this item.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1703376000000}
{"reviewTitle":"Okuma ve yazma hızı","reviewDescription":"Okuma ve yazma hızı rezalet","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719446400000}
{"reviewTitle":"not that fast","reviewDescription":"it says its ultra fast but it only gives 130 mbps speed which lower average","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1711756800000}
{"reviewTitle":"Too slow","reviewDescription":"But quality is goodData transfer speed is too slow just to copy 4gb data it’s taking around 7 hoursEven after waiting for one hour it’s only 200 mb has been transferred","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1707955200000}
{"reviewTitle":"Not as fast has i thought","reviewDescription":"used USB 3.1 port and still for this speed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1714003200000}
{"reviewTitle":"Die Speed lässt auch hier unter Win 10 zu wünschen übrig","reviewDescription":"Lieder zu kopieren fängt kurz bei 15 MB\/s an geht dann schnell auf 4-5 MB\/s zurück, aber seht selbst. Jetzt kommt nur eine Marke wie Sandisk in Frage.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Germany","date":1709337600000}
{"reviewTitle":"Storage was getting corrupted but there was a fix (read the review) and speed is just like 2.0 drive","reviewDescription":"I bought 128 GB drive it works fine at first the data was getting corrupted everytime so if this problem occurs just create partition in the drive and then download things.But speed is a problem it goes maximum at 32mbps even some 2.0 drive gives 40mbpsAs per the price it is ok as I got it in just 650 rupees","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1707264000000}
{"reviewTitle":"Good","reviewDescription":"Pendrive size 256gb but available 235gb","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1713657600000}
{"reviewTitle":"Nell'ordine della decenza","reviewDescription":"soprattutto considerando le mie precedenti, fallimentari esperienze con questo genere di orpelli, di varia origine e capacità, finite finora in due dei seguenti modi: rese al mittente (quando possibile) o gettate nel cassonetto tout court, possibilmente prima che potessero fare troppi danni (in un caso, un paio di anni fa, l'ordigno del demonio mi ha fatto piantare irreversibilmente un portatile, chissà che accidenti ci avevano installato dentro!) quando non si sono fucilate motu proprio nel bel mezzo di qualche operazione.Questa almeno non costa uno sproposito, la capacità (nominale) è quella prevista e se non altro non si pianta mentre la usi - cosa tutt'altro che scontata - però tende, anche questa, a rallentare brutalmente dopo pochi minuti e questo nonostante sia tecnicamente una 3.1Per il momento le ho assegnato un punteggio medio, in attesa di ulteriori e più approfondite valutazioni o sviluppi; è comunque già tanto che funzioni decentemente, spero solo continui così.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Italy","date":1703721600000}
{"reviewTitle":"Stockage spacieux Clé 256Gb (231 Go)","reviewDescription":"Clé livrée d'origine en format Fat32 dans une petite boite en carton, il faudra la formater en ntfs pour pouvoir y mettre des fichiers de taille supérieur à 4go, après test de vitesse on se rend compte qu'en écriture on est bridée en moyenne entre 27 et 40 mo\/s en écriture réelle sur la clé (fichier de test 20 Go).Pour ce qui est de la lecture on obtiens sur un fichier de approximativement 4Go une moyenne de 122-126mo\/s en lecture réelle depuis la clé.La clé est en plastique et ne semble pas très robuste, attention donc à ceux qui on l'habitude de mettre dans les poches arrière des pantalons.Pour ce qui est des vitesses j'ai testé sur un port USB 3.0 ainsi qu'en 3.2. on obtiens des résultat sensiblement différents en test via CrystalDiskMark (voir image jointes):USB 3.0 Lecture ~40mo\/s, Écriture ~20mo\/sUSB 3.2 Lecture ~134mo\/s, Écriture ~58mo\/sOn est clairement pas sur la meilleur puce mais pour ce prix la (achat le 10\/03\/23 au prix de 24€30).On peut pas en demandé de trop non plus elle fait le travaille et c'est surtout pour la capacité  que je l'ai acheter.Niveau durabilité j’espère quelle ne cessera pas de fonctionner dans les prochains mois comme pour certains autres acheteur.","isVerified":true,"ratingScore":3,"reviewReaction":"30 people found this helpful","country":"France","date":1678579200000}
{"reviewTitle":"Great for saving data. Used for excel","reviewDescription":"Great for saving my excel spreadsheet while on the go from computer to computerThe small tab that is the slider for extending the retractable usb part falls off.  If you don’t lose it you can easily snap it back into place.  Wish it was a bit more sturdy.  Without it it’s a pain in the but to slide.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1718323200000}
{"reviewTitle":"Correct","reviewDescription":"Assez lente mais fait le job, c'est une clé standard comme beaucoup d'autres","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"France","date":1717545600000}
{"reviewTitle":"It’s a usb Stick","reviewDescription":"It does what it says on the tin. It’s a usb stick with 256Gb space.Inserted it to my usb socket. Transferred files onto the drive. All done.One little niggle though and probably fairly important.My pc didn’t recognise the drive first time plugged in. Nor the second.  Or the third. Only on fourth attempt did pc finally see the drive and allow me to copy files over.It doesn’t instil me with confidence that my data is secure if it took four attempts for my pc fo eventually see the drive.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United Kingdom","date":1703289600000}
{"reviewTitle":"ce n est pas celle que j ai demandé mais ca fait bien l affaire merci","reviewDescription":"merci encore","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1725062400000}
{"reviewTitle":"cheap storage but not all that","reviewDescription":"Advertised at \"up to 130 MB\/s\" I have a system that will connect at 140-150 MB\/s over USB 3. This thumb drive is reliable but only writes at a maximum 40 MB\/s and reads at 77MB\/sAs cheap storage goes, it's ok but but the blistering speeds I was expecting.Was planning to use this on a Pi 4. Just doesn't cut the mustardHope this helps","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United Kingdom","date":1706400000000}
{"reviewTitle":"Guter Film Stick","reviewDescription":"HalloDie Lieferung kam schnell.Schnell einen Film rauf gespielt und in den BEAMER gesteckt.Der Test klappte wunderbar. Der Film lief sehr flüssig.Ich bin sehr Zufrieden damit.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1716595200000}
{"reviewTitle":"It works","reviewDescription":"Good value","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"easy use","reviewDescription":"none","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Good Backup Capacity","reviewDescription":"The drive works well, although I do wish the transfer speed was faster","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Brand new 256GB, only 231 GB available for actual use!","reviewDescription":"Brand new 256GB, only 231 GB available for actual use!Is this typical?I give it 4* for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Price","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Good usb","reviewDescription":"Do the work","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"It's good for using","reviewDescription":"Very ordinary appearance, basically easy to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Not 128GB it came with 116GB","reviewDescription":"I bought this thumb drive with \"128GB\", I insert it to my computer and it only has 116. It's missing GB, other than that it's a good USB.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Good","reviewDescription":"So far I haven't had any issues with it, keeps everything I want it to hold and I love the fact I'm not worrying about it getting destroyed when I'm not using it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Good basic usb drive","reviewDescription":"Works fine for basic file transfers- would not recommend for use with more complex things (failed when using the drive as part of a Linux conversion for my laptop- but works fine otherwise)","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Amazon Basics 128 GB Ultra Fast USB 3.1 Flash Drive","reviewDescription":"Use these for backup, and they work great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Awesome","reviewDescription":"Works awesome","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Really cheap but functions very well.","reviewDescription":"I really like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Fast speed","reviewDescription":"File transfer was fast. Satisfied with this product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"👍","reviewDescription":"Excelente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Excellent","reviewDescription":"This device works perfectly to save my surveillance camera clips.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"great product!","reviewDescription":"works well, good price, recommended","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Still Works---careful on many of the dirt cheap offers on thumb drives from various brands","reviewDescription":"It's the real deal and a great value.  Highly recommend.  Be careful of some of the \"really cheap\" ones.  A lot of the time the don't quite fit right (poor factory manufacturing controls---China) and often times you will have to reformat the drive from time to time.  So many companies sell these and most of them have few reviews.  Red flag.  This one is made nicely and you don't have to worry about any funny business with a shady seller.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Buenas unidad flash","reviewDescription":"Me gustan mucho estas unidad flash, tenia unos 5 años que no tenia nuevas unidades, estas funcionan muy bien y además, pasan datos muy rápido(Claro, eso va a depender de su computador). Tambien lo que mas me gustan, es que son guardables, para que no se te rompa el puerto.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Good purchase.  Quick delivery.","reviewDescription":"Just what I was looking for!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Great for flashing bios!","reviewDescription":"Flashed my bios no problem with this! I like how it retracts to protect the USB hub!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Love","reviewDescription":"These worked great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Solid","reviewDescription":"This flash drive has been working flawlessly for me since it arrived.  This unit features a sliding protective case.  Unlike most brands with the protective case feature, this one locks into place so that when I insert it into the USB port it does not attempt to close on me.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"Great Value","reviewDescription":"work as intended, got 256gb","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Nice","reviewDescription":"Works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Amazon Basics USB","reviewDescription":"Needed this to get my Blink camera back up, previous USB too small for the job. This fixed the problem, no issues thus far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Fast with plenty of room","reviewDescription":"Amazon Basics 256 gb Ultra Fast USB 3.1 Flash Drive has plenty of room for your entire music collection and its transfer speed is impressive. Although it is lightweight, it's pretty sturdy. The price was also excellent.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Fast, work great","reviewDescription":"Very fast, if you still use 2.0 get these","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Great thumb drive","reviewDescription":"Really good price for the amount of storage it gave me. Easy to use, no issues to report in the time I’ve been using it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Great for Tesla Sentry mode","reviewDescription":"Got this USB to put in a Tesla for sentry mode. It works great!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Es práctico","reviewDescription":"Considero el precio es muy elevado , se suele frizar con frecuencia.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Its just ok","reviewDescription":"Tested on 12600k MSI z690 edge DDR4 corsair, using the rear 3.2 USB ports on the motherboard for better power stability. Used Disk Mark using Real World profile and this was the best results I could get. Good but not great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"dont get if quickness is a priority","reviewDescription":"it will take less time to get to you than it will to actually transfer anything to or from it. but its cheap and holds a lot","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"It's not 256; it's only 231, with a 10 percent reduction","reviewDescription":"The capacity is not as described.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Has a disconnecting issue. Not really good if you have saved files on a Xbox Series X.","reviewDescription":"A really good drive to save things but it has a disconnecting issue. It will work for a while but then disconnects on my Xbox Series X, then reconnects. It will require you to take it out, then restart the console then put it back in. This was a $12 drive anyways but if you aren't using it for save files or games it is alright, not recommended for that use due to the disconnecting issue.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"Causes interference with some blue tooth devices","reviewDescription":"While as a storage device this flash drive works great, when I plug it into my laptop next to the external mouse dongle, it creates some kind of interference that makes my mouse almost non-functional. Unplug it, and the mouse works just fine again.Note that this is if the flash drive is between the dongle and the mouse.If I move the dongle so that the flash drive is in the usb port behind it, the mouse seems to work fine.I've never had a flash drive that creates this kind of interference. Odd, but obviously can worked around.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"Not easy to eject from computer","reviewDescription":"Plugged it in right out of the box.  My Windows 10 machine did not recognize the drive.  I removed it and plugged it in again.  It then mounted. Copied one file to the drive.  Deleted it.  Then tried to eject it.  Nothing.  Waited and tried again.  Nothing.  Used the Context Menu to Eject.  Nothing.After 5 minutes, it finally ejected.  The OS on the drive is not clean.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"Read speed 41.74MB\/s Write Speed 27.69 MB\/s.","reviewDescription":"Advertised 130MB\/s read speed I'm getting about a third of that. Still a cheap thumb stick and will do what I need to do (transfer files to client) but overall not \"Ultra Fast\"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Buen producto","reviewDescription":"Es muy útil pero no es tan buena como esperaba a la hora de pasar datos de un equipo a su almacenamiento muy lento","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Only 116GB instead of 128GB","reviewDescription":"I ordered Amazon Basics 128GB Ultra Fast USB 3.1 Flash Drive 1 pack however when I checked on the computer, really it's only 116GB.  What happen to my other 12GB?  I think they should listed it as 116GB instead of 128GB. The speed is not as fast as I thought.  It took 1 hour and 20 mins to transfer 21GB of data from my computer to the USB Flash Drive for my backup data.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"no cover","reviewDescription":"fast delivery. no cover, I like a cover to protect from dust.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669680000000}
{"reviewTitle":"Missing 26MBs","reviewDescription":"Decent flashdrive but it's missing 26 mbs of storage. Why?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679097600000}
{"reviewTitle":"Ultra Slow, Not Ultra Fast Flash Drive","reviewDescription":"I purchased the 256GB version of this flash drive and I gotta tell you, that the write speed of this flash drive is abysmal.  They should really change the item title of this flash drive because it's misleading especially when they call it \"ultra fast.\" It is in fact not ultra fast at all.Write speeds on a USB 3.0 PC and M2 Macbook Pro were only around 35MBps to 40MBps.  Read speed was accurately described, but the write speed just awful.For the price point, you could get a way better flash drive for just a few bucks more.  I wouldn't recommend this drive to anyone that's actually transferring a large amount of files.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Ich geb mal 2 Sterne weil","reviewDescription":"ich mich durch die guten Bewertungen (4,5 Sterne) leider zum Kauf von gleich 2 Sticks 256 GB verleiten liess.Meine Erfahrungen:Paket wie angekündigt erhalten, gleich ausgepackt und installiert. Ich wollte ca. 160 GB vom Laufwerk D (HDD) auf den Stick kopieren und wunderte mich gleich zu Beginn über die \"rasante\" Kopiergeschwindigkeit vom 10 MB\/s bis 30 MB\/s. Die Betonung liegt eher 10 MB\/s. Ok, ich lass es mal laufen da der Stick als Langzeitspeicher verwendet wird. Bei täglichem Gebrauch hätte ich ihn gleicher eingepackt und zurück geschickt. Also liess ich den Kopiervorgang laufen und schaute mal nach rund 2 Stunden was kopiert wurde. Überraschung! Der Kopiervorgang wurde gestoppt und da stand doch tatsächlich die Meldung, dass ein Order mit 4,3 GB zu gross ist für den Stick. Was soll das? Ich hab den Stick neu formatiert und die Ordner einzeln kopiert. Das funktioniert tatsächlich aber eben sehr langsam. Um die GB-Auslastung des Sticks zu prüfen rief ich die Folder Sizes des Sticks und des Ordner auf der SSD auf. Es gibt einen Unterschied. Obwohl alle Ordner über 4 GB auf dem Stick vorhanden sind werden sie in der Summe nicht berücksichtigt. In den Eigenschaften ist die Auslastung identisch. Ich empfehle den Stick nicht zum Kauf.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1723161600000}
{"reviewTitle":"Enttäuschender Ausfall nach kurzem Einsatz","reviewDescription":"Das Amazon Basics 128 GB USB 3.1 Flash-Laufwerk startete mit vielversprechenden Spezifikationen und einer hohen Erwartungshaltung meinerseits. Mit einer angegebenen Lesegeschwindigkeit von bis zu 130 Mbit\/s und der großzügigen Kapazität von 128 GB schien es ideal für den täglichen Gebrauch, sei es für die Übertragung großer Datenmengen oder als erweiterter Speicher für Multimedia-Dateien. Die USB 3.1 Technologie versprach zudem eine schnelle und effiziente Leistung.Anfängliche Erfahrungen:Performance: In den ersten Tagen funktionierte das Laufwerk tadellos. Dateien wurden schnell geladen und gespeichert, und die hohe Übertragungsgeschwindigkeit wurde deutlich spürbar. Diese Performance machte es zu einem scheinbar hervorragenden Wert für den Preis.Doch dann kamen die Probleme:Zuverlässigkeit: Leider hielt die Freude nicht lange an. Nach nur wenigen Tagen Nutzung erlitt das Flash-Laufwerk einen vollständigen Ausfall. Es wurde plötzlich von keinem meiner Geräte mehr erkannt, und jegliche Versuche, auf die gespeicherten Daten zuzugreifen oder den Stick zu formatieren, schlugen fehl.Datenverlust: Dieser Ausfall führte zum Verlust aller darauf gespeicherten Daten. Für mich als Nutzer, der wichtige Arbeitsdokumente und persönliche Daten auf dem Flash-Laufwerk gespeichert hatte, war dies nicht nur ärgerlich, sondern auch problematisch.Verarbeitungsqualität: Obwohl das Laufwerk äußerlich robust wirkte, legen die internen Komponenten nahe, dass die Verarbeitungsqualität möglicherweise nicht den Standards entspricht, die für eine langfristige und zuverlässige Datenspeicherung erforderlich sind.Fazit:Das Amazon Basics 128 GB USB 3.1 Flash-Laufwerk hat anfänglich durch seine Leistung überzeugt, doch der schnelle und unerwartete Ausfall hat dieses Bild stark getrübt. Dies wirft Fragen bezüglich der Qualitätskontrolle und Zuverlässigkeit der Amazon Basics Speicherprodukte auf. Für potenzielle Käufer würde ich empfehlen, möglicherweise etwas mehr zu investieren in Produkte, die eine höhere Zuverlässigkeit und Kundensupport bieten.Dieser Vorfall hat deutlich gemacht, dass bei der Auswahl von Datenspeicherlösungen nicht nur die Spezifikationen, sondern auch die Langzeit-Zuverlässigkeit und die Erfahrungen anderer Nutzer zu berücksichtigen sind.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Germany","date":1713139200000}
{"reviewTitle":"Do not buy","reviewDescription":"You will get only 109 GB","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1724112000000}
{"reviewTitle":"Hit & Miss","reviewDescription":"\"You get what you pay for\", goes the saying.I bought this knowing that usually Amazon Basics are good quality items but this one was not. It was quite cheap looking and would work at times and then other times it would not. Got tired and went back to the old tried and tested brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1723248000000}
{"reviewTitle":"Laaangsam","reviewDescription":"Ich nutze diesen USB Stick, um eine Datensicherung - verschlüsselt mit veracrypt - bei mir zu haben.Das initiale Befüllen darf auch gerne etwas länger dauern, weil sich viele Daten nicht mehr ändern. Dieser Stick bricht aber alle Negativrekorde: Er schafft es pro Sekunde 2 MB zu übertragen. So langsam war bisher kein Stick. Das Befüllen wird mit 130 GB wird so ca. 18 bis 20 Stunden dauern. Das kenne ich nur von billigsten USB Sticks.Ich habe mittlerweile auch mehrere Dateisysteme und Clustergrößen probiert: FAT32, exFAT, NTFS, ...  keine große Auswirkung. Der Stick bleibt langsam.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1722556800000}
{"reviewTitle":"Bewertung nach 4 Monaten: Mangelhaft!","reviewDescription":"Unterschiedliche USB Anschlüsse, bei denen meine anderen USB3 Sticks zwischen 30-80mb\/s erreichen,schaft dieser Amazon USB3 Stick nur zwischen 1-4mb\/s.Ob kleine oder sehr große Dateien, Fat32, exfat oder NTFS formatiert, der Stick versagt auf ganzer Länge.Zum Glück ist er kein Fake, es passen wirklich über 240GB drauf.....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1724284800000}
{"reviewTitle":"Very very slow","reviewDescription":"Edit: 5 months in and the drive is dead. Ignore the Chat-GPT positive reviews (all of them have the exact same type of writing, you'll notice), this is not really usable at all. There's also zero warranty so there's no recourse when the drive does fail. Get a name brand product with warranty instead.Very poor write performance. Good capacity for the price. Read speed is good - 75-85 MB\/s through the entire drive.Decent if you can live very low write speed, thus archive-based use. I see nothing more than 32 MB\/s, often lower. There is no cache (software or hardware), so the write speed is extra slow with no short-term bursts possible.I was expecting better performance than the low-cost Sandisk 256GB drive I was using, but it's a little worse overall, in both write and read performance.Unlike most other drives, the large form factor means the extender mechanism should work well even if the latches wear down. No lanyard is included, even though the drive allows for one. I'd say with caveats, it is usable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1710374400000}
{"reviewTitle":"Too slow","reviewDescription":"For 256gb size, the speed was too slow and was taking me almost a half an hour to copy large files into it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"I lost connection with the drive after a month.","reviewDescription":"I lost connection with the drive after a month.  It forced me to reformat the drive and lost all my data stored on the drive.  Beware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Not happy...","reviewDescription":"Very spotty performance, many dropouts and lots of pixelation. This is definitely an inferior drive, and I'd suggest everyone avoid it and by a name brand product instead","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"I might have a dud but on my computers it is really slow.","reviewDescription":"I've used it on multiple computers and the speed is pretty slow. I'm not sure if I might have received a dud. The speed I'm seeing is around 30 MB\/s when transferring to and from an SSD on a usb 3.0 port. If I use my external SSD on the same usb 3.0 port it has around 125 MB\/s so the computer and port are capable of going faster. The bottleneck appears to be the USB drive.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Just...slowwww","reviewDescription":"Not sure why, but this USB drive is one of the slowest I've ever had.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Not getting option to move apps","reviewDescription":"My husband purchased several of these to put on each TV. We followed instructions to move apps, but there is NO OPTION TO MOVE in manage I stalled apps. Waste of Money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Not that fast.","reviewDescription":"This USB drive is not that fast. There are much faster options in this price range. I should've done my research first.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Not 128 gb","reviewDescription":"Realized mid download I didn’t have enough storage space on a new 128gb flash drive. Doesn’t even have 32 gigs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"116 GB Storage","reviewDescription":"I plugged in my new 128GB flash drive just to find out it only has 116GB of storage. I can understand not getting the 128GB exactly, but missing 12GB, that's a lot! I should have trusted the terrible reviews.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"slow and limited","reviewDescription":"Would not copy a 7 GB video file, even though it would copy groups of video files that were more than 10 GB. The overall capacity is deceiving with this limit not advertised.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Ni tanta velocidad ni tanta capacidad.","reviewDescription":"Pasé unas carpetas de 119 Gb que ocupan en disco 120 Gb, en la memoria USB resultó que ocupaban 143GB, y en realidad tengo como espacio usado 171Gb. Ya sé que los criterios de medición varían, pero ¡tanto! En cuanto a velocidad, con los 30 Mb\/s prometidos los 120Gb tardarían 67 min aproximadamente, en realidad a tardado 8 horas.Es verdad que dada las porquerías de memorias chinas que se ofrecen, también en Amazon, esta resulta pasable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Spain","date":1709251200000}
{"reviewTitle":"cheapest available 230 GB amazon basic pendrive","reviewDescription":"only 230 GB storage capacity available.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1712880000000}
{"reviewTitle":"Pratica ma con capacità minore e senza spia led","reviewDescription":"Sapevo che avrei avuto minore capacità di archiviazione dal dichiarato, ma non immaginavo che non fosse dotata della spia led. È la prima volta che mi capita. È veloce ma senza spia sembra morta. Una sensazione che avrei evitato. Comunque è pratica nella chiusra a scatto e non rischio di perdere il cappuccio. La userò molto.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Italy","date":1711411200000}
{"reviewTitle":"Subpar performance","reviewDescription":"for a USB 3.1 drive, this performs rather subpar and more on par with some better USB 2.0 drives in longer transfers. realistically the drives fine for normal use but shouldnt be used for endurance","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United Kingdom","date":1708041600000}
{"reviewTitle":"Günstig, Schreibrate niedrig","reviewDescription":"Vom Preis her alles in Ordnung. Aber die Schreibrate geht bei mir bis auf 3 MB\/Sek. runter","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Germany","date":1719360000000}
{"reviewTitle":"fake product this is 2.1 usb","reviewDescription":"not a 3.1 use this is 2.1 usb usb speed low only speed 26mps","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1710892800000}
{"reviewTitle":"Lento","reviewDescription":"La transferencia de datos es muy baja, no de 3.1 y la memoria pone 116 en vez de 128 Gb 🤔","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Spain","date":1716768000000}
{"reviewTitle":"Durchschnittlicher USB-Stick,","reviewDescription":"akzeptable Geschwindigkeit, aber Zuverlässigkeitsbedenken nach längerem Gebrauch.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1718755200000}
{"reviewTitle":"Kurzlebig","reviewDescription":"Dieser USB-Stick hat nach nur wenigen Wochen den Geist aufgegeben. Datenverlust und unzuverlässig.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Germany","date":1717027200000}
{"reviewTitle":"no so good performer","reviewDescription":"RWseq+4k: 140\/40\/15\/4. That's pretty nice for a throwaway thumbdrive. Can't care less about read speed as what i'm always waiting for is writing completion. As it's usual in this market, read speed is better. Seq write speed is much less than 256GB version (100MBs) but acceptable and as planned. However Windows copy  shows lot of choppiness (see graph) and real speed is just 20MBs on several USB controllers. And that's not good. I care very much about 4K write speed too - that's what massively slows down Linux installations. So it's better than usual <1MBs. A  nice bump. But with the choppiness, it cannot be used for ISOs, nor recording (like several customers point out). Just like 99% of others on the market.Noticed the drive went off and on many times. Brief resets audible on Windows and visible in usbdeview.exe.The device looks like Extreme Pro but it's far from that. Controllers seems cheap.  No LED light. Rated USB3.2 400mA.Sadly no usable USB-A other than Extreme Pro exists in non-SCSI class. For USB-C, at the same price, I recommend blue Samsung Type-C USB which will blow away this one out of water (400\/60\/13\/25). Yes, 25MBs 4k write at 3cm size, unreal.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Germany","date":1690243200000}
{"reviewTitle":"Does the job but not impressive.","reviewDescription":"Read speed is good, over 100MB\/s as I would expect for a USB 3 drive. However Write speed is terrible both in bechmark and real world use and file copying keeps pausing and changing speeds during a write.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1676419200000}
{"reviewTitle":"Doesn't work for what I needed","reviewDescription":"I bought this to use in my PS4 and it's too bulky and doesn't fit. Will be returning.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"Smaller than advertised","reviewDescription":"It's a solid storage device, but when I plugged it into my console it was 6GB smaller then advertised (I got the 256GB)","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Cheap plastic on outside","reviewDescription":"While the product works great, the outer case is made of a cheap plastic.  Seems like it will crack easily.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Pretty good.","reviewDescription":"The large amount of storage is nice. Occasionally it will disconnect from my Wii u but otherwise it works fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Satisfied so far","reviewDescription":"The build of the Pendrive is good, performance and longevity to be seen in coming time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1724284800000}
{"reviewTitle":"Overall good","reviewDescription":"Seems speed low but working fine. Okay build plastic quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1722902400000}
{"reviewTitle":"Its actual size is 116Gb huge gap of 12gb","reviewDescription":"Its size is 116gb its a huge gap of 12gb which is too Much I doubt its 3.1 as I didn't get much speed.  Build Quality is excellent.Actually its good but 12gb less memory.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1721433600000}
{"reviewTitle":"Works","reviewDescription":"Can't complain much. It works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1723248000000}
{"reviewTitle":"Less Capacity","reviewDescription":"Purchased 128 GB pendrive but actual capacity showing 116 GB only .Looking good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1721088000000}
{"reviewTitle":"Did the trick","reviewDescription":"I was looking for a USB drive for my Nvidia Shield and this works great.  Enough storage space and wasn't too expensive.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"slow - 22MB\/s","reviewDescription":"USB 3.1 interface speed? We'll never know if the chips inside can't provide  high speed data. Ok for storage - but be prepared to WAIT to load and unload data from this thumb drive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Great for photo\/video storage","reviewDescription":"Works like a charm with my laptop and I've been able to efficiently use it as storage for my phone's photos\/videos. While I had upwards of 3,000-4,000 combined photos and videos to transfer, the speed of transferring them over was very satisfactory (Plugging it directly into a USB port on my laptop greatly aided in increasing speed as opposed to plugging it into my USB port hub, I tried it out with both). The only downsides are that there is 116 GB of transfer space rather than 128 GB (this doesn't bother me a great deal because I still have plenty of space leftover) and that there is no cap to put on the end of the USB stick to keep out dust\/debris (it can only be retracted back in).","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Reliable storage solution for me","reviewDescription":"I've been using the Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive on both my desktop and laptop, and I'm genuinely impressed. It seamlessly integrated with both Windows 11 and Windows 10 operating systems. The transfer speeds are commendable, and the build quality feels robust. It's been a reliable storage solution for me, and I appreciate its consistent performance across my devices. Highly recommended for those in need of a dependable and speedy flash drive.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Very easy to use","reviewDescription":"I finally got the replacement yesterday and it worked just fine. I have already used it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Good quality","reviewDescription":"Have been using a while.  Small,  Inexpensive.  Good quality,  if a little plasticky.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"All the GB but very slow","reviewDescription":"I have the 128G one. Write speed is 6.8 MB\/s, read speed 40.7 MB\/s. I'm using this for archival storage so I don't care but don't be fooled that you will get anything like USB 3.x speeds out of this device. It could be USB 2.0 and be just as fast.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"So much space at a value price, but...","reviewDescription":"Would have given 5 stars except for the fact that one (I bought two) open and closes with complete ease, the other (after I've already stored stuff on it) doesn't. The other one is hard to open and close, so I leave it in an open position inside a plastic baggie as to not collect dust. Still all in all, that wouldn't deter me from buying more in the future as the amount of space on these things for the price is well worth that little snaffou. Again, it's in storage in a drawer so not really a big deal but is a slight disappointment.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Only 231 GB out of the box","reviewDescription":"Yeah when buying storage think about it like paying taxes, they take 10% no matter what you do. But seriously what if I needed something that was 250GB and now I can't use my \"256GB\" USB drive -_-.Also, all the dummies formatting it, go to your Task Bar, type Disk Management and click onto the USB disk and delete the volume, unplug, then reinsert it, then just right-click the new volume and it should reformat to the max size, and for anyone who didn't limit their drive to 32GB.... don't do it.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"If you need a flash drive this is a good one","reviewDescription":"I have used many of these and this one is as good as it gets. It has enough storage space for my need. Plug.. drag.. store...simple","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Easy to use","reviewDescription":"I like how much memory it has I like the appearance and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Good drive, no issues yet","reviewDescription":"A good basic flash drive for a good price. Works well with Mac desktop.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Fast drive","reviewDescription":"Good value, works with both the Mac and Windows","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Works as expected","reviewDescription":"Works as expected, was used to flash my bios.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"works perfectly","reviewDescription":"arrived quickly and works flawlessly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Item is excellent","reviewDescription":"I have no dislike I like what I see","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"When car has USB ports only.","reviewDescription":"New cars no longer have CD players. These made transfer of music for trips simple and are easy to store","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Amazing","reviewDescription":"Its packaging is good the stick is nice and it has transfer speeds of up to 30 MegaBytes Per Second! Why wouldnt you get it?","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Fast & generous sized USB 3 drive for the price!","reviewDescription":"All positives on this USB drive, simply took a gamble on the Amazon Basics name after receiving an invitation to buy on promo recently. Not only is it Huge, also fast transfer times on a USB 3.0 connection compared to every one I have, to include a pair of Lexar ones of the same size (& more costly at around $30) purchased at Costco 4-5 years back. Of course, these components typically gets better over time, can recall a pair of 4GB SanDisk ones costing near the same (each).A lot of computer users, myself included, could backup our Windows or \"C\" partition with this size of a USB drive. As long as the backup program allows. Or can store lots of digital pics & movies, although I prefer to store these on traditional hard drives, the spinning ones. They'll last longer on magnetic versus Flash media. This is Not because of a defect in Flash (cell) type media, rather if sitting unused for a long time (from 2-5+ years), any copies made won't look as good as when taken. Don't store near hot places, like close to a computer.Will be buying more of these in the near future! One more use of this is to have a portable, Secure operating system in your pocket, like Windows to Go or a Linux based one, such as Linux Mint or Ubuntu, among others. There are guides on how to do this, but most important, unplug the main drive on your computer while creating this. Otherwise, can mess the bootloader of your Windows computer up. Just unplug the SATA cable (the narrow one) to your existing drive or remove the drive if NVMe or mSATA. At it's 128GB size, perfect for secrecy!Bottom line, if I could give this drive 10 Stars, I would, and by the time it's said & done, will have 5-6 of these for my purposes (storage & secret OS's). Also has the Amazon Basics warranty. So be sure to test when purchased.EDIT: This drive has been so fast & dependable that I also purchased the 256GB model for $5-6 more!","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Simple, fast, does the job.","reviewDescription":"Simple and utilitarian. A little bulky but eh? who cares? Inexpensive","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Read and  write speed","reviewDescription":"Read and  write speed is not more than 5mbps","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1720569600000}
{"reviewTitle":"Kurzlebig und unzuverlässig","reviewDescription":"Nach nur wenigen Monaten gibt das Laufwerk den Geist auf. Datenverlust ist ein Albtraum! Investiert euer Geld besser woanders.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1724803200000}
{"reviewTitle":"Speicher kaputt","reviewDescription":"Der USB-Stick ist nur 4 Monate in Gebrauch und bereits Totalschaden.Trotz sorgfältigem Behandeln und Ausstecken ist plötzlich - von einem auf den anderen Tag - der Speicher kaputt.Der Laptop erkennt den Stick, aber ein Zugreifen auf die Daten ist nicht mehr möglich.Total ärgerlich!Ich rate sehr von diesem USB-Stick ab und würde lieber mehr Geld in einen guten USB-Stick investieren, bei diesem die Daten langfristig zur Verfügung stehen. Vor allem wenn man kein Backup gemacht hat, sind die Daten von einem auf den anderen Moment weg.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719100800000}
{"reviewTitle":"Fehlgegangene Kaufentscheidung","reviewDescription":"Ich dachte, ich benötige ein schnelles Flash-Laufwerk für meine Daten und habe dieses Produkt ausgewählt. Leider war die Geschwindigkeit nur halb so schnell wie angegeben. Es liest nur etwa 60 Mbit\/s, was absolut nicht ausreichend ist. Ich bin enttäuscht und würde nicht wieder kaufen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1721952000000}
{"reviewTitle":"Everything works but materials are very cheap","reviewDescription":"The USB works as intended. The only problem is that its made of very light plastic so it does not feel like its high quality. The little fob that reveals the USB is also made of cheap plastic and rattles if you shake it. Overall, functionally its great but its design is quite bad compared to other USBs which is my reason for 2 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717286400000}
{"reviewTitle":"Failed after a week","reviewDescription":"Stored Xbox games, formatting went well, so did installing, after a week, boom, dead. Don't know why, it just died, only reason I give it 2 stars is because it was fast.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1719100800000}
{"reviewTitle":"Verspricht mehr als er hergibt.","reviewDescription":"Die 2 bestellten USB Stick weisen gravierende Mängel auf. Statt der angegebenen 128 GB werden manchmal nur ca. 500 MB als frei zur Verfügung angegeben. Bei Datenübertragungen ist nicht die Möglichkeit gegeben größere Dateien zu transferieren (4GB z.B.)Design und Geschwindigkkeit (wenn sie mal funktionieren) sind völlig in Ordnung.Was die Haltbarkeit (Entmagnetisierung)  angeht kann ich leider noch nichts sagen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717286400000}
{"reviewTitle":"Weniger Speicherplatz als beschrieben","reviewDescription":"Ich habe die USB ohne überprüfen benutzt. Und dann hat sich herausgestellt, dass ich viel weniger Speicherplatz bekommen habe (32GB) als beschrieben wurde (128GB)…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1722384000000}
{"reviewTitle":"128 GB schlecht, 256 GB gut","reviewDescription":"Der 128 GB Stick ist sehr langsam. Wenn man viele Dateien drauf lädt , reduziert sich die Schreibgeschwindigkeit dramatisch, so dass der Stick fast unbrauchbar  wird. Ich dachte, dass der Stick defekt ist, aber bei einem zweiten Stick derselben Kapazität war es genauso. Der 256 GB Stick dagegen hat das Problem nicht und ist sehr schnell.Nachtrag: auch der 256GB Stick hat das Problem, dass er immer langsamer wird, wenn er weitgehend voll ist. Beim 128GB Stick merkt man das eher, weil er eben schneller voll ist.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Germany","date":1713398400000}
{"reviewTitle":"Enttäuschend","reviewDescription":"Ich habe den Stick bestellt, da ich ein Video mit 4,31 GB habe und es auf einen USB- Stick ziehen wollte. Nun sagt mir aber das System das 128GB nicht ausreichen für mein Video?! Bitte was?! Das sollte nicht passieren. Sowohl kleinere Videos mit nur 1GB kann ich kopieren. Nur keine größeren. 😵‍💫","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717632000000}
{"reviewTitle":"IT STOPPED WORKING.","reviewDescription":"Granted...now several months old since purchased.  It stopped.  Like it's not making contact connection for unknown reason.I did like the unit  - when it worked.Luckily I didn't have a whole lot invested.And it was only a Backup.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"NOT 128GB! Try 116GB more like.","reviewDescription":"What is the point of advertising it as 128 except to deceive people? Seriously, nobody at Amazon decided to plug it into a Windows 10 system and check the properties, and yea...116GB folks. The teeny tiny print in the  small brochure claims it is a variance in the way memory is measured. So they choose to advertise a falsely high reading when the reality is far different. What a load of bs. On a good note, it is made in Taiwan. The slide button locks properly in position. There is no activity light on the unit though. So it won't alert you to suspicious access.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Get what you need cheaper.","reviewDescription":"If I wasn’t gonna splurge for a ssd I’d buy a bunch of these, quality is good for the price and much more cost effective than most other drives. Becoming fragmented very fast downloading files to it however that doesn’t really have anything to do with the quality of the drive itself.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Insane RF noise","reviewDescription":"Just a memory stick. Plan on wrapping it in foil to prevent it from wrecking your RF device connections and your WiFi connection if you're on a laptop. Thank you USB 3.0 standard, welcome to 2024.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Almost an easy recommendation","reviewDescription":"Drive consistently ran at 30-35mb\/sec download speeds which isn't bad overall, but for a USB3 drive is just too slow.  SanDisk offers drives for similar money with much faster throughput speeds.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Acabado en plastico","reviewDescription":"El acabado externo en plástico lo hacen sentir un poco fragil","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Gato por libre","reviewDescription":"El cartel dice 128 g pero te llegan 116 g . 12 g que se perdieron en la paquetería . No pasa nada , aún es útil el almacenamiento . Lo malo que onedrive y Apple te cobran 3 dllr. Por almacenamiento extra","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Limited use.  Had to buy another cuz this didn't work for my phone","reviewDescription":"Couldn't use w my phone so can't rate capacity.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Not so convicing but just fine","reviewDescription":"This item was bought after I have been using The San Disk Extreme Pro which I also bought from here, therefore due to comparison, or not even comparison. This one feels cheap which of course reflects the $11.99. Anyway It just works and I gave it to my workmate but the transfer speeds for which I needed it, are not also that good. Just 20MB\/s on average which is very small compared to the San Disk which has 90-130MB\/s. The slide is also not intuitive but it just works. So the item is Basic as its name suggests","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686096000000}
{"reviewTitle":"Very Slow Uploading","reviewDescription":"I am transferring videos to this USB drive and it is extremely slow. I bought the Samsung 256 USB drive and it is way faster. 5 times faster.If you don’t mind the long wait uploading then it may be alright for you. But for a few dollars more I won’t buy this Amazon USB again.Waste of money.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Memory Stick","reviewDescription":"The fit, quality and ease of transfer is perfect.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Amazing Value!","reviewDescription":"I been using this for quite some time now and have had no issues with it. it works as described. The speed is good as well. For a 256gb flash drive, the price value is definitely worth it. Its great quality.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Great product.","reviewDescription":"All of my needs were met.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Nice decent usb","reviewDescription":"It is a very good usb drive. Nice decent design and good price for the product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"128 gb","reviewDescription":"needed it for  blink  64 GB was too small","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Good price.","reviewDescription":"Very good pendrive! Good prise.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Trabaja bien","reviewDescription":"Compre dos y las uso casi a diario y funcionan muy bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Good Price","reviewDescription":"Good price and working 100%","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Tested great with Initdisk","reviewDescription":"There are so many USB flash drives out there that are not what they are advertised as far as the size. I purchased this one because of the great price and tested it with initdisk and it passed flying colors.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Bueno","reviewDescription":"BuenoBueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"The bloody plastic keyring bit","reviewDescription":"Broke off and lost it, just dont put it on your keyring. hopefully they will revise the design to be more durable. Will never buy again","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United Kingdom","date":1717027200000}
{"reviewTitle":"Quality","reviewDescription":"Quality is low","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1717804800000}
{"reviewTitle":"Sehr lahm","reviewDescription":"Sowohl Lese- als auch ganz besonders die Schreibgeschwindigkeit sind minderwertig.Nur der niedrige Preis tröstet etwas.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719705600000}
{"reviewTitle":"Also schnell ist er","reviewDescription":"Also da ja laut USb 128gb sein soll muss ich sagen,das ich entäucht bin sind bei mir nur 116gb drauf fehlen gute 12gb also bin sehr entäucht darüber. Sollt doch lieber Mal Test machen bevor ihr solche Produkte verkauft. Daher nur 2 sterne","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717027200000}
{"reviewTitle":"Günstig aber...","reviewDescription":"Der Stick ist zwar günstig aber extrem langsam.Stick mit 215 Gb beschreiben dauert 1 Stunde 40 Minuten ( 32mb\/sek)Das Geld dafür hätt ich mir sparen können,das schafft auch ein USB 2.0 StickNoch ein mal kaufen ? nein danke.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717545600000}
{"reviewTitle":"Langsame Schreibgeschwindigkeit","reviewDescription":"Für den Preis hätte ich mehr erwartet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1722988800000}
{"reviewTitle":"Décevant","reviewDescription":"Trop lente Pourtant c'est une 3.0De plus des le départ il y a 20 go de moins et ça c pas cool! J'ai payé pour 128 et non 108 gi  c énorme. Je n'en reprendrai pas une même !","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1721260800000}
{"reviewTitle":"Bueno pero nada duradero","reviewDescription":"Ha funcionado muy bien, pero muy poco tiempo. Con 14 meses se ha roto (con todos los datos perdidos, por supuesto), y sin garantía de Amazon, obvio.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Spain","date":1720569600000}
{"reviewTitle":"Same thing happened on ths pandrive also so plz return it","reviewDescription":"So again same problem hppnd come in ur ths pendrive","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"India","date":1716249600000}
{"reviewTitle":"macht was er soll Dateien sichern aber sehr sehr langsam","reviewDescription":"er ist langsam","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1721260800000}
{"reviewTitle":"Meets advertised specs for speed and capacity.  Good price, fast delivery.","reviewDescription":"Ordered a 128GB flash drive and that's what I received.  This is worth mentioning, because the marketplace is awash with fake flash drives whose actual capacity is far less than what's claimed.  (It isn't hard to buy a cheap \"128GB\" drive that's actually a 32GB drive with firmware hacked to claim a much larger capacity.)  But this drive is the real deal.  I loaded it with 127+ GB of test data and then verified that *all* the data was present on the drive.Write speed averaged 12MB\/sec over the entire time of filling the drive.  Short-term burst write speeds hit about 40MB\/sec.  Read speed was a fairly constant 70MB\/sec.Can't say much about longevity, but for the week that I've owned it, it's been doing everything it promises.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Super Fast for Backing Up All Your Files and Photos!","reviewDescription":"If you are looking for an easy way to back up all your Files and Photos this really is a great flash drive. Finally I got organized and now have all my folders, files and photos stored on this flash drive. I'm very happy with how quickly files copied over, like in seconds. This gives you peace of mind! So in about three minutes I was able to copy everything over. This is much faster than copying to CDs for sure! I'm very happy with this flash drive and I think you will be very impressed with how it just plugs in and works instantly.~The Rebecca Review","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Good product","reviewDescription":"It appears to be a good item and should work well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Amazon Basics Products Never Disappoint","reviewDescription":"Like all Amazon Basics Products the quality and price never disappoints. The transfer speed for multi data transfers over 2 to 3 GB only took about 1 min or to transfer data. Would highly recommend!!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Great price and works well","reviewDescription":"I run a computer repair business and my Flash Dive I had broke on the end. This has been a good replacement.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Excelente","reviewDescription":"Cumplió con su función","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"It's a flash drive","reviewDescription":"This device works well for the purposes it was created for - transferring and storing files. The capacity (128GB) is, well, capacious, and serves my purposes quite well. It doesn't make coffee in the morning but I doubt a flash drive will do that.If one does, let me know?","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Worked First Time","reviewDescription":"Very easy to install and use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Works great on Smart TVs!","reviewDescription":"I originally bought this and another smaller USB together & this 1 was going to be used for my son's laptop for school but sadly the other smaller USB wouldn't work on our Smart Fire TV or Smart Roku TV so we tried this one & it worked perfectly on the TVs. Now our living room TV has much more storage than it will ever really need lol. It doesn't have the full 256 GB storage it is off by only a little bit but for the cheap price, I don't mind that. I will be buying a second one of these & possibly even a 3rd one here soon for my laptop so I can store my medical documents and free up space on my laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Fast and good","reviewDescription":"Faster than my previous thumb drives.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Flash Drive","reviewDescription":"The flash drive works great and is fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"worked fine to transfer data from an old pc","reviewDescription":"I had to get a new laptop and used it to move stuff from 2 old PCs. Worked well, but it was only a month ago and I don't know about longevity.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Perfect, easy to use","reviewDescription":"Did what it was suppose to. Easy to use. Slider gets stuck sometimes but it’s fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"As advertised!","reviewDescription":"Glad to have this; plenty of space for all the pictures I needed to copy. Fast access.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Great quality.","reviewDescription":"Tons of storage for family pictures","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"todo ok","reviewDescription":"una excelente memoria","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Usb 256 gb","reviewDescription":"Muy buen producto funcionó a la perfeccion","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Flash drive","reviewDescription":"Exactly what I needed!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Ready to use out of the box for those of us using windows.","reviewDescription":"It came will packaged and protected. I was able to just plug it in to use for moving files between the personal computer and laptop. It also works like a charm plugged into a car stereo for playing audio books or music.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Works well","reviewDescription":"I've had it for a while. Works good. Would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Not even good as a paper weight.","reviewDescription":"I bought this in late May. I trusted Amazons reputation so I didn't bother to check that it was okay. I put it in my desk drawer in the sealed box until tonight, August 27th.There is a huge problem.It is useless. A total waste of money. It can't be formatted because it's \"Write Protected\". I can't use it because it's not formatted. \"Properties\" indicates there is no used space and no space available. When I tried to format it, it shows less than 3 GB on the drive.  (See images)It's worthless and I can't get my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"False hopes","reviewDescription":"I bought this to play music in my car (call me old, idc). It worked for a week and then stopped reading in my car. Just keep getting hit with \"check device\" errors. Its not my car because the rest of my flashdrives work fine","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"DO NOT BUY!!","reviewDescription":"This is valse advertised. Claims to be 256Gb, when plugged in to any computer, it says it has 231 GB of free space. It is normal to have some less free space than advertised but this is a little bit more than I would expect. This was not the problem. The problem was when I tried to Transfer a 93 GB file from my hard drive to the USB drive. Every time it says the file is to large. I also tried to to transfer call of duty to it just to see which is around 100Gb and it said the same thing.","isVerified":true,"ratingScore":1,"reviewReaction":"37 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Returned","reviewDescription":"Didn’t fit my IPhone","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Unreliable for data backups","reviewDescription":"I purchased this Amazon Basics 256GB USB 3.1 thumb drive to back up my laptop data.  It continually gives me format issues which prevents me from getting reliable backups.  I'm going to order a known brand such as ScanDisk.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"bricked on arrival","reviewDescription":"Intended to use it for Windows installation on a new build. The device failed failed within minutes of its removal from packaging, as I was copying Windows installation media onto it. Tried several different USB slots and tried formatting, unsuccessfully.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Can only upload a 4mb Video","reviewDescription":"I cannot upload a 4 hour video, it has to be done in tiny 4 mb bites, even after reformatting it. All the files I needed this for are “too large.” My largest file was 20mb and it couldn’t handle the size","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Not working!","reviewDescription":"After minimal usage drive is totally flaky! Would not buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"SCAM!","reviewDescription":"When first plugged into computer it read as 128gb, I started getting errors when attempting to transfer large files onto drive. After which I tried to formated the drive only to find a 32gb option. Ran a disc check to verify, and sure enough there is only 32gb of storage available on the drive. So not only is the listing for 128gb wrong, the drive itself is also labeled as 128gb and it is only capable of 32gb of storage","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Es una pérdida rotunda de mi dinero","reviewDescription":"Yo he comprado mayoritariamente los productos de Amazon durante varios años y los considero de excelente calidad pero en esta ocasión no diría lo mismo, la memoria tiene un problema de reconocimiento en la mayor parte de dispositivos de conexión usb situación que la hace inservible, quizá por esta ocasión hubiese preferido comprar productos de otras marcas reconocidas en medios de almacenamiento.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"248 gb","reviewDescription":"My ps4 needed a 3.0 250gb hard drive so I bought this and my Playstation said it only had 248 gb available","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Estafa","reviewDescription":"En las descripción colocan USB de 256 GB y no es ni de 8 gb, es una estafa y no hacen la devolución.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Dead after a year of minimal use","reviewDescription":"Haven't even used it that much. Just for transferring files every once and a while. It's gone into read only mode, which I've learned means the flash storage is end of life.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Unusable","reviewDescription":"Was able to put data on the drive, but it ejects within 2 min of being plugged in. That data is now completely inaccessible to me.Go with a real brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Only got 32gb","reviewDescription":"Its works, but i only got 32Gb rather than 128Gb","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Constant crashing","reviewDescription":"Was pretty happy size of USB capability.Tried loading some files, but I noticed the USB drive would open when connected but 30 secs later it closed (disconnected), then reopen. Would repeat.I tried this USB stick in different connections (3.2, 3.0, 2.0) with no success.I dont recommend this product as unstable.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Write Protected","reviewDescription":"Very disappointed. Got this drive to backup all my sensitive work files and it's useless. Being write protected I couldn't save anything. DO NOT BUY. Complete waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Scam","reviewDescription":"Not as advertised.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Worst USB Stick I Have Ever Used - Erases Files","reviewDescription":"Two MAJOR issues with this USB stick make it completely unusable and unreliable:1. It ERASES your data! This happened to me twice in one week after 20 years of it never happening with any other USB storage. Today was the second time it happened. I was transferring 112 iphone video files from one computer to another and when I plugged it into the second computer there were only 24 files left.2. It routinely disconnects itself from your device even when you have absolutely not touched it.An absolute piece of garbage. Amazon should be ashamed of this product.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Suddenly DOA!","reviewDescription":"This memory stick worked great for the first two months. I was using it as a Time Machine for my Mac. Then suddenly the backups no longer worked. After troubleshooting on three different computers I found that the device is dead. It is not recognized by any system and cannot be read. This is obviously not good for a device that is relied on for backup safety. Frustrating!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Pan drive","reviewDescription":"This is good Ease of use but storage not 128 is low 🙁 this not good cheat I AM not happy then advances payment pay to let delivery not fix date a time and (","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1719014400000}
{"reviewTitle":"it is 116 gb only","reviewDescription":"it is mentioned 128 gb on amazone. but its storage capacity is only 116 gb..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1719878400000}
{"reviewTitle":"Bien, quelques ratés - quand même","reviewDescription":"La clé présente bien les caractéristiques donnés, et est de très bonnes factures, cependant mon modèle présente des bugs peu fréquent lors de transfert de fichiers qui fait que certains fichiers son corrompue, je la déconseille donc pour des utilisations de type sauvegarde de données en copie unique, comme pour des photos, etc, qui serait par la suite supprimer de l'ordinateur, (Privilégiez l'achat d'un disque dur, un peu plus honnereux cependant)","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"France","date":1721433600000}
{"reviewTitle":"This is not a best product","reviewDescription":"One month after this pen drive corrupted error, I not buying one more time in this pen drive 😔","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1718323200000}
{"reviewTitle":"Ok","reviewDescription":"It not bad, value for money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"India","date":1717632000000}
{"reviewTitle":"Bof","reviewDescription":"Ok pour mettre des épisodes de série à brancher sur la TV, mais incapable de supporter des gros transferts de données, ça plante... Je n'avais jamais vu ça.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"France","date":1721606400000}
{"reviewTitle":"cheap and that's what you get","reviewDescription":"day one the little slider fell out . bit glitchy ,not great on apple","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United Kingdom","date":1716163200000}
{"reviewTitle":"Efficiente","reviewDescription":"Fa quel che deve ad un prezzo onesto","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Italy","date":1722038400000}
{"reviewTitle":"Leider sehr langsam Schreibgeschwindigkeit","reviewDescription":"Leider wird die Schreibgeschwindigkeit nicht erreicht","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1723334400000}
{"reviewTitle":"OK, aber nicht sonderlich schnell","reviewDescription":"Hatt ich mir schneller erhofft, auf fuer USB 3.1.Kapazität := 118820 MByteSchreiben := 26.3 MByte\/secLesen := 37.7 MByte\/sec.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1722124800000}
{"reviewTitle":"Not bad","reviewDescription":"I'll give it a 5 for price\/capacity ratio....but it's not really that fast transfer and only 116gb usable space compared to advertised 128gb...still, not bad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Works fine","reviewDescription":"Haven't had any issues with it so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Nice","reviewDescription":"Like the way, the slides in when you push the slider as it feels more protective than most","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"It's fine, not sure about what I found on this product.","reviewDescription":"It says \"256 GB\" but when I checked the properties and amount of memory only 246 GB. Where's the other 10GB? I formatted it but still 246 GB. Am I cheated by the manufacturer on this product? Just asking.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Work as advertised","reviewDescription":"Great product. Work as advertised. And well packed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"Nice size and capacity","reviewDescription":"I like te size on this pen drive. My on;y complaint was the speed of download\/upload.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Does The Job.","reviewDescription":"Does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Funcional","reviewDescription":"Muy rápida. Su forma protege bien el conector","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Slow writes but okay for the price","reviewDescription":"Ran a full drive test and was able to get 9.4MB\/s writes average throughout the whole drive. It started at 10.5MB\/s but dropped very quickly to the 9MB\/s. It takes 3.5 hours to fill the drive.Read is a pretty standard 30.3MB\/s. It takes 1 hour to read the whole drive.Overall, average for this size drive but okay for the price.Edit: forgot to mention, it shows up as 116 GB (118849 MB)","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"good","reviewDescription":"fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Good Device","reviewDescription":"Happy with the flash drive","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Lots of storing","reviewDescription":"Small","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Seems like a good product for the price.","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"Llego en buen estado","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Works.  Good value.  But no activity light","reviewDescription":"Works.  And appears to be of good quality and value.  I was a little disappointed about the lack of LED activity light, so only 4 stars Overall.  However, in all fairness, when I returned to the site, I noticed that this was disclosed.  No problem and I still plan to keep the USB drive.  But I still would like a LED activity light","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"buy for the value","reviewDescription":"great value for money and works well so far, it would be better if it could have a cap to prevent the dust or other small pieces get in as I need take it in my backpack to travel here and there.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"Great Flash Drive","reviewDescription":"Works as stated. However, product description says 256gb capacity.  Actual capacity on mine was 231gb. Otherwise pleased. I tested on a 2.0 USB port and it was noticeably faster than my current Flash drives.  I am sure it will be much faster on a 3.0 drive.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1673654400000}
{"reviewTitle":"Good but showing 116 GB free space of 116Gb","reviewDescription":"Design is good and it spin up fast.In my Windows machine it is showing 116GB NOT 128 Gb. I know it should not show total 128 GB BUT not sure where the rest of the 12 Gb gone.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1671840000000}
{"reviewTitle":"Great product","reviewDescription":"This drive is super fast. Design is kinda ugly but gets the job done.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1683072000000}
{"reviewTitle":"Not Full 256 GB storage space","reviewDescription":"Flash drive that came in the mail was not the full 256 GB storage space. Only 230 GB storage space available but still OK given the price.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1675555200000}
