{"reviewTitle":"love the outlet!","reviewDescription":"I recently picked up this Surge Protector Outlet Extender with a 5-Outlet Splitter, and it has become an essential component of my home office setup. Gone are the days of choosing which gadgets to charge and when; this power hub handles all my devices simultaneously with absolute ease.First off, the surge protector function gives me peace of mind, knowing my electronics are safeguarded against unexpected power spikes. I appreciate the design, which doesn't block other outlets and even leaves enough room for bulky adapters. It's compact enough not to be an eyesore yet robust enough to handle up to five devices - a perfect balance.The build quality is commendable, with a sturdy casing that feels durable. The outlets are well-spaced, reducing the frustration of larger plugs jostling for room. I also found the plug angle to be particularly thoughtful, allowing for better cable management and a cleaner workspace.One minor caveat, though, is that while it's excellent for most home applications, if you're planning to use all five outlets with devices that have high power demands, you might notice it getting a tad warm. It's nothing to be overly concerned about, but it's worth noting for those looking to power multiple high-draw electronics.Overall, this Surge Protector Outlet Extender with 5-Outlet Splitter is a reliable, well-built choice for anyone looking to expand their power options. It performs admirably, offering both convenience and protection for your devices. A solid four-star addition to any home or office.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Great product","reviewDescription":"This is very nice, handy and works great. I like the selection of outlet options","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Game changer","reviewDescription":"I absolutely love this USB wall charger surge protector from the moment I plugged it in. As a mom, I have multiple devices that need charging throughout the day and this surge protector has been a lifesaver. With 5 outlets and 2 USB ports, I can easily charge my phone, tablet, and laptop all at the same time. It's a game-changer for our busy household and has eliminated the need for multiple bulky chargers cluttering up our outlets.Not only does this surge protector provide ample charging options, but it also gives me peace of mind knowing that my devices are protected from power surges. I no longer have to worry about damaging my expensive electronics due to electrical fluctuations. The compact size of the surge protector makes it perfect for traveling as well, ensuring that I always have enough outlets to keep all of our devices charged and ready to go. I would highly recommend this USB wall charger surge protector to any mom looking for a convenient and reliable charging solution for their family.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Handy multi purpose wall outlet.","reviewDescription":"The Addtam USB Wall Charger exceeded my expectations. It is a single multi-purpose 5 AC outlet charger, surge protector with 4 USB ports, and 1 USB C that offers great versatility of use. I've only had it a short time, but I am very pleased so far. The 3-sided design adds additional variability from the typical crowded AC outlet. The design also allows me to insert my USB directly, thus saving valuable space rather than having to utilize the bulky AC connector. There is no downside that I have encountered. I highly recommend the Addtam USB Wall Charger, and I am considering purchasing another for home use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Just as described","reviewDescription":"Item arrived quickly and properly packaged no damage or marks of any kind. Item works perfectly as described. I got one for each of my kids rooms after they got a bunch of new bedroom lights for Christmas. Just the right number of outlets and even after being plugged in continuously for a week straight it has not shown signs of overheating or malfunction. Fits perfectly behind my daughter's dresser so I don't have to worry about loose cords etc. Will probably be getting a few more in the future for other rooms.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Perfect","reviewDescription":"This is just what I needed.  My son suggested it and it is perfect. Easy to set up (I'm 80) and perfect for my needs. Great item!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"NEAR perfect solution to getting more plugs!","reviewDescription":"This is a fantastic solution to the age-old issue of not having enough power plugs. It beats the traditional solution of having a power strip which has to lay on the ground and gets in the way, and is unsightly.I especially love the USB ports, and didn't realize how useful it would be to have those available to charge my AirPods, my Google Nest Mini, and my mouse. It's more convenient and useful than I even thought it would be to have those USB ports just always there and always working, unlike your computer USB ports, which power off with sleep\/shutdown.My ONLY complaint with it is that the weight and build of it isn't incredibly confidence-inspiring. Unplugging things from it usually unplugs the device itself if you have to pull it at all, and the overall light weight and feel makes me presume that the electronics inside aren't the most robust. However, there's nothing to indicate to me that it isn't a quality piece of tech, as it's worked well for me for a few months now.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Does what it should, and looks good too","reviewDescription":"I've bought a few of these now, and our oldest one is about 3 years old and still works fine. I love this particular block - it's cleaner looking than most, charges devices well, and like I said it hasn't failed us yet! We've had our share of power outages due to snow storms, and none of our devices that were plugged into these power blocks has gotten fried. I like them so much I've bought them for family. I like to wait until I've owned something for awhile before I write reviews, so I can also report on the longevity as well as the quality of the product. This one is a clear winner in my book.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Great for bedside","reviewDescription":"If you're like me, you have a myriad of cords at your bedside, and this has been great for that purpose without having a power strip laying on the ground. It's also nice to be able to plug your phone cable directly into this to use charging blocks elsewhere. There is a screw where you have the option to remove the existing faceplate and use this instead, but you are also able to plug over existing plate, which is what I did.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Versatile","reviewDescription":"I ordered these based on a recommendation by Clark Howard, syndicated consumer action reporter from Atlanta, GA. They have 4 receptacles and USB ports and a USB-C port, which I thought handy.  My phones, Kindles, and iPads charge much quicker with these devices than with the ones I was using. Even though we have a whole-house surge protector, one can’t be too careful living in the US lightening, Florida.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"No reset or test","reviewDescription":"I guess this works fine . I say that because there is no trip or at least none to that I notice. So frankly I really don’t know if it’s actually functional or just an extra plug adapter with a light .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Get Different One","reviewDescription":"I ordered a different one a while back that I prefer.  It screws into the outlet and fits much better.  This one doesn’t; it just has a small piece that goes in the screw hole.  It doesn’t stay in well when a plug is removed.  And when I decided not to use it and went to replace the outlet cover, it had pushed one of the plugs way in.  So I recommend purchasing the kind that screws in.  Hope this helps.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Not sufficient at charging laptops or tablets","reviewDescription":"The USB ports do not charge fast enough to keep up with a low battery on your laptop or tablet. You will still need a charging\/power block, which means the USB ports are fairly useless. Item works for charging items overnight but is too weak to provide instant charging power when you need it. My devices die while still being plugged into the USB ports because it just can't put out enough juice.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"doesn't fit super well in outlets","reviewDescription":"Doesn't fit super well in outlet, seems to fall out often. I didn't realize until I would plug my devices in and come back to them still being dead. I check it all the time to make sure it's plugged in now. Kind of annoying to have to do all the time. It's also quite big and bulky","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Does not secure in outlet!","reviewDescription":"Two things I didn't like about this particular product. 1) does not secure to the outlet; especially when you are removing electrical cords. 2) would have been nice if it had a night light on it like others I ordered in the past.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Space saver","reviewDescription":"I like that I can just plug the charging cables without need the port. Yet I dislike that it doesn't hold up as I wanted to but I would say it's worth the money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Ok but would not buy again","reviewDescription":"Very easy comes out of the socket, but holds onto thing plugged in for dear life, so when unplugging something, the whole fixture comes out. You need to very securely hold it to unplug anything. Not my favorite.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"USB C port stopped working after 1 year","reviewDescription":"I was really happy with this until the USB C port stopped working. It is super easy to use but just didn't last. There is a light on it that I had to cover up to be able to use it in our bedroom but that wasn't a problem. It would have been a 5 star item if it had lasted longer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Falls out of the wall if you even blow on it","reviewDescription":"Works so long as you don't give it even a light pull. The sockets are very stiff which not only can make it a bit of a pain to plug things in from any direction but straight on, but also results in the entire thing coming out of the wall rather than a single plug. Can't recommend for regular home usage, find one with a screw, something that I THOUGHT this one had and swear the picture showed. Threw away the packing already so I'm unfortunately I'm stuck with this instead of a quality one that has a screw costing a few cents if not a whole secondary plug for both stability and so that all the electricity is more distributed. Especially when running a window AC out of it. I guess it can still be used for travel, or in an area of the house where there isn't any traffic or risk of it being lightly tugged, but I'm still extremely disappointed and do not recommend. Buy a quality extender instead, this one might have been on a deal sale, but it wasn't worth the money. TLDR, buy a different plug, this one isn't very stable or safe where there is any foot traffic.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"EXACTLY WHAT I WANTED","reviewDescription":"Exactly what I wanted. Surge Protects all my TV related items.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Absolutely the BEST DECESION I made.","reviewDescription":"I bought 6 of these for Christmas gifts this year. Absolutely the BEST DECESION I made. Before buying these plugging units into my wall sockets or other surge protectors the power would go out. I would have to go outside, turn my power back on so many times. My entire house is wired wrong built in 1952, each room is connected to one or more rooms and it's frustrating. So, with my NEW gadgets tested one in my daughter's room, plugged this unit into the wall with multiple devices, called my husband asked him \"Has anything blown out upstairs\"? Husband replied no \"Why\"? I explained to my husband what I just did in our daughter's room, he was extremely happy too.HIGHLY RECOMMEND THIS PRODUCT 100%. I have had no power outages at all, GREAT PRODUCT, Easy to plug into your existing outlet, no surge protectors on my floors, I can easily fit 5 units plugged into this unit and my power does not even go out anymore. Received my 6 products fast, fast shipping, received on time, all devices were packaged extremely well, no damaged devices, no dents, no cracks, no product was damaged. All units were shipped in EXCELLENT NEW CONDITON.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Works great.","reviewDescription":"Works great. I found out later that it emits a lot of RFI and had to move this away from the TV, for it interfered with the antenna broadcast signal.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Does the job","reviewDescription":"Makes it easy to charge multiple devices","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Wall plug","reviewDescription":"This outlet adapter is great. We live in an older home where outlets are limited. This adapter frees up outlet space, and allows my husband and I both to charge our devices at the same time. Very convenient and not a bad price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Awesome","reviewDescription":"I’ve bought 4 or 5 more since my original purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Adds Versatility to Normal Outley","reviewDescription":"This wall charger gave us significant expansion to not only running normal plug-in items, but also charging various devices. There have been no issues with overheating or weak current. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Nice","reviewDescription":"Works great, packaged very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Functionality of the product. Very clever device.","reviewDescription":"Very clever device, good finishing and $, fast shipping.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Works","reviewDescription":"Works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Great product","reviewDescription":"Helps to eliminate extension chords and power strips! Great for all areas of the house!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Good value","reviewDescription":"Nice having all these ports, knowing surge protection is applied. Very convenient.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Does what it's supposed to do.  Seems tp be well built.","reviewDescription":"Used it to replace another multi-outlet power unit that had died.  It works fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Home Office Plug","reviewDescription":"I couldn't be happier with this addition to my home office setup. It has completely replaced the need for a large extension cable, providing a more organized and efficient charging solution. With this device, I am able to charge multiple devices simultaneously, without experiencing any issues or interruptions.One of the standout features of this product is the inclusion of USB ports. These ports have proven to be incredibly convenient, allowing me to directly connect and charge my devices without the need for additional adapters or cables. This has not only simplified the charging process but also reduced clutter on my desk.I have been using this device extensively, and I must say that its performance has been flawless. Whether it's charging my smartphone, tablet, or even my wireless earbuds, it handles them all effortlessly. The charging speed is consistent, ensuring that my devices are powered up quickly and efficiently.Overall, this device has become an indispensable part of my home office setup. Its ability to replace a bulky extension cable, the convenience of USB ports, and its reliable performance make it a must-have for anyone looking to streamline their charging process. I highly recommend it to anyone seeking a more efficient and organized solution for charging multiple devices.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Love these","reviewDescription":"I love these","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Lots of outlets","reviewDescription":"The angled side outlets are great for those bulky plugs.  Four USB ports are wonderful for charging multiple devices at once.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Really helpful plug","reviewDescription":"Makes it much more convenient for plugging in what you need as well as portals for chargers.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Provided needed up to code outlets.","reviewDescription":"My new Apt does not have a lot of 3 hole outlets per requirement.  This is providing that.  Very necessary.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"surge protector","reviewDescription":"works good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Works like a charm","reviewDescription":"I needed more outlets to accommodate my crafting equipment.  The plug works well and provides many options for various sizes of three-prong plug heads.  No installation, just plug-and-play right out of the box.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Great space saver","reviewDescription":"Enjoy the fact that we can plug in USB C cables and 3 prong wires.  It is a space saver and the white looks nice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"So helpful and convenient too.","reviewDescription":"Not only charges the phones, but adds more outlets too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Works great","reviewDescription":"I live in a 1910 home with a definite lack of outlets, but wiring is mostly capable of handling 20 amps. These work great and solidly insert into duplex outlet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"great outlet!","reviewDescription":"only issue i have had with it is that it comes out of the wall very easily. other than that I have found it very useful to have !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Useful adapter","reviewDescription":"Perfect for multi purpose charging needs. Fits firmly in sockets and connects all sorts of cables securely","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Great.","reviewDescription":"Perfect for bedroom. Works great. No problems.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"bathroom extra plug","reviewDescription":"works great did exactly what i needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Love it. All me stuff charges in one place.","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Great product","reviewDescription":"It really expands an outlet so you can have more things plugged in so they are ready to go when you need them. I have so many more devices that charge using a usb cord, this expands how I can charge more devices at one time. I had an outlet behind a bed and this allowed me to plug in devices in the side so I could push the bed up against the wall without the fear that it would mess with the wires and cause a problem.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Wrk’s","reviewDescription":"For my plugs.  Surge protector.  They r good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"No more looking for where the missing power bricks are!","reviewDescription":"With so many kids devices and phones that need charging, a power brick and a plug and a cable is super hard to find in this house.  This outlet converter makes awesome use to expand it to multiple devices for a dedicated hub to charge all the devices.  I got it for the expansion of power plugs for my other devices on the counter, and all the USB and USBc ports on this making it easy to charge and speed charge iPads and iPhones.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Much more versatility than the six-outlet fixture it replaced!","reviewDescription":"Prior to buying this product, I had a six-outlet adapter plugged into my two-outlet wall socket. All of the six outlets were used, but I needed to power three more devices. Since I have a few devices that use USB plugs, I had to use their adapters which plugged into the regular outlet.  Using this product, I now have five regular AC plugs, 4 USB charging ports (with one USB-C outlet).  All nine of my devices are now powered.  I have no idea about the quality of the surge protector with this device, but I recommend it, simply because of the extra versatility it provides. I hope this review helps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Most useful","reviewDescription":"This is the most useful item I've ever purchased for traveling.  Now I never have to search for enough outlets for all my electronics.  It's so very handy and useful to have EVERYTHING I need all in one place.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Game changer","reviewDescription":"Just plug in and go. I put the behind my tv as I live with 2 other people and we have multiple gaming systems in the living room. The previous set up we had was ugly as hell. This is way more appealing to the eye and does a way better job than having 56098 things plugged into multiple power strips","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Plug in","reviewDescription":"This plug in works great !!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"As advertised","reviewDescription":"This unit does exactly what it is advertised to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Excelente","reviewDescription":"Justo lo que necesitaba","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Plug","reviewDescription":"It is plugged into the wall. No messy cord is hanging down.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Great product!","reviewDescription":"I like everything about it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Love this wall charger - we own 5!","reviewDescription":"Our house was built way before smartphones and other smart devices came into existence. It's great to have these around the house to be able to charge these devices. Offers additional outlets as well as several charging ports. Charging ports charge must faster than the \"blocks\" that are needed for outlet charging. Will probably buy more to place in other areas of our home. Thanks for offering this great product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Very functional","reviewDescription":"An excellent idea - 5 AC outlets and 3 USB in one that plugs into an existing outlet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Great buy","reviewDescription":"Bought this before for personal use and now have one for the office.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Multi use outlet.","reviewDescription":"I love this outlet because you can plug in multiple electronics and lamps, phone, etc... I love it so much I bought two for my office and a few for different areas in my home.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"These are great","reviewDescription":"A nice addition to make a receptacle more useful","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"PERFECT FOR A DORM","reviewDescription":"especially when a dorm has 2 outlets ON EACH SIDE??? yeah invest in this and a lamp that has plug outlets too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Great Charge Station Option","reviewDescription":"We love these outlets.  Have multiple devices used by everyone and before it was search and find.  Now have two of these charging locations, one in kitchen and one in family room, all common use devices are returned to one of those two locations.  Works great so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Amazing wallplug adapter","reviewDescription":"This is a great wallplug adapter. I like the free from having a power strip on the floor and it frees up space","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Does exactly what it says it will do","reviewDescription":"We bought 3 of these for our place and they work just like they said they would. Would recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Perfect amount of spots","reviewDescription":"I have this next to my bed and it a perfect little charging station. I can have my phone, watch, lamp, LED strip lights all plugged in at the same time,  and there's no reduction in chargability.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Compact but loaded with outlets","reviewDescription":"I ordered this to go in a small craft area, and didn't have a lot of room for a power strip.  This outlet has 5 regular outlets as well as 2 USB ports, and is smaller than a deck of playing cards!!  Perfect for my studio space!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Love this thing","reviewDescription":"My massage lift recliner takes up both sockets because it has two motors. I had to unplug the recline function or the massage\/heat function just to charge my ipad or phone while sitting in my favorite chair. With this, I can keep the chair plugged in AND charge my USB\/A iPad or my USB\/C IPhone. I am buying another one for the living room.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"excellent","reviewDescription":"perfect for  everything in one spot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"I Need More Of These","reviewDescription":"I love this little wall power surge protector.  I don't have to deal with all of the power cords being plugged into another power surge protector on my floor.  Looks better, and works better.  I will get more of these for the rest of my home that are all over my house.  Love love .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Very useful","reviewDescription":"Good quality and very useful.Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Like it","reviewDescription":"These are nice. I like the side pull action 🎬 because it will not pull from the wall. USB ID nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"That it works with my phone and other stuff","reviewDescription":"It works real well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Excellent device.","reviewDescription":"Need more charger a lot by my desk, this device work well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"It works well.","reviewDescription":"The heating pad works well, as does the surge protector.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"It works as an outlet extender but....","reviewDescription":"It works as an outlet extender but for some reason some devices with the usb don't work at all. For example, with phones, battery pack, and smart watch the usb ports works perfectly. But with headphones mouse and some devices it would start charging for 10 seconds and then shut off. So it works good for somethings and badly for others.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Multi outlet","reviewDescription":"Great item. Very practical.  Has outlets and USB ports.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Nice product really works well!","reviewDescription":"I like this product. No complaints at all","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Good product.","reviewDescription":"It works well. Multiple outlet and usb port are a plus. I am satisfied with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Love this","reviewDescription":"It works absolutely amazing and I love that I can have multiple gadgets plugged in at once.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"love it","reviewDescription":"so far so good for my room and my devices","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"so many features","reviewDescription":"It’s looks so nice and classy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"FINALLY A BRAND AND PRODUCT THAT WORKS AS DESIGNED","reviewDescription":"I ordered 3 different surge protectors last week….one 3xs more expensive…THIS IS THE ONLY SURGE PROTECTOR THAT ACTUALLY WORKED AS DESIGNED!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"I feel it's safer than a power strip","reviewDescription":"I don't do written reviews","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Really good angles","reviewDescription":"I like what I got","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Like!","reviewDescription":"So much better than the long cord extensions. Space value. I will probably eventually get another. Love that can plug phone chargers to it also with out the blocks cause those tend to get lost somehow always!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Amazing","reviewDescription":"These are so awesome. My husband came home from work and saw them and said “oh my gosh! Genius!” They take have usb ports as well as the fast charger and regular outlets. They will come with us on trips for sure.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"DOES NOT FAST CHARGE","reviewDescription":"Plugged in C connector compared to my samsung fast charge plug. This is about half as fast. The USB don't really charge not sure why they're there.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Not as advertised as I thought.","reviewDescription":"The unit advertises itself as a surge protector but I didn’t see where that was really happening. Also the slots for the USB ports don’t even charge at 2.4 A which would be for something like an iPad or higher very disappointing the product it felt cheap in my hands also. Will be sending it back.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1662336000000}
{"reviewTitle":"Ringing Noise","reviewDescription":"I love how this allows me to plug everything in at once, however, this is not something you should have setup in your bedroom. I plugged mine up behind the bed. I have my iPhone, iPad, Watch, power banks, my lamp and an extension cord that runs on the other side so my wife can plug her things in too. It gives off a high-frequency ringing noise that is very disruptive. It’s not loud, but you notice it and you can’t stop thinking about the sound you’re hearing. It’s actually given me a headache. Idk if it’s because serval things are plugged into it, but def keep this on in mind.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1627862400000}
{"reviewTitle":"Cannot securely mount the surge protector","reviewDescription":"This wall mount surge protector does not have a screw for the AC outlet center hole, so it cannot be secured.  If you occasionally need to plug\/unplug a cable, look for a similar product that has a screw so that you don't need to worry about falling off.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"Noisy USB C charger.","reviewDescription":"It’s fine for what it is, but like it shows in the video, whenever you charge off the USB C port, the thing omits a high pitched whining that annoys both me and my cat.  Also not a fan of printed branding on low quality generic products.  They all do it.  That said, it’s $15, the other USB ports work fine without noise, and it hasn’t exploded.  I’ll keep it. ¯\\_(ツ)_\/¯","isVerified":true,"ratingScore":3,"reviewReaction":"22 people found this helpful","country":"United States","date":1641600000000}
{"reviewTitle":"Too big lengthwise for the area I wanted to put it","reviewDescription":"I wanted to put this in my bedroom on a headstand so I could plug my devices in. However  it doesn’t fit as there is a knob to turn on some overhead lights and this is too long for that area. Hence, I am putting my Alexa on the floor. Not a good solution, but since my husband already threw out the box I don’t think I can return. I am sad that it didn’t work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"The usb plugs could have been on the sides","reviewDescription":"Sturdy and suitable foe wobbly wall plugs.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"Buyer beware.","reviewDescription":"Be sure to read the fine print. A fine product, but I bought it on an impulse for charging iPhones and iPads at the same time. I also noticed it had a USB-C port to charge my MacBook Pro as well. But my MacBook requires more amperes than this. When I plugged it in, my MacBook said it would take over 7 hours to charge fully! Substituting the Apple power block that came with it it was only just over an hour. Here is the fine print:\"The UCB-C port doesn't support any other devices which need 14~22 amp charging.\"This product has only a 3 amp maximum output. Going to buy an Anker USB-C charger (20 amp) that is very compact to boot.","isVerified":true,"ratingScore":3,"reviewReaction":"16 people found this helpful","country":"United States","date":1607126400000}
{"reviewTitle":"USB stopped working after 6 months","reviewDescription":"Good multiple adapter plug but need improvement in quality. USB ports stopped working after 6 months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673740800000}
{"reviewTitle":"Phone charges slow with it compared to a single plug in","reviewDescription":"Nice port wise, but charging is slow","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676419200000}
{"reviewTitle":"Ok for the price","reviewDescription":"Decent enough for the price. Taking 2 stars off as it get lose pretty easily - in fact everytime i connect\/disconnect a plug, this shuts off and has to be adjusted back again in the plug point.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625788800000}
{"reviewTitle":"Sometimes makes high pitched noise.","reviewDescription":"Great variety of plugs. But depending on what is plugged in, you can get a high pitched noise coming from the item.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639180800000}
{"reviewTitle":"Does not work with GFCI outlets","reviewDescription":"I had one and loved it. I bought another one for  my kitchen but I have GFCI outlets there. It did not work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637798400000}
{"reviewTitle":"Good product","reviewDescription":"Very good usb charging ports. Good amount of AC ports - would give 5 stars if it had a center screw to fasten outlet extender to wall outlet.  Requires 2 hands when plugging anything into it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1622073600000}
{"reviewTitle":"Good Plugin, but no center screw to keep in","reviewDescription":"Almost perfect, but if you ever unplug anything the entire unit comes out. With no center screw to keep it in, this thing is less than perfect. Unless you knew this and used two hands when unplugging things, this could be bad for some people.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1612310400000}
{"reviewTitle":"wish it had a screw to hold it in the wall outlet.","reviewDescription":"wish it had a screw to hold it in the wall outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644019200000}
{"reviewTitle":"Disappointed but ok.","reviewDescription":"Disappointed! I thought the dot in the middle was a screw to attach it to the outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639526400000}
{"reviewTitle":"Doesn’t work if you have a test button","reviewDescription":"It’s fine for regular outlets but if your outlet has the test button, it’s not long enough","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639008000000}
{"reviewTitle":"Sorry!","reviewDescription":"Only some of the ports work, and it doesn’t feel sturdy in the wall.  I don’t think it is worth anything since I bought two of them and only one port works on both.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620864000000}
{"reviewTitle":"Fall out","reviewDescription":"The wall charger does not have a screw to secure it to the wall. It is easily pulled out of the wall recptical. All other aspects were very good.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1625788800000}
{"reviewTitle":"Functionability","reviewDescription":"Does not fit into the electrical outlet properly.  Has a piece on the bottom face that does not allow it to fit flat against the outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Not what I was expecting","reviewDescription":"I don’t know how safe this is. It only has one plug for an outlet but covers up the other one with a little white piece. So your are able to plug multiple things by running off one outlet plug. Not sure if that’s safe. Others I’ve bought in the past, plug into both outlets.  Sometimes I see a little spark when I plug things in.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Works great but way too big and bulky","reviewDescription":"I returned it as way to big and ugly to have where you can see it. Probably great for a home office.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Great idea, poor execution","reviewDescription":"This does not quite fit.  There is a plug that is meant to fit top outlet and a plastic prong meant to fit in bottom outlet to stabilize surge protector.  However it does not exactly fit causing the surge protector to wobble and not stay securely plugged in.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677974400000}
{"reviewTitle":"Not like the first one I ordered","reviewDescription":"These work great, but I ordered these because the first one I ordered was a screw mount to the outlet, these are just plug in and tend to fall out of the outlet, not secure like the screw mount ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681344000000}
{"reviewTitle":"Does what it says but also falls out of wall","reviewDescription":"For a cheap little wall charger it works just fine. Particularly nice in the kitchen where space is limited.However.Because it's in the kitchen, we have to plug and unplug things a lot and each time we do this thing pulls out of the wall. There's nothing to secure it in the plug, so if you're pulling out a charger and not holding this thing in place with your other hand it pulls out along with everything else. Particularly annoying when there's something plugged it you then need to reset. Every. Single. Time.So, I guess if you're using it for something that doesn't need a lot of unplugging, it's fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657324800000}
{"reviewTitle":"Works great but only held in place by friction","reviewDescription":"The functionality, ports, construction, etc. are all great, but you are dependent on friction to hold it in place.  That's ok if you don't unplug things often, but consider one of the competitors that have a screw in the center to actually attach it to the outlet. It's easy to pull this whole thing out when trying to unplug something.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"Pulls out of wall outlet easily","reviewDescription":"I have one major objection to this product.  Similar products, which I have bought before, have a long screw in the center (normally used to mount the face plate) so that you don't pull the whole thing out when you are trying to pull out the plug in the front.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675814400000}
{"reviewTitle":"Not secure!","reviewDescription":"I'll never Buy another without the SCREW to hold it into the outlet.  Overtime I got ready to unplug a cord, this Wall Charger always wants to come out of the walk!!  Really is a Hassle seeing that you have to use 2 hands to unplug a cord from it.  3 stars Is my highest rating for this, item..., at best.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"Worked great until it didn't...","reviewDescription":"This worked really great and I loved having the different charging options available in one spot. Unfortunately RIGHT after the return window closed it seems to have shorted out... disappointed that it didn't last very long.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"Not 1800J only 170J  False advertising","reviewDescription":"I purchased several of these because they were rate 1800 Joules and also bragged they used a Gas Discharge Tube which reacts very quickly to surges, which is something I wanted but rarely see in surge protectors.  Gas Discharge Tubes are expensive and they work better than MOVs.  I was surprised that they could sell so cheap and have such a high joule rating so I was skeptical.  I decided to dissect one of the units once they arrived.  Turns out these are not at all what they claim.The two blue discs you see in the photo are the MOVs (Multi Oxide Varistors).  These are used in all surge protectors and are rated in joules which is how much energy they can dissipate before destroying themselves.  The silver tube between them is what I thought would be the gas discharge tube.  Turns out it is not.I spread the MOVs apart and with a magnifying glass found the part number 14D331K which is an MOV with a rating of only 85 Joules as shown in another photo.  The numbers on the silver tube indicate it is made by AUPO and is part number BF113 and is actually a thermal fuse and NOT a gas discharge tube.  There is a huge difference in how those two components operate.In summary, this product is not even close to what they say in the description.  It is 170 joules and not 1800 joules and does not have the fast acting gas discharge tube they claim.  I will be returning them.Addtam products are also sold under other brand names on Amazon.  Beware","isVerified":true,"ratingScore":1,"reviewReaction":"153 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"some work, some don't","reviewDescription":"I purchased 2 of the ADDTAM US AD5004 USB wall chargers in FEB of 2024, they worked so good l purchased 6 more to put thru out the house. Foolish me, l trusted they would work, 2 of the 6 the usb plugs were totally dead. My return window ran out on March 4th, so my bad.This is the way life is now. You must try every plug and USB plug immediately. In my case 25% of my order was junk with no recourse,because l missed the return window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Does not protect against power surges.","reviewDescription":"So I bought this outlet and plugged my computer in it to protect it if there was any power outages.  Guess what?  The power flickered and went out and then back on during a wind storm, and it fried my computer's motherboard.  Unless they're willing to replace your electronics if they're plugged in like APC or Anker products, don't bother with this.  Get one by a company that guarantees protection for your electronics.  I'll certainly be going with them from now on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"In theory this is a great product, but it just doesn't deliver. I discovered that it wouldn't charge with more than 2 devices connected. Now, after less than 2 months, it is not charging anything at all. Not worth it at all. Do not recommend!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"DO NOT buy this product!  It gets over heat and strip the surge protector.","reviewDescription":"I bought this product on Jun 23 and the window for return was on July 23.  I didn't see issue until the kids plug too many devices to charge.My first initial impression of the front of this product was \"Wow! someone was smart enough to space out the outlets.\"  It has enough space to plug in chunky chargers where you can't fit two chunky chargers to the regular home outlets.  Plus, it looks nice ans sturdy.Immediately follow my good impression of the front of the product was \"Seriously, this is bad design.\"  The back side has only one plug, which in my opinion should has two because it covers the entire wall outlets that two outlets.Sure enough, the product strips every time four of the outlets (the extended) were plugged in.  This product extends into five outlets, three USB-A, and one USB-C.  However the back side has only one plug.  If it was divided into two plugs on the back, then it would reduce the current load in the front to prevent it from stripping the surge protector all the time.Now I can't even return this product anymore.  It covers two outlets on my wall and it can only extend it into three outlets in front, so the ratio is 2:3.  You would get one more extra outlet with this product.  It's a joke.My advice to the designer\/engineer.  Use the product you have created, so you can improve it.  If your product is not worthwhile for you to use it, then it tells a lot about your product.","isVerified":true,"ratingScore":1,"reviewReaction":"66 people found this helpful","country":"United States","date":1629763200000}
{"reviewTitle":"USB ports stopped working","reviewDescription":"I purchased two, one in May 2023 the other in October 2023.  At first seemed like a great product, but less than one year later, the USB charging ports stopped working.  I would not buy again.  This defect should be more prominently displayed in the product reviews.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"USB C","reviewDescription":"I purchased this charger because it has 2 USB C ports but one of them did not work. I really needed the second USB C port to cut down on needing to used the electrical plug which is very bulky and limited in space","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Don’t use","reviewDescription":"Used these for several items. Shortly after we started using, the items plugged in stopped working - seems like they overheated. Bought 2, now out 30 bucks for these plus the cost of replacing the electronics.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Quit working after a month","reviewDescription":"I really like this item, at least I did, until the ports quit working. The outlets work, but ports don't.  It defeats the purpose of having it. I haven't had any power surges or other issues - the ports just don't work. So weird. I'd send it back, but window is closed. I tried to find a way to contact seller, but couldn't and these days Amazon is so difficult to get through to.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Undersized Wires carrying mains voltage","reviewDescription":"This sort of thing makes me scared to buy chargers without opening them up first.1st is it my opinion that everyone should know that your house is only wired to carry 15 amps at (about) 110 volts.  So plugging 5 devices into a single outlet is... not wise.2nd on this particular device it appears to me, that the 5 mains power is connected to the step down with these tiny little wires with insulation that is way to small.  I'm pretty sure that wire is intended only for low voltage uses (like Arduinos and LEDs, etc).  Worse they are rubbing up against the back of the solder joints on the USB charging block.Sure, while everything is working fine, the risks are low.  But things break, everything breaks eventually.  Maybe a component fails, or the sharp solder joint being pressed into that tire wire might rub through, or nearly anything else.  In my opinion when this fails it is likely to expose mains voltage to the USB ports and result in melting a device, or likely a fire.","isVerified":true,"ratingScore":1,"reviewReaction":"56 people found this helpful","country":"United States","date":1666051200000}
{"reviewTitle":"Average","reviewDescription":"I was looking for it to be fast charger and keep outlets available.  Charging of the phone is extremely slow. Charged my phone on regular plug from Samsung it takes 45 minutes to recharge,  moved it to this unit using the C port and it takes 1 hour 54 minutes. Not satisfied with the performance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646265600000}
{"reviewTitle":"Gfci incompatible","reviewDescription":"The only thing is that this is not gfci outlet compatible! My kitchen island has a stove in it so my outlets are gfci- was hoping to be able to use this for parties with all the crock pots but I can’t.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664496000000}
{"reviewTitle":"USB-C is not strong enough to charge Mac","reviewDescription":"I bought this to clean up my desk cords, now that I am working from home. Love the features of this product, however, I specifically purchased this model because of the USB-C feature, thinking it would charge my Macbook Pro. Unfortunately, my Mac literally dies even though it is 'charging' while using the USB-C outlet. Once I used my regular charger plugged into the standard outlet on the side of the device, it charges perfectly. I wish the USB-C outlet worked, but the rest of the outlet extender has worked great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615939200000}
{"reviewTitle":"Does the job, doesn't sit flush","reviewDescription":"I can't get it to sit flush against the wall. I would imagine the ground piece that fits in the ground plug is a hair off and that is causing the device to push itself out. Makes me feel like the plug is half out and a hazard.It functions perfectly but the instability of the device is a bummer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633046400000}
{"reviewTitle":"Wants to fall out","reviewDescription":"Doesn’t stay in the outlet well.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1670803200000}
{"reviewTitle":"Works Well but Not Secure (Potentially Hazardous)","reviewDescription":"Works pretty well for managing all my plugs but there’s no screw that keeps this secured to the outlet which can be a fire hazard. There are copycat brands that have the screw and would recommend going with one of those.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"It does not have a screw in the middle so it pulls out extremely easily.","reviewDescription":"After doing more research, I found out that the screw in the middle is essential for long term use in one spot. Buy a different option. It works well though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661817600000}
{"reviewTitle":"Great for charging multiple things at one time","reviewDescription":"Not so powerful to charge phone or laptop without adaptor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Not Screwed","reviewDescription":"I ordered 5 outlet extenders, I kept the Lvetek. This one has not central screw to attach to the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664236800000}
{"reviewTitle":"USB C doesn't Fast Charge Samsung Galaxy S10!","reviewDescription":"Edit 12\/17\/2020: After fast charging my phone once it no longer does so. When I plug it in my S10 says Fast Charging for a few seconds then changes to Cable Charging and adds about an hour to the estimated charge time.Original review:I bought this to replace a power strip since I wanted to ditch the Samsung wall wart in my bedroom. I'm happy to say that the USB C port does fast charge my Samsung Galaxy S10!","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1607731200000}
{"reviewTitle":"Static through Echo","reviewDescription":"This sends electricity just fine. After plugging my Echo to the USB port and a speaker to the Echo, the speaker emanates static. Constant 'noise'. I am guessing the USB port has no filtering or something for clean power? Leaving the Echo plugged into the Adtran, and using a brick to power the speaker, no static.It cannot serve the purpose for which I purchased it which was to replace the 2 USB bricks plugged into  my wall outlet due to the static from the speaker.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Doesn’t seem to provide much power","reviewDescription":"I plugged this into my wall and have my lamp and laptop plugged in (which were previously plugged into the two outlets compromising the socket beforehand). These two things both still seem to work\/power the exact same. When I try to plug other things in, however (specifically into the USB outlets), I don’t seem to get the same amount of power, if I get any at all. I get better power by plugging USB chargeable items into my laptop, which is already by my bed and what I was hoping to avoid plugging into anymore by buying this product. Because of this I feel like this outlet doesn’t provide enough power and is therefore relatively useless, as I already had my lamp and laptop plugged into the wall socket that this item now takes up both spaces of to allegedly charge up many other items. When the other charging outputs work, they work fine. They just don’t often work. Doesn’t seem worth it to me, I just bought it cheap on prime day sale. Maybe just me as most other reviews seem to mostly be good.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"USB C Port stopped working","reviewDescription":"Not even a month of use and one of these outlet extenders already has a USB-C port that has stopped working. The electrical plug and USB-A appear to still work on that device for now, but I can no longer use my preferred charger cord for that bedside table area.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"USB Ports Stopped Working","reviewDescription":"All was good until the USB ports stopped working. No way to contact the seller.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Falls out of the wall outlet","reviewDescription":"I like the multiple outlet design, and it has both standard USB and USB-C charging ports. The USB-C is also a fast charger.The problem is that it is constantly falling out of the wall outlet. The weight of the cords literally pulls it out.BE AWARE! This unit only has a 5 amp load rating so do not plug in high amperage devices such as battery backups, refrigerators, or electric stoves.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Doesn’t fit","reviewDescription":"Returned this because the bottom post didn’t line up with any of my outlets.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"No instructions","reviewDescription":"Ok it’s only a surge protector but it has a light. So what does the light mean? I thought this was a good deal but now I’m wondering if this is just junk?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Does nt charge phones after 2 weeks.","reviewDescription":"It worked well initially but after a couple weeks of use the only way we can charge is by using the outlet ports. It claims 4.5 amps total. But even with 1 cord directly plugged into the USB port it actually drains faster somehow. Great idea. But it does not work unfortunately","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"USB would not charge phone","reviewDescription":"USB port stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Be Cautious!","reviewDescription":"We loved it until we didn’t. One of the USB ports quit working and had a charred appearance. Blamed it on possible shorted cable. Then had an Apple charger block get extremely hot. Blamed it on a bad block. Last night our gas leak alarm went off. Another USB charger block was hot and beginning to melt. The electrical burn smell coming from this device had triggered the gas alarm. Needless to say it’s been removed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Just what was needed for the night stand by the bed.","reviewDescription":"For anyone that has run into the issue of one electrical outlet by the bed...  Now you have to charge your phone, earbuds, smart watch...  And also need the light on the night stand along with alarm clock (if not using the one on the phone), heating pad for your bad back, and now the CPap machine so I can sleep.....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Combines many desired features","reviewDescription":"My wife is a power user of electronics.  We had a xmas tree of adapters, wires, doublers, etc sprouting from one wall outlet.  The versatile adapter allowed all of her charging devices, tea warming plate, and wireless chargers to plug to the power source with much needed simplicity and organization.  Perfect for our needs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"It's great.","reviewDescription":"Although a bit shaky and wobbly. The quality and reliability is still great. I am using all the outlets besides the USB charging ports and it handles it without any issue, but it is warming up a bit. Overall great for organization and aesthetic.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Great surge protector with outlets & usb outlets","reviewDescription":"I got this surge protector to go behind my desk and protect my computer equipment as well as be able to charge my phone & earbuds.  It also doesn't take up a lot of space behind my desk. Definitely worth the purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Has USB and USB-C Slots","reviewDescription":"I was visiting my daughter and thought I forgot my charger plug. I bought this and put it in their living room for easy access. I was able to charge my phone and my watch at the same time.  It's neat and easy to plug into a normal outlet. You can actually screw it into the plate, but I didn't find that necessary and I wanted them to be able to move it around to where they wanted.  Good product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Pretty good.","reviewDescription":"I actually ordered 2 more after this purchase, Can use multiple items at one time including USB’s. All of my cords are in one place now. I feel it works better than the old fashion 6 sport cord extenders.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Every Kitchen should have one","reviewDescription":"A must have for every kitchen household, easiest way to charge\/ run units in the kitchen, great for when guests are over cause we all have that one friend that never has a charged device when they arrive at your house for a game or party.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"These are lifesavers","reviewDescription":"I have owned a lot of these because they are such a lifesaver because I always plug in and stuff and I’m always using ion cords but I don’t need to do that anymore with these. The ones I previously owned were more squares and didn’t have so many USB inputs, but this one is an absolute improvement. My older one just blew out and stopped working after eight years so I bought this and as you can see in the photos I have plenty of use for them. I love that you can have two different angles so if you need to use a plug closer to the right then it will reach better and so forth. I love it has a lot more USB ports because I’ve noticed a lot more products are giving out the lightning cables only and not the charging blocks. It’s very convenient and useful.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Jonny sez- I put it in the bathroom.","reviewDescription":"I needed to plug in the shaver. The toothbrush. The trimmer. The nightlife. The haircut thing.Everything is rechargeable and wireless these days.Who has enough plugs? No one.Problem solved.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Love this thing","reviewDescription":"Enjoyed having the extra ports and port diversity so much I bought 2 for myself and 1 for my boyfriend, who also loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Works good, but easy to pull from wall","reviewDescription":"I gave it 4 stars rather than 5 simply because the devise doesn’t screw into the outlet like most devises with this design.  So, it easily dislodges from the outlet when unplugging devices.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Convenient to have","reviewDescription":"Good value for what you get. Much faster charge than the other brand I bought at the same time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Outlet design","reviewDescription":"The outlet design help get rid of some regular box shaped extensions. The only problem that on gfi outlets the bottom plastic piece doesn't not align. I cut the little piece off at the bottom to make it fit.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"I like this product","reviewDescription":"I was happy with mine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Very helpful","reviewDescription":"Like can plug everything in with out having to switch them.  C charging plug is slower on Ipad but seems to be better on IPhone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Perfect for a charging station","reviewDescription":"Made my life easier to get all devices charges at the same time!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Exactly what I wanted\/paid for.","reviewDescription":"I hasn’t had any issues with this product. Would buy again if needed, though I probably won’t have to with the quality of this product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Nice, but hard to install","reviewDescription":"The outlet extender is nice, but it was pretty difficult to install. You need a long narrow screwdriver, as the hole for the screw is small and deep, and becomes stripped easily.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Great protector, wish it anchored into the outlet.","reviewDescription":"Have two of these and they work great and look great. The issue I have is that it doesn't mount to the outlet like most of these do with a bolt for the center. So if you have anything that fits tight in an outlet, it will pull the whole thing from the wall if you're not careful.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Excellent service","reviewDescription":"Like","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Unusable","reviewDescription":"Plugged unit in or attempted to plug it in, and it took considerable force to line up the dummy pin and the live plug. Once inserted, it pushed back out of the receptacle on its on and tripped the gfi. This device is not safe and should be pulled from the market. I returned it and got a credit.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Great at the beginning. Loses effectiveness.","reviewDescription":"This is the second of this product that I’ve owned. The first one had an issue with the usb c port after a couple months and had to be returned. After having the replacement for almost 9 months the usb ports have stopped working. Great while it was working but not very useful anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Not compatible with GFI outlets.","reviewDescription":"It cannot be plugged into a GFI (ground fault interrupter) outlet.  When plugging in the top part to the GFI outlet, , the bottom part sticks away from the wall and can fall off.  Works fine on a standard outlet.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Buy brand name","reviewDescription":"Both have defects. They were given for Christmas gift. They just ended up in the trash we didn't have packaging.  Buy brand name might spend a little more I'll bet there better. Almost done buying from Amazon. Name brand first then your crap.Jacking with electricity I don't think so..","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"No center screw for attaching makes it worthless","reviewDescription":"With no screw attachment to the outlet, it's just a friction fit to hold it in place. It is easily dislodged and loses power when you attach or remove any cords to it.  The picture looks like a screw attachment similar to other competitive models, but there isn't one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Low Power USB-C","reviewDescription":"So I've had a few issues with this.  It's not very low profile, as it will stick out further in the end with the size of the unit plus the plugs\/usb, so if you wanted it behind any furniture it's a no-go.The USB slots are very under powered.  I can barely manage to charge my phones using the USB-A slots while using them at night.  It's not much of a concern, since in the end I'm falling asleep and it will eventually charge them 100% by the time I wake up.The USP-C, however, is so underpowered it's impossible to use it while actively using whatever device you're using at the time, like laptops and tablets.  It drains faster than being charged, and I've had a few times where my device shut off because battery ran out while it was charging.It's not worth it if you're using the USB slots.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1668902400000}
{"reviewTitle":"Caught in fire!!","reviewDescription":"We have had this \"surge protector\" for quite sometime. Within 2 hours of my family arriving home from vacation, my husband just happened to walk by it and it was shooting flames out!! We were so upset, just thinking how it could have burned our house down if we were still on vacation! Please don't buy this!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Junk","reviewDescription":"First, the USB and and USB-C chargers don’t even work, so that’s a non-starter for me.  Second, even if you remove the outlet cover, there is still a gap between the wall and this charger.  No recessed back to give it a flush mount look.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Very slow","reviewDescription":"I have 3 things plugged in to it. It used take my phone 2 hours to be fully Charged  now it take almost 5 hours. I never changed the charger","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"That the warranty means nothing","reviewDescription":"I bought this cup Dec 2022 -said warranty for a year -loved the cup - stopped working late October -contacted them. Said they would send replacement - nothing has arrived and it’s Dec.a waste of 99.99 - if replaced I would give them a 5 star","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"USB power output diminished quickly","reviewDescription":"For the first maybe month I was able to charge my phone no problem. Then it was taking 30 hours to charge my phone, which meant that I was still losing power while plugged in. I figured my cord had gone bad but tried plugging in a 5 port Anker USB wall charger I have and using the same cord it charges up in an hour. So it's definitely the device that can't provide the needed output.Also, I've become quite annoyed with it falling out of the wall - a lamp, my laptop, and my wall charger plugged in and it gets knocked out every other day when I'm moving a cord around. A device this large really needs to have a mounting screw option that will go into the plate to secure it.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1646352000000}
{"reviewTitle":"Sparked when inserted USB","reviewDescription":"Purchased 10\/11\/23. Worked fine up until 12\/11\/23.Went to plug usb cord in & it sparked & stopped working. There was nothing else plugged in at the time. Missed to return date of 11\/11\/23 so wasted $$$","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Very good, for a VERY short time!","reviewDescription":"Worked great at the beginning. After 5 months (return window passed) the USB C that was supposed to be charging my laptop started \"acting out\" (sometimes charging sometimes not).Today, after the whole night with closed lid of the laptop it didn't charge a bit.Even for decoration isn't good 'cause it isn't THAT pretty... 🤣Recommended ONLY if you are not planning to use the USB C. All the rest work perfectly.Gave it one star because that's the main reason I bought this.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1681257600000}
{"reviewTitle":"USB-C Port Doesn't Work - Zero Product Support","reviewDescription":"The USB-C port did not work right out of the box. I've sent three messages to the seller trying to get some answers on if there is something I can do to fix it, as everything else works. I have no gotten a response to my three messages after waiting a week. Pretty frustrating product when I really wanted the USB-C port of all the ports to work, as it is the ONLY ONE provided on this unit. Zero product support from this seller\/brand = 0 stars from me. Do better.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1673913600000}
{"reviewTitle":"Didn’t last 6 months","reviewDescription":"It worked fine for a few months. Now only the power outlets work. The USB-A and USB-C ports are dead.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Dangerous and Unsafe Product.  Caused fire.","reviewDescription":"I had this surge protector for almost a year and a half with no problems and this morning at 3am it started burning.  Thank heavens it was plugged in next to my bed and I smelled the smoke and woke up to unplug it from the wall.  My house could have burned down.  I am very shaken right now.  I had only a bedside lamp and my phone plugged into the surge protector.  This is very scary and dangerous","isVerified":true,"ratingScore":1,"reviewReaction":"41 people found this helpful","country":"United States","date":1669161600000}
{"reviewTitle":"Failed in 2 months","reviewDescription":"Bought this and really liked the fact that I had lots of outlets and lots of USB ports and a USB-C port too.  All the outlets worked fine at first... but last night just over 2 months after receiving the product, it failed.  The side outlets work, but none of the front outlets work at all.  So now I'm out the money and looking for a new wall charger\/surge protector.  I'm disappointed because I really liked it in the beginning.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"Burnt","reviewDescription":"Couldn’t figure where the smell was coming from, found it. Power recliner. was the only thing plugged into outlet. Will return it. Do not want another one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Stopped working <2 weeks","reviewDescription":"I've used it for less than 2 weeks and already getting errors with charging. I changed cord and outlets to no effect. Returning for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"A piece of TRASH!!!","reviewDescription":"The outlets didn’t work!! Every time I was going to plug my electronics, I couldn’t plug it in since the outlet’s were to tight!! A real piece of trash and useless!!! DON’T BUY!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"It stopped functioning correctly within six months","reviewDescription":"I bought it in January and it was working fine until in June it started acting in a weird manner. While  plugging my phone on a USB slot, it gets disconnected every second. Charging is happening off and on, and is not good for the battery. So, I stopped using it. Usually these multiplugs last years. Thus, I am very disappointed with this brand.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"doesn't work","reviewDescription":"Liked the look but if you are looking to make an outlet into a charging hub this is not the item. We used just 2 of the usb ports and after a few weeks of light use none work. and now as I am typing this the side plugin for for my Bose just went out.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"bad quality.","reviewDescription":"I asked for the change of the product because the indicator light failed, the second one they sent also failed, as it was two days after the deadline to return it, I can no longer claim, it didn't work for a month. I have other models that have not failed for years, very poor quality.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Doesn’t fit","reviewDescription":"It would be good except it doesn’t fit flat against most receptacles in house, fits well in garage but the living room where I wanted it won’t fit, Unfortunately I didn’t try it within the 30 days for a return.  I don’t understand why it only fits in garage since they’re all the same","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"DO NOT BUY!","reviewDescription":"Set my outlet in fire and burnt my wall. Don’t buy this surge protectors. While it was delivered by Amazon, Amazon does not stand behind their products or do anything to help with the damage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Destroyed my Computer!!!","reviewDescription":"Had a thunderstorm in my area and lost power for about 5 seconds. The green light was on saying it was protected, but the pc computer plugged into this surge protector ended up with a fried power supply! Cost me almost $100 to fix. I work on computers for a living so I was about to diagnose and fix this problem. Most people would end up replacing their computers completely. NOT A TRUE SURGE PROTECTOR!","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1688256000000}
{"reviewTitle":"USB outlets failed after 2 months","reviewDescription":"Very cheap construction.  All USB outlets failed after 2 months.  From the very beginning, I had to jiggle the cords in the right direction to maintain a connection.  Trashed the unit after two months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"What the funk?","reviewDescription":"We took this product to Europe with us, and it wreaked havoc on our phones when plugged in; screens changed without pressing a key, characters miraculously appeared while we weren't even touching the phone, etc.I tried to use it when we returned to the states, and the same wonkiness happened.Not sure what's going one, but it's not anything I've ever experienced before.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Regrettable purchase","reviewDescription":"This I had plugged in using less than half of the outlet’s and it blew my actual outlet out so badly the circuit breaker didn’t even fix it and now I have to call an electrician. You’ve been warned.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Product literally surged and started smoking","reviewDescription":"Had plugged in my iPhone Apple Watch and laptop, heard a loud pop and then it started smoking. Luckily my friend who was with me had the presence of mind to unplug all my devices really quickly. Pretty disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Damaged","reviewDescription":"Item arrived damaged, but not from shipping. Also noticed scratches all over item. Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Doesn’t work for my ps5","reviewDescription":"I get surges every once in a while. Today I experienced another one and unfortunately my console was on. This product doesn’t protect my ps5 because I get an error message everytime I turn on my ps5 after an outage. I had to purchase a UPS instead","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1660089600000}
{"reviewTitle":"couldn't get to work","reviewDescription":"The wall plug itself was defective. Bent grounding plug meant it would not fit in any outlet.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"Caught fire dangerous","reviewDescription":"We plugged it into a known good outlet that I’ve never had a problem with and then plugged in a lamp and it sparked caught fire and smoked up. This is a dangerous product","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1658448000000}
{"reviewTitle":"None of the USB slots worked. I returned it.","reviewDescription":"None of the USB slots worked. I returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"It did not fit in a standard outlet","reviewDescription":"The lower prong is not shaped to fit in the second hole","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Not impressed","reviewDescription":"I purchased this for my kitchen but, due to how thick it is, I put it in my son's room instead.  Unfortunately, the first time we tried to use it to charge his iPad we discovered that the USB and USB C chargers do not work.  When I went to return it I saw that I was 2 weeks past my return window.","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1598918400000}
{"reviewTitle":"Units fail after a few months.","reviewDescription":"I really like the 1st unit I purchased so I bought another.Unfortunately, within weeks of each other the USB and or USB C sections stopped working -s o now I'm back to using plug in bricks.  Great Idea poor quality.No, its not the cables they work fine with power bricks.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1646697600000}
{"reviewTitle":"Does not charge my computer","reviewDescription":"I do not recommend this product.  The USB-C port will not even charge my MacBook pro.  I thought it would be nice to be able to charge my computer with it, but the USB-C connector appears to put out very little power.  My computer dies and will not even power up while it is plugged into this connector!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1637193600000}
{"reviewTitle":"Terrible, it does not sit right","reviewDescription":"This item is trash and does not sit correctly. The spacing for the prongs are off and makes it not sit flush","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"A little wobbly","reviewDescription":"Would be perfect if it had a screw in the center to mount it, since it is bulky and flops","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635033600000}
{"reviewTitle":"The USBC doesn't work","reviewDescription":"Beware, the USBC doesn't work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663545600000}
{"reviewTitle":"USB only worked for 6 months","reviewDescription":"Was working fine and right at 6 months the usb charge ports quit working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642377600000}
{"reviewTitle":"Breaks Down","reviewDescription":"While it works fine when it works, it stopped working after six months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638230400000}
{"reviewTitle":"When all outlets used, comes loose from outlet defeating purpose of it","reviewDescription":"Does not securely stay plugged into outlet-tried in multiple outlets-same result.  Concept is great, construction good, but actual use not good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620000000000}
{"reviewTitle":"Fit","reviewDescription":"For some reason this does not sit flush, the bottom pops out and it looks terrible plugged in, like it's falling out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Doesn't fit into a standard GFI outlet.","reviewDescription":"This multi outlet has a plastic pin that prevents it from plugging into a standard GFI outlet.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Not fast charging","reviewDescription":"Usb ports are not fast charging including USB c port","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639008000000}
{"reviewTitle":"No warranty included but specified in product details","reviewDescription":"Did not come with product information (specs, instructions, warnings, or warranty info). Multiple reviews state all or part of product stopped working within 3 months.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1608076800000}
{"reviewTitle":"Stupid","reviewDescription":"This thing is stupid. It doesn’t line up with the outlet holes so it won’t go into the wall. So I cannot even see if it works.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1604016000000}
{"reviewTitle":"Works","reviewDescription":"This works, but it's weird because below the wall plug in is a plastic point that makes the device stick out. But it's able to charge multiple things at once.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Impulse buy, but I like it & bought another.","reviewDescription":"Plugs into your double outlet turning it into a USB charging station. But leaves you outlets available too.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"It works .","reviewDescription":"Works as intended, I was hoping it works since I bought one that did not .So thank you.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688947200000}
{"reviewTitle":"Works well","reviewDescription":"It does just what it is supposed to do, I just wish it did not have the bright green light that stays on ALL the time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Works","reviewDescription":"More outlets, less space. Works as described!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"A nice solution with one unfortunate drawback that may not affect everyone","reviewDescription":"This was a good concept, but the peg near the bottom that should have slipped into the lower ground slot did not index properly on the gfi outlet in our bathroom. Consequently, the bottom kicked out until we cut the peg off. An adjustment or other arrangement for stabilizing the unit would be an improvement.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"Electric outlet","reviewDescription":"Could use a center screw to hold in the outlet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"Can't Complain","reviewDescription":"This surge protector does everything I need it to. My only gripe would be with how thick it is, about .5inch plugged in if I was to guess.Quality feels good enough, not good nor bad. Has the normal outlets, USB-A and USB-C which should handle just about everything you need.Pretty darn good for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680048000000}
{"reviewTitle":"Nice to have but hard to install","reviewDescription":"I bought this for my kitchen. The socket I wanted to place it in the charger wouldn’t go in. I tried several times. I took it to the opposite side of the counter and it fit. Not the place I wanted it but it fit and it works as it’s advertised","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"It does what it says, it's a plug splitter.","reviewDescription":"It does what it says. It splits up the plugs into multiple directions which is nice. So your cords kind of aim away from each other once they're all plugged in. The added USB ports are kind of nice too. I will say the little green light is pretty bright anind a dark room when you pull any of the plugs out it just yanks right out of the wall. Also, a good thing to know is that it isn't slim enough that it can be plugged into a wall plate that has the plugs next to any switches. It will try to overlap the switches and won't plug in all the way. Other than that though, it's a good price and it works.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1665705600000}
{"reviewTitle":"Heating up and squealing noise","reviewDescription":"I’ve bought this item before but this time when I bought and used it it started to heat up and made a squealing noise as if I was melting metal wire. Immediately stopped and returned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626566400000}
{"reviewTitle":"Concerned","reviewDescription":"When I plug my computer into this it will not register that it is charging.  Or when it does, it I get a message that I am not using the proper charger for my computer and to use the one that the manufacturer provided.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615075200000}
{"reviewTitle":"Works fine for few days and after that does not work","reviewDescription":"When it arrived was charging very fast but now does not charge my phone 100% even after taking whole night. I will not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1631836800000}
{"reviewTitle":"Kinda cheap.","reviewDescription":"Good price, But I’m knocking it down to two stars because there’s no way to secure it to the wall, and the USB – C output is not enough power to power a HomePod mini.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"High pitched buzz while in use","reviewDescription":"This product is great for aesthetics and purpose but the first one one port broke within days of receiving it and both the first and the replacement has a high pitched buzz when in use.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1615852800000}
{"reviewTitle":"Not strong","reviewDescription":"Not impressed and it doesn’t charge what I need it to charge in an efficient amount of time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"Mine would not output more than 1.7 watts on the USB-C port","reviewDescription":"I tried multiple iPads and multiple cables and this unit would not rapid charge any of my devices. I used Amperes4 on IOS and could never get a charge greater than 1.7 watts.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1616544000000}
{"reviewTitle":"Quit working","reviewDescription":"It quit working after just over a year!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662768000000}
{"reviewTitle":"Too big and heavy for outlet","reviewDescription":"It falls off the outlet all the time because it too bulky and heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647302400000}
{"reviewTitle":"Should have been a 5 star","reviewDescription":"No screw to anchor is to the wall plate.  The slightest bump tug or vibration and it leaves the socket enough to lose its power.  Not acceptable.  Poorly thought out.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1609804800000}
{"reviewTitle":"Practicality","reviewDescription":"Was hoping to get more outlets out of this, but it blocks a double outlet. Would be great if you have a single outlet. Still gives you multiple outlets in addition to USB plugs","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683158400000}
{"reviewTitle":"Do the job. Works","reviewDescription":"Little more bulkier than I expected. But I keep it in a guest room for convenience.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"Works amazing, bottom prongs don't quite fit","reviewDescription":"This definitely helps me de clutter my wall and add extra outlets. The only minor downside is that it has two sets of plugs, one working and one plastic. The plastic ones are slightly off for a standard wall outlet and doesn't fit perfectly. It still works great, and I'd definitely buy it again!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"I'm buying more","reviewDescription":"for those of us that keep misplacing our charging ports and wander aroung with our cords hanging loose, this is a miracle","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684281600000}
{"reviewTitle":"Now this is a charging beast.","reviewDescription":"This has been sent to all my kids to use all around the house. It's wonderful to see them using it cause it's so versatile.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"Convenient","reviewDescription":"We have lots of kids wanting to charge devices at the same time, so this product is super convenient. The only thing that stinks about it is that it is so bulky. However, now we don't have everyone finghting over outlets, so it is very helpful.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677196800000}
{"reviewTitle":"No fast charging via the USB-C port","reviewDescription":"I figures in 2023 fast charging would be standard on most if not all type C connectors. Device does what it is intended to do but would have been nice to implement a fast charge atleast on the type c port. Also would've been nice to have a support screw in the middle to make sure it stays on the wall like most others do.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Bulky but everything I need","reviewDescription":"I am happy with this purchase, make sure you check the measurements because it is bulkier than I expected. It doesn’t fit in the original space I intended, but very useful to have 3 prong plug-ins, USB-C, and USBs all in one spot.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"Great Product, Really Handy","reviewDescription":"This is a great product so far.  It takes a regular boring US AC 120v plug with 3 prongs Positive, Neutral, Ground and makes it a 5x that with 3 USB 2.0 and a USB C power port.  The amperage is a little low to accommodate using all ports at one with a total of 4.5A across all 4.Other then that one thing this is great and provides limited surge protection as well.  Not sure it it covers the USB ports or not. Regardless this is a steal at this price if it lasts and it seems really well built. It not flimsy or light which is a good thing, it tells me they used quality components.I recommend this to anyone needed more outlets or wanting USB ports at their outlets without the AC adapter.  I need about 5 more of these or I was about to just replace most of my outlets.  This saved me a lot of time and money.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1625702400000}
{"reviewTitle":"Shipped fast","reviewDescription":"Works good no issues","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Fixed worn out outlets","reviewDescription":"I’m renting an old house and many of the outlets are so worn out that plugs from appliances will just fall out of them.  These outlets securely attach to the wall, basically replacing the old ones without actually removing them.Having surge protection right at the outlet gives me peace of mind as well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"They work but need a retaining screw or double plug design to stay plugged in","reviewDescription":"Arrived timely and decently packagedWe would like to get a case in brownSurge ? Protection? Let’s hope we don’t get that tested","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Good product","reviewDescription":"Good item","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Nice little units","reviewDescription":"I have been using these for a while and they are quite handy around the house.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Nice having extra outlet","reviewDescription":"Have this next to my nightstand.. nice having extra charging for all our cords!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"It's Heavy","reviewDescription":"This works well and is handy. That being said it is on the heavy\/bulky side and has fallen out of the plug a few times when I try to unplug something from it. That's the only drawback I have found with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"I like this outlet extender.","reviewDescription":"I like this outlet extender. The pugs on the side make it easier to plug in the bulky power inverter plugs in and still have room for other plugs. The only drawback is it protrudes from the wall and would not work behind something well, and the plug slots do not guide the plug stabs in like a normal outlet, so you have to make sure you line the plug up straight or it will not go in the slots for the plug easily.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Good Buy","reviewDescription":"Perfect for what I needed. It is a little bulky when you plug into the sides. It is fine where I have so not a bother to me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Off a bit","reviewDescription":"Handy but the tab that goes into the second  ground slow does not line up …. You can get it in one but not two like it should","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Multiple USB","reviewDescription":"Really like the multiple USB ports on this.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Light is bright!","reviewDescription":"Actually had to put something over the light as it was almost as bright as a night light.  Helpful to have USB ports which is the primary reason I bought this model. We seem to need those even more than the extra electrical outlets now.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Little wobbly","reviewDescription":"Wish it had the little middle screw feature to secure it to the wall outlet. Otherwise it works great just easy to dislodge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Useful and inexpensive","reviewDescription":"Love that you can plug lots of stuff in one outlet and even use different kinds of plugs. However, it's not as sturdy as I'd hoped. I have to push against it when unplugging something. It's also a little tough to push the plugs into it. Overall, it's definitely worth it and works fine, just has a few minor difficulties.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679184000000}
{"reviewTitle":"Worth it","reviewDescription":"It charges fast! Although I probably wouldn't use more than 1 plug for power at a time. I use 2 or 3 usb at the same time and no problem.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Great","reviewDescription":"I have very few outlets in my bedroom. I was relying on power strips and extension cords to get everything fitting.Enter, this thing. The extra outlets are great, but it's really them being on each side and angled that carries the product. I'm able to comfortably fit everything and save space while doing it.The only downside I've encountered with it is that the USB ports don't deliver enough power for my Chromecast with Google TV. That has to unfortunately remain taking up an outlet space.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Convenient","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Good but not sturdy","reviewDescription":"I bought this because I like the idea of multiple connections. I like the amounts of slots in it but it is not very sturdy on the outlet. Every time I try to disconnect something, the entire things comes off the wall. You have to keep plugging it back into the outlet. It becomes a hassle real fast.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678406400000}
{"reviewTitle":"Great","reviewDescription":"Loved all the spots it has","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Would buy again","reviewDescription":"Bought 2 of these in 2021.  Just pulled this one out of the wall because plugged in electronics weren’t working consistently anymore.  I guess this one really worked after that last storm.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"I use this 24\/7","reviewDescription":"This is a game changer when you have the need for multiple outlets. I will say that it gets heavy with everything plugged in. It doesn’t fall out of the outlet it’s plugged into. But it seems a little loose. I use this 24\/7. And it solved my problem.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682640000000}
{"reviewTitle":"Does Not Fasten to Outlet - Possibly Good for Travel","reviewDescription":"Pros:5 120V receptacles3 USB A receptacles1 USB C receptacleEasy to install no screw used to secure it to the original receptacle. Great for travel if you have room for it as it is bulky.Con:Does not screw into original receptacle. This means having to hold it in place when unplugging cords.When I travel, I bring a multi-port charger that requires a single power plug and provides 5 USB A ports. When the cord is disconnected, the charger is about the size of a deck of playing cards making easy to throw in my backpack.This wall charger is a lot larger, but if you have room in your luggage, it might be a good option for those traveling in the US.I think it is a decent wall charger with lots of ports, however, unlike other wall chargers I’ve installed in my home, this one does not use a center screw that can be used to secure it to the original receptacle. Depending on how tight the original receptacle is, the process of unplugging any cable could pull the wall charger out of the wall receptacle. Using 2 hands solves the problem, but I prefer the charger be secured so I can unplug cords without pulling the charger out with it.Not a big deal, but that’s why I’m giving 4 stars instead of 5.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1658707200000}
{"reviewTitle":"Convenient to use","reviewDescription":"Charges iPhone faster than stock charger.Very convenient for bedside charging of phone and insulin pump at night.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"so far so good, not enough experience yet to be able to say more","reviewDescription":"so far so good, not enough experience yet to be able to say more","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Nice","reviewDescription":"Nice","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Almost 5 stars","reviewDescription":"Alexa or google connection would make this a five star.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Efficient","reviewDescription":"Great multipurpose plug & looks good too. I like the shape so plugs are easily accessible. Everything needed for the tv looks organized for once.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"It really has eight outlets","reviewDescription":"I was able to get rid of a power bar with the USB outlets built in to the space of an A\/C outlet","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"So convenient","reviewDescription":"The ONLY thing I don’t like about this product is that it’s hard to find a plug for it in some hotels.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Excellent multi plug with USB","reviewDescription":"The Addtam is an excellent multi plug and USB charger. The design is easy to use and install. The device does not have a screw mount so it is great from traveling. At the same time, for at home use a mounting screw would be best. I have my iPhone, Alexa, and my Apple Watch plugged into the device. I would purchase this again, and recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686787200000}
{"reviewTitle":"Does the job. Comes out of socket too easily","reviewDescription":"It does what it says it does. My only problem is that when you try disconnecting anything from it, it comes out of the wall unless you hold it to the wall while pulling.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"High pitch Buzzing","reviewDescription":"The video is of me plugging in my phone. As soon as it’s charging, this outlet starts buzzing. It’s taken me a month to realize the sound was coming from this. I’m really sensitive to sounds and have had lots of headaches (literally) from this thing.I want to love it. The design is perfect. But that sound is unbearable to have right next to my bed.","isVerified":true,"ratingScore":2,"reviewReaction":"55 people found this helpful","country":"United States","date":1612742400000}
{"reviewTitle":"Nice unit, but....","reviewDescription":"This is a nice unit, multiple use options and would have given it 5 stars except it doesn't stay plugged into the wall. If they could fix that, I'd have one in every room needed. Returning.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1655942400000}
{"reviewTitle":"Love the concept; But needs adjustments","reviewDescription":"I love the appearance of the product and how it eliminates the need for me to have extension cords or additional surge protectors.  However, this thing falls out of the wall too easily. And everything plugged in, shuts off.  Not good at all….","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642982400000}
{"reviewTitle":"Disappointing","reviewDescription":"The USB-C port is useless! I've used three different USB-C cords and it charges no faster than a USB-A.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670630400000}
{"reviewTitle":"Not Powerful enough","reviewDescription":"The USB ports are not powerful enough to charge my smartphone and my hearing aids at the same time.  Neither charged overnight so I woke up not being able to hear and not being able to call anyone until I charged them both separately.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1639958400000}
{"reviewTitle":"Great at first…..but","reviewDescription":"Ordered less than a year ago.  Worked great and as expected at first. Plenty of plugs and USB ports.  USB ports stopped working however. Not sure if it was just my unit or if it speaks to a larger durability issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641945600000}
{"reviewTitle":"Doesn’t stay snug into outlet","reviewDescription":"Didn’t like how loose it holds to the outlet. Not a secure right fit","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672790400000}
{"reviewTitle":"Won't stay plugged in","reviewDescription":"It simply will not stay plugged in.  I use the plug-in for my phone, tablet, and watch.  Just the act of handling the wires moves the charging extender out enough so that there is no power to the inlets.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641513600000}
{"reviewTitle":"Looked promising","reviewDescription":"Takes up two outlets but you gain three.  I liked the idea of having USB ports on it so I could plug in my phone to charge but of the 4 USB ports, not one of them worked.  So I paid $20 for 3 extra outlets.  I could have purchased a power strip for less. I am debating if I should return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614816000000}
{"reviewTitle":"No Retaining Screw","reviewDescription":"These work so far.  They don't have a screw that holds them to the outlet.  This is a big problem when you want to unplug a cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650499200000}
{"reviewTitle":"USB changing makes irritating noise","reviewDescription":"I got two of these for our bedroom — they both make a high pitched, irritating noise when charging via USB. It’s not super loud, but definitely loud enough to be annoying when you’re trying to sleep.Otherwise seems to be fine, but I’ll be sending these back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629417600000}
{"reviewTitle":"Buy more than one and check them for operation.","reviewDescription":"I bought two and only one the USB works, the second one all 3 of the ports won't work.  I'm going to see if I can get a replacement. They fit nicely on the receptacle and with only one plug in the back you need not worry about a split receptacle that is fed from two different circuits. Bought Feb 2021.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"we like it but a screw was missing","reviewDescription":"When like it but a screw is missing  .I wish the company would send the screws.  I feel its unsafe","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665446400000}
{"reviewTitle":"disappointed","reviewDescription":"My mistake for not looking closer.  But this item looks and feels extremely cheap.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669939200000}
{"reviewTitle":"Nice design but pulls right out of the wall easily.","reviewDescription":"Wish it had a set screw to connect to house outlet because it wants to just unplug if you don't physically hold it while you pull a plug out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649635200000}
{"reviewTitle":"USB Plugs do not work","reviewDescription":"The 5 AC outlets work, the 3 USB outlets don't work at all. I like it alot, but I will return and rebuy in hopes that I get a new one that does work.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1642032000000}
{"reviewTitle":"Stopped working","reviewDescription":"The USB ports stopped working in less than a year","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Slow Charge","reviewDescription":"Total usb ports are 4.5A which means if you’re charging 4 devices then they will all charge slowly.  So disappointed that I didn't realize this before buying.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"Very Loud Sound When Using USB Plugs","reviewDescription":"This thing emits a loud high pitched noise when you use any of the USA sockets.  Very slow charging rate also. The other plugs seem to work OK.  This looks like it may have been returned before I got it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1622332800000}
{"reviewTitle":"Does not give enough power","reviewDescription":"With more then 1 item plugged into USB, it states not enough power to charge.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"NOT SURGE PROTECTOR- no rating and no Ground monitoring","reviewDescription":"This device appears to be falsely claiming surge protection feature. The device I received does not list any surge protection rating on the nameplate. This would be the only SPD that I've seen that didn't list a transient surge voltage rating. The Amazon listing also states that it monitors for property wired receptalce, but I removed the ground connect by inserting a 3 prong - 2 prong adapter  between the wall receptalce and this device and the green light still was on, even without a ground connection. My other brand SPD devices know when Ground is missing by turning off their 'protected' light. I think this is falsely advertised device by seller. Plan to return device.","isVerified":true,"ratingScore":2,"reviewReaction":"294 people found this helpful","country":"United States","date":1605225600000}
{"reviewTitle":"No Mounting Screw","reviewDescription":"Seems like a good product but one thing makes it impractical. There is no way to attach it to a wall outlet. The photo makes it look like there is center screw but it does not exist. Without the benefit of an attachment screw, to remove a plug, you must push against the charger to keep it from pulling out of the wall socket. This may not be a deal breaker but should be considered among the many dozens of options available.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"Comes out of outlet","reviewDescription":"It works, but it comes out of outlet, needs a screw to attach to middle of outlet","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"If you're buying it for the fast charge only don't do it","reviewDescription":"As soon as you plug it in it says that it's working and then a couple seconds later the fast charges no longer working... So if you're buying it for the fast charge only don't. Everything else is fine!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1683590400000}
{"reviewTitle":"Feels like cheap plastic","reviewDescription":"I was expecting this to connect with some sort of screw but it just plugs into the outlet and the ground plug is simply a piece of plastic. I won’t buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"Useage","reviewDescription":"The phone usb ports lasted only 5 monthsOutlet so far working.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Started a mini fire","reviewDescription":"Just looked down to see two chargers and a piece of my carpet ablaze… luckily I smelled something beforehand and immediately unplugged it but geeze imagine if I wasn’t home!!! Extremely scary and disappointing","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Too loose of a connection to charge","reviewDescription":"The product doesn't have a way to screw it into the outlet and therefore comes loose and doesn't always make a connection to use the USB ports.  Also if you pull a cord out the whole thing comes off the wall. Needed to have a middle screw so that it would adhere to the outlet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676246400000}
{"reviewTitle":"Great at first.  USB ports stopped working","reviewDescription":"This seemed exactly what I needed to charge phones, ipads, etc all in one place.  The USB ports just stopped working after 2 months.  So it's not that useful anymore","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679961600000}
{"reviewTitle":"USB ports are convenient but slow","reviewDescription":"The USB ports are convenient but they charge slower than single-port plug-in block chargers -- even with only one device plugged in.The 120v outlets are convenient. You can even plug in your old block charger and charge at its full speed!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Plug it in anywhere with no screws!","reviewDescription":"Working fine so far, I mean, it's just a plug. I wanted this one because I don't have to mess with changing out the center screw and can move it anywhere without having to track down a screwdriver (not to mention the original screw from the first outlet).  Good design, but doesn't fit on a switch\/switch\/outlet combo unfortunately.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"USB Wall Charger","reviewDescription":"I was planning on taking this wall charger on my next trip to Europe however it will not fit into the European plugs.  I have an adapter but with the plastic prong the charger won't fit properly against the wall.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Functionally working as described, but not flush with wall for a permanent install","reviewDescription":"Works as described, but does not fit flush with wall because there is no room on its back side for the normally slightly protruding electrical outlet socket. Irrelevant for traveling but maybe not ideal for a more permanent installation.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Usb charger point week","reviewDescription":"Usb changer point week. Very satisfied","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Efficient","reviewDescription":"Very convenient!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Excellent extender","reviewDescription":"Wound up buying two more of these. They are great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"USB C CHarging limiations","reviewDescription":"I use this to replace wall plugins for mobile devices in my office. The USB-C charging port is nice - it works well for smaller devices like phones and mice\/keyboard that require USB-C plug to charge.HOWEVER - it is not powerful enough to really charge my MacBook Pro M1. When using the USB-C port to charge, system report shows a charging rate of 15W. This is the bare minimum you could use to charge the laptop. If you want to use the laptop at the same time, chances are it will only hold a charge and will not actually charge the battery.I actually prefer this since I use it to charge the laptop overnight, so time does not matter to me. Plus, this is trickle charging the laptop. Long-term this may help the battery retain its maximum rated energy. Fast charging produces a lot of stress on the battery. Apple does a great job mitigating this via software but I still like to slow-charge devices if possible.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1667433600000}
{"reviewTitle":"May not fit all outlets and hang in the right direction for plugging in devices","reviewDescription":"I like the multiple outlets and USB ports, but I could not get it plug into a GFCI outlet.  One end would plug in but the single post for the secondary outlet seemed misaligned just slightly so I couldn't use it in that outlet (which was the intended outlet).  It did fit in a normal outlet but doesn't seem to fit snugly\/securely - meaning, if you pull out a plug, the whole charger pulls out too.  Lastly, depending on the outlets in your home, this charge may end up being plugged in upside down from the way you might plan.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1673395200000}
{"reviewTitle":"Works well","reviewDescription":"A bit bulky on the wall. But it works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"Charger Outlet","reviewDescription":"I can charge all my gadgets","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Could have burnt my house down!","reviewDescription":"Within 15 seconds of plugging this into the wall and plugging a charger\/device in, it burnt my daughter's finger and melted the charger. Had we walked away for even a minute, it would have caught on fire, no doubt. Do NOT purchase this item.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"It could have started a fire","reviewDescription":"Plugged this into the wall for one time only.  Used it to charge my iPhone with the iPhone cord.  Looked at my phone cord after 20 minutes of charging and the end of the cord that was attached to my phone was charred and melted.  This could have started a fire.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1658361600000}
{"reviewTitle":"Got Sent Defective Product","reviewDescription":"My first purchase, the right side plugs don’t work. You can’t even plug anything into the holes. The replacement product Amazon sent has the same problem.Disappointed cuz we have these already around the house from a purchase a long time ago and we loved them. Manufacturing quality has gone down!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Sparked and flamed after pulling out low use device","reviewDescription":"Luckily I was the one pulling out my son’s LED light strip, which like the few other things attached was off at the time. As I pulled it out, there was a massive spark and quick flame. Very dangerous","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"Does Not Work With Standard Outlet","reviewDescription":"I have received two of these and neither of them fit in a standard outlet. The plastic piece that goes in the third prong hole is not spaced correctly and therefore either the actual plug goes in or the third prong stabilizer goes in. And the item is not flush without both in the outlet to use. This is trash and I would give it zero stars if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1641081600000}
{"reviewTitle":"Does not charge","reviewDescription":"I was disappointed in this purchase.  I used this to have an all in 1 charging spot for my devices.  I have this plugged into the wall outlet and used the USB slots and my device did not charge at all.  Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1661212800000}
{"reviewTitle":"Shuts off randomally & makes a noise - not safe","reviewDescription":"It's okay for one or two plugs\/USB ports to be used at a time, but at three - it shuts off randomly, even if it was not connected to anything at the other end. As in, the wires are not charging anything, but the device still shuts down. It also makes a noise. Don't buy it. I wish I could return it or get a replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1644624000000}
{"reviewTitle":"Too lose do not buy","reviewDescription":"When I first opened it up it looked okay. When I went to plug it in it was a little wobbly and lose and now the things I plug into hang halfway out of the plug or fall out compleatly even when the cords are not being moved or pulled on. This is not safe would not buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1651190400000}
{"reviewTitle":"Bought two, returning both.","reviewDescription":"Both items only had one socket that was aligned correctly that you could even plug something into it. Returning this sketchy thing immediately.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Stopped working","reviewDescription":"Bought it on 9\/13. Stopped working on 11\/24.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Good outlet initially!","reviewDescription":"Worked great for a few months - then the USB outlets stopped working.  Return window is closed now.  Buy with caution.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Defunct USB ports","reviewDescription":"The USB ports are defunct in this product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Good idea, now if it only worked.","reviewDescription":"Received product, let it warm up as it was cold when delivered, plugged it in and tried the usb and usb-c ports to charge my laptops and phone. Only 2 of the 3 usb ports worked and the usb-c port does not work either. Use the chargers that came with your equipment and forget this one!!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1674864000000}
{"reviewTitle":"Can’t Support 3 lightning devices","reviewDescription":"The device give the illusion of supporting several devices.  My family plugged in an electric toothbrush, iPhone, iWatch and iPad mini.  The 3rd USB port wouldn’t charge.  When we unplugged one of the USB ports, the 3rd port worked.  The plug in the back goes into 1 of the 2 outlets, not both.  Not sure that it would make a difference if there were connections in both outlets.  Disappointed.  Just go with a reliable extension cord.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1650758400000}
{"reviewTitle":"No Screw mount","reviewDescription":"I returned it immediately because unlike another unit I ordered, it doesn’t have the wall plate mounting screw option.That is most important if you want a safe and secure extension outlet instead of having it loose and possibly a hazard.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684540800000}
{"reviewTitle":"DO NOT PURCHASE - Almost caught on fire!!","reviewDescription":"ONE iPhone charging cord plugged into wall outlet (not even connected to a device). Charger literally melted into wall outlet. Had I not been sitting next to the wall where it was plugged in and smelled the melting plastic I don’t even want to imagine what would have happened. DO NOT BUY!!","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1678838400000}
{"reviewTitle":"Thought it was good until it burned my outlet","reviewDescription":"Beware!!! It was going good until one night. Saw a big spark out of nowhere. Thought it was it just tripping because we might have overloaded it with a coffee pot, pressure cooker, and rice cooker. Well a week later only went to plug a bottle warmer into it and it popped the breaker in the house. So i flipped the breaker and went to plug this unit alone in nothing else and popped the breaker again. This time huge sparks and damaged the outlet. It was a new outlet about 2 years old. Would not buy again or recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"129 people found this helpful","country":"United States","date":1617840000000}
{"reviewTitle":"Almost burned my house down","reviewDescription":"Sturdiness?I was initially delighted by this but looked at it today and was horrified by the burned and blackened mess.  This is supposed to have overcurrent safety and a fireproof shell not to mention several other safety features.See the pics, it almost burned my house downDo not buy this","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1668902400000}
{"reviewTitle":"USB ports do not work","reviewDescription":"None of the USB ports work, only the plugs","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Does not stay plugged in","reviewDescription":"If you have multiple things plugged into it, it gets too heavy and falls out. Also the USB - C doesn’t always work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Loud pop and smoke!","reviewDescription":"I had my phone and watch charging. Thank goodness I was nearby. I heard a pop and there was smoke coming from the charger. Thankfully, my phone and watch were not damaged.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"The listing lies about USB capability.","reviewDescription":"This device does not deliver the stated USB power levels. It doesn't even come close to the requirements for quick charge capabilities. See attached image of the battery metrics from my phone when plugged into the USB ports on the device.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"The prongs are crooked","reviewDescription":"This leaves me concerned at the level of quality control, craftsmanship and potential fire risk. If the prongs are bent, there could be something loose inside that could become a big problem.I plan to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Doesn't fit GFCI outlet.","reviewDescription":"Tried to use it on a GFCI outlet in the bathroom and it won't fit. There is a stabilizing rod that goes into the lower outlet and that rod doesn't line up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"USB chargers stopped working within less than two months","reviewDescription":"DO NOT recommend because the USB stopped charging within two months. Obviously, I cannot return it, so it’s a complete waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Dont waste you money","reviewDescription":"We had this surge protector for 1 week.  It was plugged into the wall with 1 thing plugged into it....our dog fence transmitter.  It was a brand new transmitter ($150 + $35 to send it overnight) 1 month old.  The surge protector was plugged into it for 1 week and the transmitter is fried and is now beeping.  Talking to the dog fence people, the transmitter has a blown fuse and has to be replaced.  It was like the transmitter had no surge protector at all.  I would like my money back and you should pay for a new transmitter since your product completely failed 1 week after being used","isVerified":true,"ratingScore":1,"reviewReaction":"132 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Definitely did not protect","reviewDescription":"So overall this is a nice design. I bought it for my room because it seemed like it would take up less space. Well it did not protect my things plugged into it. Everything plugged in doesn't work now. The surge protected light was on as well. Will not recommend this to anyone and will not buy in the future. The one I had is now in the trash. Super disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1675555200000}
{"reviewTitle":"Warning-PULLS OUT OT THE WALL-No center screw","reviewDescription":"Wife hates me-she keeps pulling it out of the wall. There are better choices.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Purchased three and none of them actually worked!","reviewDescription":"I’ll call shenanigans on the solid five star rating on this item. I bought three of them and plugged in a few things per unit, and the only things that would actually turn on where my Amazon Alexa, and my cell phone charger. The lamps wouldn’t even turn on! It doesn’t supply enough power to turn on lamps, purifiers, and I’m not even sure how long it took overnight for my cell phone to charge because I did see other reports of slow cell phone charging as well. I returned all three of them the next day, and ordered two other units that I should’ve purchased in the first place because I already own one and they are amazing!","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1634169600000}
{"reviewTitle":"Quit working","reviewDescription":"The electrical plugs worked\/work. But the USB ports, although working initially, no longer work. I would not buy this product again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Worked great for a year","reviewDescription":"This worked great for me for a year and now the usb ports don’t work anymore :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Good until is broke after 6 months","reviewDescription":"Seller did not reply to me even though I reached out through Amazon. Do not expect any support if you have problems.There’s no warranty so be careful, spend the extra money and go with a premium brand.The features of the item itself are great though, so if the support and warranty are not a concern - this will be good for you, it just may not last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Eh","reviewDescription":"I really like the option of USB plugs, but sometimes the night light function turns on when nobody has touched it...The side plugs can be a little difficult to get things into, so that's annoying, but it still works, you just have to fight it a little bit.Edit\/update: The light turns on A LOT without anyone touching it.The USB function is super handy, but because of the light issue alone, it's been less than a year and I'm looking to find one that offers the USB and extra plugs without having a light. It turns on randomly in the middle of the night and constantly wakes me up. :( which is a shame, because I liked that as an option for when I needed it.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Light Quit","reviewDescription":"The nightlight (main reason I bought this) stopped working after about 2 months. The shelf is nice but very wobbly. I wouldn’t recommend this if the nightlight feature is important.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Usbc port stopped working.","reviewDescription":"USBC port stopped working a month or so after purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"RFI problems","reviewDescription":"Nice outlet placement and sits in outlet securely. However some problems. It radiates RFI noise and my tabletop radio is now noisy if the charger is plugged into the wall. My iPad won’t charge completely. Moreover if my iPad is charging, and I plug headphones into my iPad, I hear noise. I regret buying 2 of these.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Not all ports charge.","reviewDescription":"Since Receiving this device, I'm only been able to charge With one port at a time.  Ports do not charge with multiple devices.  Have it 2 stats because it does charge fast with only 1port at a time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"USB chargers don’t work","reviewDescription":"After less than 3 months of use, the USB and USB-C ports stopped charging. It is now a glorified power strip.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Does not charge Ipad, slow charges phones","reviewDescription":"Don't believe the lies, this does not support quick charging, expect about 4 hours to charge a phone and forget about charging your ipad on this. It got my ipad up to 8% and stuck there until I plugged in the ipad brick. Let me phone on there over night, came down in the morning with a 80% charge. I bought 3 of these and all are the same. Its crazy how many good reviews this thing has and not a single one mention the fact it doesn't charge phones or ipad effectively.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Disappointed","reviewDescription":"At first it was nice, but beware, even tho it was my fault, I was doing than long reach behind the bed and not looking, and was trying to plug into ac outlet part , I accidentally stuck part of one side into the usb part, not shock or anything, but it was giving off the burning odor and obviously I shorted something, I just feel it’s safty design is lacking in that area, I unplugged unit and broke it before I threw it away, was not worth the risk of someone else plugging it back in.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Great, but loud…","reviewDescription":"For the price i have no complaints, however if anything more than one device is plugged into it does scream at you. By scream I mean there is a very high pitched ring coming from it. its very hard to hear and for older people you probably wont be able to hear it, but its hard to sleep with it constantly ringing.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1622678400000}
{"reviewTitle":"It’s to loose","reviewDescription":"It’s too loose it keeps going off by it self not good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666051200000}
{"reviewTitle":"Don't work 2 month after","reviewDescription":"I was so happy with my product but now, two month after, one USB port stopped work. I can't return, because I just used and I don't have more the box. (Sorry My English isn''t verty good)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641945600000}
{"reviewTitle":"Too unstable","reviewDescription":"Too unstable - no screw to attach to outlet, returning","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665792000000}
{"reviewTitle":"Okay, needs something","reviewDescription":"When I plugged my cell phone usb charger cord it read slow charging. 3hr 38 min to full","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"A cwey convenients multi oulet port","reviewDescription":"All is good, but I was expecting that the USB outlets would be capabale of delivering fast charge and it is just as a normal conector does , but not a fast one for C type.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639958400000}
{"reviewTitle":"Too wide if adjacent to light switch","reviewDescription":"No one posted about this so I thought I would.If it were just a little bit less wide, I would work in an outlet next to a switch. As my picture shows, it does not.(The switch rubs and the adapter isn't entirely pushed in.)I'll have to use it elsewhere but not in the intended outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1617148800000}
{"reviewTitle":"It’s great but….","reviewDescription":"Does all it should. But it pops out of the socket of the wind blows strong.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663372800000}
{"reviewTitle":"Wanted to like it","reviewDescription":"Like everything about this product except that it emits a high pitch whine when something is plugged into it. It was loud enough to keep me awake at night while my phone was plugged in charging on my night stand.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1635811200000}
{"reviewTitle":"charger outlet quit working","reviewDescription":"Charger for phones quit working.  (This is not the correct terminology I know)  Electric outlet is fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"Worked for 3 months and stopped working","reviewDescription":"Worked for 3 months and stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Damaged my iPhone 13. Zero star review.","reviewDescription":"My iPhone will not charge anywhere else with any type charger after charging with this device.After rebooting my iPhone, it will now charge on my other chargers. I don’t know if I dare trying to use this device again.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1668297600000}
{"reviewTitle":"Falls off the wall NO SCREW","reviewDescription":"It looks great but what is the point if it falls off the wall even with minimal plugs  They failed to make the design with a screw to hold it in place so what's the point.  I returned it to Amazon and will get a better designed product.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1659744000000}
{"reviewTitle":"Stopped working","reviewDescription":"Very disappointed with quality of this piece of junk. It won’t power on anymore. I wish I could get a refund but it’s too late. I wouldn’t recommend this cheap product, save your money. Don’t buy","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Do not Buy!","reviewDescription":"Not having it longer than 2 months and this has occurred.Smelt something burning and went to check on this item. Couldn't even remove the head of the USB as it had been melted into the device. Could have caused a fire as it was close to drapes, do not buy! Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1644710400000}
{"reviewTitle":"falls out of wall socket, lacks screw to hold it inplace","reviewDescription":"if you ar OK with having to hold this device in place with one hand while pluging in or out either a USB cable or plug then this device works. But for me this is a real pain so I donated it to Goodwill in the hope that someone will find a use for it","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1649894400000}
{"reviewTitle":"Doesn't fit in wall","reviewDescription":"Doesn't fit in wall, the bottom plug filler does not align. Waste of money, feels cheap. So not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"most ports do not work","reviewDescription":"thought I was charging my tablet but NO! and of course, you never find out until the return window is over. Cheap junk.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"Didn’t work","reviewDescription":"USB plugs were a little off which was a slight concern but then the surge protector was already blown so none of it worked anyway","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Not worth buying","reviewDescription":"This outlet needs an anchor to the wall socket.  Every time I unplug something, the entire unit comes out from the socket.  If you don't want this to be permanent, then it may be okay for travel.  I'm disappointed in this purchase,","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"No fast charging, can't say for surge protection but many outlets","reviewDescription":"I purchased this to increase the number of outlets on my SO's night stand.While it does provide outlets the real selling point in my eyes was the 3 USB-A, 1 USB-C outlets to fast charge all of her devices.  Sadly the fast charge feature doesn't work, I'm returning the product as it doesn't provide the basic functionality that I required of it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"No screw to attach to receptacle","reviewDescription":"The product is fine. It works and is well constructed with one key defect - No screw to attach to receptacle. This is an important safety and functional aspect. As you pull plugs out, the whole thing can come out, exposing the receptacle and wires, which is definitely dangerous for kids. Most comparable products have this screw, which is super easy to install.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643068800000}
{"reviewTitle":"does not fit in outlet","reviewDescription":"it sticks out because the bottom does not go into the plug all the way","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677888000000}
{"reviewTitle":"Returning","reviewDescription":"Usb c port didnt work at all . Tried several cables all brand new and not 1 worked . Only reason i bought was for that port","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Would not buy again","reviewDescription":"Every time you remove a plug you have to hole it . It needs the center screw.  Pulls out of the receptacle. for this reason I would not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668556800000}
{"reviewTitle":"Surge Protector not charging USB devices after 4 months of use","reviewDescription":"This item was purchased specifically to charge and offer some USB device protection against power surges. After only four months of use the USB ports no longer charge devices.Does the surge protection even protect?The reason this is  asked is well made devices perform as expected and do not malfunction after only four months of use!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1635897600000}
{"reviewTitle":"Returning- pulls out if wall when you unplug","reviewDescription":"This is built sturdy. However, as there is no screw to hold it in place, it pulls out of outlet each time you unplug something.  I thought it had a screw but must have read wrong.Returning and will buy one with a screw.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646956800000}
{"reviewTitle":"Meh","reviewDescription":"It's okay. But I noticed it goes off at random times. Not sure why.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"Only one plug point in back, comes unplugged easily, does not deliver enough power","reviewDescription":"This product has been a disappointment. It comes unplugged from the wall too easily (more easily than things come unplugged from it), and it doesn't charge things very fast.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663545600000}
{"reviewTitle":"Didn't charge phone","reviewDescription":"Usb ports cut out and do not charge my phone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Love the design…hate that it’s not sturdier","reviewDescription":"If this product actually attached to the outlet…this would get 5 stars!!! But I hate the fact that I have to hold on to this to be able to unplug anything that I have plugged in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640044800000}
{"reviewTitle":"USB C port doesn't work","reviewDescription":"It works well enough. But the USB C port doesn't work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663200000000}
{"reviewTitle":"Easily falls off wall when you tug on any cord","reviewDescription":"Good concept. Works excellent. The only issue is that when it is not screwed into the socket. So when you disconnect a power cord. It very easily unplugs from the wall mount. I’m going to try some double sided tape on the edges","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1626998400000}
{"reviewTitle":"Doesn’t fit GFI outlets.","reviewDescription":"The dummy plug doesn’t line up with the ground receptacle.  It’s off by at least 1\/8” so it won’t seat into my outlet.Don’t bother buying if you want to put it in a GFI, it doesn’t fit GFI receptacles.It’s a good idea.  It’s a shame it won’t install universally.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1614124800000}
{"reviewTitle":"Would’ve been perfect if my outlets were different","reviewDescription":"I am unable to use in the intended outlet because of a long tubular piece that is attached to the back of the unit.  This piece prevents me from plugging in my outlet of choice.  See attached pictures.I would’ve returned, but threw the box away before discovering the issue.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1617235200000}
{"reviewTitle":"unstable in outllet","reviewDescription":"It works, but it is so heavy, it doesnt like to stay in the outlet, and of course when its partially in, it can spark when plugging t back in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640476800000}
{"reviewTitle":"Unsure About this Wall Charger\/Surge Protector","reviewDescription":"This brand is an unknown name to me and I have my doubts about it.No documentation was included with the device - no user manual, no warranty card. Are the specs as listed on Amazon accurate? Does this thing have a real warranty? I was not able to find a website for Addtam.","isVerified":true,"ratingScore":3,"reviewReaction":"47 people found this helpful","country":"United States","date":1607904000000}
{"reviewTitle":"Mediocre","reviewDescription":"Mediocre. Heavy plug in. Unbplugs easily","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663200000000}
{"reviewTitle":"Quality is questionable","reviewDescription":"No use issues yet but the physical build is a bit sloppy. My USB cords have to be angled down in order to get them to slide in properly. Can't recommend this outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633305600000}
{"reviewTitle":"Underpowered","reviewDescription":"Like most people said, this is underpowered. I left my phone plugged in, both with a fast charger and direct usb on the device, and my phone did not charge overnight. It held the power at whatever I went to sleep with.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"It's okay...","reviewDescription":"It is convenient to get multiple plugs into the outlet without a dropcord....but the USB port isn't even powerful enough to run ONE wireless charger.  I have to use the regular plug in part that the charger came with still.....kind of defeated the purpose of buying this product.  So all the USB ports are sitting unused.....LOL","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Works","reviewDescription":"Worked but doesn't fit over outlet well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"It’s as advertised","reviewDescription":"Was what I was expecting","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Not the best quality control, does work though.","reviewDescription":"The electrical pins are mobile in the back, the construction seems subpar. The front is nice and the ports work.The item does fit over the electrical socket which is fine, but worth noting. The stability when plugged in may have been stronger if that was part of the design to go over the back plate.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Great & less clutter","reviewDescription":"This work great, have several different types of pug styles to choose from.I also like that, I don’t have all the cords from the strip style protectors to deal with, less clutter is always better.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"So far, it's been worth the purchase","reviewDescription":"I like that I don't need to constantly unplug cords\/ find USB plug ins.  One thing I wish were improved would be replacing one of the USB ports with the USBC since it seems technology is going that direction.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Nicely made, NOT for GFCI or decora style outlets tho","reviewDescription":"The quality of this is great and it looks nice. It will NOT plug into GFI or GFCI outlets tho. Make sure you’re aware of what outlet you intend to put this on before buying and finding out it won’t plug into your outlet. The spacing of the ground holes in GFI type outlets makes it impossible to plug this into one. It odd only slightly off but it is important to know. Also to mount it to the wall properly you need access to the faceplate screw hole in the outlet. This means it won’t work well on decora style plugs if at all because you can’t mount it properly.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Good item","reviewDescription":"Good item for school dormitories.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Mostly works","reviewDescription":"This power plug mostly works. All of the outlets work except for the USB drives. None of them work. I thought about returning it except for the fact that I use the power plug my devices came with to plug into this device, so they aren't needed. It would have been nice to have them, though. Otherwise I like this device quite well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Good for USB, USB-C, and outlet AC","reviewDescription":"I liked the idea of slanted outlets for looks & functional cord dressing.I liked the different USB ports.  That has come in handy!  aka: USB-C, USB, & other USB.The unit is Too big as it hangs over the cover plate and things like cabinets and the like that crowd the duplex make it unusable in the kitchen where cell phoneS & tabletS live. aka: USB portS!  Back to Lowes for outlets with USBs ports.  I WISH!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Great concept - be sure you know where you are putting it.","reviewDescription":"The unit works great.  But be sure you know where you are going to use it.  We have it in a narrow area which limits what I can plug into it because of the angles.  Otherwise great piece.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"Cleared up my cord mess","reviewDescription":"Easy to use. Just plug in. Fits perfect in front of my bed. No more mess of tangled cords everywhere. Seems durable, but I haven’t had it long enough. I think it's a little large to use while traveling.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675814400000}
{"reviewTitle":"CHECK WATTAGE FOR USB-C!","reviewDescription":"This is a good product, just be advised that the wattage output by the USB-C may be not be enough for a laptop. It charges mine (Thinkpad X1), but the laptop complains when on a high load and suspends, since it doesn't get enough juice to power it fully.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"Plugs most devices","reviewDescription":"Lil bulky","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Works great but has a flaw","reviewDescription":"This product works really well and does everything it states it does. The biggest issue compared to others is that it does not have a screw to hold it in place. So occasionally it does become unplugged. Something to consider when purchasing. If you don;t unplug things often it is a great choice.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Ended Up Buying 2","reviewDescription":"This has been so handy and really helped clean up the mess of cords and plugs on my counter. It made so much of a difference, I bought another one and will probably add one to each room of the house. Happy with this!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"Compact and handy to have","reviewDescription":"It is a great compact unit to be able to plug so much into it. My only tiny grope, it doesn't feet weighty enough, when you want a surge protector, I come from the \"if it weighs a ton it must be doing something to stop surges\" this is a very versatile small unit, but it is very lightweight","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1673654400000}
{"reviewTitle":"Good product","reviewDescription":"I have this plug into my kitchen island and it’s a great addition to my kitchen island. Can charge any device and have enough outlets for my cooking utensils.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Does it’s job","reviewDescription":"I like this outlet extender. It works well, except that I do wish there was more variety in the size of the ports. It’s hard to find that feature in anything. Otherwise it’s great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674172800000}
{"reviewTitle":"Not for me","reviewDescription":"It’s hard to say anything about this product because in my bathroom space where I need it, it was just too wide. I replaced it with different one and I am happy now.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Usbc stopped working after 1 year","reviewDescription":"I liked the outlet extender. However, usbc outlet stopped working after 1year.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"USB ports stopped working","reviewDescription":"USB ports stopped working: defeats a purpose for purchasing. :(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"It Works","reviewDescription":"I guess I can blame myself for this, I should have studied it a bit closer, but maybe someone can benefit from my lesson learned. The thing is, if you plug anything in, you Might want to unplug it... and when you do the whole thing comes out of the wall socket. Unless you have the strength to remove one plug with two hands. I don't! I need a third hand or someone else to do it, who Might not be around. There's NO way to fasten it to the wall socket. Sometimes More is Not better!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Turns one outlet into 6","reviewDescription":"It doesn’t feel secure on the outlet. Perhaps using both sides of the outlet would improve that. Maybe have it so you have to remove the old faceplate and secure it with a screw.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Decent","reviewDescription":"I love it but the outlets I have are tamper\/child proof so the plastic pin that goes into the ground slot doesn’t want to go into the bottom outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"No Documention...","reviewDescription":"Very nice surge protector but the big problem, it simple comes in a nice nondescript box with no documentation with the item. Searched online but could not find anything about the product other than what was in the description this website.Website states 1800 joules surge protection, for those in the know, 1800 joules is considered very good but keep in mind this item is not UL listed rather it is ETL listed and according to information on back of item. It is UL STD 498a listed but this simply means the outlets are deemed safe. FYI - UL 1449 is the Underwriters Laboratories Safety Standard for Surge Protective Devices (SPD) is not found on item or any documentation.Had to return this item...","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Didn't work for me","reviewDescription":"It didn't stay in the wall for me it might be my wall plugs I tried it in a few different ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"No mounting screw","reviewDescription":"I have bought other brand outlet extenders in the past and I guess I assumed this one would be similar but it is not. All the others had a mounting screw so it can be fixed firmly to the wall. This one does not. So whenever I pull a plug out it often will pull the whole extender out as well, actually all the time if I am not careful. So that's kind of a problem for me. So I have replaced it with one of the other brands and have relegated this to a backup role. i.e. into the junk drawer it goes. Just giving anyone a heads-up.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"It'll do the job.","reviewDescription":"The most important aspect of this is the undisclosed warranty.  I constantly look for it whenever I buy something - regardless of the cost of the unit.  (See my posted question as a reference.)  I contacted the company and they noted twelve months.  This, to me, is worth considering more, especially when the price is right.  Otherwise, I'd get the alternate\/competitor without a second thought.As an adaptor, it's a really good design.  I needed this to be simple and space efficient with different plugs.  This is used in my kitchen where I plan to use at least one of the USB ports for holiday night light(s), and at least one of the regular plugs for a coffee maker that has it's own plug switch.  So it'll need lots of spacing, but won't be overloaded.  The spacing of the outlets is the key because of the positioning of the USB part sufficiently out of the way. I prefer this style over the competitors as it's a very clean and simple look with no seams or creases on the edges, and matches well with a plain white wall. The problem is, it doesn't attach firmly or securely to the outlet without screw-in support.  I've found others that do, I just don't like their outer, faceplate style as much.As a surge protector, I won't know until it's needed.  But it's nice to know that it's ready.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1635465600000}
{"reviewTitle":"Charging power is slow","reviewDescription":"I like having all the slots. However, the charging power is quite slow and I have both types of cables. Other than that its good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Fine for most charging, however…","reviewDescription":"Great for phones and iPads. The description said it works for MacBook Air via C, however it doesn’t work. Thought you should know","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"One outlet doesn't work","reviewDescription":"Just starting using it yesterday, so these are initial impressions. Giving it a three for now, but may downgrade depending on how much more annoyed I get with it. Don't feel like going through the return process, but still might. You can't plug anything into one of the five regular outlets, something about the shape prevents the plug from sinking. It also is kind of unstable, every time it gets bumped it tilts in the socket despite having a plastic brace the fits into the lower socket. Since I am using this in my kids' room as their charging station, it gets bumped often when they take their tablets off the chargers plugged into the USB sockets. It seems fairly sturdy, though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"Falls out of outlet","reviewDescription":"There's no way to secure this to the outlet so if you pull a plug out, the whole unit will come out as well. Definitely get an option that has a way to screw the outlet to the wall outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"No documentation","reviewDescription":"On paper, this surge protector has everything I need plus USB charging. I wanted something that would be hidden behind a piece of furniture without having set it on the floor or mount it off the floor. Unfortunately, most of the direct plug-in surge protectors don't offer as much protection as corded protectors. Unfortunately, this comes with no documentation. From the description online, it offers 1800 Joules of protection and the light indicates active surge protection. There is no mention of a warranty anywhere. One reviewer mentioned it does not fit GFCI outlets. There is warning on the back that states not to use it with GFCI outlets. There is a plastic piece that fits into the lower outlet to help secure it in place, but there is no center bolt. That's unimportant if you have a decora outlet which have not use a center hole for mounting the outlet plate. I won't be using the USB ports, so I can't comment on how they work.This surge protector does meet my needs, but I would be hesitant to trust its protection for anything significant value. (All of the devices I have connected are either very old or inexpensive.)","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1625875200000}
{"reviewTitle":"One slot has stopped charging","reviewDescription":"Overall, I guess it's a good product, but I'm disappointed that one of the USB ports has already stopped charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"It's OK, see explanation.","reviewDescription":"This had plenty of wattage to allow for a microwave and a freezer (not much more). This has a USB-C and USB ports and the angled 110v were nice as well.However it is easy to fall out of the wall. A nicer unit allows you screw through the middle into the plug plate, stopping it from falling out of the wall. This unit does NOT have that. You will need to tape, glue or lean something on it to keep it from falling out of the wall socket.If I would have payed attention to the fact it doesn't screw into the plug, I would NOT have purchased this product.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"Great power outlet with caveat","reviewDescription":"At the time of the review, I've had this unit for 3 month. This is a great power outlet that expands AC ports as well as adding extra USB charging ports. It added a ton of functionality and convenience.However, I only give it a 3-star for its One potential caveat, so people in my similar situation can be aware of what may be in store. I had mine plugged in next to my night stand, and 3 months in, I started to notice a high pitch noise coming out of the outlet. It gets louder as more load is connected to the USB portable. I'm blessed with relatively good hearing (I was hope that happened to my vision as well, oh well), and in the middle of night, when all the devices are plugged and ambient is ultra quiet, the noise started to affect my sleep as it get very annoying during quasi-sleep state. I started to disconnect the unit at night and looking for a potential replacement.Overall, I recommend this to anyone who will place the unit far away from where he\/she sleeps.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1626393600000}
{"reviewTitle":"Slow USB charging","reviewDescription":"It could be faster.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Works, would prefer if I could screw it in","reviewDescription":"We have had no issues with it working. However, I've had to push it back into the wall a couple times because other family members have left it not fully plugged in after unplugging something. It would be helpful if it had a screw in the middle like some other products do. I'm even considering replacing it with one that does and moving this to some place that has has things plugged in more permanently.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1678924800000}
{"reviewTitle":"Does the job but needs one more feature","reviewDescription":"I like this outlet for its versatility, but it could use a long screw to attach to the outlet.  In order to pull a plug from this unit, you need to hold it so that it doesn't pull out of the socket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"Does NOT plug into GFI outlets","reviewDescription":"I bought these to use in the kitchen where I have 2 GFI outlets with 3 small appliances and a microwave plus 2 under counter lighting strips that can plug into USB ports ... only to find out they don't fit in a GFI outlet so they were totally useless for my needs.They are also not especially well made - I couldn't plug in a Glade plugins air freshener in either of them, and the USB C outlet doesn't feel like it connects very well. I now have them in a bedroom and a living room outlet where they fit but aren't anywhere near as useful for me.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Multi plug Outlet","reviewDescription":"The item does not have a screw to secure ot to the wall, resulting in having to hold it to remove or change items plugged into it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"I didn’t need a night light","reviewDescription":"Functions as advertised. Has a green light that’s always on and can’t be turned off. I wish it was clear that this is essentially also a night light that can’t be turned off. If you’re okay with a bright green light and this isn’t for a bedroom it should work for you.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Worked for 8 months","reviewDescription":"I bought this product in order to not have power strips sitting on the floor under my bedside table. It did a great job at that, it really tidied up all the cords I have. The problem is that eight months later, it simply quit working. I did reach out to the company via Amazon to see if there was a warranty option, and never heard back. All in all, I liked it for the eight months it did work, but I would not buy it again because it does not seem to be built to last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Doesn’t fast charge","reviewDescription":"Unfortunately this product does not do maximum speed fast charging for iPhones via the USB-C outlet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"USB ports charge very slowly","reviewDescription":"I like the design except that both prongs are the same width, and it doesn't screw into your outlet, so it could easily be knocked loose. Unfortunately if you're trying to use your phone while it's charging, you'll wind up with a dead phone. I tried out a bunch of configurations with cords, adapters, and the wall outlet, testing charge times, and this thing is getting recycled. Disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"USB C outlet stopped working","reviewDescription":"This was a pretty decent outlet extender for a while, until the USBC charging port just stopped working. It still lights up, but it gives no charge after trying multiple cables and devices.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"No funcionan los puertos usb","reviewDescription":"A uno de los dos que compré no le funcionan los puertos usb","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Stopped working","reviewDescription":"Great for a yearIt stopped working after thatDisappointing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Bottom prong does not insert","reviewDescription":"Product works to connect power but the bottom prong is not low enough for any outlet in my home. Looks really tacky.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Wall charger","reviewDescription":"Works good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Takes care of a landline, modem, & chargers multiple devices. What’s not to like?","reviewDescription":"Reasonably priced. Good quality. As advertised","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Works properly as far as I have tested, No way to remove green LED protection light","reviewDescription":"I have this unit in my bedroom, and it works properly. I like my room to be dark at night, and since there is no way for the green LED protection light to be switched off or properly covered, I make the effort to unplug this unit in its entirety at nighttime. But, if this unit is not in a bedroom, then there really is not an issue!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"A must have","reviewDescription":"I use this throughout the house and take it with me when I travel. It is a must have if you have multiple electronics that you need access to at the same time. And it’s perfect in a household with multiple users who need access to outlets and charging options.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Works well, but can start to fall off outlet if too heavy from plugs","reviewDescription":"All the ports work well, but if you plug too many things in and it gets too heavy, it’ll start to fall out of the outlet. For example, when you go and unplug one of the plugs, the whole thing will fall off the outlet. You just have to be careful and hold it in place, don’t yank on it. But other than that it’s totally fine.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Does the job.","reviewDescription":"Very good. Does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Multi plug","reviewDescription":"A must if you need to plug multiple cords at once. I haven't had any issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Almost perfect","reviewDescription":"It works great but when you use usb-c it doesn’t give enough power to run my Apple HomePod had to add the block and use the regular outlet","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Good wall outlet extender","reviewDescription":"I got two of these, thinking that it would solve the problem of my outlets being wired with one outlet being switched. It didn't work for that, but makes a good outlet extender with usb.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Good! Just a little wobbly","reviewDescription":"Works awesome, love it, sturdy and high quality. Only issue (I think it's my outlets honestly) is it does tend to come loose\/fall off the wall if you're active near it or bumping it. Would buy again though!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Can't have to many USB power sockets, that's what I say!","reviewDescription":"I use these mainly around the house.  I think I bought 8 and all have been put to good use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"handy","reviewDescription":"This product works well as it has multi uses as  phone chargers and other outlets for appliances, etc.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Needed it","reviewDescription":"Great to have","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Very Helpful!","reviewDescription":"Nice looking and with plenty of outlets to use - including USB and type C ports.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Easy to use","reviewDescription":"I used this to protect my tv,  my cellphone and the printer from power surges. It is easy to install and to utilize it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Great buy","reviewDescription":"I would 1 for every room that has alot of stuff to plus in I have one in every bed room","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Sleek look","reviewDescription":"Looks nice and works well. I love the safety features and its durability - good quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great buy","reviewDescription":"We use this in our bathroom to charge razors, toothbrush’s etc.  works great for everything.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Exactly what I needed!","reviewDescription":"My house is woefully low on plugins for a tech generation. Even more frustrating, is that less and less of the plugs have grounded outlets. This means the grounded outlets are even more important. As a result, we have a lot of power strips. Unfortunately, power strips take up a lot of space and aren't the most well designed for charging items. Lately I've been getting additional electronics for my aquarium and plants, and they seem to come with either USBs as the plugin or a charger adapter for USB. Since none of my old outlets are designed for USB it's even more frustrating. Fortunately, this outlet adapter allows you to have USB directly plug in plus it is designed so that charging units are actually spaced far enough apart that they make sense. Words can't express how happy I've been now that I don't have to hunt around for adapters and plugs!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"The usb charges slow but it's a good piece","reviewDescription":"I like the way it looks, and that I can plug multiple things in at once and that it has different ports for phone charging. It charges the phones pretty slow though","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Worked for 4 months and then died","reviewDescription":"Originally bought to charge my apple products. Loved the multiple outlets that could charge various things. Unfortunately, 4 months later, 1 month after the warranty was up, it has just stopped charging altogether. Tried it on multiple outlets and nothing works anymore. Tried reaching out to customer support and was just told that the time had passed to get a refund or replacement. I understand company’s have policies but I’m disappointed in the product and wouldn’t recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1650672000000}
{"reviewTitle":"No usb power","reviewDescription":"The USB plugs would not charge my iPad. The regular plugs work, and it does look better than what I had there before, so it stays. However if you’re looking at this for reliance upon the USB charging, I would look elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"Does not secure to the outlet, is easily accidentally loosened.","reviewDescription":"This outlet does not screw into the wall like most outlet extenders. I had my bread maker plugged into the side, and my teenager had their devices plugged into the front. My kid accidentally loosened the entire plug block. He didn’t notice, and my bread machine turned off. Ruining it obviously. And so while I really like the number of outlets and the look and design of the plug, I have to be careful not to use it for anything that will be interrupted if it’s unplugged.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639526400000}
{"reviewTitle":"Sending it back","reviewDescription":"After looking through more reviews and how hot it got in a short amount of time. I do not want to use this in my house. We tested a night light in it and it got really bright then the bulb burnt out within a minute.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Some outlets do not work","reviewDescription":"We ordered 2. One works great, the other has multiple outlets that do not work and it is outside of the return window now. Very disappointed with the quality.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"The make a annoying buzzing sound","reviewDescription":"Almost perfect but the sound drives me crazy","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Worked fine but 120V socket failed","reviewDescription":"Only one lamp and a recliner chair with heat were plugged into 120v. One cell phone wire plugged in. The 120v failed after one year and I don't know why.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"C pot and USB stopped working","reviewDescription":"The wall charger is decent but the usb and c ports stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682121600000}
{"reviewTitle":"Doesn't work","reviewDescription":"The left side could not plug in - no review at this point","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"This item doesn't screw into the receptacle.","reviewDescription":"Since it doesn't screw into the receptacle, it isn't very secure. In order to unplug anything, you MUST hold onto the outlet extender. Also, if you plug more than a couple of things into it, it pulls away from the wall. Look for outlet extenders that actually attach to the receptacle.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"Too Expensive, poor build quality","reviewDescription":"I do NOT recommend thisToo Expensive, poor build quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Meh","reviewDescription":"TYPE C PORT AND SOME USB PORTS DOESN'T WORK","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685232000000}
{"reviewTitle":"Should have looked closer for screw mount","reviewDescription":"Perfect except for the lack of a screw mount..falls out and can damage electronics doing that...get one with screw mount for plug in wall.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679961600000}
{"reviewTitle":"Ok protector","reviewDescription":"It’s sturdy and heavy. It has an extra plastic piece so it actually takes up 2 plug spaces (one for the actual plug and the 2nd for the plastic piece which I think works as a secure Mount). The reason I didn’t like it is bc the usb charge Is slow and when you want to remove it from the wall plug you have to hold down the actual wall plug I order not to pull out the whole wall socket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1664064000000}
{"reviewTitle":"Would try again","reviewDescription":"I bought 2 of these. One of them the USB port won't work for my cell phone, it works on every thing else though. The other one works great!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"No Centers Screw to hold on wall.","reviewDescription":"There is no centers screw to a fix on wall. After plugging in something, it pulls the unit out from the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"Good Wall Hub, USB C Port Died","reviewDescription":"I would like to say that I’d give this hub 5 stars if the Type C port didn’t die out on me! I really like the design of this one, it’s nice to have a few more wall sockets and a USB hub all in one. Everything was working as expected until a couple days ago, after about 7 months of having a wireless charger connected to it the USB type C port went kaput. Overall a very good product, everything else is working wonderfully.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1648598400000}
{"reviewTitle":"All in one power","reviewDescription":"I like the device but I thought it would have a screw in the middle to anchor it down in place of the receptacle face plate. Not thrilled with the electrical concerns of arcing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Doesn't fit an outlet well","reviewDescription":"This covers both outlets, however, only plugs into one. There is a plastic peg that is supposed to go into the ground part of the 2nd outlet. However it doesn't go in all the way and it's not tight.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"More you plug in the lower the charge","reviewDescription":"Good in theory but the more you plug in, more than 2, other things won’t charge. Nice having the USB ports.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"1 amp per usb","reviewDescription":"Only has 1 amp per usb outlet!  This means its a very slow charger!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Almost caused fire","reviewDescription":"After only 6 months of using it (Had only a printer and few USB charger connected) It almost caused fire.One morning I woke up from the burning smell and I thought it was the outlet itself. After a while testing this and that, I realized it was this wall charger. All others were fine, but it started heating up again when this was plugged in.Potentially fire hazard product and this should be banned from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1643760000000}
{"reviewTitle":"It keeps shorting out, not working","reviewDescription":"It only works if I'm holding it or if I keep wiggling it. They seems to have a shortage or something - doesn't seem super safe to keep using.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Usb charging stopped working","reviewDescription":"Usb charging stopped working after 60 days …. after the 30 day return window","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"It melted and almost burned up!! Hard no!!","reviewDescription":"I bought this in November of 2022 and as of March 29, 2023 upon returning from spring break this is what the outlet looked like. we unplugged it immediately. Sure do wish I could get my money back!! Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1680134400000}
{"reviewTitle":"Loud ringing noise when connected to USB-C port.","reviewDescription":"I bought this mainly for the USB-C port. Unfortunately whenever I’m connected using an Apple USB-C to lightning cable, the adapter makes a high pitched ringing noise. I tried using an ANKER USB-C to lightning cable as well, and it makes a really loud and unpleasant ring. If you’re connected near your bed, you’re gonna hear this noise. I might sensitive to the ring... As it turns out, I won’t be using the USB-C port which seems like a waste. I could’ve gotten a cheaper option instead.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1617580800000}
{"reviewTitle":"Large","reviewDescription":"Needs to go on a single outlet as it will cover the other outlet side on double outlets","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Poor manufacturing plugs dont align","reviewDescription":"It is very difficult to insert USB male plug into USB receptacle on this unit due to misalignment of the internal connectors with the housing. If the housing does not align with internal connections which then leads me to believe that it was poorly manufactured as there is clearly no attention to detail.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1665792000000}
{"reviewTitle":"Poor function","reviewDescription":"Will not charge 2 usb-c devices simultaneously. Can’t recommend to anyone looking to charge multiple devices at the same time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Order 2 pack, sent 1","reviewDescription":"I paid for the 2 pack and only received 1.  Now I have to waste my time returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696636800000}
