{"reviewTitle":"Decent cable but can’t sustain true 4K HDR at 144hz","reviewDescription":"I used this between PC and TV. TV is a TCL QM8, which has game mode, variable refresh, local dimming, HDR, and atmos. This cable couldn’t hold up to the task. Every few minutes, the screen would “reconnect”. After trying a different cable, I found this to be the culprit. This thing doesn’t actually seem capable of the 48gbps advertised.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"30ft cable - getting black\/blank screen every few minutes when running at 144Hz","reviewDescription":"Unfortunately as soon as I put this cable in I'm getting occasional blank\/black screens for 1-2 seconds (about every 3-5 minutes) with this 30ft cable when running 144Hz.  Using a shorter cable (10ft) does not shows this behavior, however I need to move the display further away so I think I need to find a fiber HDMI 2.1 8K cable.  Thanks","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"4K @ 120Hz HDR works some of the time...","reviewDescription":"I've been using a 4K TV as a gaming monitor for my PC since 2016. I was using a QLED 55\" screen and pretty much any HDMI cable I used worked to output 4K @ 60Hz and HDR + 10-bit color. I recently replaced that QLED with an OLED which can do 4K @ 120Hz and HDR + 10-bit color. Any old HDMI cable will no longer do.So here we are, The Highwings 8K cable, rated at 48Gbps. Does it work to support 120Hz and HDR? Sure it does, with caveats. Read on.After attaching this cable to my new LG G2 OLED TV and my RTX 3090 GPU, I had nothing but problems. Everything will work for a while but after some time, eventually, the HDR will go on and off like the TV is losing the signal, or these weird artifacts will appear across the screen. It wasn't very pleasant if I'm being honest.After this, I proceeded to purchase multiple HDMI 2.1 cables (some even claimed certification) but after buying 5 different brands, and all of them having issues with 4K \/ 120 Hz with HDR, I finally decided to go to a brick-and-mortar store and buy a $50 HDMI 2.1 certified cable. Would you like to guess what happened next?EVERYTHING WORKS PERFECTLY.So, if you really need a high-quality HDMI cable, maybe you'll get lucky with one of these cheap cables from Amazon, or maybe you can save yourself all the aggravation and just buy a good, brand-name cable from your local audio\/video store.I've never been one to spend a lot on cables, and Amazon is my go-to for fair-priced cable options but one thing I found with these cheap HDMI 2.1 cables from Amazon, is they typically work out of the box\/bag but during long hours of use, they start to fall short. Maybe they really aren't truly 48Gbps cables. I couldn't say. I can say I had nothing but issues and when finally un-tightening my butt cheeks and spending $50 on a name-brand cable (probably made in China too but to a higher standard) everything just worked. I could have saved myself a lot of research and time.\/edit. I am going to repeat this very review for each of the HDMI cables I bought recently that were not up to snuff.","isVerified":true,"ratingScore":3,"reviewReaction":"45 people found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Short and very stiff","reviewDescription":"I bought the 1 foot and 1.5 foot cable lengths. They seem to be of a good build quality. However, be aware that these cables are very, very stiff and they come looped. This means that the cable is curled in one direction, and you hope that it's the direction you need it to curl in!Additionally, the length is a bit misleading. The measurement is from the tip of of each connector. The cable length itself ends up being about 8 inches for the 1 foot and 13\" for the 1.5 foot.No issues with signal transmission so far, but I had to twist them 180° to connect two pieces of equipment. With the stiffness I do have some concern about it twisting the ports into which it's plugged. I am most likely going to return them for a different cable because of these issues.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"Cable worked great but failed","reviewDescription":"The cable worked for a number of months and then after moving my computer to a new location the cable has stopped working after unplugging in and then plugging it back in once my computer was set back up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Does not work with Sonos Arc","reviewDescription":"Does not work with Sonos Arc. It keeps falling out and disconnecting.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Low quality shipping. Doesn't work well","reviewDescription":"It shipped in it's thin cardboard box which was open upon delivery. The cable was coming out a bit. The cable seems high quality, but it's very stiff and heavy. When playing games at 4k 120hz, it glitches ever 5 minutes or so. Just turns black for a few seconds, and then goes back to normal. Other cables work fine, so it's not my devices. I'd recommend anyone needing 25ft just get a fiber optic cable, and save yourself the headache.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Funcionan pero","reviewDescription":"De los dos que compré uno salió malo no funciona","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Mediocre quality","reviewDescription":"Mediocre unlit for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Didn't really improve the quality of the picture","reviewDescription":"4k tv","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Wrong length and Does not work with 4k 120hz","reviewDescription":"As title says, this does not work when using it connect my rtx 3080  gaming PC to any of the  HDMI 2.1 (4k 120hz \/144hz)  ports on my tcl qm8. No issues when  connected to 4k 60hz port. Also the 15ft I ordered is definitely shorter than 15 ft. More like 12 ft this is a bummer because I bought this so that I don't have to keep my PC near my TV stand.  And unfortunately I didn't test it immediately since I was doing some other remodeling work in the room. Now I am past the return window!Update.  Just the say that it was indeed the right length (15ft) that was sent. However the complaint about the 4k 120hz signal still holds. I even reversed directions and they didn't help much. No signal or just flickering.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Does not support 120 hz.","reviewDescription":"I was using this for a gaming setup. To get my computer farther away because the heat from the exhaust is unbearable. Unfortunately this does not support 120 hz like it says. At 120 hz i have to turn off free sync, motion blur reduction and hdr just to get a picture. Even then the picture is very pixelated and blacks out about every 30 seconds. The only solid picture i saw was at 60 hz. Switched to a rocket bunny cord and my issue was solved immediately.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Junk, total junk. epic Fail","reviewDescription":"Short version:junk - don't buy - poor video even at lower than rated bandwidthLonger version:My setup is pretty simplePanasonic UB820 player >> HDFury Vertex2 >> Epson 5050UBThe Panasonic is only used for playing blurays and UHD blurays, no streaming. I decided to do some cabling upgrades in my system and was going to use this \"8k\" cable to replace the old \"4k\" cable between the Panasonic player and the HDFury (3.3ft cable). After installing the new 8k Highwings cable I was seeing video dropouts and sync issues for up to 5 minutes after any resolution or frame-rate change, such as going between menus and content. Also seeing a lot of sparkles in the picture, and I mean this was sparkling more than the chrome on my neighbors motorcycle. This was happening at 4k-24p 422-12bit (DV\/HDR). I had ordered three of these cables, so I tried a second 8k cable, did the exact same thing. I put the 4 year old \"4k\" cable back in (a rocketfish, BTW) and all the problems went away. Tried a second time with the two 8k cables, and still no bueno.If they have problems at 4k24 I can't imagine they are working any better at 4k120 or 8k60.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Went bad quickly","reviewDescription":"This cable went bad quickly. I have it connected between my ps5 and capture card and thought the capture card went out, but nope. Changed this cord out to a different brand and style and immediately worked. In fact, I have had 3 hdmi cords in this style just go bad. Most recently was a 10ft 8k cord I take for traveling, bought a ge cord from Walmart and it worked immediately.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Expensive, useless junk.  Don't do it.","reviewDescription":"I bought this cable to connect my iPad to a recent model Sony flat screen TV using an Apple Lightning to HDMI connector.  WIthin a few weeks, the sound would contimue but the picture went black from time to time, more and more frequently. I only yesterday thought to try a different HDMI cable and confirmed that this one is useless. And of course only 3 days after the return window closed. Claimed to have a lifetime warranty but I retained no info from the manufaturer.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Does not support 4k 120Hz with a Playstation 5","reviewDescription":"I really wanted this to work so that I wouldn't have to keep bringing my Playstation 5 to different areas of my home, but the best I got was 4k 60p. I don't know if there is a limitation based on cable length but boy what a disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Sound keeps dropping out with video and with some games at max resolution","reviewDescription":"Whenever I play a game at 4k with the settings maxed out, the sound cuts out as well as severe stutter at times.Also, the sound cuts out with certain movies like UHD 4k movies.Seems like a bandwidth issue at the upper end.This is also with the refresh rate set to 120hz that there is a problem.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Poor Quality…","reviewDescription":"Ordered these because I needed longer HDMI cables. They do not work well. It seems at least once every ten minutes my sound cuts out for a brief second before returning. Additionally, I will occasionally lose picture for a second or two. It isn’t as frequent but I have also lost sound and picture enough that it seems to reset my whole system. Pretty bummed that things like this cannot just work the way they are supposed to…","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Broken in 5 months","reviewDescription":"This cable sat connected, but hardly touched in my entertainment center for 5 months before spontaneously ceasing to work. I’m not sure how a cable can suddenly self destruct like that, but I imagine it speaks to the lack of quality in its design. If you need a cable that works, I suggest looking elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"No shielding","reviewDescription":"I used this item going from my receiver to the tv. It worked fine for about 3 weeks. Over the last week, I’ve been noticing issues with lines in the picture (tv program) but attributed it to the carrier having local problems. Then I started hearing a periodic tick coming from my speakers. After doing some troubleshooting, I saw that the issue was from the 3 hdmi cables I replaced. Any contact to them from a power cord would result in issues with sound and picture quality. I replaced the cables with my old ones and all the issues are gone. Unfortunately, I’m outside of my return window by 3 days now. Bear in mind, this was used in a home theater. There are always going to be cables close to each other. I would NOT recommend using these cables.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"I had issues with mine, replaced it and so far so good... RTX-4090 + LG C3","reviewDescription":"I ended up trying this cable because it had really good feedback, I was using it from an RTX-4090 to an LG C3 OLED and in my dual display setup I noticed I'd have my main display (this one) cutting out sometimes and doing a weird blocky pattern which I thought was a Chromium issue based on countless reddit, forum, etc. posts so I just assumed that's all it was.It eventually started getting worse where my picture would cut out for a second just doing normal stuff like Photoshop or browsing and sound would go with it as well often times for a split second while my other monitor never even flickered (Display Port).I was worried by the frequency and strange artifact\/checker pattern sometimes and was kind of scared my expensive and basically brand new GPU was problematic \/ defective but since I replaced this with a similarly priced Anker cable I haven't had an issue yet (knock on wood).I also saw noticeable stepping in gradients, I'm always doing creative work and dark gradients showed prominent stepping between tonal levels and that seemed odd for such a high end GPU and pretty damn good TV as well, my Sony Bravia I used from 2016-2024 never had a similar issue.I'm guessing that was the cable too... this might be a good cable most of the time, maybe I was just unlucky and got a bad one but yeah, my experience is a lot better since replacing it so far.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Cannot confirm if product works.","reviewDescription":"I intended to use this HDMI cable to do the simplest of vanilla tasks:  I  was going to use it to connect my HP Chromebook to a flat-screen monitor so I could use a bigger computer display.  It connects OK, and everything electronic seems to work, but the only image it will display on the external monitor is the desktop image from the computer without ever having any icons or writing on top of it.  I don't see how this is possible.  My only guess is that the complexity level that humans have allowed is too high.  Since this HDMI cable enables USB and other digital intercommunication between the devices, I can only guess that HP or LG (monitor manufacturer) screwed up their implementation of some standard which should allow the HDMI video to stream to the monitor screen by default.  I doesn't do that.  I can't make it do that.I guess my advice would have to be:  Don't buy this cable if you want to connect your computer to an external monitor.  Get an old-style dumb HDMI cable that can only stream video, and does not simultaneously enable digital communication, because this smart cable won't allow me to do the simplest most basic thing that HDMI was created  to do:  Stream video.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"It worked for a little while","reviewDescription":"It was good and worked for a little while on my TV and such, I stopped using it for a good few months though, then started using it for my PC and it was fine for a month or so.Unfortunately it started having issues at the connection and the screen flickers black occasionally and I have to wiggle it. Not fun when you're in the middle of something.The cord is thick and long, it looks like it's sturdy and for the price that's great- if only the connection parts weren't screwy...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Cheap Connections & Only 30 Days to Return","reviewDescription":"Every once in a while my tv would suddenly go black for moment and it took me a while to finally start investigating. I finally found it was the connectors on this cord. The connection is so poor that barely touching the cord would make my tv lose signal. I had assumed I would still be under warranty because most sellers in America give 1 year for electronics, but no. Not this company. 30 days is all you get. Unless you don’t mind really rolling the dice, I suggest you buy a better product, especially one with at least a year warranty.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Very stiff cable. Could hardly keep it plugged in.","reviewDescription":"I purchased this 15 ft HDMI cable to run a TV for homeschooling my grandsons. It worked at first but the cable is so thick and stiff that it would disconnect from the computer with any movement at all. Unusable. Perhaps I can return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Has problems with ARC","reviewDescription":"I had this cable for 8 months and while the build quality is great, I finally realized the HDMI ARC problem I've been having is because of this cable.  I this cable connected from my TV to my avr.  I have another android box connected to my TV HDMI port.  My TV setup box is connected to my avr.  When I'm watching TV and decide to switch to my android box, I always never get any sound initially.  I've always had to turn off the AVR and turn it back on for the Android box to have sound.  I researched this and I had thought it is because my avr is at 12 years is too old. Finally I bought another cable to test this.  Right away the problem went away.  I am able to switch between my TV set top box and my android box without having no sound.  So it was this cable all along that has problems with ARC.  Too bad I can't return it now but at least I figured it my problem of 8 months!","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Horrible connection","reviewDescription":"This HDMI has a horrible connection. It keeps disconnecting and causing the screen to go black and part of the picture gets staticy, also there ends up being blue lines everywhere. I know it's not my PlayStation 5 because when I hook it up to my other TV with a different cord it doesn't do this. Also, when I hook-up PC to the main monitor with a different cord it doesn't do it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"The answer for Dolby vision @ 4k 60hz.","reviewDescription":"I tried a few cables and none of them work with Apple TV4k to pass Dolby Vision content @4k 60Hz. Many of the cables I tried only pass Dolby Vision @4k 30Hz signal with shorter cable length and some don't work with Apple TV4k even with lower refresh rate and shorter HDMI cables. I bought two different lengths of the Highwings 8K HDMI cables (15 feet and 20 feet) and both pass Dolby Vision with 4k@ 60Hz with 422 12-bit color and 4k@ 60Hz with 444 color for HDR. I can FINALLY send custom EDID with 4k60 422 12-bit color from my HDFury Vertex2 to my JVC projector. Awesome!UPDATE: I am revising my review and reducing my rating to two stars as the 20 feet cable failed after a short period of use. The cable frequently drops a 4k @60hz Dolby Vision signal from Apple TV. I get no image but a snowy picture when it does that. I have to unplug and reconnect the cable to make it work but after 10 minutes or so later, the drops the signal again. The 15-foot cable form the same brand still works with Dolby vision SO FAR, but I doubt the longevity of these cable. The last cable I had from Monoprice and Blue Jeans still works after several years of ownership. I will be returning this cable and look for a certified version HDMI 48 Gbps cable.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"Is cable defective?","reviewDescription":"I followed directions from a YouTube tutorial on how to connect my smart TV to my old school receiver with 4 speakers a subwoofer using an HDMI cable. It worked great for one week; now there’s feedback when turning on the TV also volume is turned up to 40+ on both for medium sound quality. Has anyone else have issues? If so PLZZZ share how to resolve and ThnkU !!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Worked great but quit","reviewDescription":"Worked great for 4-5 months. Then it started acting funny. Video would drop or act like the refresh rate was messed up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Small","reviewDescription":"Not 1.5 ft more like 6inches","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677888000000}
{"reviewTitle":"Not 48 Gbps","reviewDescription":"1.5ft cord I received did not test pat 18Gbps. Will be returning.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676505600000}
{"reviewTitle":"cuts out randomly","reviewDescription":"it supports 4k 120hz hdr but occasionally it just cuts black for 1-5 seconds on my sony bravia tv, kinda annoying tbh","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657152000000}
{"reviewTitle":"My TV diagnosis recommends me to change to certified HDMI cable for better quality","reviewDescription":"My TV diagnosis recommends me to change to certified HDMI cable for better quality. I realized this is not a certified cable and makes pictures blurry and uneven color ony QLED TV","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1644364800000}
{"reviewTitle":"They slide out too easily","reviewDescription":"They’re great except they seem just a bit too small such that they slide in and out of the ports too easily. If you for example try to reposition a device, cable just comes out. Bought 3, happens to all on both ends.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1633564800000}
{"reviewTitle":"So thick you can tow a truck with it!","reviewDescription":"Over time it will add to much wear and tear to the inlet ports because it's so thick and heavy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648339200000}
{"reviewTitle":"Expected longer 😩","reviewDescription":"Was 3ft always this short","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658793600000}
{"reviewTitle":"Loose fit","reviewDescription":"Seemed to work but as others have mentioned, it fits HDMI connector loosely.  Replaced with certified Monoprice cable from Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1642809600000}
{"reviewTitle":"Heavy & Bulky","reviewDescription":"This item is quality material.  It feels like heavy metal and pretty bulky.  I thought it was made of the same material as phone chargers.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"Insect in box.","reviewDescription":"A MOTH FLEW OUT OF THE BOX ON OPENING. The cable is doing fine. The unanticipated moth, not so much.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638489600000}
{"reviewTitle":"Nice, but thicker than stainless brake lines","reviewDescription":"Nice, but thicker than stainless brake lines.. a little overkill.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625529600000}
{"reviewTitle":"Decent cable nothing special","reviewDescription":"It gets the job done.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Doesn’t work with my main TV, it’s always zoomed in, when I custom resize it’s blurry","reviewDescription":"I tried everything. Plugged it in and it’s automatically zoomed in where I do not see some of my icons. The footage is clear when it’s on the automatically detected settings but I want to see my whole screen. I went to display settings and I was able to mix and match resize it to fit and then it’s blurrier than my standard HDMI cable. I ended up connecting it to a standard 1080p tv and to my laptop and it works great on that and is crystal clear.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1609632000000}
{"reviewTitle":"roku","reviewDescription":"I know it says Roku but I didnt think that it meant it would not fit in the back of my dell computer.  Not tight- loose  lose connection.  Cant send it  back so stuck with for a while to at least get my moneys worth.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Cable failed just after return window closed, junk","reviewDescription":"The cable began working intermittently, now problem is so bad it’s unusable 2 months after buying it, I would give a zero rating if at all possible","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Does not work as intended","reviewDescription":"This cable caused major artifacting while gaming, slowly and progressively getting worse over the course of about three days, until it was pure flashing and the signal to the monitor was turning off and on again. Immediately replaced with my old (but too short) Rocketfish cable, which immediately worked flawlessly. This is junk if you are intending on 4k 120hz gaming.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Broke almost immediately","reviewDescription":"Bought this on May 6th and used it to connect my PC to an external monitor. Today is July 11th and the cord has stopped working. After initial setup I haven’t touched the cord. It was incredibly confusing to figure out why my monitor stopped working as a faulty hdmi cable after 2 months seemed ridiculous to me","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Not worth buying.","reviewDescription":"While the cable and ends appear to be good quality, the only thing that matters is the picture quality they produce. Well, there WAS a picture, but that is the end of the good parts. Every color was muted or distorted: whites looked yellow and yellows were orange. No colors rendered true and there was no adjustment to be made that fixed the colors. I reattached my 'old' cable and the picture quality was great! I bought this cable to hook up my 'old' computer to the one monitor I have (it has two HDMI ports). Now I have to go back to switching the one working cable I have.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"No Way","reviewDescription":"My TV is a Phillips Roku.  This cord will not work with just \"anything\"  I thought this was a generic cord.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"White spots flickering","reviewDescription":"Bought these for a new TV, connected to my blu ray player and started to see random white spots flicker around my tv screen. Swapped these out for a certified HDMI and it resolved my issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Either works or doesn't.","reviewDescription":"After weeks of use. I kept getting stutters from cable. Kept reseting to 60hz from 120hz then I change HDMI outputs to make sure it wasn't cable but kept stuttering\/reseting itself is the best way I can describe it. But I guess HDMI cables either work or don't so this one might just be a defect. Also tried using stock hdmi cable and that work perfectly fine. Wish it could've worked.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Too wide to fit","reviewDescription":"The connectors are much wider than regular cables. Like they are heavy duty for other applications than tv or soundbar. So disappointing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Stopped working after less than 2 months.","reviewDescription":"It was a great cable. Worked for 7 weeks. Then it just stopped working. Used another hdmi and the devices that weren’t connecting worked again, so it’s definitely the cable. I’d like to return it, but the return time frame is passed, of course…. Wouldn’t recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Bought 2. 1 failed within a day","reviewDescription":"Didn't bend it or anything. Unraveled, plugged in. Within like 5 hours my screen begins to flicker and then I can't enable HDR and it says max hz is 60. Hook it up to my ps5 and essentially the same thing. 2nd cord I was experiencing intense screen flickering so I just returned them both. Fiber optic HDMI is what I ended up going with.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Exceptional Performance: Highwings 8K HDMI Cable Exceeds Expectations","reviewDescription":"I recently purchased the Highwings 8K 10K 4K HDMI Cable, and it has exceeded all my expectations in terms of performance and quality. This cable is a game-changer for anyone who demands top-notch video and audio quality from their home entertainment or professional setup.Unmatched Video and Audio QualityThe Highwings HDMI cable supports an impressive bandwidth of 48Gbps, ensuring that it handles 8K, 10K, and 4K resolutions effortlessly. Whether I'm streaming the latest blockbuster in stunning 8K or gaming in 4K at a high frame rate, the video quality is crisp, vibrant, and devoid of any lag or interference. The audio performance is equally impressive, delivering clear, immersive sound that enhances the overall viewing experience.Build and DesignThe build quality of this cable is outstanding. It feels robust and durable, with a solid construction that gives me confidence it will last for years. The connectors are gold-plated, ensuring a stable and secure connection every time. The 6.6FT\/2M length is perfect for most setups, providing ample reach without being cumbersome.Certified Ultra High SpeedBeing a certified Ultra High Speed HDMI® cable, it meets all the rigorous standards required to handle the most demanding applications. This certification is a testament to its reliability and performance, making it a trustworthy choice for high-end home theaters, gaming consoles, and professional AV equipment.Compatibility and Ease of UseI was pleased to find that this cable is highly compatible with a wide range of devices, from the latest 8K TVs to gaming consoles like the PS5 and Xbox Series X. The plug-and-play nature of the cable makes it incredibly user-friendly – simply plug it in, and it’s ready to go.Value for MoneyGiven its high performance and build quality, the Highwings HDMI cable offers excellent value for money. It is competitively priced, especially considering its advanced features and certification.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Seamless Gaming Experience Restored: Highwings HDMI Cable Solves PS5 Connection Woes!","reviewDescription":"I had been struggling with connection issues on my PlayStation 5 until I gave the Highwings HDMI Cable a shot, and boy, am I glad I did! This cable is a game-changer, quite literally, as it fixed all my connectivity problems with ease.The Highwings HDMI Cable is not your average cord - it's built to deliver exceptional performance. With compatibility across devices like Roku TV, HDTV, and Blu-ray players, this cable is a versatile addition to any entertainment setup. The 8K and 10K support, along with 48Gbps bandwidth, ensures crystal-clear visuals and smooth gameplay on my PS5 at 4K@120Hz and 8K@60Hz.I was blown away by the HDR 10, DTS:X, and HDCP 2.2 & 2.3 certifications, guaranteeing top-notch audio and video quality. The ultra-high-speed braided cord is not only durable but also adds a touch of style to my setup. At 6.6 feet long, it provides ample length for flexibility without compromising on quality.If you're looking to enhance your gaming and entertainment experience, the Highwings HDMI Cable is a must-have. Say goodbye to connection woes and hello to seamless gameplay and stunning visuals - you won't be disappointed!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Great cable for a great price!","reviewDescription":"Hi, put this cable from a firestick cube to my TV. It was very flexible with real nice plug in connectors and that made it easy to route where I needed it to go and the connectors made the connection feel very secure. Worked great, best picture I've ever had.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"High-Performance Connectivity with Highwings 8K 10K HDMI Cable","reviewDescription":"I recently upgraded my home entertainment setup with the Highwings 8K 10K HDMI Cable, and the results have been nothing short of impressive. This certified Ultra High Speed HDMI® cable delivers on its promise of high-performance connectivity.High Data Transfer Rate (5\/5):The standout feature of the Highwings HDMI cable is its incredible 48Gbps data transfer rate. This ensures seamless transmission of high-resolution content, making it ideal for 8K and 10K displays. The cable supports the latest HDMI specifications, providing a future-proof solution for evolving multimedia needs.8K and 10K Resolution (5\/5):Whether you're a cinephile, gamer, or content creator, the Highwings HDMI cable unlocks the full potential of your 8K and 10K devices. The cable's capability to transmit crystal-clear visuals and vibrant colors enhances the viewing and gaming experience, bringing content to life with stunning detail.Certified Ultra High Speed (5\/5):The certification as an Ultra High Speed HDMI® cable instills confidence in its performance and reliability. It meets the stringent standards set for high-speed data transmission, ensuring that it can handle the demands of the latest audio-visual technologies without compromise.Durable Braided Design (5\/5):The braided design of the cable not only adds a touch of elegance but also enhances durability. The braiding provides additional protection against wear, bending, and potential damage, making the Highwings HDMI cable a robust and long-lasting investment.Length and Flexibility (5\/5):The 6.6FT\/2M length strikes a perfect balance between flexibility and practicality. It provides ample reach for connecting devices while minimizing excess cable clutter. The flexibility of the cable makes it easy to route and manage behind entertainment centers or within wall-mounted setups.Wide Compatibility (5\/5):The Highwings HDMI cable is compatible with a wide range of devices, including 8K and 10K TVs, gaming consoles, Blu-ray players, and more. Its versatility ensures that it can seamlessly integrate into various home theater and gaming setups without compatibility concerns.Gold-Plated Connectors (4.5\/5):The gold-plated connectors contribute to stable signal transmission and resistance to corrosion. While gold-plating is a common and effective choice for connectors, additional reinforcement in critical areas could further enhance the cable's durability over time.Value for Money (5\/5):Considering the high data transfer rate, certification, durable design, and wide compatibility, the Highwings 8K 10K HDMI Cable offers excellent value for money. It's a worthy investment for anyone seeking top-tier performance in their multimedia setups.Conclusion:In conclusion, the Highwings 8K 10K HDMI Cable stands out as a reliable and high-performance solution for demanding audio-visual applications. Its data transfer capabilities, build quality, and compatibility make it a top choice for those who prioritize quality connectivity in their home entertainment systems.","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Quality product.","reviewDescription":"Worked great for my new television.  No signal loss.  Quality construction.  Great value for money compared to Best Buy cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Sanity saver","reviewDescription":"I recently ditched cable and went streaming with roku. Sadly my dvd player went nuts and kept turning itself on and off, it drove me (and many others in a internet search) until I replaced the cables front tv to these devices - all is well again in tv land. Thanks so much for tge quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Works great for my PS5","reviewDescription":"Bought this to use for a PS5 and I got this one to make sure I could play the system to its full potential. Cord and connections seem very sturdy and well made. Picture and sound on TV is great. No issues with any lag or quality. Would definitely recommend for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Fantastic product!","reviewDescription":"Back in the day, MONSTER CABLE used to be the greatest thing since sliced bread in terms of the HDMI quality and performance in the cable industry. Well friends, I’ll have you know that this Highwings HDMI cable performs just as well, if not better than MONSTER CABLE and at a fraction of the price.I bought this cable for a couple of factors; for one, it was half the price of another cable I saw at the store. But also, this cable was a little longer 10ft, as opposed to what most cables were cut to - 6ft. I’ve never heard of Highwings honestly, but there seemed to be a lot of positive reviews on Amazon, so here I am. And fear not for weary reviews ladies and gentlemen; this product is legit!Right out of the box, the packaging was nice. Nicely appearing in a  plastic sealed wrap. Upon opening, the product felt great. Strong, sturdy, durable; all around good quality craftsmanship. I excitedly and immediately connected it to my PS5 and TV. When plugging in, it felt solid. Nice connection. No wiggle room, no loosely fitting cables here. Same thing connecting to the PS5. Fired up my PS5 and was happy with my newly upgraded quality 4K video on screen.Haters and nay-sayers will say it’s just a cable; but it’s really not. It’s a durable and high quality product that produces fantastic quality video. Everything and then some of what I imagined I would get with this cable. I’m about to order a few more for all my devices that require HDMI cables.If you’re still reading this, STOP, and go buy yourself some of these cables!  You won’t be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"No complaints","reviewDescription":"Having tried this HDMI cable with a regular Blu-Ray player and then a 4K Blu-Ray player hooked up to an HD TV, picture and audio quality were great. Although I haven't tried it hooked up to a 4K TV, I see no reason why its performance wouldn't be equally acceptable, since the cable is designed for up to 8K performance. And the fact that this cable is more than six feet (two meters) long means it is great for connecting devices that cannot always be conveniently co-located.I have no complaints about this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Works as stated","reviewDescription":"I was experiencing intermittent video loss with my home theatre setup. After I verified my display settings I used this to connect my lg c4 to my denon x3800h and then to my xbox. It solved my issues. I'm running full 4k 120hz without an issue now.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Failed after a few months, cannot reach customer service","reviewDescription":"It was working fine for a few months, but then suddenly it started having flashing screen artifacts, or turning to black repeatedly, making it completely useless. Emailed the address found on the back of the box claiming a \"lifetime warranty\" several times, but never got any response. The warranty is completely useless, so only buy if you don't mind gambling on whether the cable you get will still work after a few months.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"DOES NOT SUPPORT LISTED REFRESH RATES","reviewDescription":"This cable lies about its tech specs. It only supports 60Hz at 2K. Using the cables that came with my graphics card, my monitor can do 120Hz. I bought this after that original HDMI cable was damaged, and this can only do 60Hz at 2K. Don't support this scam.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714262400000}
{"reviewTitle":"Stopped working next day","reviewDescription":"2nd day of having it stopped supporting 4k from my xbox to TV","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Worked well for a month, then junk. Best to avoid this and buy a better, albeit pricier cable.","reviewDescription":"I bought this to connect my pc to my 4k TV across the room and it worked great the first month or so. Running at full 120hz and 4k resolution - games were looking pretty and runnin smooth. I mounted the cable to baseboards around the room to keep it out of the way, so it wasn't being wiggled around or stepped on or anything. Once mounted it didn't move.Today it started dropping signal every 40-60 seconds for about 5-15 seconds, displaying a black screen. I checked my settings (which hadn't changed since setup), connection points at each in, drivers, etc... All were fine, no random changes I wasn't aware of. So, I swapped the cable out with another high speed HDMI cable and played with that for a few hours without a single issue. Sucks because my other cable is too short to tuck out of the way and I'm out of the refund window for this junk cable.Although, it is a really hefty braided cable, so maybe I can use it to secure loads in the bed of my truck. Or as an escape rope or somethingI regret not spending the extra 20-30 bucks to get a real brand","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"Zero * Caused crackling sound, made soundbar sound horrible","reviewDescription":"I actually think this cable almost broke my Q990C soundbar!! When connected it would crackle and pop! Even after I switched backed to the factory hdmi cable, crackle kept happening but eventually went away.Extremely disappointed in this cable. Everything I read said it was good, it is not!! Someone else actually tested the speed and it’s not a 2.1. Wish I could return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"If it works like website","reviewDescription":"Was wrong size plus wouldn’t fit","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Quit working after 4 months.","reviewDescription":"It stopped working after 4 months","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Cable not a 4K.","reviewDescription":"My Roku keeps telling me to check connection come to find out that these 8K cables aren't even 4K.  Swapped out with a $200 Kimber Kable HDMI and problem went away.  These cables and other cheap cables on Amazon are just cheap Chinese garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"Not HDMI 2.1 certified","reviewDescription":"I ordered a 15ft long cable, tried to use on my PC to run games at 120hz at 4K, when trying to enable it shut off my pc. After doing trouble shooting and using another, shorter, cable I deducted that it was the cable at fault. Seeing the listing closer, I made the mistake on not purchasing it from a certified manufacturer.Stay away if you plan to get the full use of your HDMI cable, this isn't quality at all.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"HDMI Connector Broke Off","reviewDescription":"One end came apart and the wire is very stiff.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Rigid HDMI","reviewDescription":"HDMI cable does what is should.  However, the metal shielding makes this thing a nightmare to work with.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"Doesn’t get 4k\/120 with full RGB like my other cables.","reviewDescription":"It looks nice and rugged but it won’t pass 4k\/120Hz full RGB like my other 8k cables.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Stopped working after about a month of use.","reviewDescription":"The cable was great until it stopped working. I'm using it on a PS5 connected to a 4K TV, and about 5 to 10 minutes in to a game or streaming a movie, it will just disconnect. I have to move the connector around until it picks back up. Worked great for about a month. The cable itself seems to be made of high quality and durable materials. It's possible that I just happened to get the 1 bad cable that quality control didn't catch, but I don't think I'm going to chance it by ordering another one. I'll be trying a different brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632009600000}
{"reviewTitle":"wouldnt work with eArc 2.1 surround sound","reviewDescription":"Connected cable from sound bar to tv. sound bar didn't get a signal from the tv, then i switched the cable direction and it would turn the sound bar volume up and down but cant turn the sound bar back on after turning it off through eArc. the oringal cable that came with my device didnt have any problems, it was just too short","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656374400000}
{"reviewTitle":"Cheap built, not 4k @ 120hz","reviewDescription":"I bought a 6.6tf (fat and heavy) and a 10ft (super fat and super heavy) cable to connect a ps5 and computer to a LG C1 and a dell monitor. It supported 4k resolution but never allowed 120hz in either device and had screen tearing dince it didnt allow gsync or freesync either. The cables are fat, heavy and lack flexibility. It felt like it would rip the hdmi port off the tv just due to the weight. I bought another set of cables and I was able to set things without issues","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637539200000}
{"reviewTitle":"Unstable 4K@120Hz, buyer beware.","reviewDescription":"It’s a nice looking cable, feels solid, nice braid.Sadly, like so many other uncertified cables over 15’, it does not perform as advertised.Random black screens and flickering inundate the entire screen with irritating and unusable frequency.Had to return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681776000000}
{"reviewTitle":"Stuttering and loss of HDR","reviewDescription":"I replaced this cable with a certified and tested one recommended by HDTV calibrator and suddenly all my problems went away. It cost 3x this one but was worth it. With this cable I would lose HDR often and rarely it would just go blank. I would have to turn everything off and on again to get it back. New cable proves it was this cable that was the issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650672000000}
{"reviewTitle":"Poor video and audio","reviewDescription":"Tried to connect my Marantz receiver to Samsung TV with this cable and it did not perform as needed. When switching from one input to another on receiver , it caused a constant dance of trying to sync with TV. Turning things on and off would mostly solved it so all devices stayed on 4K but then audio would cut out every few seconds.I tried a different 30 ft cable and all works now. This one is going back.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1644192000000}
{"reviewTitle":"Not a Great Upgrade for Hi-Def TV Monitors","reviewDescription":"Update on this item.  After a mere week, our TV resorted back to its prior performance.  Apparently, something in this cable failed and is not transferring the signals in Hi-def quality  I'm changing my rating and wouldn't recommend this cable.  Prior feedback...(This HDMI cable really improved the clarity when watching 4k movies.  It also made the colors much more vivid & made the screen really \"pop\".  It's a great hi-value upgrade for Hi-Def TV.  I'll be buying more for the other TV's in the house!  2-thumbs up!)","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1615075200000}
{"reviewTitle":"Can't handle 4k 120hz","reviewDescription":"Using a 3080ti connected to a LG C2 OLED.  Experienced screen flickering and signal drops with 2 separate  cables.  Switched to a Zeskit Maya HDMI cable and it works flawlessly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Works well","reviewDescription":"Works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"8k hdmi cable","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Solid Product","reviewDescription":"Solid Product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"As described","reviewDescription":"Worked great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Acer computer & monitor","reviewDescription":"Good easy setup and update very fast and quiet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Does it’s job","reviewDescription":"Works like it should.  Not much more to say.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Nice and long","reviewDescription":"It works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Muy bueno","reviewDescription":"Excelente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great Cable","reviewDescription":"Cable is well constructed and works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Everything works again!","reviewDescription":"We got a new TV recently, a lower end 43 inch Samsung 4k with hdcp 2.2 compatibility on all ports.  All ports are hdmi 2.0. We have several other 4k TVs which we had noticed were performing worse over the last months--lots of buffering, etc, and sometimes not even being able to connect at all to 4k content.  With this new TV, we immediately started getting hdcp errors using the same 4k hdmi cables we were using with the other TVs.  These errors were the clue that caused us to reassess the cables for all the TVs. I ordered 2 of these and installed one on the new TV and one on an older 4K TV (also hdcp 2.2 compatibility and hdmi 2.0 on all hdmi ports) that had been slowing down and reducing 4k content to 1080p content for months. I had always heard that the 4k@60 cables would do the job, and they did for years, but things change.  These new 8k cables fixed the hdcp problems we were having, and both TVs are streaming 4k smoothly with no problem now on Prime Video, Netflix, Paramount Plus, etc.  I'm ordering more!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Felt quality like but not the output.","reviewDescription":"Worked for two months and started to turn green on me. Cant return, ended buying Amazon Basic HDMI, so far so good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671580800000}
{"reviewTitle":"Meh","reviewDescription":"I notice 0 difference with this one from the amazing branded one at a fraction of the cost. Not thrilled.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Don't purchase if you need to hook up external (USB) keyboard","reviewDescription":"I purchased this to extend connection to my hub to connect to my MacBook Pro.  The cable worked great for video signal.  However, it would not work with my external USB keyboard -- it does not pass the keyboard input to the laptop.Pros: good quality, excellent video passthroughCons: does not pass external USB keyboard signal through to computer","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1624147200000}
{"reviewTitle":"Does not live up to the specifications","reviewDescription":"on paper this should be a fantastic cable. Very noticeable noise in the picture quality. Distortion in some of the color and picture reproduction. Switched back to my hdmi 1.8 or 2.0 cables brought everything back to normal","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"Good Picture quality.  Not able to get Dolby Atmos to work","reviewDescription":"I have a new TV and soundbar that support Dolby Atmos. I tried this cable. Picture was good but was not able to get Dolby Atmos to work. I returned the cable.I have Zeskit Maya 8K 48Gbps Certified Ultra High Speed HDMI Cable (https:\/\/www.amazon.com\/gp\/product\/B07S1CGQ9Z\/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1). This cable did the trick. Good picture quality, good sound and Dolby Atmos works well.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1623715200000}
{"reviewTitle":"Sometimes screen turns on to black","reviewDescription":"Used with my MSI GS66 2020 laptop and a Samsung 65\" QN90A. Sometimes when turning the TV on the screen would be black but I'd hear sounds from the laptop. Switched to another HDMI cable I had and that problem hasn't happened since.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638403200000}
{"reviewTitle":"Wont stay connected to HDMI port","reviewDescription":"The cable falls out barely any force applied. I would not buy this cable. It seems they didn't make this correctly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668643200000}
{"reviewTitle":"Sound cuts out on soundbar","reviewDescription":"Sound cuts out often when set up through arc.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677715200000}
{"reviewTitle":"Disappointed","reviewDescription":"Was not 8k even 4K material. My xfinity cable hdmi cable had a better picture then these. Highly disappointed. I guess you get what you pay for. Went to target and got 4K Phillips ultra HD cables for $14 more a cable and it looks amazing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625184000000}
{"reviewTitle":"Doesnt do what I need it to","reviewDescription":"I mean it works. But I get a delay of audio during any video playback from PC. Not only that the digital lag I get is staggering. Not sure why when mouse movement is about a half second off. Virtually unuseable for me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627344000000}
{"reviewTitle":"Well at least it's pretty","reviewDescription":"Bought this for my computer took it out of the box, plugged it into my 4k HDR 120hz 75inch Sony x95j with VRR\/G-Sync. Video cuts in and out randomly when I hook it up to my computers video card (Nvidia 3060ti) I have another 4k 120 hz 2.1 HDMI cable which runs perfectly. Idk if this HDMI cable can't handle 4k 120hz HDR with G-Sync or what's going on but it should work fine but it works like crap, I would not recommend this HDMI cable.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Junks","reviewDescription":"In 2 months i started having issues 5 months later they just junk","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"You get what you pay for…","reviewDescription":"Bought a pair of these for PS5 and Xbox SeriesX for the capability to transmit 4k@60\/120fps but after 2 months both capable are failing badly…. Random shutting off issues which is an annoyance. Save you money and just buy real deal cables from a well known company. Now I have to buy new cables, remove my 85” off the wall and run new cable through drywall.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Has an electrical short. LOW QUALITY","reviewDescription":"Has an electrical short. LOW QUALITY","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Does Not Support Dolby Vision on Apple 4K TV","reviewDescription":"I purchased this longer cable due to the high number of favorable reviews and claims of support of eARC and compatibility with 8K@60HZ.  Does not support the highest resolution Dolby Vision 4K 60 Hz on the latest Apple TV. Returning it and purchasing an Ubluker HDMI cable which is less expensive and explicitly calls out the support of Dolby Vision in its product description.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Drops the signal for a few seconds every few minutes on the 30ft cable.","reviewDescription":"Garbage cable, spend the extra money and get what you pay for.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"False Headline","reviewDescription":"This is NOT HDMI 2.1! You will not achieve 4k at 120Hz. It locks out at 60Hz. I feel sorry for anyone who purchased this and don't realize they were scammed. This is a 2.0 cable that cannot go any higher than 60Hz 4k.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Malfunction","reviewDescription":"Only lasted a few months then my screen started constantly losing connection. It kept going black and back to the picture every other minute. I made sure the connection was solid, but it kept doing it for days. I finally switched hdmi cords and it stopped. So I don't know what happened with this cord, but it stopped working for some reason.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Not as advertised...","reviewDescription":"Absolutely NOT high-speed cables. When connected to my Xbox One Series X, I could only get 4k\/60hz and hdr10. NO hdr 10+, Dolby Vision, OR 4k\/120 hz. A complete waste of money and another Amazon scam. Avoid if you really want high-speed cables.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"These clearly aren't the rating they claim to be.","reviewDescription":"Bought 3 of them to hook up a PC and PS5 at 4k\/120 HDR and VRR. Signal kept cutting in and out (even trying to use 4:2:2 much less than full 48GBS bandwidth). Had to replace all 3 with another brand with the same ratings (but that are certified) and those cables solved the problem even at higher bandwidth settings.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Disappointed","reviewDescription":"Fast shipping. Hooked it up to new sound bar and worked great for 3 days, then it wouldn't work at all. Hooked up another HDMI cable to sound bar and the sound bar worked great. Hooked this HDMI cable up to DVD player and it wouldn't work. Tried to return but I had thrown away the packaging. SAD","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working after a few times.  Very disappointing because we had already ran it up through the wall. Don't waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working after 6 months. Must be poor quality","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"its a cable","reviewDescription":"this cable does not support the frequencies advertised. wont push over 60hz. it also caused discoloration and flickering. when using for a pc monitor the signal doesn't always display and the cable needs to be reseated multiple times to work. confirmed after troubleshooting that using the same devices with other cables were not having these issues.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Not good for OLED and gaming consoles.","reviewDescription":"Took me awhile to troubleshoot but the cable’s sheathing is picking up static electricity and would cause my LG C3 to drop picture using my PS5 for about 1-3 seconds every time we touched the television or caused any static charge near the cable. This problem is rectified using the stock PS5 cable or any better quality cable that has proper insulation. Just a heads up if you’re having issues like I was.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Screwed my TV up","reviewDescription":"I bought this cable thinking it would be better for my TLC Q7 4k tv I recently purchased! I hooked it up and noticed a green line across my TV which I never seen when I had my old hdmi cable connected. Then reconnected my other HDMI cable and the line was still on the tv. So I believe this cable messed up my tv. Reset my tv and even unplugged hdmi cable and the line was still on there. Never will purchase a cable from Amazon again. Better off getting a good one from Best Buy.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"Defective","reviewDescription":"Piece was defective.....it does not worked...thats why returned...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Died after 3 months, unresponsive customer support","reviewDescription":"Just stopped working after 3 months. We didn’t bend it or damage it in any way. It had started heating up fairly early on though so it’s probably incredibly cheaply made. I contacted the seller for a refund and they never responded, but they did give me a refund so there's that at least.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Why was this product offered…","reviewDescription":"I bought a code reader and in the process of ordering Amazon suggested I buy this and a pack of lithium batteries like if these two suggested items are needed !The Code Reader doesn’t Take batteries and the only cable that can be plugged into this unit is a C","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Doesn't Do What it Says it Does.","reviewDescription":"The simple fact of the matter is if you want 4k at 60 Hz, these cables are great at that. I can't say if they do 8k, but honestly, 8k is a waste of money because you would need to be inches away from the TV to see the difference, but I digress. As others have said, you may get lucky, and the cables you get can do 4k at 120 Hz, but I and others have not been so lucky. I knew better too, but I was in a hurry and didn't want to go to my local Best Buy, and well now I own another HDMI cable that works but doesn't do what I need. So buyer, beware, these aren't certified HDMI 2.1 cables, or at least the ones I received weren't.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Way too stiff to be usable for anything but a straight line","reviewDescription":"This cable is so stiff it needs to hang about 3\" off the wall to make a 90 degree turn - making it impossible to run around corners inside cord hiders. Literally just twisting it to make the plug sit the right direction is nearly impossible. I can't imagine an install that needs a 30' cable that's okay with such huge turn radii or 180 degree twist limitations.On the plus side, it does do 4k HDR as claimed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640044800000}
{"reviewTitle":"Broke after a couple weeks","reviewDescription":"Worked great initially, had me thinking my graphics card crapped out, but tried multiple displays and cables, only thing that seems to be the issue is the cable unfortunately. Worked for 4k, 120hz, hdr with 12 bit color, but suddenly just stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Not quite reliable at 8k60","reviewDescription":"15ft variant, connecting an nVidia 3060 Ti to an 8k60 TV. It connects and mostly works, but once every few minutes a frame will come out corrupted (the whole screen flashes to colorful static and back). as if by a bit-flip or something. So, looks like the shielding is not quite good enough for 48Gbps, or something.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662163200000}
{"reviewTitle":"Beware on connection","reviewDescription":"Product is as advertised. If it worked it would have been a perfect fit.... Sadly it constantly drops signal with any device that I have connected to it and requires constant fiddeling to have anything displayed. Will be returning ASAP.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"Received it fast","reviewDescription":"It's ok but I keep getting  dark pictures  I try it on my ps5 don't wk well ill keep it but I have to used my ps5 hdmi  I thought this one would be better  but nahh","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"Flicker","reviewDescription":"Sadly, the cord did not work for me.  I immediately got the dreaded flicker and screen cutting in and out. I ran it from a PC with an Nvidia 4080 GPU to an LG C2.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1680307200000}
{"reviewTitle":"Was not as good as advertised.  Reconnected existing cable which was a better quality","reviewDescription":"I would not purchase this brand of cable again.  Sale are deceptive at times....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"getting that splitter to work.","reviewDescription":"Thought I ordered the 2 pack but I only recieved one.I needed two a little dissapointed.not able to get that HDMI splitter I ordered also working either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Does *NOT* Support HDCP 2.3","reviewDescription":"Tried to play Disney Plus (through an AVR) and got an HDCP error in the app. Sure enough switched the cable and it went away instantly.While it does support 8K, I’d be concerned about the claimed quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Somehow stopped working after 2 months","reviewDescription":"Somehow stopped working after 2 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"Failed in PS5 after 20m.","reviewDescription":"I checked the cable in a WII U and Blu-ray after it failed to be sure the PS5 cutting out was a cable issue and it was. None of the other devices were found as an input to the TV. Amazon Basics cable I had lying around worked. Bought a Monster HDMI cable instead.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Cable did not work.","reviewDescription":"Box that cable arrived in was destroyed.  Connected hdme cable to laptop and 75\" tv for meeting presentation, cable did not work.  I used an existing 24\" hdmi cable and it worked fine.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"sorry","reviewDescription":"It's too short for my soundbar to dvd player","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Cable dead after 2 months","reviewDescription":"The cable seems to be well constructed but has died on me 2 months after purchasing. I can’t return to Amazon and warranty info is not available. I wouldn’t recommend people buy this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Not worth the Money.....I've had it since July 2021.","reviewDescription":"I have two monitors, and bought this HDMI Highwings 10FT cable and another HDMI 10FT cable(a different brand, Zeskit)  in July. I noticed as soon as I plugged the Highwings cable to the monitor, that the fit wasn't tight\/snug enough. I figured, I could just  deal with it, since it seemed to stay plugged in. The following month I attached my monitors to a desktop mount, so they could move in different directions. The Highwings brand cable just won't stay plugged in. As soon as I reposition the monitor, the cable falls out. I've tried to move the monitor as little as possible, but it still falls out. Maybe it just happens to be this particular cable I received, but I have finally given up. The second cable I purchased for the 2nd monitor hasn't had any problems. So I will be buying another Zeskit cable, since I've had zero problems with it. Sorry I cannot recommend buying a Highwings cable.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1632528000000}
{"reviewTitle":"Works for a couple months, then breaks","reviewDescription":"honestly it works VERY well AT FIRST. good picture display and everything but after about 3 months i’d say? GARBAGE. stops working entirely. doesn’t display picture unless it’s being held at a very certain angle and if it moves one centimeter, it’s over. it’s terrible. 10\/10 don’t buy it. seriously. it’s a waste.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"this is not an HDMI 2.1","reviewDescription":"I only get 640x480 on every port of my TV, but I get my usual 4K 120Hz with my short cable. Weird maybe something wrong with my cable. Also, there is no sound!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Stopped working","reviewDescription":"Started out fine. Then just stopped working.  Had to get a different brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Not4k HDR Quality","reviewDescription":"Idk about the others but one of the two cables that i got didn’t fit snug like all my other HDMI cables, and I hooked up to my PS5 and HDR tv and would not show in 4k HDR, i went back to an older cable. Returned both will find another.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Short in the plug","reviewDescription":"Very disappointing there would be a short on a cable that costs this much. I will be returning it asap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Faulty","reviewDescription":"I purchased this for our XBox Series X.  It worked fine for a few days them we started to get these digital lines across the screen.  It now displays what looks like 780p when we turn the XBox back on.  I swapped HDMI cables to a shorter Monster cable and that works flawlessly.  I guess I'll spend the extra money for something that works.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Return","reviewDescription":"Returned this one because it’s not compatible to our television. The description says it will be compatible but it’s not.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Don't work","reviewDescription":"Out of the box it didn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Failed before 2 months of use","reviewDescription":"I purchased two of this length of cable. One has already failed before two months of use. It will only display the lowest of resolutions. I have ensured a solid connection, and yet the problem persists. I switched it out for an old cable, the kind you get for free with HDMI devices, and no issues displaying higher resolutions at all, even though that cable is probably years old. I should have known I would have these failures when another cable I purchased (shorter length) failed after one month. Not impressed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Not great with the PS5","reviewDescription":"I purchased this because of the reviews. But every time I switch from my TV to the PS5 I get errors stating to change my HDMI to. Better quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Didn’t work with eARC","reviewDescription":"Bought 4 of these cables, none of which worked for ARC to the amp. Sound drops off randomly . After much trouble shooting, determined it was the cables. Bought a different kind, at a higher price, but a certified 2.1 HDMI and problem went away.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Red flash","reviewDescription":"I get occasionally red flashes after using this cable to replace another one.  Prior cable worked fine. I was just reconfiguring and now this cable runs straight from Appletv to tv.  I have reinserted both ends.  Still get occasional red flash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Defective out of the box","reviewDescription":"The hdmi cable was defective upon delivery. No signal from source to TV. Plugged in other working hdmi cables and confirmed this one is non functional.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"This HDMI cable quit working after only three and a half months of using it… 😔😠","reviewDescription":"I thought when this cord arrived it would be perfect and looked of high quality and reviews seemed good to me as well. So my expectations were high.  Received it in June. It’s now only September and my tv started acting weird. This cord connected the tv to the stereo receiver. After trouble shooting all our problems with it not showing picture on tv screen but yet working through stereo , etc… we found that the HDMI cord was malfunctioning. I am very disappointed that I spent that money on something I am now having to trash. So sad. Not sure I can return it now that it’s been so long but I will not be buying another HDMI cord through Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Trash","reviewDescription":"We got a dud. I’ve got wires 10 years older that work better. I just want them to replace it. Complete and utter trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Product does not work as advertised.","reviewDescription":"Theses Highwings HDMI cable don't live up to the reviews. I only used for a few days and could immediately tell and see the difference from the picture. I got them to replace two Zeskit HDMI cables that did'nt last a year for me. The Zeskit HDMI cables started  saying weak or no signal...please check your connection. I thought it was Xfinity but after I replaced with original high speed HDMI cable from my Polk Sound Bar and Subwoofer System it stopped. So, I purchased two Highwings only to be disappointed again...the connection  of HDMI from sound bar to Earc on SmartTV was not secure or solid. I returned for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"Broke after about 6 weeks","reviewDescription":"I loved the length and the fact that it was braided, however, after 6 weeks it stopped charging my iPad and my iPhone.  I cannot recommend this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Not getting 120Hz as advertised.","reviewDescription":"So I have a 2021 Lenovo Legion 5, and a 34\" LG Ultrawide monitor. It claims that it could get 4K @120HZ, but I'm only getting about 50Hz. Believe it or not, it's not horrible, but I think the experience could be significantly better if it worked as advertised. For both gaming and normal PC usage. I'm rather disappointed in it. I may be looking for an alternative elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Good price, but the video is extremly touchy","reviewDescription":"I got a few of these based on reviews, and its a bit disappointing that if you even touch the cable, the picture will cut out. They work, but I wouldnt recommend putting these on anything that might move.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"8k works 30f but not 50f","reviewDescription":"I have an 8k tv so I wanted to try it out with my RTX 4090. That being said my computer was in the next room. I ordered 30 feet version of this product however 30 feet was to short to hide it behind things. However, I wanted to test it and see if I can in fact get 8k from the 30 feet cable and it worked. So I returned it to buy the longer 50 feet cable. However, when the cable came it was much thinner than the first cable. It still stated it was 8k. So I tried it out and the most I could get was 4K is would not do 8k...... So I returned it.. kinda disappointed....","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1680134400000}
{"reviewTitle":"Won't do 4k60, blinks out, HDR is unusable.","reviewDescription":"Initially connects at full resolution, then drops in and out as HDR or 60fps+ content is displayed. Sometimes it's good for 20 minutes, others its just blank.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"15ft is not a certified HDMI 2.1 cable","reviewDescription":"The Ultra High Speed HDMI Certification Program is a mandatory certification program for all Ultra High Speed HDMI Cables. The 15ft cable does not carry this certification.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"HDMI","reviewDescription":"Cable works for picture, but no audio. Unplugged it plugged another HDMI and worked perfectly fine without plug that one back in no audio.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Doesn’t truly support HDMI 2.1","reviewDescription":"This cable can handle basic 4k tasks just fine, but had consistent dropouts with dolby vision on our apple tv with frame rate matching enabled aka a much higher speed task. We bought an Anker cable instead and have had zero issues since.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"15 ft version did not support 4K @ 120hz","reviewDescription":"Unfortunately this cable does not support the advertised bandwidth. Max I've been able to use is 4K @ 60hz. Anything higher and the display blacks out. Got a different cable and it's confirmed working, so the issue was Highwings.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Stopped working after 3 months","reviewDescription":"Used it to connect PS5 to a Samsung OLED TV. Games look great, but it stopped working after 3 months. At first, the TV could not detect signal from the cable after every other gaming session. I had to disconnect and reconnect the cable and jiggle it until it there's finally a solid signal. Then, the screen would randomly go black. Now, it just stopped working entirely. I bought two cables. The other one is working fine so far without issues. To be fair, I've never owned an HDMI cable that lasted more than a few months. Disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"SOLID QUALITY","reviewDescription":"SOLID QUALITY","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Weird artifacting \/ interference issues with LG C2 and multiple inputs","reviewDescription":"I bought 3 of these and they all experience the same weird issue so buyer beware if your situation is similar:I have an LG C2 oled TV which is usually connected to both my PC and a macbook. When I started using these cables my pc output would start flickering colors and artifacts and I thought my gpu was dying. I discovered the issue was that whenever I had multiple inputs connected with these cables I'd get the same result. It seems okay if I use this cable from the macbook (pushing 4k 60hz) and an older hdmi 2.1 cable coming from my pc (4k 120hz) but if I used this cable from my PC to the c2 and even had another input simply touching the metal shroud of a different hdmi port it would immediately begin flickering and artifacting. No clue what the technical issue is here but it was super annoying. The issue probably isn't with the TV, because like I said, a different brand hdmi cable pushes the pixels out fine regardless of what else is connected.Figured this review might help if someone comes here trying to diagnose a specific technical issue. These might just not be up to pushing 4k \/ 120hz reliably.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"I gave a three as the HDMI Cable is a five.  However, the adapter is a one.","reviewDescription":"The HDMI cable connect a DVD player to my TV.  Just what I needed, works fine.  The adapter does not work at all.  I am trying to get an old CD burner to work with a new IMac.  This connects everything, but nothing works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Surprisingly stiff","reviewDescription":"On the positive side, this cable appears to do what is claimed. I can't confirm that it supports an 8K signal, but it does support an HDR 4K signal at 120fps, connecting an Apple TV 4K (2021 version) to an LG C1 OLED TV. It also appears to be eARC properly.So why do I only give it three stars?There are two nasty flaws.First is that it has a built-in velcro thingie that I expect someone thought was a great idea for helping you wind up the cable. Maybe so, but my experience was that this damn velcro kept catching on table cloths, curtains, and anything else near to the cable as I was trying to arrange it.Second is the cable is surprisingly stiff. I expected something like an HDMI 1.2 cable, or ethernet; very flexible  and easy to bend. Instead this is more like coax, with a very wide bending radius. Enough of a problem that where I'd previously used a 3' cable as the perfect length, doing the job and easy to hide, I now had to get a 6' cable and try to wrap the excess around the back of the TV while never bending it too much. Maybe the specs demand that all 8K HDMI cables have to be this stiff, so it's not this manufacturer's fault, I don't know. All I can say is be prepared for something a lot stiffer than you expected, both in terms of requiring something longer than you expected, and in terms of having to find a way to hide the excess cable that's bulges out at turns and bends.","isVerified":true,"ratingScore":3,"reviewReaction":"78 people found this helpful","country":"United States","date":1622678400000}
{"reviewTitle":"Compatibility","reviewDescription":"Had problems connecting my equipments.  Soundbar wouldn't connect via ARC","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Works","reviewDescription":"Great picture and speed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Doesn't work for 15ft 4K 120hz runs","reviewDescription":"Doesnt work at lengths of 15ft or more. Haven't tested this specific cable at lessser lengths. Signal integrity issues. Get a better Active fiber HDMI 2.1 cable for lengths 15ft or more for 4k 120hz.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Good Quality but needs improvements","reviewDescription":"I wanted to like these and they appear to be made from high-quality materials, however, These are not certified, which might have been my error ordering these but I did a search on Amazon for 8K .5M Certified 2.1 64G HDMI and these were listed with others. What I did not like was the name label is an applied stick on label, I purchased 4 of these and they all fit loose (almost too small) in HDMI sockets of 3 different devices, although they did work OK, I believe the stickon label will eventually fall off, No instructions and no direction to and from source to device. Fix these and it would be a BEST BUY for the money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"20ft cable does not support full 4k 120hz","reviewDescription":"I have a 15ft version and a 20ft version. The 15ft version can run 4k 120hz fine but the 20ft version falls short. I guess this is not really the fault of the manufacturer because it's common recommendation to use fiber optic cables above 15ft, but it's still a bit frustrating since the 20ft version is advertised to be 4k 120hz while it probably cannot do that most of the times.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"As expected","reviewDescription":"It's only been a few days, but it performs as you would expect an HDMI cable to perform","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Does NOT work with Dolby Atmos","reviewDescription":"It took a while to work but very disappointed that it does not work with Dolby Atmos which is the sound bar that I have.  One would think all 8K HDMI cables would be compatible but this one is not.  There is another similar review which indicates this lack of compatibility with Dolby Atmos as well.  I am going to order the cable mentioned in the other review with fingers crossed that it will work for my sound bar.  I will not throw away the packaging BEFORE making sure it works next time around!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1637452800000}
{"reviewTitle":"Overall meh cable","reviewDescription":"Video can be choppy at times. Overall decent but not what I would expect for an 8k cable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"HDMI device doesn’t support 1440p","reviewDescription":"Bought this for the ps5 but looks like it doesn’t support 1440p","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"It’s ok","reviewDescription":"It’s good product. I cannot tell a noticeable difference between this and a regular HDMI chord.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"It's OK for the price","reviewDescription":"Can't tell from a 4k cable","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"It works","reviewDescription":"I have this on my ps5 and it nit as good and the cable that comes with the ps5 it's just longer that's it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670544000000}
{"reviewTitle":"Didn’t function as needed to connect my sound bar to my TV","reviewDescription":"Looks like a good cord but I had inconsistent sound from the sound bar and at some point had to completely disconnect the cord to raise and lower sound. I could have the wrong cord or it could be the TV or sound bar where the problem lies. Ultimate I was unable to get the results I was looking for. Both TV and Sound bar were purchased in 2021.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634256000000}
{"reviewTitle":"Standard working cable with one caveat","reviewDescription":"This cable is not capable of full sRGB on my LG C1 tv to desktop. No matter what resolution and\/or refresh rate I set my display as, it still comes out as low in sRGB coverage. Basically I can only obtain 4:2:2 chroma subsampling.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644969600000}
{"reviewTitle":"Not the quality I was expecting","reviewDescription":"Was hoping the cable would be an improvement from HDMI cables I was using, but there was no change in picture quality and my new Neo LED TV even put an error code on the screen stating I needed to replace HDMI cable for better quality picture. I have to wonder if the quality described is produced.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634515200000}
{"reviewTitle":"Review was wrong","reviewDescription":"I have invidia hooked to my Lg 45inch TV. I can not use the invidia because I get a hdcp error. A review on here stated that this cord would clear up my hdcp error but it did not","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Very disappointed!","reviewDescription":"....It was short lived.  Didn't last long at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723593600000}
{"reviewTitle":"GARBAGE SCAL ITEM!!! DO NOT BUY","reviewDescription":"This product is garbage. Doesn not work whatsoever. STAY AWAY","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Poor Quality, sus behavior","reviewDescription":"Keeps losing connection to my monitor. Since using this cable, my monitor will randomly go black as if not plugged in. I have to stop what I am doing and unplug\/replug the cable to get my monitor back on. I swapped it with my tvs hdmi and there is no issue, so its not the hdmi port.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Wouldn't provide signal.","reviewDescription":"Ordered a 50ft 8k 60hz HDMI with intention to run it from my office PC to my master so I could game in the master at night instead of being cooped up in the other room away from my lady.Working in the telecommunications industry for nearly 20 years, I decided to test the cable before climbing into the hell that is my attic.Running straight from my PC to the 4k 120hz display in the master, I was greeted with no signal. The monitor displayed that it detected something on the line and showed the input as active, but showed no signal.Thinking maybe I was given the incorrect cable, I lowered my resolution to 1440p at 120hz. Nothing.Pretty disappointing considering I went with the more expensive cable in hopes of receiving quality.Won't bother wasting my time with a return.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1682553600000}
{"reviewTitle":"Didn't work","reviewDescription":"It didn't work but for a week then died","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Sound cuts out","reviewDescription":"I have this connected yo my Xbox Series X and the sound randomly cuts out. Tried two different ones of the same cable with no change. Cables from other manufacturers do not present this issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Do not buy for high bandwidth!","reviewDescription":"I bought this cable (3.3’ - claiming to support 4k @ 120hz) to replace a failing zeskit 3’ HDMI for use with 4k 120hz. The zeskit began to cause my screen to flicker and blackout (it was happening about once every 10-15m). This was worse, the flickering was more frequent every 30s. To make sure it was a problem with the cable, I tried my 6’ zeskit cable and haven’t had a flicker\/blackout since. I’m not saying zeskit is the ideal cable, but higher quality cables are probably important for high bandwidth situations. Time to try Fusion or Monster.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Packaging was destroyed upon arrival","reviewDescription":"Great product, second I have purchased. This time the packaging that it was in was ripped apart. Someone tried to tape it back together. I was worried product was damaged it was so bad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Will NOT Support 4K Sound Amplifier to 80\" Sony Bravia as a main","reviewDescription":"I was in the middle of upgrading my speakers and thought I would go with a better 8K HDMI to feed from the TV to my new Denon Amp. Had everything turned off while setting the new speaker to amp connections, tv to amp HDMI cable and stuff up. OK everything is now plugged in and ready to go. So I thought.... I could not get the Denon to play TV sound. at this point I wasn't sure if the wiring changes for the speakers was screwed up or the amp. or the new Klipsch Sub-Base I was adding. The Denon amp app said it was seeing  this new 8K HDMI cable as a digital source and not the usual HDMI\/ARC. Long story short, this 8K HDMI cable was not providing the correct signal for any sound. Save your time and money, STAY AWAY from this cable.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Computers not so confusing","reviewDescription":"Always had my son to set up my computer but I decided to do it myself this time.  After some looking I found there is a wire to connect everything and you can find it as long as you need it. With some wires I bought I successfully connected 2 computers to 1 monitor and 2 computers to 1 printer not to bad for someone who knows nothing about computers.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Exactly what I needed","reviewDescription":"HDR was continually appearing on the TV screen and each time it briefly interrupted the picture.  Also, when watching Prime the screen would reflect a message that said the connection was bad and I could not return to the show.  Once I installed this cable both problems went away.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"A much needed upgrade!","reviewDescription":"Recently changed from Dish Network, back to DirectTV.  Decided to upgrade ALL cables as well.  This cable is a major upgrade from the economy cables we were using as there is a noticeable improvement in picture quality.  Well pleased !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"This worth the money! Going from to 4k!","reviewDescription":"So, I had HDMI Cables in the wall behind my HD TV!  Got 4K Movie! Then  A 4K BLu-Ray player! These are HDMI 8K no problem with 4Kvideo! I see know down side to these 8K HDMI Cables! I a 4K tv  they work great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Buena calidad","reviewDescription":"El cable tiene una muy buena forma sólida y material excelente! lo he probado con mi monitor marca SCEPTRE y LAPTOP ASUS TUF GAMING sin problemas. He movido el cable constantemente para ver si se pierde la imagen y todo estaba bien sin pestañar la pantalla. Asimismo lo he probado en la oficina con otras pantallas y no tengo problema alguno. Totalmente recomendado.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Heavy duty, versatile HDMI cable","reviewDescription":"This cable is exactly what I was looking for to support a home project.  I wanted to run a long HDMI cable from my computer to my TV (through the wall), and this cable was an excellent price for the great performance.  The 30ft give it plenty of flexibility, and the cable size is thick enough that I’m not worried about diminished performance if I accidentally pinch it or drop something on it.  The sleek, gray design helps it blend into the background behind my appliances, which is a nice touch.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Works better than expected","reviewDescription":"I got the 15FT cable to connect my computer to a projector, expecting it to have some issues because of its length. Despite that, I have not encountered any problems with this cable. It is fast, durable, and most importantly, it just works. Couldn't ask for more out of a cable. We'll see how it holds up, but for now, it Is a 5\/5 from me.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Excellent cord that can be straightened right out of the box","reviewDescription":"What I really liked was that the cord came in a box.  That might seem trivial, but this helped set the tone for the quality I felt I had purchased.  When I took off the ties, it held its shape so I was concerned, but immediately noticed once I stated to uncoil the cord that it held its shape and was easy to maneuver.  It does not bend quickly so plugging it in the back of some TV's or monitors could cause some applications to be a little more difficult, but for me this was welcome.  This HDMI cord is great!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"I needed short quality HDMI cables for I2S connections","reviewDescription":"I bought these - two to be exact - because I needed to connect my multi-format disc player to an I2S converter to a DAC. These two connections are made with the HDMI cable I bought. The cables needed to be as short as possible for best sound - ideally 1 ft. These are the closest I could find to this measurement and seemed of good quality. I lucked out. They sound great and are solidly built. They are pretty stiff, but that is not an issue in my installation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Just what I needed","reviewDescription":"I bought one of these from Walmart,  different brand and my husband ordered this one from Amazon, neither of us knew the other had bought one. When the one from Amazon came in I walked in and saw my husband installing it, I said I bought one from Walmart as well. He asked how much the one from Walmart cost and it was higher than Amazon and better quality! The one from Walmart went back and we kept this one. It was a good price, high quality and not too thick or too short,  just the right size. The performance is great so far. Thank you Amazon for carrying what I need when I need it!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Not bad","reviewDescription":"Too short ordered wrong one good wire","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Risky to trust hdmi 2.1 past 10ft.","reviewDescription":"Intermittent display issues.  Couldn't get stable 120fps at 4k. Returned.  Would work fine with lower bandwidth display resolutions.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648166400000}
{"reviewTitle":"Nope for me","reviewDescription":"Didn’t work for me. Bought it for my ps5 and 4K tv since I needed a longer wire,but it made it lag from time to time. Will return…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624579200000}
{"reviewTitle":"The cable failed today, day 10 of use.","reviewDescription":"","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663804800000}
{"reviewTitle":"Have to remove reinsert every few days or there is no picture","reviewDescription":"Every few days have to remove and reinsert it to see a picture on tv - via satellite box","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616716800000}
{"reviewTitle":"Cable is too thick","reviewDescription":"Not worth buying takes up too much space the cable is way too thick","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636848000000}
{"reviewTitle":"Not high quality","reviewDescription":"Started flickering after about 6 months of use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Seems to be not durable.","reviewDescription":"Seems to be not durable and appear a cheaper cable. There are no brand on it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617580800000}
{"reviewTitle":"would not work on tv or playstation no signal at all","reviewDescription":"hdmi cable on samsung q90r","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1628035200000}
{"reviewTitle":"Hdmi","reviewDescription":"Too long, returned","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627776000000}
{"reviewTitle":"Cable failed after 5 months","reviewDescription":"The cable worked great for my PC to TV. Perfect 4K resolution with 7.1 audio. After 5 months of having the cable in place, I booted up my PC and the screen started flickering. I tried moving and bending the cable and the picture went out completely and then flickered more. I swapped the cable out and everything was fine again.Do not buy this brand - it is not meant to last.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Don't buy longer than 12ft for HDMI 2.1 passive","reviewDescription":"I bought this cable without thinking. I was needing a 30ft HDMI 2.1 cable so I could run the cable from one corner of my room to the other. However, I never thought to look up what the HDMI 2.1 specifications were graded for as a passive (Non-Powered, Non-Optical) cable. Turns out, HDMI 2.1 is only graded for 10ft, with a theoretical limit of 15ft. Anything more and you will get signal degradation. I found this out the hard way when, shortly after installing it, I noticed that every so often, my monitor would go solid black for about 1-2 seconds then come back on and would do this about 1-3 times every hour. I'm sure the fault isn't with any defects in the cable, but instead with the fact that it's too long a cable to carry that type of signal for that amount of distance. Anyhow, If you need more than 12-15ft for an HDMI 2.1 cable, get a USB powered one or an Optical variant so it will be able to carry the signal the entire distance. Anyhow, that's my PSA.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1668297600000}
{"reviewTitle":"Does NOT work at 4K120 with HDR","reviewDescription":"This cable has intermittent connectivity at 4K120 with HDR (from a gaming PC using an nVidia GeForce RTX 3090). I imagine most people reviewing this are not actually running at 48Gbps peak bandwidth using 4:4:4 HDR, so beware other positive reviews from people who just bought this cable to run 4K60.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Does not perform as advertised","reviewDescription":"Hooked up to my Xbox Series X to the HDMI 2.1 port of my Samsung QLED and the picture goes black going into games.  Went into HDMI troubleshooting and the TV said the cable was not capable of 4K 120hz.  I have another cable, hooked it up and it worked fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Flickering on screen","reviewDescription":"Constantly has flickering with u8k hisense and radeon rx 7900xtx so be aware of annoying flickering if you plan on getting this cable","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Intermittent black screen with high refresh rate and HDR","reviewDescription":"Used for a 360hz monitor and HDR. I get intermittent signal loss with intensive graphics content on screen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"hardly used it and it's dead, I have older hdmi cables that have truly been abused still around","reviewDescription":"Poor quality cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"eARC did not work","reviewDescription":"Purchased 50 foot version.  Forward video seemed to work fine.  eARC did not work.  Audio system connected intermittently (disconnected much more than connected)  some pops and artifacts when connected.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Failure after 4 months","reviewDescription":"Everything was flawless for a few months, then randomly the display would drop and notify me I had an hdmi issue. Thankfully I had a fiberoptic cable on my old DSP I was able to hook up for testing. It has been flawless for month. I now know this unit was faulty. Buy with caution.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Very poor audio performance","reviewDescription":"HDMI would not send audio to external sources.  Went back to old HDMI and stereo back on.  Don’t buy this cable if you want high end audio","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"FALSE ADVERTISING","reviewDescription":"Make no mistake: this cable *does* work just fine. But it is NOT HDMI 2.1. It is HDMI 2.0.You cannot get 4k60+HDR without downgrading the color format from RGB to YUV422. This cable WILL NOT reach anywhere near 4k120. Amazon needs to remove this listing.Works great as an HDMI 2.0 cable, though. If you don't need all that bandwidth and you just want to display something, this is a decent choice. But don't buy this expecting the extra bandwidth 2.1 offers.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Flickers","reviewDescription":"This cable does provide 4k 120hz display, but it regularly disconnects and reconnects making the screen go black momentarily. Makes it very difficult to play games with. Might have just recieved a damaged or defective cable","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Interferes with PS5 Wifi. BEWARE!","reviewDescription":"This cable was the culprit for a multi week long, frustrating troubleshoot for my PS5. Upon buying a new TV I  ordered new HDMI cables, but shortly after installing it I noticed my PS5 wouldn't connect to the internet anymore, which baffled me.After weeks of troubleshooting thinking it was my router, ISP or something else I happened to switch my HDMI cables as a last resort and poof, the internet magically worked again. Whatever it is about these cables, they will screw with your PS5 and make you miserable. AVOID AT ALL COSTS, MISLEADING PRODUCT DESCRIPTION.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Very, very bad! Replaced it with JSAUX Fiber Optic 8K HDMI cable, problem solved. 5GHz Interference!","reviewDescription":"Very, very bad! Replaced it with JSAUX Fiber Optic 8K HDMI cable, problem solved. 5GHz Interference with laptop wifi!Do no buy this cable. The quality is extremely low. I was trying to use my laptop with my TV. The laptop and the TV were not the problem. It was this cable. 2.4GHz wifi still worked, but 5GHz did not. Replacing it with the JSAUX fixed. I checked reviews for other companies' HDMI cables, and I heard about very similar issues. The JSAUX did not have any reviews listed about that.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Stopped working after a month","reviewDescription":"Worse quality than apple products. Can't even last a month. Very cheap and very chinese. Buy any other cable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Only worked for 3 weeks.","reviewDescription":"The cable only lasted 3 weeks.  Do not buy this cable!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Unsatisfactory Packaging and Quality Concerns with Longer Highwings Cables","reviewDescription":"I recently purchased cables from Highwings, and three times, the products arrived in a condition that was far from satisfactory. The packaging seemed to have been previously opened, and the cables were carelessly stuffed inside, giving the impression of being secondhand items returned by another dissatisfied customer. For those in search of a longer cable, it's imperative to opt for one that is certified. Lengthier cables demand high-quality materials and certification to ensure reliable performance, qualities that were noticeably lacking in these cables.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Does Not work","reviewDescription":"I have a brand new gaming PC, and I use an also brand new 32 inch smart Tv as my monitor, 1080p, so I thought I get a new hdmi cable. all worked well with the old cable. I gave my old cable to my daughter for her console. THIS cable did NOT work at all. No picture. Restarted everything, still nothing. I used to be a master tech for dish, so I know my electronics. I have tried every troubleshooting trick I know. Nothing. Did not recognize the graphics card at all. I had to go to WM at 10 pm for another cable to be able to get on my PC.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Not optical. Long lengths drop.","reviewDescription":"When I searched optical HDMI cable this came up.Of course it's not optical even though that's what I searched.I thought because they had long lengths available it was optical.These long length will drop. Anything over 35 feet is just a waste of time.Make sure the product is what you are searching for.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"did not work with Sony X93L 4K120hz","reviewDescription":"10ft HDMI 2.1 cable was used for PC 4090 at a Sony X93L.  The PC set at 4K60hz and the Sony inputs 3&4 in \"enhanced format\" worked fine.  When switching the PC display on the Sony from 4K60hz to 4k120hz the Sony screen went blank, this was true on all TV inputs tested.  After hours of troubleshooting...insufficient signal strength through the cable...not enough bandwidth to meet the 2.1 spec, which is a requirement for Sony.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Not even 6 months","reviewDescription":"It hasn't even been a full 6 months yet and one is already shorting out","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639612800000}
{"reviewTitle":"Hmmm 🤔","reviewDescription":"The hdmi cord picture quality is not the best but then again I used this cord for my suv. Other than that it is an okay buy for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622678400000}
{"reviewTitle":"Picture gets grainy sometimes","reviewDescription":"I like the connector in general. But the picture sometimes gets grainy and sometimes there are weird electronic disturbances on the display.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629936000000}
{"reviewTitle":"Sturdy and durable, BUT…","reviewDescription":"Cables are VERY stiff and inflexible. Find something else if you want to avoid messy appearance.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"Built great but maybe too heavy!","reviewDescription":"The cables are built very well. To the point of being too heavy. I had trouble with them working thier way out of the HDMI socket because of thier weight.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1618963200000}
{"reviewTitle":"Cheap","reviewDescription":"Not good quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"No change when I installed it.","reviewDescription":"I found no change in anything sound or picture when using it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1634256000000}
{"reviewTitle":"Realized my graphics card is hdmi 2.0","reviewDescription":"Not able to test out 4K @120Hz.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"sound and picture","reviewDescription":"meterial is too cheap","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638921600000}
{"reviewTitle":"Not dependable","reviewDescription":"Issues with dropping in and out.  Better cables out there with comparable prices","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623715200000}
{"reviewTitle":"fixed an issue for me... it works","reviewDescription":"I bought a 49 inch monitor for my PC.  I was getting \"static\" with my old cable. This fixed the issue and I didn't have to return the monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Does the job","reviewDescription":"Compatible with everything in my AV set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Arrived on time","reviewDescription":"Arrived on time and worked perfectly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"It works","reviewDescription":"No complaints works how it should","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"HD cable","reviewDescription":"Product was as expected. Reasonably priced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"TV","reviewDescription":"Needed for 4K for great picture","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"well made and works as expected","reviewDescription":"well made and works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Great","reviewDescription":"Does what it’s supposed to do","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"On point","reviewDescription":"I received the HDMI Cable today and it exceeded my expectations. Great product and exactly what I needed.Apparently Sony thinks it’s okay to include the shortest possible cord with their gaming system.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Worked where others didn't!","reviewDescription":"I have a setup where i have two computers connected to the same monitor via an HDMI switch. I tried several HDMI cables from the connector to the monitor and they did not work, but this one did!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Just the right length","reviewDescription":"I needed a shorter cable for my work from home set up and this works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Yes","reviewDescription":"Solid, definitely worth the price. 8k registered on my xbox & tv\/monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Quality","reviewDescription":"The quality was really good made improvement to my picture quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Works great and feels premium","reviewDescription":"Love the braided cable, it feels sturdy and premium. It's an upgrade to the standard hdmi cable we had to replace. That one crapped out for seemingly no reason.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Great Cables","reviewDescription":"These Cables are great and at a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Improved Performance on Apple TV","reviewDescription":"Had a lot of delay and flickering with an older HDMI cable using Apple TV, I decided to upgrade the cord to see if it would remedy the problem and it did! Great performance for the value, I'll be buying more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Quality","reviewDescription":"So far, meets all my expectations. Very satisfied","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"arrived quickly and actually measures 3 feet","reviewDescription":"arrived quickly and actually measures 3 feet","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Excellent choice","reviewDescription":"After an HDMI connector that connected my laptop to the overhead projector system at church, we quickly installed a spare so I could continue my Bible Study presentation.  However, I experienced delays with the projector image.  I researched the many choices for HDMI cables and took a chance with the Highwings cable.  It solved the delay problem and is hefty enough that it will not break when moved which happens quite a bit.  Now I have confidence that whether it's my Bible Study, a movie night, or a council meeting the projector will get the feed it needs.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"strong","reviewDescription":"very strong well made product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"I don't get 4K 120Hz ....only 75Hz.","reviewDescription":"Purchased a 6ft cable to go with my RTX3080Ti and 21:9 LG 120Hz monitor.  Native resolution is 3840x1600, and when I use this cable, I cannot get my setup to recognize 120Hz....only 75Hz is available.  Display drivers are fully updated.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Stopped working after few months","reviewDescription":"Not as sturdy as others. Stopped working a couple months in.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Interferes with WIFI signal","reviewDescription":"I purchased this 1 foot HDMI 2.1 cable as a replacement for another one, which had been causing periodic video interruptions, I like to play online games and this is a major issueWhile this cable did not have any video interruptions that I observed, I noticed that my wifi was cutting out at predictable 19-second intervals. These interruptions induce significant lag spikes, rendering the cable practically unusable for my gaming needs.I tested 3 setups - 1 with this new cable, 1 with my old cable, and 1 without any cable at all. I believe that the fault is due to this cable, as it was the only variable that caused the lag spikes.For reference, and in consideration of the possibility that this issue may be contingent upon my specific hardware, I am utilizing a 2023 MacBook Pro M2, in conjunction with an ASUS TUF Gaming 28” 4K 144Hz DSC HDMI 2.1 Gaming Monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Work OK, but cannot verify certification","reviewDescription":"As stated, they appear to work OK. However the two 10 foot cables I ordered did not have the certification code with a hologram. And the 3 foot cable that did could not be verified by the HDMI app. So it seems deceptive to me that they have \"certified\" plastered all over the description. Typical for Chinese sourced stuff in this day an age it would appear.And to boot, they dropped the price after I ordered them. About an inch away from just sending them back...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"This doesn't support 2k at 165 hz?","reviewDescription":"So I bought this since I needed longer cables for my new monitors I just purchased. I have LG Ultra Gear monitors that do 2k at 165hz. I plugged these cables in and the do 2k, but only up to 144hz, which is indicative of a 1.0 HDMI cable. It says these are 2.1 HDMI, so I'm not sure what is going on. I'm playing with the settings on my computer, but they are locked to 144hz. I didn't buy these monitors to not be able to use their full capabilities, if I'm not able to fix the problem, I will be returning these cables, but I will update my review if the problem is resolved. Atlest they feel and look nice, but I only care about performance, not aesthetics.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Not 8k","reviewDescription":"Tried using with my pc to get 4k@120 but wouldn’t go above 60hz","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Was good","reviewDescription":"It worked great, no issues, but after 8 months keeps dropping the signal from Apple TV to my Samsung tvEverything is connected as it should, tried all hdmi plugs on tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"It worked for a while","reviewDescription":"I bought this cord because I needed a longer one to reach to the wall mounted TV through my cable run.  The cord seemed to work fine for a little while, but the TV picture would go out and come back occasionally.  Then we had noise in the picture that looked like burned out pixels with the more frequent picture coming and going.Figured out it was the cord.  For some reason it has a little wiggle room in the TV's HDMI port.  Going back to an older cord (that has to hang because it's too short to run along the cord run) fixed all the issues we were having.  It seemed like a quality cord and it worked great at first.  Don't know why it failed within a few short months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Not certified HDMI 2.1 (so far as I can tell)","reviewDescription":"Cable might be fine, even great.  I don't know.  I didn't actually try it.  The amazon posting shows the HDMI Ultra Certified Cable emblem, but the cable arrived in a cheap looking cardboard box with no certification emblem to be found.  I suspect their advertising of the certification may be fraudulent.  That doesn't necessarily make their cables bad, but is lessens my confidence in the product and I'd rather know for sure what I am getting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Damaged Cable Lead to Artifacts on Screen","reviewDescription":"The product was defective when I first received it but I had blamed the artifacts on my GPU at first. I replaced the GPU with a new one but as of now, repositioning my monitor to a new location caused the same artifacts to appear again. I’m assuming the cable does not have a tight fit as the movement caused the HDMI connection to come loose which is also apparent when connecting the cable to the female end.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Defective Cable","reviewDescription":"I purchased 2 of these cables and one of them didn’t work.  Overall they seem fairly good quality but the fact that one was defective lowered the score.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Don’t buy for 4K or anything needing high speed","reviewDescription":"Cuts in and out all the time and AppleTV says the hdmi is basically junk and can’t process 4K or HD. Maybe if the have one that only 2’ it would work but the one longer one I got will not work","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Already Failed","reviewDescription":"Kaput! Well that didn't take long. Should of read the reviews, Now waiting for the longer one to join it's little cousin. Flicker...flicker...failure to connect.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Tv disconnecting and flashing","reviewDescription":"It started flickering and disconnecting from right out of the box. I at first thought it was either my pc 's graphics card or my TV itself but I have tested other hdmi cables and haven't had any issues with them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Terrible Customer Support","reviewDescription":"Ordered several of these at different lengths. The 50ft cord did not work at all so I emailed customer support. They ignored me completely, ghostly silent, which means it’s a terrible product with 0.0 support. Will never purchase from them again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Works....until it suddenly doesn't","reviewDescription":"Worked amazingly well for about 2 months. Then it started giving me some odd display artifacts that I could resolve with resetting my TV. I thought my TV was starting to go out.Then, suddenly, there is absolutely no video output through the cable. There is no stress on the cable, and it was not bumped or moved.Tested a few things with some spare HDMI cords and was glad that it wasn't my TV. Which brings me to my disappointment in the product. It wasn't super expensive, but it was enough that I'm am rather miffed about it lasting only two months.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Loose connection","reviewDescription":"The cable seems nice and all however the connection to the GPU is very loose. It falls out all the time. I would have returned it but there is only a 30 day window further making my review worse.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Could not transmit 4k 144hz over 30 ft.","reviewDescription":"It didn't transmit the signal properly from my pc to 4k tv at 144hz. It kept flickering and at 144hz it often didn't display at all. It's built solid but unfortunately the performance on the higher end isn't there.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"These are junk - caused my video to no longer synch","reviewDescription":"Junk cable.Caused my home theater system to fritz out. Took me a while to figure out it was because I had put THIS CABLE in my system. Was causing my projector to be unable to stay synched to my Marantz HT Receiver. These are NOT quality cables. They are SUPER STIFF too.Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"cable doesn't work properly. needs to be moved around or reconnected every time","reviewDescription":"use this cable to connect my monitor to pc. after replacing my old slower cable this one needs to be unplugged or moved around to get the picture working. my computer is detecting the cable and so is my screen. it just stays black. after moving it around it will start to show picture. my old cable still works just fine. its just a bit slower speed cable. so defiantly a product issue","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Idk","reviewDescription":"Idk it feels nothing better and it's big for a cord but it's not bad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Useable...but looks like deceptive marketing","reviewDescription":"I have the 30 foot version of this but needed a hundred for my new setup so decided to go with this. Notably, It isn't 120Hz as can be seen in the picture(could go lower than 60 but no higher). The cord is also about half as thick as the 30 foot which struck me as being odd. I'm keeping it because it serves the purpose I needed it for but in the future, if I need to make a similar purchase, I will likely be going with another brand.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1666224000000}
{"reviewTitle":"Great but..","reviewDescription":"I needed the cords long to move all my wires behind the wall. I found these and the price and length was great! My boyfriend has a PS5 and Xbox and the whole set up. We have had everything installed for a few weeks now and he says they are shorting. He keeps complaining. If you are hooking up a lot of different devices make sure to do your research as to whether these are the right cables. I’m not a tech person but he is and is definitely not happy with these :\/","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1664928000000}
{"reviewTitle":"May be Causing STATIC Screen","reviewDescription":"I upgraded to these HDMI cables because of the ability to have a 4K signal pass through them. I use it between my new Apple TV 4K and my television. Everything works as expected with the exception of the occasional STATIC SCREEEN where the screen shows nothing but static and white noise. The fix is to turn off the Apple TV and back on again. When I looked for info on why this might be happening the suggestions were that it was a problem with the HDMI cables, possibly not correctly passing on the HDCP copyright protection. I am not sure if this is the problem or not. But I have never had this issue until I switched to using this HDMI cable. It doesn't happen often. But it happens enough to be annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1625616000000}
{"reviewTitle":"The Hdmi Struggles to stay in","reviewDescription":"The Hdmi Struggles to stay in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"HighWing hdmi 10’ cable","reviewDescription":"Sturdy and well built structures.  No big difference on picture qualities.  Maybe my old hdmi 4K one was well built too.  Will update later on further statuses.Updates: Not working well with the high -end Onkyo A\/V receiver.  Got to reboot Onkyo 1x or 2x to get HDMI ARC audio sounds.  Occasionally, got to un-plug and re-plug it into Sony HDMI ARC port to reset sound outputs.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672185600000}
{"reviewTitle":"Stopped working after 2 weeks","reviewDescription":"Cable worked great for 2 weeks, then failed.  Tested other cables and they work - and tested this cable on another device to confirm it is faulty.  Can't say I have ever had an HDMI cable fail...  I would avoid this brannd.Update - seller reached out and helped make this right.  Raised to 3 stars for great seller communication.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1679616000000}
{"reviewTitle":"This cable was 32.5ft, definitely not 35 as it says","reviewDescription":"My previous cable was 35ft.  I needed a 35ft cable.  I ordered a 35ft cable according to the product description.Trusting the description I pulled this through my ceiling to my projector, which is no easy feat.  Imagine my dismay when this wouldn’t plug into my projector and receiver at the same time.Quality was good, cable is very sturdy.  Very good quality cable.  If you don’t care about being shorted 2.5 ft of cable.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1671494400000}
{"reviewTitle":"Connector too short","reviewDescription":"Cable works well.  one connector to monitor perfect.  To my video card on myt PC connector short and very easily disconnects","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"It’s just an average HDMI cable","reviewDescription":"Cable looks very impressive, but it’s just an average HDMI cable. Works no better than a standard HDMI cable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"The price is right","reviewDescription":"It is a good quality braided cord, priced right.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Item did not appear \"new\"","reviewDescription":"Item had been previously opened.  Cable was not neatly coiled in its packaging.Item functions as advertised but may have been returned previously.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Length","reviewDescription":"The length of this HDMI cable is great. I wanted to replace my HDMI for Xbox and this is great value for the money. I love the breaded look.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Great quality","reviewDescription":"This is a great looking HDMI for PlayStation 5 gamers I plan to use this with my Apple TV console since it didn’t come with an HDMI with a 4K resolution","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"As Described","reviewDescription":"As Described","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"so far so good","reviewDescription":"good value","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Very stiff","reviewDescription":"It's a good quality cable but if you are hurting for room to plug it in, look elsewhere because this cable is REALLY stiff and difficult to use in a tight space.  Other than that, I would have given it (5) stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Just what I needed","reviewDescription":"This cable was just what I needed.Good quality & delivered timely.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Works most of the time","reviewDescription":"This cable lets my TV do 4k @ 120Hz and have a 4k monitor plugged in. This replaced a different cable brand that was not able to have both screens plugged in.1-Star removed because every hour or so my screen will go black. The picture almost always comes right back. If it doesn't I have to unplug and replug the cable into the TV.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"High speed","reviewDescription":"Works as advertised","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Just what I needed","reviewDescription":"Couldn’t’t find it locally","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Excellent","reviewDescription":"Perfect, high quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Cable works great","reviewDescription":"Cable works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Highwings 8K 10K 4K HDMI cable 48Gbps 6.6FT\/2M","reviewDescription":"It worked as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"High quality","reviewDescription":"I’m going to be complete honest, for the price I wasn’t expecting this kind of quality and performance, I bought this cable to connect my console and high performance PC and overpass my expectations quality is great , meet all specs as mentioned on the advertisement 10\/10 on everything, and the price cant be beat, I will replace all my equipment with this","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"works good","reviewDescription":"i was not satisfied with the picture on new 4k tv and found out that my hdmi cable although it was high quality it was not high speed ready for 4k this cable gives me what I expected when I bought the new tv. flexible and seems well constructed I am satisfied","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"So far so good.  Cable seems well built.","reviewDescription":"Just installed the 20 ft. HDMI to HDMI cable yesterday.  So far so good from my HP laptop to my 4K monitor.  Working well at 4K resolution.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"NICE AND NECESSARY CABLE WIRE","reviewDescription":"PRODUCT IS NECESSARY FOR THE TV I HAVE. NOT CERTAIN ABOUT LONG TERM USAGE BECAUSE I JUST RECEIVED IT","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Awesome HDMI cable.","reviewDescription":"Exactly as advertise.  Bought to connect my laptop to my TV, worked perfectly.  Very satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Perfect","reviewDescription":"Great for what I needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Best HDMI cabkes","reviewDescription":"Better than the 4K cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Seems to be sturdy and offers great connection.","reviewDescription":"We ordered this for our new tv\/soundbar because guys at Best Buy said that the cable that comes with the sound bar isn’t “fast” enough.  This one was highly rated and much less cost than the one Best Buy was selling.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"HDMI Cable","reviewDescription":"The HDMI cable worked great!  It fixed our error issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Highwings - Cable HDMI DE 8 K,","reviewDescription":"Very good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Works well with older HD. tv","reviewDescription":"Product as advertised","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"HDMI 2.1 4k120 HDR VRR works","reviewDescription":"I first tried a fiber cable which failed to handle HDMI 2.1 and experienced black frame flickers. I've had 0 issues with this cable at 4k HDR with 120hz VRR. The cable itself is decently flexible as well for 15ft 48gbps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"The most important thing to know is it looks good and it works!","reviewDescription":"I don't know what you could say about a high speed cable, it looks good and it works as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"great","reviewDescription":"quality item","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very nice","reviewDescription":"Works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"rv stuff","reviewDescription":"great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Works perfectly","reviewDescription":"Second time is a charm. This video cable is a great value for the money. Thanks.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Slightly shorter","reviewDescription":"The cable not exactly 30’ so allow some safe buffer for your application. It probably won’t provide full 48 mbps at that length so I won’t expect to get full 8k 4:4:4 color through it. But does well at 4k hdr 60hz.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"It’s not a good combo with the new Apple TV and a 4k HDR Plus tv","reviewDescription":"It consistently bugs out with the new Apple TV and 4k hdr plus Hisense tv. I originally got it for that purpose but now I’m using it for earc which seems to work pretty good for that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Glitches for 4K","reviewDescription":"Glitches every 30 seconds or so for 4K. 1080P works fine. Maybe it's the HDR, I don't know. Seller promptly refunded.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Not as advertised, but really good customer service.","reviewDescription":"I bought the 1.5ft for my series x. I was able to play through bramble the mountain king (5 hour game), and just minutes after I beat it, my screen stars going black for 2 seconds, then comes back for 2 seconds. It's happening nonstop. Tried my old cord again and everything works fine. Looking at \"recent reviews\" rather than \"top reviews\" shows plenty of other people saying the same thing.Edit: the seller kindly offered a refund due to the faulty cables I received, so I improved my rating to reflect good customer service regardless of cables not being true to the 48gbps standard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Works well, but Apple TV says there are issues with the connection","reviewDescription":"The cable was inexpensive and works for most video, but an 8K cable should be able to handle Apple TV 4K with 60Hz refresh.  Apple TV complains there are issues with the connection which were resolved with another brand cable.  I also was running into some error messages from Disney about my cable as well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"Make sure you plug in the right end to your monitor versus camera","reviewDescription":"Almost freaked me out on a live stream when I saw black screen realizing these are one-way connections so I had to switch ends to make it work.... Only thing I hate about these","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Signal is jumpy","reviewDescription":"The very first time I plugged in the cable it loses signal if you move it around certain ways. Works fine otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Stopped working","reviewDescription":"Bought in March and it stopped working in July.  Hooked up multiple devices to test and the cord does not work with anything.  Amazon support window closed out in June, imagine that!!!  Stay away from this product!Company reached out and rectified the situation.  Great customer support on their part!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"The quality of the cable is really good and also the quality it looks like 8K but","reviewDescription":"The quality of the cable is really good and also the quality it looks like 8K but I don’t know why it makes me some problems like the connection is not good or something is bad with the cable as you can see on the video","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"The cable is a little stiff and thick.","reviewDescription":"The cable is a little stiff and thick.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Good cable","reviewDescription":"Cable works fine, but is too stiff to route.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Works","reviewDescription":"Works as expected, no issues","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Worked but","reviewDescription":"The 65 foot cable works good but for an earc connection I had to reverse the cable from how it was labeled with the Tv side plugged into the receiver. I don't know whether it was miss labeled or for earc it needs to be reversed. But in the end it works so I'm happy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"HDMI","reviewDescription":"Works well so far","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"good cord","reviewDescription":"does the job","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Just as advertised","reviewDescription":"Just as advertised","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Good product","reviewDescription":"Good cable","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Nearly 5 stars","reviewDescription":"Using as an HDMI Arc cable between LG TV and Bose TV Soundbar. The only reasons for not giving 5 stars: 1) the cable connectors did not fit into the TV as easily as the HDMI cable we bought to connect with the cable box. 2) I have noticed that on one occasion the TV also failed to connect to the Bose. Not sure if that is the cable's fault, but given the connector fit issue, does make me wonder.But at this price, not complaining, just explaining why I rated 4 stars and why I did not rate picture quality.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696118400000}
{"reviewTitle":"Very good for the price","reviewDescription":"As an engineer I test all of the products I buy to see how close they come to what is said. They are very good for the price and the preformed well and met most of what they stated. Would purchase again if needed","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Doesn’t support 160hz 2k","reviewDescription":"Looks good, but doesn’t work as expected, can’t handle 2k wide on 160hz, maximum 85 hz on 2k","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"AVERAGE CABLE","reviewDescription":"doesnot work good with soundbar still losing sound","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"weak tip","reviewDescription":"i got this for my Apple tv to plug into my Samsung smart tv. The style is nice, and the first few days, the performance and picture was fine. Then, after moving things around and reinserting plugs, My tv would go black for a few seconds an load up as if the device has just got plugged in. That is when i reinsert this hdmi in again and felt some loosness in the port. every plug i had  was fine, but this hdmi was flimsy. There are times where the fit stays consistent but it still shouldnt be like that.Overall, i would not recommend this hdmi plug. i would suggest in buying from a brand that is more reputable that specialize in cables. 3\/5 for build quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678060800000}
{"reviewTitle":"Decent cable, but not perfect by any means","reviewDescription":"After buying another cable on Amazon that supposedly supported 4 @120 hrz ( but didn't work at all ) it's refreshing to see my tv work at that refresh rate with this cable. Just like people said on the top reviews this seems to fully support the refresh rate at the 4k resolution. Though, there is a catch that I ha e not seen mentioned. For whatever reason my cable has no audio pass through whatsoever, if you where hoping to use your surround sound or a good pair of TV headphones there seems to be no working audio pass through. This is a pretty big flaw, but since I'm using my computer headset and have no other issues with the cable I think it is fair to give it 3 stars. So if you are planning on using this for your PC set up, just know that that the audio pass though may not work and you will have to use your desktop headset.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1634860800000}
{"reviewTitle":"Not what they promised.","reviewDescription":"Glitchy with new upgrades. They get hot and video scrambles. Hooked up ps5 and sound was lagging and after disconnecting they were really hot. That why they were failing. Looking for new ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Just a heads up","reviewDescription":"Got this product thinking it would be better than the factory supplied ps5 hdmi cable, this was not the case. Only thing I cared about was getting a steadier frame rate at 120hz, but I saw greater frame drop than the factory ps5 cable. The high wing dropped as low as 40fps while I was gaming while the ps5 cable had never dropped below 80. If you’re just looking for a cheap replacement because yours broke then by all means get this, if you’re looking for an upgrade then learn from my mistake and don’t buy this product.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Too stiff","reviewDescription":"The performance of this device is great however the cable is too stiff and rough to move around","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Good value, loose connection.","reviewDescription":"Picture quality is great. Value for the money is great.The only low point I have with this product is that the connectors do not fit snuggly \/ securely into any HDMI port I have tried them on. This can be troublesome if the cables or equipment get moved for any reason (moving\/extendable mounts are a great example), as the cables come lose very easily.If you are looking for low cost and don't need to worry about movement, these will do the job... If you need the connections to be more secure I would advise looking for a different cable.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1671148800000}
{"reviewTitle":"Not for cable management","reviewDescription":"Main problem: It’s a good\/cheap cable. The braiding, however is so stiff that it starts wrenching at the ports if you’re trying to do cable management (wall mounting on an extending\/articulating wall mount where wires must be carefully considered to prevent tensing\/pinching across full motion).Minor annoyance: the stiffness of the cable combined with a BARELY loose fit in the eARC port of my Sonos Arc has been sporadically causing a brief connection  issue in the HDCP “handshake” across source—>tv—>soundbar that kills the signal while it reconnects. I THINK I’ve fixed it with a single layer of form fit electrical tape wrapped around the border of the hdmi to promote a tighter fit. Either way it doesn’t loose connection by simply touching the cable now which is a huge plus.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"Some issues","reviewDescription":"The cable would not maintain a stable 8K 60Hz signal (signal loss every 4-5 minutes). Replaced by the amazon brand (better price) and it has worked without issue.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"It works","reviewDescription":"Just what needed","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"there ok","reviewDescription":"got due to pink screen coming up when switching devices and cables where recommended .no real change with upgraded cables and picture looks the same to me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"It works","reviewDescription":"I got it when it was on sale for like 8 bucks and its a good price. Though its not really that bendable, btu besides that it does work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"High quality cable, but stiff.","reviewDescription":"I really wish that this cable was more flexible. It is stiff and bulky.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"HDMI","reviewDescription":"Prefect fit to my tv and better picture","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Severely disappointed (update)","reviewDescription":"Bought this cable to replace a cheaper hdmi cable that has minor artiifacting when playing PC games on my television that about 25ft away. Hooked things up with this cable and the image was far worse. Constant flickering and artiifacting with this cable making games completely unplayable. Maybe I just got a bad cable, I'm willing to gamble on a replacement though.(update)Seller reached out to offer assistance with the product, wasn't able to resolve the technical issue, but saved me the hassle of having to return the faulty cable and offered a refund. Top tier customer service.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"It works","reviewDescription":"Price is right","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"HDMI CORD","reviewDescription":"Cord did not work on my Samsung Smart Tv. It did however work great on my Acer monitor and laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"HDMI CABLE","reviewDescription":"I connected tv and set top box. Now all is well these past few days.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"first time I gotten eARC to work, picture is great","reviewDescription":"it works. all that matters. First time I used a 5.1 receiver to a tv, and it all works. even eARC. good thing as there are no other ways to get sound to and from tv now.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Nice cables","reviewDescription":"Perfect foe what it needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Nice Upgrade!","reviewDescription":"I was having intermittent black\/blank screens going from my PC to my TV. Doing some Google searching and finding on Reddit I read that (something about)... Anyway, you know the thing. Apparently, I needed a shorter cable for the processing of the info transferred. Went from a 10 footer to this 5 footer and problem solved. Glad I did it and I thought it was a good price, too.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Good quality","reviewDescription":"As described and of good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Works good","reviewDescription":"Good cheap hdmi cables. Seemed to work good to hook up our dvd players","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"So far so good!","reviewDescription":"Since I use ARC for Audio return from my SmartTV to amp, using standard 4K HDMI cables I noticed random audio drops.  Switching to these cables for both my Family Room and Den set up, took care of the problem while delivering clear\/clean picture quality.  So far, they are proving to fix the issue I was having and working great!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Solved My Problem","reviewDescription":"I ordered this cable because my old cable was (I thought) causing the video from my DVD player to TV screen to display as screen “static” intermittently.  I was right.  Now the video comes through and displays to my TV screen reliably and I have no worries.  An excellent and cost-effective fix.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Works for PS4","reviewDescription":"Works well for me","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Fast Connection","reviewDescription":"I would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Excelente","reviewDescription":"Imágenes de alta calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Thank you!","reviewDescription":"looks good, works too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Good quality!","reviewDescription":"Bought this cord for my girlfriend to use on the days she works from home. Plenty of length and very durable. Makes the picture from her laptop look great on a tv screen.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"8k hdmi","reviewDescription":"Works great as described","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Works great","reviewDescription":"Just what I needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Works great and good picture","reviewDescription":"Just what we needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Great value for the money!","reviewDescription":"Quality connectors and cable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Great quality","reviewDescription":"Sturdy cord. Justcas advertised!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Good","reviewDescription":"Works as supposed too","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Picture Quality","reviewDescription":"The picture quality is great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great and sturdy","reviewDescription":"Has worked great and is sturdy. One of the things that I didn't expect but have loved is the cord is kind of tight\/flexible. It will hold its shape. I haven't had it long enough to evaluate the longevity of the product, so I'll post an update if that becomes an issue. Right now I'm really pleased with the purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Excellent HDMI 2.1 cable","reviewDescription":"I recently updated my home theater to 4K and needed new HDMI 2.1 DHCP compliant cables. These did the trick. The 20 foot cable was easy to snake from the AVR to my ceiling mounted projector. The covering and connectors are of high quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"The cables were shorter than what they were sold as","reviewDescription":"It fits and works well on a 4k system. But the one sold as 30 ft was 29 ft and the one sold as 35 ft was only 32ft.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Performance","reviewDescription":"Well constructed, had a real quality feel. I actually saw an improvement in picture quality. What surprised me most was that it outperformed one of my more expensive cables.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Not very flexable","reviewDescription":"Get seem to be well made and I've had no problems with signal strength loss. Flexible is a realitve term, if you're looking for a small radius bend, these won't be what you want.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Works but","reviewDescription":"I have had these go out after awhile and have ordered new ones. They work but they won’t last too long, I’ll update if the new ones do the same. Maybe I just got some bad ones","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"90% satisfied","reviewDescription":"I bought the item almost 3 month ago. My laptop is I5, Dell-5500, I tried with Asus monitor but the cable didn’t work, then I also tried with Macbook and other laptop and it worked well. And sell it to my colleague :). Thank you","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"1st one faulty 2nd one works perfectly","reviewDescription":"The first 50 ft cable that I received was faulty and no matter what computer or laptop that I connected with or display it never works so I got a replacement and upon testing out the replacement everything works perfectly with the exception of the faulty cable for the first round I'm very pleased with the performance of the second replacement cable.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"So far, so good for HDCP error.","reviewDescription":"I purchased to replace the HDMI cable for my Roku.  I kept getting the \"HDCP Error Detected\" message.  After replacing with this product, have not had any problems.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Functionality","reviewDescription":"Performance","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Para la pc","reviewDescription":"Me a salido bueno por el momento.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"Just what I needed","reviewDescription":"Very well made","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Quality Product At Reasonable Price","reviewDescription":"High quality product that totally meets my needs","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Works","reviewDescription":"Idk if it made a difference","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"It's unnecessary","reviewDescription":"After I ordered it, I read that there's no need for a special cable for ultra high def 4K or Dolby Atmos. It's a scam. The cable works, but so do regular cables.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Works good.  No issues","reviewDescription":"Good HDMI charger.  We havexhad no issues using it with connecting our laptop to our tv","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Seems okay.","reviewDescription":"Had to replace a cheap HDMI cable if I wanted to get rid of the interference it was leaking out and into SDR reception. Completely cleaned it up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Connection","reviewDescription":"Very useful","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Prompt delivery","reviewDescription":"Delivered promptly and as indicated","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Good buy","reviewDescription":"Worked great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"It works","reviewDescription":"A Little loser fit than my other one. So far it works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"It works","reviewDescription":"I haven't been able to push its limits yet, but it feels like a good buy just using 2.0 hdmi ports","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Works","reviewDescription":"Works as it should","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Great materials but cable fails after sometime later. Still working anyway","reviewDescription":"A pretty decent material cable but notice some errors conneting to a RTX 3060 TI, not sure if the cable are failing but still works. A good option with a discount cause I got 4k at 120Hz.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Seems fine but gets extremely hot","reviewDescription":"It works as intended but don't know if it will last very long","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"good","reviewDescription":"hdhshd","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"great value","reviewDescription":"good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Big difference!","reviewDescription":"Using the cable as an eARC between an 85” Sony Bravia TV and a Onkyo TX-RZ50 receiver. What a difference! The lag is not as bad as when I was using a standard hdmi cable same length. Increasing\/decreasing the volume is quicker than before. The standard hdmi not only caused a lag but would also not respond at times when changing the volume. Streaming has also improved when using the eARC connection. No pausing is occurring like before. If you’re wondering, I don’t go cheap on my internet speed to cause pausing, it was the standard cable. Also, I don’t see a noticeable change of video\/audio. Lastly, it’s not instantaneous response otherwise I would rate it a 5 star. However, the price is better than paying $100-200 for the hi-fi name brand cables that I researched. Hope this review helps you!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Works fine","reviewDescription":"The cord itself is very stiff…not overly flexible.  This does not affect the performance, was not expecting it to be that way.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Works great","reviewDescription":"I bought two, one for when I use the PC on the TV and one for a monitor. I will tell you this, for how cheap these cables are, they work very well but as well as do not be fooled thinking that it'll \"improve\" quality since quality is only as good as what your console or PC is capable. As long as the HDMI meets specs(2.1 or whatever version of HDMI) and meets what speed it needs(18 or 48 GBPS), it'll work just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Not eArc compatable","reviewDescription":"My mistake for not making sure, I'm sure this cable is fine for one directional video and audio but it is not Arc or e-arc compatible, not bi-directional pretty much useless but again my own fault.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Quality cables, approximate lengths","reviewDescription":"These are excellent cables. However, the listed lengths are not accurate. I purchased the 35 ft. 8K HDMI cable, but it was just under 33 ft long. I'm sure this is because it's actually a 10 meter cable and they just picked a close whole number in feet. Luckily for my situation, 33 ft will be sufficient.Again, these are fantastic HDMI cables. They work great and are well made with quality materials. They're at the top of my list when looking for 4 & 8K HDMI cables. Just be aware that they are made outside the US and thus are made in metric lengths, so the listed lengths in feet are only approximations.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Good cord","reviewDescription":"Ordered but the first one didn’t work but they sent a replacement within the next day and that one has been great.  Good value for the money","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"It works well. Cover material braided nicely well packaged.","reviewDescription":"X","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Miss it by that much","reviewDescription":"I purchased two for devices physically attached to the back of my TV (Apple TV 4k and Roku Express.  Even though the devices are attached to the back of the TV a 12”’ cable isn’t long enough surprisingly.  I am sure they work fine but I can’t use them.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Works fine but something is weird","reviewDescription":"In first place, i give only 4 stars just as a precaution, please, read the last paragraph.Effectively this is a certified \"Ultra High Speed HDMI Cable\", i've verified with the \"HDMI Cable\" app, that's a good start.In my case i've used to connect my RTX3080 12GB to a Samsung 50\" Neo QLED 4K QN90A (QN50QN90AAK),with previows cables from other weird brands i was suffering of random flickering, sometimes just a couple in 1 hour; with this cable as far as i've tested the flicker is gone, even using the most demanding resolution that my rig can achieve, 3840x2160 @120Hz 10bit YCbCr444; no artifacts, no sound issues, variable refresh rate works fine too, overall it works as expected, i'm satisfied in this regard  wtihout doubts.HOWEVER, i must be clear, there is something weird here that is good that you know, at least in my case, if i use the Samsung  built in function to test the hdmi cable the test fails and it recommends to replace the cable, to be honest i don't know if that test is reliable, at least in my real life test this is the 1st cable that works properly without any issues, maybe at 144Hz there can be issues, i have no way to test at that refresh rate so i don't know.","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Making a great connection.","reviewDescription":"Pleased with the product. Good seller.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Seem to work, but fit\/finish is a bit off","reviewDescription":"Pros:* Works well with AppleTV and old TCL LCD TV (only 1080p, so not testing \"8k\" capacity of this cable at all)Cons:* Plugs are loose in the HDMI ports (tried multiple different HDMI ports, and they were loose in all of them)* Label on plug is on \"bottom\" (narrow side of the trapezoid) instead of \"top\", so need to retrain how to orient before plugging inFor my specific purpose, where these are connecting an AppleTV mounted on the back of a TV to said TV, the cons aren't really much of an issue. I do wonder how well it will work with the looseness of the plug though (will it loosen and fall out over time?) I might put a piece of tape to hold it in the port more securely.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"🔥🔥🔥🔥","reviewDescription":"🔥🔥🔥🔥🔥","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Really does the job, very pleased","reviewDescription":"High quality.  I can see a difference on my LG OLED TV between my old cable and this one.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715472000000}
{"reviewTitle":"Does what it is supposed to do","reviewDescription":"Clean, high speed signal to the monitor. Would buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Cable review","reviewDescription":"Good quality at a reasonable price from Amazon!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Terrible.","reviewDescription":"Stopped working after 2 weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Game System User","reviewDescription":"Stopped working for my PS5 after 5 months. Show’s a black screen when ever I turn my game system on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"This was advertised as a HDMI 2.1, but it is a standard HDMI cable!","reviewDescription":"I was upset, as this was supposed to be an HDMI 2.1 cable, but it was not. It was a regular HDMI cable.Works fine, but not what was expected.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671408000000}
{"reviewTitle":"Doesn't work","reviewDescription":"I had bought the hdmi cable to use with my RTX 3080 and it would just flicker non-stop. Buy something legit and don't waste your time on this stuff.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Cables are very stiff and difficult to route","reviewDescription":"I bought some of these cables.  While I think they are well made they are not particularly suitable in environments where you have to route the cables through turns over a distance.  So I give them two stars for utility.  I ended up buying the Amazon Basics flexible HDMI cable to replace these, and they were much easier to route to my equipment and performed superbly.  Think twice before buying these.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1624406400000}
{"reviewTitle":"WAY too stiff to use","reviewDescription":"These cables seem to work well, but any small box like the Apple TV, Roku, Fire TV, etc. will be lifted off the ground due to how stiff these cables are. I’ve tried to bend and flex them to be more malleable but I couldn’t get them to flex enough to not lift our boxes completely off the surface. The massive PS5 is heavy enough though","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1630540800000}
{"reviewTitle":"HDCP Issues!","reviewDescription":"I just upgraded to the LG C1 OLED and found out this cable is not HDCP compliant! I am having all sorts of issues with my directv stb now.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656720000000}
{"reviewTitle":"Burnt out","reviewDescription":"Didn't last 2 months on my ps5. Just stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Not 4K HDR 120hz","reviewDescription":"Xbox Series X to Samsung QN90A drops signal when full video effects applied.  Verified cable was culprit and connected with Xbox supplied hdmi 2.1 with full results.  Pain is i ran cable through the wall, my mistake for vetting first...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1651104000000}
{"reviewTitle":"Disappointed","reviewDescription":"Connected our laptop to our new Samsung 4K UHD QLED TV at our winter home and the picture from the laptop to the TV is severely degraded.  I purchased the 8K cable thinking the picture couldn’t possibly be degraded from the computer screen. How could that happen?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"great value for the money","reviewDescription":"fast delivery great value for the money.!! they work amazing with excellent performance !!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Very robust cable","reviewDescription":"The cable is very robust and excellent quality build. The one issue I encountered is that it is inflexible. In my application it is connecting the EARC  output of a Samsung QLED 85 to a Sonos ARC sound bar. Due to the limited space at the input of the sound bar the HDMI connector has a tendency to back out of the female receptor. Tried to make a 45 degree bend in the cable however due to its structural rigidity it was impossible to make a tight enough radius. If the cable had a 45 degree connector it would have been beneficial. For straight in application this is a great cable.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Worked for two months","reviewDescription":"I mean when it worked it worked great. I was using it at 4k 120hz with my gaming PC, then turned on my computer today and no image. Swapped the cable with my PS5 HDMI cable and the PC is working fine. Just beware that you get what you pay for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"It worked perfect","reviewDescription":"I don't know a lot about HDMI wires but this one does the job pretty well with my PS5","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Good Product!!","reviewDescription":"I do not think it gives 8k video quality for me but I would say somewhat close to 4k which is still good. I like the product, its rough & tough.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Works great, a little stiff, good labeling","reviewDescription":"I'm using this with a 4k\/60fps monitor, so I can't comment on using it with 8k video.  From what I can tell that should be no problem with this cable.  It's very sturdy, has not given me any problems whatsoever, and is clearly labeled as an 8k cable on both ends.  I just wanted a good, 10 foot HDMI 2.1 cable, and this is it.(Using with an LG monitor and Nvidia GPU.)  There are probably cheaper ones out there, but they are probably not this nice.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1664582400000}
{"reviewTitle":"Quality concern, but good warranty","reviewDescription":"I ordered this product 6 months ago and there is already a bent pin.  I reached out to the sellers regarding warranty and *crickets*.  I’m a little disappointed.Update:  they got back to me and refunded my order… so I bought another cable to give it another go.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683417600000}
{"reviewTitle":"Works Great","reviewDescription":"A cable is just a cable no matter what they say. So main criteria are just that the connectors and cable are of good quality and assembled properly for long lasting results. So not much I can say about the cable other than it works as expected and seems to be well constructed. Working great so no complaints and recommended. If you can find something similar and cheaper that works too. But price was ok for this and is good quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672876800000}
{"reviewTitle":"have not had item long enough to evaluate fairly at this time.","reviewDescription":"A OK!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"eArc HDMI Cable","reviewDescription":"Used for eArc and works Great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Really great HDMI cable","reviewDescription":"This is a really well-built 48 Gbps (8k) HDMI cable for the money spent. Can’t complain, made my 4k HDR TV look better to me, but could be placebo lol.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Great value and product","reviewDescription":"My HDMI cable was 6 years old and the picture on my TV kept going in and out. I purchased this HDMI cable and glad I did. The picture is much clearer and it no longer cuts in and out. I have also purchased two additional cables for my 2 other TV’s with very good results. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Very durable cord.","reviewDescription":"I used this cord to connect a surround sound speaker bar to my TV.  It worked far better than the Bluetooth connection.  I bought two cords because many cords don't hold up well but, This cord was long, well made and I doubt I'll ever need to switch it out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Great Cables!","reviewDescription":"I ordered these cables for an ultra HD 4K application and they perform just as I hoped. No problem transferring data. Can’t beat the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Works great!","reviewDescription":"Had to install this cable for an entertainment center. My installer said he liked the cable, it was flexible and easy to work with.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"8k video? Or just better transfer speed","reviewDescription":"Yes there is small ammounts of 8k content out there in the world, but honestly I just bought it for the transfer speed from Laptop to tv. Display port is better but i'm using an older laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Great Packaging & Performance","reviewDescription":"I don’t write very many positive reviews, but this product was packaged very professionally and appears to be of very high quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great products","reviewDescription":"The cable is great, and the picture is so clear, unlike other HDMI cables I've had before.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Recently bought a new gaming monitor","reviewDescription":"The picture quality is 10 times better on my new gaming monitor with this cable over using the stock ps5 2.1 cable.The ultra high speed cable was worth every penny especially while playing fps games.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"HDMI cable is a good length","reviewDescription":"purchased the HDMI cable and it works. Great length is good just what I needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
