{"reviewTitle":"Nice update with one bad engineering choice","reviewDescription":"My previous iPad was air-2 which I had for 8 years and besides severely shortned battery life and slow browser on heavy pages it was still going strong. So with that retrospective I bought rather cheap basic model. Speed, picture, camera and microphone (I do a lot of video chat) is excellent, battery life is acceptable, noticeably better speakers (comparing to old air 2). 4 points because of one bad decision apple engineers made - power button is fingerprint id. Which works about half the time from first press, half the time from second press and so on. Just plain bad design (smaller area of scanner, button collects dirt). Another thing I thing they wrong is not providing wireless charging, but that’s somewhat expected of nowadays apple…","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Ipad","reviewDescription":"The iPad is in good quality the box that came in was a little questionable but overall the iPad seems to be working no glitches but I would have to keep you posted because I just opened it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"It will shut down on its own, and will not turn on, unless you have a way to plug it in.","reviewDescription":"It works wonderful! Till it gets down till about 48% charge and then it will just shut off. Have to plug it back in for a minute or two and then it will turn back on.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"My third iPad and a considerable step up","reviewDescription":"If this iPad were about $100 cheaper I would eulogize it. I would say the move to usb-c is very welcome. I would say the speed is great and the storage (256GB) more than adequate for most uses. But as it is, I am annoyed at paying $150 for what amounts to a tiny upgrade in memory. Especially considering I can already get a 2TB NVMe drive for less money. But Apple is Apple.What is ridiculous is the lack of provision for the Gen 1 Apple Pencil. One of the big features of this iPad is support for a pencil. You would think they'd provide a charging port for the pencil (which uses Apples proprietary plug\/socket arrangement). But no. Nothing, nada.I had no problems taping the 3 months of Apple TV Plus, so kudos for that one! Yes, I will probably end up as a subscriber for content differentiators such as Slow Horses and Foundation. So a good marketing move from Apple!I am disappointed the screen still has a very significant bezel. I expect the next generation will reduce or eliminate this gaping blackness around the screen. So in other words make it more like an iPhone. But it's still way better than the last generation iPad Mini!In terms of speed and RAM? Well, definitely a step up, but I would hoped to see the M1 chip by now. I would also like to see far more investment in 3D scanning (photogrammetry) but I guess you'll need to step up to Pro and then fork out money for a usable application.Overall the iPad 10th gen feels a bit dated. Lacking in distinguishing features.  Wifi 6 and pencil support is so-so in terms of excitement. Even the max storage is looking extremely stingy at only 256GB. But overall I consider it a good purchase for those of us who are locked in to Apples seductive interoperability and consistent user experience. I certainly would not choose to go back to an Android tablet!","isVerified":true,"ratingScore":4,"reviewReaction":"54 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Replaced wife's Gen 6 iPad (2018)","reviewDescription":"Well, USB-C charging port is different, had to get a USB to USB-C cable for the family charging station. (it did come with its own charger) The home button moved to the top-right edge and yes, this is where you record your finger print.  Works great.  It works with the First-Gen iPencil, not the 2nd Gen.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Fun to use","reviewDescription":"Was difficult to set up as there were no instructions. Had a friend help me with set up, but once working was fun to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Finger print security doesn’t work","reviewDescription":"I love this ipad. However I expected the finger print recognition to work like my previous iphones but alas it does not.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Beautiful screen, size,speedy","reviewDescription":"This replaced my generation 6 and what an improvement. It downloads very fast. Has a beautiful screen and the size is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Great upgrade overall","reviewDescription":"Just upgraded to this iPad from my old 9.7-inch one and was thrilled that it would still be compatible with my 1st-gen Apple Pencil. Well, turns out you need Apple's special USB-C to lightning adapter that's specifically made for Apple Pencils in order to actually get the Pencil to pair; this detail is technically mentioned if you dig into the iPad product details a little, but it's not explicitly mentioned with the rest of the bold-text \"compatible with Apple Pencil!!\" declarations, so it's easy to miss. The off-brand USB-C\/lightning adapters I bought still work for charging the iPad but not for pairing. So just be aware that if you want to be able to use your 1st-gen Pencil, you'll have to fork over another $10 for Apple's specific adapter. It works.Otherwise, the iPad itself is great. I love the larger screen, and the picture quality is fantastic. The process of transferring everything off my old iPad was easy. The battery life maybe isn't quite as good as I was hoping\/expecting, especially if I'm streaming a lot of videos or working with large art files. But I'm excited to see what all I can use it for.","isVerified":true,"ratingScore":4,"reviewReaction":"30 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Cracked screen","reviewDescription":"Cracked screen.  I love my iPad so sad the screen is cracked.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"elegance and sophistication, it is truly beautiful.","reviewDescription":"The 10th generation Apple iPad is a masterpiece of modern technology, a perfect fusion of power, style and versatility. Since I started using it, it has revolutionized the way I work and connect.The first thing that blew me away was its stunning 10.9-inch Liquid Retina display. The images are so sharp and the colors so vibrant that every viewing is an experience in itself. Whether watching movies, editing photos or simply browsing the web, the quality of the screen makes every activity more enjoyable.At the heart of the iPad is the A14 Bionic chip, which delivers exceptional speed and performance. The efficiency of this chip is evident in everything I do, from effortless multitasking to the smooth operation of demanding apps and games. It's an incredibly powerful work tool that handles all my computing needs with ease.The Wi-Fi 6 connectivity is another outstanding feature, providing a fast and reliable internet connection. This is essential for my workflow and entertainment, ensuring I am always connected with the best possible speed.The 12MP cameras, both front and rear, are surprisingly good for a device in its class. Video conferencing is clearer and the photos I take are of great quality, making it a versatile tool for communication and content creation.The Security and convenience are guaranteed with Touch ID. It's fast, reliable and adds a hassle-free layer of protection. And, of course, the battery life is phenomenal. I can go all day using it without worrying about recharging it, which is a huge relief in my busy daily life.Lastly, the blue color design is simply beautiful. It's sleek, modern and stands out among other devices, adding a touch of personal style to my iPad experience.In summary, the 10th generation Apple iPad is an exceptional device that combines power, beauty and versatility. It's more than a tablet; it's a daily companion that enriches every aspect of my digital life.","isVerified":true,"ratingScore":5,"reviewReaction":"86 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Beautiful and fun!","reviewDescription":"Perfect for my sketching 💕 I love the pink color! The battery lasts forever and using it is so smooth.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Wonderful!","reviewDescription":"This IPad, with all the latest updates, is wonderful. It is a great size of 10.9\", lightweight, and exceptionally fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Apple iPad (10th Generation)","reviewDescription":"Received the iPad quickly and was easy to setup. It is replacing an 11 year old iPad dinosaur. And, the price was very good. The display is awesome and touch screen very responsive. 64 GB is plenty for my needs. It has both Touch ID and login pass code. The Touch ID works better than I expected. No facial recognition. Interesting that, to me, the volume bottoms are kind of reversed with the reduce volume on top and increase volume on the bottom. I've set up my news apps on the iPad for my morning coffee break. Much easier display than peering at the news on my iPhone 14. Glad I upgraded.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"worth buying","reviewDescription":"I recently purchased an iPad 10th gen and couldn't be happier! The user-friendly interface makes it a breeze to navigate, and the touchscreen controls are incredibly responsive. Setting it up was a seamless process, and the wide range of available apps enhances its versatility. The type c charger makes it more accessible as my household runs mostly on Samsung products. Overall, a fantastic purchase for its ease of use and enjoyable functionality!","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Great iPad","reviewDescription":"I am an Apple fan and this is just another great product.  I like everything about it and it meets all of my expectations.  I got the blue one for something different and I also like the color.  The only thing I don't really understand is how Apple is mixing and matching the different generations of pencils with the different iPad types.  Seems like with the Gen 1, Gen 2 and USB they want to be sure that it isn't easy to switch iPads.  But I guess that is part of the marketing plan.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Best iPad on a budget or if you are looking to upgrade!","reviewDescription":"I had the iPad 7th generation iPad I really wanted to upgrade. Did I really upgrade! I love the 10th gen! I am still getting used to all the new features. I am actually writing this review on the keyboard. I feel sometimes that is is a laptop. I didn’t want to spend $100-200 on the Magic Keyboard in stead I spent around $20 same goes for the Apple Pencil I did not want to spend $115 on a pencil! This pencil was $15 it is my favorite color and also glittery! You just tap on the top of the pencil to connect it. The keyboard case comes off as well. I also got this iPad when it was on sale and man am I glad I waited!! I got the pink one so if you are thinking about getting a new iPad get this one on amazon I also gave my boyfriend my old iPad for school and he got a pen and keyboard case as well! LOVEEEEEEEEE just wish it came in purple but pink also works :) Thank you amazon","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Amazing!","reviewDescription":"I bought the 10.9 inch Apple iPad because the 10.2 inch $249 iPad used the lightning connector. I already have a lot of USB-C stuff so my main reason for picking this device was to limit the number of connectors I had to keep track of.I chose yellow because it was the cheapest option (about $399 at the time I purchased it) but the metallic finish makes it appear more like gold to me. I am neither a color nor a precious metals expert, but if you told me the color of this iPad was supposed to be gold I would believe it (and I love it).Very pleased with the overnight shipping option. I ordered it fairly late last night and it arrived before noon the next morning.Ordered a $17 case that will be arriving tomorrow. This is my first brand-new tablet that I have ever owned (not including stuff like Kindles and other cheapy tablets I've tried that I all promptly returned because either their performance was not a good fit, it did not meet my needs or was riddled with involuntary ads). Previously I went with a used Samsung tablet back in 2015 that lasted for maybe 2 years before it became a brick and stopped turning on. I spent an hour on the phone with Samsung asking where to ship it to get it fixed. Samsung was not willing to repair it at all even though I was willing to pay for the repairs. I will never purchase another Samsung anything after that experience- they don't stand behind their own products.I've only owned this thing for a few minutes but I'm quite satisfied with it. I thought this package would include the Apple pencil, but alas, it did not.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"New to Apple","reviewDescription":"Ok, so I bought this for the sake of digital drawing and editing my own drawings. I've only had this tablet for a short while but it's already leagues above previous tablets I've owned. I don't know much about Apple operating systems but once I had the tablet up and running and downloaded my favorite drawing apps such as Sketchbook this tablet impressed me so much. This is exactly what I was looking for regarding my art projects. So far very happy my purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Great device for the cheapest price!","reviewDescription":"Got this IPad 10th gen on sale for $349. Only 64gb’s. But I was fine with that. It is my first iPad in years. So figured why not. Amazon had the cheapest price anywhere. So scooped up the deal while I could.  Thing is fast, slim, and battery lasts SO LONG. Speakers are loud and sound is full. Screen isn’t fused to the digitizer like the Air model. But I can’t really tell!  So don’t let that deter you from this model!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Ipad 10 generation issue and Seller solution.","reviewDescription":"Pros:1. Visual pleasing to the eyes.2. Comes in different colors. Pink was my pick.3. Processor runs smoothly.4. Siri runs smoothly and fast.5. Folders allow apps to be organized.6. Apple pen 1 works excellent with the 10 generation.7. FaceTime crisp and clear.8. WiFi and Bluetooth connects quickly,9. Apple gives 3 months free trial on their tv and etc.Major Cons:1. Hardware issue with on and off button on the iPad gen 10. I did research after my IPad would not turn off. Research said it was a known hardware issue in Gen 10. However, Siri will turn off for you if you tell her.2. This company will not exchange the IPad, only accept returns minus the tax paid.My intake from interaction with this seller:The seller only offered a return, no exchange allowed.  Seller only gives back the computer cost and not the tax paid for iPad. Seller raised cost for pink iPad by 20 dollars on Amazon website. To send back and wait for refund  takes up to seven business days. Cost to send back and rebuy would cost would increase due to iPad color price increase, the loss of tax already paid, and the added new tax fee for new iPad. I added up the addition cost. It would be close to 100.00 for the same color and specs. So, the only choice I’m left with is to be stuck with the IPad unless I want to pay out around another 100.00 more after waiting for refund, then buy a new one, and wait for its delivery. That would put wait time about 1.5 weeks for a new computer to be delivered. That is a long wait when it is needed like yesterday.My only other solution:Contact Apple limited warranty to see if they will back up their Apple product and their solution.Lesson learned:Purchase iPad directly from Apple website. Cost is the same. Apple website offers an optional free engraving on their Ipad 10 generation.  The wait to receive Ipad is about a week.I hope my review will help others when deciding what is best for them and their decision on Ipad purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"73 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Made out of eggshells","reviewDescription":"Slippery device, placed device down on coffee table after removing from box, during set up device slipped from about 1-1.5 ft off ground onto carpet and screen cracked on several places.  A product this expensive should come with a protective case and glass from manufacturer.  Not optional aftermarket accessories.  Certainly optional aftermarket accessories for sale is fine, but Apple should provide a basic case or build the device to where so much as a sneeze and kiss several hundred $ away.  $50 fee if purchased apple care plan.  Very dissatisfied that electronic devices are now costing $1k and as fragile as a new born’s head.  Unacceptable that Apple essentially leaves consumers no choice but to purchase either Apple to Apple compatible devices and\/or screen protectors, cases, and\/or adapters for headphones or C-type charger.  Dislike the button for finger verification, not preferred over traditional button or facial recognition.  What’s the point of any of this if the product is made to break.  Hmmm seems dishonest and deceitful.  Apple cannot hide behind there stance on sleek design to circumvent strong durable materials that adequately protect device.  Everyone knows it is always wise to have extra protection on their devices as most likely at some point you dropped your device prior to.  I always get the strongest otter box or military grade cases.  But that’s because I know I’m going to drop my phone it’s just a matter of time","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"Beware- restocking fee charged when defective item sold","reviewDescription":"I purchased an iPad from this seller and less than 2 weeks the iPad stopped working. It's the black screen of death from my understanding. The iPad is on but completely black. When I plug in the charger I hear the connection sound so I know it's on but the screen will not turn on. I took videos of it. I've notified the seller of this issue but no response at all to my message but instead approved my return but did not message or notify me of the restocking fee. 2 weeks after I sent in my return I finally get a refund but minus $86 of restocking fee!! I had to reach out to Amazon for this issue and that is when Amazon notified me of the restocking fee. Amazon was not able to refund me to my original payment but offered an Amazon credit which I appreciate. But I am still very dissatisfied with the seller.After my return was approved, I went ahead and ordered another iPad with the same seller. If I knew this seller charges restocking fee on defective items, I would not have purchased another iPad from them. I definitely will not be purchasing another item from them with how unprofessional they are.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Not user friendly","reviewDescription":"I bought this for my daughter to use, but it is impossible to set up for a child with parental controls unless you also have another Apple product. I can't load or install any apps for her to use, because they must be approved by an adult, but those approvals MUST come from an Apple device, not Android, Microsoft, or even web-based portals are allowed. This effectively means that my daughter cannot download any apps unless I give her unrestricted use of my credit card. Haha, no.I will never buy another Apple product as long as I live.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Doesn't work and unable to return","reviewDescription":"Unless you are an expert in Apple products, I recommend not buying this from Amazon.  This product is difficult to set up.  Support from Amazon referred us to Apple support which was unable to help us.  I tried to return it and it was within the return window but the system would not allow me to return it.  I can find no way to talk to a real person about this issue.  Took it to an Apple store and was told that if we had purchased it from them, they would have set it up for us.  So, if you want this product and are not an expert at Apple products, buy it from an Apple store.  Now we are stuck with a tablet that doesn't work!","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Storage too small, Return difficult","reviewDescription":"Ordered this ipad to replace an existing one and memory was way too small, only slightly bigger than the operating system.  Returning for one with more storage.Amazon return required to take to a limited location, 40 minute drive from my house.  When we arrived at 9am (when they opened) there was a line of people waiting for the return office to open.  After 30m minutes of waiting, I needed to leave.  Big waste of time and the package still hasn’t been delivered. So much for Prime service and easy returns.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Disappointed !","reviewDescription":"A week after they delivered it and it no longer charges or turns on. I already followed the “instructions” in the seller's videos to restart or try to turn it on and it doesn't work. I tried to chat with customer service and there is no availability! This is frustating ! I just need to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Quit charging","reviewDescription":"I just purchased this one year ago and now it won’t charge. I have followed all the trouble shooting recommendations and still doesn’t charge. I took good care of it.  It is so upsetting as I expected it to work for longer than a year.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Is not compatible with the latest iOS backups.","reviewDescription":"Having trouble setting it up.  It says backups iOS 17.1.2 and 17.1.1 are required but they are not compatible with this version (IOS 16.6) on this iPad.  I’m incredibly disappointed.  It won’t let me any farther than that page.  I guess I’ll be returning both of them that I had intended as Christmas gifts for my grandchildren.  Unless one of you knows how to work around it.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Gray line through screen","reviewDescription":"This was a Christmas gift for my daughter once open & she turned it on she immediately noticed a gray line through the screen no signs of a defect other than the line. The screen is intact however im disappointed with Amazon & the return process! Now to wait for my refund just to order another one again my little girl would like to have her gift not wait 14-30 days","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"DO NOT BUY THIS IPAD-IT IS A WASTE OF YOUR TIME & MONEY","reviewDescription":"At first glance this Ipad seemed perfect, however, it will not pair with either apple pencil. Even if you purchase the adapter. I spent a week trying everything I possibly could to get the two items to pair and they will not. It has damaged how I feel about Apple products.  I've wasted my money and my time with this. Please do not make the same mistake as me.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1669939200000}
{"reviewTitle":"Would not connect","reviewDescription":"This tablet would not connect with my Samsung phone.  Had to return it.  It took weeks to get a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Not compatible with Apple Pencil 2nd generation","reviewDescription":"I just spent over $500 purchasing this ipad and the Apple Pencil 2nd generation. The two (latest versions) are not compatible. In order to use an Apple Pencil with this iPad, I will have to purchase the 1st generation pencil (which doesn’t have the convenient magnetic charging feature) AND additional products to connect the iPad to the older version of the pencil. Why make your products incompatible with each other?","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"Piece of crap (pardon my English).","reviewDescription":"Haven't been able to use. It keeps telling me it's locked retry in 8 hours.  Typical of Apple playing games.  Feel sorry for everyone using Apple products having to  play these games.  Waste of my money and time.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Disappointed","reviewDescription":"I really wanted to love this IPadIt was perfect exceptI could not get the software to download after several long attempts.I was very disappointed and had to return!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"QUICK START WON'T WORK - NO TECH SUPPORT AVAILABLE","reviewDescription":"I own three other Apple devices. Quick start won't work and there are NO phone or human support agents available. Major fail, Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Garbage","reviewDescription":"This is supposed to be compatible with the apple pencil gen 1 but this and pencil font come with a small adapter that is necessary and it is also impossible to get the adapter. I will never buy an apple product again and never use this seller again. If I were you I would also avoid both.  I'm done with both Apple and Amazon. Hello Samsung.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"Don’t purchase it","reviewDescription":"I had gotten this iPad during the prime day sale first to start the box of the actual iPad was damaged then as I’m setting it up it has emojis in the recents. Oh and the best part is one of the speakers didn’t work… very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Worse","reviewDescription":"Slow","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Previously open box one w\/o original plastic wrap","reviewDescription":"Ordered and paid for a new iPad but there was no seal on the box or iPad upon arrival and it was clearly used and not new as described. This was suppose to be a gift. Disappointed and returning","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Be careful of what u getting","reviewDescription":"My iPad stoped charging after a couple daysAnd my sister iPad button are jammed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Not happy","reviewDescription":"Bought two new iPads and received two used ones.  Enough said 🤔😑","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Failure to first present the item as use","reviewDescription":"I was excited to find the item and the the item initially when viewed was not listed as use. This was only recognized after the item was purchased and ready to be shipped, it was then clearly marked as used. I consider that poor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Received a damaged iPad","reviewDescription":"Bought a new one and received a damaged, very likely refurbished, iPad. Returned it and got my refund. The process is very slow, I needed the iPad for school and had to wait to long to get my money back, also had to reschedule two times the pickup because UPS wouldn’t show.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Was send a refurbished iPad","reviewDescription":"I ordered a new iPad and was sent a refurbished one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Defective iPad","reviewDescription":"The iPad didn’t even turn on. Turned on in the beginning so now I have all my info on it and now it won’t turn back on so I can wipe it to return it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Didn't connect","reviewDescription":"I received this and went through the set up program. Once it was done it wouldn't connect to the wifi. I tried resetting it up, I followed all the troubleshooting information on the internet. I know it wasn't my modem because everything else works fine. I finally sent it back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Used iPad…not new","reviewDescription":"I ordered this iPad to replace my old one. I opened this today and the back is scratched and the screen was covered with fingerprints. The inside of the box is dirty and looks like coffee was spilled inside. The plug adapter was inside but no charger cord. I’m very upset with this iPad and feel I did not get the brand new iPad I ordered. I have not been able to charge it yet since no cord was included. I just hope it works!","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1671148800000}
{"reviewTitle":"MAKE SURE IT IS NOT FROM A THIRD PARTY SELLER","reviewDescription":"Apple only guarantees authentic products from AMAZON. I purchased two iPads from the Amazon Apple store front and this one shipped via a third party. I immediately called Apple to ask and was told it has to be sold by Amazon, if you contact the seller ask if they can show they’re authorized Apple resellers, otherwise you don’t know what you’re getting.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"not yellow","reviewDescription":"Really wish I would have looked at the reviews before purchasing.  It really is an ugly gold color not the light yellow shown in the picture.  Very disappointed since yellow is my favorite color and I was so excited for this.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"It worked GREAT, until it didn't.","reviewDescription":"I purchased this iPad on August 10, 2023. I am studying Radiography and am required to have an iPad with the HanDBase application for clinical tracking. If I don't have an iPad with the HanDBase app when I show up for clinical rotations I will be sent home and receive an absence. This is not good - anyone in school for the medical field will say that these programs are strict. So, I did the responsible thing and purchased a NEW, 10th GEN iPad. And it has been great for almost six months. Today I noticed it didn't charge when I plugged it in. I tried other outlets and other charge cords\/blocks to no avail. I did all the troubleshooting - restart, hard restart, reset the entire device. It IS covered under a basic one-year warranty so I've made an appointment to get it fixed on Monday - but I have no idea how long the repair will take and need it by Thursday at 8 am. I'm so disappointed and frustrated. I've kept it in a case, and never let it get anywhere near moisture; I've always taken good care of it and this is unacceptable - a product like this should last longer than six months. What are my options now? Buy ANOTHER iPad? Ridiculous. Get an unexcused absence because of a faulty charging port? More ridiculous.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Charging issues","reviewDescription":"After 1 week of having this iPad , it’s a struggle to charge … It’s like the iPad itself has a shortage? I’ve used different chargers & the issue persists! I’ve used my charger on other iPads & no problem, they charge just fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Just finance an iPad Pro","reviewDescription":"The hertz rating is really low so you will notice blurring when you scroll. The front facing camera is terrible. Just get an iPad Pro.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Expensive","reviewDescription":"It's good Apple tablet but they ask more than 400$ for this while there is no face id, headphones port and USB-C headphones connector is a disgrace.  The price for this device should be way smaller due to missing key features.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"little difference to older versions and design flaws","reviewDescription":"Why, anywhere, if apple has the tech to make bluetooth pencils, would they not and make a machine which took three steps back to have you plug it in.I had an older pro, that works as fast and the same as this \"new technology\" and at the least h pencil clipped to the side of it magnetically, and charged via bluetooth.I am trading it in.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Not yellow","reviewDescription":"I bought this iPad thinking it’ll be yellow but it was gold and looked ugly to me but fast shipping and easy returns!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Can't stay connected to wifi","reviewDescription":"Was all excited for a tablet, but I end up having to use my 5 year old a6ndroid phone to get on the same wifi bc it connects more reliably than this brand new iPad. Incredibly disappointed. Spent hours with support, on the phone & at geek squad, reinstalling the OS & other hopefully fixes. Finally gave up on that & their 2 week return window was over. Not sure if they're all this bad or I got a lemon. So much for Apple being more user friendly.It's good when it works, but I spend WAY too much time watching the loading wheel spin. I switch to my phone all the time. Super frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1685145600000}
{"reviewTitle":"Touch Screen is a problem","reviewDescription":"In most instances, I have to touch the screen several times for it to respond. Annoying and time consuming.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"I don’t recommend","reviewDescription":"The 10th generation ipad is nothing to write home about. And there is a design issue right out of the gate. I set up three Mail accounts, and none of them show folders (i.e., mailboxes). You can move a message\/email to a folder (and see the folders in the Move subwindow), but you cannot see or access the folders (or mailboxes) in any of the  Mail accounts. This appears to be a design flaw, as Apple support cannot address, and none of the support forums can fix. While I’m on the subject of Apple bugs, Apple has been problematic for years now. My last ipad had a defective battery (overheated and went to black screen, even after factory reset) in less than 2 years. I nicknamed the MacBook Air the “crashy trashy MacBook Air” because it crashes if you attempt to do any serious work on it in Excel or Creative Suite. They’re making playthings for kids, and all their products are overpriced. The design is not intuitive, and they haven’t put out a great product for years.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672185600000}
{"reviewTitle":"Its okay","reviewDescription":"Good enough space but gets too warm. Also with the price could have thrown in headphones or pencil. Not even a screen protector. Apple use to be better.  Most companies does. Driver Plop my package down. I heard it from second story thats a amazon issue, but the packaging doesn't really keep product safe. No flashlight and the camera is horrible sorry my phone take better photos. For the price for this camera should be better $100 backup phone camera is better.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"Yes","reviewDescription":"Was a Christmas present for my wife, she loves it so there","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Very Nice","reviewDescription":"Purchased as my older one the battery was dying,  same nothing new but very nice","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"It's an iPad alright.","reviewDescription":"Solid all around. A little pricey for only 64gb and the adapter for the apple pencil is kinda annoying","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1669161600000}
{"reviewTitle":"Meh","reviewDescription":"Works well but not a vibrant display for pictures and videos. Otherwise gets the job done.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"iPad 10","reviewDescription":"Nice tablet, worth the very high cost","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"Excellent I","reviewDescription":"Excellent in every way.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Nice Tablet","reviewDescription":"Love everything but the battery life it should be a lot better","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Headphone Jack","reviewDescription":"This iPad is wonderful. for all the people talking about not having a jack for the headphones. it is very simple buy a headphone jack adapter. they are cheap and they plug into the iPad and then into your headphones.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Takes two hands to operate: retrogression!","reviewDescription":"As a long time ipad user, I have greatly enjoyed using various models up to now. This 10th generation requires two hands to operate yet all other versions did not.  That is not improving the product.  The next version should overcome this newly developed flaw.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Gold, not Yellow","reviewDescription":"I picked the yellow color thinking that it was the same cheerful yellow color as the iPhone 14. It instead is more similar in color to the gold iPhone 14 Pro. I don’t think that I would’ve chosen this color if I realized that prior. It’s not a big enough issue to return it. This iPad seems similar to my old iPad 9th generation in that its familiar (a positive for me).","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"the advertising was not right .","reviewDescription":"i like the ipad. but it was advertlised with the pen and folio.it did not come with themhow can we get them we thouth we had paid for them","isVerified":false,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"ARRIVED QUICKLY","reviewDescription":"Impressed with quick delivery BUT! it was delivered to garage door front with a big sign that says \"DO NOT LEAVE ANYTHING HERE! THE SECURE COVERED FRONT PORCH IS JUST AROUND THE CORNER. PLEASE TAKE ALL DELIV...\"ALSO, THIS UNIT IS CLEARLY ADVERTISED WITH AN 'APPLE PENCIL' & 'MAGIC KEYBOARD'! Imagine my surprise & embarrassment when my wife opened her gift... no pencil or keyboard! Now I guess I'll need to pony up the $ for those. You DO NOT see where it says SOLD SEPARATELY until you reach 3\/4 + down the page! NOT a good trick!","isVerified":false,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Very different","reviewDescription":"I recently got into the Apple ecosystem and over Christmas. I discovered a fantastic deal on an iPad 9th GEN with 256 GB of storage and I purchased it. I kept it for approximately a month before returning it. I simply was having to force myself to use it, and was not happy Later, I could not resist buying a 10th gen and trying it thinking it would be returned as well, but in all honesty it is a completely different world for what I use it for which is mostly enjoyment and media, even at 64 GB which I truthfully, believe should not be the base model 128 should be  it is outstanding and I now use it every day for everything seems like","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"Incredible screen clarity. Great price and value.","reviewDescription":"Incredible screen clarity. Great price and value. Works seamlessly with other Apple devices in \"sync\", etc.Perfect size. I have the largest earlier generation IPad and with a fold case is very bulky and heavy. Fine for desktop or table top but not for more portable uses, in bed movie watching with bluetooth earbuds, etc.Only suggestion is to get the most memory that one can afford.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"Posible problema","reviewDescription":"No sé si eso sea normal pero según entiendo tiene 4 bocinas o yo estoy mal, porque escucho solo una de cada lado","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"My iPad is great.","reviewDescription":"I was blindsided about the charging cord having a different tip than my others, but not impossible to get a longer cord for every day usage.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Love it… don’t need to use the pc to get mail etc… easy to navigate…","reviewDescription":"Learning the way to navigate without button… but Apple has amazing instructions for all they sell online.  Apple is always high in price..  especially at their own website.. good purchase at Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Beautiful!!","reviewDescription":"Love this iPad!! The color is vibrant and the features are amazing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"La mejor forma de escuchar Apple Music","reviewDescription":"Lo compre con la intension de usarlo como un streamer para el servicio lossless de Apple Music y me brinda la calidad de audio que yo esperaba, ya sea con audifonos conectados por un dongle DAC o conectado a un sistema de audio.La pantalla con una imagen vivida y sumamente agradable a la vista , funciona al tacto de manera rapida y fluida.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Love this great Apple IPad!","reviewDescription":"I love the size, 256 mg of storage and ease of use!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Perfect size for my wife","reviewDescription":"Got it for her to use Kindle.  Have had no issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"The yellow is beautiful.","reviewDescription":"It’s an iPad 10 th generation. I picked the yellow which is more like a metallic yellow, it’s beautiful. Love it. Great price. Get the accident insurance.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great Upgrade","reviewDescription":"My husband had an old IPad that had outlived it's better days.  He was so pleased to get this on Christmas.  He was so excited that he passed the tour.  Note of caution, the new IPad has numerous upgrades including how you move from page to page.  Please go through the tour and save yourself some headaches.  The IPad has a very nice screen with clear graphics and is very quick.  He uses the IPad mainly for Youtube, instagram, a few games, and surfing the web.  He is very satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Me encanta","reviewDescription":"Excelente tableta, es mi primer iPad y estoy encantado. 100% recomendada a todos!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Very good device for the mony","reviewDescription":"Easy to set up and great improvement from my old 2016 ipad…😁","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Short power cord","reviewDescription":"This comes with a short power cord.  I’ll need to buy an additional power cord unless I set a table at the wall where the outlet is located.  The picture is very clear and bright which is a good thing for an elderly person.  The jack for earbuds is 3.5 which means another extra purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Get the air…","reviewDescription":"If you are a student like me, you want the Ipad Air. The compatibility with the apple pencils sucks. All I wanted was to use the newest apple pencil because it has every feature I need. ALAS. This Ipad is not compatible with it. Otherwise, I’m happy with the device.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"I expected to do more with 64 g","reviewDescription":"I’m disappointed in that I can’t load a lot of my favorite apps. I should have gotten more memory.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Battery Life C-","reviewDescription":"The graphics are wonderful, and the speaker is much improved. The battery life, however is pretty dismal.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"What it does not come with","reviewDescription":"What it does not have is a headphone jack. Big bummer!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"My review isn’t fair","reviewDescription":"This is a stripped down version of the iPad Air 4th generation. And as an owner of one of those, this iPad seems a tad insufficient.Besides that, if you don’t judge it by my standards, this model is very well made ( as almost every other Apple product). I like it.In my opinion, the price should be lower. I waited until Black Friday \/ Christmas sales for its price to be lowered.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Hope there are better functions for reading","reviewDescription":"I bought it for reading my papers, but it’s not easy to get the files from my pc and there isn’t a good and free pdf reader compatible with iPad. Same with not taker app. Hope they can do something to it, don’t wanna spend extra given the price of iPad itself.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"It’s decent","reviewDescription":"Product worked well overall I had to send mines back due to the mic not working during cell phone calls","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"II pad","reviewDescription":"Experienced  difficulties with Apple ID and downloading certain apps. Working on it…not sure if I would recommend this product. Thank you.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Ipad","reviewDescription":"Great product was just delivered to wrong address","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Used","reviewDescription":"Item was supposed to be NEW. I received an open box missing the charging cable and the 20w charging adapter. Not happy. Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"The iPad gets so hot it won’t charge.","reviewDescription":"I bought the new 2022 iPad 10.9 inch, 10th generation. It gets very hot after about an hour use. The battery doesn’t last very long at all. When it’s charging while you are using it a note comes on the screen that says it will resume charging when the iPad cools down. I had it 35 days before I contacted the seller about an exchange. I had Covid and surgery within the 30 day window to return it. I’m 74 years old and have not abused it. I don’t plan on buying  another iPad. I don’t know what to do about the one I have.","isVerified":true,"ratingScore":1,"reviewReaction":"29 people found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"Battery not what is claimed.","reviewDescription":"This iPad claimed to have all day battery life.Not so I’ve been on it 20 minutes and it’s below 89%.no way near what they claim.I wouldn’t buy this again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Dies in 5 Minutes","reviewDescription":"I love how it dies immediately and has no battery power. Im trying to run a business. What a LET DOWN.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Do not buy!","reviewDescription":"Does not hold battery life.  Does not power down in order to try to.  Very unhappy I purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"It always freezes.","reviewDescription":"The ipad has not been back for two months and always has an automatic black screen. Very disappored","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Doesn't support the second gen Apple Pencil","reviewDescription":"I believe this is the worst idea to come out of Apple in decades. A prime example of having a production guy in charge of a innovative tech company. This new iPad DOES NOT support the 2nd gen version of the Apple Pencil. That means you need to go out and buy old tech from 2015. You know the one with a dongle that attaches via the usb c port. And get this, the 1st gen pencil is actually more expensive to buy than the 2nd gen. Absolutely ridiculous. I recommend going with the Air4 or pro versions.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Stopped working and I only had it for a couple of weeks!!!","reviewDescription":"I am not satisfied with this purchase and I am very upset that I missed my return window by one day. My FaceTime isn’t working, no one can hear or see me. My apps freeze and the iPad moves slow from time to time out of no where. I tried simple fixes like uninstalling and installing apps, restarting my iPad countless times, and etc. Not happy at all that I paid over $400 for a device that I can’t even FaceTime and communicate with.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"It’s was crack","reviewDescription":"I will never order again  I wish I didn’t have to give a star ⭐️","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Don’t work wright","reviewDescription":"It just not wright it really sucks I think it’s so cheap made it just don’t work wright like to send back","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"does not work","reviewDescription":"Tablet does not work.  You have to have a pass code.  Need to send it back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Don't buy through amazon","reviewDescription":"Shuts on and off for no reason.  Clearly was used before I bought it but says it's brand new.  Go straight to Apple or Best Buy to purchase this.  I got my daughter one from Best Buy and it's perfect!","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"yellow ipad","reviewDescription":"i’ve purchased two previously worked perfectly but this one powered on but wouldn’t work beyond the apple screen for a week we tried to troubleshoot and never came up had to return","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Ipad is 2mths old and went black and will not turn on","reviewDescription":"Ipad is 2mths old and went black and will not turn on, please replace","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Not new","reviewDescription":"Ordered and paid for a new iPad but there was no seal on the box or iPad upon arrival and it was clearly used and not new as described. This was suppose to be a gift. Disappointed and returning","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Does not charge at all!!!","reviewDescription":"All of my devices are Apple so I thought this would be awesome to get the iPad here on Amazon. A better price. So that was the main reason, because I use Amazon for everything.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"Does NOT accept data plan. Only WiFi","reviewDescription":"Went to add a data plan and it doesn’t have a place for a SIM card. No internal one either","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Not working properly will not turn on","reviewDescription":"Not working properly","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Unhappy","reviewDescription":"I charged the iPad overnight.It didn’t charge.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Won’t charge","reviewDescription":"Stopped working 6 weeks later at the Apple Store now","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Love it","reviewDescription":"Love this iPad! I purchased this for my daughter's birthday! Works as it should!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"iPad 10","reviewDescription":"I loved it I just received it it came earlier than the delivery date it was supposed to get delivered the 14 but came the 13 I just was worried about what if it came broken or lost but my experience with this owner I will recommend my family and friends as well and for the price excellent service,condition","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Hit This One Out of the Park!","reviewDescription":"The Mrs. had some experience using a friend's iPad last summer and came away from the interaction raving about it, so Santa made a note of that and slid down the chimney with a Gen 10 iPad on Christmas Eve. Needless to say, Santa achieved instant hero status for that. He also dropped off an iPen to use with it, and a \"for Dummies\" manual on the Gen 10 iPad.So far, she's been very well pleased with the Gen 10. She's been reading the manual and discovering\/using more of its functionality every day. It's largely taken over the job that her Kindle Fire tablet held, that being a repository and reading implement for her many, many Kindle-format e-books. She reports that the included apps are easy to access and use, and is planning some \"face time\" calls to her friend in the days to come.Santa nods in approval - he likes being a hero now and then.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Excelente compra","reviewDescription":"Eras para mi hija, y llegó exactamente cómo las indicaciones!! 100% Recomendado. Trabaja excelentemente,,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Perfect","reviewDescription":"The best tablet I’ve ever owned. Don't bother with the 64GB unit though, it’s nowhere near enough space for most. If you plan to use this for serious work or gaming, the 256GB model is the way to go. So far this has replaced both my previous tablet and my laptop. Battery lasts all day and the performance is incredibly fast for everything I’ve throw at it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"$100.00 less that Apple's Price. New, sealed","reviewDescription":"Perfect purchase  $100.00 less that Apple's  Price. I thought it might be a repack, or re furbished . NO Worries, Factory sealed product  1 yr warranty","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Works really well, I love it","reviewDescription":"This iPad works really well i also bought a apple Pencil to go with it ,i bought the gen 1 Pencil and it works really well with it 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Purchase as a gift","reviewDescription":"I purchased this for a family member, and I set it up for them. The product is very nice. I like the feel and the speed of this particular iPad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Love my new iPad","reviewDescription":"I ordered this iPad for myself for Christmas to replace a 4 year old model.  I couldn’t be more pleased with my new iPad.  I also ordered it with the Apple iPad keyboard which I also love.  It was very easy to set up - I just set my iPhone 13 mini next to the iPad when it was setting itself up and it transferred all of my apps and other information to the new iPad.  Of course I did have to do some of the setup myself but it was relatively easy with low stress.  I love my new iPad!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Apple iPad (10th Generation)","reviewDescription":"I was going to go with generation 9, but I'm glad I upgraded to gen 10 since it was on sale for 307, not it's 429 w\/o cellular.I am really enjoying it.One thing I do wish is that I got the one that comes with cellular.I wonder if cellular can be added after purchase.?.?","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Battery died","reviewDescription":"Received my new 10th generation iPad on May 31, 2023. The battery died on Aug 7, 2023. Last date to return was June 15, 2023.I now own a dead worthless iPad which is the reason I bought this to begin with. However, that dead one lasted 5 years!!!  There seems to be no way to tell if you’re going to get a lemon! I’m soooo PISSED!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Not satisfied at all👎🏾","reviewDescription":"Love the color! However, while I did order it Used: Acceptable. I wasn't expecting that big patch of missing color, it definitely ruins the appearance of the ipad. I also ordered it to have cellular connectivity abilities, but I see no slot to put a SIM card in. I will be sending this back!","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"need to inform buyers that there are some online activity that cannot be done with ipads","reviewDescription":"Disliked the fact that some facebook games cannot be played with ipad and some prescription medicines cannot be ordered with ipad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Broke after 2 months","reviewDescription":"I bought this iPad a few months ago to help study for the bar exam. I immediately put the iPad in a protective case and it has never been dropped, shocked, wet, etc. Yesterday, the iPad would not respond to my finger at all.I am currently messaging with Apple support, who also appear to be unresponsive.All in all, probably not a great purchase unless you making trips to the Apple store and spending weeks without it while they fix or replace it is fun for you.Cheers","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"Disappointed in battery life","reviewDescription":"While the battery life isn’t as promised I will say it charges super fast. The speed of processing information is superb. This is a replacement for an iPad I’d had since 2017. So there are many great improvements but tge battery life is annoying. I am keeping the brightness of the screen low to conserve batt life and that negates the much improved screen.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1676505600000}
{"reviewTitle":"Apple went out of their way to make this lower quality","reviewDescription":"I got the 256 gig version and it is not worth the money. The speakers have a tinny sound and the iPad itself does not seem as premium quality as the ninth generation. I say buy the 9th generation and don’t even look at this model. It is ridiculous. I don’t know what Apple designers were thinking with this model. I feel they went out of their way to completely separate this model  from the iPad Air, because both of them look like.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1673481600000}
{"reviewTitle":"Box dirty no plastic wrap","reviewDescription":"I purchased for a Christmas gift, not sure if new because the box is dirty with smudges.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Bulky","reviewDescription":"Too bulky no lock to hold back","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Second Life","reviewDescription":"I thought this was new. Is it refurbished?  I did not know it wasn’t new","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Poor Redesign!","reviewDescription":"It just doesn’t feel right. Buttons in wrong place. It is just uncomfortable to use compared to other iPads that I have OWNED.I should have returned it while I could.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Not seeing much difference","reviewDescription":"Replaced a 4th generation and just not seeing much difference. Still love the product.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1682640000000}
{"reviewTitle":"New 10 generation ipad","reviewDescription":"Love my iPad. But the sound fades low to high during play back of videos. The sound during FT is muffled to the listener. Does anyone else have this issue. I’ve only had it 3 weeks. Note: The speakers are not covered!!","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"Great investment","reviewDescription":"I know this iPad is not the most loved Apple products but my mother and I love it and have had little to no issues with it overall great purchase","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673913600000}
{"reviewTitle":"Cool Ipad","reviewDescription":"Loads of memory and fast. Only draw back is the Apple Pencil doesn't pair to it...","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"My kid love it","reviewDescription":"More pricy than Samsung, but less technology applies to it. The pen is not an innovation, regarding charging and pen holding, pairing.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"good","reviewDescription":"oldest enjoying it so no complaints","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"It’s cool","reviewDescription":"I would recommend this to a friend. It is totally catching just that, it’s better to buy one with greater capacity to enjoy. It’s perfectly new. I love it","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"Ipad works","reviewDescription":"Does the iPad sell with the plastic covering on it ?I received mine without and wanted to know if others had the sameExpedience ?","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1670025600000}
{"reviewTitle":"Arrived on day early","reviewDescription":"It he iPad arrived one day early. In perfect shap. No problems","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"Great product it’s doing what it promise","reviewDescription":"So far so good no complaints thus far.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"Love it!","reviewDescription":"My old iPad began to experience \"ghostwriting\" - sporadic and random characters popping up in any text box available as well as opening and closing windows randomly.  The only solution was to shut down, cool off, and restart.  It was 8 years old so I got my money's worth.This one is several generations more advanced.  Everything is better and faster.  I added a 5G SIM card so I can use it away from WIFI.  Almost as good as my laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Great iPad - doesn’t work with the 2nd Apple Pencil","reviewDescription":"We’ve owned at least 6 different Apple iPads. My daughter wanted a pink one so we grabbed this. She loves it. She’s 13 and easily linked it to her new iphone. We often buy directly from Apple but this was cheaper.My only complaint is that the Apple Pencil 2 isn’t compatible - she draws on Adobe Fresco and we had to get her an Apple 1 Pencil.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Worth the money","reviewDescription":"Not a scam !!! I loved it so muchh very pretty pink 💓💓💓","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Works great","reviewDescription":"I bought this so I could read the newspaper without it cutting out on me while trying to load ads. My old one is 5 years old and could not keep up - constantly reloading and very annoying. This new one works great!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Love it!","reviewDescription":"Pink is gorgeous and the 64GB works great for what I need - playing games, creating content for my job, handwriting\/calligraphy. Couldn’t pass up the price at $350!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Love It!","reviewDescription":"I love my ipad! I use it to create social media content\/editing\/annotating.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"I pad","reviewDescription":"It works great and is a great up grade from galaxy  pad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Love. Easy on eye. In denial about aging.","reviewDescription":"Maybe it’s excessive to spend $1000 on fancy upgraded iPad and accessories, instead of $300 on fancy upgraded bifocals, but it feels nice. Still not looking forward to first pair of old lady glasses.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Everything looks like it would have been awesome.","reviewDescription":"The 10.9 inch screen looks like it would’ve been a great size. The memory, the camera looks like it would have been a great iPad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Ipad","reviewDescription":"This iPad was a present for my son. He loved it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Good","reviewDescription":"Apple good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"It’s an iPad","reviewDescription":"You get what you paid for. This is good for what we needed at home to read and do a few papers on. It’s an iPad it is what it is. If you like Apple products you will like it.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1682467200000}
{"reviewTitle":"Nice ipad - came quickly.","reviewDescription":"Nice iPad. A little disappointed that it requires a different charger from earlier generations but that’s technology for ya. Works perfectly. Holds charge well. Should last for years until it’s iOS updates won’t download anymore like my old one 😄","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1682121600000}
{"reviewTitle":"Doesn’t pair with an Apple pencil","reviewDescription":"I’m sure it’s a great iPad, but it doesn’t pair with an Apple Pencil although it does say it’s compatible. I tried two different pencils, with all the USB to USB-C adapters and nothing worked. After doing more research, it seems that everyone is having the same issue, for some reason iPad 10 will not connect with the pencil. I needed it to work with the pencil for what I bought it. Return process on the iPad itself was a pain too. Amazon selected for it to be a pick up return, didn’t give me other options like it usually does. No one came to pick it up, tried to take it in person, they said I had to wait for a driver to pick it up. Had to jump through hoops to get it returned.","isVerified":true,"ratingScore":4,"reviewReaction":"95 people found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"use friendly and spped","reviewDescription":"I am satisfied with this iPAD, clear resolution, high speed, light weight, and easy use","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Box looks like it was dropped","reviewDescription":"Looks like it was dropped. The putter box had zero damage. The seal on the iPad box was also broken.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Great product","reviewDescription":"I use this device for art on clothing and it works well the only problem I had with this device is when testing the product forgot the password and I went through much to let them unlock this device but that's on apples part was very annoying I'm not a fan of apple but needed for an art business...","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1678665600000}
{"reviewTitle":"It was on sale","reviewDescription":"I would not of gotten it at regular price but so far I'm enjoying it. The only downside is it dies SO fast. It was at 99% when I first turned it on & went down to 45 in less than 4 hours.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1678579200000}
{"reviewTitle":"Solod tablet","reviewDescription":"I got this to replace my last gen ipad. It has fancier stuff, but I can’t say that the extra money was worth upgrading.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1683849600000}
{"reviewTitle":"iPad is Apple","reviewDescription":"I dislike very much the one port for charging and wired earphones, not everyone can afford the nice wireless earbuds. I guess this may be nitpicking as I knew what it was when I bought it but I’d not realize how inconvenient it wold be to have to have another type of charging cord, and earphone plug!","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Love, love, love it!","reviewDescription":"I love the picture quality and the convenience of this iPad.  I am using it daily to check and reply to emails, update my weight watchers app and check social media.  I bought this because I got tired of trying to strain my eyes to see the small print on my iPhone.  You have the option of selecting large print, adjusting the screen brightness and therefore, it is very easy on my eyes.  Highly recommend for those who are also tired of straining to see that small screen on the iPhone.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"So adorable","reviewDescription":"I love everything about my new iPad the color, the graphics, & etc I’m glad I purchased just wish I would have caught the sale when they were 349 I bought mines for 399 plus taxes but that’s still a good price I can’t complain I bought me & my son one different times I was able to catch his iPad on sale for 349 lucky me ☺️ I definitely will recommend others to buy this is a steel price compared to when u go to apple.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"No complaints!","reviewDescription":"I’ve had this for over a year now and it does exactly what I need it to! I didn’t put any data on it or anything, I just wanted it for the basic necessities like FaceTime, streaming, taking notes, reading, and some nonessential apps and it’s perfect for just that. It’s about the same price in stores but I liked how this selelr had all the colors in stock and payment plans. I say it’s worth your money! You can always do Apple Store\/setting upgrades for additional costs on your own.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Another Amazing Apple Product","reviewDescription":"I was on the fence about upgrading but I’m not sorry I did.  And Amazon was about $200 less expensive then Target or Walmart!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Beautiful tablet!","reviewDescription":"Beautiful tablet was between the nine generation and the 10th generation for my mother. Decided on the 10th because it had colors therefore we got a case with colors. However, the technology in one of these regular ““ iPads is very weird. My six generation iPad mini can handle the second generation pencil while the 10th generation normal iPad caught “will not handle that. You must buy the first generation. Just something to know otherwise the tablet is great.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Basically a iPad Air gen 4 but way cheaper cost","reviewDescription":"Purchased as an upgrade for a well loved and worn iPad gen 6. Have a iPad Air gen4 and this was on sale and almost matches the air spec for spec. Yes few minor differences like the usb pencil and keyboard is Bluetooth only but really for cost perfect match to the air 4 as is but for a lot less money. Screen same, speakers, cpu, storage etc. No longer sharing the air so works for us and value well worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Good product","reviewDescription":"Had a mini 4 . This is easy to use, read etc. only dislike is it keeps ringing on messenger even when I have answered on my phone. Weird.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Great IPad","reviewDescription":"This iPad is exactly what I was looking for. My old iPad quit updating so I knew I would have to upgrade. So glad I picked this one. Packed very well and was delivered really fast!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Touch ID lags behind the responsiveness found in the Galaxy S10e.","reviewDescription":"The iPad 10th generation offers superb design and performance, but its Touch ID lags behind the responsiveness found in the Galaxy S10e.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Very useful tool for study","reviewDescription":"I use this to assist my need to read extensively because I can bring up text and turn on audio and read along with it. I can now read comfortably at a reasonable rate. This was the primary reason to purchase it. It as well has many other useful features.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"If you like tracking and data collection. You will love this!","reviewDescription":"The home screen is a mess. The ability to use it without it turning off constantly. Even after you change the settings. The weird set up is borderline Schizophrenic.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"Not user friendly","reviewDescription":"There are several issues with this new format. It is hard to impossible to clean the memory, the finger print  does not always open functions, etc","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1672358400000}
{"reviewTitle":"So disappointed!","reviewDescription":"The clarity and graphics are no better than my very first iPad!!  What a disappointment- I wish I would have bought the iPad Pro or Air .  Don’t waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Bad battery only to 70% charge.","reviewDescription":"Will not charge to 100% only to 70%.  Battery not working right.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"ipad cover","reviewDescription":"there were scratch marks on the screen  and it doesn,t fit. But the color is pretty.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Color","reviewDescription":"Ordered the yellow tablet it’s not yellow, more a yellow mustard color gold looking","isVerified":true,"ratingScore":2,"reviewReaction":"7 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"Cheap quality iPad with two major flaws: very poor audio quality and no anti reflective feature","reviewDescription":"I wanted a new iPad in the medium size and chose this one (10th gen 64GB) for almost 500 dollars including tax from Apple. After using it for three days, this one felt more like a $100 ipad. It is unbelievable that Apple is selling such cheap quality iPads after all the years it has been iterating them. It is surprising that so many of the reviews here failed to mention two major flaws in this iPad . First, the audio quality is the poorest I have seen in a mobile device. It is muffled and tinny and unclear. So, I went to the local Apple Store and a worker there let me test the different models. This model had the same poor quality as my copy at home, however, the iPad Air 5th gen seemed better in quality as it did not sound muffled and tinny. Why was this model of iPad fitted with such cheap speakers??? This is unbelievable and unexpected for a 500 dollar iPad.. This is by far the biggest flaw in this iPad model. The other major flaw is the screen on this model is reflective to the point of being annoying while Air has the anti reflective feature that helps a bit. Both Issues are deal breakers for me, just by themselves let alone together, esp the audio. Needless to say I am returning this iPad 10 model as I am within the two week window.Please evaluate the audio and all the features of this model iPad at a store before you buy it. If you use Bluetooth audio devices the poor speakers will not impact you, but most people frequently use the iPad audio directly.The video quality and weight are alright and I do not mind the lack of Face ID, but the above mentioned deal breakers shut down this model for me. No thank you. I may go with iPad Air 5th gen after testing it more. I will not use this iPad even if Apple gave it to me for free.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Not much of an improvement","reviewDescription":"First, I did not buy my 10th gen iPad through Amazon, but directly through Apple. I did, however, buy a pleather folio case (Ztotop) for this iPad from Amazon and it is excellent.I've had a 7th gen iPad for a number of years and wanted to upgrade to the larger screen and more powerful processor. I use my iPad largely for web browsing and viewing Excel docs created on my PC, saved to OneDrive and viewed on the iPad with a free Microsoft Excel viewing app. Here are my Con's and Pro's.Con'sThe larger screen doesn't seem much larger. It's is brighter and a bit more crisp, but the larger screen doesn't show more or make it any easier to read.The intuitive home button is gone. I know they removed it to save money and create space for the larger screen, but it had real value.Replacing the home button is a series of bizarre swipes and motions that make little sense and are diffcult to master. I suspect this part of the U\/I was designed by a very junior engineer who never used an earlier generation of iPad.The On\/Off button is a total mess. If the iPad is on, pressing the button turns off the screen but does not turn off the device. To turn if off you have to hold down the button with one finger and hold down the volume button for a precise fraction of a second, or else it captures a screen shot. Who thought this was a good solution?And I save the worst for last: Microsoft's free Excel viewer does not run on this iPad. Not at all. Microsoft decided that devices with larger screens can't run the free app, so to view Excel spreadsheets (and other Office docs, I assume) you MUST subscribe to Office 365. I don't want or need to manipulate spreadsheets on a handheld device but Microsoft imposes a $72 per year tax just to view them. Microsoft has the right to choose where their software runs, but Apple and\/or Microsoft should have published a notification that the old app is dead meat on the new iPad.Pro'sIt charges very quickly.Performance is crisp, although for me not appreciably better than the 7th gen.As with other Apple devices, transferring content and settings from the old iPad was simple and reasonably fast.SummaryIf I could do it again I would not buy this device and continued to roll with my gen 7 iPad.","isVerified":false,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1671062400000}
{"reviewTitle":"Its an Ipad","reviewDescription":"Does what it needs to do, battery life is better than expected, got about 10-12 hours of about 6 hours of notes and 4-5 hours of movies\/gaming","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Nice and new","reviewDescription":"I really like the new iPad. I'm coming from a iPad to many many years ago I bought still works. This one has much more color 4K picture really nice definitely in a good upgrade for me. Definitely worth the price always consider how much room you will need hope that helps.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Better then I expected","reviewDescription":"I’m use to battery’s being at 40% but this tablet was at 92 when I got it and I know it’s not much but that makes it feel better. And it’s working perfectly and transferring from my old tablet to my new one perfectly fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Just as expected 🙏🏻","reviewDescription":"Great device, I’ve had an iPad Pro and actually prefer this one, it’s light to hold and runs very smooth.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Apple iPad (10th Generation)","reviewDescription":"This iPad took a little getting used to since it is different from my five-year-old iPad.  Once I learned some of the changes, I was able to use it and I can now do the things I am used to.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"I Pad 10th Gen","reviewDescription":"Absolutely love it, with the exception of a couple of minor things.  Would prefer a home button.  Touch ID doesn’t always work.  Find it in an awkward spot when I Pad is lying flat on table.  Other than that, it was an absolutely great choice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"great product and good price","reviewDescription":"I bought this iPad for my teen daughter and she loves it thank you the price was perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Big upgrade over older iPads","reviewDescription":"I've been using the same iPad for 5 or 6 years and didn't realize how big of a difference it would make to upgrade.  The screen is a lot better, it is faster and it just really feels great in my hands.  It is taking a bit to get used to an iPad without a button at the bottom, but other than that, I haven't had any issues.  I would definitely recommend the 10th Gen iPads!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Okay upgrade. Just okay, though.","reviewDescription":"I decided to upgrade to this from my 5th gen Ipad. It's a little faster than my old one. The camera was a bit better. Not so much I would have bought this thing if I knew how much better this is than my old Ipad. But it is a little bit better. Features are about the same. I will say this ipad runs the apps a bit better. My 5th gen was starting to have trouble running the Amazon shopping app, for example. Safari's about the same. X, Instagram, and Facebook are about the same. So 6 years later, there is a difference. Just not a massive one.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Acceptable value","reviewDescription":"I like that That this device work for diffrent activities I but it mostly for my sister but I use it for diffrent type of work like school pdf and those things it was a big changer for me cause I don’t got a laptop and this works as a laptop you can do similar job in this device and is don’t take long to access a private access work page as other divides so this is a great investment it don’t cost as much as a laptop is a bit cheaper but it give you the same kind of work.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"It’s amazing!!!","reviewDescription":"Absolutely love my new iPad. Of course I had to get the color pink as it any favorite!!! Got here very quickly and in great condition.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Good buy","reviewDescription":"Gr at picture. Easy to switch data from old iPad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"excelente producto","reviewDescription":"lo uso a diario, es un producto de muy buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"It is an ipad","reviewDescription":"Performs as expected after all it is an Apple iPad! The preparation and shipping were very slow for an item that showed in stock. Took almost a week to get it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"So far I love it!  Hope to buy a keyboard when I can afford it.","reviewDescription":"Love it. Had a iPad 6 and upgraded to a 10.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Ipad","reviewDescription":"Nice product at the price point that works for us.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Ipad","reviewDescription":"Easy to order fast shipping ,smart packaging, ready to use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"100% GENUINE APPLE IPAD","reviewDescription":"Having never purchased an Apple device from Amazon, I approached the potential cautiously and with much research as well as thought. At $50 below the current MSRP, this iPad 10th gen (2023) caught my interest.When the shipment arrived, here are a few negatives to take note of: 1) Amazon doesn’t protect or pack products well for shipping i.e. no padding, no wrapping, no protection from drops 2) the manufacturers packaging wasn’t in prestine condition i.e. dust stained, small minor dents and scratchesSince this wasn’t a gift, I immediately opened it in case there was anything questionable. I was pleased to find a genuine Apple product that was undamaged, easy to set up and even authenticated by Apple when I reached out to a support agent.Overall, I’m very satisfied with this purchase and would consider buying an Apple device from the Apple Store on Amazon in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"the package was ok","reviewDescription":"the ipad works fine. The start up settings were easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Great price","reviewDescription":"There is nothing to dislike about this IPad.  Great price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"I bought it last night for 399  I checked this morning and it dropped by 50 to 349","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"This item stopped working.  VENDOR WILL NOT RESPOND. DONT BUY","reviewDescription":"This item stopped working in a little over a month of use. The vendor will not even respond back. I would highly recommend not buying from this vendor.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1676419200000}
{"reviewTitle":"Volume button quit working.","reviewDescription":"The volume button quit working 5 months after the warranty ran out.🤬🤬🤬🥱","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1685923200000}
{"reviewTitle":"Still waiting for refund on broken ipad.","reviewDescription":"Ipad didn't work on arrival and I'm still waiting for my refund.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"Ipad 10th generation","reviewDescription":"Make sure you know that this ipad does not have cellular capabilities.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Great product, bad service","reviewDescription":"Great product but it didn’t come with a charger. At this point I regret not buying new","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"DUD IPAD","reviewDescription":"ipad stopped working after 2 days.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"Lasted 2 weeks!","reviewDescription":"After 2 weeks the screen stopped working! First time I have problems with new apple products!","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1669593600000}
{"reviewTitle":"Poor advertising","reviewDescription":"I Purchased, the three items to work together, and guess what they don’t","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"Returned","reviewDescription":"Too hard to use and set up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1685750400000}
{"reviewTitle":"Loved the color","reviewDescription":"This iPad is very lightweight. Not used to that in an iPad. Once received, it did not have all features that I was hoping for. Another reason was as soon as I received this item, Amazon threw it on sale for $50 less. Returned it immediately.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Used","reviewDescription":"Annoyed that I got a used iPad. Got it all set up and then a couple weeks later while using came across notes dated 2 yrs prior to me buying. SMH.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"No plugin for earphones","reviewDescription":"Could not transfer imfo and apps from old ipad to new because of 16.6 system and the old was 10.6.There was not a port for earplugs on the new ipad because they cheaped out.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Camera","reviewDescription":"Camera is great but having the landscape camera made it difficult for me as a streamer to use, didn’t work with the app I use. So I decided to purchase the iPad Air instead since the camera placement doesn’t work for me on the 10th gen.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686009600000}
{"reviewTitle":"iPad blah","reviewDescription":"While this new Gen 10 is Ok…it isn’t what it used to be.  I am disappointed in many aspects…but still learning and adjusting so perhaps my opinion will change.- it is slow- it is not as smart\/intuitive as my “old” Gen 7","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Ok","reviewDescription":"Well it was good but just the iPad box was damaged in all the corners like if they depot it, and I was worried that the iPad was broken.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"I’m sure it’s great, BUT","reviewDescription":"I wish it was perfect! I have t even opened but I’ve been waiting to buy for months and ordered on prime day:)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Battery does not last long.","reviewDescription":"Battery life is terrible.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Battery life","reviewDescription":"Anyone else having trouble with the battery? Mine takes a long time to charge, must I’ve gotten a used one or something?? Let me know if y’all having the same problem with the battery wasting too soon and taking a long time to charge, thank you 🙂","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680048000000}
{"reviewTitle":"APPLE TECHNICIAN HAS DONE A PRODUCT RESET. THIS WAS NEVER PROPERLY SET UP DUE TO KEYBOARD.","reviewDescription":"THIS WOULD BE GREAT FOR FOLKS 70 AND UNDER.  SEVERAL YEARS AGO I WORKED FOR AN IT DEPT.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"BUY FOR YOUR NEEDS and NOT WANTS.","reviewDescription":"The iPad (10th Generation) is exactly what we needed and wanted.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"greatest ipad","reviewDescription":"So this is my second one my first was 2011 2nd generation and right now the  10th generation is brand new to me for sure. Great price I gifted to myself, its light weight and fast, I got the pink","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Great battery life","reviewDescription":"I bought this I pad late last year.  I have had many iPads through the years.  The best thing about generation 10 is the battery life.  Nice job Apple.  Thanks!,","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Value for Money","reviewDescription":"Upgrading existing iPad and the color and clarity are great. Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Love my new Ipad","reviewDescription":"I use this every day for multiple applications.  Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"super Fast","reviewDescription":"I was looking for something to help me be more mobile at work.  This is way faster than my old Ipad, and the USB C charging makes it compatible with all of my other devices that utilize that charging as well.  I am very pleased with this!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Great iPad for Browsing","reviewDescription":"These are great for you basic browsing and streaming. I use mine to look up information while laying in bed or watching youtube. Battery life is pretty good as i only have to charge it about once a week with light use.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Great for art!","reviewDescription":"If you’re looking for an art table and don’t wanna spend a bunch on one that’s stuck to a table this is a great option, procreate works beautifully on it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Definitely so worth it!","reviewDescription":"I love everything about the iPad! Runs smoothly and perfect size","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Muy buen iPad","reviewDescription":"Es el mejor iPad y está a un excelente precio","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"iPad 10\/10. Charger is Dangerous.","reviewDescription":"Everything about the iPad itself is great. The charger on the other hand worked perfectly fine for about two months and then stopped working due to melting. Very unsafe.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"It does the job","reviewDescription":"I like it. I expected more though. When I play games, sometimes it stops working.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Color!","reviewDescription":"The color is a dark navy blue. The picture looks more like pastel blue. But other than that the ipad is great. Easy to set up. Super thin so be careful while opening it. I’m super stoked to use it :)))  the set up was extremely busy","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Great for the price.","reviewDescription":"I have had this iPad for over a month now and I have no complaints.it holds charge really well which is great for me as a student I don't have to worry about it dying on me.it also came in really good condition practically perfect.i have no regrets over buying this iPad","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Great design, less than great execution","reviewDescription":"My third iPad in 10 years - the last  one has lasted 7 years and is still working.  This latest iPad, 10th generation\/2002 model, has a lot going for it:  a large, excellent display, a fast chip, good storage (256 gb), good sound, and very good battery life.  My prob has been internet connectivity, which has been episodic.  Thanks to Apple Care support, which is predicatably very good, I was able to backup my data and apps, restore factory settings, and reload my apps and data.  So far, all's well.  But beware that this new iPad has quality issues that may be more widespread than just my experience.Update after two months:  Reloading software, data and apps did not resolve this connectivity issue.  By trial and error I discovered that my ISP’s 5g network protocol doesn’t work well with this iPad.  Interestingly, I don’t have this prob with my older iPhone and Mac, which work well with 5g.  When I adjusted the network setting back to the slower 4g setting, which Apple Care didn’t suggest, the connectivity issue disappeared.  But 4g is still fast enough for video streaming and other routine tasks, so I’m satisfied - just not thrilled with how long it took to come up with a workable solution.","isVerified":true,"ratingScore":4,"reviewReaction":"60 people found this helpful","country":"United States","date":1672531200000}
{"reviewTitle":"It’s very good","reviewDescription":"Love everything about it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Good condition","reviewDescription":"It’s over all good. Definitely opened probs used but I mean it works and looks like new so not complaining plus price was good. Definitely a good option would probably just buy a new one next time but overall good","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"iPad is beautiful 😌however I’m having mic issues.😭😭","reviewDescription":"I just got this iPad a day ago and I’m in the process of figuring it out. I came across a mic issue. The speaker works fine! Sound is loud and clear when playing music and recording videos through the camera app. However when I want to make calls through FaceTime or make screen recordings with audio there is no sound. Is there a fix for this??? please help. I work in the office and the mic is very important for me!","isVerified":true,"ratingScore":4,"reviewReaction":"30 people found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Some great updates, some strange choices.","reviewDescription":"I really enjoy the redesign of this product to be more in line with the IPad Air and Pro series, though I noticed it comes with a cost increase as well.  The screen is good, not as clean and bright as on a Pro or Air model.  The strangest choice is the support for the Apple Pencil series 1.  It would have been a great choice if they had just gone with the magnetic charging of the series 2.  Otherwise pretty sold entry, love the color choices.","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"Es un buen producto","reviewDescription":"El producto es el esperado","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"It's an Apple so of course it's a great product.","reviewDescription":"I have a  13\"  9 year old MacBook Pro that's on its end of life. (Battery problems). I thought I could get away with just buying a 10\" iPad. A friend warned me that I might not be happy with a 10\" screen.  I thought it's only 3\" smaller. He was correct, for me the screen was just too small, I've turned it over to my wife who loves it.  I just purchases a 15\" MacBook Air which I love.  Anyone who is looking for an iPad,  and not an actual computer can't go wrong with this Apple iPad.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"it is legit","reviewDescription":"This is the real deal. This tablet is truly amazing. Last week, I had a Fire tablet, but I had to return it. The quality of this tablet is astounding – from its responsiveness and touch sensitivity to its storage capacity, everything is exceptional. Apple holds the number one spot for good reason. The performance, sleek design, and battery life are just the beginning; there's so much more to appreciate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Amazing step up from our old iPad.","reviewDescription":"The Apple iPad (10th Generation): with A14 Bionic chip, 10.9-inch Liquid Retina Display, 64GB, Wi-Fi I bought is such a huge step up from the last iPad we had. Screen response is fast, app load quick and the battery stays charged all day without issues even when watching\/streaming video. I went with the blue and it looks really nice.Step up was so easy using my iPhone and it came with the outlet plug and cable to charge it. What I really love is it comes with USB-C instead of the lightning cable. I hated the lightning cable as they always seemed to stop working and on some of our iPads for the kids they don't plug in properly and you have to do some crazy warping of the cable to get it to connect and charge. After about 9 months of using this iPad 10th gen I haven't had any charging or cable issues. So happy about that.The first thing I recommend no matter if you're an adult or it is a gift for a child is getting a screen protector and case put on from day one. It will save you so much anguish if anything happens like a cat knocking it off the coffee table for instance haha.The performance and display are breathtaking when coming from an older generation and the camera is so much better. I've used mine for work, vacationing and giving the kids something to do. We got it on sale, super happy with this Apple iPad 10th gen and would definitely buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"37 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Optics are good….","reviewDescription":"I love everything about this iPad. The quality & optics are amazing they always have sales on this iPad. I use mine for Procreate & taking notes for my college classes. The only thing I dislike is it loses battery fairly quickly. No matter how much I charge it the next time I pick it up battery is low.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Best iPad. And it’s cute","reviewDescription":"I’m so glad I bought this iPad. I use it for everything! school , reading , journaling , to draw , to be creative , as a calendar….. the list goes on ! I’m so happy with this purchase I love it more than my macbook. I really only use my MacBook to type now.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"I got it on sale","reviewDescription":"If you’re thinking about buying and it’s at $450+ keep thinking because it goes on sale after some days or weeks! Honestly it does glitches a bit which scares me bc I just got it but uhhh..I GOT IT ON SALE FOR $350","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Excelent iPad","reviewDescription":"I got this iPad for a couple of specific reasons. 1: Not using my computer for everything. 2: To take with me when I travel. Our newspaper has gone digital, and it is convenient to read it on the iPad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Buy the Magic Keyboard!","reviewDescription":"Buy the Magic Keyboard!  It makes the iPad so much more functional when entering a lot of data.  I have my calendar, budget, to do list, reminders, all my mom stuff on the iPad now.  Love it!  The pencil is helpful too but it’s also sold separately.  I wish Apple had a combo pack to save a little money when buying all three items.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"needed to upgrade","reviewDescription":"I have the very first version of the ipad and it just was too slow, wouldn't keep a charge and apps no longer were compatible to update.  It was time for an upgrade and I like my choice.  The battery life lasts and the screen looks great.  Glad I finally updated my ipad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Exactly as described","reviewDescription":"This is a replacement to my generation 6 iPad and having bought it from Amazon was very much less stress than going to and dealing with an Apple store. Apple did us all a favor that one can now transfer all data from on old to a new iPad by just having them next to each other. My transfer took much longer, as unfortunately, I had not backed up my old iPad and therefore it was hours and not minutes. But once done this new iPad generation 10 works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Awesome","reviewDescription":"Love this tablet! It took forever to finally arrive kept getting delayed!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"It’s nice to have","reviewDescription":"It’s useful in many ways for in work and outside of work","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"I'm not sure if my battery should be draining this fast.","reviewDescription":"I love the iPad. Its my first iPad however the battery life is concerning? I can run through a full charge in 4 hours. Which doesn't make me very happy because I will be traveling and need a capable device... That can keep up with my demands. I have contacted apple and they say nothing is wrong and did a diagnostic test that came out fine. I don't enjoy the space between the screen and LCD but this was the most logical option for me to purchase. The speakers work very well and I am a huge fan of the rear camera it works well for close ups and catching small details. I would just love a better battery.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Good","reviewDescription":"Good but I wish it was compatible with all Apple pencils","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"this is my first iPad","reviewDescription":"I love this device!  I probably should have bought a smaller one, however this is perfect for most of the purposes I use it for and I will recommend others to purchase.  I purchased an ergonomic keyboard and mouse to use with it.  It turns this into a lovely computer.  I use it for standard social media, productivity, and writing.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Love Apple IPad","reviewDescription":"Still using my old one but it was on sale.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Good","reviewDescription":"The price is the same as the black Friday","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Genial","reviewDescription":"Me agrado","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Back to the ipad.","reviewDescription":"I have a 6th gen that is now slow as molasses and have been very happy with my pixel phone so I got a pixel tablet. While very fast, it had app issues and file saving issues, neither of these problems does my phone have. I sent it back and got another ipad, it’s the devil you know! Works great, just like my old one did when new., i’m sure apples updates will kill it just like it did the last one. I’m not a big fan of the ios or ipados but it works and that’s what matters.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"don't know battery life or camera quality, yet BUT","reviewDescription":"setting up an ipad is hell on earth, hours wasted, had to turn off all my iphones and other ipads or they all talk to each other and really eff it all up..otherwise i like ipads..","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Memory","reviewDescription":"Not enough memory :-(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Cumbersome","reviewDescription":"I made a huge mistake.  I have been using Android phones, computers and tablets since 1974.  I currently have an Amazon Fire HD tablet that I bought two years ago for $79 during Prime daythat has been giving me some problems..  Every thing makes logical sense in the OS.  Starting to use this iPad has been a shock.  I brought because it was in the midrange of prices for a new tablet of any kind.  I wrongly thought that is has to be similar to Android after all this time and playing second fiddle.  There is no logic.  Their mail program does not work right with AOL.  Safari does not even display a full Internet address which I need for my writing.  Tabs in Android are a thousand percent better than what Apple offers.  I know I will eventually have to use it full time, but it will not be fun for a while.  I would not recommend changing from Android to Apple unless you absolutely have to.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Out the box!","reviewDescription":"It doesn’t come with a screen protector nor support apple pencil 2 (as far as i know only with magnetic charging) it does support apple pencil 1. If that is the least of your worries, hands down grab this ipad if you want sum with a little more aesthetic and faster loading. It doesn’t have an aux cord, which doesn’t surprise me but would’ve been nice. For the Price, its 50% more than the 9th gen which is highly recommended if you’re on a budget. If you have lil extra to throw grab the 10th gen just to be ontop of the game","isVerified":true,"ratingScore":3,"reviewReaction":"16 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Good Deal- Stopped Charging 2 months in.","reviewDescription":"Got this iPad for my 4 year old son after my 10 year old iPad mini he inherited went bad. I’ve had it for 2 months and already had to do a full firmware reset on it because it stopped accepting a charge. Once I did that firmware reboot it resumed charging as normal. I didn’t expect that from a brand new 2 month old iPad. I still have some apple care time left and will take it to an Apple Store to ensure it’s good. Overall it works well, nice large screen. My son enjoys it. I just hope I didn’t get one from a bad batch.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1684800000000}
{"reviewTitle":"The Mouse is Irritating","reviewDescription":"The case fits well and is easy to use.  My problem is that the case has a mouse option that cannot be permanently turned off.  I am so accustomed to using and iPad keyboard and touching the screen that, my hand keeps hitting the mouse pad and moving me to screens I don’t want to see.  You can turn the mouse off, every time you open the keyboard, and I find it VERY annoying.  I thought I could deal with it, and I will, because I can’t find a keyboard case similar to this one without the mouse.  Otherwise, the fact that it turns and all the other features are great.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Mad, sad, disappointing, betrayed","reviewDescription":"Apple is great. I have no beef with them on the software side of this product. But y’all. Come on. I was expecting bright Easter sunshine yellow. When you look at the product images they advertise that is 100% bright Easter sunshine yellow. The product I received though. Dark grim mustard gold. You can kinda see from an angle it’s more yellow, but I want it to be yellow from every angle not just one. I will be returning this for the pink one, which I’m sure will also be darker than what they advertise. But mustard gold is just not the move. Not what I signed up for.I don’t want to rate this lower even though I am actually very very disappointed because overall apple makes great products. This iPad is slim and light and I turned it on just to see the display and it looks great. Just advertise the product as gold not yellow.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1675900800000}
{"reviewTitle":"Love it!","reviewDescription":"Love it!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"works","reviewDescription":"works like it’s supposed toEdit: you know what there are times were it was laggy and I tried opening a children’s play game like hair cutting salon and it froze and I was freaking out. Then eventually after much time of holding and pressing the buttons it restarted. Works for good notes I guess. Though it would exit me out if I had a chemistry book open along side good notes. It is the app or the iPad… idk","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"Easy break","reviewDescription":"This screen is worse than the pervious version . My kids have it no more than two month . And drop it . Normal I have other iPad . They drop many time never happen . This one inside out all broken . Fixed it is half price with this purchase . And price can cover if you buy the 128G . Not for kids .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"If you order electronic be very careful reading return policy","reviewDescription":"Never got to use it but once stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Pre registered device","reviewDescription":"I bought this for my husband’s birthday and when we opened it and powered it on, it said that this device is managed by Rialto School District. Returning and having to buy a new one from target for a last minute gift tomorrow.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Product damaged","reviewDescription":"Product was damaged.  Vertical line on screen.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"It’s came with came broke","reviewDescription":"No good","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Do not trust amazon sell from amazon, double check first","reviewDescription":"I just bought an ipad 10 generation (new not refurbished) and the ipad does not turn on,  amazon does not let me return it because i only have 14 days of warranty with them.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"defected battry","reviewDescription":"15 days battery would no longer charge. sending it to AppleMy 5th I pad that,I have bought for myself or my grandchildren and never had one gobad this fast.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"They won’t repair it","reviewDescription":"My iPad froze up I couldn’t shut it down I couldn’t even go to settings to do any thing I sent it to apple for repair and they refused to fix it or even give me a call they just sent it back","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1677628800000}
{"reviewTitle":"This tablet simply stopped working after a year","reviewDescription":"This tablet simply stopped working after a year","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"return was handled swiftly without complaint","reviewDescription":"Had the screen freeze and followed prompts except plugging into computer. Needed an adaptor that I did not have. Return went swift and uneventful. Went on to reorder another with 256GB. Better luck this time I hope.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Bad transfer","reviewDescription":"When I wanted to transfer my files from my old iPad to this one, it just transferred 50% of my data. It missed all my recipe apps, my books, jigsaw puzzles and I had problems with the passwords. I returned it","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"My Apple turned out to be a Lemon","reviewDescription":"I've purchased many Apple products and never had to return any product within days of purchase due to a defect. Not sure what happened to my ipad 9th generation, 64gb, 10.2\", which I loved but it started doing some weird things. One day I opened the screen and got a prompt that Chrome had not closed properly - Restore. I restored as instructed and started browsing the internet. The screen started to flash, go black and took me back to the home page. I selected an app but the screen blanked again went black and I received the same Chrome error. From that point, it was crashing just about every time I tried to sign on. Very frustrating and I didn't want to spend time figuring out the problem on a newly purchased ipad. I'm returning it for a newer model.","isVerified":true,"ratingScore":1,"reviewReaction":"27 people found this helpful","country":"United States","date":1671494400000}
{"reviewTitle":"Terrible","reviewDescription":"I just got this iPad in September and now 5 months later it’s dead. Won’t turn on, won’t reconnect through a factory shut off. Terrible","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Not as advertised","reviewDescription":"In the description it says it cellular capacity. It does not. I returned it so I could get one that does have cellular service and they telling me it take 2 weeks to return my refund. This is ridiculous. Now I’m going to be without an iPad for more than two weeks. It didn’t take me two weeks to pay them. I have been an Amazon customer for several years and never been treated like this. I’m looking at other options to buy on line. It’s a shame. I really like Amazon until now.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1684540800000}
{"reviewTitle":"Defective","reviewDescription":"Couldn’t even use it. Brand new out of the box and it gets hung up in initial software update during data transfer. Apple has really been putting out some hot garbage lately. There’s also a chip in the screen where the front facing camera is located. Did you sell me a used device?","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Ipad","reviewDescription":"Microphone did not work, iPad was indeed green instead of yellow. Not sure why or what happened but definitely not what I ordered.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"DID NOT WORK","reviewDescription":"It turned on but did not work. Just a blank screen. I put a return request out and it was supposed to be picked up today.  I literally waited ALL day and no one showed up. I am very disappointed.  And they say it could take 30 days to refund!!!!! Reallly?!?!? Because you charged my visa immediately!!!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"EL ARTICULO LLEGO DAÑADO","reviewDescription":"DESDE EL MES DE NOVIEMBRE COMPRE EL IPAD REGALO DE MI HIJA Y AUN NO RECIBO RESPUESTA DE MI DEVOLUCION EFECTUADA DESDE EL MES DE ENERO 4","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"would not power up out of the box","reviewDescription":"this item was dead right out of the box they say a refund was issued Dec 17 here it is Dec 23 no refund even though they say it was issued. I order may things from Amazon this is the only time I have had a problem.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Too expensive","reviewDescription":"Had to buy it for my son's school home learning, my first apple thing, don't like it at all!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Not brand new","reviewDescription":"I purchased this thinking that the item is brand new, but when the item arrived, it definitely look like one. Box is stained, the iPad cover inside looks like it was re-packed. Will definitely return since the real brand new iPad from Apple is only $50 more.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"Refurbished Not Disclosed","reviewDescription":"Seems to work fine but it did not come in an apple box. It was refurbished and that was not made clear when it was purchased! I don’t buy refurbished products!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"Ipad","reviewDescription":"I love my new iPad  It is everything I wanted it to be. But the battery doesn’t last as long as I figured a new one would","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"IPad","reviewDescription":"I like additional memory and you can easily use caps for full titles, or whatever. I am very unhappy that they changed the configuration of the cord at point of entry. Nice money maker Apple.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Ipad","reviewDescription":"I am so used to doing Amazon tables that it makes it a little complicated to use. Everybody talks about how great they are but I still like my Amazon tablets","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"Not the color in the pictures","reviewDescription":"The yellow ipad is not actually a bright yellow. Its closer to a shiny puke gold. Disappointed the color doesn't match the photos. If you want a bright color, don't get the yellow one.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"iPad","reviewDescription":"Love this iPad and was packaged perfectly just wasn’t as large as I wanted. Hated that it was pickup only for the return","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Didn’t receive cups","reviewDescription":"Didn’t receive cups","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691539200000}
{"reviewTitle":"It’s  Apple.  So I got what I paid.","reviewDescription":"This is my 4-5 th iPad.  Very consistent.  My last iPad I shorted the on\/off switch when I got it wet. I’m very happy with the iPad.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684540800000}
{"reviewTitle":"Closes apps at random.","reviewDescription":"I may be in the middle of using an app and it returns to the Home Screen.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"Ipad","reviewDescription":"As expected","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Came in dirty! Perfect condition on the outside. Not so sure about the inside...","reviewDescription":"I have not tried the ipad out yet. The packaging came in with weird dirty spots. I tilted the front to help show you what I mean. As well as the back. I don't know if it functions well. But upon receiving it, I do not like the color I have chosen. :( I would like to trade it for silver if I ever had the chance to. Other than that, the product seems to be in perfect condition (on the outside). No scratches or fingerprints on the glass or back side. Could I perhaps trade it in for a silver one? I have not charged it up or set up my stuff on it. It is completely turned off.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Internet connection","reviewDescription":"This is yet another Apple product that up dates changes all your stuff pictures etc and of course let’s not yours the ole plug in let’s use mini usb cord. And WHY WOULD YOU CHANGE THE WAY YOU SHUT IT OFF TWO FINGERS ARE YOU KIDDING  no more apple for me been a customer for years I phone 4 to I phone 14 latest greatest right then they throw down the 15  seriously 😐","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"Thought I was ordering a new one ...","reviewDescription":"Ordered an iPad on cyber Monday. Did a search, found the one I wanted and added it to my cart. When it arrived, I discovered it was a \"renewed\" or used tablet. NO WHERE during this process did I choose a renewed iPad. Ended up returning it. Sorry but I will not pay $500 for a used iPad.So be sure it's new, if you want new one and avoid a hassle.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"After two months the screen is black will not turn on now what do I do??","reviewDescription":"Please help me I need a iPad that works my old has many cracks in the screen! Used until 40% on battery plugged it in and nothing a black sceen!! Please can you help me!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Apple Pencil setup is a JOKE","reviewDescription":"Bought this for one of my construction foremen to use in the field. He needs an Apple Pencil. The only Apple Pencil that is compatible is the Generation 1, which has a LIGHTNING charging setup, but the iPad has a USB-C setup - so now I have to buy an adapter to allow him to charge his pencil and somehow expect him not to lose it on acres and acres of construction sites. We’ll go through dozens of adapters a year. Will now be returning the pencil, ipad, and keyboard case and starting over…","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Poor Assistance for Defective Ipad","reviewDescription":"I am having trouble reaching assistance to return the new iPad that is not charging. Cannot reach anyone by phone or chat.I do not want to fix.  A new iPad should function perfectly.  This is very disappointing.  I had more faith in Apple.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"That it continues to work more than. 2 and a half months.","reviewDescription":"Purchased Aug 4,2023. Worked great UNTL. OCT 09, 2023. Took it to BEST BUY..under warrenty and puchased additional 2 year insurance through Asperin at the same time I purchased the Ipad.So far I haven't received a replacement or response regarding what's going on with my Ipad.It went black and would not turn back on. The repair went through it and got the same answer NO indication the Ipad would ever turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Abierto y mal funcionamiento","reviewDescription":"El empaque venía bien pero sin plásticos ni ningún tipo de sello, estaba funcionando bien se descargó a las pocas horas y no volvió a cargar, intenté con diferentes cargadores y nada estaba muerto","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Not their best","reviewDescription":"My unit was purchased 6 months ago and it no longer will hold a charge. And yes i have tried new chargers, its the unit. I was sent back to Apple and they can not fix it. Would not recommend this Ipad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Received damaged","reviewDescription":"Received the package and the seal was broken. When I took the iPad out of the package, there was a line straight across the screen when turned on after turning on the iPad had a passcode requirement. I’m highly disappointed!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Packaging looks dubious and damaged","reviewDescription":"Otherwise genuine Apple product. But quality of packaging is not typically Apple. Not sure why.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"good tablet - (poor battery life)","reviewDescription":"the box came unwrapped, easy to set up.. got the pink colour.only issue was that the tablet battery life doesn't hold for even for a day.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Very confusing apple line up","reviewDescription":"If you're gonna get an iPad in the 6-5 hundred dollar range, get the iPad Air 5th Generation. This is not worth its price point.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"Love my ipad","reviewDescription":"I love my iPad but I had it less than 30 days and the adapter stopped working. I did contact seller but never got a response.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"Returned to AppleThe volume cannot be adjusted when I make a video call","reviewDescription":"Cannot raise the volume so my friends can hear me on. There was an audio problem with this iPad. After working with Apple to see if it could be resolved, they set up an appointment at Best Buy for service. I was issued a replacement but not on the protective screen. I’ll call Amazon today per their (BB) advice for another screen protector. I do like my iPad very much otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"Have not used yet","reviewDescription":"Will come back to review when product is used. It is a gift. I did not like that the package looked dirty. Kind of embarrassed to give as gift. Had some stains and what looked like finger prints. Hopefully the product is new.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"not all capabilities like desktop","reviewDescription":"Did not do everything I wanted it to do.  Not like my desktop.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670803200000}
{"reviewTitle":"Apple Pencil not compatible yet","reviewDescription":"The overall product seems fine, but the pencil will not work until an adapter is released. That will be close to December!","isVerified":true,"ratingScore":3,"reviewReaction":"62 people found this helpful","country":"United States","date":1667001600000}
{"reviewTitle":"Should have been able to use either generation pen or maybe the newer one.","reviewDescription":"School","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"It's  okay but what price I paid it should have came with the styling pen and a cover for it","reviewDescription":"It was okay","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672876800000}
{"reviewTitle":"Batter life is bad","reviewDescription":"I’m so far enjoying this iPad. It’s a nice sized iPad if you are looking for one that has a big screen but is not overly huge and can fit in your bag. You can set up the home screen with widgets to make it more custom to you. The sound quality is great when watching shows and listening to music. You get the home bar at the bottom just like you would on a MacBook and can access it in any app. I am however very disappointed with the battery life it charges fast but dies just as fast if your looking for something that will last all day with continuous use I would look for something different or plan on bringing a charger with. I thought it would be a lot like an iPhone with its features but it’s not, there is no facial recognition only finger print on the power button. When using the keypad you cannot swipe the words like you can on your iPhone so it takes a little longer to type things. Altogether it will still do everything that you need it to do.","isVerified":true,"ratingScore":4,"reviewReaction":"40 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Dirty box but iPad was is great condition","reviewDescription":"Package tracking on Amazon was a little behind but came in on time; the app was just behind. Also the outside of the apple box was dirty and had something on it, and some animal hair. I didn’t mind the hair cause I have lots of animals and I know that’s hard to control sometimes.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Love it!","reviewDescription":"It’s my dream iPad and I haven’t been able to put it down since I bought it. The battery doesn’t last all day tho and yes 64gb is enough if you have a laptop","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"A great I pad for the money","reviewDescription":"The size is perfect. I think the quality is excellent and I love using this iPad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"iPad 10 256g Is Expensive Even On Sale","reviewDescription":"I upgraded from an iPad 7 w\/32g because I ran out of storage space. Apple is very stingy when it comes to iPad storage. This time I bought the iPad 10 with 256g of storage. It was expensive even on sale. Other than that these are great devices. The iPad 10 has a fast A14 Bionic processor, a bigger screen than previous iPads, more storage, plus Apple got rid of the Home Button which allows for a larger display area. The iPad 10 on sale cost the same as an iPad Air w\/64g of storage. But I needed larger storage of the iPad 10.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"The new iPad","reviewDescription":"The new iPad with 128gb WiFi and no cellular service plan. Blue case. It’s great. But I’m comparing it to a 1st gen Air that the battery finally would not stay charged for more than a few days. There is one thing I do not like, turning the iPad off.The only sure way is going to settings and using  shutdown.Other software changes are confusing at first yet not a big problem. Like it populated the flip screens from right to left, yet starts up on the far left screen??  So all my most used icons are on the very last screen to the right…It’s the same size as my AIR. Camera is in central location rather than on the side. Keyboard interface is such that I can use my previous keyboard and holder\/case if I don’t want to use outward looking camera. Touch ID is nice. And of course backup, iCloud, device interconnection is great with Apple.","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1695686400000}
{"reviewTitle":"Applecare+","reviewDescription":"I bought this with applecare+ 2 years but after I checked on apple website, why it's only 1 year??","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"So Far So Good","reviewDescription":"I barely received my product and I am still setting up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"All day battery life is false","reviewDescription":"It says all day battery life and that was one reason I wanted to get it. but it don’t last any longer in the morning playing games for 3 hrs. Than my 3 yr. Old iPad Air did. 50 % gone after 3hr. It must mean all day life if you don’t use it for anything.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Why did they change it?","reviewDescription":"I have used Apple products for years. That is why I bought this iPad when my old Apple iPad would no longer hold a charge. However, Apple has changed the charging mechanism on this iPad so you have to use a whole new charger. You also have to use a different set of ear phones. I do not know why they changed it because it was so much easier when all of the Apple products used the same type of charger.  Now, instead of charging this iPad on any of my available apple chargers, I have to go to the one that is specifically for this iPad. Apple, if it’s not broke, don’t fix it!","isVerified":true,"ratingScore":4,"reviewReaction":"34 people found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"WAY overpriced for 64GB of storage and using Apple 1st generation pencil","reviewDescription":"iPads are always great.  They are reliable and just work.  Unfortunately Apple always tries to force you into an upgrade by giving you very little memory (64GB) on the basic iPad.  With memory being so inexpensive, it would cost Apple only a few dollars to give you a reasonable 128GB of memory.  There is no doubt that Apple makes the best tablet around.  Right now, it is a confusing hodge podge of iPads.  Always look for at least one hundred dollars off the price of the iPad before purchasing, otherwise you are paying too much.  Right now, the iPad Air 256GB 5th gen is probably the best value if you can find it for 200 dollars off the list price as I was able to do.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Color wasn’t what I was expecting","reviewDescription":"Honestly there’s nothing wrong with this iPad, but all of the photos show this cute “yellow” as an option. When I opened the box though, I was disappointed to find it was a brassy color. After pairing it with a cute coral-colored case, it doesn’t look as pukey.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Voice to text still crappy as generation 5 was","reviewDescription":"I had to type because this on a10th generation iPad because it’s no better at voice to text than the 5th generation I have. What a waste of money","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684627200000}
{"reviewTitle":"Bad if you use Pencil","reviewDescription":"This iPad is such a bad experience if you want to use the Apple Pencil.This iPad only works with Apple Pencil Gen 1 and requires a special USB-C to Lightning adapter in order to make it work. If you turn off the iPad or Bluetooth for ANY reason, you can't use the Apple Pencil again until you hook it up to the iPad with the adapter and USB-C cord. Every. Single. Time.Literally the $20 knock off pencils work better because they don't require Bluetooth pairing to work. The only thing they can't do is pressure sensitivity.I don't understand WHAT Apple was thinking when it came to deciding that a USB-C based iPad should only work with a Lightning based Pencil. It's such a poor design and poor planning on their part for such an expensive device (which is, ironically, their \"budget\" device). And very unfortunate if you're out for the day and didn't think you'd need to carry both your USB-C cable *and* Pencil adapter just to make the two talk to each other again.If you plan to use the Apple Pencil and not a dupe, maybe look for a different iPad model. An older iPad that still uses Lightning technology will work great with the original Pencil. Far better than this.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680134400000}
{"reviewTitle":"??","reviewDescription":"No me agrada q solo se escuche de un lado mi iPad","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Bummer. The color is mostly...","reviewDescription":"\"metallic\" mustard yellow. I tried to take an accurate picture, but the lighting in my house is off.I think you'll be disappointed if you are looking for a \"true\" yellow tablet, especially as you compare it to other yellow items in your house.If you don't mind, the metallic sheen along with the slightly greenish tint, you'll be fine.","isVerified":false,"ratingScore":3,"reviewReaction":"66 people found this helpful","country":"United States","date":1667001600000}
{"reviewTitle":"So far it's not my \"cup of tea\"","reviewDescription":"It's not exactly used friendly. I've yet to be able to fully understand how to set it up.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680048000000}
{"reviewTitle":"Power hog","reviewDescription":"Power drains quickly, compared to the old one bought in 2019.  But it does charge quickly, going from 30% to 100% in under an hour.Faster than older iPad, but old speed was fine. Bought this for bigger storage","isVerified":false,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"Janice ztsnner","reviewDescription":"Have been able to get it converted to my other apple devices","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Efficiency","reviewDescription":"It’s  an asset  easy to maneuver in cyberspace and light enough to handle taking with me.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Nice tablet","reviewDescription":"Took forever to get it and it wasn’t what I order should have bought from Apple store","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Ipad","reviewDescription":"The product is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Definitely get one with larger storage","reviewDescription":"The 64gb will not do it. Definitely get the bigger GB","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Good","reviewDescription":"Good products.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"I love iPhones & iPads but this iPad has some technical issues","reviewDescription":"I think I got a lemon. I have loved iPhone & iPad products for many years but this iPad has some issues. Some apps, when I rotate the screen, freezes up the iPad and I have to close the screen. When I try to unlock the iPad to reopen and restart the app, nothing happens! No Lock Screen shows up, nothing at all happens when I push the power button. This sometimes lasts several minutes before a Lock Screen appears so I can open\/unlock the iPad. Really frustrating! Otherwise this iPad works pretty well.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Upgraded iPad","reviewDescription":"Needed a new iPad because the old one had a scratched screen and ran ever so slowly. This iPad is nice looking and has a longer battery life but not the all day as advertised. I had a few glitches transferring the info from old to new but overall I really like this iPad.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Horrible battery life","reviewDescription":"This is my first iPad so I only have android tablets to compare. Uses battery very quickly, it is worse with using Bluetooth. I lost original cord and new cord charges extremely slow like 10% after 30 minutes charging. I like the programs and love using it but charged and battery life is frustrating. I don’t like using blue tooth headphones but there is no headphone Jack for regular headphones.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Correct color description","reviewDescription":"Not yellow, it's yellow gold.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Nice design bad battery life","reviewDescription":"I like this new design updated from last year, only issues I'm having with this device is that sometimes battery gets really hot after awhile and battery life doesn't last that long,maybe because I bought it as amazon warehouse but I'm not sure.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697414400000}
