{"reviewTitle":"Great toothbrush if it worked as intended","reviewDescription":"I really enjoy the feel of this toothbrush.  It has a great time to help manage your zones which is very helpful and connects to an app that provides further guidance.  This would be a solid 5 stars if not for the fact that my toothbrush stopped working for the premium payment I made.This model is intended to have 3 brush settings which is one of the main reasons it is a bit more than the model that has 1 brush setting.  It worked as intended for the first couple days and I could flip between the 3 settings.  Not sure if it is the app controlling this but it suddenly stopped offering all 3 settings and now just has 1 setting.  I checked the app to see if I accidentally turned the other 2 off and I did not.  I even told the app to reset the settings on my toothbrush to no luck.  Why pay a premium for this brush if it doesn't work as intended?  Just glad I didn't go for the much more expensive version with 5 settings.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1648339200000}
{"reviewTitle":"It's great...when it's wants to work","reviewDescription":"This is a great toothbrush but if I had it to do again, I would NOT buy a Bluetooth toothbrush.  When working, this is a great toothbrush.  Unfortunately, after owning it only 5 weeks it twice disconnected from the app, thus leaving me with only one speed.  Twice I spent a lengthy period of time in the CHAT feature of OralB.  I anticipate the brush disconnecting from the app again.  It's under warranty, but now I've got to pay to mail it back to OralB, leaving me without a toothbrush.  Return window on Amazon ended.  Cannot recommend this toothbrush.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"Works well but we don't use the Bluetooth","reviewDescription":"Update: stopped working just after a year. My son is pretty careful with electronics so I have no idea what went wrong with his brush. I had bought 3 different models and this one is the only one that no longer works. My daughter's cheaper Minnie Mouse model I know has been dropped a lot and it still runs. I fully expected to replace hers before his.My son loves black and he thinks the brush looks cool. He is 8 and doesn't mind using it. He thinks it takes the work out of having to brush his teeth.  We don't use the Bluetooth at all and that's really why we got this model. It is just not that convenient.  We bought 2 others for adults with the Bluetooth and we don't use it either. I would definitely recommend though as his teeth look brighter.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1589241600000}
{"reviewTitle":"You can't replace the battery without damaging the toothbrush.","reviewDescription":"This is not eco friendly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"App not as advertised","reviewDescription":"The app only shows the timer not the mouth which is why I bought it for my son false advertising there","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673481600000}
{"reviewTitle":"Died twice in first 10 days","reviewDescription":"I've had this toothbrush 10 days, charged it fully when it arrived, and this is the 2nd time it's died on me. Talk about poor battery life.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648252800000}
{"reviewTitle":"Bad battery Life","reviewDescription":"This one broke exactly in 13 months. It doesn’t have along battery life and not value for money. Disappointed with oral-b.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"Terrible app and tracking","reviewDescription":"So major selling point is the ability to track habits, but the app is terrible and fails every other session at least. Product is otherwise ok, if a bit cheap feeling in terms of how its brush heads connect and the device attaches to the base. Dont buy for the bluetooth functionality for sure.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1576281600000}
{"reviewTitle":"very loud","reviewDescription":"this was so loud it didn't matter how well it worked, it was disruptive to my partner and uncomfortable to use because of the noise. returned and back on the hunt for a more quiet version.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"Bluetooth stopped working after 2 days","reviewDescription":"It's still a good toothbrush, but the main reason I paid for the upgrade from the 1000 was being able to track my brushing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618617600000}
{"reviewTitle":"Great toothbrush","reviewDescription":"I recently purchased the Oral B 1000, but returned it as the grip was too slippery when brushing (poor design).  For $40 more this one doesn't slip when it's wet.  It also has a \"smart\" feature to use the brushing app (not important to me).  This brush feels like a nice tooth cleaning experience.  I purchased it to replace my Sonicare and I also prefer it to the Sonicare.  I would have given it 5 stars, but it's noisy and the on\/off button is a little harder to push than the Sonicare.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Es un poco caro, espero que valga la pena la inversión","reviewDescription":"Ojalá que la batería tenga más vida útil que en el Oral B 1000","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"I like it a lot, buts it’s SO loud!","reviewDescription":"I love the tooth brush but it’s SO loud","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Some downsides but does a great job!","reviewDescription":"I don't love this toothbrush but I love how it cleans my teeth. I had a Phillips Sonicare for years that I absolutely loved but it didn't clean my teeth nearly as well as this toothbrush.The Cons:The Oral B is really loud. It sounds like a jackhammer in your mouth. Everyone in your house is going to know you're brushing your teeth.It doesn't have an automatic shut off after 2 minutes (my Sonicare did). You have to scroll through the settings if you want to turn it off. Not a deal-breaker but annoying, nonetheless.The battery lasts a week and takes 12 hours to fully charge. My Sonicare lasted longer and charged faster.The Pros:In a little less than two weeks of 2x a day use, it has removed stains from my teeth. Both on the backs of my teeth and around the gum line. The stains that my dentist usually has to spent time scraping off are almost gone.My teeth are whiter. Not blindingly white, but noticeably whiter (maybe a couple shades). I haven't changed my habits, this is due to the toothbrush. I'm a coffee drinker and a smoker and my teeth are still whiter.I was originally going to return this toothbrush and buy another Sonicare but after seeing the difference in my teeth in a short period of time, I'm keeping the Oral B. I can live with the noise and the charge time if my teeth look better.","isVerified":true,"ratingScore":4,"reviewReaction":"64 people found this helpful","country":"United States","date":1607385600000}
{"reviewTitle":"Loud","reviewDescription":"The toothbrush is fine but a huge drawback is how loud it is. Fairly sure the entire house can hear when I am brushing my teeth. Other than this, no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"Great Machine with one caveat","reviewDescription":"One thing about Value for the price. If you purchase something at one price and the next day the price drops 18 dollars, Amazons solution is for you to return it and buy it again. There will NOT be a refund of the difference, regardless of what information you might find on Google. Not that I am a business major, but it seems this would cost more in overhead and restocking plus the fact it is a USED toothbrush but what do I know?On to the brush. It takes some getting used to, the first use being like a jack hammer in your mouth, but man, do your teeth feel clean. You can also feel it work under the gum line. I would highly recommend this brush, especially at the LOWER price.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1633219200000}
{"reviewTitle":"Oral B electric toothbrush","reviewDescription":"Works well at cleaning teeth, a little noisy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681689600000}
{"reviewTitle":"Clean teeth","reviewDescription":"Works as described","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"worked well very loud","reviewDescription":"it worked great but its loud as a power drill. just get the sonic care","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"Kind of harsh","reviewDescription":"I wanted a toothbrush that is similar to what a dentist might use.  I find the spinning brush is pretty harsh.  Unfortunately, my teeth are pretty sensitive and so far this brush hurts.  I'm going to keep using it a while to see if my teeth adjust.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1636934400000}
{"reviewTitle":"Excellent toothbrush","reviewDescription":"Here is my entire saga:For many years, I was using a Sonicare battery-operated toothbrush (the Power-Up).  But Sonicare stopped making brush heads specifically for that toothbrush.  So I bought some generic replacement heads on Amazon:https:\/\/www.amazon.com\/Sonicare-Toothbrush-Powerup-Toothbrush-Phillips-Replacement\/dp\/B01MRQXZF0\/ref=mp_s_a_1_4?crid=5JRHROZDAQ1&keywords=pearl+enterprises+replacement+brush+heads+compatible+with+oral+b&qid=1675732000&sprefix=%22Pearl+Enterprise%2Caps%2C96&sr=8-4The heads felt harsh, and they became detached from the handle.  After I would brush my teeth, I would feel so tired, I had to take a nap.  I decided it was time for a change.  I bought the Oral-B Smart 3000 because it’s their cheapest toothbrush that has a sensitive mode (I have sensitive teeth).  (For those with periodontal disease, I would recommend the Smart 5000. For those with neither condition , the Smart 1000 should suffice.) The Smart 3000 is MUCH GENTLER than my battery-operated toothbrush was.  In addition, on the advice of Oral-B customer service, I bought their softest replacement heads—their Gum Care replacement heads.  In addition, I decided to buy Crest Gum Care mouthwash.  This was definitely the right combination of products for me.  In addition, every time before I brush my teeth, I clean the bristles of the toothbrush with alcohol and liquid Ivory Soap.  My gums immediately felt better, and my teeth were cleaner.  I no longer felt tired after brushing my teeth.  There was only one slight problem—the red indicator light that was supposed to go on if you apply too much pressure wasn’t going on.  Then it was going on at the wrong time—as I was turning off the toothbrush.  The solution was to call Oral-B customer service.  They helped me to reset the toothbrush—then I had to re-pair it with the Oral-B app.  So I did not have to return the toothbrush.  Now, after 3 weeks, it’s great.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"Being cordless and rechargeable","reviewDescription":"5gEasy to use and to store.Great performance.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Good","reviewDescription":"The battery life on this is good. I would say this tooth brush works great for the cost!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"I purchased the 1000 first and was disappointed.","reviewDescription":"I have used an Oral B electric for years but it was tired. I bought the 1000 and returned it; the on\/off button was to flat and difficult to turn on and off. I talked to the factory about that issue and they suggested the3000. THIS IS A GREAT PRODUCT. Easier on and off as well as the timing indicator is much more evident as you brush.Spend the extra, your teeth will feel clean, fresh and look wonderful.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Forms good habits","reviewDescription":"First thing that hit me about this brush is the power. I’ve used a few cheap electric brushes and never expected the difference to be so extreme. This one actually feels like it’s cleaning. Second thing I like is the app\/timer. The brush lets you know by pulses every 30s with more pulses for the 2min mark but the app shows the timer and then asks if you had gum bleeding (I did the first 2 times) then it reminds you to brush your tongue, floss, and rinse with mouthwash. The flossing reminder actually got me to floss more often. Overall I think this brush actually helped me improve my brushing and flossing habits.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1671148800000}
{"reviewTitle":"Prevents Me From Brushing Too Hard","reviewDescription":"Has good battery life and reduces to have speed when battery is low. It never stops mid brush. When it slows, finish brushing and then charge. If you press too hard when brushing, a red light flashes to warn you. even if you aren't in front of the mirror, you can still see the red light","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Very good electric toothbrush","reviewDescription":"Has three different speeds which I like. Efficient cleaning. Light weight but comfortable to use. Chargers quickly.  Fair price. Has a red light that flashes if pressing to hard.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675123200000}
{"reviewTitle":"Excelente inversión para la salud bucal","reviewDescription":"La bateria tiene una autonomia de alrededor de 1 semana, y se mantiene luego de 1 año de usoLos cabezales sensitive permite un cepillado sin lastimar las enciasAltamente recomendado","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"Spendy","reviewDescription":"Expensive","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Good toothbrush","reviewDescription":"It seems to do a good job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"A toothbrush that's a little misleading","reviewDescription":"Like other reviews say, this is ... a toothbrush. It has minimal features available online via the app that are essentially mimicked by the toothbrush itself. It does not track where in the mouth that a brushing occurred. There are other toothbrushes on the market for a cheaper price that will do the same thing and more. That being said, I felt it did a great job in cleaning my teeth and since I already opened the packaging and used it I have no real choice but to continue it, even though I am slightly disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Great toothbrush WHEN it works","reviewDescription":"Have used this solely as my toothbrush for almost 4 months now. Battery went from lasting over a week to now needing to be charged after every use. Very annoying for it to die mid brush when it shows the fully charged green light.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1680048000000}
{"reviewTitle":"Stopped working","reviewDescription":"As much as I loved this toothbrush, it stopped working after only 3 months use. Great while it lasted","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676505600000}
{"reviewTitle":"I'm not qualified to review.","reviewDescription":"My dentist recommended an electric toothbrush. This was the first one I've ever owned. I'm 70 years old, and I believe they have been around for 60 years. Since its new to me, I can't really give an opinion. I paid a price that I thought steep, but not nearly what some were selling for. What can you possibly get for $250 or more that you don't get for $80?So far, the battery life seems ok. I haven't recharged it yet, using it over twice a day for 5 days.I wouldn't consider any toothbrush \"giftable\".","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1646870400000}
{"reviewTitle":"Very aggressive brushing","reviewDescription":"Although I believe these are better than a manual toothbrush, this one hurt my teeth because of how aggressive it was when active.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1674604800000}
{"reviewTitle":"Charging Station Not Working","reviewDescription":"The toothbrush seemed to be great while it had power, but I can't charge it.Additionally, it took a very long time to arrive. 😑","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1652832000000}
{"reviewTitle":"Great brush, bad as a smart device","reviewDescription":"In order for the Bluetooth features to work, you have to have the app open while you're brushing your teeth.It won't just keep track in the background and let you know how you're doing at the end of the week.I love the brush but the bluetooth\/app part is nearly useless.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1624492800000}
{"reviewTitle":"No Brush head covers?!","reviewDescription":"I haven't even used it yet but am peeved already that there are no brush head covers. I purchased two packs of brush head replacements as well and they don't have covers either. Very disappointed that I'll have to order brush head covers separately.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627084800000}
{"reviewTitle":"Just an okay tooth brush.","reviewDescription":"This toothbrush is loud. It did not come with any additional brushes. You would have to order more. It was a hard toothbrush. I sent it back!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1637452800000}
{"reviewTitle":"Decent toothbrush","reviewDescription":"Overall I prefer oral-b toothbrushes I basically got this model for the sensitive mode.  I wouldn't say this is a huge difference from their cheaper models.  Bluetooth stuff is a waste of packaging and time I honestly see no point in this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1595894400000}
{"reviewTitle":"So glad I bought this!","reviewDescription":"I'm loving this toothbrush. My teeth feel dentist clean each time I use it! I love how it lets you know when you've brushed enough. It easily reaches my hard to reach back teeth. And, the different settings is a nice addition. The battery last a good long while. It truly beats manual brushing hands down!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1589932800000}
{"reviewTitle":"Works great","reviewDescription":"Works great. The only thing I don’t love is the fact that you have to press the button three times to cut off (through the cycles of speed).","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618790400000}
{"reviewTitle":"It’s good","reviewDescription":"It’s a little loud and not as smooth as the higher end models but serves it purpose!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624060800000}
{"reviewTitle":"Nice","reviewDescription":"Love it. Brushes well. Love the blue tooth. Great brush but shouldve come with more than 1 toothbrush head. So make sure u buy more if u want more than 1.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1602806400000}
{"reviewTitle":"Great brush that addresses all teeth or gum issues.","reviewDescription":"I really like the updated movement of the brush head. I especially like the vibration every 30 seconds to change quadrants.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609200000000}
{"reviewTitle":"Brushing My Teeth has never been more fun","reviewDescription":"I love how these smart series toothbrushes promote healthy brush habits.I love the fun intuitive app.I only wish that it was a easy way to change programs. This only has one brush.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1589932800000}
{"reviewTitle":"Oral B the best for your money","reviewDescription":"I really like this rechargeable Oral B, as I've bought 3 but one been getting weak even always being on charger 24\/7 but now it wasn't flashing, 2nd thoughts?","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1583625600000}
{"reviewTitle":"Future is here","reviewDescription":"Works great. Definitely keeps my arm from getting tired","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1614124800000}
{"reviewTitle":"Good for the price.","reviewDescription":"Great toothbrush. Like the 3 speeds. Good item for the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578873600000}
{"reviewTitle":"Great","reviewDescription":"It was a gift for my daughter. She loves it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577750400000}
{"reviewTitle":"No bluetooth","reviewDescription":"The Bluetooth function on my toothbrush does not work. I tried everything with the app. I tried it with my samsung note 10 and my samsung tab s7. Other than that it works ok. I don't find it anything special. A cheap toothbrush will work just as good.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1607126400000}
{"reviewTitle":"Works well but the battery life is very bad","reviewDescription":"Works well but the battery life is very bad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1613692800000}
{"reviewTitle":"One of the cheapest toothbrushes!","reviewDescription":"I wish they provide a travel case!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622073600000}
{"reviewTitle":"Great toothbrush.  Did not come with the listed accessories.","reviewDescription":"The listing said it came with a case and additional brushes.  It did not.That is why the lower reviews.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1580601600000}
{"reviewTitle":"Battery issues","reviewDescription":"Battery is not lasting","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1572134400000}
{"reviewTitle":"Good","reviewDescription":"Best thing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Not worth the current asking price of $89.","reviewDescription":"Got mine for half that. I've owned different models of oral b electric toothbrush's over the years, both rechargable and battery operated. The one I was replacing with this 3000 series was a $14 \"vitality\" model which served me well over the past few years and still works.I thought about upgrading after doing research on higher-oscillating & pulsating toothbrushes and how they did in fact, clean better than lesser-oscillating & pulsating brushes. I decided to upgrade.I'm not going to use the bluetooth feature since #1 I should know by know how to brush and #2 it's a gimmick. The main reason I bought the 3000 were the higher oscillating & pulsating feature along with the pressure sensitive light. The former works fine while the latter is a joke if you consider just how hard one would need to press down on the teeth\/gums to get it to light up. Battery life is what's stated, although if the tray which can be separated from the charging dock is used stand alone, either the length of the entire toothbrush or the stiffness of the power cord 7 times out of 10 knock the whole thing over.The motor is also extremely loud (less so on the lower setting but still obnoxious enough to wake a still sleeping wife\/husband in the adjacent bedroom. In addition, oral b's ubiquitous round brushhead have gotten noticeably bigger from those of yesteryear.All in all I was expecting to be pleasantly surprised but instead got a very solid \"Meh.\"P.S. - The instructions state the unit can be kept on the plugged-in charging dock without worry regarding shorting battery life, but many reviews on here have complained the battery stops working after a few months, so I wouldn't leave it charging all the time.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1563408000000}
{"reviewTitle":"Battery dyed fast","reviewDescription":"Battery dyed fast","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1585612800000}
{"reviewTitle":"Smart features is a joke","reviewDescription":"Upgraded my older electric OralB to this one so I can get the pressure sensor because my dentist recommended it and smart features they advertise for the app. I thought “oh cool, they have a screenshot of the app with your jaw showing where you brushed and where you missed. There must be a gyroscope or something.”  Forget it. Connection to the app is basically just to display the 2m timer that the brush warns you about anyway. That’s it. The rest of the app is just ads, question-answer type of “dental care” and useless badges as if I’m a toddler. The pressure sensor is useless too, in my opinion. In order to trigger the light to come on while brushing I gotta press so hard it hurts as hell. I can’t imagine a reasonable person applying so much pressure so the lights tells them to cool off. If I knew that, I would’ve gone with a simpler model that doesn’t have those meaningless features for 1\/3 of the price.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1679788800000}
{"reviewTitle":"Oral B 3000 works well but needs better Bluetooth support.","reviewDescription":"I recently bought the Oral-B 3000 for myself. No one else in the house has this type of brush so I did not have any problem using the Bluetooth and connecting to the app. I find the brush has just the right amount of power, and my teeth feel quite clean when I’m done brushing. I haven’t had it long, but so far the battery has held out quite nicely with one charge per week. I gave the brush an overall low rating because of the advertising. I did a lot of research before purchasing this brush because this is one of the more expensive brushes I have bought. I was specifically looking for a brush that would identify brushing errors, but the Bluetooth it connects with only indicates timing and general information. Considering a regular toothbrush can be purchased at the dollar store, and the advances in technology, I feel that the amount of money for a toothbrush of this caliber should include more technology. The advertisement showed that it connected to Bluetooth but was not clear as to how the brushing was supported, and I feel this was somewhat deceptive. Since I find the brush itself works quite well, I will be using it regularly. But I do not feel I need to go out and spend hundreds of dollars for a simple apparatus such as this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1649980800000}
{"reviewTitle":"Not worth it","reviewDescription":"After 1 week of using it, the black part of the handle started breaking apart, as you can see in the pictures. I'm not even being rough with it, i'm just using it normally. The motor of the toothbrush is also not as strong as i thought it would be. If i push slightly too hard, it struggles. Also, the red light lights up each time you press too hard, but you really don't have to press that hard for it to light up. The result is that i have a glaring red light in my eyes most of the time, no way to turn it off. Can't say anything about the bluetooth connection, didn't try to connect it to my phone.My final opinion is that i should have opted for another oral b model. And definitely not with the black decoration, since it's cheap and doesn't resist at all. It still works, but it's disappointing to have something half broken after just 1 week. Doesn't live up to my standards.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1663372800000}
{"reviewTitle":"Pricey for a toothbrush","reviewDescription":"Pricey for the toothbrush even when on sale. Came with a brush head that was stiff had to buy soft head. Tooth brush doesn’t turn off after the 2 mins timer just keep telling me it’s been 30 sec. Haven’t tried Bluetooth yet probly won’t I think it might been better if to get those $30 one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1638403200000}
{"reviewTitle":"Good tooth brush","reviewDescription":"The tooth brush is a bit loud but works good. Battery life is good also. I also use the app, not necessarily needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1581206400000}
{"reviewTitle":"Great battery life","reviewDescription":"Battery lasts about 2weeks. I brush twice a day everyday and it’s awesome! Great for travelling don’t need to pack charger for weekend away","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1593561600000}
{"reviewTitle":"Love it!","reviewDescription":"I never thought I could love to brush my teeth!  But after purchasing the Oral B, I am truly amazed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Only brush to own","reviewDescription":"This is a fantastic electric tooth brush. Feel like I just left the dentist every time I brush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1588032000000}
{"reviewTitle":"Great cleaning","reviewDescription":"My husband loves it. He got rid of his sonic","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1612137600000}
{"reviewTitle":"great upgrade","reviewDescription":"replaced my old 3000 after 5 years, love this brush. worth every cent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1607644800000}
{"reviewTitle":"Came fully charged.","reviewDescription":"Doctor recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"Love!!","reviewDescription":"Dentist clean feel!! First time to own one of these and I'll never go back to a normal toothbrush ever again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1576627200000}
{"reviewTitle":"Awesome","reviewDescription":"Best toothbrush ever. Dont think I could go back to regular brushes","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1609200000000}
{"reviewTitle":"A great toothbrush.","reviewDescription":"Works very well, battery strong last and lasts before recharge, a great product. I would recommend this to everyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1580342400000}
{"reviewTitle":"Good Powerful Toothbrush","reviewDescription":"This is the best toothbrush for the price. Although I don’t care for 3 different speeds.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1587427200000}
{"reviewTitle":"Great product, good mouth tool","reviewDescription":"Bought this as a gift for my son. He loves it, charger is sleek and match’s his bathrooms decor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Works great","reviewDescription":"good brush and oral-b is a really good brand I think i will buy one also","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1586044800000}
{"reviewTitle":"Electric toothbrush","reviewDescription":"I bought this for my husband and he said it has a lot of power to brush your teeth","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1577923200000}
{"reviewTitle":"Great Toothbrush","reviewDescription":"It's exactly as it was represented in the description of the product.  Works well and is stylish.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"Long Battery Life","reviewDescription":"Great toothbrush, 3 settings and long battery life.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"nice","reviewDescription":"Bought for my girlfriend, now I want one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1609804800000}
{"reviewTitle":"Good habits","reviewDescription":"Have brushed twice every day since I bought it. Much cleaner teeth definate improvement over regular brush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1570320000000}
{"reviewTitle":"It is a reliable toothbrush","reviewDescription":"We use it to brush our teeth (obviously!) and it does a fine job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1579219200000}
{"reviewTitle":"Oral b power","reviewDescription":"Works excellent a lot more power than the previous one I had highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578614400000}
{"reviewTitle":"Love it","reviewDescription":"Love my toothbrush highly recommend over manual.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1641254400000}
{"reviewTitle":"Oral B\/Braun wins!","reviewDescription":"Had a sonic care. I find Oral B to be a better brushing experience; better brushing action, teeth and gums look and feel cleaner.. The Braun handle is powerful too.Black handle and brush head head are my husbands favorite. Holds a charge for two weeks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1563494400000}
{"reviewTitle":"Great product","reviewDescription":"I have been using this for 3 months now and love it.  My hygienist said my teeth were great. If definitely does a great job at cleaning and reducing plaque buildup","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1599177600000}
{"reviewTitle":"Happy with Oral B purchase","reviewDescription":"I love it.  Does what I expected.  I had my last Oral B rechargeable toothbrush for 22 years before it stopped recharging.  Only time will tell if the quality is still that good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1584921600000}
{"reviewTitle":"Happy thus far.","reviewDescription":"So far I am extremely happy with this toothbrush. I can tell the difference between this and my sonicare. My teeth feel so much cleaner. I hope it lasts a long time. But so far, so good.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1589155200000}
{"reviewTitle":"Perfect Oral Care","reviewDescription":"It’s a perfect product when it comes to oral care, you can use it easily with the required pressure all over the mouth, if you put more pressure brush indicates","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1594252800000}
{"reviewTitle":"Great brush","reviewDescription":"I've had electric toothbrushes for years and it shows. I get complimented by my dentist every cleaning. Oral B is awesome. I have gotten all of the kids one too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1585612800000}
{"reviewTitle":"Good toothbrush at good price.","reviewDescription":"So far so good. I have the more economical models. My son has had the same one for 5-6 years. He loves it. I feel like I’m getting a good cleaning.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1599955200000}
{"reviewTitle":"My 1st electric toothbrush","reviewDescription":"Awesome product, I use it 2x a day and it works perfectly.  I’m very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1618531200000}
{"reviewTitle":"Best toothbrush!","reviewDescription":"I love that this toothbrush gets my mouth super clean. It is a nice size and light weight. Had a spell design as well. I also love that it battery life is long lasting between charges.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578528000000}
{"reviewTitle":"this electric tooth brush works better than going to the dentist","reviewDescription":"My wife and I have used many types of electric tooth brushes over the years but eventually went back to the toothbrush due to the fact the all the electric ones we bought either broke down after a short period of time or the batteries  constantly needed replacement.  This one now is different.  It cleans better than the dentist.  It is easy and pleasurable to use and it comes with a charger that you drop the toothbrush onto when you are finished. No battery replacements.Excellent.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1578787200000}
{"reviewTitle":"Great Scott!! Where we are going, we don't need toothpaste!","reviewDescription":"Super happy with this purchase.  I bought it to replace an older Oral B Smart Toothbrush that lasted about 4 years until the motor stopped working on the unit.  This one works great, the battery lasts a long time and very happy with it.  Way to go Oral B!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1629676800000}
{"reviewTitle":"Excellent toothbrush!","reviewDescription":"I bought this as a replacement for an older Oral B (at least 5-10 years old). We had purchased replacement heads recently for the old one, but the battery would need to be charged daily. My husband LOVES his new toothbrush, and the old one went into the trash immediately! We kept the replacement heads we had and they fit the new one, so that's great. He said it cleans so much better than the old one, and he's thrilled!  Great price for a great toothbrush!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1578009600000}
{"reviewTitle":"Quality toothbrush","reviewDescription":"Used this toothbrush for a good month now and its been really good.  I first started using its bluetooth feature then I decided just to use it without the app. but the app shows you the time and gives you tips and little awards.  So far so good I get a good 6 day brushing 3 times a day before the battery starts blinking and you can feel the power weakens.  Buying new brushes very soon.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1590451200000}
{"reviewTitle":"Oral B 3000 Smart Brush","reviewDescription":"Love this Toothbrush. Let's you know when to move to another area and also when 2 minutes of brushing is up. My teeth feel super clean.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1648857600000}
{"reviewTitle":"Best Toothbrush Ever","reviewDescription":"Oh yes, this is a wonderful toothbrush!  It really does last a week or more of battery life.  I purchased a toothbrush of a different brand but a well known brand.  I hated it and didn't feel like my teeth were clean.  I then purchased another Oral B it felt so good.  I won't ever use another brand of electric toothbrush,  I just love this Oral B!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1578268800000}
{"reviewTitle":"WORKS GREAT","reviewDescription":"This is my first electric tooth brush, so I have nothing to compare it to. But I have enjoyed it. I waited for a while to write this review to see if there were any issues. Seems to work very good. My dentist recommended this to me for better brushing protection, so I did it. Haven't been back to see her yet, but am anxious to see if she notices any difference.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1583107200000}
{"reviewTitle":"RIP OFF","reviewDescription":"Lasted less than a year. Purchased extra chargers, replacement heads and travel cases. What a waste!! If you enact the warranty, be prepared to be without it for up to a month while they detect what's wrong with it. How about send out a new one and use my defective one to learn from your defect. Really??","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1605398400000}
{"reviewTitle":"Great Toothbrush","reviewDescription":"I love this toothbrush. It makes my teeth and mouth feel very clean and I love how it tells you how long to brush for. I haven't had any issues with it and it is extremely easy to keep clean as long as you rinse it after every use. The nice container to hold the brushes and the handle is very useful too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1598140800000}
{"reviewTitle":"Love the braun toothbrushes","reviewDescription":"I love this toothbrush so far.  The last one I purchased the 1500 was great at first, then it started loosing charge and the battery light stopped working.  It's a little too early to tell with this one.  It's neat to see my progress on the app.  I didn't buy it for the app. though.  I bought it for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578268800000}
{"reviewTitle":"Awesome","reviewDescription":"This was my first electric toothbrush and it has worked well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1621641600000}
{"reviewTitle":"Very excellent","reviewDescription":"This product is good in cleaning the inner part of the teeth and I loved it. For some reason the power of the  brush gets weaker.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1583712000000}
{"reviewTitle":"I'm a believer","reviewDescription":"I was a skeptic when it came to electric toothbrushes. This helps me become a believer. Simple, affordable, replaceable heads. Our favorite feature is the 2-minute timer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578700800000}
{"reviewTitle":"My Dentist is Frustrated","reviewDescription":"My dentist is frustrated with me after I bought this. Mostly cause now my teeth are way cleaner and he can't charge me more for extra dental work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578528000000}
{"reviewTitle":"Does the job","reviewDescription":"I bought this as a gift for my son-in-law, he is very pleased with it.  He already had  one like this but needed it replaced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578009600000}
{"reviewTitle":"Great feel","reviewDescription":"My teeth feel like I just came from the dentist every time I brush!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1622505600000}
{"reviewTitle":"Good value","reviewDescription":"We love this, bought after dental hygienist recommended one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1629331200000}
{"reviewTitle":"It is what I expected.","reviewDescription":"The use is obvious.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1636156800000}
{"reviewTitle":"Best Buy of the year!","reviewDescription":"Works great! Already can tell a difference fromThe regular toothbrush","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1622246400000}
{"reviewTitle":"Great product","reviewDescription":"Great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1641513600000}
{"reviewTitle":"very clean teeth while it still worked","reviewDescription":"BEWARE OF A POTENTIAL FOR FAULTY BATTERY IF YOU FLY.I've had it for not even 6 months where it worked perfectly fine & was superbly better than my old toothbrush. Way better clearn. However I flew in a trip ONCE about a week ago and it stopped being able to hold charge.I've used the default charger before and it worked fine for charging, but it suddenly stopped being able to hold charge. I've bought a replacement charger to use thinking it was a faulty charger but I think its the toothbrush itself after running through two different chargers on my toothbrush, when they work on another electric toothbrush in my household. Its been blinking red for a week now and I'm not too sure if spending $87 for it again is worth it for a potentially faulty battery. If you fly.I havent had issues for the 6 months that I've had it & changed the brush head twice from when I bought it. It worked like new with each new brush head change. But i'm not sure what I can do about it not charging anymore. I'm probably just going to go with another brand since this one seems to have something messed with it upon going on a plane..","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"Jackhammer in mouth. Bad app. Poor charging","reviewDescription":"I really wanted to like this toothbrush, but it definitely has some flaws.  I'm switching from a disposable electric toothbrush (which has lasted at least 4 months so far).  Thought I would upgrade to the real deal.It was fully charged when i left it at home (off the base) for 3 days.  Tried turning it on and nothing.  Put it on base to charge back up.Used it once, and it shut off mid-brushong (after 1.5 minutes).And the app rarely connects.  It always gives me an error to put brush back on charger and start over.  Seriously?  Im brushing my teeth.  Shouldnt have to do a reset.  This thing sucks!Oh. And did I mention it feels like a jackhammer in your mouth?  Clean teeth, but it gives me the goosebumps...not a good experience at all!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"Better options available","reviewDescription":"Stopped working after a year disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Oral tooth brush","reviewDescription":"I really don’t like this tooth brush it to bulky in my mouth when I take it out toothpaste flys everywhere","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Rusted after 1 month of use","reviewDescription":"I love Oral B and have had many toothbrushes before from Oral B and most last around 5 years before I need to get a new one. This time I got a more expensive one and it rusted almost immediately. I tried contacting their customer service but they just said the rust isn't covered by the warranty and to just clean it off periodically. So bad customer service and bad quality metal in the one I got.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686528000000}
{"reviewTitle":"Subpar to the 1500","reviewDescription":"The brushing strength is mayb half of the power of the 1500….I assumed it would at least b equal in its performance….will b returning itWho needs Bluetooth","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"Battery stopped charging","reviewDescription":"My battery has stopped charging. My husband has a similar model and it has held up for years and years but this model is completely dead. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Battery died completely after 6 months of use; impossible to get warranty service","reviewDescription":"Battery on toothbrush died and no longer charges. Went through all the Oral B warranty hoops and was told I would have a shipping label sent to me for them to repair the brush. Followed up several times to get the label and no response. I recommend buying from a brand with better customer service \/ that stands behind their product.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1661212800000}
{"reviewTitle":"Get a Sonicare instead","reviewDescription":"Battery dies after a week of use.  Feels like it’s made of cheap plastic.  My 5 year old Sonicare Toothbrush is better at brushing and holding a charge than this one is brand new. Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1672617600000}
{"reviewTitle":"RUSTS!","reviewDescription":"We got these 6 months ago. I clean the entire brush and base weekly and let completely dry before putting back together. All of the sudden, while cleaning last I noticed that the metal clip where the brush head attaches too on both of our brushes is RUSTED!!Who wants to put a rusted toothbrush in their mouths?! Regardless if it’s covered by the brushhead or not, it should not be happening. It was literally built to be a toothbrush!","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Damaged","reviewDescription":"Came opened and damaged. Looks like the toothbrush has been used","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"Canada","date":1637625600000}
{"reviewTitle":"Did not receive a case!","reviewDescription":"Very disappointed, did not receive a case as was mentioned by others who bought this toothbrush! I don't recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"Canada","date":1610150400000}
{"reviewTitle":"Garbage product.","reviewDescription":"Feels cheap. Wouldn’t charge. Don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"Canada","date":1623110400000}
{"reviewTitle":"This tooth brush does a great job of cleaning my teeth","reviewDescription":"teeth brushing  good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1598745600000}
{"reviewTitle":"Great for the cost","reviewDescription":"Works as expected","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1573776000000}
{"reviewTitle":"Good electric brush!","reviewDescription":"I like it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1553817600000}
{"reviewTitle":"Pretty good buy!","reviewDescription":"Love it for the price range!! Feels great on my teeth!","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599350400000}
{"reviewTitle":"Overall good  electric toothbrush for the price.","reviewDescription":"My dentist recommended I switch to an electric toothbrush. I must say it really work’s better than using a traditional toothbrush. I use it on sensitive mode and it cleans very well!  I like that it’s light weight my only issue is that the battery died after about a week and it takes over 3 hours to charge.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1595894400000}
{"reviewTitle":"Good investment","reviewDescription":"A toothbrush has no flavour.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609200000000}
{"reviewTitle":"Pretty good with a few quibbles","reviewDescription":"This brush seems to be pretty powerful, has all the basic features you want plus bluetooth.The bluetooth app may seem a bit gimmicky but you can register your toothbrush and it tells you what modes are set up for your toothbrush - which is important since the instructions contradicts itself.The modes out of the box are:Daily --> Sensitive --> PolishWith the app you can make Sensitive the default mode for example.Cleaning - only started using it but it seems to be pretty good.  The weird thing is, the toothbrush does not auto shutoff after 2min. It just buzzes and keeps on going.. whether you find that annoying or great is up to you... doesn’t seem to be changeable via the app either.You can set up the toothbrush on just the little charger stand, or attach it to the larger brush case. The instructions say to remove the brush head after each use and rinse inside\/out - but no one is going to be doing that.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"Canada","date":1618531200000}
{"reviewTitle":"Três bonne brosse à dent","reviewDescription":"Je l'utilise à tout les jours, le capteur de pression allume rouge. Plusieurs modes pour se brosser les dents","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1681171200000}
{"reviewTitle":"Variation on a theme","reviewDescription":"A good choice for the Oral-B line. Lithium ion battery, classic sturdy construction. The basic design has changed little over the years. Bells and whistles continue to revolve (evolve?) around Bluetooth connectivity and monitoring of brushing activities. Superfluous in these parts, but perhaps useful for a younger person who is learning to brush correctly, or someone who has opted for electric over manual. The P&G \/ Oral-B pictogram SKU circus remains the same. This model comes with a holder for several brush heads; not useful. No carrying case; would have been useful. Smile.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"Canada","date":1642204800000}
{"reviewTitle":"Make the switch","reviewDescription":"From a manual brush i think This is a great upgrade and price (mine was on sale)Teeth feel greatI struggle To just let the brush do it’s job- and have to stop myself from scrubbing instead of just moving the brush head along my teethAnd i dont Love the brush on my tongue vs a manual scrubBut great switch, and i do Feel some plaque decreased and whiting did happen after making the switch","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1642809600000}
{"reviewTitle":"Oral B is still the best","reviewDescription":"I used Oral B before switching to a BURST toothbrush to try to do better with my brushing. The BURST had the softest bristles I have ever used, but I had issues jamming the back of my small jaw like I do with regular toothbrushs. I decided to switch back to Oral B since I had less of a problem with the round brush heads.The toothbrush is loud, but WOW did it clean my teeth! The orange light on the back lights up if I am brushing too hard. I hardly have to apply pressure for this toothbrush to work so wonderfully. I am also not the best at flossing, but I found that I had a lot less plaque between my teeth after brushing than I normally did using the BURST toothbrush. As for the hitting the back of my jaw problem? That has been solved as I had hoped! I am able to brush on and behind my molars very well without striking a nerve.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1609459200000}
{"reviewTitle":"Awesome cleaning power","reviewDescription":"I have not used the app, as I do not need to track my brushing.  I like the power and the fact that it cleans well with less or no bleeding.  The written instructions are limited, but I think it flashes when too much pressure is applied.  The instructions say this means the battery is low, but it flashes intermittently (as best as I can tell), right off the charger stand.I feel confident it will increase the life of my teeth.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1659484800000}
{"reviewTitle":"Just love it! :)","reviewDescription":"I did a lot of research after my toothbrush of ten years broke (same brand). I loved my toothbrush from before and I really wanted the same features; everything seems to have gone high tech though. I just wanna brush my teeth as recommend without extra hassles or installing apps. I went with this one because it had the three settings like my old one had. Every 30 seconds it vibrates to let me know to move on, which was what I wanted. It does come with some sort of app option (I don't plan to use the app so I can't add my thoughts).I love the black look of this design. Mostly I love the deep clean and how I feel after using it. Once you try a high tech tooth brush it's hard to go back. This one has all the features my old one had and I just love it! I am not disappointed and would highly recommend. Great purchase, thanks :) Also very fast shipping.","isVerified":true,"ratingScore":5,"reviewReaction":"39 people found this helpful","country":"United States","date":1588204800000}
{"reviewTitle":"Love love love this","reviewDescription":"Great toothbrush. Been using an Oral B for years. This one is fantastic.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"I am very surprised!","reviewDescription":"It makes my teeth feel so clean! I was deciding between the 3000 and 5000 but especially for the price difference I am very happy. It is a bit loud but it does great work!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1674086400000}
{"reviewTitle":"Works great","reviewDescription":"I’ve been using oral b electric toothbrush for fifteen years. Needed a replacement. Was very happy with this new one. Works great. Love the three settings. Would highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674259200000}
{"reviewTitle":"Love this toothbrush!","reviewDescription":"I purchased this as a Christmas present to myself. Simply put, my teeth feel like I just cam from a dental cleaning—-every day!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1673913600000}
{"reviewTitle":"Just What I Needed","reviewDescription":"I bought this as a gift for my husband and it was perfect.  He liked the Bluetooth capability along with how clean his teeth are.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Works great","reviewDescription":"I feel like my teeth are so clean. It is a great tooth brush","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676246400000}
{"reviewTitle":"Works great","reviewDescription":"This is my second one. Works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Won't charge after 3 months!!!","reviewDescription":"For the first three months, everything was great. The toothbrush  was doing a pretty good job. The feeling of having a very clean mouth was nice. Til the day that it refuses to charge anymore.  So I've started to do some research. And i discovered that if i searched before i would never buy that thoothbrush. A lot of people are complaning about charging problem.I discovered that Oral-B was not a good brand at all","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1575504000000}
{"reviewTitle":"Damaged gums","reviewDescription":"I bought this for my wife and I. Even on the lowest setting the toothbrush is to ruff. My wife used it 3 times when she noticed her gums were raw and inflamed. We have gone back to our old brush now and refuse to use it. So we now have this useless, expensive toothbrush that will never be used. Very disappointing!","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1573171200000}
{"reviewTitle":"Quit working after 3 months","reviewDescription":"I bought this toothbrush and received it July 23rd. Today I noticed it was dying and when I placed it back on the charger, I realized the charger no longer works. It’s only 3 months old! It’s not a cheap toothbrush! Super bummed.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1572480000000}
{"reviewTitle":"6 months lifetime","reviewDescription":"I bought one July 2019，after normal use for 6 months, it no longer works. The bettery is so bad","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1579305600000}
{"reviewTitle":"Battery doesn’t last","reviewDescription":"Battery doesn’t last","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1608076800000}
{"reviewTitle":"Stops charging in less then a year.","reviewDescription":"Do not buy. I bought this item in July last year and it stopped working last week less then a year with the item. It stopped charging. I am very upset because it was actually a good product. Have to give it a 1 star bc it stopped working in less then a year.","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1591488000000}
{"reviewTitle":"It did not last 2 years","reviewDescription":"I used to love Oral B products and this was a replacement for my older one. But it is now less than 2 years and this was supposed to be an upgrade but already the battery is glitching. This seems less powerful than the  2000 that i previously owned","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"Canada","date":1698451200000}
{"reviewTitle":"Toothbrush came used","reviewDescription":"Very disappointing. The box was open, and the toothbrush itself looked used. (See photos) there was clear evidence that the brush was used beforehand, and the box itself was taped shut when it should have never been open to begin with.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"Canada","date":1690416000000}
{"reviewTitle":"Didn’t work at all.  Looked used","reviewDescription":"Terrible product","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"Canada","date":1663372800000}
{"reviewTitle":"USED TOOTHBRUSH!!!!","reviewDescription":"The box was completely tore open and re taped shut to look like it was new when it was received! Worst part is, I sent it as a gift!!!!! Brutal!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"Canada","date":1640822400000}
{"reviewTitle":"A good toothbrush overall.","reviewDescription":"Good overall electric toothbrush.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1646784000000}
{"reviewTitle":"Good brush, but","reviewDescription":"A good brush, but noisy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1640390400000}
{"reviewTitle":"Très bien","reviewDescription":"Tel que prévu fonctionne très bien je la recommande .....super","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1621123200000}
{"reviewTitle":"Fonctionne bien","reviewDescription":"Fonctionne bien, satisfaisant","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1633996800000}
{"reviewTitle":"Elle vaut  le détour","reviewDescription":"La sensation de propreté est instantanée.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"Canada","date":1616025600000}
{"reviewTitle":"Packaging damaged","reviewDescription":"Works fine but came with some scratches and marks.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Canada","date":1591228800000}
{"reviewTitle":"Great product with super fast delivery!","reviewDescription":"Perfect!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"Canada","date":1587427200000}
{"reviewTitle":"Great toothbrush","reviewDescription":"Love my toothbrush! Makes my mouth feel cleaner than it did when I used a regular toothbrush. The timing on it has also been helping me make a good habit of brushing longer and really cleaning my teeth gums and tongue.The Bluetooth aspect is very nice and great that I can see the timer on my phone but to be honest I stopped using the app out of lazyness but love that the toothbrush vibrates every 30 seconds to let you know how much time has passed and gives a different vibration once you hit that 2 minute mark with or without the app","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1600819200000}
{"reviewTitle":"Love it!!","reviewDescription":"To me, there was nothing to dislike!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"Surprised how much I love this toothbrush","reviewDescription":"I've been using Sonicare toothbrushes for years and have always been happy with them. However, when my trusty Sonicare finally failed on me, I decided it was time to try something new, just to see if I'd been missing out, and to my surprise I was. I genuinely feel like my teeth are cleaner. The round brush head makes me naturally focus on individual teeth and the addition of the rotary motion really does feel like it makes a difference both in the cleanliness of my teeth as well as with gum stimulation. I'm no dentist, but I am a fan!","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1584057600000}
{"reviewTitle":"Great toothbrush with included app.","reviewDescription":"Best electric toothbrush I've ever owned.The app really lets you know how well you're brushing and where you can do better.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"A great electric toothbrush","reviewDescription":"This replaced my Phillips Sonicare that I'd had for 11-12 years but its motor was finally starting to wear out. My wife has been using these Oral B toothbrushes for years and swears by them. So, I decided to finally convert. I used this the first time today and it certainly felt like it was cleaning my teeth a whole lot better and actually getting into the spaces between the teeth. I did download the app and am giving that a try as well. So far I'm very satisfied with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1595289600000}
{"reviewTitle":"Awesome","reviewDescription":"I bought this on a whim because I knew how great the round head would be for a great clean for my teeth! It has been amazing! The app that goes with it helps you see when to change quadrants (it vibrates every 30 seconds) and it tells you whether you applied too much pressure! I was told that with a regular toothbrush I was brushing too hard. Have been very pleased with this purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1611878400000}
{"reviewTitle":"Good","reviewDescription":"Better battery life than the basic one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"simple to use,very accurate","reviewDescription":"teeth feel cleaner just after three weeks!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1673136000000}
{"reviewTitle":"First battery operated toothbrush and I really like it.","reviewDescription":"I liked the ease of using it, lite weight.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1671494400000}
{"reviewTitle":"Amazing clean! Definitely worth the expense","reviewDescription":"My dentist recommended I get this toothbrush because “I’m getting older” (rude!) and “that means you’ll have more tartar build-up” (ugh!) - I used to love going to the dentist and then I hit 30 and I have more tartar because I’m old ... this toothbrush is great!  It’s been a couple months since the dentist and I don’t feel any buildup on my teeth - it feels like my young mouth again!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1607040000000}
{"reviewTitle":"Does it work","reviewDescription":"Like the Oral B. This is very fast and works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1643760000000}
{"reviewTitle":"Great toothbrush base","reviewDescription":"Really deep cleans your teeth! Amazing tooth brush. I would recommend buying Oral B Compatible Tooth Brush heads from LiveCoCo on Amazon for a zero waste lifestyle.  You can send them back and they sanitize and reuse them or fix damages.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1593475200000}
{"reviewTitle":"Works and feels great!","reviewDescription":"Works great! Been using it a couple months now and have no complaints. I love the way it feels on my gums that now I have a tendency to go over the time that is suggested to brush teeth. I rarely use the app though.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Works amazing. Great Price.","reviewDescription":"Value, quality and durability. Can’t help but boast about what a fantastic spin brush this really is.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1628294400000}
{"reviewTitle":"Great toothbrush, great seller!","reviewDescription":"Great product, fast delivery from seller!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Battery is lithium-ion.","reviewDescription":"Works great, good battery that is in fact lithium ion. About as loud as other electric toothbrushes but doesn't have that annoying high pitched sound that sonicare has.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1612224000000}
{"reviewTitle":"Thumbs up","reviewDescription":"It works. It arrived without damage. You can register your warranty and all that stuff with oral-b with easy instructions in the package. Love the black color. Certified seller. No complaints!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1607990400000}
{"reviewTitle":"Works well and lets us know how we are doing!","reviewDescription":"Item arrived as expected and on time. They were a present to my husband and myself for Christmas. They work well and interact with our phones to let us know how we are doing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1581379200000}
{"reviewTitle":"Perfect","reviewDescription":"It’s the perfect toothbrush. And quite an improvement from their last model.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1633910400000}
{"reviewTitle":"Great product to have","reviewDescription":"You get your moneys worth out of this product, cleans your teeth great. I would highly recommend buying this for someone who’s in the market looking for a new toothbrush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1590364800000}
{"reviewTitle":"Make another choice","reviewDescription":"Very disappointing.  I waited too long to return, unfortunately.  Changing speeds is clumsy and awkward.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1625270400000}
{"reviewTitle":"Too frustrating to turn off!","reviewDescription":"There are a ton of these Braun Oral B electric tooth brushes on the market.For some reason, I asked to have this particular one for a birthday present, now some years ago to replace and older model I'd had for years but no longer worked.I've actually been wanting to write a review for this model for quite some time as well, as each time I use it I'm frustrated when trying to turn it off after brushing my teeth.Unfortunately, the power off\/power on button is located such that after brushing your teeth, when trying to press the power off button with your thumb, it is not situated in the space where your thumb can easily press it to turn off without first having to scoot your hand such that your thumb is level with the on\/off button.The toothbrush itself works well, and I have no other problem with it. However, the frustration after a while... getting sprayed with watered down tooth paste having to readjust your grip on the toothbrush after brushing can be quite frustrating.This company needs to redesign this specific model such that the on\/off button is adjusted and it fits better in customers hands and can be turned off easily!","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Battery malfunction","reviewDescription":"Overall was great for the first few months, but then the battery died and now cannot hold a charge.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1599091200000}
{"reviewTitle":"after a year it will die","reviewDescription":"as the title says. If you take care of it It’ll last you a year, then the battery will die or you won’t be able to charge it anymore. If you’re ok with replacing it every year, it’s a good toothbrush, cleans quite well. But I want something that’s gonna last, especially for this price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1701388800000}
{"reviewTitle":"Not impressed","reviewDescription":"Solid basic toothbrush, but that's about it. This must be the \"dumbest\" and most useless smart object out there. Definitely not worth the added price. You won't get anything else than brushing time and overpressure report in there, both infos being transmitted by the brush itself (via timer and light). Probably better to only pay for the \"dumb\" version...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1642982400000}
{"reviewTitle":"You can find something cheaper.","reviewDescription":"It's brushes well but if you're buying for an app to motivate you go elsewhere. The Bluetooth is okay if you have your smartphone open next to you but even then it only makes it through a full cycle about 70% of the time. I'd recommend saving some money and avoiding oral b.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1617580800000}
{"reviewTitle":"I Like the Brush","reviewDescription":"I really like this brush. It feels like it cleans better than Sonic Pro brushes. But, I’m surprised Oral B doesn’t provide brush covers and travel cases. Fortunately you can buy them separately on Amazon, but I think Oral B should include them. I used the app the first time, but probably won’t use it in the future.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1598918400000}
{"reviewTitle":"Works really great! Teeth feel good afterwards.","reviewDescription":"I really like using it. My testy feel cleaner when I do. It connects with an app on my phone too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1639872000000}
{"reviewTitle":"Good bang for your buck, that's for sure.","reviewDescription":"Very durable with a very nice charging station. Only thing is that the heads don't last as long as I'd like, but that's most likely my fault. I'm new to electric toothbrushes and am a little too aggressive with them, I'd have to say. Overall when on sale make sure to buy, you won't regret it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1599350400000}
{"reviewTitle":"Returned","reviewDescription":"The one we received had been used so we returned it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"Pretty quiet, long battery life","reviewDescription":"this toothbrush is definitely the best one I have used. Good grip, 3 speeds, relatively quiet, and cleans teeth thoroughly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1634688000000}
{"reviewTitle":"Great toothbrush","reviewDescription":"I love this toothbrush. I have not had an electric toothbrush in years and my dentist recommended looking for one. After using it for about a month I can see the difference. My teeth are whiter and there is little to no plaque build up on my gum line. A+","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1581984000000}
{"reviewTitle":"Works great","reviewDescription":"I like the 3 settings","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1652313600000}
{"reviewTitle":"What a fantastic product.","reviewDescription":"This is the best electric toothbrush I’ve ever owned and I’ve had a lot of them, especially Oral B which was suggested by my dental hygienist. The brushing leaves my teeth feeling invigorated And the connection to my smart phone is just the thing I need to keep track of my brushing.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1575072000000}
{"reviewTitle":"Works good!!!!","reviewDescription":"I love this Toothbrush fell in love it after the first use so much better than manual brush only issue is that the app. is not user friendly but you can go around that..,","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1610323200000}
{"reviewTitle":"Works great","reviewDescription":"Works great and does a better job than regular brushing. I wish I had bought one sooner, and I think I could have prevented some cavities.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1618531200000}
{"reviewTitle":"Waste of money","reviewDescription":"Bought this for my son,a Christmas present. I have a older and cheaper version that I have had for 7 years and it works perfectly . This very expensive one only lasts 6 months. He tells me that it only worked for 2-3 months before it stopped charging and now will not work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1624924800000}
{"reviewTitle":"Delivered Broken, cannot return for refund","reviewDescription":"I purchased this for my son, who's away at school.  Upon opening it, he charged it, and it worked for one day.  It never worked again.  Unfortunately, he didn't tell me (as he's away\/out of state), until he brought it home during his spring break.  It is now past the return date, and I'm stuck with a broken $50.00 toothbrush.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1584921600000}
{"reviewTitle":"Worst electric toothbrush","reviewDescription":"This thing start out by boring my teeth out of my gums with the sound busting my eardrums. Fortunately the thing wouldn’t hold a charge after two months so my teeth will service and my hearings back to normal.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638662400000}
{"reviewTitle":"I need my refund from this return it has been 1 month since the return","reviewDescription":"This was given as a Christmas gift from but it was disappointing to find that the product was not official so I would like get my refund because I have recorded the gift","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1611705600000}
{"reviewTitle":"Bluetooth didn't work","reviewDescription":"Impossible to connect phone to brush. Junk. Company is zero help. Save your money. Sad these big companies continue to make garbage software.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1626912000000}
{"reviewTitle":"waste of money","reviewDescription":"What a piece of junk. The brush head is tiny and akward. Shoots toothpaste all over my face 😢","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1613001600000}
{"reviewTitle":"Inferior product for me. As I said I had to buy an alternate one","reviewDescription":"Very difficult to try and use!!Am I allowed to return it. I tried twice. Had to buy an alternate.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1598054400000}
{"reviewTitle":"I will send it back due to battery not lasting more than 4-5 days","reviewDescription":"Battery lasts for ca10 minutes. Deffinitely far from 14days. Maybe I received some very old stock","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1606262400000}
{"reviewTitle":"Worst Purchase Ever.","reviewDescription":"I purchased two different Oral B brushes:Oral-B Pro 1000 Power Rechargeable Electric Toothbrush Powered by Braun - it was faulty as it wouldn't charge so I got a refund and put a few extra dollars and went for this one Oral-B Pro 3000 Smartseries Electric Toothbrush with Bluetooth Connectivity, Black Edition, well, this one doesn't work either as the sensor will not light up no matter how much pressure I put on it, literally, can press this brush against a wall and no sensor light would work. I went to Amazon Support and got a generic answer stating that because I am using a freight address they cannot refund me for the second faulty device - though that did not stop them the first time, at this point, I don't care JUST GIVE ME A WORKING DEVICE.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1628467200000}
{"reviewTitle":"Disagreeable odor","reviewDescription":"After less than 11 months, this brush emitted an awful odor when turned on.  I tried removing the brush and cleaning the metal post, but it only helped a little for a short time.  I absolutely cannot brush my teeth with something smelling so foul and am throwing it out and going back to Panasonic which lasted years with no problem.  This brush cleaned well, but certainly didn't expect this after less than a year.","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"Great toothbrush","reviewDescription":"This was my first electric Oral-B toothbrush years ago. I had it for many years and loved it. After a couple or years the battery gave up and I got a cheaper version but it wasn't the same. Finally got this one again and it has a lot more power. Don't really need the Bluetooth but the brush is good.","isVerified":false,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"I've always wanted an electic toothbrush.","reviewDescription":"I don't like brushing my teeth, it's a chore that I have to do. I say an electric toothbrush actually does make this easierI could never make the leap into paying for an electric toothbrush. When this one went on sale I finally caved.It's a whole new world.Gone are the days questioning whether or not I did a good job with my manual toothbrush. No more counting to get to the minimum \"suggested\" brushing time.I press the button. It controls the motion. It tells me when to move to the next part of my mouth. It lets me know when we are done. Complete auto pilot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"Recommended by Dental Hygenist","reviewDescription":"I purchased this in 2019 at the recommendation of my dental Hygenist, who said it would help with plaque build up. And since I HATE sitting in that chair and having my teeth scraped, I bought it. She recommended this one and the other name brand, said both would work fine since it was the rotating or wiggling of the brush head that helped. I used it for 6 months and noticed a difference, I was in and out of that chair in less than 15 minutes (results vary by person).I bought one for my father for his birthday. His next trip to the dentist, equally short and definitely pleasing visit for him and the Dentist and Hygenist who were pleased with his teeth.So I bought a third one for my mother, who has weak teeth. I'm certain, given it's track record with my dad and myself, she'll find it helpful! It won't solve her weak teeth but it will keep them healthier.The only con is the replacement brush heads. They're plastic that will live in a landfill and they're pricey. But for less than 10 minutes of having my teeth scraped on the last two visits, I will make it up to Mother Earth in other ways.And I asked, the brush heads with the flippers on them for \"Flossing Action\" are a waste of time. Flossing cannot be replaced by a brush head. Sorry everyone, I know flossing sucks.","isVerified":false,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1619740800000}
{"reviewTitle":"Goof","reviewDescription":"Functioned as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1615075200000}
{"reviewTitle":"Works","reviewDescription":"Works well, as described.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1612828800000}
{"reviewTitle":"The best!","reviewDescription":"Love oral b toothbrushes","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1610841600000}
{"reviewTitle":"Life","reviewDescription":"Great tooth brush. It has some blue tooth teeth brushing tracker with rewards program that i never used just some info but wonderful toothbrush","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1648425600000}
{"reviewTitle":"Deja los dientes muy blancos u limpios","reviewDescription":"Muy buen cepillo, buena conectividad Bluetooth, fácil uso","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1647993600000}
{"reviewTitle":"Where has this been all my life? I just love it💯","reviewDescription":"Love love love!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1646697600000}
{"reviewTitle":"Gets teeth clean","reviewDescription":"Louder than sonicare","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1641945600000}
{"reviewTitle":"Love this toothbrush!","reviewDescription":"My dentist recommended this for me and it’s amazing! First time using it, my teeth feel like they just had a cleaning! Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"Quality product","reviewDescription":"Best electric toothbrush I ever dad. Leaves teeth extra clean.  Easy to use and care for","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"Nice","reviewDescription":"Love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1622851200000}
{"reviewTitle":"It really does whiten your teeth","reviewDescription":"This is pretty powerful! In addition to what I already do to keep my teeth healthy and white-er, this seems to take it up a notch. Very pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1622764800000}
{"reviewTitle":"👍🏼","reviewDescription":"Exelente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1620259200000}
{"reviewTitle":"good","reviewDescription":"nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1601164800000}
{"reviewTitle":"Great toothbrush","reviewDescription":"Works, looks, and feels great. Love the toothbrush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1600560000000}
{"reviewTitle":"Worked as advertised","reviewDescription":"It works pretty well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1599868800000}
{"reviewTitle":"Highly recommend","reviewDescription":"The product is great and very comfortable, in good control.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1599436800000}
{"reviewTitle":"Awesome service","reviewDescription":"Love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1599004800000}
{"reviewTitle":"A Great Clean with Long-Lasting Battery Life","reviewDescription":"The Oral-B Pro 3000 toothbrush is a great option for those looking for a powerful and effective toothbrush. While there are some minor drawbacks, such as difficulty connecting to the Bluetooth app and lack of a brush head cover, the long-lasting battery life and great clean provided by the brush make it a solid choice.Pros:+ Long-lasting battery life, lasting up to a week with regular use (3 times per day)+ Provides a great clean and smooth teeth (3 modes available)+ The app\/timer feature is helpful in ensuring proper brushing time and technique+ Great value for money (especially with the current promotion)Cons:- Difficulty connecting to the Bluetooth app- The toothbrush does not come with a cover or travel case","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Made me realize I should brush more.","reviewDescription":"This thing is great, battery last a little more than a week. My teeth feel so clean. Like I used to think I brushed long enough, but this vibrates ever 30 seconds to move to the next part. Some nights Ill use my regular brush if I am tired and just want to get to bed, but most I stick with this. Kind of big and tall for travel, and the charging chord is much too long but I get it. Dont know if others do this but I do tend to drip on myself, that my only complaint really.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1598832000000}
{"reviewTitle":"Great","reviewDescription":"I love it.  When traveling it will go a week or more without the charger.","isVerified":false,"ratingScore":5,"reviewReaction":"","country":"United States","date":1598313600000}
{"reviewTitle":"good","reviewDescription":"Good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1597795200000}
{"reviewTitle":"excellent products","reviewDescription":"excellent products","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1597276800000}
{"reviewTitle":"Oral-B","reviewDescription":"Excellent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1597104000000}
{"reviewTitle":"great","reviewDescription":"great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1597104000000}
{"reviewTitle":"Great toothbrush","reviewDescription":"I love this toothbrush! Try to find it on sale!","isVerified":false,"ratingScore":5,"reviewReaction":"","country":"United States","date":1594252800000}
{"reviewTitle":"Excellent product!!","reviewDescription":"Works great!!..Very happy with it!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1639526400000}
{"reviewTitle":"Amazing Toothbrush","reviewDescription":"This product does an amazing job cleaning your teeth, however, you can tell the difference between this one and the 5000 model. Download the app Save your money and get this one for the same results.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1638576000000}
{"reviewTitle":"Excelente","reviewDescription":"Excelente en todo sentido. Realmente blanquea los dientes","isVerified":false,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1636243200000}
{"reviewTitle":"Necessary.","reviewDescription":"This toothbrush has honestly made it easier for me to brush my teeth. It calculates how long 2 minutes by vibrating differently every 30 seconds. It's true it won't let you have time to spit out. I think it's worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1635811200000}
{"reviewTitle":"Best toothbrush ...","reviewDescription":"I have both Sonicare and this brush ... like this best!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1635120000000}
{"reviewTitle":"Good deal","reviewDescription":"Good deal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1608854400000}
{"reviewTitle":"Great!","reviewDescription":"Needed a new one!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1607385600000}
{"reviewTitle":"Great!","reviewDescription":"Love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1606608000000}
{"reviewTitle":"Great brush so far so good!","reviewDescription":"I've had some great brushing with this thing since I got it a few weeks ago! Not sure if I should've gone up to the io series but this has by teeth helping great and the sensor for too much pressure when you're brushing works really great!","isVerified":false,"ratingScore":5,"reviewReaction":"","country":"United States","date":1671235200000}
{"reviewTitle":"Great product","reviewDescription":"Great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1656633600000}
