{"reviewTitle":"This is a very nice device, and if you have any handiness with tools, easy to install on the wall.","reviewDescription":"I have a 32 inch TV, and this accommodates it well, but I chose this wall mount because it will support a larger TV when I replace the one I am using now. The hardest part of installing this thing was finding the wooden framing behind my walls. Even with a stud-finder, it was a bit tricky.There is a list of tools needed to install this that do NOT come with it. Luckily I had all of those already on hand. If I had not, I might have been a bit annoyed, In addition to what is included in the box you need the stud finder if you are installing on a plasterboard and framed wall, a cordless drill with a 5\/32' (4mm) bit, a manual Phillips-head screwdriver, A socket wrench and a 1\/2 inch socket (12 or 13 mm), an awl or ice-pick, and a pencil.It would also be easier mount on the wall if you have a spare set of hands to keep the mount in place while you crank the top two lag bolts.NOW that it is installed I only have two very minor issues with it.1. The bars that attach to the television  stick up over the top of the set, which will no longe be an issue when I replace my little TV.2. The set pulls out and retracts very well, and tilts from side to side easily. However the vertical tilt has to be chosen and locked in. If you want to change it you have to loosen two bolts and then retighten them once you have moved the set to the preferred angle. It would require a sophisticated bit of machinery to overcome this, so for the price I can't really complain.In all this is a very functional television wall mount, and very sturdy if installed correctly.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Exactly as advertised.","reviewDescription":"This would get 5 stars if the back plate was about 18\" wide instead of about 13\".  Why you might ask...Well, install instructions tell you to mount the four corners on wooden studs when mounting to dry wall.  The problem is, in most residential constructions studs are 16\" apart.  This mean, if you want to stud mount you have to get creative. Fortunately the back plate has two holes dead center which I used to stud mount and then I used heavy duty mollies to secure the corners.  This is not recommended or \"suggested\" in the mounting instructions and hardware to do this is not supplied.  While I am not an engineer, I believe this is wholly adequate and unless someone hangs from the TV, it is not going to get ripped off the wall.  That said, if you are not \"handy\" with these kind of things you might find the hanging instructions to be inadequate.  The install hardware does allow for fine tune leveling but if you hung the mount level in the first place, you won't need to use this.That said, the mount works great.  It is easy to articulate, forward, back as well as about 30 degrees left or right.  There is also the ability to tilt the screen a few degrees forward.  This can really help with minimizing reflection on the screen.Mounting issues aside, this is a great mount for the money...you should have no issues.PS - I am going to make the wires disappear after I mount the cabinet below the TV.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Works like a dream","reviewDescription":"Easy to install, sturdy, maneuverable. Nothing more to ask for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Needs extended brackets!","reviewDescription":"The mount sold is for the minimum size tv.  If you want to use it for any larger tvs that it supports, you have to buy the extended brackets!Otherwise it’s great, and sturdy!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Solid","reviewDescription":"I had to wall mount an 85 in Tv and came across this Tv Wall Mount. Installation was easy. Material is pretty solid. Everything needed for installation was included. Even a leveler. No issues so far. Good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Nice Mount","reviewDescription":"Seems solid and well built.  There was something in one of cylinders, possibly small piece of metal or something feel in there during manufacturing and I could hear it when moving around the mount.  No issue once it’s up.Ended up returning it thou.  Found another by the same brand I believe that is much closer to the wall although more expensive.Wound recommend if you don’t mind having it stick an inch or so more than the slim version","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"seems sturdy, a couple minor gripes","reviewDescription":"It seems like it's pretty heavy duty and the instructions were easy to follow. This was my first ever attempt at mounting a TV to the wall. I was trying to hang a 65\" U8K by myself but wasn't sure why it wasn't connecting with the mount. I had a friend come help me and noticed the mount was tilting when trying to hang the TV. The tilt adjustment was totally loose, and nothing was mentioned in the manual about this. If I had known I had to tigthen\/check the tightness of these screws before-hand that would have helped.Once I tightened those screws it was possible to actually hang the TV on the mount.The TV has a slight downward tilt, despite manual saying it should be parallel to the wall. I've adjusted the tilt as much as I can, but it still has some downward tilt. I think it may be because of the spacers.The manual for the U8K says to \"use spacers\", but doesn't specify how much spacing is required\/suggested. It does however state that the screw length should be 9.5 mm - 11 mm. So based on this information I was trying to choose the combination of spacers and screws (plus the washer) that would get me there. The proper screws per the U8K manual are M6, so I didn't bother even looking at the other screws available with the mount. The closest possible arrangement for the 65\" U8K in terms of spacers, screws and the washers is one of the 10 mm spacers and two of the 2.5 mm spacers, plus the washer and 35 mm M6 screw. This gets the numbers down to 13mm (excluding however thick the washer and bracket add). I'm not sure that much space is really needed, now that I see it on the wall. The TV has a little subwoofer on the back but there's now plenty of room for ventilation AND clearing the bump.Finally, while the hardware was fine, the allen wrench was Chinese garbage.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Know your stud spacing before buying.","reviewDescription":"Product seems well built, also love the design. Wasn’t able to use it due to my stud spacing, totally my fault for not measuring before buying. I gave it four stars because it only came with 3 bolts for the studs to mount. That would have really screwed me if I was able to use it. I’m sure they would send you new ones no questions asked, but imagine how inconvenient it would be if this happened to you the week before the Super Bowl & hopefully you didn’t expect a bunch of people over. They do sell extender supports for larger spacing, but it’s sold separately. So be prepared if you plan on buying a wall mount, but over all the mount itself seems good & really simple to setup based on how far I got before finding out I was “screwed” lol. I could have called them, got a bolt & the extender bars but when it would have all been said & done it would take me till Super Bowl weekend to get this mounted, so I just went to Best Buy and over paid for a larger wall mount.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Great 👍","reviewDescription":"Easy installation extra hardware I like it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Flexible mount","reviewDescription":"Mount allows tv to be pulled out from wall, and tilted up down left and right.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Cheap materials, expensive price","reviewDescription":"After doing some research I thought this would be a more American based company so I didn't have to worry about this being cheaply made & having poorly written instructions. I was wrong. Instructions were included but were not detailed at all and made assembly so confusing. The instructions were basically 4 big pictures that took up only 2 pages with almost no written instructions pointing to the pictures to tell you what you're looking at. When attaching the bracket to the back of the TV with the screws provided, one screw broke in half inside the TV screw hole with minimal pressure so I couldn't finish installation & will now never be able to mount my TV. Only giving 2 stars bc I hope I can still use it for possibly mounting a different TV I own.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Look at the Width","reviewDescription":"This mount is too small for studs that are spaced 16in apart","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Small, with very little side-to-side adjustment","reviewDescription":"It holds a TV but only has a small amount of left to right adjustment.  I couldn't mount it in the center of the wall due to having to mount it to a joist.  The plate that the TV sits on (after connecting the mounting brackets on the TV) is only about 17\".  The brackets are about 12\" apart which only gives you about 4-5\" of total adjustment which wasn't enough to center it on the wall.  Compare that to one I bought 10 years ago and the plate is much larger (top one in photo).  I wound up using this one because I could slide the TV left or right until it was centered on the wall.There is a work around, you could mount two horizontal 2x4's to the wall and then mount the TV mount to them where ever you want and center it.  This, however, would push the TV out another 1 1\/2\" from the wall and wouldn't be a clean of an install, even though it would be hidden behind the TV.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Won’t fit most studs\/walls + shipped used product","reviewDescription":"First off if you own a typical American home with 16” spacing between studs this product most likely is not possible\/feasible to mount on your walls. Longer explanation below At the holes widest points they are exactly 16” apart, However this leaves you no wiggle room whatsoever, to the point that you need to precisely consider the width of the screw when drilling the hole because again at its WIDEST point it’s 16” meaning if you account for the width of the screw you have closer to 15.5” of space between the holes. Most walls are not constructed so that the studs are placed at exactly 16”, there is a good chance you will have some studs that are spaced wider than 16” apart. If the spot you want to mount this in is like this, you will have to find a different spot and search around your house for studs that are lucky enough to be spaced just right for this product. Seriously, what were they thinking?? It’s clearly a design flaw.Second, this product was clearly used and returned before it was sent to me. Some of the parts were modified in such a way that if you had certain sized screw holes you would have a difficult time. The labeled bags were just left open so the parts could shake around the box, meaning I had to go through the process of figuring out which part corresponds to each letter\/number. Also the mount itself was scratched up. I paid for a new product not a used one. Why was I shipped this?TLDR, if you want a used product with obvious design flaws that you can’t actually mount your tv with, then go ahead and waste your money like I did","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644451200000}
{"reviewTitle":"Didn’t need","reviewDescription":"It was probably a good purchase, however change my mind into not using it. Could not mount on wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Opened package","reviewDescription":"My package was delivered opened. The seal was broke and the box was partially ripped. I am unable check until this weekend to make sure all of the parts are there, will update after. First time I have ever had an opened package delivered.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Very narrow, definitely measure stud distances before you buy","reviewDescription":"I’ve installed plenty of wall mounts, and I’ve never seen one so narrow. MEASURE your stud width in the spot you want to hang it before you buy.Typically, the 16” specification on a wall mount means that the center-to-center distance in the outside slots is 16”. This is to allow some wiggle room for slight variations in stud-to-stud distance, and so you don’t have to be so dead on with placing the lag bolts. As you can see from my crude drawing, this mount measures 16” from the EDGES of the slots, leaving no wiggle room at all. Everything has to be dead on. So even if you think your studs are 16” apart, it still can be tough to install this mount.That being said, the range of motion is pretty good and sits pretty flush against the wall for being a swing arm style. It doesn’t hold tilt position too well and is a little too easy to knock the roll position off.(Note: Search online for tips on how to find studs from outlets, it’s the first thing I do before trying a stud finder, which I use as a confirmation tool more than an initial finder - it’s thrown false positives).","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1596585600000}
{"reviewTitle":"Measure your tv mount hole width before ordering","reviewDescription":"This product does not support 65\" tv. The mounting brackets you screw on the back of your tv cannot be more than 15\" apart. Mine are 25\" apart. Contacted support twice and sent pictures but they were of no help. Company apparently has a wider mount but I was not offered an exchange or upgrade which I would have happily paid a difference. Had to do Amazon return instead and now I have 4 large lag bolt holes in my wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685577600000}
{"reviewTitle":"Fit nice","reviewDescription":"Easy to install just find two studs..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Too Narrow","reviewDescription":"There’s a major design flaw with this mount. It’s fine if you’re mounting to a concrete wall and can pick any location. But mounting on a standard Sheetrock wall w wood studs is an issue because the mount is only 16” wide... so if you want to center it, like over a mantle, it's impossible unless your studs magically are in the correct location. The mount needs to be wider so you can center and still hit studs to the left or right. In my case I centered it over the mantle and was lucky that a stud to the left was in range, but on the right I had to add anchors to the Sheetrock, which according to the manufacturer you’re not supposed to do. Luckily my 40” HD LED TV, is not too heavy so hopefully no issues. Also no included instructions and crappy online instructions. I have no idea what 80% of the included hardware was for and I consider myself to be very handy. It is a solid device but should be a minimum of 24” wide.","isVerified":true,"ratingScore":2,"reviewReaction":"17 people found this helpful","country":"United States","date":1541289600000}
{"reviewTitle":"Good swivel","reviewDescription":"Easy to mount","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688515200000}
{"reviewTitle":"Could have a little more explaining on the manual.","reviewDescription":"So the part that took the longest on this for me was actually getting the brackets on the tv because the instructions aren’t very clear, & they sent these tube things that looked like they were important in assembly but we couldn’t figure them out, then realized we wasted a half hour because they weren’t needed. Other then that we’ve been trying to readjust the title because it’s a little lower on one side, but we can’t seem to get it no matter how hard we try. If I can fix the tilt this would be a 5 star review, & if I eventually fix it I will come back & change it. Maybe better instructions too, but once we got it, it was bing bang bong.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599091200000}
{"reviewTitle":"Good item!","reviewDescription":"I am 70 years old.  I received the TV mount and was in awe at the screws and bolts.  After reading the direction, I determined the screws were shipped for different brands and size TV.  Mine a 50 inch Samsung!  From there it was simple installation.  The wall template worked well since my studs were on 16” centers.  Shipped with the bolts are plastic expanders with washers.  To get a tighter fit, bracket to TV, I went to Lowe’s and bought 10 small washers to get brackets and bolts tighter.  I mounted the TV on the wall mount by myself....it would help to have two persons to do the job.  I could have given this a “5” star rating.  But am annoyed that when I called the company, I received...”leave a message and we will call you back.”  Having stated that, I would definitely buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1525737600000}
{"reviewTitle":"Heavy Duty and rotated to perfect position. Fairly easy to install but it is a project.","reviewDescription":"Just what we needed to put on the wall and hide the cords. Electricians actually installed this for us for free (just ask them) but we had another and it's fairly easy to install.  Rotates and comes out too.  Just be aware if you you are worried about side profile it will stick out some and not be flat to the tv\/wall.  I didn't need to worry because as you can see in photo, nobody is going to see the side profile on mine so this was just what we needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624406400000}
{"reviewTitle":"Good overall","reviewDescription":"Seems very sturdy, and like that I can pull the TV away from the wall to get to components behind it.  Comes with helpful template for installation and lots of fasteners, but I ended up buying my own because I didn't trust the ones that came with it (I wanted more heavy duty fasteners).  You have to be pretty precise with all the measurements when mounting, because there is not much adjustment that can be done once the mount is on the wall (but I suppose that's true of anything).  Overall, it was a good purchase especially for the price, and the mount itself seems strong but I wouldn't trust the fasteners that came with it to hold up my $1000+ TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599868800000}
{"reviewTitle":"As advertised","reviewDescription":"Very easy to install, good instructions. Only issue is that the absolute widest mounting holes are 16 inch or slightly under. If your studs are off a little bit it'll be a challenge to install. Other than that it works great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"Great mount","reviewDescription":"There is only one thing that is preventing me from giving this product 5 stars. As I was attempting to put the brackets on the back of me TV, I found the screws I was provided were not long enough. I had to make a trip to the hardware store to get the right ones. I understand this is a product which is intended to fit a wide variety of tvs so it's not terrible. I have a 50 inch Samsung led smart tv (2014 model).The mount is very heavy and sturdy. I have read other reviews stating the hinges on the mount are too stiff. I worked them back and forth prior to installing it on the wall and they are just fine. Easily swivels around. Be advised if you end up using the spacers on the back, the TV will stick out farther from the wall than normal. Not a big deal, just be aware. I am happy with this product and I hope it holds up for a long time. Very easy to install.","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1437782400000}
{"reviewTitle":"Works absolutely great, but the stencil was off by 1\/8th of an inch.","reviewDescription":"I actually have 3 of these. They’re all great. The only problem I have, is the stencil is a different size than the bracket. Not by much, and luckily when I used the stencil I was still about to use the mount, but just barely.So it works fine, but I gave them 4 stars because the stencil isn’t perfect. For the second and third ones I just used the bracket itself to measure instead of the stencil.So be careful when using the stencil. Line it up to the bracket before you make the wholes so you can see how far off it is and make adjustments.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"Fantastic low cost mount for 65” LCD","reviewDescription":"Very good quality mount used on LG 65” HDTV.  2nd I have installed by mounting dream.  As good as other brand names, but at fraction of cost.  Going strong 6 months after install.  Quality hardware and heavy duty construction - no sagging of any kind.Only negative is it is still stiff to pull in\/out, but easily rotates.  I have this recessed in wall above fireplace, so use the arm to pull out for cleaning\/ new connections.  I guess it’s better for it to be stiff so it does not drift, but would think it would be easier to move.  Might be the LG TV is just too weak and flexes when I pull on edges.....  I have a Sanus brand which slides in\/out easily, but 3x the price.  For my 2x applications, this is perfect.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1549238400000}
{"reviewTitle":"Solid mount.","reviewDescription":"Good tilt, left and right motion is good too but a bit stiff. I ran a magnet across the the whole mount and the lag bolts, it's some sort of ferrous metal so I guess it's steel like the description says.It seems that some kits come with HDMI cables and some don't. Mine didn't come with an HDMI cable but my brother who ordered the exact same model received an HDMI cable in his kit.The manual that came with his kit says an HDMI is included, my manual doesn't say an HDMI is included. (Check attached pictures)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613520000000}
{"reviewTitle":"Very nice and well made support in economy category","reviewDescription":"First of all it is very good support. It mounted well and with no hiccups although the wall plate is just barely big enough for the 16\" spaced studs and TV brackets are barely big enough for the 400x400 VESA. No issues with any of that but if you have anything even remotely out of spec you'll be in bad luck.I also have an Echo mount for my other TV and the difference between them lays in minor details. The functionality is the same and the quality is very similar but Echo has a few more touches like covers for the lag screws that attach the bracket to the wall and cable hangers instead of Velcro ties only. I also prefer Echo 1-screw leveling system over 4 screw one on this one. The one here gives you more options but if you need them you probably did something really wrong when mounting the wall plate.All of these are minor differences but if the bracket can be seen from certain angles with your installation I'd go with Echo, otherwise Mounting Dream is a way to go.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1599609600000}
{"reviewTitle":"Good unit.","reviewDescription":"First thing to do is throw away the included level....the one I received wasn’t accurate.  I used one of the levels I already had.  I took the arm portion off from the wall plate before mounting to the wall.  Just too difficult to mount unless you’re just dealing with only the plate.  I had trouble locating studs inside my stucco wall (I mounted this on an outside patio wall).  So I used 6 lag screws and 6 wall anchors (2 of the lag screws and 6 of the wall anchors were not included).  It’s very firmly in place.  After getting the wall plate attached to the wall, I reattached the arm mechanism.  Once that was done, I attached the TV.  I mounted this unit 8 ft up the patio wall.  Fortunately I have a Genie Lift that made it easier to put the TV in the exact, necessary location to attach to the mount.  Overall it’s a well made unit and VERY economically priced.  Would highly recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1606608000000}
{"reviewTitle":"Very nice mount with very minor issues","reviewDescription":"I am using this mount in my bedroom with a new Sony 850D 55\" so I needed some options for viewing my new TV and needed some tilting to angle the screen slightly forward.  This mount is very nice.  The bags with all the hardware isn't clear enough to differentiate the wall mounting supplies with the tv mounting supplies.  Once I realized I was using the wrong screws, the mounting went by quick.Pros: - The quality is high with this one.  The metal feels strong and this has some good weight to it.  When I was tightening the bolts with a socket wrench, I saw no flex or warping in the metal around the bolt which shows serious strength. - The articulation is very nice.  It swivels up, down, left right.  It can pull almost a foot away from the wall.  It can tilt.  Perfect. - There is NO wiggling in the mount itself.  Any wiggles are from my TVs plastic itself. - The box provided a plethora of hardware.  I have SO many extra bits that I don't need so my tool box received a nice deposit.Cons: - The tilting function requires an allen wrench which is annoying.  It would be better to include a hand crank bolt of some design.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1492646400000}
{"reviewTitle":"16” studs are a reach.","reviewDescription":"Seems like a great mount but the 16” stud holes are right in the edge. Doesn’t put it in the center of 16” spaced studs. So hope your studs are true and your placement of screws. Should’ve made it a little wider.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"Great mount for the price, but very stiff to extend","reviewDescription":"Great mount for the price.  It's very secure, solid, doesn't sag or droop with my 50\" TV extended out.  The design is such that with the TV mounted correctly it's very secure and cannot fall with the locking bolts engaged.  I have only one complaint.  The mount is very stiff to pull out.  I bought a TV to just fit in a media nook and built a cabinet below and put shelving above.  It looks great, almost built in, but I only have 1\/2\" above and below and 1.5\" on either side.  To pull the TV out I have to grab it by the edges, and it takes significant force to extend the mount out, so much so that the TV starts to bow, causing concern that I could damage it.  I'd like to know if there's some way to adjust\/lubricate the mount to make it easier to extend.  There is nothing on this in the instruction manual.  I understand it can't be too easy to move or just vibrations could cause it to move, but it's way too stiff.  Good news is once everything is in place I likely won't touch it, but I'm on the fence about keeping this mount because of the issue.  Still giving it 4 stars because everything else about it is top notch.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1482192000000}
{"reviewTitle":"Great full motion tilt","reviewDescription":"Great TV Mount for tilting and bringing tv forward. Only negative is there is about a 4.5inch gap from the wall so the TV does not sit flush against the wall. Other than that looks and works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688860800000}
{"reviewTitle":"Still in my wall about a week later","reviewDescription":"I have no experience with mounting anything to walls. I used this product to put a 38 lb, 55\" TV on my wall, and I am not worried about it falling. I saw an issue that some other people had been having where the middle-top part of the mounting mechanism that is bolted to the wall started to bend forward. I think this has to be an installation error, or maybe something that happens overtime because of that. I have not had a problem with this and honestly will be surprised if I do. The bolts that you put into the stud of your wall are thick, and mine feels like even if I pulled on it, isn't going anywhere. I will come back and give this a 5th star in a year, as long as it has not fallen from my wall, which I doubt is going to happen.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"Almost perfect","reviewDescription":"Very sturdy and comes with all the screws you need. It would be perfect if the arms didn't buckle when pulling the tv all the way out. At first the arms are very stiff but after a while it loosen or you can loosen the bolt","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Not too shabby","reviewDescription":"Pretty sturdy, but ridged movement when pulling all the way out or pushing back in can be a hassle sometimes if you don't use some finesse (the cost makes it still okay).Pros-Feels pretty sturdyPractically any angle if your not hanging it way too high(Doesn't tilt downward too much but still works out great)Very easy and wide left and right (vertical) turn capabilityMostly an easy setupCons-Really big screws can't remember the size, feels like a quarter of my 1.5 inch studs at the least. (Not sure if that's normal for a tv mount).Need and hex key to tilt up or down.Very rigid sometimes when retracting into or extending it away from the wall, can feel awkward if your in front of people haha, unless you use some finesse and slide it left and right when extending or retracting it, it kinda helps usually.Note\/ConNeed a good drill with right socket size as philips bits don't cut it with these big screwsOverall though for what I paid, and the fact that my 55 inch 4K Samsung didn't fall off my wall and that I can get it to any angle I usually like with very little to no effort makes me happy :) Thanks guys.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1500336000000}
{"reviewTitle":"sturdy and good","reviewDescription":"I needed to mount a 50-inch TV on the wall, but it's sturdy and good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Instructions are good for lining your bird cage and that's about it!!!","reviewDescription":"It might be a great product but the instructions are freaking terrible it doesn't tell you which items are which and what to do with them.  I might change the rating when I get a engineer out here to decipher the instructions.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1603756800000}
{"reviewTitle":"Couldn't get it to reach 16\" studs","reviewDescription":"The way the last hole is placed it will not meet the center of an 16# stud to stud I had to send it back and get one for a 18\" stud to reach.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1612396800000}
{"reviewTitle":"Not good for corner mounting large TVs","reviewDescription":"This will not work for corner mounting a tv over 50 inches. Because this product doesn't extend that far you cannot corner mount a tv with it. If you do you won't be able to extend the arm and turn the tv to an angle that is acceptable because the sides of the tv will hit the wall","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1524441600000}
{"reviewTitle":"Not sturdy","reviewDescription":"Bought 2 & the up & down swivel part has broke on both of them. I would not recommend. Haven't tried to replace because I have to hire someone to hang them. So I'm stuck with broken.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1564099200000}
{"reviewTitle":"If you only need the rn to love side to side this is probably for you","reviewDescription":"It is not full motion, from side to side yes. Tilt is horrible very little room to tilt.  Isn't easy to tell it wasn't complete 360 until mounted and then you've already drilled many holes in the wall wasn't worth returning or I would have. In my photos this is \"tilted\" all the way down","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1521504000000}
{"reviewTitle":"Has potential","reviewDescription":"This TV stand doesn't hold much, after a few months I can't even think of moving the TV or turning it a bit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615939200000}
{"reviewTitle":"Make sure it won’t make your inputs inaccessible","reviewDescription":"I’m not real happy with this because the big rectangular bracket blocks me from plugging into the hdmi1 socket, the fiber optic plug for my sound bar and most other plugs on the back of my tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1560211200000}
{"reviewTitle":"installation problem. Did not ask, but mounted WAY too high on the wall for me.","reviewDescription":"I am not happy that I now have to find (and pay!) someone else to come out and remove the tv \/bracket and re-install. He never left me a phone #, so I can't call the installer back.  Not happy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1564358400000}
{"reviewTitle":"This only fits walls with 16\" (or narrower) wood stud spacing","reviewDescription":"Be advised that the wall plate will only fit wood stud spacing up to 16\". If studs are 24\" apart, you'll need to order additional material. This spacing requirement is in small print under \"Technical Details\". Amazon will not refund the item without charging you return shipping of approximately $13.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1532908800000}
{"reviewTitle":"Crooked","reviewDescription":"I spend time to install the mount but finally I got a crooked TV leaning down on its left side. I was trying to fix it but I think there is defect on the mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1554076800000}
{"reviewTitle":"Works for what ut is.","reviewDescription":"I really do not know very much about mounting Tv's so this might not be the best review to judge by.  It was fairly easy to install. But once the Tv was up it was hard to adjust. It was very crooked at first so we had to unscrew and adjust several times. This was a little irritating because I am short and had to work at an awkward angle on a step stool to reach where we mounted it. There was a measurement graph that you put on the wall to mark where everything is going to go before actually mounting the hardware. We thought that was really cool but it wasn't perfect. The TV  still sits at a slight angle but we've managed to level it out enough that we don't notice it anymore.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1497571200000}
{"reviewTitle":"Nice articulating mount.","reviewDescription":"The unit works good a solid product. The only issues I have is the template they give you with a stick on level for the hole placement. I applied the level in the designated area marked an drilled the holes. I then screwed the mounting bracket into position (using only 2 screws until I checked the level with a carpenters level. For some reason it was way off. I readjusted to the carpenter level and all was OK.  The other problem is when you want to adjust your TV angle right or left.and you grab from the bottom sides the TV wants to lift away at the bottom. It was kind of unnerving the first couple of times. The way it hooks in at the top would prevent the TV from falling.That prevented from giving it 5 stars. I'll get use to it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1470700800000}
{"reviewTitle":"Excellent Product!","reviewDescription":"Excellent mount!  I would have given it 5 stars but a good many bolts were missing, but to the company’s credit I emailed them a list of the bolts I was missing and the had them to me in 3 days with no issues. I had to wait to install, 😖 but in the end it was worth the wait I am very happy with the product. But the mounting of this product is not for the light hearted, I read a lot of reviews about the mounting limitations and it is not that the product is defective but because people do not understand the two stud requirement and they do not read the instructions. Get your packaging up to speed and you will be 5 stars each time!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1515283200000}
{"reviewTitle":"Have a good visual of back of your tv and read product specifications","reviewDescription":"Because my 40” tv has a 1\/2” hump near the rear bottom of tv where the mount and screws have to go mount couldn’t lay flat ,and deep spacers did not help.So I moved mount up to a point it could lay flat and used thin spaces and shorts screws to mount it.However when standing in front of tv I Could see vertical mount supports.I removed  supports and cutoff a little bit of the Top part of vertical supports and wow! it turned out beautiful. They probably got one like this that would’ve work but I didn’t want to wait, I was i the moment..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1592438400000}
{"reviewTitle":"Don't buy retail. The exact same mount is many times more expensive.","reviewDescription":"I like the mount very much. It has a great range of motion. Very easily holds my 55\" TCL just fine. Easily swings from left to right to have the screen viewable in 2 entirely different roomsHowever I am rather disappointed in the free HDMI cable. It is outdated and not HDMI 2.0 compatible or even capable. This cable is not properly labeled and cost me a bit of time troubleshooting. Seriously, would you give someone a useless rotary phone? Not a fan of outdated tech. You lost a star over a free cable I didn't need or want.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595203200000}
{"reviewTitle":"Measure your TV's mounting holes prior to buying","reviewDescription":"So, first of this thing is really easy to mount and comes with a really nice pattern to assist with it. I like the product and will be using it just not for the TV I bought it for.I bought it for an older Toshiba 32in lcd but the mounting brackets sit to far apart for this mount.The max your mounting brackets can be is 1ft 5in (the holes on the back of your TV) and my Toshiba was  1ft 8in so it completely cleared the wall mount.My newer Samsung led to mounting holes are 1ft 4in apart so it should fit this wall mount making it not a complete loss.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1548892800000}
{"reviewTitle":"Works great...","reviewDescription":"-1 star for 2 reasons:1. Packaging was torn, not sure if it was a result of poor delivery, amazon warehouse or what.  It didn't affect the mount itself, but the template it came with was a bit shredded.2. The tape on the back of the template didn't play well with my wall.  After using as much of the template as I could, when I took the template off, it tore off some of my wall paint.  Would suggest hanging it with blue painters tape.Overall functionality is great though and sturdy.  Have an older\/heavier TV and it was fairly simple to install.  I might buy this again for another TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1544400000000}
{"reviewTitle":"Great TV mount","reviewDescription":"Great TV mount, but you should have the option to choose what the support will be so they can provide with the proper anchors without having to request them after the delivery.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656374400000}
{"reviewTitle":"Good product","reviewDescription":"Not easy to install because of weight and bulk. But an excellent product. Sturdy. Good price. Recommend this!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668988800000}
{"reviewTitle":"Make sure your TV will fit.","reviewDescription":"I was really looking forward to this mount for my TV. I didn't look close enough at my TV to realize that it did not have the VESA 400 x 400mm. My TV turned out to have a VESA 600 x 400mm.The mount had plenty of adjustments and folded flat against the wall. It appeared to be really sturdy and I would guess that it would hold more weight than it was rated for. Had it fit, it would have been the perfect answer.Now I am looking for another like it that will fit my TV.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1546992000000}
{"reviewTitle":"after picking it up I felt like it would rip the studs out of my wall ...","reviewDescription":"The mount is extremely heavy, after picking it up I felt like it would rip the studs out of my wall and hesitated to put my TV on it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1513036800000}
{"reviewTitle":"Range of motion.","reviewDescription":"The range of motion is excellent!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611964800000}
{"reviewTitle":"I bought this awhile back and just now opened it ...","reviewDescription":"I bought this awhile back and just now opened it, It was a returned item and then They sent  it to me opened and used and no instructions was not new....\/.......","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1484956800000}
{"reviewTitle":"Mediocre mount, but good for the price","reviewDescription":"It's an OK mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Otherwise it seemed to work good","reviewDescription":"I though it would drop down but it only tilts slightly down. Otherwise it seemed to work good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1525046400000}
{"reviewTitle":"Setup 250 inch but didn't really meet the requirements to ...","reviewDescription":"Setup 250 inch but didn't really meet the requirements to attach to the bolt holes had to make some modification but does actually hold up a 50 inch TV by the hinges","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1480809600000}
{"reviewTitle":"Ok","reviewDescription":"Ok","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579046400000}
{"reviewTitle":"It worked out OK but I did have to order ...","reviewDescription":"It worked out OK but I did have to order the extention because of the studs. I need to order shelves for cable boxes to sit on","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1490832000000}
{"reviewTitle":"Mas o menos","reviewDescription":"Llegó  con fallas","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1563753600000}
{"reviewTitle":"Good for my small tvs bad for big tvs","reviewDescription":"Product is good for 50 inch and smaller.. Don't bother buying this item for a 55 inch cause it will not support the weight at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1477267200000}
{"reviewTitle":"Holds up a 55 inch TV","reviewDescription":"I had huge install problems. That is by the design of my apartment, and not the product. After having to mount 2x4s because of the wall design being both weak, and having a 24 inch stud span, the TV mount holds tight to the mounted boards. Even if this product was not designed to fit my case, I was able install, and the TV is still tight to the wall after over a year. The swivel, tilt, and swing range are very good, in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638489600000}
{"reviewTitle":"Get a bigger one for 65\" tv","reviewDescription":"Bracket fit the back of the tv good but hanging it, it barely fit my Samsung 65 inch TV!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"A winner....with some installation challenges","reviewDescription":"This is a great price\/value product.  Solid and retractable features are excellent.  Regarding installing it the main thing is to have a very good stud finder to work with.  I had an old SR stud finder that didn't work well. So I got a Zircon  L50 stud finder at Lowe's for $20.00 and it saved the day. Once you find the studs you're money.  If you are doing this for first time, there are plenty of U tube videos explaining how to find studs. But the product is sturdy and reliable and at the price is fair and reasonable. Only been up and used for 2 days, thus the 4 star, but if I could use halves I would give a 4.5 rating.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1569974400000}
{"reviewTitle":"Nice wall mount","reviewDescription":"I installed this a couple days ago, and it worked on my 16\" on center studs.  It used the last holes on the device but it worked.  When installing it the metal where it touches the wall was slightly twisted, only noticeable when I was putting it on the wall, but it straightened out when I put the lag bolts in.  This didn't hinder the movement at all an is not noticeable now that it's tight against the wall.  I installed a new 50\" TV on it and it works great.  The only thing I would really like on it is a spot to attach a wire tie to it so I could make the cables come down from the middle of the mount and not on the side where the power cords are.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579824000000}
{"reviewTitle":"Sturdy, good quality, but made for 16\" on center studs ONLY.","reviewDescription":"So, this tv mount is Really good, for the price... It is holding up my older 55\" tv which is pushing the 99lb weight limit of this thing. It is adjustable in all directions, and articulates fairly well. The only issue I have with it is that it is only 16\" wide. So if your wall studs are ~19.2\" on center or more, this won't work.  Similarly, if you need to center the tv on a stud, this won't work there either. The instructions do say that an add on part can be purchased to retrofit this to work in those cases, so if you fall into the categories listed above, you have an option.  All in all, it's s fair bit of kit. And it's holding up a beast of a tv with no trouble at all.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1544400000000}
{"reviewTitle":"Great functionality, but sags slightly and doesn't keep level.","reviewDescription":"Two issues:* If you adjust the TV around from side to side, it will rotate a little.  So you can move the TV around, but it will only be level in one general area.  You can re-level it so that it's good in any particular spot, but there's no setting that works everywhere.* It sags a little if you have the TV extended.  The plate that mounts to the wall will flex a little, causing the arm to tilt down slightly.  It's not an issue if it's free-standing, but if you have the TV right over something and want a small gap, it's a bit annoying.Otherwise it's well-designed and constructed for the money.  It will work with almost any VESA TV, and it works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579737600000}
{"reviewTitle":"Swivel","reviewDescription":"Wall bracket is smaller than standard mount. May require special mounting to wall. Easy to rotate for viewing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Great Mounting System","reviewDescription":"The name almost says it all!  The mounting bracket is easy to hang on the wall, it's adjustable in any way, easy to move the TV around for any viewing angle, it's a great product.  I put the hardware on the back of the tv first, mounted the rest of the hardware on the wall and then my wife and I quickly and easily lifted the tv into place and then removed the free standing legs from our tv.The only thing that I can fault is the lack of flexibility in positioning the wall mount.  I ended up putting 2x4's on the wall to span two studs so I could center the tv horizontally in the wall.  Other than that it's a 5 star rating.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1558310400000}
{"reviewTitle":"Does the job so far.","reviewDescription":"TV up on the wall finally. Seems constructed of heavy steel and I don't notice any wobbling etc. I'm not an expert in TV mounts so I can't say whether this one beats out products at double the price. But I like it thus far.The included template was invaluable to getting the holes lined up. Once the mount was on teh wall, hanging the TV on it was a breeze. Easy enough that I put it on and took it off several times to adjust things to my liking.The only issue I had had nothing to do with the mount. Mine is an older home which has layers of plaster, drywall and  other \"stuff\" to the extent the included lag bolts were too short. So i bought 4 new 4\" long jobs I don't think the TV is falling down any time soon. At least I hope not!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1467244800000}
{"reviewTitle":"Don't get if you don't want to get frustrated. But see update!","reviewDescription":"After getting this, none of the screws fit. Had to go 4 times to the hardware store to get anchors that still couldn't hold it on the wall. At this point, there are so many holes in the wall and I'm done. It's going in the trash. I have never had something that the instructions look like they were written by a kid, and so difficult to put up. I have NEVER left a negative review about anything, but this has me so angry and frustrated that I had to.Update: After some research on my older home, I realized my walls were not drywall but plaster walls. A stud finder wouldn't work on these. After researching and measuring, I was able to find the studs in the wall. Once that was done, this was a breeze to put up. It also looks great and is very durable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1484179200000}
{"reviewTitle":"Not compatible with certain Samsung Tv's. At least it ...","reviewDescription":"Not compatible with certain Samsung Tv's. At least it wasn't with mine. The M8 bolts that attach the vertical arms to the back of my tv didn't have the proper spacer + bolt combination to work. To use the bolt alone, was too short. When using the only other option, a longer M8 bolt with a spacer, the spacer was too big and the threads on the M8 bolt barely thread onto the tv. It would only catch and go in for about 1-2 turns. Not enough for me.The wall plate was also barely long enough for the studs on our home. the back wall plate was only 16-17 inches. Given this, if you are trying to center this on a wall, the first stud needs to either be on the left-most or right-most wall. If you have a stud 16 inches away, then you must use the farthest hole to the other side to mount. This doesn't allow you to center the TV on a given wall if your studs aren't dead centered.I wouldn't buy this item again, don't fall for the marketting. The included accesories that are used to advertise this product are junk and you dont need them: bubble level in the pics: wasn't included. HDMI cable: $0.50 junk, cable ties: $0.05 junk. I spent an additional $15 of my time and energy going to lowes finding longer M8 bolts","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1477353600000}
{"reviewTitle":"Non-existent customer service","reviewDescription":"The product itself was very heavy duty, but did not come with the proper size screws to attach the bracket to the tv. I never was able to reach anyone at the customer service number provided so after 4 attempts gave up. One message at mid-day indicated their lines were busy & suggested calling back later. The second call was apparently after hours (10-6 Pacific time) but allowed me to leave a message...no call back received. The 3rd call the line was busy. And the last one I received a generic message asking me to leave a message, but the voicemail box was full!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600387200000}
{"reviewTitle":"Misleading advertising","reviewDescription":"While there is semi good range of motion, it is cumbersome to move, and don’t be fooled like I was: it will only tilt if you set it up that way. My contractor who mounted it for me shared that tilting it is a 2 person job and it leaves it in that set position! If you are looking for a mount that can seamlessly tilt and rotate whenever you want it to do so, look for a different product. I’m glad I only paid what I did for this and nothing more.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1599004800000}
{"reviewTitle":"Design Flaw.  Placement issues!!","reviewDescription":"I need this to mount in center of my wall.CRAZY - I know.Stud is dead center.  So the studs on either side are 16” apart from the center.  This mount must go into 2 studs and therefore if your 2 studs are not located where you want TV on your wall - You have to buy a mount extension kit for another $35.00.Really lousy design and too late to return!!Now I have to go buy 2x4s and McGyver it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1585008000000}
{"reviewTitle":"If you rotate it left or right it sags terribly because it can't hold the weight of our 50\" ...","reviewDescription":"The description said it was rated for enough weight to hold our TV, but it doesn't. If you rotate it left or right it sags terribly because it can't hold the weight of our 50\" flat screen. It is also starting to sag in the middle now after 1 hour after  of use. I had to take it down because I was afraid it would fall and break. Very Upset because I paid a professional to come & install the mount . 125.00.... I need a replacement asap because of the holidaysI need to get a CREDIT I'm warning that it isn't very sturdy!!!!!!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1511136000000}
{"reviewTitle":"Why 16\"???","reviewDescription":"This product will not work out of the box as it's designed for 16\" max gap between joists and it requires to be mounted into a stud. Well standard in the US is 18\". They convientnly make an 18\" adapter kit so you will need that for an additional 25 dollars.Do yourself a favor and buy a mount that works with a standard 18\" joist gap.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582934400000}
{"reviewTitle":"Not fully articulating.","reviewDescription":"Not as good as my prior wall mount because the tilt feature doesn't work without loosening it in the back with the provided wrench.  It looks terrible when pushed against the wall because we don't want to adjust the tilt every time and risk the plastic on our heavy TV breaking (when loosened the weight of the TV caused it to tilt forward really fast straining the mount and making a cracking noise) so we have chosen to leave it extended.  The level provided is garbage and after mounting we had to redo it because there was a 2\" difference.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1497312000000}
{"reviewTitle":"Great product but measurments are off","reviewDescription":"The holes between studs are supposed to be 16inches apart. The instructions say 16inches apart. However the mount and the template is not 16 inches.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Pretty Heavy","reviewDescription":"I bought this but didn't use it.  It is seriously heavy.  it's weight added to the TV made me doubt that a couple of lag screws in a 2x4 stud would be enough to hold it.  That said it seems to be well made.  It certainly is heavy duty.  With the TV at 38 lbs and the mount at 12 (at least), the idea of using this in extended position was just a little to scary.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1528588800000}
{"reviewTitle":"Looks great","reviewDescription":"But I wasn't able to install it after three tries. The mounting screws are very long for my apartment. This is for a house not an apartment that has sheetrock walls that are thin. Now I'm stuck with a mount I have no use for since 30 days has passed. This sucks and wished it worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1560384000000}
{"reviewTitle":"You might have to buy your own screws.","reviewDescription":"None of the provided screws fit my Samsung 48 inch. I had to go buy my own screws because either the screws provided weren't long enough or too long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1505347200000}
{"reviewTitle":"Two Stars","reviewDescription":"Haven't been able to mount to my tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1515542400000}
{"reviewTitle":"Great full motion TV mount.","reviewDescription":"This is a great little TV mount.  Installation was simple, and the ability to move the TV is really nice.  My new TCL 55P607 looks great on the wall with this mount.  It feels very sturdy, and has ample positions including vertical tilt (which is great if your installation wasn't 100% level).  Movement is smooth and easy, and it holds position very well.  The instructions are some of the best I've seen with a wall mount.The included template with stick on level is more trouble than it's worth.  You need to \"level\" the level to the template to make it actually usable, and it's just easier to hold the mount up the wall with a level sitting on top.  You get a much more accurate placement like that.  While it comes with a full set of bolts and spacers, I found the spacers necessary for my specific installation weren't going to fit well so I had to go out and purchase 4 additional M6 bolts. I could have made due with the included hardware, but this gave me a more professional installation.  Also it goes a lot smoother with 2 people, although I was able to do the entire installation myself.While the included \"freebies\" are nice, a plastic level, Velcro straps, and an HDMI cable, but I would have rather they kept those out and lowered the price.  The level is very small and made of cheap plastic, but I guess I could give it to someone who doesn't already own a level.  The HDMI cable while of decent quality was too short for my installation, but 6' should be long enough for many applications.This being a full motion mount, it does stick out quite a bit from the wall.  If you need something tight against the wall, a full motion mount is not the way to go.Overall I would say this is a great TV mount for the price. I would highly recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1504828800000}
{"reviewTitle":"Like it and easy to assemble","reviewDescription":"Good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Extremely easy setup","reviewDescription":"Used the mount for a 2017 44 inch Vizio as well as a 55 inch 2022 Samsung. The instructions were easy to read, and pictures provided in instructions were very helpful. The mobility capabilities allow me to turn it the tv easily and smoothly.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Mostly OK with a heavier flat screen...","reviewDescription":"This is the second of these mounts I have purchased and installed.  In addition to these two I have mounted three other televisions on walls.  The latest install with this mount was with a Sony BRAVIA W-Series KDL-52W4100 which according to the purchase info here on Amazon weighs 71 lbs.  This mount is rated for TVs up to 99 lbs so one the surface it seems to be within spec.  I would rate this 5 stars except that the tilting aspect is clearly not strong enough for TVs over I would guess 50 lbs.  I originally had the tilt at just a few (~5) degrees from level.  I took extra time making sure the screws were very tight to avoid it slipping to its maximum.  However, even with that extra precaution the tilt screws were not strong enough and the TV over time tilted to the end of the travel (full 15 degrees down).  To prevent this from happening again I removed the TV, placed bolts in the slots behind the integrated tilt screws to fill the slots and prevent further travel.  This seemed to work fine to secure it.  Also, the TV mounting screws supplied for my bolt size (M6) were either too short or too long.  I had bolts that were in between the supplied lengths on hand from another TV mount that were a better length when used with the supplied stand off plastic spacers and washers.  The 5 mm shorter length was critical to get maximum threads in the mounting holes.  In general with these mounts expect to play around with spacers or shop for other bolt lengths or additional washers.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1510012800000}
{"reviewTitle":"Read for good\/bad.  Good value but check all dimensions, 16” studs only.","reviewDescription":"Good tv mount for price\/value. Only fits 16” wide wall studs. Mounting a 46” LED on a wall with 24” studs (see below). Weight limit is good, range of motion is good and has enough tilt to hang about 6’. Screws and spacers should be enough for most TV but only M4, M6, M8 screws with two lengths, which required two spacers for my TV. I prefer the TV mount braces to be directly on the TV.  So I purchased the correct length screws for my TV and not use the spacers. This is a two person job to hang the TV. I also prefer a sturdier connection of tv braces to wall mount. I’ll be installing “furniture safety straps” later. This mount is max for 16” studs. I had to secure wood board across the 24” studs and then mount tv hanger onto the wood board to make 16” studs work.  This was not a beginners task.  Ended up using drywall push-though anchors to the wood board and drywall to make sure of a solid and secure mount. This made the depth from wall to tv front an additional 2.5” deeper. Pictures to follow.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1614988800000}
{"reviewTitle":"Good solid mount","reviewDescription":"Great mount very versatile","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Great for the Samsung 4K","reviewDescription":"This mount has been holding my precious 65inch Samsung baby securely for 2 years! It has held up really nice. The only issue with this mount is that it is tough to move around. Pulling it out sometimes requires the force of ten men. So if your think your 3 year old can adjust this mount with a TV attached then think again. You will need to help even small GF's move this as they have a hard time. So if you are an elf then you should get something that has better bearings...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683158400000}
{"reviewTitle":"Easy set up.?","reviewDescription":"Goes together pretty easy and set up if straight forword.  Use to hang tv off wall.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Missing anchors for concrete\/brick walls","reviewDescription":"I would have given it 5 stars, but they deliberately exclude wall anchors from the package. Considering that concrete\/brick is half of the use-case for their product, for them to not include the anchors and force us to hunt appropriately-sized ones from the hardware store (and thus requiring more know-how than expected of the common layman), I'm docking a star. Otherwise it's a nice product.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1685836800000}
{"reviewTitle":"Very good wall mount","reviewDescription":"This was very easy to install. It comes with a huge variety of bolts and washers so you can use what you need. It moves easily off the wall and you can angle the TV to the left and right. One thing is, if you want to angle the TV up or down, you have to use an Allen wrench to adjust the bolts on the back then tighten them again. Another thing that presented a problem is that there is only a certain amount you can move the TV left or right on the mounting bracket. So if you want to use studs, you may have trouble centering your tv. We used heavy duty wall anchors that luckily we had at home but be prepared that you may run into trouble if you want the TV in a very specific spot. Other than that, it's a great product.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1642291200000}
{"reviewTitle":"Did not work for me, may for you, better options available in my opinion.","reviewDescription":"Did not work for my specific application, unfortunately, due to stud spacing.  Unless you have a very large TV, there is no reason not to go with a single arm mount.  Installation is much easier, and offers a far wider range of motion.  Went with an Echo Gear mount, and have not had a single second thought.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1467331200000}
{"reviewTitle":"needs a tool to rotate the viewing angle up and down","reviewDescription":"Very heavy but easy to install overall.  I object that the up down angle must be managed with an allen wrench each time- much too awkward to do regularly!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1552694400000}
{"reviewTitle":"Careful when buying this if your tv has a 20 ...","reviewDescription":"Careful when buying this if your tv has a 20 inch wide gap on the back for the mount this unit will not fit it and you will have to add braces to make it work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1517184000000}
{"reviewTitle":"had to make extension bracket for older model led tv ...","reviewDescription":"had to make extension bracket for older model led tv  it wasn't due to weight but to the location of mounting holes on the back of the tv which further apart than the mounting plate. a little creative engineering was required.  could have sent back but that would have been a bigger hassle.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1461110400000}
{"reviewTitle":"The small footprint is nice but it was too small to mount","reviewDescription":"The small footprint is nice but it was too small to mount.  Our studs were slightly larger than 16\" apart and that's the max this stand will support.  Unfortunately we had to return it and buy a different one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1502582400000}
{"reviewTitle":"To hard to rotate","reviewDescription":"Too hard to move need help","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606176000000}
{"reviewTitle":"What you need to know","reviewDescription":"Liked product however, felt the weight of the product was too heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1584748800000}
{"reviewTitle":"Very heavy, difficult to adjust.","reviewDescription":"I find this bracket difficult to pull out and position.  It forces you to pull rather hard on your TV.  It also weighs a ton!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1525824000000}
{"reviewTitle":"Narrow, closely laid out brackets only","reviewDescription":"MM [millimeters] extremely smaller than inches. This can only hold large, thin TVs with supper narrow spacing for brackets. If your flat tv is before 2012 probably won’t work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1520208000000}
{"reviewTitle":"Not a low profile mount. 6 in gap from wall","reviewDescription":"Nice mount but extends A LOT more than 3 inches from the wall. Too much trouble to take off and do again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1538265600000}
{"reviewTitle":"A good wall mount with a few caveats","reviewDescription":"I received and installed this mount yesterday. After installation, I have some pros and cons. First of all, the pros: the installation instructions are very good. They provide a great template which is self stick for the wall to know exactly where the mount and lag screws will be placed. The mount is sturdy, is easy to use, and does not sag. The assortment of bolts for the TV mount are acceptable, though not the best I have seen. You may need to alter spacers for them to work.Now, the cons: The mount is about 18 inches wide. I can't say enough, but this makes it very difficult if your studs aren't exactly where they need to be. This could be remedied if the bracket that attaches to the TV mounts was a bit wider to provide some side to side movement, but in my TV's case, I have exactly 3\/4 of an inch of movement left and right. My old mount allowed for the TV to slide up to 6 inches either way and was in no way visible behind the TV. You have to be extremely measured in your installation if you have a tight space.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1485907200000}
{"reviewTitle":"Full motion TV mount","reviewDescription":"Exactly what I needed and pretty good quality and easy to install start to finish 20 mins.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Great Wall Mount Except for 1 Thing","reviewDescription":"This wall mount is a great buy and is very sturdy except for one thing. Where the tv hangs on the bracket, at the bottom there are 2 screws that are the only thing holding the tv on the bottom of the bracket. Those 2 screws are not a very large diameter and look like if you pull too much from the bottom of the tv to move it around, those screws could break pretty easily. Then the tv can be easily unhooked from the top of the bracket and fall. I used it for a 55\" curved screen that weighs about 45 lbs. If you're using this for a smaller tv, or if you just hang your tv and don't move it all the time and don't have kids messing with it, it will be fine. If you do move your tv position frequently, just don't grab the bottom of the tv. Grab from the upper half of the sides of the tv to move it and you will probably never have a problem.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581206400000}
{"reviewTitle":"Solid, easy to mount wall-mount.","reviewDescription":"The thought of installing a wall-mount can seem daunting, nobody wants to see their expansive flat screen drop and smash! Fortunately this Mounting Dream wall-mount is super easy to install! This particular mount is designed with a 16\" wide base to attach in between two wall studs. Quick note: YOU MUST ATTACH ALL WALL MOUNTS TO STUDS, NOT ANCHORS IN DRYWALL!!! That being said, once you locate your two studs, there is a paper template with a level attached to get the placement just right. Drill your holes, bolt it down. There is no guess work with the template! The mount itself is nice thick steel, which is painted or powder coated black. It moves easily and articulates well. Only hang up is the bolts which control the points of articulation are controlled by a hex key, but some type of finger operation (like wing nuts perhaps) would have made it a five star. But overall very happy with the purchase! Way less expensive than options in stores! It does come with an hdmi cable, but it's too short to really be useful for wall mounting if you plan to hide your cables.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1477526400000}
{"reviewTitle":"Functional, adjustable, and well priced.","reviewDescription":"This setup comes pretty well ready to mount to your wall and toss on your TV without much issue.I do not have any regrets with the purchase.  The \"system\" even comes with a little torpedo level...and thats why I'm docking a star.I mounted this up using the included level,and after it was all set, it was plainly not level (didn't see it while standing within arms reach, only when stepping back)  The included level in my kit is not accurate.  Oh well, i just told the wife it was fine and was willing to live with it...and then a couple days later was told I had to take it down and fix it.Other than the level issue it seems to be a good setup.  I don't plan on moving the TV around, but its nice it has different options.Oh, I'd also toss the included lag bolts (for wall studs) as they are larger than needed.  I used GRK cabinet screws and some additional sheet rock anchors.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1543104000000}
{"reviewTitle":"Works perfectly but for one minor issue - no need at all to pay more for a more expensive model","reviewDescription":"I've used three different mounts.  This one is the least expensive and is good as the more expensive ones but for one issue.  The plate that goes on the wall is exactly two studs distance wide.  Which means if the center of your viewing wall is a stud then it is impossible to have a flush mounted centered set up.  You can pull out the mount and angle it back flat which is what I did.  The TV is centered and flat to my viewing but is about 10 inches out from the wall.  Not a huge problem but not optimum.  The wall plate should be the width sufficient to be screwed into two studs with the third in the middle.Otherwise this is an excellent mount.  I used it for a 55 inch ROKU and saved about a hundred bucks from what I bought before.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1569888000000}
{"reviewTitle":"this helps me to be a better reviewer. While it is true that many items ...","reviewDescription":"Works well, heavy duty, could probably hold a lot of weight.Disclaimer:I am under no obligation to provide a positive review and received no incentives or rewards for doing so. My aim is to highlight features and drawbacks that I would want to know about as a buyer, not hype the product for the manufacturer to increase sales. My remarks are sincere and true. I work very hard trying to write insightful and thoughtful reviews for each item. My hope is that these reviews are helpful to others. If it did not, please comment with how I can improve; this helps me to be a better reviewer. While it is true that many items are received at discounted rates or complimentary, my reviews are completely unbiased as well as honest and are my personal experiences and opinion of the product. Once again, it is just my own opinion and experience with the product, your own opinion and experience may vary. I received no monetary compensation and not required to give a good review. This disclosure is in accordance with the Federal Trade Commission Guidelines on Testimony and Advertising","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1465171200000}
{"reviewTitle":"Great quality but very stiff and sticks out a lot.","reviewDescription":"See pros and cons:We used this for a 55'' led tv.Pros:Heavy, well built and very sturdy.Installs easilyComes with a lot of extra spacers, washers etc to allow for variances of different t.v mounting formatsCons:This unit makes the tv protrude from the wall quite a bit, for ours its at least 5''The unit is VERY stiff pulling it out and pushing it back in, if you are going to need to be pivoting it a lot then you better install it in such a way that your hands can reach behind it to help move the arms from behind or you will have to pull on the tv quite hard and it will seem like the tv will get damaged.  Maybe in time it will get smoother or you can try lubricating it periodically.All in all its a good tv mount that appears will last for a long time with no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1545955200000}
{"reviewTitle":"... for this model) and so far it's holding up great. I installed this above our fireplace and I ...","reviewDescription":"I used this bracket to install a 55\" Samsung TV (the maximum supported size for this model) and so far it's holding up great. I installed this above our fireplace and I love that it's full motion because it makes it easier to get behind the TV and convenient when you need to adjust to the viewer's eyes. I also like how I can turn it away from the window when it's too sunny during the day. The only problem that I encountered was during the installation. The bracket was too small that I couldn't center it on the studs and thus making it off centered with the fireplace. Mounting Dream has an extension accessory for 18\"-14\" wide studs (sold separately) but this was too long for my application and my only solution was to buy a wooden board, screw that into the wall, and then screw the bracket onto the board. Also you need to use quite a bit of force to swivel it around and sometimes I feel like i'm pulling on the TV too much.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1480377600000}
{"reviewTitle":"Good, not Great. Buyer beware.","reviewDescription":"For most people this probably will work fine. For me it did not. The bracket that goes on the wall is only 17 inches end to end, so it must be centered directly between 2 studs, no wiggle room. This means you can’t really center it on the wall exactly where you need it.  You have to rely on the maneuverability of the extension arm. This works somewhat, but when moving the tv out of the centered position it causes the tv to jut out from the wall. The end result is an odd looking mounted tv.  I might end up replacing it. The one a bought for my other tv from Costco worked a LOT better for centering. I gave extra points because they included a super long hdmi cable and Velcro ties. That was actually a nice touch because I found myself needing both.  It was also fairly easy to assemble compared to my last one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1543622400000}
{"reviewTitle":"Works fine for price, but very poor design for mounting to 16\" studs","reviewDescription":"This product works fine for the price, but leaving a 1 star review because it is very poorly designed for standard 16 inch studs. You would think the slot would be centered at 16 inches to allow for some wiggle room in the stud location. Nope, the very outer edge of the outside slots is 16 inches. What this means is that 1) even with perfectly spaced studs, you're hitting the edges. 2) If you got unlucky like I did and found the two studs that are a smidge more than 16 inchs OC, then you're drilling new holes in the mount to get proper screw engagement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"MOUNTING SLOTS ARE NOT ON 16” CENTERS","reviewDescription":"At first glance this is a solid, well built unit, and it may work for some. It is not built to American standards as the center of the mounting slots is at 15.25”, not 16”. When you locate a wall stud, you’re actually finding the nail or screw that goes into it, not the wood itself. Because of this, when you mark a stud, you may be off center by almost an inch, worst case, so you need a bit of wiggle room , which is why there are slots and not holes. After very carefully marking my stud centers, the template slots were just barely lined up with the stud centers, with absolutely no wiggle room if my center was slightly off. Sure, it’s possible to shoot the screw in at an angle, but that’s not the best way to ensure that my 40 pound television stays up on the wall where it belongs. I’ve mounted many tvs in my life and know what I’m doing, and it rankles me to no end when products like this are sold with major design flaws. I sent mine back.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Cheap product- not worth it","reviewDescription":"After meticulously installing this product on my wall, ensuring perfect leveling with the aid of tools, I was disappointed to find that despite the base being perfectly aligned, the metal arms failed to sit level. Consequently, my TV ended up at a slight angle, rendering my efforts to level it futile.Furthermore, the tilt mechanism of the arm proved to be disappointingly flimsy. Despite the manufacturer's claim that it could support up to 99lbs, my 40lbs monitor caused it to gradually tilt downwards over time. The tiny screws meant to secure the tilt simply can't bear the weight, resulting in a frustrating and unsatisfactory experience.Given these issues, I strongly advise potential buyers to seek out a higher-quality alternative.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Horrible instructions, missing pieces","reviewDescription":"After attempting to install this, I’m shocked at how great the reviews are. Several necessary pieces are missing from the box. The numbered\/lettered pieces don’t fit into each other as the directions describe. The directions are pictures only, very difficult to follow. Terrible experience. We are pretty handy and installed a different mount with no problem for a different size tv. This one just sucks.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Doesn't move well","reviewDescription":"The whole point of this style of mount is their maneuverability. The hinges on this are so stiff i have to reach behind the TV every time and push them manually to move it. Trying to reconfigure the mount by holding the TV feels like I may damage the screen. This is not a good brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"arrived damaged","reviewDescription":"Looks like I received one that someone returned due to damage. Box was fine, but product was damaged so couldn’t be during shipping.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Poor customer service","reviewDescription":"I bought 4 of these brackets and they worked well. Recently I bought another unit and contacted Customer Support a number of times to request anchors for concrete-as per their instructions. They never answered the phone or called me back. Very disappointing when a company doesn’t stand behind their policy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Hope the buyer is an engineer and mechanic.","reviewDescription":"This is NOT a \"mounting dream\" due to the fact that the wall studs in the wall MUST be 16\" or less on center which i don't have.Also for studs over that there is another extension part #MD5232 \"available on Amazon.com\" for an extra charge of course.  Ok, mount is on the wall. now lets mount the 2 brackets on the back of the 37\" tv, but wait... the mount holes on the back of the tv are 20\" apart. The \"Mounting Dream\" MD2380 needs 16\" or less just like the wall studs. I build and modernize elevators and will create a solution but i however do not advise anyone to buy this mount due to the missing width extensions AND the bracket closest to the tv being too narrow. Not sending the wall width extensions is a sleazy way of adding profitability to this item line. * Update- tv is mounted and i did fabricate 2 pairs of extensions, 1 pair for the wall @21\" wide and 1 pair for the tv @ 20\". NOT again.","isVerified":true,"ratingScore":1,"reviewReaction":"69 people found this helpful","country":"United States","date":1545350400000}
{"reviewTitle":"Not for 32 inches TV","reviewDescription":"The brackets that go the TV are too long for a 32 inch screen, they stick out below the TV.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Screws didn't fit my Sony Bravia 50' WTH","reviewDescription":"Junk!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good value, a bit limited in positioning, strong","reviewDescription":"Liked value and strength. Disliked how 2 of the position holes cannot be used if you need to use the gap filler when attaching one part to the back of your tv. A bit difficult to adjust the tilt angle: 2 person job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Sturdy","reviewDescription":"These are well made and can hold a lot of weight. I feel safe with my tv on it and makes the room look nicer than on a stand","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Required assistance - hard to access plugs","reviewDescription":"The mount is very good, good range of motion, easy to adjust once installed. But I required a professional to mount it, due to my stud being wider apart than the original product dimensions. (I found out afterwards). I ordered the extender, which worked, but the size of the mount back makes it very hard to reach the ports on my television.Otherwise, satisfied with the product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Overall good but sags a little bit","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Great stand, I was only able to mount to ...","reviewDescription":"Great stand, I was only able to mount to one stud, due to my builder doing some weird framing over my fireplace. I used two toggle bolts that could each hold up to 50 lbs. I used two lug bolts (Included) into the stud (Top and Bottom of the left side of mount) and then I did two toggle bolts (1\/8”x4”) on the right side top and bottom. It is very sturdy even not being into 2 studs. My only complaint with the stand is the plate the TV mounts onto is just wide enough to hook the TV on. They could definitely make this plate longer so that you could slide your TV left or right to help center, but with my TV 49\" it didn't have any room for adjustment. Overall, I would recommend this stand, if it works with your mounting situation. I would recommend finding at least 1 stud, but I don't think having 2 is an absolute must, with the right equipment you can make 1 stud work just as well. With some heavier duty toggle bolts (I saw some that went up to 100 lbs) you could probably mount this only by toggle bolts, but that would make me a little nervous. I have been using this product for about 2 weeks now with no issues. See my pictures for added clarification.Pros:-Sturdy Construction-Telescoping mount-Swivels Left and right-Angles down-Ample Mounting of Supporting Materials (Comes with a replica mounting sheet that you can test on your wall before drilling any holes, as well as bubble level for both the paper [stick on] and for the mount)Cons:-Mounting Plate not large enough to adjust left or right for small centering adjustments (My Tv was at the Max mounting hole width at 16”, if your tv mount holes are closer together than 16” than this might not be a problem, or if your studs are in the right spots to perfectly center, then it also won't be a problem.)-Takes some effort to pull TV out and Push in, there are no springs to help offset tension (Not a huge problem, but worth notating.)-Angling up or down requires loosening and tightening screws in the back (Also not a huge deal, adjust it where you want it one time and then just leave it.)-Recommend having 2 people (I know some can do this by themselves, but it is easier and safer with two, this would probably be the case for most any mounting stand though.)","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1509148800000}
{"reviewTitle":"Quick easy install with included parts","reviewDescription":"This wall mount came with a nice piece of stock paper to drill pilot holes.  It also came with a small level that could stick to the stock paper and the stock paper had a couple self adhesive strips to stick to the wall.I marked the spots on my wall where the studs were and applied the stock paper to the wall.  Double checked the alignment with the studs and used the level on the paper to make it level and drilled the holes.Then I used my impact driver to screw in the mounting bracket.  Double checked the alignment with the included small magnetic level and it was good.The screws that were included for mounting the tv brackets to my tv (an old 42\" plasma) fit just fine.  I was able to put the tv on the wall mount with only one small issue.  The backplate where the tv brackets hook on hits the power plug on my tv.  I took off one star for that, but it would really be just half a star if I could.  I also think it's an issue with Panasonic, at the time, using very large plugs on the back of their tvs.  I could move the tv higher and alleviate the plug from hitting the bracket but then I would be able to see the tv brackets at the bottom of the tv.I usually buy tv wall mounts from another site, but thought I'd give this one a shot because shipping should be faster and I'm glad I did (not because of the shipping).  This is a nice wall mount and I'd definitely put Mounting Dream as something to consider if I needed another tv wall mount.On a side note - Amazon failed to deliver the wall mount by the guaranteed delivery date and could care less when I contacted them to tell them it was passed the delivery date.  Amazon shouldn't put guaranteed delivery dates on their site if they don't stand by it.  Shame on Amazon for misleading me and other consumers.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1565222400000}
{"reviewTitle":"Solid, but studs need to be centered","reviewDescription":"This mount was solid and relatively easy to install... if your studs are in the right spot. Mine weren't, which would've made the TV off centered on the wall. Returned and ordered one that slides left to right to deal with the stud locations.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"From a mechanics experience,  EXCELLENT product.","reviewDescription":"I have vast experience in residential maintenance field. Dealt with numerous types of walls. This product covers all types of wall material. The installation instructions are  easy to understand using easy verbiage and images. Packed in the product box is plastic marked bags containing all types of screws and hardware to attach this bracket.  However there is one drawback as in my case. The center of my desired placement of the TV falls on a stud. My studs are 16\" on center. Meaning the center of the bracket is screwed in the center stud. Leaving the ends of the bracket to be in between the next adjoining studs. In this case I purchased \"toggle straps\" to insert into the wall for the ends of the bracket. These wall anchors hold up to 70 Lbs. each. My TV weighs 30 lbs. The center of the bracket was screwed to the center stud using the lag bolts that are supplied. I paid under $10.00 for the toggle straps. Upon completion of the bracket placement I performed the recommended test to check for a secure install, using a 50 lb. weight..  It held up great. No worries. With the 2 other bracket attached to the back of the TV it was a matter of just hanging the TV onto the wall bracket. Then tightening 2 screws to secure the TV back brackets. With the TV fully extended it is a breeze adjusting the tilt and swivel of the TV. The swivel is adjustable without loosening screws, but the tilt must be secured with tightening four screws.  Reason for 4 stars and not 5, is that the entire length of the wall bracket is 17\". Not enough to reach the left and right studs when one stud is in the center of the placement. I'm assuming that the length of the bracket is so that a smaller TV can be mounted without the bracket exposed. A suggestion to the manufacture. Make longer brackets or supply metal extensions, to reach the next wall studs, that can be attached to the wall bracket.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1565136000000}
{"reviewTitle":"Damn near perfect.","reviewDescription":"I finally caved and got rid of my 36\" Toshiba tube TV from our bedroom and replaced it with a 55 Samsung LED.  The old TV was sitting in an armoire which it was the perfect fit.  The 55 was going on the wall and I needed to mount it.  I decided against mounting it flush so we could point it to anywhere in the room.I did little research before I purchased this mount based on its ability to tilt and swivel along with a good price.  Installation is easy even for a marginal DIY'er and its heavy metal frame will support at least 200 lbs when lagged into studs.  I know because that's what I weigh and I hung on it before hanging the TV.When unpacking, the only assembly of the mount you have to do is to attach the TV rails to the frame but that's after you mount the TV to he rails.  The hardware comes neatly sorted in pouches with an assortment of spacers and screws of different lengths to mount just about any TV.  It takes a bit of sorting to find the combination you need for any particular model but not all model TVs will work with the spacers and screw lengths.  My Samsung didn't and I had to cut two of the screws by about a 1\/4 inch to make them work.The only reason I didn't give a 5star is because of the spacers and screws having a large difference in length between the screws provided  While the shortest to the middle length screws and spacers length was only about 1\/4 inch, the difference in length between the middle screw length and the longest was about 1 1\/4' inches.  Another length dropped in between would probably make fitting every TV possible.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1578614400000}
{"reviewTitle":"TV bracket","reviewDescription":"Nice heavy metal all put together , not much on direction","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Works great on a 55 inch","reviewDescription":"We recently decided to mount our TV in the living room after rearranging our furniture. This is the second mount we purchased, as we were very satisfied with the first one we installed in the master bedroom. Here's a comprehensive review of our experience:Installation Process:- Ease of Installation: The installation process was straightforward, especially the second time around. The mount came with all the necessary hardware, making it easy to get started right away.- Helpful Tools: The included paper outline was particularly useful for marking the placement of the holes. However, we wished it came with a tack for easier positioning on the wall without using tape. This would have made it simpler to use the provided leveler to ensure the holes were perfectly aligned for drilling.- Hardware: There were ample screws and washers included for securing the mount to the rear of the TV, ensuring a secure fit.Product Features:- Articulation: The mount offers excellent articulation, allowing for in, out, and side-to-side adjustments. This flexibility is perfect for our needs, ensuring we can achieve the optimal viewing angle.- Tilt Angle: The tilt angle is also impressive, offering a good degree of motion for adjusting the TV's angle to reduce glare and improve viewing comfort.- Cable Management:** The one area where the product could improve is cable management. It would be beneficial if the mount included some mechanism to organize and conceal cables behind the TV.Overall Satisfaction:Overall, this TV mount is a great product. Its ease of installation, combined with its excellent articulation and tilt features, makes it ideal for our setup. With the addition of a cable management solution, it would be nearly perfect. We highly recommend it for anyone looking to mount their TV securely and conveniently.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Sturdy and Versatile TV Wall Mount","reviewDescription":"I recently installed the Mounting Dream TV Wall Mount in my bedroom for a 55” TCL TV, and I couldn’t be happier with the result. The installation was straightforward, and the dual arms provide excellent stability. The swivel and tilt features allow for easy adjustments, ensuring the best viewing angle. It fits perfectly on 16-inch studs and supports up to 99 lbs, giving me peace of mind. Overall, this is a great value for a full-motion TV mount, and my TV looks fantastic on the wall!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Solid and well documented","reviewDescription":"This is a good, solidly built product.  The documentation was well written and easy to follow.  It supports my 48\" computer monitor well and I have no concerns about it toppling.  It is also very adjustable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Handles a 55” like a Boss…","reviewDescription":"After researching multiple full-motion TV mounts, I decided to purchase the Mounting Dream TV wall mount for my 55” Samsung TV. I am very pleased with my purchase. It’s a solid mount at an exceptional value. The instructions are clear and easy to follow. The template that is provided makes installation much more efficient as it allows you to pre-drill your holes per the stud layout in the wall. The bracket extends and pivots with ease to your desired location of view. It’s a very sturdy mount and handles my 55” TV with no issues at all. Due to the stud location in the wall, I did mount a board to the wall and then attached the mount to the board to ensure my TV was centered in the wall and it worked perfectly. They do offer the option to order extensions to meet your stud's spacing, however I found the board to be just as effective. It’s just a preference, but it can still be mounted securely utilizing alternative methods. This is a well-made quality mount that I highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Very sturdy, strong, works","reviewDescription":"I was adding ledger rock on to my wall and wanted to install my 65\" TV over it. As I was installing the rock, I made sure to drill holes where the studs were so that I could install this mount. So actually installing it was pretty simple, With such a large TV I had someone help mount it, but tightening it and adjusting it was a one-person job. The mount is very heavy and sturdy and I have no doubts it will hold for as long as i want it to.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Consider Stud Position First","reviewDescription":"I have an early version of a flat screen tv from when they were thicker and heavier. It’s 53 inches and 69 or 79 lbs, can’t recall exactly. The mount seems to support it sufficiently. The instructions for installing this wall mount were easy to follow, and it came with various bolts and things to adapt to my specific needs. The only downside is that my studs are off center from how the tv has to be positioned. I can move it sideways to center it only as long as it’s outstretched a ways from the wall, but if I push it back flush against the wall, it has to be off center.  The tv is on a narrow wall next to a doorway, so having the tv extended about a foot from the wall is unsightly as you walk through the door. If I had realized that beforehand, I’d have bought a different model that lets it be flat against the wall but moves horizontally to center it. I’m still giving this five stars though, because it’s a great wall mount and works as advertised. I personally should just have gotten a different model for my needs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Very nice product for the price","reviewDescription":"This product was very well packaged. It had everything I need to make an easy install, had no problems with fitting my tv, all hardware is included for the install( big lag screws). Will purchase again, for the price you can’t beat it with the mobility and sturdiness! Great price point!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Never Experienced Such AMAZING Customer Service","reviewDescription":"I couldn't get the tv screen level for the life of me. I used a level to ensure the actual wall plate was even when I installed it so I knew that wasnt the issue. I tried all of the tips and tricks to make it level and nothing was working so I gave up and called the customer service number. It went to voicemail so I assumed it was past business hours. I didn't leave a voicemail or anything, just figured I would call Monday. The woman from the voicemail recording called me back (past operating hours) within 15 minutes and helped me fix the problem. The tv mount was easy to install and I was able to do it by myself. I recommend this mount tenfold!!!! Amazing product and customer support!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good quality","reviewDescription":"Its very sturdy and comes with the hardware needed to mount. I am no handyman but was able to install the mount. It can be moved around for different viewing angles. Basic tools needed are drill, drill bits, and screw drivers. I prefered to use my own Level on it. Mounted a Sony Bravia tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Easy to install and sturdy","reviewDescription":"It was my first time installing something like that, and the instructions made it very easy. To ensure the correct installation, get a stud finder, so that it doesn't rip out your drywall :)Great quality and I loved that they provided extra spacers for any size TV back mounts.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Two Stars","reviewDescription":"Did not fit my 46 inch Vizio","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1482105600000}
{"reviewTitle":"Not for me","reviewDescription":"Very heavy and difficult to adjust. Wouldn't recommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1491436800000}
{"reviewTitle":"Two Stars","reviewDescription":"not so impressed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1438214400000}
{"reviewTitle":"I would not recommend it, I'm returning it.","reviewDescription":"So far the product is just barely better than my completely shattered screen.  I'll be returning it. It has certain areas that aren't responsive to touch, but keeping the screen on auto rotate is a simple enough solution to that. For some reason it goes haywire when I put in the screws, so I had to take those back out, then whenever I but the back on it becomes less responsive to touch so basically I'm sitting here with a tablet with no back and no screws and a screen that's display is not nearly as bright as a whole,  but with faded and bright spots. However.  It works,  for all the problems I'm facing right out of the box,  I can't say it doesn't work, so it gets 2 stars for working.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1484524800000}
{"reviewTitle":"Great mounting set up.","reviewDescription":"I am very pleased with this product. It was easy to install and the range of motion is great. The mounting system was very well designed.I highly recommend this item.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608163200000}
{"reviewTitle":"Horrible instructions","reviewDescription":"Instructions were horrible and incomplete. Took me over an hour to install. Seems very sturdy though but not worth the hassle.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617235200000}
{"reviewTitle":"Unhappy customer","reviewDescription":"This is not a full motion mount.  It stated it swivel and tilt. It does NOT. I'M VERY UNHAPPY","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1610409600000}
{"reviewTitle":"BEWARE - this mount only spans 16\" studs, there is no  way to center a TV if the stud placement does not line up.","reviewDescription":"The Mount is EXACTLY 16\" wide, so.. good luck if you want to place your tv anywhere other than between two studs. Nowhere in the product description does it say that this mount ONLY works if where you want to place the TV is exactly between two 16\" studs.I want to mount my TV over the fireplace, the STUDS placement does not work. So I purchased the extension piece and that too does not work.I was dissapointed because the product seems like a quiality build and they throw in a few extra peices but the mounting plate needs to be wider.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1500249600000}
{"reviewTitle":"Really heavy","reviewDescription":"Looked strong, but was really heavy and my wall wasn’t  strong enough for something that heavy, almost felt heavier than my tv if not way more heavy & my tv was 40”, so I had to return it! But for the walls strong enough I’m sure this is a great product!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1550620800000}
{"reviewTitle":"It serves the purpose","reviewDescription":"Not as sturdy as I would of thought","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1561334400000}
{"reviewTitle":"Check your stud distance and positions before buying","reviewDescription":"Update, 3 -> 4 stars. *I* dropped the ball here by not checking my stud spacing and carefully checking the description before ordering. I think I was a initially a little more salty than I should have been. Most walls should have 16” studs, so this should work well for most. I also realized that even if the wall mount plate has limited horizontal flexibility, the TV arms and TV can be placed anywhere on the wall mount plate. However, I do think still it’s nice to have some flexibility on where to mount the wall plate, especially if you don’t have exactly 16” stud spacing or need to work around outlets. I ultimately went with mounting dreams similar “Advanced” wall mount that fits up to 24” studs (MD2104) and I like it a lot.Original review:Looks like a solid mount, but only accepts stud distances up to 16”, and falls short of my 18” studs. Every other mount I have seen has a wider plate, but my bad for not checking the description too carefully.This also means that event if you have 16” studs, you will have exactly one horizontal location you can install the mount with no available left\/right adjustment.When I asked the seller about this, they proposed mounting additional horizontal 2x4s on my wall or buying an additional $40 24” adjustment plate.So the choices the seller gave me are to make it look ugly or to spend $80 on a $40 mount.The other choice is to return it, I’m doing that one.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Tv wall mount","reviewDescription":"Bought this for new 55 inch tv. Works great and very sturdy. Two nit picks.  Arrows on the metal front to show UP are small and hard to see. Just stamped and same color as metal. And the level that came with the unit is about 3 inches long and has a dark viewing area. Very hard to see.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Very easy to install. Range of motion is okay. Excellent for the price!","reviewDescription":"got it up on the wall pretty neat and quick. very simple installation just make sure you have a drill and a stud finder! CHECK YOUR STUDS BEFORE YOU ORDER of course. otherwise it is easy to adjust and it is very sturdy when mounted correctly. range of motion is just okay but is still probably above average for other TV mounts in this price range. i'd buy it again","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Tv","reviewDescription":"Very good product sturdy and works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Missing Parts","reviewDescription":"Make sure audit and inventory your parts. I had most critical screws missing which I had to run to home depot and purchase. Once you receive your package, cross reference the guide booklet with your parts…. Don’t wait like I did which was a crucial mistake.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great price, great quality","reviewDescription":"I consider this is a great choice, good price y excellent quality. It was a good purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Just barely fit my 77” LG had to do slight modifications","reviewDescription":"Nice sturdy mount","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Easy to install","reviewDescription":"It’s good lol","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"It hold my 50” smart tv at the precise product size","reviewDescription":"Outs a great product recommended if you are in a budget to be quite honest, what I like the most is the range of motion that the tilt it doesn’t work that well I tight the boost enough to manipulate the tv and gals I’ve and over so I have to tight them harder to have that view I desire.I own better products like this in quality that are quite longer in width to have more stud reach and not that taller as this one, the flaws are that the max distance in this wall mount is 16” the exact precise distance in any North America house studs.I hope this review helps to you guys!","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Easy installation","reviewDescription":"First cof my son installed this forr me he simply lined it up marked  the insertion point and next thing you know he drilled it in and wallah  it was mounted he had no problems  I would think it was a fairly easy job if you have the right tools.  And it looks great I'm laying in bed and it's tilted toward my bed for all day viewing love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Cheese","reviewDescription":"Maybe I shopped incorrectly. But the bracket is too small to fit the distance of my studs. So my tv is hanging by 3 bolts. If it falls it falls man. I drilled like 50 holes in my wall. It was do or rip for me man. Thanks","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1613952000000}
{"reviewTitle":"Already opened !!","reviewDescription":"This product came fast but when I opened the box looks like it had been used and returned all the plastic was off the items and shoved back in the bag the screws were all over the box and missing pieces!! So unhappy with this item. I see it has mainly good reviews but I am highly disappointed!!","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1540684800000}
{"reviewTitle":"Does not work with R.W.FLAME 36 inch Recessed and Wall Mounted Electric Fireplace.","reviewDescription":"It was recommended when I purchased a R.W.FLAME 36 inch Recessed and Wall Mounted Electric Fireplace.  It does not compatible with it at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Doesn't fit 70\" LG TV's","reviewDescription":"The packaging says it fits 42-75 Inch TVs. Nowhere does it give the mounting specs, where it mounts on the tv itself, in inches.The technician arrived and we found it didn't fit my new 70\" LG.  I had to run out to a local Best Buy and get another brand that I don't like at all! :)","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1564358400000}
{"reviewTitle":"Not a happy customer.","reviewDescription":"It is not at all compatable as described for VESA 300×300 . When I returned the product that I purchased with my debit card, they refunded to my Amazon gift card balance.  Not fair atall.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1629417600000}
{"reviewTitle":"Cheap\/ soft fasteners","reviewDescription":"I'm disappointed in low quality soft fasteners used with this mount. After installing and trying to adjust the tilt, one of the hex adjustment bolt round out. And after adjusting the level one the fasteners snapped off. For an extra $1 they could have actually provided some quality bolts\/ nuts. I hope the company will stand behind their mount when I contact them.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1487808000000}
{"reviewTitle":"Ok product , will be returning it.","reviewDescription":"Save your money and get one with a larger wall plate to catch both studs.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686355200000}
{"reviewTitle":"Don’t be fooled by 5 stars","reviewDescription":"Don’t be fooled by the 5 stars. This tv mount is a nightmare! It doesn’t not fit most tv’s. I’ve never worked with a more difficult mount. Your better bet is to go to best buy and pick up a rocketfish mount you’ll save a lot of time and headache","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1577491200000}
{"reviewTitle":"Missing parts","reviewDescription":"I really can't say because it was missing parts and have to send back","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676419200000}
{"reviewTitle":"All equipment not included","reviewDescription":"Did not come get with all equipment that’s need to mount tv. I missed my return period so now it’s just a box of junk just sitting in my garage. Not sure what to do with it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1634256000000}
{"reviewTitle":"EASY Install!","reviewDescription":"Needed an affordable mount for a college dorm.  Purchased and installation was easy and all the hardware and leveling tools included really helped!  A+++","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Rock solid","reviewDescription":"I guess rhat’s all you need to know. Instructions are good. Coles with most tools ans it is rock solid!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Great quality and easy setup","reviewDescription":"I needed a new mount for the bedroom TV. The last one was poorly installed (to the point where the TV looked crooked and was wildly distracting). I was able to set this up mostly on my own. Just needed a second pair of eyes to confirm the height was okay. Probably took me about a half-hour or less to finish getting it mounted. Might take longer if you've never mounted something on your own before. But it was very easy to put together.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Perfect Mount for My TV's!","reviewDescription":"This mounting bracket is fantastic! It was easy to install, and my TV feels secure and stable. The adjustable tilt and swivel feature is great for getting the perfect viewing angle. The build quality is solid, and it fits my 32\" TV perfectly (I am using two of them). Highly recommended for anyone needing a reliable and easy-to-use mounting bracket!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"TV level adjustment","reviewDescription":"this mount was easy to install and had an adjustment to level the TV if it was out of level after the install . ( easiest done before mounting TV ) Would definitely recommend .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"TV mount","reviewDescription":"Perfect for The Corner Spot that I am looking to have my TV mounted so that it can adjust from side to side. Price was very compatible actually more reasonable than big box stores.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Solid","reviewDescription":"I install this in our spare bedroom and put a 60 inch TV on it. It was easy to install and it’s very solid. Just make sure you get in some studs and you’ll be happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Had professional install and he was happy with quality and instructions","reviewDescription":"Works great.  Heavy duty.  If buy an additional TV, will order another one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Heavy Duty","reviewDescription":"Heavy Duty, easy to mount.  Would have preferred that the tilt doesn't require a screw adjustment, but otherwise great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Wall mount","reviewDescription":"Great wall mount works like a charm hold up my TV with ease love it and great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"One Star","reviewDescription":"Missing hardware.  Returned","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1538352000000}
{"reviewTitle":"One Star","reviewDescription":"Ordered it ! Said it was a 55 inch but it’s was way to small for my tv","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1521504000000}
{"reviewTitle":"To heavy","reviewDescription":"To heavy","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1580256000000}
{"reviewTitle":"Too heavy of a mount for drywall","reviewDescription":"Too heavy.  Definetely not for drywall.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1562976000000}
{"reviewTitle":"Keep refund money","reviewDescription":"I’m sorry I’m not returning it it worked you can keep the refund money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1532822400000}
{"reviewTitle":"One Star","reviewDescription":"Screws were striped and missing a few screws I needed","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1521331200000}
{"reviewTitle":"Was missing parts","reviewDescription":"Missing parts","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1564185600000}
{"reviewTitle":"looks bigger then it really is.","reviewDescription":"Would not fit my TV.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1550275200000}
{"reviewTitle":"One Star","reviewDescription":"Should I receive my items in 2 days it was over 5 days,","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1510358400000}
{"reviewTitle":"Careful when ordering open box items.","reviewDescription":"Was a good product,  but was missing an integral piece.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1515196800000}
{"reviewTitle":"Sturdy smooth moving and easy fine-tune adjustments","reviewDescription":"Sturdy,  smooth moving and easy fine-tune adjustments.  Works beautifully.  Do note that wall anchors are not included.  The 10x50mm anchors that are recommended for concrete walls are hard to find.  I used 1\/2\" metal concrete anchors instead which worked fine.I would buy again without hesitation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Easy to install","reviewDescription":"By far the easiest and inexpensive wall mount installation. Directions were very helpful, all the bags are labeled, there's a small level included, all the screws washers and spacers are included, even has a template for the wall mount making drilling and mounting simpler. Mountis very bulky. It feels like it will last for a long time. It is painted very good. My studs were spaced further apart, but they also have a kit for that.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Premium Articulating TV Wall Mount at Discount Rack Price - Buy with Confidence","reviewDescription":"At this price point, my expectations were fairly low for the Mounting Dream MD2380 articulating TV wall mount bracket. Much to my surprise, this wall bracket is a robust, well engineered, quality piece that is on par with similar TV wall mounting brackets costing 3 or 4 times as much. The instructions are simple and clear, and the whole installation process is very straight forward. MD even includes a bonus bubble level, a braided 6' HDMI cord, and enough machine screws and spacers to fit the TV mounting brackets to practically any TV on the market. It took me a little over 20 minutes from opening the package to having my 55\" 4K TV securely mounted to the wall.The unit is designed to allow you to adjust your TV to sit flat against the wall (with an approx. 3\" space) or pull it over two feet from the wall for angling. When extended, the TV can be angled left or right up to 35 degrees and you can also adjust the vertical picture angle from +5 degrees to -15 degrees. An added bonus is the articulation makes it MUCH easier to add components to your TV at a later time. Flat wall mounts require you to remove the entire TV to access the back panels. The unit feels very sturdy and can be moved with a nominal amount of effort. The packaging says this wall mount is rated to hold up to 100 lbs., but when mounted properly, my guess is it could handle at least twice that weight with ease.I highly recommend this product and I am writing this review because I came back here to order two more for our other flat panel TVs. If you are going to buy this wall mount, and trust me, you won't regret it, read on for a brief primer on how to install it.Installation experience: Before opening the box, you will need a cordless drill\/driver, a 3\/8\" drill bit, a measuring tape, pencil, a ratchet with a 12mm socket, a #4 phillip's head screw bit and a stud finder. The instructions say you can mount this bracket to sheet rock studs or cinder block, but not to straight sheet rock. Makes sense as even with sheet rock anchors, the bracket will eventually pull from the wall if the articulation function is used as intended. The first step is to locate what wall you want to mount the TV to and then use your stud finder to locate the studs that you will be anchoring the bracket to. I found that the easiest way to get a nice level mounting was to use the mounting template with the included bubble level. Once level, simply tape the template in place and then drill the four mounting stud holes right through the template. After removing the template, place the wall bracket against the wall, line up with one of the upper holes you just drilled and use your ratchet and socket to drive the first bolt in until it is almost tight. Leave some play so that you can align the other three bolts and do the same with each. When all four bolts are in place, go back and finish tightening them securely. Attaching the TV brackets is really easy with the plethora of machine screws and spacers included with the kit. Once the TV brackets are attached to the back of the TV, find an assistant (depending upon the weight of the TV - this will be a two person job) and place the TV on the wall bracket. You will here it click in place. There are two included screws at the bottom of the TV brackets which are used to lock the TV to the wall bracket. Make sure these are tightened so you can safely use the articulating feature. Plug in your cables, fire up the TV and Voila! You can now sit back and enjoy your TV from practically anywhere in the room with a perfect picture angle.","isVerified":true,"ratingScore":5,"reviewReaction":"28 people found this helpful","country":"United States","date":1499212800000}
{"reviewTitle":"Works great.","reviewDescription":"Great product. Looks great on wall. Easy install. Solid build.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"High Quality Product at a Fraction of the Cost of Big Box Brands","reviewDescription":"The TV wall mount came with simple instructions and a paper template that you tape to the wall where you want to install the bracket so that you can accurately pre-drill the mounting holes.  Very simple installation that only took about 30 minutes.The bracket easily tilts\/telescopes to adapt to your viewing angle, or to allow easy placement of cables for other accessories or soundbars.I installed this on. 65” TV and it handled the weight easily and provides more than adequate support while moving the position of the television.  It’s the right product at a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Great quality","reviewDescription":"Great for the price and quality, also has great features, and was easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Nice mounting instructions and solid","reviewDescription":"Easy to follow instructions.  Nice long lag bolts.  Solid mounting","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Yes, a dream as advertised!","reviewDescription":"I am so relieved this TV mount was easy to figure out and is very functional when installed.  As a bonus it comes with numerous sets of different screws and washers to fit any situation - no extra trips to the hardware store.  I was lucky that I was replacing an old mount so the anchors were already through the sheetrock and into the 2x4 studs.  It was just a matter of using the 2 of the same holes, adding 2 more to get the correct height, and then attaching the TV.  One of my best Amazon purchases!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714262400000}
{"reviewTitle":"WOW! Best TV Wall Mount EVER!","reviewDescription":"I never thought I would be this excited about a TV wall mount and yet here I am! The quality of this mount is unbelievable; it weighs more than the 42\" TV I hung on it. It was easy to install. The mount allows the TV to be moved side to side on the mounting rail and angled every direction on the mount itself. It comes with all configurations of bolt patterns and screws and washers to fit. I had looked at what my local stores were selling and their mounts were not as nice as this one and double the price. I highly recommend this mount. Buy it - you won't be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"I had someone install it for me. Does the job!","reviewDescription":"It should be available in other colors besides black: while. Beige. Just suggesting","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Felt like it was holding great for a few days then ...","reviewDescription":"Came with dry wall anchors that i used to Mount it too the wall.  Felt like it was holding great for a few days then who thing ripped out drywall.  Mount this to Studs despite mounting hardware. Cost me a 40 inch Plasma.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1500940800000}
{"reviewTitle":"I had already removed the mount I had up so I had to MacGyver it to fit.","reviewDescription":"I didn’t receive the mount that I ordered. The plate that goes against the wall was smaller and the rails that go to the tv wouldn’t fit on the wall plate.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1553472000000}
{"reviewTitle":"its a bad design, so stiff if you try to swivel ...","reviewDescription":"its a bad design, so stiff if you try to swivel it starts to slide off rack. Screws were to long to mount on a routine tv. Had to go buy screws. Should have sent it back but i already paid for install","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1516406400000}
{"reviewTitle":"Parts needed for concrete install.","reviewDescription":"Product does not include concrete anchors.  Description says to contact them to have then shipped separately.  Keep in mind if this is how you plan to install.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1545350400000}
{"reviewTitle":"Complicated assembly.  Returned it.","reviewDescription":"Not what I expected.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647043200000}
{"reviewTitle":"It's not wide enough for my Samsung TV's","reviewDescription":"It *may* fit *most* TV's up to 55 inch, but not either of my Samsung TV's (one a 50\" plasma from 2008 and the other a 55\" LED from 2017).  Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1521244800000}
{"reviewTitle":"Does not fit 55\" TV","reviewDescription":"My 1 star is only because it does not fit a 55\" Tv as advertised.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1585353600000}
{"reviewTitle":"4 times high expenditure to install it!","reviewDescription":"I had to hire a plus tech guy that causes another $70 to install it at the wall .","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1565481600000}
{"reviewTitle":"Sags our TV no matter how many times we adjust it...","reviewDescription":"SAGS no matter how many times it's adjusted! Piece of CRAP don't waste your money! Spend the extra money on a nice one that will actually hold up...","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1517788800000}
{"reviewTitle":"Measure first before you buy. The product states \"If ...","reviewDescription":"Measure first before you buy. The product states \"If your stud spacing is 18\" or 24\" please purchase our extension bracket MD5231 for wall plate extension accommodations\" however, you cannot buy this extension on Amazon or find it anywhere else.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1454889600000}
{"reviewTitle":"Check your wall before buying this product.","reviewDescription":"The product is ok but instruction said  put on concrete wall or put wood stud inside wall...  yea how?  well instead of returning product, I went to home depot and bought 8 more screw to make it stable.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1443139200000}
{"reviewTitle":"It quit working","reviewDescription":"This product quit working after seven months","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1596499200000}
{"reviewTitle":"Too weak to hold my tv even though it was ...","reviewDescription":"Too weak to hold my tv even though it was supposed to support my tv. I ended up buying one that had the 2 arms and that one worked.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1520812800000}
{"reviewTitle":"Missing screws. Product was opened","reviewDescription":"Was missing 2 screws that I needed. Luckily the handyman had an assortment from previous installations.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1562716800000}
{"reviewTitle":"Don’t buy","reviewDescription":"Absolutely terrible. I ordered this product twice and both times it was packaged with incorrect mounting hardware making the mount virtually useless.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1521504000000}
{"reviewTitle":"Not worth the hype","reviewDescription":"Lag bolts snapped in the studs tv mount should have more holes for lazy framers not getting perfect 16\" oc studs. I had issues and now it's sitting on my floor scratched up and not being used. Disappointed all around.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1455667200000}
{"reviewTitle":"TV is at different angle to the frame. Won't level.","reviewDescription":"I installed this level. The lag bolts are level. The frame against the wall is level. The bolts are centered. The TV is angled down to the right. Somewhere in the scissor mechanism, it is off.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1451260800000}
{"reviewTitle":"Alarmingly HEAVY!!!","reviewDescription":"Outweighs the TV by 3 to 1. I was afraid to use it so returned","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1558656000000}
{"reviewTitle":"Didnt work","reviewDescription":"Tried to install but it was too small for the TV","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1568678400000}
{"reviewTitle":"not good for for 46\" TV","reviewDescription":"Not a good mount very weak tilt all over the place. Very weak connections to screws. Keeps tilting to the side tips over from the top too much wont stay in place.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1471478400000}
{"reviewTitle":"This is working well for me","reviewDescription":"I paid a guy (that knows what he's doing) to install this for my 55\" TV.  He had the tools and had done this before so it didn't take that long (1 hour?)  It is strong and can be tilted to different angles. I have it up higher on the wall so he covered the cords with a conduit.  I would buy it again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Easy To Install","reviewDescription":"This TV Mount was a breeze to install. Just follow the instruction and use the provided templet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Works","reviewDescription":"This works great In our home","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"correct name","reviewDescription":"for this mount, cause its a dream to put up, took half an hour, everything in package you could need, and i hung a 55\" screen by myself because of the super design, nice price, just find your studs for strength, very happy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Works as it should","reviewDescription":"Bought this for my dad's 55 inch Samsung.  Had a handyman install it in his new apartment with no issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"don't buy expensive ones","reviewDescription":"for my a95k 65 in and my lg c1 55 have never had any problems with these mounts highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Wall mount","reviewDescription":"Used it to hang a 65’ tvIt’s perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Very well designed, sturdy mounts for just about any TV!","reviewDescription":"I've been purchasing Mounting Dream mounts for several years. Started buying them for home use and was so impressed I also began purchasing them for work.  Eight years later, and I am still purchasing them and recommending them to friends, family and coworkers.  Dozens of mounts later, and I am very happy with every single one I've purchased and installed.They have so many options, they're one of the best out there. Whether you need a flat-mount, arm\/articulated mount with short or long arms, light duty or heavy duty, they will likely have a mount for you.  I absolutely love their dual arm articulated mounts, as you can not just extend the TV away from the wall and back, but you can shift it left, right, or center, and bring it back against the wall on either of the three positions.  And if you mount these against wall studs or on concrete walls, the mounts will be sturdy and you will not worry about moving your TV when needed.You get all you need to mount these to most TVs out there, and that includes wall mounting bolts and screws for the TV. Make sure you confirm the type of mounting your TV needs (look in the manual or the back of the TV) so you know what you need. These mounts are very flexible when it comes to providing a variety of standard VESA screws, washers and extenders, but some TVs are not exactly mount friendly. Measure the distance between the holes and confirm the mount will support them. Like I said, most should, but you never know.Don't toss the extra screws and washers!  You might need these in the future should you replace your TV. These mounts are so good, I'd guarantee that you will use them with several TVs as long as the stand can support them.Packaging is excellent. Box is sturdy and componets are well packaged so as not to move and bang around in transit. Screws, washers and extenders are all bagged according to type and size in clear packaging, so you can select the ones you need easily.Lastly, it's a small detail, but it's a nice one - you get a free level. Although I have several \"pro-grade\" levels, I like to use these as they're smaller and can balance them on the arms as a second level. Plus - who doesn't need extra levels once in a while!?In short - Excellent mounts, excellent brand.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Excellent product!","reviewDescription":"Easy to install.  Very convenient and the price is great.  Very happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Sturdy","reviewDescription":"Very sturdy and strong. Easy to assemble and has awesome range of motion","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1555718400000}
{"reviewTitle":"This mount does not fit my 40 or 50 inch ...","reviewDescription":"This mount does not fit my 40 or 50 inch TV.  Make sure the mounting holes on the back of your TV are very close together!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1472428800000}
{"reviewTitle":"fULL MOTION?","reviewDescription":"uP AND DOWN?TILT?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1545264000000}
{"reviewTitle":"Requires studs","reviewDescription":"Requires mounting into studs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1540684800000}
{"reviewTitle":"Keep shopping","reviewDescription":"Ehhh....could be better. It tilts down and will not say up even when tightened.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1502496000000}
{"reviewTitle":"Missing parts","reviewDescription":"Came with no mounting hardware....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1532736000000}
{"reviewTitle":"Two Stars","reviewDescription":"Very, very heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1522627200000}
{"reviewTitle":"Two Stars","reviewDescription":"Did not fit my tv - had to return it","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1491523200000}
{"reviewTitle":"Two Stars","reviewDescription":"didn't fit right","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1506470400000}
{"reviewTitle":"wrong size","reviewDescription":"advertised to fit up to 50'' TV and would not work with my 40\" TV","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1461196800000}
{"reviewTitle":"Missing assembly gear","reviewDescription":"Advertised that it could be mounted on concrete, whoever in the directions it requires a concrete wall anchor but doesn’t include them. There are tons of different size anchors so it is impossible to buy one on its own without knowing if it is going to work","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1567814400000}
{"reviewTitle":"Bracket is not adjustable...","reviewDescription":"I purchased this for our 50 inch tv. After hiring a licensed carpenter to install he discovered that the bracket does not expand to allow the bracket to be attached to the back of our tv.  The bracket was short by 6 inches. Very confused and disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1563840000000}
{"reviewTitle":"Very disappointed!!","reviewDescription":"This was supposed to be a NEW item. We received it with the package opened. We're missing bolts to attach the brackets on the back of TV, 1 bolt that holds the brackets secure on the mount, HDMI cord, 3 Velcro toes, bubble level, triangle bubble level, lagbolts, and anchors. Very disappointed!!! Had to go to lowes to get what we needed to get the TV mounted today!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1482019200000}
{"reviewTitle":"Tv fell from wall","reviewDescription":"The mount did not hold my 55 inch tv.  Tv fell and busted.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660176000000}
{"reviewTitle":"Doesn’t make it on the 2x4s distance to short","reviewDescription":"Omg didn’t even reach the 2x4s so I couldn’t mount it or my tv but it came well packaged with everything included but it’s too short for the 2x4s on the wall so dangerous to mount","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1595289600000}
{"reviewTitle":"Missing parts!","reviewDescription":"Parts and hardware just stuffed in a bag, yet missing brackets to attach to tv and mount. Very disappointed. Sad thing is that the box even said it was inspected and repackaged. Nice FAIL on that inspection, folks.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1540425600000}
{"reviewTitle":"Greedy customer service","reviewDescription":"Not worth the price!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"We did send it back and so far they have been good to work with us on that","reviewDescription":"I read the info on this and the reviews and it said it would work for the studs but when we got it and my husband went to put it up it would not work for the studs.We did send it back and so far they have been good to work with us on that.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1508112000000}
{"reviewTitle":"AWFUL","reviewDescription":"These are terrible. They are not easy to install, and the space you're supposed to screw them into the wall deteriorates waaaay too quickly. Don't waste your money on these, they aren't worth it!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1582070400000}
{"reviewTitle":"Product will not fit “most” tv’s","reviewDescription":"Product did not fit my tv even though the tv was in the correct size measurements and the correct weight, description says fits “most” tvs and after measuring my tv I assumed it would fit but this was not the case.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1539388800000}
{"reviewTitle":"Installation","reviewDescription":"Easy installation!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Good construction","reviewDescription":"I hired a handyman to install and he was happy with the install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Stable and Easily Moveable","reviewDescription":"I’ve had it for about two weeks and it is great! It’s easy to move around and it’s sturdy. We put it up on our brick fireplace and it looks great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Perfect!","reviewDescription":"Works perfectly and my tv fit perfectly. Easy to install!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Mounts & moves just as well as the expensive ones","reviewDescription":"Got this for a 50 inch tv and it mounts and moves just as well as the ones at Best Buy that are over $100. We actually bought a second one for another tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Great mount! Everything included!","reviewDescription":"I purchased this mount to go with my 65” TV in our master bedroom. This mount allows the TV to be visible from anywhere in the room by allowing it to swivel off the wall. Install on drywall is really easy as long as you know how to locate your wall studs. Tools I would recommend having for install- cordless drill, stud finder (if your install will be on drywall), tape measure (if you want the TV to be perfectly center of wall). All hardware included!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Easy install","reviewDescription":"Easy install and had no problems mounting tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"simple mount 1\/2 the price of best buy","reviewDescription":"Simple mount, heavy duty. Works as it should and half the cost of best buy in store","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Installation","reviewDescription":"Set up directions could’ve been a bit easier but overall, this is an excellent TV mount","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Easy install","reviewDescription":"Easy to mount","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Mounting nightmare","reviewDescription":"This thing is not meant for normal 16\" separation between studs. The product isn't wide enough for the holes to catch the center of the studs. After reading more into the literature they provide, i saw 2 of their recommended solutions are: 1) return the product, which i did.  And 2) buy their extension available on amazon haha. Total waste. Oh or you can screw 2x4s that you have to also purchase into your wall before hanging this mount. Tried calling their customer service number and got a strange message that is definitely not professional sounding. Do yourself a favor and dream up a different mount from a reliable company.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1538784000000}
{"reviewTitle":"No le tengo mucha confianza","reviewDescription":"Lo instale y lo encuentro muy débil. No confío mucho en este producto.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Does not feel stable at all.","reviewDescription":"I feel like this is not stable at all for my 85\" tv. Very difficult to get level and stay level.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"This product came defective","reviewDescription":"Opened the box and the tv bracket was visibly not level.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"Arrived Damaged","reviewDescription":"The product was easy to install until I removed the full mount from the box. The bracket that attaches to the wall was bent toward the wall side so was unusable. I will be requesting a refund or replacement. The box was undamaged which means the product was damaged at production and passed through quality control.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Mounting Dream has not gotten back to me on the missing items and support bracket.","reviewDescription":"Brackets are too short for my wall studs. They added instructions on how to request for a support bracket if studs are longer\/shorter through their website. I've sent out 2 emails and I have not heard back from them. It has been 2 weeks. Wouldn't recommend them.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1682899200000}
{"reviewTitle":"Less of a dream, more of a nightmare.","reviewDescription":"The base plate of this item is not large enough to be mounted on a wall securely with a standard 16\" space between the wall studs, which is a major inconvenience and requires extensive reconfiguring with additional lumber and hardware. Also none of the screws provided for the attachment arms that were designated for the back of the TV itself were the right measurement for my Insignia 46\" LED TV. (The ones already there would have worked but that's not the point--if you provide 5 sets of screws for this purpose with your product, one should fit.)This is not a plug and play solution: I will likely be returning  two of these units I was so happy to have gotten for such a reasonable price.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1437955200000}
{"reviewTitle":"I didn't get it!!!","reviewDescription":"I'm sure it's nice but again I didn't get it!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Cheap materials - you get what you pay for","reviewDescription":"Received the product promptly. Good instructions and template. Once installed on the wall I went to adjust the tilt and angle assembly. That's when things went badly. The adjust screws were over tightened from the factory. The Allen screws were so cheap, they stripped the heads immediately. That was using my quality wrench, not the cheap toy shipped with the mount.  Overall four screws stripped out!  A royal pain to get them out and then replaced with better screws. Added about 2 hours of time and headache. Don't buy this product!","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1489104000000}
{"reviewTitle":"You have to buy extensions","reviewDescription":"It tells you right in the directions you have to buy 24” extensions which are another $40.00. Look for another product that has what you need and not try and get you to buy more items add on prices!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Doesn't work with 16 inch stud spacing!","reviewDescription":"Mount arrived and I started installing it. The studs in my wall were slightly more than 16 inches apart. Ok, not the sellers fault. But then I measured the distance between where the screws would be at the farthest possible points on the mount and it is LESS than 16 inches! The whole mount is only slightly over 16 inches. So this would only work if your studs are less than 16 inches apart. You could probably get this to work if you placed the screws on the very edges of the studs (which would be risky).So I come on here to look at the extension rails - $36 dollars! I only paid $44 for the mountIt's almost like they intentionally designed it this way - very frustrating!","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1590364800000}
{"reviewTitle":"Not Impressed","reviewDescription":"I was not happy with this TV mount. The first issue was that they didn’t include the mini leveler that they advertise. As a result, the paper pad to help align and drill the holes became useless. Also in the instructions it says to use a 5\/32 drill bit, but on their installation videos it calls for 7\/32 so figure it out which is the correct one. Also this mount is rated for studs 16 inches apart, but the two end holes are not actually 16 inches in distance and that is just poor manufacturing. If you plan on using this mount temporarily then it should be fine, but I wouldn’t use it as a long term solution to hang a TV.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1608681600000}
{"reviewTitle":"Screws are profoundly cheap and strip absurdly easily","reviewDescription":"Absolutely TERRIBLE product. The screws that are supposed to mount into the wall STRIP like no tomorrow. It doesn't take much at all to strip them rendering them completely useless. You can try any screwdriver you want, whether it's a manual hand screwdriver or a drill screwdriver. You'll render the screw incapable of either finishing screwing in or make it impossible to unscrew it if you move or need to put your TV somewhere else. I have never in my entire life seen screws this cheap and almost clay-like, and I've been building things for over two decades. It's nearly impossible to think that a manufacturer could get something like screws completely wrong.Avoid this product. There are far better TV mounts out there.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1572739200000}
{"reviewTitle":"Doesn’t work for my 55 in tv","reviewDescription":"This doesn’t work for my 55 inch television. The brace doesn’t reach the wooden studs on the wall and the instructions say it must be mounted to a stud. Or a concrete wall. I waited to long to have someone come out to mount it so now I can’t return it, I’m pass the return deadline.  Per the instructions it says an attachment piece can be purchased. It’s very misleading because if I purchase a mount for a 55 in tv, it should be able to mount a 55 inch tv, or it should mention that additional pieces will be required to purchase for installation.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1627344000000}
{"reviewTitle":"Doesn’t come with wall anchors.","reviewDescription":"It doesn’t include the required wall anchors. Those you have to buy separately but there’s no warning of that until you open it up. They are irregular as well, so hardware stores don’t carry them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Very poorly designed","reviewDescription":"Spacing of mounting holes is less than 16 inches on center which doesn't allow for safe installation. Also not adjustable to allow for proper tv placement, brand makes brackets sold separately that cost the same as the wall mount. Does not move freely. Returned and bought a name brand wall mount that is far superior in every way imaginable.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"hard to assemble, required special tools","reviewDescription":"hate that this requires an allen wrench. instructions are very unclear and vague","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Great Mount for Samsung 55\"","reviewDescription":"Got it installed by myself in less then 20 minutes. Directions were very easy to follow. It has been up for a few hours and has not fallen yet. Great purchase.That was my original post from the first one I purchased. Which was great went up no problem. However the second one I purchased is shorter then the first, & does not fit my 16 inch wall studs. 3\/4 of an inch too short. It's working great because we put one side od the mount into the stud and used 4 additional heavy duty wall anchors with screws and washers (3 total screws on top, & 3 on bottom). If it wasn't so sturdy with only using 1 stud I would have sent it back for being too short.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1505692800000}
{"reviewTitle":"Is not compatible with 16\" joist spacing","reviewDescription":"This product says it is compatible with 16: joist spacing; however, the mounting holes limit you to total separation of 16 1\/4\"... precluding the mounts from being attached to the joists. This is either an absurd design flaw OR a total misrepresentation by Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Oh that 45° swivel makes the diff","reviewDescription":"Ease of install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Amazing","reviewDescription":"Holding up my 48-55 inch I believe really good easy to use really does move around at all angles","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Fast shipping great quality.","reviewDescription":"I was able to install this TV wall mount with ease. It came with a template and tons bolts and spacers and a level. I totally recommend this product! Very Sturdy and the best maneuverability. Perfect fit and size. Nice and level","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"My third one of these.","reviewDescription":"You can't beat this for the price and ease of install, worked great on a newer OLED LG and also on an Older heavier LED Samsung. Gives me all the positions I need and was able to attach the screen on my own without any help.Great design!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Solid mount","reviewDescription":"Easy installation sturdy.  Would definitely recommend and it was a good price too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"TV wall bracket","reviewDescription":"Easy installation and perfect for our needs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Good","reviewDescription":"Moved into a new house with a weird setup so our tv needed to be mounted in the corner. This tv mount fits great and is very sturdy. I love that we can adjust the tv to our liking. Easy to move around without problem.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"A very strong designed hardware","reviewDescription":"Got this one for my retired friend. its easy to mount on a wall, but guys be sure it is mounted into the stud behind the drywall . If you do not have the construction knowledge at all then don't do this type of work , ask someone have the construction knowledge or experience to help. overall the hardware is excellent . It worth every dime .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Very Pleased with Purchase","reviewDescription":"Very simple to install, 5\/32 drill bit, drill, 1\/2\" socket, philips screwdriver. Comes with a little level which turned out to be as accurate as my 18\" level.  Very solid installation.  Make sure your studs are 16\" centered.  Installed in bedroom and mounted bottom screws 66\" from floor for a 43\" TV.  Most advise 56\" for 43\" TV but with tilt capabilities works great!  Pleased with purchase and would buy again but judging from how sturdy it is I won't need to worry about that.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Make sure you know if your studs are 16 or 24","reviewDescription":"So, I've bought two of these. The first one mounted easily in my living room and I had no problems. The second one also mounted easily - after I found out that the studs in my bedroom are 24 inches apart. I had to buy the extenders but the product is top notch and highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Heavy Duty but…","reviewDescription":"The product is very sturdy and adjustable as described. Be cautious if you have existing power or cables in the wall which you will mount the product over. Likely, they are attached to one or both of the studs you will need to tie into. Also my studs were 16 1\/2” apart and the maximum this product can span is 16”. I needed to purchase the accessory MD5232 to make it work. This increased the price by 50%. Installation difficulty was an 8 out of 10 for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Never received product","reviewDescription":"Can’t review. Liked the description and it was a good value.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"ZERO wiggle room for 16\" studs, poor bolt location for mounting","reviewDescription":"Once it's on the wall, this is a pretty nice TV mount.  It holds my 55\" Vizio just fine and the range is good so I can access the cords and things behind\/under the TV more easily.  But, getting it on the wall is a BEAR (at least alone, but that's never stopped me before).First, if you have 16\" studs, you have to get this thing dead center because there is barely 16\" between the leftmost edge of the furthest left mounting hole and the rightmost edge of the furthest right mounting hole.  I don't know why they wouldn't extend the frame just another half inch so you can be sure to be centered on the studs.  The same goes if your TV mounting bolts are 400mm wide, you'll have about a half inch of play on either side of the mounting bracket to get the TV locked in.  I had to have a neighbor come help me because I couldn't hold the TV and see behind it at the same time to get it just right.  I successfully mounted another 55\" TV on a non-full-motion Mounting Dream mount (ASIN B00NKZ5R28) and there was a ton of room for adjustment.Second, good luck using any kind of socket wrench to screw in the lag bolts.  The geniuses put the mounting holes so close to the rest of the frame that I couldn't even get the tip of a normal wrench around it and had to do half turns at a time.  It looks like there's a lot more room in the pictures.  It took me about 5x longer just to screw in the lag bolts for this one than the entire mounting process for the other kind.  That one has the mounting holes inside the frame, so it was easy to use a ratcheting socket and power them right in.Third, which I probably should have realized from the pictures, I'm HIGHLY disappointed that this mount requires unscrewing and screwing in small screws to release and secure the TV, instead of the super-quick and handy pull straps on the first mount I bought.  Mounting Dream, why isn't that standard on all your products???In retrospect, I'll probably be buying a different brand if I ever need another full-motion mount.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1657497600000}
{"reviewTitle":"Barely fit","reviewDescription":"The mounting plate for the wall barley fit the 16' on center studs and the 65\" TV just fit on the mounting with no room to spare.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Don’t buy for a 65”","reviewDescription":"Bought it for a 65”, but it’s doesnt swivel or maneuver all the way.. restricts movement","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"I'd give this 5 stars, had it leveled my TV properly.","reviewDescription":"OK, so I'd give this 5 stars, had it leveled my TV properly.Pros:*  This thing is Rock Solid!*  Install is very clear, and easy - once you find the studs.*  They give you a template, so you can mark your drill holes with paper, instead of a heavy mounting bracket.*  All the stuff you need is included - and several options for different TVs is in there, as well.*  It allows for adjustments to the TV from side to side, once mounted (though it affects the distance from the wall)*  It allows for adjustments to the TV tilt angle, so you can aim it towards the floor more, if you mount it high.*  It allows easy access to the back of the TV, once mounted, & easily turns the TV direction left or right.*  It accommodates a number of TV sizes and weights, so it's likely to fit yours.Cons:*  This mount MUST be set into studs on BOTH sides (Just it's own weight would pull it off the wall, otherwise - never mind the added TV weight)*  Adjustments to the TV from side to side, once mounted - affects the distance from the wall - big time. My studs are not centered to the center of the wall, so I was offset by about 8\", once mounted. I slid my TV as far towards the center as it could go on their wide mounting bracket, but still had to push the mounting arms to the left by several inches. That forces the TV out from the wall by several inches to get it centered.*  The TV is secured by screws on the bottom, which is good, but there's very little clearance for them, and we nearly stripped one, trying to get it screwed in properly.*  There's no leveling option for the TV mount, once installed. I did mine PERFECTLY, and it is dead level on the wall mount. Unfortunately, once the TV was mounted, it sat crooked - which means the mount arms were not level, even though the mount was level at the wall. THAT is unfortunate, because there's no way in hell to fudge the mount against the wall. You have to bore out huge holes into the studs, just to hold it on the wall, so adjusting it a quarter inch isn't going to happen, and there's no way to know if the arms are level to the mount, until it's too late to fix it.I ended up shimming the top part of the TV bracket, to hold it up higher than it should be. It's not perfect, because I didn't have the perfect metal shim sitting around the house (I stacked 3), so I'm still a tiny bit off level, but it's barely noticeable.For my install, I'm putting it into a bookcase surround, that extends beyond the wall by 11 inches, so the fact that my TV protrudes 8 inches from the wall is not a big deal. I also really like the fact that I can turn the TV to the right or left, and pull it out from the wall to gain access to the back of it.If that protruding thing is an issue for you, then you might want to be sure your studs are centered to where you want to mount the TV. (ie, 8\" on either side of where you want the center of the TV to end up, gets you the least protrusion).Overall, I'm very happy with this mount, but the fact that they thought of everything but leveling the actual TV is kinda nutty. It presumes perfection on their manufacturing & assembly, the TV's manufacturing & screw placement, and the homeowner's installation skills. That's a lot of perfection to count on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1511049600000}
{"reviewTitle":"the definition of Mounting Dream, deceptive wording?","reviewDescription":"#1 if you don't have a stud finder, you'll spend about $30. 00#2 I already have 3 different size levels better than the ones they provide#3 Measure not once but twice. Better make that a dozen times if not more. Finding the stud(s) is the most time consuming priority depending on how much pressure you put on the stud sensor, to little or to hard the reading is not always the same. you will be marking your wall with a pen or pencil. HINT HAVE MATCHING PAINT#4 the template they provide sticks to the wall, it will take some of the paint of your wall when you remove it#5 I took my level to the exact points for for the holes on the printed template, they did not line up 100% this depends on if the template was printed perfectly on a printing press.#6 Drill 1 hole only with the template still attached to the wall. mount the bracket to the wall with the lag bolt#7 line up bracket to the other hole AND use a level on the bracket to see if it is perfectly horizontal, this is where the second printed hole may not line up. Use your level and mark the spot, then drill your hole and screw in the lag bolt.Mark off your other 2 holes to be drilled. Remove the 2 lag bolts and bracket and template. You can drill out your other 2 holes before or after you remove the bracket and template.#8 I painted my wall to cover all the pen marks I put on my wall#9 the 2 vertical brackets that get attached to the TV  can be done in the beginning before you look for the studs or after you have painted  if you do the latter the paint has time to dry#10 installing the bracket is not as easy as it looks on the picture the spacers Mounting Dream provides (3 different sizes) all useless for me. Goog thing Samsung provides their own spacers in the box with the purchase of my TV.#11 Defining the definition of the words Mounting Dream is up to you. Now mounting the TV to the wall bracket is the only dream. you still have to attach everything to the TV that you want.#12 Now you put your tools away, vacuum all the dust, wipe stuff up, wash your paint brush.So anywhere between 4-6 hours of work depending on your coffee breaks .Definitely not a dream but reality.OVERALL the bracket is solid, works the way it's  supposed to and cheaper than the more pricier ones. I'm satisfied.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1578268800000}
{"reviewTitle":"To small for 65”","reviewDescription":"Was barely wide enough to mount on 16” center studs then when you mount tv there is no room to center the opening needed to make frame another 6” wide would work good on smaller tv not 65”","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Barely 16” wide","reviewDescription":"Make sure your studs are centered 16” apart and the holes are centered on the studs. I have five wall mounted flat panels up to 75” - one outside. Put them all in, no problem until this time. No reason the wall mounting bracket can’t be 18” or even 20”. Shop around.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"Zero adjustability\/offset for 16\" stud spacing. No reply from customer service","reviewDescription":"This is certainly solid and offers a range of motion advertised. The problem for me is the  studs behind the console this needs to be centered on put the TV WAY OFF CENTER. There's a stud right in the middle of the piece of furniture, and the mounting bracket holes are exactly 16\" apart, so the TV ends up being half a stud spacing off-center, a whole 8\". This might not sound bad, but you wouldn't want this. Picture it with any of your existing TVs, and you;'ll realize it's unacceptable. I messaged customer service and didn't hear back, so I bought a similar mount locally. NOTE TO AVOID THIS THE MOUNT NEEDS TO BE COMPATIBLE WITH 24\" STUD SPACING - THAT WILL GIVE YOU THE NEEDED ADJUSTMENT\/OFFSET.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Sturdy TV holder.","reviewDescription":"Placed in our patio setting it up on brick. Holds wonderfully.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great mount at a great price","reviewDescription":"Instructions were very clear and logical.  Mounting was quite easy.  This was an inexpensive mount and not as heavy as some, but it easily supports a 50-pound 65\" TV.  (It is rated for 99 pounds.)  Some mounts come with small levels or built-in levels.  This one doesn't have a level, but with the $20 or $30 you'll save, you can buy quite a few levels.  Very highly recommended!  No need to pay a penny more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"65 inch TV","reviewDescription":"Worked fine !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Tv mount","reviewDescription":"Perfect just right","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"FEAR CONQUERED","reviewDescription":"I bought this mounting system about a year ago.  It has sat in a box in the corner collecting dust.  I finally conquered my fear, and said I could do this by myself.  The mount was very easy to install.  As a 60 year old woman, it took a little bit of extra elbow grease to get the lag bolt into the studs.  One drill hole were made, I held the mount on the wall, hand thread the bolts and then started ratcheting each one in a bit at a time rechecking that the mount remained level and tightened them all down.  The hardest part was getting the stud finder I purchased from a big box store out of the packaging it came in and the cover off to insert batteries.All parts\/bags are labeled.  All necessary parts you may need are in the packaging.  Instructions are clear and easy to ready.  I would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1714176000000}
{"reviewTitle":"excelente","reviewDescription":"muy resistente muy buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Easy Install","reviewDescription":"Good Product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Easy to install","reviewDescription":"Easy to install. Comes with a template for the wall so you know exactly where to put the hardware. I like that you can pull the TV out and turn it side to side.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Easy to install and relatively inexpensive","reviewDescription":"It was very easy to install. I appreciate the levels that comes with it. The hinges work really well. I'm very happy with purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Easy install…works well","reviewDescription":"Might be overkill for a 42” tv but it’s in a sewing\/crafting room (12x16) and needs to be visible from multiple workstations and has to be on a wall to keep other surfaces clear. I have 16” studs so perfect for easy install but also includes solution ideas for non-standard or 24” centered studs. Adjustable to level for tweaking horizontal alignment, also can adjust tilt. Love that it can be articulated right or left. Perfect for me!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"the worst screws possible","reviewDescription":"the mount seems to be ok. but BEWARE the screws that go into the studs are not good quality by any stretch of the imagination. make sure to go to a home depot and get some for less than 3-4 dollars. TERRIBLE and NOT EASY to install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1573430400000}
{"reviewTitle":"Great product, except for the hardware","reviewDescription":"The product works great, the only minor problem is the hardware that was included. The plastic washers and screws were really cheap. Otherwise, the product works as planned. My only suggested would be to take the included hardware to home depot and buy higher quality screws and washers.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1553385600000}
{"reviewTitle":"Good product, limited screws and washers","reviewDescription":"I didn’t feel like sending this back, but to those who are considering to purchase make sure your TV is compatible with the mount or you will be sending it back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618876800000}
{"reviewTitle":"Good product, but was missing parts.","reviewDescription":"It lost some stars because it was missing one of the spacers I needed. Fortunately I bought 2, and the 2nd TV used a different size spacer. Check the parts before you start the install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609545600000}
{"reviewTitle":"Installed this weekend","reviewDescription":"Warning on this one - I installed a 32\" tv on this over the weekend - the vertical back braces BARELY were covered by the tv frame.  So yes, you could install a smaller tv if you are ok with those brackets sticking out.  It is heavy duty and sturdy but again meant for larger tvs probably.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1508716800000}
{"reviewTitle":"Double check marks when leveling!","reviewDescription":"The tiny level that is used on the cardboard template for the mount was very innacurate. Make sure you use a reliable level and double check markings before putting holes in the wall.Great product otherwise!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1595203200000}
{"reviewTitle":"Great But Defective","reviewDescription":"Love this overall, but one of the corners were bent out of shape. Not the end of the world, but I can’t imagine how it got bent","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607212800000}
{"reviewTitle":"Wish it would tilt, but good","reviewDescription":"Definitely a good product, but it did not live up to the hype. I have heard many good things about Mounting dream, but i was not too satisfied with the product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611014400000}
{"reviewTitle":"measure your wood studs before purchasing","reviewDescription":"This product seemed great. Sturdy and versatile. Had to return this product because my wood studs were not 16\". I recommend using wood stood finder and knowing the distance in your home before making a purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576540800000}
{"reviewTitle":"Good and level, when you don't have the TV panned or tilted.","reviewDescription":"It was easy to install, assuming you have the tools. Feels secure (TV hasn't fallen yet). However doesn't maintain levelness when extended.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622505600000}
{"reviewTitle":"A little difficult to put up","reviewDescription":"The sturdiness of it is great. It is difficult to put up on your own. And making sure you anchor it properly does make massive holes in the walls, so I will be paying for that decision later.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"TV mount","reviewDescription":"Rugged. I believe the wall would come down first.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"TV Mount","reviewDescription":"Super item for an outdoor setting. easily install and move to suit any sitting area and avoid any glare that may be present.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Excellent","reviewDescription":"Easy installation and very strong to carry my TV without any issue. Thank you guys !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Hung my 60” samsung just fine","reviewDescription":"Comes with everything you need and then some. Easy to use and install.This one is in my living room and maneuvers toward the dining room\/kitchen when is great. It’s easy to move and fit perfectly on my tv. It does creat some space between the wall and your tv which is to be expected so it wasn’t a big deal for me.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"works great","reviewDescription":"this worked great on my 55\" tv. it has easy rotational adjustment screws so that if you TV isn't exactly level after mounting (or because of the angle you put your tv) you can give you tv that last little nudge to make it just right.The only thing I didn't necessarily like is that the wall mounting holes have a max width of just over 16\" which means you have little choice but to install it directly between two studs (US standard wall stud distance). It would have been nice if there were a few extra inches to give some flexibility. But in my case, I didn't need that flexibility in my room... so this comment is mostly for others to consider.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Easy install","reviewDescription":"Very easy to install. Just got to make sure you are hitting the middle of your studs. With this install I only used the two middle holes of the bracket for my studs. The placement of my studs just didn’t work out in my favor for installation. The didnt line up to the tv mount holes. However, having two bolts in the studs for a 65” will still hold plenty of weight. Highly recommended product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Durability\/ install","reviewDescription":"Extremely sturdy and easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Did the job!","reviewDescription":"Worked as described","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Tv wall mount","reviewDescription":"Fast shipping, and great product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"It has worked out good so far to secure my TV on the wall ...","reviewDescription":"It has worked out good so far to secure my TV on the wall but I was not entirely satisfied with it.  I think I would go with something a bit stronger if I was to have the need to purchase another.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1513036800000}
{"reviewTitle":"Didn’t come with a template for the mount","reviewDescription":"It works but it is wobbly","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1640908800000}
{"reviewTitle":"Nothing a dremel can't fix but would have been nice if the mounting locations on the uprights had more ...","reviewDescription":"mounted a 32 tv and the top parts stick up above the tv.  Nothing a dremel can't fix but would have been nice if the mounting locations on the uprights had more holes on the bottom portion.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1528243200000}
{"reviewTitle":"Works, is sturdy.. but not as secure as i would like for trusting expensive television on","reviewDescription":"It was a little tedious to put up and the railing as no catch to it, so once use set the tv up, should anything bump it or there were to be vibrations, such as a tremor, or slam against the wall, the tv is likely to go off track.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1502928000000}
{"reviewTitle":"Limited to range of tilt \/ angle","reviewDescription":"Would have liked it better if it had a better range of motion","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1598227200000}
{"reviewTitle":"Product is good. Missing items in the package that it said ...","reviewDescription":"Product is good. Missing items in the package that it said was included. Luckily I own my own level and worked around not needing the template but to those not inclined with tools wouldn't have been able to install.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1513987200000}
{"reviewTitle":"Motion","reviewDescription":"The Mount seems well made and durable. The only problem so far is that it's hard to move back and forward to and from the wall it's very stiff.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1546473600000}
{"reviewTitle":"I wouldn't recommend it.","reviewDescription":"Wall mount is plenty strong for the 46\" TV however it didn't contain enough brackets to mount the Samsung TV  I have. I needed to buy slotted steel & fabricated the required pieces. If you don't have basic skill to modify if needed. I wouldn't recommend it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1481846400000}
{"reviewTitle":"Could be slimmer.","reviewDescription":"Tgis performs well but I would next time opt for one that has a slimmer profile that can sit closer to the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1562025600000}
{"reviewTitle":"Installation was very easy. Item seems to be constructed very well","reviewDescription":"Installation was very easy. Item seems to be constructed very well. However, although the description says that it will mount TVs from 26-55\", when I mounted my 32\", the two vertical bars stick up and are visible above the top of the set.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1491004800000}
{"reviewTitle":"It tends to tilt downward when I reposition","reviewDescription":"Sometimes it tilts downward when I turn it slightly. Too heavy for me to push back up. So we just tighten it more when this starts to happen. But I can’t manage it on my own. So it’s tilted down until I can get help.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"TV Wall Mount","reviewDescription":"Put a 55 inch ten year old flat screen tv which is heavier than new models and seems a little flimsy and thinner steel than older bracket. Would not recommend for anything larger that 43 inch.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Missing 4 Washers!!!!","reviewDescription":"So let me preface this with:A) I have technical know howB) thankfully I live right behind a hardware storeC) Washers are cheap, cost me a $1.10 for 4 of them.WHICH I SHOULDN'T HAVE HAD TO PURCHASE!!!!This is a 3 star review because if you are supplying a Mounting KIT, it SHOULD include all the hardware you need. Instead of having to go back out to a store and paying for ADDITIONAL HARDWARE to complete the job. While $1.10 isn't a lot I quite frankly feel like I shouldn't have had to do that when I purchased a kit.Now as you can see by the photo of the step 1 they include plenty of screws to find the correct fit for your tv; M4, M6, & M8. As you can also see in the photo they ONLY include washers for the M4 & M6 tv screws. Meaning if your tv takes the M8 screw then you are going to need to go to the hardware store to buy washers that fit. Because the ONLY M8 washers included are the 4 for the bolts to install the mount on the wall. So take one of those with you to make sure you get the right washers.Other than the fact that the Kit should INCLUDE ALL THE HARDWARE in it, everything else is working perfectly. Once we had ALL THE PARTS WE NEEDED it went up fast and easily. The instructions are easy to read and follow, so no issues there.I am looking forward to using the wall mount, but as someone who was frustrated by this I wanted to make sure others wouldn't have the same issue. Which could be FIXED if Dream Mount would INCLUDE 4 M8 washers in the bracket installation hardware.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1571616000000}
{"reviewTitle":"Very heavy","reviewDescription":"As technology advances TV’s are lighter. This mount is too heavy. I wish it was made of aluminum.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Missing Pieces and Wrong Mounting Template!!!","reviewDescription":"Let me start by saying this is the second mount of this type that I have purchased. The first one is amazing! This is why I opted to purchase a second mount for my office. The mount itself is great, and I'm not disappointed that I went with it again. I am disappointed about the missing components from the box and the template that was the wrong size (too large).1. I was missing the levels used on the template, and the tv, to make sure this level was on the wall. Not a big deal because I have plenty of them, but it made the first install quicker than this one.2. The Template! This one angered me since I have to backfill holes and paint now. The template used to mark where to drill was too large. When placing the mount on the template, it appears this was a template made for larger tv's! I mean, come on!!!!!These are easily overcome problems, but when I spend the money on something, I expect it to be correct. Would I purchase this model again... questionable at best.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1611100800000}
{"reviewTitle":"Did not meet  our needs","reviewDescription":"Did not fit mt instlation","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Poor tilt design feature.","reviewDescription":"The product is sturdy, strong etc. After installing and mounting my 60” led tv, I noticed the tv needs to be tilted slightly down for better viewing. To do this the tv needs to be pulled away, then loosen tilt fasteners with provided alan wrench, tilt to desired location then quickly tightened back up. This makes it a two or three person job in a tight area behind the tv. Thinking about replacing this mount😳","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Fine mount bad HDMI cable.","reviewDescription":"The mount is fine and it does fit the specs that it states. However the over all rating i am giving this is based on other mounts i have owned. This feels less refined than others. It gets the job done and its strong enough. But for a similar price you can get some thing much more substantial and robust. The included HDMI cable was a selling point for me for convenience.  The cable was a complete bust it is broken, the image shows up with red patches and lines through out the picture. The mount will hold your tv and it functions as expected so i gave it 3 stars for the build quality. If I would have known about the HDMI cable and the overall quality of the mount being on the lower end  i would have purchased something else. It works but i would recommend a different mount for a similar price. I assumed with the price the quality would have been closer to what i have purchased in the past.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584316800000}
{"reviewTitle":"The only thing bad is the bolts, they strip immediately.","reviewDescription":"I only give this 3 stars because of the screws.-Instructions are good enough for a 12 year old. Which is great.-It’s sturdy and heavy metal.-it comes with lots of different sizes of screws and spacers. It also has a great balance and large traces out line for marking your wall.- 3 stars because the bolts given to screw into the wall are horrible. Look at the pictures. I drilled a hole with the correct size drill bit then proceeded to drill in the bolts. They immediatley stripped and weren’t usueful. I went through all four with the same result. One bolt I still cannot get out of the wall. I eventually had to use the concrete screws they provide you with, just in case you’re hanging the TV on a block wall.I’m a handyman by trade so I have all the tools necessary to properly screw in a bolt. I use the correct settings and speeds on all of my equipment. These bolts are made of some garbage metal.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1513987200000}
{"reviewTitle":"I found that these screws that hold the bracket in place are not designed very well or have notches allow for a better set way o","reviewDescription":"I've owned this mount for about 4 months now and I continue to have to adjust the TV from tilting downward where my TV tilts all the way forward.  I continue to have to unscrew the tilting screws and re-set the TV the way I want it and then tighten it back up for it to only tilt forward again after a few weeks.  I found that these screws that hold the bracket in place are not designed very well or have notches allow for a better set way of keeping a TV titled in the correct position for long.  I will probably end up modifying this part of the bracket so this won't be an issue anymore, it would be nice if this bracket was engineered better in terms of how you set the tilt settings of the TV.","isVerified":true,"ratingScore":3,"reviewReaction":"78 people found this helpful","country":"United States","date":1486166400000}
{"reviewTitle":"Great mount but not adjustable for stud spacing","reviewDescription":"This is a good mount with good features like tilt, rotate and swivel but it's not adjustable for stud spacing. Check that your studs are 16\" on center and located where you want them. If not you'll need the optional stud bracket which makes this a more expensive product.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1465344000000}
{"reviewTitle":"Check the weight of your tv.","reviewDescription":"The weight max for this wall mount is 99 lbs. I would just keep that in mind. I bought this for mounting an older Samsung in my basement which is 95 lbs. The bolts that hold the angle adjustment slip at that weight.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1486512000000}
{"reviewTitle":"Product is ready to install and good. The packages I received was apparently opened and ...","reviewDescription":"Product is ready to install and good.  The packages I received was apparently opened and returned as it was missing a necessary screw.  The packaging for the hardware was opened and the screws were loose in the box.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1495324800000}
{"reviewTitle":"Not for my old tv","reviewDescription":"Didnt work for my tv but its seems like it would do the job, strong and heavy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577404800000}
{"reviewTitle":"o","reviewDescription":"NO Concrete anchors and cant get a hold of anyone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1594080000000}
{"reviewTitle":"Wont fit a 50\" Viso,","reviewDescription":"Had to make it work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1602288000000}
{"reviewTitle":"Nice BUT!","reviewDescription":"Nice mount but the tilt is very weak.  I have a cased outside TV and it constantly kept leaning forward, Had to put and additional bolt in the groove to stop it.  Needs a better system.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1494979200000}
{"reviewTitle":"check your bolt width and heighth.","reviewDescription":"didn't fit my 42\" vizio, I went ahead and modified it any ways the horizontal mounting holes need to be 24 inches OR closer or it won't fit. besides that the price was right and the swivel and all works great. definately strong.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1455667200000}
{"reviewTitle":"The mounting bracket was not wide enough to fit how ...","reviewDescription":"The mounting bracket was not wide enough to fit how wide the studs in my wall were.  To make it work it requires a purchase of an additional piece. In the end I went with a different mounting unit altogether.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1484870400000}
{"reviewTitle":"Good but remember to order mounting straps","reviewDescription":"The actual product was good however, in the ordering process it should have said there was not a mounting bracket to support it to the wall. Had to go hunting for straps on installation day. Slowed everything down.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1464393600000}
{"reviewTitle":"Awesome","reviewDescription":"I love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Works Great with My 50\" Samsung","reviewDescription":"This wall mount is working great for my 50\" 2021 Samsung TV. However, because the studs in my garage are 16\" apart, I didn't take the time to check the inches between each stud in the room where I mounted the TV, which is 24\". The one I purchased works best with stud lengths 12 or 16 inches apart (I think a 24\" was available). Instead of returning it for an exchange - and because my TV is very light - I decided to keep it and secure at least two of the mounting bolts into a stud with another four into heavy-duty drywall anchors. It seems secure, but since the mounting apparatus itself is quite heavy, I would advise measuring between studs to make sure that four bolts screw tightly into studs, especially for larger, heavier TVs. The wall mount has a great leveling feature once the TV is mounted so that the TV can be adjusted up to 3 inches. All swivel and tilt features work great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Awesome Tv Mount","reviewDescription":"I have bought this product several times! When I need to mount a tv I choose this one!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Worked perfectly","reviewDescription":"Worked just as I hoped it would. A well made product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Easy!","reviewDescription":"This was better than expected.already together for the most part . I put a 55 inch TV on the wall with no help needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"great!","reviewDescription":"i love this!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Great!","reviewDescription":"Solid with great installation instructions","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Easy installation. Works perfectly. Good control.","reviewDescription":"Easy installation. Works perfectly. Good control and flexibility.Bought 2. One for a 50”, the other 55”.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Best TV mount on amazon","reviewDescription":"This is probably the best type of tv mount you can get just because the mount allows you to move the tv in multiple angles.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"It’s awesome","reviewDescription":"It’s great and strong","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Heavy duty","reviewDescription":"This product says what it does but it's super heavy it's heavier than my 30\" flat screen TV","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628121600000}
{"reviewTitle":"Doesn’t fit Samsung 55inch","reviewDescription":"Seems like good quality but does not fit my Samsung 55 inch. See attached picture.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630540800000}
{"reviewTitle":"Involuntary movements","reviewDescription":"My tv moves out of place on its own... I think the mount is for A Tv that is less than a 50’","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618012800000}
{"reviewTitle":"I strongly suggest checking your studs before you buy this!","reviewDescription":"So I assumed all houses are built with studs that are 16inches apart. Turns out mine is 24 inches apart. Of course I found this out after the return window! I’m going to try and put this up somehow!!? The product looks sturdy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1543104000000}
{"reviewTitle":"As advertised","reviewDescription":"Simple installation, all hardware included, sturdy, good range of motion.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635897600000}
{"reviewTitle":"I really like the design however there is one small flaw","reviewDescription":"I  really like the design however there is one small flaw. If you have studs that are laid out 24\" on center as opposed to 16\" the mounting plate does not accomdate for this. In other words, if your wall framing studs are every 24 inches then you may have to use two of the plastic anchors which do not really hold as well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1463184000000}
{"reviewTitle":"Limited TVs","reviewDescription":"Seems to be limited on the TVs this works on. Had to modify a separate bracket to make it work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618876800000}
{"reviewTitle":"It’s Okey....","reviewDescription":"The leveler is broken when I received, the HDMI cable doesn’t work. The complementary products needs a better quality. However, the TV MOUNT looks strong to hold my 50in tv","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1592179200000}
{"reviewTitle":"Must find the beems behind the wall is a must","reviewDescription":"This is a great bracket but the design is bad. I had to cut away some metal in order to inser the power cable and atena coaxial","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1582156800000}
{"reviewTitle":"Package came incomplete","reviewDescription":"The frame is fine, nothing particularly good or bad. Low rating because the package was missing instruction, mounting template and level tool.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1599955200000}
{"reviewTitle":"Priced to beat Sanus and Snap AV.","reviewDescription":"If you need an articulating arm that will only be pulled out from the wall occasionaly, then this mount is for you.  If you need something that glides effortlessly and smoothly, then you might be dissapointed.  I buy both the expensive and the inexpensive articulating arms depending on what the customer is looking for. The name Mounting Dream is a little grandiose, but if all you need is something that does what it purports to do, then this mount works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Wish it went side ways too. Thank you!","reviewDescription":"Still happy with the  with my equipment. Thank you!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Works great","reviewDescription":"Was real straight forward and easy to install...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Works","reviewDescription":"It’s very heavy but works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Well made","reviewDescription":"Generally I find most of these wall mount assemblies to be a bit to tight so that when one pulls on the TV to adjust it's position a lot of force is required which I am afraid is bed for these newer delicate TV panels","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Good Value","reviewDescription":"Using this with a 45\" Samsung.  Installation was easy enough using a ratchet to secure the unit to the wall.  Do make sure you find the studs.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Works as advertised","reviewDescription":"Mounted tv in bedroom and it works great. Easy to adjust and sturdy when moved. Would buy again. Provided level is very small but functional.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"It works well and is simple.","reviewDescription":"Used this to mount a smaller TV for a side room. Mount works well. This is the second one I have purchased. First one was years ago and came with a level you actually could use. This time it came with a much smaller level and one of the bubbles was never filled or broke. Didn't matter as I used a larger level. I would defiently purchase another if needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Works well but the mounting bracket should be wider","reviewDescription":"I really like this mount except for the caveat that the mount itself should be much wider than it is. It barely stretched between two studs which made it more difficult to mount than it needed to be. Making it wider would also give you a little more flexibility as to positioning. That said, it works well besides that.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"great","reviewDescription":"instructions were very hard to follow.screw in the brackets to the back of the tvuse a stud finder and find the studsdrill 4 holes in the wallput the mount on the wall and drill in the screwshook tv ondone.tv mount good. instructions bad.but if you’ve put up a tv mount before, you’ll be fine. might wanna oil up the hinges","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Great product except the base should be 24\"","reviewDescription":"Base not long enough","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611619200000}
{"reviewTitle":"Not wide enough for my old 50\" plasma. Found ...","reviewDescription":"Not wide enough for my old 50\" plasma. Found this aftwr mounting the bracket to the wall. Will have to make a bracket if I intend to use the mount for this TV.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1500940800000}
{"reviewTitle":"It mostly works. The screws that came with the ...","reviewDescription":"It mostly works.  The screws that came with the mount did not fit my Samsung TV well.  They were too long and the spacers were too big.  I ended up using spacers from another mount bracket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1479945600000}
{"reviewTitle":"So far so good...","reviewDescription":"So far it's holding up- 55 inch LG flat screen TV not impressed with overall quality. The tilt bracket is to thin and worries me. It does hold it level so far (day one). I'll update if it fails.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1478217600000}
{"reviewTitle":"Que no sirve","reviewDescription":"No me gusto que no baja ni sube solo se mueve para los lados","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1562889600000}
{"reviewTitle":"Mounting Dream MD2380 TV Wall Mount Bracket...","reviewDescription":"Very economic product but it does work. I was a little disappointed as it is not as maneuverable as I though it would be. Not a bad deal for a secondary TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1481587200000}
{"reviewTitle":"Difficult to extend tv out makes snaping sound","reviewDescription":"Installed this by myself it was very easy, after 3 months it is becoming difficult pull the TV to extend outward which is the reason for the 3 stars","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1510704000000}
{"reviewTitle":"Easy to assemble","reviewDescription":"Handles the load. Instructions lacking clarity. It’s just fine now it’s up.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1566777600000}
{"reviewTitle":"Nicely made but mounting it on 16 inch centers can ...","reviewDescription":"Nicely made but mounting it on 16 inch centers can be a chore due to the short width of the bracket.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1512950400000}
{"reviewTitle":"So far everything is work fine. Tim","reviewDescription":"The vertical brackets that attach to the TV seem a little thin.So far everything is work fine.Tim","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1518998400000}
{"reviewTitle":"I really like it","reviewDescription":"He just moved into a new apartment and it works well for the space he has","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Easy to use","reviewDescription":"I mounted a 55” tv using this bracket. It was easy to put together and came with a mounting template too. I recommend it everyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"TV wall mount in","reviewDescription":"Perfect...Easy to install...very strong and sturdy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Muy bueno","reviewDescription":"La medida perfecta para nuestro TV. Fácil de instalar, realmente un buen producto ✅️ 👌","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Just right","reviewDescription":"Easy to assemble and great quality. Purchased to hang small tv in guest bedroom","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Works well for large TVs","reviewDescription":"I have used this bracket several times on LG, Roku, and Samsung TVs 55\" and larger. It works very well if you properly mount it to the studs in your wall. It also has a good range of motion.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Easy to install.  All the parts you need for many TVs are included","reviewDescription":"This is the first TV mount I install correctly on the first try. In the past I have ended up with many holes in the wall due to failed attempts.  The paper template made it very easy to position  the mount and drill the holes.  The mount is VERY solid and adjustable.  I highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Very easy install!","reviewDescription":"This TV wall mount was easy to install and the instructions were very clear.  If you've installed wall mounts before, you'll find this one particularly easy to put up.  Plus it's very sturdy!  I would buy this product for furture wall installs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Super sturdy and easy installation","reviewDescription":"I like that it extends from the wall and allows me to hook up my connections easily.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Tv mount","reviewDescription":"This mount holds up very well I put a 75 inch tv and it’s holds just fine with no problems!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Not happy","reviewDescription":"Hate this mounting its not easy and aftet hours of mounting going to hardware store,it doesn’t fit our 42”vizio,really","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1615420800000}
{"reviewTitle":"This product does not tilt","reviewDescription":"This product does not tilt up nor down","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1632873600000}
{"reviewTitle":"Do Not Purchase","reviewDescription":"Piece of junk. The wall mount holes barely give enough room to mount on 16” on center studs. The wall plate needs to be wider to accommodate 16” stud mounts.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1572739200000}
{"reviewTitle":"Call first with the make and model before ordering","reviewDescription":"Disappointed in that I ordered this product only to learn that the mounts won’t work for my tv. The installer believes it’s because  of my older model tv. My tv fits the size requirements","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1558569600000}
{"reviewTitle":"They forgot to send  an important part in the box","reviewDescription":"They forgot to send me a second bracket! So I did all the work to put it up and when I went to add the bracket, it wasn’t in the box.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1563580800000}
{"reviewTitle":"very sturdy","reviewDescription":"I like how sturdy it is, I have no worry's about it. Range of motion is perfect for my needs.  Install was straight forward and easy....","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1578268800000}
{"reviewTitle":"Not worth the cost","reviewDescription":"This product is not worth the money...it does not fit most televisions unless you buy the extension to mount the television to the wall...by the way it's not included and is sold for approximately  $17.00 additional to the cost of the TV Wall Mounts price.  I wouldn't recommend this item.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1480896000000}
{"reviewTitle":"Did not come with anchors","reviewDescription":"No anchors.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1635811200000}
{"reviewTitle":"It was opened and missing all the parts","reviewDescription":"The box was opened and I was missing parts very unsatisfactory no buying it anymore I don’t recommend this product","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1597708800000}
{"reviewTitle":"Save your money, move onto the next mount.","reviewDescription":"Between the mount not fit for a vesa 400x400. The mounting holes on the bracket edge to edge reaching 16\"(have to drill on angle to get true center on stud @ 16\"). This is a 40\" vizio lcd, this mount would not work.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1528675200000}
{"reviewTitle":"This is not a quick and easy install","reviewDescription":"Once you get this mounted, it is a great purchase. Its sturdy and moved easily. HOWEVER I am not a very handy person so when I saw this and its described as an easy install I bought it in hopes someone like me could even do it. After 4 hours and 12 holes in my wall I finally got it put in, but its a huge pain in the ass and I wanted to give up and send it back. The instructions are very confusing as well. I wish they were more clear, but I am glad I pushed through because the quality is great for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1562889600000}
{"reviewTitle":"Did not work for our 55\" TV, stud spacing.","reviewDescription":"We tried for an hour to get this on the wall, but you have to get the spacing just right on the studs in the wall- cue us buying a stud finder that we did not have.  The spacing has to be 16\"...for some reason ours is 18\" so it wont fit.  Unfortunately, we have to send this back and try again.  It could very possibly work fine for someone who has the right specifications, but it was a huge hassle to even get to the point of realizing it would not work for us.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1572825600000}
{"reviewTitle":"It's not bad, just not the best","reviewDescription":"It's a good mount and the side to side is good as far as range goes, but I have to yank pretty hard on the tv to move it from each position because of how stiff\/tight the bolts are in the arms. I feel like they need just a little bit of loosening but I'm not strong enough to adjust it or it isn't possible to do so. Obviously I don't want the tv to go swinging all over, but I get nervous having to pull so hard on the set just to pull it forward a little. Also wish the tilt up and down would tilt downwards a little farther.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1512518400000}
{"reviewTitle":"Downward tilt & Bad HDMI cable","reviewDescription":"The tv mount itself is good heavy duty quality. I wish it had more downward tilt though and also the HDMI cable that came with it did not work. Hooked my directTv box up with it and my tv just kept saying no signal even called directTv and they are the ones who suggested trying a different l cable. Who would have thought a brand new cable would be defective, not me but yea out different one on and it worked great. But anyways the mount it’s self is nice.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1551312000000}
{"reviewTitle":"Solid, but far from flush with the wall","reviewDescription":"It's a good value, and a very strong mount - I have no worries that the tv will fall off the wall. It is also great for being able to move the tv around at different angles. Installation was as easy as could be expected.The problem is when you push this mount back in to the wall, it still sticks out about 5.\" Since my new tv is about half of that, it's kind of frustrating to have the tv look three times as deep as it actually is. If that aesthetic doesn't matter, then this is a great mount at a good value.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1469836800000}
{"reviewTitle":"Decent for the price","reviewDescription":"Does it's job for a good price. It does not lay flat on the wall there is a good bit of space which I was disappointed with but it's not too terrible, I mostly have the TV angled into the corner anyways, but when not in use I would've preferred with have it flat on the wall like the mount my sister has for her larger living room TV. But yea without heat pretty sturdy have it in my son's room.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1589760000000}
{"reviewTitle":"Wall mount screw badly chosen","reviewDescription":"Mount itself is very sturdy. Instructions were clear and came with plenty of parts to support all sizes of TVs.Main gripe with installation is that the screws for the wall mount are Phillips screws and stripped really easily while installing, even with the predrilling as directed. Had to back them out. I haven't been able to pick up some square screws so the TV is just sitting on the floor right now.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1562716800000}
{"reviewTitle":"Very good product, but didn't work on my wall","reviewDescription":"I really wanted to love this wall mount, but depending on where you studs are, this won't work. I couldn't center my TV on the wall with this system. It is a very nice unit and very easy to install. Nicely made and I like that it included a level. The template is great for making sure everything is centered first before drilling and knowing where to drill. Overall, a really great product!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1563753600000}
{"reviewTitle":"Not wide enough for all applications","reviewDescription":"Should be wider so it can span 3 full studs. It only needs to mount to 2 studs, but if you want to center your TV pretty much on a stud, then it doesn't go far enough either left or right to span 2 studs. I had to use a piece of wood so I could get it centered where I wanted it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1592006400000}
{"reviewTitle":"Lacking range of motion","reviewDescription":"I wish this product would tilt a lot smoother. In fact, you have to adjust the screws to be able to tilt it. I saw this as a problem. Other FULL RANGE mounts have the capability to tilt without adjusting the screws. Decent product but the range and movement capabilities is lacking.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617148800000}
