{"reviewTitle":"Super powerful, super sturdy, no annoying lights","reviewDescription":"This is probably the fourth floor fan I've had in as many years. The others have all broken either because either the motor has given out or the plastic legs are so flimsy that they can accidentally be broken by stepping on them or banging into them (I have balance issues so am kind of a klutz).This fan has been amazing. The pedestal base is very hard to break, the fan itself is extremely powerful and puts out a lot of air on the high setting. It can be a little noisy but of course it is, there's no way to make these silent. Best of all is that there are no lights to glow in the dark or anything else other than a fan so I can keep it on all night without it distracting me or waking me up. A+.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723593600000}
{"reviewTitle":"Powerful fan!!!","reviewDescription":"My house is 104 years old, so I don't have AC. I live in New England... I know I have options, but they will cost a lot. It has been averaging 85 degrees in my house and it's also wicked humid. This fan keeps me comfortable at night when I'm sleeping vs being miserable in the heat. I have it on full blast when I sleep and it is pointed right at me.The fan is not quiet at full speed, but what do you expect from a powerful fan that is affordable? The noise doesn't bother me when I'm sleeping, it's like white noise. I'm just happy that I can sleep comfortably. The other settings are actually pretty quiet with effective wind power.I am leaving this review because I came back to buy another one. I highly recommend this fan.","isVerified":true,"ratingScore":5,"reviewReaction":"32 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Works great","reviewDescription":"For the price and simplicity it’s spot on.  Took like 3 mins to assemble, moves air, oscillates, and is adjustable.  Good bang for the buck.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Use it almost daily","reviewDescription":"I use this almost daily in my bedroom.  The lowest of the 3 settings is great for at night.  It moves enough air without being incredibly loud.  It’s definitely not the quietest fan but I don’t mind the white noise at night. The installation process was pretty simple but sometimes the front portion of the fan case will pop off if you bump into it or the dog knocks it over.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Great fan but not without issues","reviewDescription":"I needed to replace my old fan (15 years old, still works, now in the bedroom as my second fan.  Hot flashes.  IYKYK)  and I've owned Lasko fans in the past and never had any issues.Now, I'm a bit particular about my fans.  I have bad allergies, so it must be easily taken apart for cleaning and this one fits the bill.  It must also have great air flow and the 5 blades make for a noticeable difference in my 20ft long living room with cathedral ceilings.  Even on the lowest setting I can see it ruffling the curtains and blinds.  It was easy to put together (my years of experience taking apart my fan to clean it finally came in handy!) and in no more than 8 or 10 minutes, had it up and running.  If only everything was that easy!But remember when I said it was not without issues?  There are a few small issues, but nothing serious.  The stand is supposed to seat itself securely in the base with a strong push and a few clockwise turns.  Unfortunately, my base doesn't appear to have anything to hold the stand securely and while it is steady when still, if it has to be moved, it comes apart.  Not a deal breaker as I really only move it twice a year - out of the closet in the spring, into the closet in the fall - , but  a little annoying; although now that I think about it, it'll be snap to take it apart for storage as winter comes! Look at that, not an issue after all!Last, the noise -  I read a lot of reviews who said the fan was too noisy for them, so here's my observation. In the video, the fan is set to the lowest setting, and while there is a hum, I don't think it's louder than any other fan I have owned but fans are one of the few sounds my ADHD brain can filter out.  So if you're bothered by a mechanical hum, just be warned.  But if you're not bothered by it and you're just looking for a great oscillating fan to push air around your lonely hovel, this is a good buy.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Its a fan by Lasko. They are great.","reviewDescription":"It's a great pedestal fan. The 5 blade design pushes plenty of air. I live on the 2nd floor of a house with no central air up here so a window unit and a big fan is a must. Not as much air pushed as a big box fan but pedestals are more versatile beings they dont have to be put ontop of something. I use mine next to my bed so nice to have without putting a box fan on a box to elevate. Can't go wrong with a Lasko,brand has been around forever. This one is actually replacing a 15 year old metal cage Lasko pedestal the motor finally seized on. Time will tell if this one lasts as long but definitely is an improvement with a 5 blade compared to my old 3 blade. Also super easy to assemble. Didn't even look at the instructions and took 5 minutes maybe max.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Bedtime fan sleepers - this is a yes!","reviewDescription":"If you're like me and actually want a fan to make fan noise- this is the one! The sound is perfect while being high enough on a pedestal to feel the air circulationPerfect! So many fans are \"quiet\" now, which I DON'T want!Quality may be a little chinsy, but it's going to do the job for years to come!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great equipment","reviewDescription":"Just all around best fan I have had ever. With the 3 levels 1 thru 3 once you get to 3 it’s just so powerful. The circulation around the room is amazing covers a lot with a great cool air","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Fan","reviewDescription":"Thank God for my neighbor who put that fan together. It comes totally apart. Mystified me. Was going to return the fan. My neighbor a wonder person saved the day. 🩷🩷❤️has control buttons that are bleck a little hard to see. Still a nice fan. Was affordable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Purchased 10 years ago","reviewDescription":"In the market for a second fan. My current oscallating fan works great. I've had it outside, inside, bedroom, living room. Everywhere I need a cool breeze, I bring it. It works great. I keep mine on the low spred in the living room and medium speed at night in my bedroom and I'm freezing.Having said that which is was a quieter. But that's my only complaint. I was I researching Amazon reminded me, this is the fan I bought 10 years ago. Still works great. II'm looking for one with a remote control that is quiet, so I wont buy this one again. But I still recommend it. It's been good to me for a decade. Technology has changed so I know I can get quieter. I would assume the more recent model is quieter. I'll definitely check out other fans from this company. Because I know they are durable and work well. (easy assembly too)","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Fussy assembly, LOUD.","reviewDescription":"This does move a lot of air, and it looks nice for a stand fan. Assembly was very finicky - beware that some parts are counter-threaded, so be careful not to crossthread the nut trying to turn it right to tighten it. Chintzy plastic, so I'm sure it is very easy to unintentionally mess up the threads. Even for this price point, it's super, super loud. The specs say 61 dB...I dunno, man. 61 is like normal conversation levels. I can't find my husband's meter to test right now, but I'm betting it's closer to 70. Not quite there (think vacuum cleaners), but definitely close. And it's not a soothing fan-type hum, either; it's very plastic-y sounding and harsh. We got this for our office since we have an old house with poor circulation, and frankly I don't know that we're going to keep it due to the noise. We definitely have to speak a little more loudly than we'd like with it running. But, like I said, it does move air effectively, and it doesn't click when it oscillates, so that's nice. Probably would work well in a small garage, though.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Lasko’s 3D Printing Scandal","reviewDescription":"This used to be the go to brand for home fans in my house. It once held the privilege to exude quality, strength and endurance.This risible excuse of a fan was delivered to us within 4 hours of ordering because I have prime. Even with its razor sharp blades it manages to lack in maintaining its height. The blades do not fit the circumference of the rotator thingy. To my despondency, it left us with a horrid screeching sound from which we desired to escape from. Good thing I lift weights because I had to use the strength of the Lord to fasten the blade. There's still a slight sound but it must be from its power. The motors seem to be running just as remembered.Please restore the rest of this brands essence.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"moves air well, but falls apart if moved","reviewDescription":"I gave this 3 stars for being effective at circulating air, and being fairly quiet. If you don't plan on moving this from room to room it would be a good purchase. However, there are some design flaws: there is no screw to hold the pedestal in place so it fall off easily- I bruised my foot! And the pole does not stay up, so it's frustrating if you want it at it's tallest height setting. And finally, the pin does not work to stop it from oscillating if you want it in the stationary setting.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Came dirty and slightly warped, I’m worried","reviewDescription":"It moves a lot of air. The pedestal base is HUGE so beware if you’re in a small space. When it arrived the blades of the fan had stains from some kind of dried mystery liquid on them. I almost thought it was used, but it was easy to clean up. The back part of the cage is warped, so the front side doesn’t snap on neatly. It’s only held in place by small plastic tabs, so I’m paranoid it will come flying apart at any moment. I don’t want to sleep with it running because of this. The adjustable height nut also doesn’t tighten all the way, so if you put any pressure on the top of it it will slide all the way down to its minimum height. Despite all this, it does its job. However, for the price, you’re better off getting a $17 box fan at walmart and setting it on a high surface.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"This is good till it’s not","reviewDescription":"Is a really powerful and nice fan got this In spring, but yesterday the inside bolt came loose shot across the room and it could have injured me luckily I was laying down in bed when this happened. Not sure if it’s fixable but definitely considering.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"The head moves whether you want it to or not!","reviewDescription":"The fan \"blows\" quite nicely.  I would have given 5 stars but for 2 not minor issues.  #1- You cannot adjust the head and lock it in place,  there is no adjustment knob, it flops from side to side and up and down as it pleases.  #2-  The pipe\/pole height adjustment is a bad joke.  This fan has a collar style adjustment ring, it repeatedly collapses. It's own vibration  cause it to loosen and then slams it self down startling the room awake. I use this fan soley at night and yes I'm keeping this fan. I'll be making a few adjustments with my drill to fix these 'Flaws'. 'Why', you ask, the fan speed is fantastic and its not noisy,  a little background  but not too much. For the price you pay these \"problems \" should not exist.  Oh, and the head barely sits on the pole, beware of this if you need to move it. And, if there is supposed to be a remote I never received it. 😕","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Had to use masking tape to get it together","reviewDescription":"I read a bunch of reviews before buying this and several said it was easy to put together. Yeah, maybe for someone with better spatial skills than I have. ESPECIALLY since the only directions we got were in Spanish.  I had to masking tape #3 Tapa de Ventilador to #6 Helice because the threads wouldn't line up after 20 minutes of frustration, including a few breaks where I walked away to regain inner Zen. Also my #8 Tubo won't tighten properly, which means the fan slips slowly down from its full hight. One reason I bought it was for the extended hight. ?More masking tape??? But, hey, it's up and running! It tilts Ok, it oscillates just fine and WOW! I am impressed at how powerful it is!","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"If it tips over for any reason it breaks","reviewDescription":"I loved this fan initially! I purchased 4 of them. Only 1 is functional now. It was great….like a tornado in your room, but the motorized part of the fan must be very fragile. 3 of them broke with a month.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Idk","reviewDescription":"I bought this fan it came not working then had to return and replace and lock screw that holds the fan was damage didn’t wanna stress on that too much it’s loud but gives good air good for the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Decent fan.","reviewDescription":"It's just a fan. Works great, except for the extension pole. It falls no matter how hard you crank down the locking mechanism.Same price at Home Depot by the way.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Assembly required","reviewDescription":"I ordered this fan ahead of what was to be a 100 degree day. It arrived on the 100 degree day. So I am excited to get this baby out of the box, plug it in and feel the breeze. Oh no....not to be!  It's in pieces and I have to put it together first. I would not have purchased it had I known this... so, I am not real happy, but whatever. I am of reasonable intelligence, so I follow the terrible little picture instructions which are squished up in the little bag.  I finally get the fan motor, blade, cheap plastic blade holder thing, and guard assembled after a few curse words. Sweat is dripping down my face, I'm parched  and I get a drink of water. Then I try to assemble the stand, which some joker thought it would be funny to put the screw on thing that adjusts the height upside down. More curse words and sweat. I finally figure that out and get it sorted.  I plug in my new fan, turn it on and set it in front of me on high. I am now finally enjoying the breeze, my hair blowing back joyfully in the wind. Ahhh yes! This is nice!  Exactly 4 minutes later, there is a loud CLUNK. Some part came loose and is rolling around inside the fan cage. No more nice breeze. NOPE. This is going BACK to where it came from and I will buy and enjoy a fully assembled fan from Best Buy or Walmart.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Didn't work when plugged in --cheap materials","reviewDescription":"I was excited to get this fan as I have  a very similar one that is a few years old and it works very well.  When I got this delivered, the box was half open.  The instructions were very unclear, just 3 steps; but they left a lot to  be figured out, i.e. which way pieces should face. Also, the instructions were in light gray font,  very hard to read.  Drawings were not representative of the parts.  Finally got it done and plugged it in and:  NOTHING.  Tried 3 outlets and still nothing.  When I went to disassemble it for return, part if a piece that holds the fan blades to the motor broke.  When I tried to remove the screw, several other pieces broke off; but I was unable to  remove the screw so it wouldn't pull it apart to fit back in the defective  box it came in. This fan had much cheaper materials than the one I already have. Trying to disassemble it, I sustained a large bruise on my left hand and a gash on might right index finger.  I certainly will avoid  Lasko in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Disappointed with Noise Levels with my hearing aids","reviewDescription":"I recently replaced my broken Honeywell pedestal fan with a Lasko oscillating Pedestal Fan1820 model (without sleep mode). While the Lasko fan provides stronger airflow due to its 5-blade design compared to the Honeywell's 3-blade design, I'm disappointed with the noise level. Here's a breakdown of the pros and cons:Pros: Attractive. Exactly as described in the listing. Strong airflow. Works well as expected.Cons: No \"Sleep Mode\" setting - Loud operation, even at the lowest speed - Noise is in at a pitch that interferes with hearing aid functionality and washes out important soundsModification: I replaced the Lasko blade with the old Honeywell blade and reduced the noise issue for my hearing aids substantially without a noticeable loss of airflow.Overall: This Lasko fan is a functional choice for strong air circulation, but the noise level makes it unsuitable for situations where hearing aids are worn regularly, so you should consider a different model. This is going to be relative to every individual's hearing deficiency.Pictures: The control panel highlights the lack of a \"Sleep Mode\" setting, and both fans' blades for comparison (3 blades flat vs. 5 blades pointy).","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Blows strongly, but has a dangerous defect:  Update Jan 2020 - Fan is dangerous, plz read","reviewDescription":"Update:  Do NOT buy this fan, it is dangerous as well as cheap.  The fan literally came apart while running tonight.  The fragile plastic guard (meant to protect you from the fan blade) will come apart at the slightest touch, and tonight the fan blade came off knocking the front guard loose and scattering parts - someone could have been hurt.  Thank goodness I had used plastic wires ties to keep the guard on front of the unit or someone WOULD likely have been hurt.  I couldn't imagine how the fan blade nut became loose, they are designed to stay on tight, but discovered the cheap plastic nut had stripped allowing the blade to come off while running.  I will be filing a consumer safety complaint on this item.---I bought this fan as it seems reasonably priced and I have an older Lasko (metal) that I think could survive the apocalypse.The fan is moderately loud, but not terribly so.  The old Lasko I own is like owning your own personal hurricane - complete with noise.  This new fan is not quiet, but not terribly loud either - so I can have it on and watch TV if I turn the volume up a bit.  I actually enjoy the white noise when sleeping.The air output is great, far more than the old Galaxy it replaced.  No complaints at all on its ability to move air about.I don't have a lot of experience with this fan so I marked durability as average.  I will update when I have the fan longer.I have run into one very dangerous defect...when passing too closely to the fan my t-shirt blew against the fan guard and unsnapped the front right off, leaving my hand inches from the exposed blades.  I turned the fan off and thinking I must not have put it together correctly, put the front back into place.  I carefully checked to make sure it was on correctly, and then I used my t-shirt to pull across the guard again and off popped the front.  The guard is made of very pliable and thin plastic and can easy just bend its way free of the snaps that are supposed to hold it.  I have since added wire tires to the guard so that the thing won't come apart and hurt someone.  In the past all large fans I have used either had metal guards or much firmer plastic ones.  I have never seen a fan come apart like this.","isVerified":true,"ratingScore":1,"reviewReaction":"176 people found this helpful","country":"United States","date":1542412800000}
{"reviewTitle":"Check item before tossing packaging","reviewDescription":"Should have saved the box and sent this back. Got it all put together, didn't want it to oscillate\/rotate side to side and noticed the 'stopper' wasn't attached. Opened the back up, found the pully and though oh this just snaps back on. Nope. Broken. I had to super glue a nail in the small hole AND use gorilla tape to keep it all together. What a pain. Also the fan was just in the box, no plastic wrap, no bubble wrap, no brown paper to keep it from bumping around on it's fateful ride. Another wonderful thing that it does is make a cute whistle sound while running. Not to mention after I secured all the pieces in place the blades sound like they are going to fly off.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Arrived broken","reviewDescription":"I've never written a product review before but I have also never received an item this badly damaged.The oscillation toggle was completely broken off from the fan. Not even in a reattachable way, because the piece is just snapped off plastic. I could put some hot glue on it but considering I need to pull up the tab to stop fan oscillation, the glue would not hold strong enough for that kind of movement and pressure.In addition to this, the piece that's meant to keep the fan blades in place will not tighten enough to actually hold them in place! I think the piece was made just a little too large because it won't slot into the center divot, making it impossible to tighten around the screw underneath. So oscillation and actual fan use are both completely nonexistent with this product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Dont be fooled, absolute crap no real power compared to original","reviewDescription":"Bought this to replace SAME model number purchased incostco that wprks great after 7 yeats its just the front metal fan shroud os rusting.This item is GARBAGE compared to same model bought 7 yeats ago.This item is- ALL CHEAP THIN PLASTIC- MOTOR, AND FAN VIBRATES-  MOTOR IS \"VERY NOISY\"- HIGH SPEED IS A JOKE AND COMPARES TO MEDIUM SPEED ON OLD FAN.- CHEAP BUTTON OPERATION ON TOP.ABSOLUTE CHEAPLY MANURFACTUREDwhen I compate operation side by side to other Lasko fan this new one is GARBAGE.GOING BACK","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Cheap lightweight plastic!","reviewDescription":"The first one delivered came damaged. The customer service replaced it and it was delivered in a week. Putting it together was a frustrating experience since the only directions are in the form of a drawing showing the sequence of how the parts should fit together. Once the fan is assembled, no amount of tighting can make the fan stay extended to it's advertized height (or any height other than bottom out) It stands at 4 feet for about 5 minutes and collapses to it's lowest height. Nothing but friction holds the main pole into the lightweight plastic base so if you attempt to move the fan the pole lifts right out of the base. Lesson learned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Absolutely poor quality. Do not buy","reviewDescription":"This review is going to be as honest as I can make it.This fan is an absolutely horrible in Quality, materials and in assembling. When we first got the the box is was wide open with no signs of packing tape to keep the product from falling out, there were missing pieces which kept us from putting it together. Reported this to Amazonand they sent anotherright away howeverwhen the secondfan arrivedit was the same issue. The shift, base and fan motor  do not securely fasten together and come apart when trying to move the fan. We received two fans separately with the same issues so I can say it's not an isolated issue.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Garbage, can't be assembled","reviewDescription":"The parts of the fan head are such cheaply manufactured flimsy plastic that they don't even assemble as shown in the instructions,  or indeed go together at all. The front grille has no clip or other feature to hold in onto the back assembly, and the main screw won't engage with the cap that is supposed to hold the blades in place, and the \"nut\" ring simply falls out. Back it goes. Lasko used to be a decent brand--no more!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Pedestal fan","reviewDescription":"Keep the bedroom cooler at night","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Great fan","reviewDescription":"When I first opened the box, I was a little bit, overwhelmed, and having to put it together. The included instructions are lacking in exactly what to do. I found a YouTube video explaining how to do it, and was pleased that it was not difficult at all. I live in South Florida and just moved into a great new apartment but notice until I moved in, but it didn’t have ceiling fans. I bought two of these fans, and am extremely pleased. I love that you can adjust the height, The speed and the angle of the fan. This was a great purchase, and will do the job very well until I can get ceiling fans installed. These fans were a good value for the price I paid. I highly recommend them.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"No tools assembled in minutes","reviewDescription":"This fan up and running in about 10 minutes of opening the box. Air flow is great. Isolation or direct. The complaints about the noise may be... some what valid. Not horrible. Not a crying baby which most of parents block out  ;^] so acceptable for sure.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Top shelf product","reviewDescription":"Wonderful fan at a fair price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Pretty good fan","reviewDescription":"Really good fan only thing they cut me off guard was how big the base was wasn’t really prepared for that but it’s not a huge deal. Move the air around very well and isn’t overly loud especially on the highest setting. I do like that you can adjust the head to point directly to the roof, which is pretty good feature and assembly was very easy. There are no screws or anything just twist and stick and then you’re done.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Nice fan -","reviewDescription":"Easy to assemble.  Light weight for portability.  Makes a difference when placed in front of a window a\/c.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Amazing","reviewDescription":"This fan moves air around a room perfectly; not too loud really happy with this purchase.Fan was easy to put together very sturdy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Cool","reviewDescription":"Wonderful quality & blows hard","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Great fan","reviewDescription":"Love this fan. I got it for one of my children to use in their room. Great height, and love that it circulates!  Would recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Love it","reviewDescription":"Great fan with a lot of power. Easy to assemble and gets the job done. It’s not a quiet fan while running but I like the white noise while I fall asleep. It’s not screaming load either, just making it known that you can hear it running when it’s on. Would definitely purchase again.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Don't buy less than 60 days doesn't work","reviewDescription":"This product is so bad I never had a brand new family last less than 60 days and now it's not on my orders list to try to get a return on this looks like AMAZON is not standing by there product. AMAZON has access to my orders and it dissappear from my orders so I can't get a return . Amazon going down hill .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Damaged Fan-previously used item received","reviewDescription":"Item received had clearly been an opened and returned item.  All parts were loose in the box, the cord was uncoiled and there were broken plastic pieces from the fan motor.  There was visible dirt on the fan motor as well.  Box had damage and there was only brown paper equivalent to a single paper bag to pad the contents of the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Higher price, cheaper materials.","reviewDescription":"I've used Lasko in the past. The one I had to replace lasted for about 9 years without problems up until the motor died. I right away noticed the downgrade in quality of the parts. After placing the rear grill, I tried putting the nut, it took a few tries before I was able to \"lock\" it, every time you think you're locking it, it actually unlocks and you have to start over. Same thing happens when you are trying to lock the cap in place. Then for the front grill, you need to be careful when attaching it to the rear grill, since the new way they decided for it to lock in place can pinch your fingers. When I turned on the motor in the lowest setting, I noticed that it doesn't make a constant noise. It feels like it is not pulling power at a constant rate, more like there's a strong power pull and then in fades, and then there's a strong power pull again, and then it fades again. It does this constantly. After  30 minutes of use, in the lowest setting, the blade and cap just fell apart. Luckily, I still had my old Lasko fan and it so happens that the old parts fit. So basically, I just kept the new motor and mounted all of the old parts to it. All of the new parts went into the recycling bin. I'm highly dissapointed with this purchase, specially when my past experience with Lasko products has been great. They basically jacked up the price and switched to lower quality materials.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1599609600000}
{"reviewTitle":"Not recommended","reviewDescription":"I do not recommend this product. While this fan was easy to put together, and operated as promised, it SMELLED SO STRONGLY OF PLASTIC CHEMICALS that I had to keep it in the garage until it was returned. The smell had not subsided even after 4 days out of packaging. I have other Alaska fans, but have never experienced anything like this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Can not disassemble","reviewDescription":"Awful!!! One of the parts is missing from the package so the fan is useless. And the base cannot be disassembled for a return!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Wrong Parts Sent and Poor Communication","reviewDescription":"First off, the quality of the materials are cheap. The directions could have been much clearer. Once I had it put mostly together, I realized the parts were dented and unable to use. They sent a misshaped pole so it could not stand and attach properly. I am waiting for directions how to return the item and get my money back. Save your money and buy a different product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Disappointing","reviewDescription":"I bought 2 and  1 came without all the pieces. The second was put together and stopped working after 2 weeks. 😮‍💨","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Dangerous Design","reviewDescription":"TLDR: CHEAP FAN, SAFETY HAZARD - ESPECIALLY FOR SMALL CHILDRENPurchased this fan and was initially pleased with it despite some of the cheap plastic components not fitting well during assembly. I turned it on and felt that it had good utility at a relatively cheap price.First annoyance took place during night one of using the fan when the cheap plastic began to make a rattling noise. The fan is already pretty noisy, so this added an element of noise that made it tough to sleep.A few days later is when the major disappointment took place, which prompted me to write this review. When I loosened the tightening mechanism to lower the fan’s height, the upper half of the fan crashed down and put an inch-long cut on my finger. Less than a second elapsed between when I loosened the knob and when the heavy weight of the fan’s upper half crashed down on the hand I had loosened it with. I even contemplated stitches as the cut was quite deep, bleeding for more than 30 minutes.I realize this event could have been prevented had I known to hold\/support the upper half of the fan as I loosened the support mechanism. My concern is not over my personal cut but over the fact that if a child were to loosen the same knob that I did (it’s about 1 foot off of the ground), it’s plausible that they could possibly lose a finger from this event. The fan is poorly made with a hazardous design.","isVerified":true,"ratingScore":1,"reviewReaction":"63 people found this helpful","country":"United States","date":1565395200000}
{"reviewTitle":"Dangerous, do not buy!!!","reviewDescription":"Do NOT buy this fan. It is dangerous and loud! Minimal effort was put into the engineering of this fan. It has two fatal flaws, one dangerous and one annoying.The first fatal flaw is the design of the front safety guard. It simply snaps into place without screws. It can easily come apart leaving the rotating blades exposed. And the mesh size of the plastic guard is too large allowing my 2 and 4 year-old grandkids to easily put their fingers into the cage and touch the blades. Not good.The second design flaw is the with the large plastic base. It is shaped like a saucer\/cymbal and perfectly amplifies the vibration from the fan motor at a very loud resonance. The entire upstairs of my house hums and vibrates due to this fan. It is unbelievably annoying and there is nothing you can do to mitigate it. Again, not good.I am a degreed design engineer and this is easily the worst engineered product I've ever bought on Amazon. (Otherwise I've been very happy with most of my purchases.)Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"Wouldn't stay together","reviewDescription":"I was not able to assemble this fan. It fell apart when I tried to screw it together. Unfortunately had to return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Decent\/very LOUD","reviewDescription":"Decent enough fan, gets the job done but it is not sweet melodies to the ears. 😆 👍","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Powerful, noisy, cheaply made","reviewDescription":"Executive summary: In this review I compare 3 fans, including this one.With the prospect of the coming summer and living in an apartment not suitable for window A\/C units and a deficient central A\/C which the landlord refuses to fix, I geared up by buying an array of fans. In the following paragraphs I compare them in terms of power usage, perceived noise, perceived air circulation and overall functionality. All of them were tested on a 150sq ft living room on a 30c\/85f degree day.Overall:Lasko 1827 -  pedestal with 18 in blades: This is a big and powerful fan. The swivel function does a great job at circulating air from the only window in the apartment. The burst of air, even at the lowest setting are noticeable from a 5m\/15ft distance and we could feel \"air circulation\" throughout the whole room. Unfortunately it feels cheaply made and is very noisy, unable to sleep.Vornado 683 - pedestal with 11 in blades: This fan is well built and surprisingly powerful for its size. Even though, you could feel  good breeze if you stood in front of it, we could not replicate the claim of \"whole room air circulation\". Since it doesn't swivel, if you were outside of the range of direct air, we couldn't feel any air. Additionally, it was a little shorter than anticipated and would not fit well in front of the window. The worst part was that it was really noisy and we couldn't keep it on overnight.Honeywell HT-900 - floor with 9 in blades: This wan was a very pleasant surprise. Very cheap but feels well built and despite not being as powerful as the other two, since it draws less energy and makes virtually no noise, we opted to fill the room with 3 of these which we keep at around 3m\/9ft blowing air directly at the lowest setting. Best setup for sleeping.Details (the 3 numbers for each fan and metric correspond to the 3 power settings).Power drawn (beasured using a TP-link HS110 smart plug):Lakso: 85\/73\/63wVornado: 60\/45\/40wHonwywell: 25\/23\/21wNoise (measured with an unreliable phone app, from behing the fan)Lakso: 60\/55\/50dbVornado: 45\/40\/35dbHoneywell: 40\/36\/34dbFinal veredict: We returned the Vornado and for the same price we have the Lakso which we setup in front of the window before goingto bed and the 4 small Honeywel for \"whole room air circulation\",1-3 of which we keep overnight or on timer (with the TP-link smart plug)","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1497916800000}
{"reviewTitle":"Loud AF","reviewDescription":"I was so excited to finally have a new fan when I got this yesterday as the fan I've been using for the past 7 years has become a nuisance with the funky sounds it makes now. I've always used a fan for the white noise and gentle breeze when I go to sleep. My 7 y\/o fan had a gentle breeze, like a soft meadow wind and was quiet as a church mouse (if that mouse were a fan) as it pushed the air around the room. This new fan is nothing like that. It's like a hurricane and an earthquake at the same time. The lowest setting is higher than the highest setting on my previous fan and shakes the hollow pole. The vibrations reverberate throughout it and make a very annoying sound. You can feel the fan shaking the floor a foot away from it. As the blades spin, the air smacks on the front grate and makes a sound similar to when someone blows on a small computer fan as it spins. There is nothing quiet about this fan. When I finally got into bed at 1am and realized how loud it was, all I wanted was to smash it to pieces. I used tape all around the front grate where the air smacked on it and it mostly fixed that issue, but then the vibrations were more prominent. This was all on the lowest setting-- the highest probably registers on the Richter Scale. In the end I used my old fan. Although it's annoying, it's nowhere near as bad. I have no idea why the product page says this is a quiet fan. It's a powerful, nice looking, stable fan. It should not be used for white noise when trying to sleep, but to cool down your entire home in the middle of summer in the middle of the day when you don't care how much noise it makes. There is something else you should take into consideration: the chord is extremely short. I haven't measure it, but it's probably around 4-5 feet. This can be remedied by an extension chord, but who wants to deal with that? As far as my review goes, I'd have given this one star last night in my rage, but it deserves more credit than that. If it weren't for the loudness, this would be great.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1452643200000}
{"reviewTitle":"Just okay","reviewDescription":"The fan looks good but the motor while it's on makes an awful noise","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Great could be perfect","reviewDescription":"Amazing air circulation, but the rod that keeps it upright, keeps dropping down no matter how tight you screw....it will randomly just drop down as if it were not tight enough??? i did everything by the book and it just 😭 its so annoying. Itd be perfect if it weren't for that. I wish there was a way I could get a spare part or something.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Loud and speed way too high on lowest setting","reviewDescription":"Ugh!! I received the fan today and I couldn't be more annoyed by it.  My previous fan had a true low medium and high setting but this is blast,  blast more,  and full blast.  Maybe if it weren't so loud it wouldn't matter, but it IS loud.  I bought this for in my livingroom but the noise would drive me crazy. so it not going to work for me.Sending it back would be a total pita so I may be stuck with it and that makes me even more unhappy.  The description says \"quiet\" so it is definitely not accurate.BOTTOM LINE: if all you want is a strong fan that will cool you off and noise doesn't matter, this fan is for you.If you want a fan for indoors that is quiet, this is NOT the fan for you.It's cheap plastic garbage which would be OK if it worked well, it doesn't.  It blows and sounds on low like my previous fan sounded on high.  Maybe someone can use it in their garage. Three stars was the lowest rating it would allow but if I could, I'd give it 2 stars.  A fan is useless if you can't use it where you need it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Inconsistent quality","reviewDescription":"The first one had a Crack in the blades, second one has a burned smell and it makes a ringing noise.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Despite the description, this fan does not include a remote control!!!!!","reviewDescription":"The description is incorrect.  It distinctly says: \"Controller Type - Remote Control.\"  However, this product does not include a remote control!  This is false advertising.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Noisy!","reviewDescription":"Even on the lowest speed this fan is NOISY!  (This is the 18\" one).  I also bought a 16\", and that one is wonderfully quiet in comparison.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Noisy","reviewDescription":"Easy to assemble but EXTREMELY loud especially on the 3rd setting. The first setting is the quietest but doesn’t blow as well. Sending it back","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Good fan, but very loud","reviewDescription":"I use a fan in my room at night year-round, both for airflow when it's warm, and for white noise. This fan is great for circulating air, which of course is its main job. But it isn't so great when it comes to white noise. It's very loud even on its lowest speed, and has a sort of rattle-type sound. I've checked it to be sure everything is assembled properly and tightly, and it is. I wouldn't buy this fan again, and I may even end up replacing it sooner rather than later.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Oscillating fan","reviewDescription":"It isn't as sturdy as I would when you raise it up it doesn't always stay.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"LOUD","reviewDescription":"Bought this for in my bedroom because we have no ceiling fan. Even on the lowest setting it is an absolute block out white noise. Great if that's what you're looking for - not great if you have kids you need to listen for. I regret the purchase but too annoying to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Acceptable","reviewDescription":"Bought this as a backup for the Lasko I already have. Very quiet and has good air flow.It was easy to assemble. The problem with it is the stand when extended to full height will slowly lower. The cup that you turn to tighten it doesn't  tighten enough to keep it in place when extended.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"White noise","reviewDescription":"I love fans... I am one of those people that has to have the fan going all year long to fall asleep.  That white noise is amazing... however, lets jump to the fan I am reviewing... I dont know the decibel level of this fan, but this is NOT that comforting white noise that helps you to go to sleep... on the lowest setting it sounds like you are standing next to a loud turbine.  You may think I exaggerate, but those who own this fan will agree with me... Put it in another room far, far away from your TV if you even think you want to hear your show at a decent level!  It cools the room great, I love the range of the fan, but the noise... I dont want to wear ear plugs with it.  The white noise on this beast is not comforting at all.  When putting it together, I did have a little problem with attaching the fan blades to the motor.  The hubs had to do it.  I have not had to clean it as of yet since, the noise is such a deterrent on using it, so I do not know how easy it is to clean.Hope that this honest review helps you.  OH!  One other good point... NO LED lights on it!Have a great rest of your day!","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Way too loud","reviewDescription":"Very strong wind flow but OMG talk about loud. It is the noisiest fan I have ever owned in my life. I had a Lasko fan previous to this, and it was super silent and super efficient. I wish I definitely could have found that model to replace with.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Squeaks","reviewDescription":"Good air flow, but it squeaked. So maybe not if you’re getting for sleep.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Powerful but LOUD","reviewDescription":"These do the job, they are actually pretty powerful. However, they are so loud you can’t hear the TV if they are on even the lowest setting. In hindsight, I would have opted for a different fan. They were delivered fast that’s why I got them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Low quality","reviewDescription":"White the fan functions seemingly well, the plastic components are chintzy. The fan does not stay in the raised position with the lock collar due to the weak, thin plastic thread compresses.  Would not buy again but not worth the hassle to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Overall Great Fan - arrived damaged","reviewDescription":"Fan works great and is powerful. Finishings on fan parts were scuffed and marked up. Seems like it may have been used and returned or damaged at the factory. Overall good fan, but doesn’t seem new as I had expected.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Not Stable and NOISY","reviewDescription":"Update: I was able to use some rubber door seal strips I had lying around to create a simple gasket. Now it has the same volume level as I expected it would and I am much happier with the purchase. still gets briefly loud if you brush into it while walking by, but still a huge improvement. added one star to review.As the fan motor does not securely attach to the base, this thing wobbles like crazy. Because it wobbles it also makes a humming noise that is louder than the fan itself. It's got decent airflow, but I wish I had bought something else. I believe adding a gasket between the pole the motor will help, but I would not recommend this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"This fan","reviewDescription":"This can't is ok. I would have given a better star rating but for how noisy it is.  If one does not mind the noisy humming of the motor then...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"It arrived bent.","reviewDescription":"It arrived with the front round panel bent. My husband figured out a way to straighten it out, but quality control needs to be in place. Not okay.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Know broke immediately out of the box","reviewDescription":"The air output is good. It's not quiet but not too loud. However putting it together out of the box, the fan speed knob immediately broke 😠Had to glue it back togetherThe height adjuster also doesn't work right, keeps sliding down unless you tighten it into oblivion. It then sucks to have to adjust later.The only reason this fan is getting a 3 star from me is because it's actually strong.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"stand doesn’t stay","reviewDescription":"The power of the fan is good. It’s not quiet, which I don’t mind. It tilts up and down. My issue is, the stand slides and doesn’t keep the fan up. I’ve tightened it as much as possible, but it doesn’t stay up and the fan slides down fully. I had to duct tape it. I wouldn’t get this fan again Also, the instructions aren’t clear at all! No labels or clear written instructions.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Arrived defective.","reviewDescription":"Fan arrived with a switch that did not work. Did not seem to be shipping damage. I am awaiting the replacement, and will update this review then.The second fan arrived. It works fine. I noticed that shipping box was glued shut, not taped like the first one. The new fan had more packing materials. I suspect the first fan was a previously opened item. So far, the second fan is working great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Really easy to put together, keeps room cool as a cucumber but it's extremely loud!","reviewDescription":"It's a pretty good bang for your buck. I kove the adjustable height and love the black color since it seamlessly camouflage wirh the room. Even on a hot day when coming back from work it'll make the room instantly cool at the 3rd setting, but unfortunately the drawback of it being extremely efficient is the loudness of it. I don't know about you but for me, when going to sleep I like a little white noise. Even on the lowest setting its still pretty loud. The best part about it is since it's so efficient, waking up to a cold room with 3 blankets wrapped around you makes you feel at home. If you have a bigger open space the sound might not be as loud but I do recommend it if you'd like something efficient and cheap.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"Well...","reviewDescription":"The good 1st. Man these fans can move some serious air!  I even used one outside under our carport on a windless day and it provided the needed relief.The bad!!*** 1 came broken. The speed knob was broken in right out of the box. And they are loud,  very loud.  Even with the fan 15 feet away I have to double the volume of the T.V. from our \"normal\" level just to hear it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Kinda cheap","reviewDescription":"I know it is a cheap fan, but it vibrates pretty bad and it’s super loud are the negatives. The positives is it is big and it is easy to put together, but not very solid I would say. overall, pretty happy for 40 bucks I guess but probably should’ve invested a little more for a quieter fan","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Annoying to put together","reviewDescription":"It’s annoying to put together and not sturdy. But it does its job. I like how adjustable it is.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Good Oscillating Fan","reviewDescription":"I have a couple of Lasko fans and they are dependable. Easy to put together out of the box. Shipping was fast. I recommend Lasko fans to anyone looking for a dependable reasonably priced oscillating fan","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Perfect","reviewDescription":"Bigger than expected but it’s fine. Works good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Perfect!","reviewDescription":"Excellent price point, moves a lot of air, even on LOW!My hope was to start a weather system in my apt using fans to corral air flow. This was to be the primary push...Works!Recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"puts out good breeze","reviewDescription":"A little noisy, but it moves the air much more so than a 16\" fan that it replaced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"As advertised","reviewDescription":"Have it in my garage and like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Works Good","reviewDescription":"I just bought 2 of these fans for the hot spell. I've owned the same fan for 2 years and works good . Easy to put together. Would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Best investment","reviewDescription":"I have A\/C at home, I dont care... this thing is the best investment for the summer that I have ever made. The air is even better than the AC and even my dog is in front of it the whole day. So refreshing and is big enough. I love it and it was very easy to put together, I had to watch the video but everything went smooth at the end.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Easy to assemble and use","reviewDescription":"This was easy to assemble, and it has been great. It’s large enough to reach a big area, and the oscillation is very good. You can cool a lot of the room with this! Quality is good for the money.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"great for the price","reviewDescription":"great fan for the price! helps deal with the heat and is actually more powerful than most","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"this Fan is  the best!!","reviewDescription":"This fan is one  of the best ever. I would encourage you to get one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Not great","reviewDescription":"It didnt fit together properly. Not very powerful. It is quiet but I like a noisy fan.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Cheaply Made","reviewDescription":"I was expecting a better product not a plastic fan. It is louder than anticipated. With my 11 year old grandsons’ help we put it together. They high speed works well. My problem on noise is I have to turn the TV up so much when it’s on low in my living room","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Fan works as described but","reviewDescription":"We were missing one of the poles that makes it a “stand”. Frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great, if you don't mind a loud fan","reviewDescription":"This fan moves air wonderfully, but it's very loud even on the lowest setting.  If I didn't have noise canceling headphones, there would be no way that I could work and concentrate with this sucker on.  Don't plan on watching television with this thing nearby!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Open box delivery","reviewDescription":"The fan arrived in an open box.  The pieces were laying open.  I need to put the fan together to make sure all pieces are still in the box.  Was disappointed to see how this was delivered.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"parts are all plastic","reviewDescription":"First, I would suggest watching a video on assembly if you're having difficulties.  Secondly, the fan is priced reasonably cheap, but the fan is also all plastic.  The results, at this time, produce a decent amount of airflow.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"meh","reviewDescription":"Not particularly well made. The base is plastic and unweighted. The height adjustment slips easily.  Moves less air than I expected. I needed a fan with a mechanical switch so i can turn it on\/off with a smart plug.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Very loud fan","reviewDescription":"Definite not whisper quiet like the advertisement says. Can barely hear my tv over the fan on the lowest setting. Buy something else if you want a quiet peaceful environment when relaxing at home after work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Won’t lock","reviewDescription":"Gave it three stars because the fan itself works fine and oscillates well. The issue is the “locking” mechanism on the post. The fan constantly loses height and eventually falls all the way down. Returning.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"It is loud","reviewDescription":"I got this fan for 2 reasons, it’s energy efficient and as a backup fan in case one of my other fans quit working. My other fans are Honeywell and I can’t find them anywhere.  While it seems sturdy enough the base is heavy plastic. Compared to Honeywell’s heavy metal base.  Also the Honeywell fans are a lot quieter.  I feel this fan is loud.  It will do the job quick to cool the room though but the 3 stars are given since it’s loud. I wouldn’t purchase this fan again but if you need a backup fan that is economical then go for it.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"So far, the parts are not fitting together","reviewDescription":"The parts are not shown correctly—specifically “Part 8” is shown as one part—it’s actually 3 parts—and they do not fit as shown. The small pipe piece has a lip on one end that prevents it from being attached as indicated…I believe it was included in error vs the correct pipe.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Bad quality","reviewDescription":"Worked for exactly two months then stopped working. Plugged it up one day then nothing. Completely stopped working. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Not quiet!","reviewDescription":"Bought this for a 80 year old lady who has trouble with electronic buttons.  Just needed a quiet\/basic fan with simple  controls.  Well.it is not quiet.  Even on the lowest setting it is loud.  Sorry to all those who reviewed it as quiet, your wrong.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Doesn’t work and falling apart","reviewDescription":"The fan only worked for about a half hour before the blades stopped turning.When we got it running again later it lasted for a few hours then stopped working. If my husband hadn’t thrown the box out, I would return it. We’ve only had it for a few days.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Dont with Lasko","reviewDescription":"Bought a 2nd Lasko fan after the 1st one shorted from chewing its own cable. This new, not even a year later, decided to overheat itself and now wont turn on. Waste of $80 and now I have to buy another one before the summer heat destroys me","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"defective product. missing component.","reviewDescription":"came in the box with missing product to tighten the threads to the fan. very L of Lasko. not cool man.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Noisy","reviewDescription":"The fan was easy to assemble. What I didn't like about it was, it very noisy on the lowest setting.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Missing parts","reviewDescription":"My package was open before I get the shipment.And parts were missing.I need the refund for this product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Terrible","reviewDescription":"Not even a week of intermittent use and this fan us making terrible noises. I assembled properly, but nothing fixes the sound. It's so bad it hurts everyone's ears when they're around it. I despise this thing. In the trash it goes. Cheap plastic junk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Total waste!","reviewDescription":"if you don’t have an older one for extra parts. there is a flange on the center pole which doesn't fit either the bottom hole or the fay egine. also low is too high. its almost a 3. I wanted it for a mild breeze and its too hard. also couldn’t put fan grid cover on easily and the fan hits it. took two days to get it working. couldn't return it. go to walmart.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"The best fan I ever owned.","reviewDescription":"I got this fan because my fiancé has one. It isn't like other fans that just move the hot air around. It actually blows out cool air and I liked the fact that it took me a minute to assemble and I didn't need any tools. Great fan overall.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Great for continuous use","reviewDescription":"I love this fan. I've already bought 2 of them, and I'm about to buy my 3rd. I keep this thing on at full blast year round and I never really turn it off. My most recent one lasted 4 years before it had any problems, which I think is pretty impressive given the price. It's easy to put together, and easy to take apart to clean. I cannot live without this thing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Fan","reviewDescription":"I love this fan.  Puts out a great wind flo.  Fan is very sturdy and was easy to put together.  This is a fan you can use for some time.  My favorite of all the fans I have.  Does not have a remote but all the other things balance that out. I'm","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"really good!!","reviewDescription":"so far since i’ve had this fan, it definitely is a good one for a good price. i just wanted a fan not too expensive\/fancy, but also not too cheap either. this is a great medium, so far! it definitely can make some noise at times, but i just went ahead and made sure i screwed everything tightly and so far it’s not as noisy as it can get. i mainly just need to use number 1 since it has great airflow. overall, i recommend it!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Fan cover comes off very easily","reviewDescription":"This is light weight and easy to move around. The extension pole will need some adjustment as it will slide down over time (several minutes) but either duct tape or a screw into the pole will take care of this.  The fan blade cover does come off real easy but I used zip ties to hold it now it won't go any where.  So far I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Is very Effective!!","reviewDescription":"This fan with an 18” fan head ifs fantastic!I use it on oscillating and the amount of air this fan puts out is great! I love that base is so large so I know the fan is not going to tip over. Thank you Lasko !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Powerful","reviewDescription":"Like the white color, fan has three speeds and circulates the air.  Not too noisy.  Large base so it is not going to tip over.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Lasko Fan","reviewDescription":"It’s easy to put together. Works well and is very powerful. The only problem I have with it is that the lowest setting is still very strong. I would have preferred to have a gentler breeze. Price was very reasonable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Love this fan","reviewDescription":"I had to replace an older fan that stopped working correctly. This one is awesome! There are multiple speeds and I keep my fan on 2 during the night as white noise to drown out any outside sounds. It generates lots of airflow and is easy to turn on and off. The sound of airflow might be too loud for some people, but that's why I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Cool baby!","reviewDescription":"Super easy to put together and lightweight enough to move from room to room","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"To Loud","reviewDescription":"This is not a house fan - it is a garage fan - way too loud for the house or bedroom - way too strong even on the lowest setting.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Setup","reviewDescription":"Instructions for setup extremely unclear","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Fan","reviewDescription":"Difficult to put together","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"1 in 2 look like refurbs\/cheap?","reviewDescription":"I bought two. The first one I got was pretty much perfect, they blow a decent amount of air across a bedroom or office room. Setup wasn't hard, but I didn't realize you had to align the notches immediately on the bottom of the fan blade, so that was the only hiccup. Overall great. I wish the stand was possibly a bit smaller base, but its not the end of the world. Given all these, for the price I would have given it 5 stars.The second fan however was scuffed in multiple areas and the biggest issue is that the front grill of the fan does not snap or attach into the back grill at all unlike the first one. The first one was a tight fit and snapped in almost ideally. The second has a gap when you snap all the sides except the last one. The grill will stay on, but I think one solid smack or bump might knock it off. I am keeping it because there is no issue with the airflow from it, but when you compare the first to the second one, there's a noticeable difference in quality. It feels a bit like the second one I received was a refurb or some sort of poorly QAed batch.Just used zip ties to secure the grills better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656460800000}
{"reviewTitle":"Great product and price but height adjuster not working","reviewDescription":"Great product and price but height adjuster does not keep the height to where I want it and continually falls down.  Can't possibly make it any tighter. Disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"My extention pole will not extend. Loud fan","reviewDescription":"I never complain about orders,  but...The fan arrived a day later than it was scheduled.It is assembled correctly. The extension pole will not tighten so it can't extend to a higher position like a normal standing fan. So I have a faulty fan that's very short,about 39-40 inches high-not what I wanted. I've been ill with multiple surgeries and am in pain.  I can not get out to return it.  It's always a hassle if something must be returned as I have to ask someone else to return it for me.  I feel bad about asking others to do this for me. It's not much taller than a foot stool to a chair in my family room or the box it came in.Also, it is Not a quiet fan. I don't mind this as I like to block the noise from outside my home. If you want a loud fan this one is  for you.I'm very disappointed the fan can not be extended. I wish someone would just come pick it up. I'd be willing to exchange it for one that extends to a normal height. I'm so disappointed it won't extend.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686700800000}
{"reviewTitle":"quality","reviewDescription":"The fan does provide good air output.  It is loud---which I like for sleeping so that was a plus for me.Other than the stand and motor everything is plastic.  It was very difficult to assemble and keep assembled.  If you move the motor head too much using the tilt it comes apart and you have to try to reassemble again. Especially difficult was getting the outer cover to \"click\" in.  I ended up having to use ties to keep it in place.  My last fan was difficult to keep that outer cover on as well though.I like the button to choose speed levels, but the oscillating button is very difficult to work.  It took forever to stop the oscillating.  Luckily, I never use this option so I don't have to use the button again.The real question will be how long it lasts.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Not Quiet. This is a loud fan even on low setting","reviewDescription":"Not Quiet. This is a loud fan even on low setting","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Update after using 1 year","reviewDescription":"UPDATE:  One fan I'd rate a 3 star and the other a 2 star.  Neither fan holds the pedestal in the base, I can just lift it out, and they both wobble some because of this.  And the height adjusters on both don't hold tight and the fan ends up lowering itself as it oscillates.  The 2 star fan has now developed a vibrating noise as it oscillates to one side.  I've taken it apart and tightened everything (parts holding fan itself together do loosen also) and that didn't help.  I just hope it lasts the summer and then I'll trash it and buy another brand.  I would recommend buying a different product to start with.Original Review:  Ordered two fans, both delivered same day.  One in perfect box, the other box obviously had been opened and retaped.  Put the one in the previously opened box together and pieces weren't repacked right and motor wouldn't work.  Amazon should not have shipped that.  Got a replacement without a problem though.  The fans aren't that hard to put together, however the front screens on the fans should fit more precisely and you do have to wiggle the piece around to get the latches to fit together correctly.  One fan, the pole doesn't fit tightly in the base and will lift out and the top part of the fan will slide down so the fan isn't as tall.  Can't tighten the connection any tighter so that doesn't happen.  They are a little noisy, but as far as output, they really blow.  Not sorry I bought them, but may look for another brand if I need more fans.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1569715200000}
{"reviewTitle":"Loud","reviewDescription":"Works fine but it's WAY TOO LOUD.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Did not include all parts, low quality","reviewDescription":"It is a very low quality plastic material, did not include all parts, had to return. Def won’t recommend. Overprice low quality product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Cheap with an annoying vibration","reviewDescription":"Every time the fan turns from side to side, there is a very annoying rattling\/hum from fans joint. I don’t not recommend this for bedrooms as that makes trying to sleep very hard.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Fan blade exploded. Dangerous! Buyer beware","reviewDescription":"I know, you see how many reviews there are and you think oh this will be a good fan. Incorrect. I love background noise, this fan is loud. I can't say others share my love of white noise, many wish for quite fans. This is not that. I had this for about 4 months and one night I just turned it on and 1 fan blade just exploded right off and flew around inside before I turned it off. Had the front cover for the blades popped off at that time that fan blade would've been quite the projectile.It worked good for the time I had it other than the spontaneous combustion part. Gamble your odds. Will you get a nice cooling fan to last or a fan blade in your butt cheek in a couple months? Just get something else","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Whistling noise","reviewDescription":"The fan was making a whistling noise. I am really disappointed because I contacted their product support and they said that was normal noise. We couldn't even sleep when the fan was on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Not cool, Not cool at all.","reviewDescription":"OK so I had an older version Lasko that works great, However the stand is getting a bit flimsy so I decided to update. So I ordered this fan, and at first it felt promising. However it took me about half an hour just to get the stupid fan cover on,  because it is designed in the dumbest way possible with tiny little plastic clips. Most of them are not even molded right.  In one week the cover fell off three times !  So I decided to just use it without the cover on which is obviously very safe . And of last night, the motor is starting to make a low thumping sound have a couple minutes, so I just gave up and switch back to my old one hoping I can use the new stand on my old fan. But what a surprise, not, do you learn at the stand is a new style now and won’t fit for nothing. So yes this is an awful review but this is an awful  end of last night, the motor is starting to make a low thumping sound every couple minutes, so I just gave up and switched back to my old one hoping I can use the new stand on my old fan. But what a surprise, not, to learn that the stand is a new style now and won’t fit for nothing. So yes this is an awful review but this is an awful fan.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1552953600000}
{"reviewTitle":"I encourage you to keep looking for a different one if possible.","reviewDescription":"Unfortunately my experience with this fan has not been the greatest, from the moment I opened the box I noticed something was wrong with the fan but due to the extreme heat we’re experiencing I just dealt with it. My fault entirely for not making it a priority to return it before the return timeframe expired. The main tube\/pole that connects to the base leans to the side as the hole in the base is not properly fitted, this led to it coming off incredibly easy to the point where my toddler could remove it. Adjusting the height was a pain as the whole thing would come off the base without a fight. Before my fan RIPed, I was attempting to adjust the height when the pole came off, the fan fell and snapped off one of the blades. If you can find something different, I highly encourage it.. 0 Stars","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Defective parts","reviewDescription":"I received a fan with defective parts. The cap that is supposed to screw on to keep the blade in place does not work. No matter how much I try the cap will not screw on. It just falls right off. The fan is completely useless to me since the blades can’t stay on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Cheaply made","reviewDescription":"Way too much cheap plastic. Shakes a lot. Cheaper than I expected","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Doesn't Oscillate","reviewDescription":"I rarely use this fan.  I have had it for 6 months and decided to use the oscillate feature today.  Nope.  Doesn't work.  Outside of return window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Falls apart","reviewDescription":"I have put plenty of fans together and have worked for years,  this one falls apart every time it oscillates","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Extremely loud, misleading and fraudulent description","reviewDescription":"The description for this fan SPECIFICALLY STATES that it offers a \"quiet, efficient operation.\" Continuing to sell the product with this description intact is EXTREMELY MISLEADING, BORDERING ON FRAUD. Any reasonable person would recognize that the fan is EXTREMELY LOUD. Right out of the box, something inside the motor makes a clunking noise several times per second as the fan spins.I strongly suggest that Amazon delist the product or alter the description until this issue is addressed, and I strongly suggest that you do not buy this or any other Lasko product until the situation is remedied.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Parts were missing and it became a fiasco","reviewDescription":"So, I bought this a week or so ago and instantly realized a single critical part was missing.Contacted the manufacturer and 15 emails later, nothing. Each email they asked more questions and honestly, it became ridiculous. They know exactly what part I need, but just kept asking for more and more.I know they were trying to help, but they actually made things only worse.Never again. Too frustrating to deal with this company.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"It was great, until it wasn't - in less than 2 months","reviewDescription":"This lasted less than two months and then just quit running. I checked the outlet, it was fine. Plugged it into a different outlet and it still wouldn't work.  I expected better quality for this price and from this company.Amazon did nothing to rectify this situation. Lasko is sending me a new fan. Hopefully, there will be a positive update to this review.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Functional but that's it","reviewDescription":"Older, far higher quality fan decided to have it's on button break during a heatwave.Got this because it was same-day delivery.Low quality material, barely stands up on its own.  Weak.  Came used with missing parts.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"NO REMOTE CONTROL FOR THIS FAN","reviewDescription":"The Information page says it has a remote control....but there is NO remote control with this fan.  Easy enough to assemble...and noise level is what would be expected....I see nothing about a \"sleep mode\" in the description...but I DO CLEARLY SEE that it is said to be a remote controlled fan (one of the reasons I paid $45.00 for this fan.  It is only a 3 speed, free standing, oscillating fan that is advertised here on Amazon to have remote control....however,  Do NOT expect there to be a remote control.  They maybe need to fix the advertising ....I wouldn't buy this fan...You can get the same fan for LESS money ....must be paying for the \"name\"?  I'm not impressed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"I like Lasko and have always had Lasko fans.","reviewDescription":"However, this fan would not stay up. The Telescoping pole is stripped or manufactured incorrectly. I have to have an oscillating fan when I sleep, so I will just go out and buy one from the store where I live.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"It's a mess","reviewDescription":"Package arrived with EVERYTHING rumbling around loose--a jumble of miscellaneous cover plates, extension rod, and stands and plastic bags and plastic wrap and rubber bands and other trash.  From the looks of it, I suspect that maybe this was a return item and they never bothered to fix up the mess before reselling it as new.  Anyway, after putting the thing together, I can see why someone would want to return it asap.  IT WOBBLES AND THREATENS TO FALL OVER IF YOU JUST WALK TOO CLOSE TO IT.  I'm sort of afraid of it, but since I need a fan today (no AC, +90degree temp), I'll just be REAL careful around it and hope for the best.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Directions are barely visable","reviewDescription":"I had to go watch videos because the instructions were so illegible, and then the one piece that was supposed to fit in for the pole didn’t fit correctly. Just throw the entire thing away and finding something else","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Cheaply made","reviewDescription":"The plastic is thin and cheap - not worth even $20.No assembly instructions - just tiny, unreadble pictures.Amazon won't help explain how to assemble.I would return if my AC weren't out in Phoenix in August.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Poor quality","reviewDescription":"I bought this fan in May for my daughter’s room and the pole keeps sliding down, I tighten the pole and it falls back down. Today a piece broke off. It’s an expensive fan, and poor quality!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Cool, easy to clean","reviewDescription":"Lasco fans are my personal choice and this Pedestal Fan is a good one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Very good quality.","reviewDescription":"Pushes out on amazing amount of air! Can cool down a room in a matter of a few minutes. Very good quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"It's a fan","reviewDescription":"Works great. Pretty loud at all settings but it cools the room and I have headphones on anyways. Great for gamer rooms with gaming PCS pumping out hot air.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Good Buy","reviewDescription":"So good I bought a second one.Good size, quiet, and with a remote!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Very good","reviewDescription":"Baby when I tell you it will have you shaking the power on this fan is so amazing it’s so good I don’t take it off low cause it’s that powerful","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Quit fan","reviewDescription":"Quit fan works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Silencioso","reviewDescription":"Me ha llegado hoy así que no puedo hablar de su durabilidad. Pero echa bastante aire y no hace apenas ruido. Por ahora me gusta.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Perfect!","reviewDescription":"This fan BLOWS! In the best way, though. I was looking for a high velocity, noisy fan for my bedside. My previous fan was a Lasko, but was ready for retirement after many years of use so I decided to stick with the same brand.Upon arrival, the box was manufacturer box was partially opened, which was a bit worrisome. But all of the parts were there. Assembly was easy (but please note that all parts are plastic, and the fan guard clicks into place, instead of there being actual closures. We'll see how well that works out in the long run).After assembly, I turned it on and was amazed at how much air this fan moves. And with the perfect amount of noise! On the highest setting, you almost need goggles when lying in front of it.Awesome fan! If you're looking for a powerful fan with perfect white noise for sleep, add this to your cart!","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Wind on demand","reviewDescription":"Nice budget pedestal 5 blade fan. 3 speed and available oscillating function. Easy assembly with out tools. Breeze easy on a budget","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great fan","reviewDescription":"Has a lot of power and really cools off our bedroom. A little loud, but that's what we wanted.  We need the noise to sleep.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Quite possibly the worst fan I have ever owned","reviewDescription":"The first thing I noticed when unboxing is how unbelievably cheap all of the materials felt. A fan so light as a feather? I really didn’t expect it to be plastic as I expect more from Lasco, although I confess I did not read the product details carefully.Following that I began the assembly instructions, which were very simple. As simple as they were, the pieces didn’t fit together easily because either the threading on the nuts was tricky or uneven, or the pieces you had to screw into each other would easily slip and slide while accomplishing that task. Cheap plastic will do that.Worst part is the footprint of the base. I cannot imagine anything less than 30 feet tall needing to be supported by that base!! It is enough to want to throw it out the window as I have no room for that base in my apartment. Perhaps I’ll get rid of my bed or charge it rent.Yeah, it blows. It blows kinda hard. But I got it to replace a fan that broke yesterday and it doesn’t blow any harder than that very old dirty fan constructed of metal and much sturdier material.Finally, the pole is a piece of junk. It slides up and down very easily, and the head is so heavy that the top portion of the pole will not support its weight. The nut that you are supposed to use to keep the fan poles tall and upright is cheap. This results in the fan continuing to gradually lower in height toward the nut onto a pole that doesn’t even secure to the base. This is absolutely the cheapest piece of crap I’ve ever seen.My fan broke yesterday. My senior dog is in kidney failure, and heart failure. She is dying and she is hot. The fan is blowing at her directly and will not be returned because that is the only damn thing that matters. 🐾🌹","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Buyers beware of your fingers","reviewDescription":"Buyers beware of your fingers, for if you buy this product you may be without one or two.My husband and I have been using a very ancient Lasko fan since we met five years ago. This thing is incredible and is perfect for us while we are sleeping, especially during the sweaty summers in Michigan. The problem was, though, we couldn’t find another fan that was as good as that one so that we each could have one blowing on both of us at the same time.After years of searching Meijers and WalMarts and Targets and spending probably hundreds of dollars on sub par fans, we thought that we would go for the good stuff and get a twin to the tried and true fan that we know and love.We got it today and my husband was so excited that he put it together before going to work. I raced home from my job to try it out, so excited to finally have a mini-whirlwind on my side of the bed to stave off the humidity in the armpit of summer. But when I switched it on…Listen, the air power isn’t the problem. It is pretty comparable to the Old Faithful, what IS the problem, though, is the fact that the back fan guard that keeps people from sticking their fingers in the blades from the back keeps coming off. When that happens, the entire fan goes WILD and it stops the blades.Well. I like to think of myself as a person who can reasonably put a plastic fan guard back onto the fan and have it work just fine. Boy, was I wrong. First, you have to shove it on and use a considerable amount of force to do so (and it will still come off within 5 minutes of turning the fan on). Then, you have to finagle the guard to fit into the proper slot on the base of the fan and make sure you are properly securing all sides.So, naturally, as I was putting my considerable 200 lbs of body weight (don’t judge me) behind putting a stupid fan guard back on so I can have my dream of sleeping with the wind gently caressing my sleeping face come true, my finger slipped and was pinched by the DUMB FAN GUARD! (I have a bandaid on it now, but it is swollen and really hurts, thanks for asking)So, while I consider myself to be a reasonable person, and I understand that this fan is not entirely to blame for my now throbbing finger, I am a wee bit salty about the whole thing and I wanted to complain. Please, Lasko, just fix the rear fan guard and stop it from slipping off every 2 minutes. Otherwise, this fan would be a dream come true, but currently, we cannot use it.","isVerified":true,"ratingScore":2,"reviewReaction":"9 people found this helpful","country":"United States","date":1660953600000}
{"reviewTitle":"Always oscillates won't stop oscillating.","reviewDescription":"All in all it was designed to be very low cost , to disassembles allowing the smallest shipping package possible thus reducing shipping cost and designed to be easily assembled. The engineers did a great job to accomplish all of the above. When I assembled it and turned it on I happily found it to move a satisfying amount of air. However the push pull button to engage and disengage the oscillation feature failed after cycling it two times. So it now always oscillates... won't stop oscillating. I would prefer that it didn't oscillate most of the time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"How do you get it to stay up?!","reviewDescription":"This fan got so many great reviews, great price, etc so we got it! We bought this to replace my 20 year old bedroom fan. Noise level is fine, def not as loud as I was used to. It’s oscillates well. All good things. It puts off great air but how in the world do you keep it from sliding down from the raised position at 3am?! That’s our only issue! It’s easy to assemble, we have even travels with it on a recent trip and it was easy to pack up in the car and reassemble. So if you don’t care about being able to raise it higher, it’s a great fan.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Disappointed","reviewDescription":"Lasko fan prices keep going up as the quality keeps going down. Poorly Packaged with unsecured and poorly wrapped motor, poles and plastic parts flopping around freely inside a single shipping carton. Received one incomplete page of instruction (marked as pages 1 -2, 7-8). It was difficult to find the full instruction manual on the Lasko Amazon Seller Website to discover the only complete assembly instruction for the fan is a tiny single image without text, situated in the center of page 3. After I realized the blades have a specific placement (not mentioned in the assembly instructions) I was finally able to correctly assemble the fan. The pole is supposed to lock at the desired height, it does but it doesn't support the weight of the fan -so it keeps sliding down, becoming lower to the floor. I have purchased Lasko versions of this fan several times in the past and am aware that it will cease to function in a few months, even with little use. I will be purchasing higher-end products from higher-end manufacturers in the future. Also, I would not be surprised if the fan I received had been previously returned and hastily reshipped.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Bruh where’s the clips for the fan?","reviewDescription":"I WANT A REFUND There’s supposed to be clips to attach the face of the fan. It’s manufactured with no clips and it came without the screws for me to screw it on, so i currently have no face for the fan. Not to mention that it’s not dual voltage. It’s stated no where in the discretion nor the Q&A bar the voltage on the fan. My previous lasko fan which I had for almost 7 years but slowed down because of age… comes 250V this one is 120V max which makes it unusable unless it will blow unless I use a transformer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Didn’t even last a year","reviewDescription":"I had a Lasko fan from the early 2000’s finally die on me Sept 2023 which lead me to find this one that was basically identical to my old one. I purchased in Sept 2023 and as of August 2024 it’s already dead, so I didn’t even get a year out of it. Disappointed they don’t make things like they used to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Not easy to assemble and power nut  tightening the blade is not working","reviewDescription":"I have purchased many of these fans in the past. first the fan itself is sturdy however the assembly is onerous particularly when the power nut to tighten on the blade is not tightening.  as i don't want to disassemble and return for a nut i am looking for a replacement nut .  the simple answer would be for the manufacturer to replace nut but there is not option to reach them.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Cheap fan, poorly made","reviewDescription":"I see Lasko tried to make this fan easy to assemble by avoiding screws, but overall the plastic was low quality and the pieces didn't fit together very well.The fan speed dial broke and fell out of the mirror assembly instantly. The plastic that should be gripping the internal knob cracked; it's not going back in.And the extending rod doesn't hold the weight of the fan very well and keeps slipping down.The fan grill was also a pain to assemble. Not very intuitive and the plastic was somewhat warped so I had to really stuff the pieces together.Would not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Can slide down at times","reviewDescription":"Bought 3, returned 1. Easy to assemble but the fan slides down sometimes no matter how much you tighten the plastic “ring.” Thought it was the way I assembled it so my husband assembled the other one and it also slides down. Returned 1, would’ve returned the other 2, but we already used them. It is quiet enough, big and has 3 speeds - only issue is sliding down at times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Works.","reviewDescription":"A bit on the unaesthetic side but highly functional and surprisingly light.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great fan","reviewDescription":"Very powerful circulation.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Great fan","reviewDescription":"Works great. Nice and quiet. Good sturdy base. Would highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Very powerful","reviewDescription":"Best fan ever!! Very powerful three speeds GREAT CHOICE","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"It blows","reviewDescription":"Love this fan because of the simplicity and classic rotating design. When I initially turned it on I was worried it was too loud, but I have since grown really attached to the sound. It provides like a white noise background so that there isn't just piercing silence especially useful for falling asleep. Blows a lot of air as well enough for even a living room although I use it in my office and bedroom. I pretty much keep this thing on all hours of the day since I bought it. Haven't had any issues. Don't care for the remote and haven't used it I just keep it on 1 or 2.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1715904000000}
{"reviewTitle":"Good fan for the price","reviewDescription":"Good product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Does the Job","reviewDescription":"The fan was easy to put together. I like how tall it is, the base was a bit larger than I was expecting but not something that bothers me. If you're looking for something to take up less floor space make sure you pay attention to the base size of the fan. Noise level wise it's as loud as your average fan. If you're looking for something quiet this isn't the one for you, but the noise doesn't bother me as I only use the fan at night anyway.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"works great!","reviewDescription":"Works great, it can really cool a room down. Assembly of the product was quiet and easy. It rotates like advertised and has a pin you pull up if you dint want it to rotate. It is a but smaller than I originally thought,  but that's fine because the fan head can tilt up or down. Very happy with this product.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"Super fan, but perhaps not for everyone","reviewDescription":"This fan was a great buy. It's nearly perfect for my own needs, but I'll list its qualities just in case some of them might not work so well for you.It wasn't difficult to assemble. The hardest part was getting the front cage to snap on properly, but even that only took a few tries. And since the cage just hooks together rather than needing screws, popping it off to clean the blade will be a breeze. (Although, there's not much of a hook to those hooks, so I don't plan to pop the cage off any more than I absolutely have to. If those hooks wear down or break, then that's that.) Also, all you need to put it together is your own two hands. No tools needed.It's very powerful. It moves a great deal of air, even on low (I haven't gone past medium yet; I'm afraid it might blow the cat across the room on high!), which is a relief. For two weeks when my A\/C was out, I needed a fan that could cool me off even though the air it was moving was hot and humid. This fan blows with such force that even warm air movement is refreshing. And its force means you can set it at a fair distance and still feel it, but it's also strong enough to blow papers and stuff around if they're in the fan's path, even when they aren't particularly close to it.The oscillator has a wide swing to it, about 90 degrees, which I suppose could either be a negative or a positive. If you want it to swing but still stay relatively contained at a small angle, you may not care for this. On the other hand, it's perfect when you have a small area of cool air (like a new portable a\/c with a fairly puny blower) and want to distribute it far and wide.The cord is fairly short—rather shorter than I would've liked, honestly. I didn't measure it, but I'd guess it to be maybe 6 feet. That could be a problem if you want to use it in a place without an outlet handy, but a cheap extension cord solved that problem for me. (Incidentally, there is no grounding prong on the plug, so you can use a 2-hole extension cord if necessary.)The pole has a decent amount of extension to it; I'd say you can adjust the height by about a foot and a half. At its tallest, from base to motor is (again, this is an estimate) probably 4-1\/2 feet. This makes it pretty versatile; you can stand it on the floor or shorten it and put it on a (large) table. At full length, though, that also makes it a bit top-heavy. It's fine if you leave it alone, but the cat knocked it over when I first put it together and now he's scared of it.It's loud. Even on low it's pretty loud, compared to what I remember my last box fan sounding like. It doesn't bother me at all, but if you're someone looking for a fan for your bedroom, and you need quiet to sleep, you probably won't like this.Seriously, I have a hard time imagining a fan with this small a footprint with as much power as this one has. I wish the cord were a bit longer, like I said, but that's really my only complaint. When the air conditioner died, it was a real lifesaver!","isVerified":true,"ratingScore":5,"reviewReaction":"98 people found this helpful","country":"United States","date":1437091200000}
{"reviewTitle":"Best","reviewDescription":"20 \/20","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Weird Navy Blue Plug","reviewDescription":"Learn from my mistake and look at all the product pictures. I thought I was buying an all-white fan. It has a navy blue plug and the cord is too short. It completely ruins the aesthetic.I'm debating whether to return this or not.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Either poor design or arrived lacking parts","reviewDescription":"I've been using this fan for almost a month now, and it, in the state I received it in, is by far the worst fan I've used. Nothing holds the rear part of the frame nor fan blades in place, allowing minor adjustments to potentially require reassembly of the top of the fan, accompanied by a loud screeching sound if you forgot to turn it off. I was curious if I was sent insufficient parts, so I looked up the model on their website, which didn't offer much more than this page does. Something with the fan provides a link to an assembly video which showcased parts to keep the fan held together, but the fan in the video was clearly a completely different model. This was especially apparent given the frame assembled differently in the video from this fan (Unsure if I'm missing something, but it stays in place when I squeeze the front frame inwards to force it into the rear frame) I personally would advise looking elsewhere for your fan needs, as even if the only flaw was missing parts, you're on Amazon; there's no lack of other options.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Not happy with this fan………","reviewDescription":"I was looking forward to receiving this fan……I AM VERY DISPLEASED ……putting it together was the easy part……first…it makes a humming wobbly sound…I found out that’s because the base is to light….I have had to place two weights on it to cut down on the sound…....second…even the low speed is way to fast….the high speed could blow the snow off the top of a mountain…..I will buy another fan and donate this to GW………👎🏻👎🏻👎🏻👎🏻👎🏻","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Low-Quality Product, Ridiculous Pricing","reviewDescription":"I don't know what Lasko is doing, but their product just aren't nearly up to par anymore. I've needed a fan on to sleep since I was a child, and I've only ever bought this style Lasko fans (because I'm one of those weirdos that believes in product\/brand loyalty). They used to be perfect: inexpensive, easy-to-build, relatively durable, and produced just the right amount of white noise. Before this past year, I only had to buy 2 fans (3 if you count a gift for someone), which lasted 10 years and 4 years, with semi-annual deep cleaning (take apart, clean each piece, canned-air the hell out of it). I'm sure the second one would've lasted longer, but it was broken in a move. This past year, however, I've gone through 3 of these in both white and black (1 from Home Depot, 1 from Walmart, and this here). This one lasted a total of 13 days. Not even 2 full weeks!I found that the problem is that these new motors are garbage. They heat up well beyond acceptable levels, enough that they will melt the plastic parts. For the previous fan I had, the motor overheated, causing the spinning pin to heat up enough to melt and warp the propeller. This one heated up enough that the cover began to melt. Now it just overheats within 3 minutes and slows down to a stop withing 1 more minute. If that's not enough, now they're getting MORE expensive?! What kind of asinine BS is that? Lasko is going to cut the quality of its product, but jack up the price? The past two were both in the $20 range in stores. This one was $30ish. Now it seems to be going for $50+.Moral of the story, DO NOT WASTE YOUR MONEY! Avoid Lasko, as I will henceforth.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1471046400000}
{"reviewTitle":"Awful","reviewDescription":"The WORST PRODUCT I’ve ever bought from Amazon. Comes completely disassembled. No real instructions on assembly. Cheap POS. Returned immediately. Would give it no stars if I could","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Total fail, very disappointed","reviewDescription":"Carton arrived torn & crushed corner, motor & parts rattling around in carton, ZERO packing material., very cheap plastic quality, a screw was driven down through housing of motor so stand\/rod would not fit into socket. Appears to be wrong part, as a flange on it would not fit into lower rod or upper socket. Looks like mismatched part. Totally disappointed in the whole thing. will chose a different brand next time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Did not last a month","reviewDescription":"Unfortunately, the fan has stopped working after 3 weeks of regular use (4–5 times a week, less than an hour each time). Half the time the fan won’t turn on at all, half the time it turns on and dies after running for a minute or two. I have tried different settings, different wall outlets, following Amazon’s troubleshooting instructions, but nothing resolves the issue. Since I did not keep the manufacturer’s box after this long, I have no way to return it. A cheap product, so I suppose I got what I paid for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Cheap quality on every aspect of the fan.","reviewDescription":"The stand\/pole continually slides down regardless of how tight or loose it is. Oscillation will make the pole slide down. The top is too heavy for the stand.The cages are barely snapped close because someone had the brightest idea to build clamps on the back one, but none on the front one, so prayers and hope are the main thing holding it together.The dial thing to choose the speed is incredibly cheap. It will eventually snap off because the speed shift isn't smooth or pronounced enough.The air is better than the older Lasko fans (which I currently have) but everything else is absolutely supbar. Definitely throwing it away because it's completely useless.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Garbage Right out of the box","reviewDescription":"I bout this same exact model about 12 years ago and it was a great fan. this one However was very very cheaply made. The blade kept violently wobbling no matter how tightly secured it was.  (Yes I put it together correctly)The instructions didn't let me know that I had to put the pole through a certain wayAnd the blades were making a weird unnatural wirling noise as they wobbled.  Sent it back immediately!Total junk, don't buy!  You've been warned!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Only lasted a few weeks","reviewDescription":"This came out of the box with the switch being temperamental. The switch quit working after just a few uses and of course it was right after the return window closed. Other than that it was easy to put together and it looks nice. The base seems sturdy and I liked the height adjustment.  This is going to the trash and I won’t be buying another one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Too loud","reviewDescription":"Great fan it’s just too loud.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Loud Noises","reviewDescription":"This is a good fan the only problem is that no matter what level u put it on it still makes noise. Otherwise it blows great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Moves air, but really loud","reviewDescription":"I chose this fan for a bedroom because I have an older Lasko pedestal fan in my bedroom that I like. I thought this fan would about the same, but it is not. This fan is strong and loud. I initially placed it in my living room and turned it on to the lowest setting, and I thought maybe it was actually on the highest setting. Double checked, and nope, levels and 2 and 3 are much stronger and louder. I then moved the fan even farther away, and I still had to turn up the volume on my TV. I then placed it side by side with my old Lasko fan and compared the two; this one is stronger and louder on the lowest setting than my old one is on the highest setting. This is going to be way too loud and too strong for a bedroom. I’m not pleased, but I don’t want to go through the hassle of disassembling it and returning it. if you want a upping tornado by your bed, then this is the fan for you. If you want a soft, quiet breeze to circulate air in your bedroom, keep looking.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652486400000}
{"reviewTitle":"Very powerful but loud","reviewDescription":"Very loud, vibrates the floor and doesn't move very fluidly. Kind of jerky movements","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Cheap but works","reviewDescription":"It's a bit on the noisy side and there are no screws every thing is clipped together so slight rattling I expect it will last 1.5 years but for the price the quality is acceptable 👍🏽","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Stopped working","reviewDescription":"Loved this fan until tonight when it just stopped working. Less than a month after getting it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Works great but is loud - no remote","reviewDescription":"Easy to assemble but was difficult to align the logo. I like that the fan guard is plastic as it will not rust (why I picked this fan). It does not have a remote so I put a z-wave switch on it. The lowest speed puts out a lot of air but also makes a lot of noise.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Eh it's okay","reviewDescription":"It works amazing but the base is not made the best, my extendable metal rod doesn't seem to quite fit in to the hole on the base of it  that's why I'm giving it a 3 starLooked at the bottom of the base and the bottom of it was crappy plastic and I had to get a adjustable hose clamps and fix it myself","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Not a fan of it","reviewDescription":"I had an older version of this model, which I loved.  I had it for about 3 years until it began making an awful sound.I figured I would buy a new one since I loved the old one so much.The new ones are sub-par, at best.  The new \"clam shell\" design to put on the fan protecting grills is dumb.  Having to put one inside the under, under \"tabs\", is for 1, a pain, and 2, both of the new ones I had (I have since returned both) have not matched up correctly, leaving \"Gaps\" in the protector, and not being totally secure.The older version I had, you clipped the front over the back.  The newer ones, you clip the front under the back.Also, the main reason I hate the new fans is that they generate a high pitched sound when on medium\/high.  This high pitched sound wouldn't be so bad if it was consistent, but it is more akin to a haunting breeze.  The high pitched sound isn't always there but it comes and goes.  It is rather distracting when trying to relax and sleep as you hear the whooshing of the fan, and then the high pitched sound comes in for a few seconds then goes away.  It is very distracting for me personally and has kept me from sleep.I would recommend not getting this fan.  I wonder if the reason they are on sale now is because many people are returning them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1596499200000}
{"reviewTitle":"Good but could be a lot better...","reviewDescription":"Good but the motor vibrates and hums loud.Very annoying if you trying to relax or sleep at night and the fan is on low. I expect to hear  a lot of noise  due to the amount of air it's putting out and no other uncessary noises. Two the height adjustment nut is cheaply made of some kind of hard hardplastic instead of metal like the rest of the pole. I crack mines by accident . Now purchasing another part due my to my personal mistake. Overall it's a really nice fan just be careful when handling the parts they are very fragile and can easily break or get damaged if  they are not handle carefully. Three stars due to the amount of air it puts out on all three speeds including low which is really good. Otherwise it would've been 1 or 2 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683417600000}
{"reviewTitle":"Loud, but surprisingly effective","reviewDescription":"So let me just preface everything by saying for the price, this is not a bad fan. It's ability to move air, in my opinion, more than makes up for the noise. When I first got it and set it up, I was impressed with just how much air this thing could move. It wasn't until the following morning when I went to go turn it off that I realized it was only on it's lowest setting.Pros:AIR FLOWAs mentioned above, this fan moves air and it's effective in doing so. Even the lowest setting is stronger than the high settings on many fans I've owned. If you need strong air circulation in a small room, this fan will accomplish that.LIGHTWEIGHTSince the materials on the fan are aluminum and light-weight plastic, the entire fan is very light and easy to move around. It has a pretty wide base (20\") to keep it from blowing itself over.ADJUSTABLE HEIGHTThe height can be adjusted using a twisting lock on the pole. Since the fan is so light, you shouldn't need to worry about the fan slipping down over time.EASY TO ASSEMBLE\/CLEANThe whole fan arrives in pieces, so you do need to put it all together. The fan comes with an instruction manual and takes about maybe 5 minutes max to assemble. No screws, bolts, hex keys, etc. required. Also makes it really easy to clean this fan if it starts to collect dust, pet hair, etc.Cons:NOISEWhile not as loud as a metallic industrial fan, this model definitely makes some noise. The lowest setting isn't too bad, but the highest setting can be pretty loud. Easily one of the loudest fans I've ever owned. If you work at home or are using this in any area where you're making calls, I would not recommend having this blowing in your general direction.QUALITYThe quality of the plastic in the build is somewhat mid. The guards on the front and back of the fan are made of a thin and flexible plastic which can easily be knocked out of alignment and \"unsnap\" which could become an issue if the fan is on. Don't expect this thing to be able to take hits.LIMITED VERTICAL RANGE OF MOTIONFor a standing fan, it lacks the ability to be angled downwards. It can point at an upward angle, but if you need the fan to point anywhere below it's default setting, you'll need to lower the height of the pole.SHORT POWER CORDThe power cord is pretty short, so unless you have an extension cord available, this fan will need to live fairly close to the outlet.Overall:It's a powerful fan and it won't break the bank. If you just need a decent fan that's going to circulate a lot of air in a room very quickly without spending $80+ on a higher end model, this is a good option.","isVerified":true,"ratingScore":4,"reviewReaction":"116 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"High speed, low cost!","reviewDescription":"We bought this fan for my sons room. I love the fact that it can be adjusted to different heights! Thus far it has worked great in his room, no issues with power level or speed, it's very durable as it's been bumped down a few times. My one problem is when it's on level 3, there's a bit of a clicking noise at the base, we have yet to figure out what causes it. But my son doesn't mind.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Lasko replaced my original fan.","reviewDescription":"ORGINAL REVIEW: I assembled fan according to directions, then plugged in.  The fan worked for 5 minutes or so, then stopped.  Very disappointing.  I disassembled it and reassembled it according to directions to make sure it was put together correctly.  It was.  There is something wrong with the motor. I can't remedy this through Amazon, but have to contact Lasko directly and wait for a response.  I am willing to change my review (which by the way should be zero stars, not one) depending on the response I receive from Lasko and how quickly I receive it.  Fingers crossed.REVISED REVIEW:  After a few steps (which seemed like a lot but made sense) and several email communications, I got a new fan.  Life got in the way and I haven't assembled it yet - hopeful that it will work just fine.  My 4 star review  is more for the way the issue was resolved and how relatively easy the process was (despite having multiple steps).  If I have any issues once I assemble the fan, I'll revise again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Packing tape after setting height","reviewDescription":"Had a black one of these that lasted 5-7years. For 44 dollars that is ok with me. Bearings on the old one dried out and became difficult to turn. This new one is the white model and it has a habit of slipping when touched. I finally, after a week of moving it, I used my packing tape to stop it from moving. My alternative was self tapping screws I have from the pool fence.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Love these fans","reviewDescription":"I love that they are light weight. Easy to put together, no tools required. I often take mine apart to clean so it makes it so much easier. It blows really well and I'm happy with it. If  I was to complain about 1 thing it would be that sometimes it slides down, it doesn't stay up that well even when it's tightened. My last one lasted 15 years so hoping this one will do the same.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Wish I could give it 5 Stars, but...","reviewDescription":"Wish I could give it 5 Stars, but... the plastic nut wont hold the stand in verticle place, it always drops.-- Everything else is FANTASTIC, it's Lasko, their qulality is typically \"average - above average\" It's only been a few months, but I keep my fan on ~16 hours a day in the summer (8 hrs day, 8 hrs at night to help sleep). These things will last a LONG time, i even researched others, and many people keep these fans on 24\/7 for MANY MONTHS. I dont do that, but that's pretty epic. --- Other complaints I've seen is that the Stand wont \"lock\" into the BASE of the stand... just give a forceful push REALLY hard, you'll hear a \"click\" and it'll eventually lock-in. Good luck and stay cool!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great but could be better","reviewDescription":"This is a very nice fan. It really puts out a lot of air. I like that its stand is adjustable in height and that it has an oscillating option and you can tilt the head up or down. My only complaint is that it doesn’t have a remote control. For some reason I thought it did when I ordered it and was disappointed when I realized it didn’t. It would make this a perfect 5 star fan. But otherwise I’m happy with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Assembly instructions confusing, but watch Demski video.","reviewDescription":"Granted that I tend to struggle with assemble-it-yourself items, I was completely frustrated when trying to assemble the fan portion. The illustrations (no verbiage) in the manual were no help in terms of seeing exactly how the pieces (especially the large plastic \"nut\") fit together. Thank goodness for Nicolas Demski's video -- he shows and explains precisely how to do this. The fan itself is wonderfully powerful even on the low setting: exactly what I wanted.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Works well, but flared Pipe didn't fit at first","reviewDescription":"We got this fan assembled... eventually. The pipe that supports the fan to the base wasn't assembled properly so we had to figure out how to take it apart and fix that before the fan could be mounted to the pipe. If the top of the skinny part of the pipe is flared, then you know it was assembled backwards or essentially upside down (the fan motor cannot attach to this flared end).Fixing the situation is simple, with the pipe detached from the base, loosen the nut until the small pipe comes free from the nut and the larger pipe, then you take the small pipe and shove it up the larger pipe with the flared end of the small pipe facing down. Once the small pipe emerges from the grip that the nut usually covers, you tighten the nut back onto the pipe and then you attach the base and the fan\/motor as instructed. No return needed with this situation.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"I like it","reviewDescription":"This fan is powerful. I really like the way it looks.  Assembly is very easy.  I just don't like the way the fan blade cover snaps but maybe it's just my unit. It seems not quite secure but so far it has not presented any problem.  Overall, I would still recommend this fan and I am still happy with my purchase.  I gave it 4 stars because there is no option for 4.7 and it is not perfect to give it 5.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Fan","reviewDescription":"I was so excited when I got this fan my bedroom is in the back of the house and stays extremely hot in the summer so again I was so excited I opened the box went to put it together and it was missing two pieces and I ordered it like two months ago but have never used it because the weather wasn't hot enough until the past few weeks. Just because I didn't open it immediately and use it I can't return it. And it's still in the box the same way it was when I got it, what a waste of $70.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Bad Quality","reviewDescription":"I bought this as a replacement to the same model I had for 10 years that finally died and, as I feared, quality control has dropped precipitously in the last 10 years. First one I got I noticed blemishes all over the exterior as I unpackaged, discoloration, scratches, etc, but I had been without a fan for weeks so I decided I could live with it. As I was assembling it I had difficulty locking the back shroud in place, the locking piece would tighten and then slip out of the threads, but I got it to a point where it seemed somewhat secure and moved on. Then as I was putting on the front shroud I realized I could snap in 3\/4 of the shroud but 1\/4 was insecure and if I tried to secure it fully it would fall off, so I decided I'd live with it being 3\/4 secure and hope for the best. What I couldn't live with was the loud hum from the motor. The fan is loud, I love that because I use it to sleep, but the hum is overbearing, and didn't exist in the older fan. Disappointed, I turned it off and ordered a replacement hoping for the best. Received the replacement yesterday, opened the smushed and shoddily taped together box (not a good omen) to find the same blemishes, scratches, etc. Didn't even bother assembling it. Disappointed, I'll be returning and going back to square one for my pedestal stand fan needs. Don't recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1680393600000}
{"reviewTitle":"Would not buy again.","reviewDescription":"First off, the box arrived with no attempt at closing the box. It was the product box with a label stuck on it. The UPS woman was struggling to keep the bulky box closed as she carried it to my door. Luckily, nothing seemed to be missing but everything was covered in dust.Putting the fan together was a test in patience and I love building things.Pros: It has excellent wind speed. I do love that about it. It is fairly quiet.Cons: CHEAP quality. I have always loved this brand but if this is what they have reduced themselves to, I may never buy from them again.The trial of patience came in when trying to get the pole to stay up. First, I could not get the stand to stay in place, it kept tilting. After quite a bit of grunting, pushing, and fussing, I did something magical and it slipped into place, but is still wobbly. Ok...let's put the fan head on. Again with the wobbly. Not good, keep going. The pole would not stay up. I had about reached the conclusion that I was going to have to use Gorilla glue to cement the pieces together. Finally was able to get it to accept that I wanted it to stay tightened. Now, back to the head. I put the motor on, made sure it was going to tilt like it should. So far, so good. I got the fan assembly together with a little pleading as the last clip, snap in place of the front cover did not want to work. Finally!! Success! I worried about turning it on for fear that the vibrations would cause the pole to slide down to the lowest position, again. It has been running for two hours now and so far, so good. I still may have to Gorilla glue the parts together but I am pleased that the power of the fan itself is good and it is not overly noisy.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1590796800000}
{"reviewTitle":"Cheap junk","reviewDescription":"Cheap parts did not want to go together due to manufacturing defects, had to shave plastic burrs off of the fan cover just to make it fit together.Very lightweight plastic is used on everything, it is not even strong enough to support the fan motor, causing it to fall over very easily. They tried to make up for this by making the base extremely wide in circumference, making it easily stepped on.If you do step on it, it will surely break the base of the fan, as it is very cheap, thin, lightweight plastic.The fan is LOUD and puts out a weak stream of air compared to our old stand up fan.This fan is like a cheap Wish knockoff of a stand up fan.Don’t support them by buying this cheap junk, I bought two, and I will be returning the one I did not open.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Cheap construction, loud whine, can't point down, and not worth any price","reviewDescription":"I bought this fan on the strength of reviews here on Amazon. Unfortunately, it fails in almost every regard, and even if it means saving ten bucks, this is not a product you want to own.1.) The construction is poor - The base of the unit is not fastened to the shaft in any way, such that every single time you pick up the fan, the shaft will slide right out of the base and leave it lying on the floor. More importantly, when you go to loosen the heightening nut, the entire shaft will rotate with it. So you need one hand to hold the lower shaft in place, one hand to loosen\/tighten the nut, and a third hand to lift the upper shaft into the correct position. Good luck with that.2.) Irritating, high-pitched whine - I assume any fan will make a fairly loud, droning noise. In fact, that is often desirable, as white noise for assistance with sleep. This fan makes that noise; however, it simultaneously makes a louder, high-pitched engine whine. This happens at all three power settings. I have never heard another fan make this noise, and you will likely find it highly irritating to be in the same room while it's running.3.) Can't angle downward - the head of the fan can be tilted to point up toward the ceiling, but it can't be angled downward toward the floor. This might be an uncommon use case, but it means you won't be able to use the fan to dry a wet spot on the carpet or cool you off on the floor working out. Again, I have never purchased another fan that had this limitation.In conclusion, this is a cheap, poorly made product that will be more irritation to you than it will be useful. The only positive is the decent stream power, but I have much smaller fans that are equally intense. I strongly recommend finding another option.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1526947200000}
{"reviewTitle":"Don't bother","reviewDescription":"For the amount of money I spent,  I would expect better.It makes a loud whistling sound because the cheap plastic blades are deformed.  I'd planned to use it for sleeping but I guess not.Lasko used to be quality, those days are gone","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Very Cheap - Makes Awful Humming Noise","reviewDescription":"I didn't open and put this together till after the return window.It's super cheap, not sturdy and makes an awful humming noise.Super low quality and wish I didn't waste the money. Shame on this company for making such a cheap fan, awful","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Ordered New, Received a Used Product","reviewDescription":"I ordered this fan new- and it came in a box, wrapped in plastic- but it is obviously a used fan. The parts are dirty and some have blue crayon markings as seen in the picture. I would return but it’s huge and I’m hot.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Garbage","reviewDescription":"If you’re here because your previous lasko fan was great, just move along.  I had one for 20 years and then just thought Id get a new one since it was old. I went back to the old one. This fans height adjuster does’n’t work and the fan keeps sliding down over time. It makes the most annoying vibration noise and a piece of the fan blade already broke after a month. They clearly cheapened their quality.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Absolute crap","reviewDescription":"Should have believed the bad reviews - it's all made of cheap plastic - I can't believe how lightweight these pieces are. Was sent with 2 missing parts so it can't even be put together.Don't bother. What a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"We truly live in an age where garbage is produced and legally sold to consumers","reviewDescription":"What a pile of trash. Front tightener piece which holds the fan blade in place doesn't even tighten because of manufacturer defect. Fan still works but I am sure the fan blade will come loose after some use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Don't waste your money POS!!","reviewDescription":"Had this POS just over a month and it has quit working, making loud noise before it started smoking and quit.  Go to Wal-Mart or Target!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Broken and doesn't last","reviewDescription":"This was the first fan I ever ordered for myself back in 2017 and it was AMAZING lasted me about 5 years. When that one gave out I ordered again and when it arrived I was suprised by how much bigger it was, I didn't mind that, but I immediately noticed the nob to control the rotation had been broken and when I tried to get them go send me a new one they wouldn't. SO I stuck with this one. Not only did it sound like a literal plane was landing everytime I turned it on (even on the lowest setting), it didn't even last more that 13 months. A piece on the inside just completely stripped itself as it spun over the years making it now completely useless. I am very disappointed in the quality of the newer fans and the \"customer service\" I received when opening my package to find an already broken fan.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"Dangerous and Smelly","reviewDescription":"The fan is dangerous. The front grille doesn’t stay on sturdy. You can easily pull it off or the air tension can blow the grille out. Blows nice and cool air but it emits an odor of cheap plastic. It’s noticeable enough that impacts my sleep. Very cheap materials and build for the price. Fan doesn’t stand upright and falls down to the base. Will be throwing this away.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Returned for multiple reasons","reviewDescription":"I own other Lasko fans and love them. This one is a complete dud for those who say it isn’t loud that is not the truth.  It’s as loud as a tropical storm!  It randomly slides down to the lowest level because the height adjustment just doesn’t work and the lack of the ability to adjust the amount of  rotation are both deal breakers for me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"AWFUL FAN!!😠. UPSET with LASKO!","reviewDescription":"I'm trying not to be as angry as I really am.  But I am angry & disappointed!!  The front grill does not snap on completely; It will not stay extended to the height I need it... the tightening cuff doesn't hold with the heavy weight of the motor\/fan; & to top it off even on 'Low' setting it is VERY LOUD with low air flow.  My neighbor across the hall knocked & wanted to know if I was going to be running that loud motor for long...ACROSS THE WIDE HALLWAY!!  I showed her that it's the fan I just bought.🙄. It isn't worth $4.00 let alone the $45.00 I paid for it.  I'm 70 yrs old & the time it will take to take apart & ship it back to Amazon would be a nightmare for me.  I'm throwing it away!😐😞. Waste of my $$$ & time.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Could not assemble","reviewDescription":"Could not assemble,  not stable,  pole would not tighten,  piece that is supposed to hold the fan blades would not screw on","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Not able to fix my fan","reviewDescription":"Product is damaged so i am not able to fix my fan waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"the fan blades come loose","reviewDescription":"I bought one of these and was reasonably happy with it, so I bought two more. Within six months the screw-on module that holds the fan blade on the spindle came loose on one. Then it happened with the other two in quick succession. The screw-on modules will not tighten, as if the threads are stripped. I will never buy another one of these.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"turns off randomly...","reviewDescription":"bought 2 and both of them shut off randomly, completely useless cheap garbage","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Loud fan","reviewDescription":"This fan has a very loud hum when it’s running.No remote included but that may have been my mistake in ordering but is is still loud","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Nesecita mas control de calidad","reviewDescription":"Este es el segundo que compro de esta marca, el primero todo perfecto pero el segundo no tiene la misma velocidad que el primero, 😔","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Motor burn After 6 months of purchase","reviewDescription":"Very disappointed, the fan really works great, however after 6 months of purchasing the fan stopped working.  I would not buy it again 😒","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Second time buying fan & I just had to get a defective one just had to be something wrong with it.","reviewDescription":"Second time buying the fan But I just had to get a defective one or something because something had to be wrong with it!!! It doesn’t stay up as much as I tighten it, it slides right back down so for wanting it because it’s nice and tall. It’s doesn’t get tight enough so I ended up with a short little fan!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Not understanding all the positive reviews ...","reviewDescription":"The pole that holds up the motor is very poorly constructed. It doesn't tighten enough to hold the extension up with the motor on it. The motor does not fit tightly on the top of the pole and shakes around and makes a lot of noise. The pole does not fit tightly into the base so it wiggles around and makes a lot of noise. I opened it, I put it together, I ran it for about a minute and it all fell apart. Put it right back in the box and returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Really cheap","reviewDescription":"It does the job, but its all plastic. Shroud constantly falls off. Height adjustment is pretty much useless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Se cae","reviewDescription":"Es bueno el motor pero la base no ajusta bien y en medio de la noche se cae","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Loud Fan!","reviewDescription":"This fan works at moving air. Easy to assemble. However,  it is NOT made for a room where there is a need for quiet. Even on it's slowest speed it sounds like a industrial fan. So, great fan for outdoor covered patio, garage, any room where holding a conversation or being quiet isn't important.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Would not buy again","reviewDescription":"This fan does not push a lot of air, in my opinion. I would not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Annoyingly Loud","reviewDescription":"The fan puts out a lot of air, but it is incredibly loud and creates a low ringings\/chiming sound. It’s almost like hearing a siren from a mile away. It’s very faint, but it’s there, and it’s driving me crazy. Unfortunately, I’ve already thrown all the boxes away, so I’m stuck with it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Love this fan","reviewDescription":"It’s easy to use. Straight and the isolating feature work perfectly. Love this fan.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Great Fan","reviewDescription":"As a couple who has to have a fan on them at night to sleep, my husband and I are a little picky when it comes to fan shopping. Our several-years-old fan finally quit on us, so we turned to this one. It has been great and definitely keeps us cooler than our old fan. It would be nice if it came with a remote, but that doesn't really bother us either way.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Got me through 2 weeks during my move this summer","reviewDescription":"It works really well very cold felt like my ac was on light weight I would highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Happy with this fan","reviewDescription":"The fan works good and covers a good size area especially on rotating mode. It cools nicely. It was easy to put together. This model did not have a remote but I'm still not too lazy to get up and turn it on or off😂 I appreciate the 3 different speeds. I would recommend this fan for sure!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Powerful","reviewDescription":"Very quiet, and pushes a lot of air around","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Works great","reviewDescription":"I have no complaints, I use it to blow welding fumes out of the garage and out of my lungs.Works great 3 speeds, light to move around","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Good value for money","reviewDescription":"It's big, not too loud and has a good air flow. Besides, it's very sturdy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Big fan, nice size","reviewDescription":"Sits on nice, stable pedestal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"I’ve bought three!","reviewDescription":"This fan is easy to set up and easy to disassemble for cleaning. With a house of 3 animals I wanted a fan I could easily clean.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Tall fan","reviewDescription":"I didn't think about the fact that it wouldnt be put together. But it was easy and only took a few minutes. I use it to draw the cool air conditioning into the rest of the apartment. This fan has a large oscillating top.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"It’s a great fan w\/only one little issue","reviewDescription":"This is a GREAT fan , I actually had a couple of other fans same size but different manufacturers that cost a little more than twice the price of this one and performance wise this fan beat them hands down. I liked this fan so much I purchased 3 20 inch models  and 2 18 inch models ( black) . I didn’t get the ones with remotes b\/c I know they’ll get lost in the house. So, over all fantastic fans , not too loud , easy to assemble . My only issue is that after a while or so the pole tends to slide down so I am constantly having to adjust them to the proper height . I had owned one of these fans a few years back ( I still have it) and when this issue popped up after 2 months I thought it was an anomaly. Eventually it got so bad I ended up securing it to the height I wanted by using super glue on the height adjuster .  This go round it did not take months , it took a few weeks  Two  of the 20 inch models are already sliding down  as well as an 18 inch one . I’m about to order some glue just in case it becomes a daily battle .  I like the fan, the breeze is strong and other then the sliding problem it’s well made and well worth the money . My fans need to be dependable and good living out here in Arizona.","isVerified":true,"ratingScore":4,"reviewReaction":"28 people found this helpful","country":"United States","date":1655769600000}
{"reviewTitle":"Exactly what I needed.","reviewDescription":"I bought this fan to test whether or not I could manage tent camping in the summer (South Carolina).  Took it on my last trip.  It was the first thing I set up upon arrival, and the last thing I packed when it was time to leave.  The heat index was in the high 90s all weekend.  On high, outside, this fan kept me plenty cool and kept most of the bugs away all weekend.  I moved it in the tent at night and I slept comfortably with it on the low setting.My bedroom is very hot, so I set it up when I got home.  Still great, but noticeably louder indoors than out.  I like some white noise when I sleep, but even on low, it's close to the line.I like it.  I'll use it as long as it works, and would look at Lasko first if I ever need to replace it.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Powerful but noisy.","reviewDescription":"I was hoping to like this one. If you are looking for a very strong fan and don’t mind the noise, this is it. I can see using it to quickly dry after a flooded basement or to quick aerate your home after it being vacant, for example. I would have kept it if the lowest setting was quiet, but even the lowest was too much noise for me. Also, the fan grill is plastic and I prefer metal. The motor seemed heavy duty though, so it’s probably a good quality machine. It’s nice looking too and lightweight enough to easily move. The base is nice and sturdy. To summarize, this is a great fan to keep in wet prone basement for quick dry, quickly aerate musty home or cabin and large homes where you can keep fan farther away so you can’t hear it as much.  Would recommend but not for me.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Good quality for reasonable price","reviewDescription":"It's all plastic. That's okay, but no weight in the base to prevent from getting knocked over. Blows a big rush of air at thee speeds. Not to loud with a low hum to comfort at night in bed.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"They need to redesign the assembly - but very reliable.","reviewDescription":"It's a fan.  I needed a tall one and this was at the height I needed, almost.  Assembly required.  No worries, I assemble a lot of stuff and am used to tight spaces, tight fits, etc., from working on my cars.Fan works well once assembled - good airflow.  I wish they manufactured this with the extension rod being able to go up maybe 6 inches taller.  I can deal with that, it's the tallest fan I could find.My issue is the assembly - super easy, until you get to placing the in-front of the blade guard.  It's a \"snap in\" piece according to the instructions.  Good luck with that.  Instructions indicate to snap in from the top to the bottom.  That was a RIDICULOUS fiasco.  It took me 40 minutes to finally get the front guard attached - after breaking off one of the snap in tabs.Note to manufacturer.  That is a horrible set up.  Go back to the drawing board on that one.  Rework the mold or whatever.  Include some small phillips screws so you can easily screw in the front fan guard section by section to the back piece.  That way you can screw in one area at a time, have it secured and move on to the next screw.If I ever decided to try to take out the front guard to clean the fan and guards, well I wouldn't do it.  I'd throw out the fan and buy a different brand easier to assemble.  It's too hard to get all the tabs in place at one time with your current set up.If it wasn't for that I'd rate this much higher - though I've only been using this a few hours.  Outside of assembly\/taking fan apart with those plastic tabs, it does what I needed it to do, wish it was a bit taller.2024 Edit.  Despite the assembly issues I'm very happy with this.  The product lasted almost 5 years.  Probably would have gone longer but I messed up and jacked up the cord.  It was used many, many hours.  Basically daily for 8 hours or so straight probably about 270 days a year.  Well worth the money spent.  I'm left debating whether to buy a new one or find a different option without the assembly\/easy cleaning issues.  I may just suffer the assembly again, cleaning hassles and just buy another because I never would have expected thus thing to be so reliable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1567209600000}
{"reviewTitle":"Strong But Loud","reviewDescription":"I saw all the reviews saying that this fan was loud, but literally every fan review says its loud, so I will give my qualifications before also telling you that it's loud. I always have fans running because I'm always overheated and I have many fans, old and new. The fan I had in my living room before this one was a standard box fan where the first two settings were fine and the third setting had me raising my tv volume a notch. This fan's lowest setting is both as loud and as powerful as the box fan's top speed. While I love how much of a hurricane this thing makes, I now perpetually have to have my TV louder. I live in a house with a fair amount of space between me and my neighbors so it's not life ending, but if you have some sort of issue with fans making sound, expect top speed sounds.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Not worth the price but good fan","reviewDescription":"I bought this fan used and I’m glad I did because this is worth $25 at best. It was easy to put together but I had missing parts. I do like that it’s a loud fan tho to drown out other sounds. I would say it’s a good fan","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Nice unit but needs better instructions","reviewDescription":"You need to assemble. Everything is obvious except the hub that holds the fan in place. It screws on counter clockwise. It took me a while to figure that out. Instructions would have helped.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Regular.","reviewDescription":"La velocidad mas baja es muy fuerte, por lo demás bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Great air movement, but device could use a free upgrades","reviewDescription":"I love how this fan moves air, it’s powerful and great for cooling! But it would be better if it had a handle for picking it up and moving it, most of my other fans have handles near the top center of the fan blade cage area. I move the two fans I bought often, and it would be easier with a handle. The second upgrade needed is a better attachment to the base, when turning the cuff for adjusting height we have turned the connection to the base as well by accident and the fan detached from the base. I wish the head tilted down, but to achieve pointing the fan lower I need to raise and lower it using the adjustment cuff on the pole, which would be fine if it didn’t require so much work (tilting down is less work) also moving it up and down causes the base to detach as noted above … But the fan speeds are great, good cooling. Coolest fan we’ve got.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Loud","reviewDescription":"Bought it to replace the old lasko fan I had in my bedroom but it's way too loud. The base seems like it's designed to amplify noise into the floor and the blades buffet pretty bad giving it a pretty loud chirp\/whistle even on low. Over all construction is pretty wobbly too. It would make an ok shop fan bc it does move air well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Didn’t last at all!!!","reviewDescription":"I bought this end of May 2023 and it’s already dead, like won’t turn on dead. I keep my fans clean so it’s not on me, but this is unbearable to be left without a fan in 90° weather.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Terrible, insufficient assembly instructions!","reviewDescription":"Terrible insufficient assembly directions. I like Lasko products and have been extremely satisfied in the past, and I can’t say this isn’t a good fan, but the parts descriptions are vague and inadequate thereby assembling the product is quite difficult. All of the parts are primarily plastic with only the center support pole being metal making the fan light and flimsy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Good speed\/airflow but the extending bar CONSTANTLY collapses","reviewDescription":"Overall a decent fan but as expected of this brand, the fan has serious quality issues. The extending bar constantly collapses (leading to a loud, startling noise at random times) under the weight of the unit and the fan leans a bit forward.We ordered two, but I'm leaning toward returning the second\/unopened one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Not so good.","reviewDescription":"I have an old one that I had for about 13 years and the motor finally went out on it, so I saw the same maker on Amazon and ordered, but the fan keeps dropping. The knob is not keeping the pole tight to stand up. It drops down in the middle of the night and it’s kind of scary to hear  loud bang at night. overall I’m gonna keep it because it’s getting hot, but I don’t think I’ll be buying again, and I don’t recommend .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"It was missing a big plastic nut","reviewDescription":"This missing big plastic nut called a \"spinner\" can't be replaced by any standard sized nut. All I wanted was the missing part but the system required me to return the entire fan so I went online and ordered the part elsewhere for $15. Wish there had been a better way to handle it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"The adjustable  height bracket broke the first time it was adjusted","reviewDescription":"The fan itself works pretty well & is plenty powerful. However, it is made up of all plastic pieces, which, clearly are not very durable. So, my review is mixed. If I could still raise the height, I definitely would give more stars....But being unadjustable after one week of use....just be warned.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"This fan is made of cheap plastic. I had to hot glue the tub into the base to make it stay. The nut to tighten the extension pole does not hold all that tightly. When I put the fan on the ground to tighten this nut and stood the fan back up something broke off, I have no idea what it was. It’s a very good thing that I need the fan inspite of the other steps I have taken. Very disappointing !!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Works but...","reviewDescription":"I wouldn't buy this brand again. I ordered 2, and while they both work they are pretty noisy and also both slip easily down despite being fully tightened.One of them also arrived somewhat broken, and the return process was so difficult I ended up keeping it. Overall, don't recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"number switch","reviewDescription":"..brand new and the the speed switch is messed up..co ordination on the numbers is inaccurate. The dial does a 360 clockwise.. .it does not line up with the numbers,only 2 of the 3numbers work and three if you finagle it. Laskco workmanship is not what it used to be.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Cranks the air out, but NOISY","reviewDescription":"Though the instructions left something to be desired, I did get this fan assembled and it cranks out the air, even at the lowest setting. However, it's pretty noisy. Not a big deal if you like the white noise factor for sleeping (I do), but less appealing when you're watching TV or working in a hot office and fail to hear approaching people.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Ridiculously strong wind","reviewDescription":"The wind speed on this fan is almost laughable because of how insanely strong it is! I mean, if you're looking for a normal fan to have in your living room, this is NOT the one for you. The low setting on this fan is 2-3x more powerful than the high setting on my other floor standing fan... It seriously feels like it would be more suited for a garage or a warehouse. Lol I just can't believe this fan is so crazy... I'm worried it will triple my electric bill. Lol It DEFINITELY works well... If you like a lot of wind and fan noise- this is perfect. If you want something gentle, do not get this. Lol I'm giving it 4 stars bc I feel like this fan advertisement should've been more clear on how strong the winds on this are.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Works well, pushes air well","reviewDescription":"Works fine. Moves air quite well, but makes enough air\/wind noise that I dont want it on past level 1 while working, watching tv, or having conversations.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Works for the price..","reviewDescription":"Is this the best fan ever, absolutely not. Sometimes the height extension pole gets loose and it slowly falls down. Sometimes it doesn't want to stay pointed in one direction or the wind will move it (mine is used outside on a patio)But for the price of this fan, its fantastic and gets the job done. I love it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Nice fan","reviewDescription":"Well made for a relatively inexpensive fan. Moves a lot of air quietly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Good but","reviewDescription":"This fan is noisy. I don’t like quiet fans but this is a little over the top.  If you don’t mind extra noise then you got a good fan.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Moves a lot of air but is fairly loud","reviewDescription":"First off, this thing moves a TON of air. When I first turned it on I was sure it was on the highest setting, nope, it was the lowest setting. It's also pretty light weight and really easy to move around. Five stars for air movement and weight. The reason I gave it four stars is because it's fairly loud. We have a t.v. set up in our garage and needed a fan to keep air flow moving. We had to set the fan in the back corner of the garage because the noise level (on low) was loud for watching t.v.. I actually wish there was a lower setting so we could have it closer to where we are sitting. Overall this is a good fan that moves a lot of air. I just wish it was quieter.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Good standup oscillating fan.","reviewDescription":"This is a good value product for its price. One big drawback is the plastic used in the blade covering. If it falls over, you may end up with a pile of plastic.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Came stained","reviewDescription":"The box and tape looked perfect like never opened but when I did there was a stain on the front fan piece, one step of the instructions was already done and the instruction book was ripped.  Looks like this was returned and repacked.  I would have returned it because of the stain but kept it because I was desperate for the fan.  That spot and a few others got lighter with some soap and water.  The video to install was more helpful than the instruction book.  Works well.  Good height for a living room.  Level 3 is a bit loud but 2 is good and works well for a big area.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Nice fan, good air flow and white noise.","reviewDescription":"This is the 3rd of these we've purchased.  We initially bought 2 for bedroom fans.  They run 12-24 hours a day every day.  We bought a 3rd when one died after 26 months.  Given the price and time running, they have been worth it.  The fan is simple to assemble, no tools required.  The air flow is excellent and we like the amount of white noise they provide when we sleep.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Buy A Better Fan","reviewDescription":"Utter garbage. Cheapest quality fan you will ever own. Be prepared for the motor to hum like crazy and the poorly molded fan blades to whistle when in use. Save your money and buy a better fan.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Pure trash","reviewDescription":"I wish I could return this fan but I don’t have time before I move.  I purchased for a furnished rental and it’s the noisiest fan I’ve ever had.  It is beyond annoying!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"worst mistake of my life. at least this year.","reviewDescription":"I regret this so much. The nut is missing and another part doesn't even screw on. The parts that are present are so sad and flimsy and pathetic and useless and ugly and stupid, like this is sad plastic like if you remember getting cracker Jack toys once they weren't any good anymore. this is what it's made out of... I could forgive that if I wasn't sitting here sweltering my ass off unable to get this fan together because of missing parts. Will contact the manufacturer who of course is closed because this is a holiday. I am 0% impressed it's only getting one star because I'm banned from giving it negative stars","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"Whistling sound is unbearable. Aerodynamics are bad.","reviewDescription":"Wanted to like this fan. I use a fan in the bedroom for white noise to block out city sounds at bedtime. However this fan has an annoying whistling sound coming from the blades. I’m handy, I assembled it correctly. It’s obviously an engineering shortcoming and a massive design flaw. Will be returning it because almost embarrassing how bad it is. Do better LASKO.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Very poor fitment","reviewDescription":"The instructions call for the fan head to be screwed onto the post, but there are no threads and the fit is loose. It just spins around, making the oscillation useless. Had to wrap some tape around the post to get a snug fit. Not sure what is supposed to be making contact inside, I can see a wood screw poking out from the plastic, guessing it's that. But it don't do nothin.Pushes air just fine, but it's a DIY pedestal situation.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Lasko is now junk","reviewDescription":"What isn't wrong with this thing. The knob to set oscillating broke. It's cheap brittle plastic. No biggie I just won't use that grabbed plyers and have it on manual mode. Picked it up and another piece broke off. The arm mount that attached to the base broke. Again brittle plastic. Okay no biggie I'll use it as an outdoor fan. I adjust the height with the rod twister and it won't tighten enough to actually tighten it. Then the lasko logo fell off as the last hurrah. What a piece of work. I think I'm going to look at 50's era fans. Those were built to last.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1716768000000}
{"reviewTitle":"Defective | Broken","reviewDescription":"I would return this, but unfortunately I ordered it in March and didn’t open it until yesterday. The switch is broken and only works on level 1. It also makes a terribly irritating and loud noise when oscillating. We’ll have to take the loss, but the quality of this fan is subpar at the very best!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"piece of crap","reviewDescription":"I've only had it about a week and the oscillating stop working. Every time I move it the front part falls off and I have to snap back in place. DO NOT recommend. I'd send it back if I still had the packing material. That's what get for trusting that it would work properly.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Bad","reviewDescription":"I own this fan for six weeks, but all of a sudden a very loud noise and seized. Took it apart then put back together. It wasn’t even dirty and still won’t work. Don’t buy this fan and of course it’s like one week after the moment I could’ve sent it back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Update: They work (for a short time). (Don't) Buy them","reviewDescription":"They work great. They are not the most silent fans, as others have said, but that is not what I bought them for. I bought them to move air, and they do that well. I use them to move warm air from my finished basement, where my wood stove is, to the rest of the house and they do a great job. No worn bearings. No weird noises. They just do the job, don't b*tch and work great.If you need a fan and don't, for some reason, need the quietest fan in the world, they work awsome.Update July 3 2020. I bought 2 of these on oct 19th 2019. On both of them, the ring that is tightened for the height adjustment broke within 3 months. It didnt really affect functionality so i didnt bother complaining about it. Today on July 3 i was laying infront of it and the fan randomly began making a loud wobbling noise. When i took the cover off and removed the blade i found that the plastic on the back of the blade where the motor output shaft goes into had completely broken off. The fans have a 1 yr. Warranty through Lasko, the manufacturer, so i decided to contact them. Both the phone number and the website chat say there is no one available to supply support. I would have definitively left a positive review regardless of the low quality if i had gotten good support and the broken parts were replaced; however, i can not recomend a product that breaks within 3 months and when you need to use the advertised warranty, no one is there to help. On top of this. They are now seven dollars more expensive than when i originally purchased them. Would Not recomend.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1580083200000}
{"reviewTitle":"Great fan if you're very hot and enjoy yelling","reviewDescription":"I wanted a fan mostly because I'm one of those people who likes to sleep with a fan running. I did see the reviews saying this fan was loud, but I assumed that just meant \"not silent,\" and as I was essentially looking for a noise machine with blades, that seemed perfect for me. Well gentle readers, this fan is capital-L LOUD. On the one hand it certainly puts out a LOT of wind, so that's a plus, but on the other it's like sitting next to a jet engine. As I mentioned I actually do like sleeping with fan noise, and even I had to turn it off after about 15 minutes because I thought it was going to make my ears start ringing. I think this would be a fine fan if you're trying to cool off a space that is huge and\/or already loud, like maybe a gym or a factory floor or a bomb testing range. But I cannot imagine a scenario where this would be comfortable or useful in a person's home as it's so loud that even on the lowest setting it would be difficult to have a conversation over, or to hear the radio or TV, or to hear yourself think. It assembled easily and as I said it certainly does put out a lot of air. But it won't work for my bedroom, or any other room that I can imagine spending time in.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1650931200000}
{"reviewTitle":"Pole stripped","reviewDescription":"Pole keep going down","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Broke already","reviewDescription":"It just stopped working today. I don't have AC in that room and cannot afford a new fan.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Could be better!","reviewDescription":"The fan feels so nice especially since I have an upstairs bedroom that gets so hot in the summer. However it’s flimsy the part where to twist the pipe that holds it up doesn’t twist in all the way and the adjustable height doesn’t get tight enough and collapses. It also is very loud.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Good fan, but beware the fan guard","reviewDescription":"The fan works great, it's a little loud maybe but that is no problem for us. The big deal is that the front fan guard comes off with any kind of impact, and that is dangerous. You will need to use zip ties on the guard to keep it attached, there are holes for screws but none provided and they are are not shown on the instructions either. However the zip ties work beautifully to keep it on. Just be carefu!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Received with defective","reviewDescription":"Received with broken knob as per photo and now how can I take replacement","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"loud","reviewDescription":"Motor hums loud and it squeals like there is no lubricant","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Very dissatisfied","reviewDescription":"The stand\/pole continually slides down regardless of how tight or loose it is","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Works ok","reviewDescription":"Works ok very loud. Not exactly what I thought I would get. Set up was a little confusing as the directions do not explain it all","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Loud","reviewDescription":"Fan was very loud even on lowest speed.  The knob to make the fan oscillate came off in my hand the second time I used it.The only reason I’m not returning it is that I already threw the box away.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Open-box headaches every time","reviewDescription":"I need to stop being cheap and buying open-box that \"promises\" it is like new. Always a defect or missing part. Same was true on this purchase. The fan itself is fine, but is missing the spinner (fan blade retainer). So now I have to pay just as much to get a replacement as what the savings was for \"like new\". And a waste of time in not being able to use the fan until the part arrives.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"It blows","reviewDescription":"No, really, this thing blows. Highest setting might blow you away. I need a fan to sleep, and this one provides exactly the right sound for me. I do miss my last one with the remote but alas it died","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Noisy","reviewDescription":"Fan moves plenty of air but is loud even on the lowest setting.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"It's a Lasko.  If you owned one before, then there are no surprises","reviewDescription":"Overall a good fan for the price. I have owned Lasko's before when living outside the US.  Imports into small countries can be expensive with government taxes, so that importers bring in less expensive products.  Just when I thought Lasko could not get any skimpier on packaging and shroud design, they surprised me again.  The shroud\/cover\/cage was a booger to get together as they managed to find another shortcut but it is together and works fine.  Lasko owners know that you have to take the fan apart every few months and tighten the parts or it will eventually have breakage as pieces come loose..  I have never had one outlast the motor.  Overall, if you know what you are buying then you should not be disappointed.  It is what it is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Loud but good fan","reviewDescription":"Assembly was super easy, no tools required. It is very loud though. Blows very good though. It has three speeds, but wish it had one more lower speed to lessen the loudness. Even on low if used in living room with tv or game with voice chat, it will be too loud.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Review after 1 year","reviewDescription":"I have had this fan for about 1.5 years now and it is great. It circulates their air in our room every night and has a low noise which we enjoy. My only complaint with the fan is the center piece behind the actual blade has loosened itself 3 times now in the time we've owned it. We use it every single night 365 days a year and I'm not sure why the happens. It isnt often, we fix it and a few months later in the dead of the night we'll be woken by a god awful clanking and the middle piece has completely fallen off. No big deal, easy fix, just something that has happened and wanted to make other aware. Besides that we love the fan and it's held up great for us.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Lasko Oscillating Pedestal Fan, Adjustable Height","reviewDescription":"bought this fan a year ago and it still works well. I recommend it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Good value for the money, but...","reviewDescription":"This is my second exact fan from Lasko, and to date  both are working well. One is 2 years old at this point, the other is 3 years old. The older one is used nearly every day in the summer in my garage where I work on old cars. It's not exactly the best environment as the air is a bit dirty and on occasion i do bump into it. The other is used at our beach house and doesn't see nearly the use.PROS: Well balanced motor and fan assembly which means quiet operation. Even the oscillating function is smooth and quiet. The amount of air pushed is definitely adequate. The base is large enough to keep the fan upright when you kids bump it or play around it. CONS: The reason for 4 stars is mostly due to the adjusting hardware. The height adjustment is on a telescoping pole where a plastic collar is tightened around the bottom pole to compress the two poles and keep the fan from dropping. The one that gets bumped the most has lost its tension to a degree and it requires height readjustment every few days. After enough of this, the plastic collar cracked and now it's nearly an every day adjustment. Because that particular fan is always used at its highest height setting, i'm simply going to run a sheet metal screw through the interface of the two poles and make the height permanent. The other adjustment is the fan head tilt. It's on a plastic detent\/ratchet gizmo that has no lock down. In other words, you just grab the fan head and lift or drop it as needed. It's fairly solid but if this fan is bumped into a lot, as it is with my two units, it will adjust downwards. No big deal there but much like the height adjustment, it could use a better locking mechanism. Otherwise, If you catch the right price on Amazon, this is a pretty good value for fan.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1626307200000}
{"reviewTitle":"Not quiet, blow blows good.","reviewDescription":"I read some mixed reviews regarding this...some people had some issues...but I have had no problems with it. I use it in my garage. I've had it about a month now.  It's not unusual for me to run it 24 hours a day. I live in a very hot climate and in the evening, I open my garage door ant let this blow a lot of the heat out. It's not quiet, but I don't need it to be. I always have the radio on when I'm in my shop, and the fan noise is of no consequence.  About a week after I got this, I saw a similar (but better) model at Costco for about a dollar more. But of course, if you don't get it then, sale items at Costo are gone the next day.  I'm satisfied with this and thinking of getting another one.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Very Loud!","reviewDescription":"I own several brands of fans including Lasko. This is the loudest, by far, on setting 1. Setting 2 and 3 are so loud I don't expect to ever use them. That being said, I like the oscillating and tilt features and the fan does move a lot of air.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"DO IT!","reviewDescription":"This fan is by far the best I’ve ever bought. I live in a camper and have a window unit in my bedroom. This single fan blows the cold air all through my home. It definitely moves some air. I love this fan and when needed I’ll buy more!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Relatively quiet operation.  Nice breeze","reviewDescription":"Difficult to tighten telescoping knob","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Powerful","reviewDescription":"Powerful easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Buena calidad","reviewDescription":"Me encantó sopla muy bien y de muy buena calidad lo recomiendo 100%","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Works like a dream","reviewDescription":"Assembly Instructions are easy to follow. The fan does make noise but it very low him and ocilates nicely. Very good product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Amazing!","reviewDescription":"I have a serious fan addiction for sleeping. This thing will blow you away on medium and high. I keep mine on low, that's how strong it is. Good to know it has that much power, even though I don't currently need it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"it is great","reviewDescription":"it is great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Works really well","reviewDescription":"Love this fan","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"buy it now it good","reviewDescription":"i love this fan a lot it a good fan","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Works great","reviewDescription":"Nice fan","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Very strong","reviewDescription":"It’s a good fan but it has 3 settings and they are all really strong and loud. My only thing is I wish the low setting was lower for when I am working and need to take calls.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"It's loud","reviewDescription":"Here we have a fan. And boy does it fan. The thing came disassembled. Not a big deal though they easily could have. Connecting both sides was a small annoyance but eventually my brain power won out. Now this fans very well. Too well. It's loud, like a window AC unit loud and this is the lowest setting and I wish it was a more gentle breeze, it blows hard, even on the lowest setting. I feel oh so cool in bed. I sleep hot and this thing might make me use the actual bed sheets under my one blanket I usually use. But whisper quiet it is not.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Just fine.","reviewDescription":"The good part is that it has three strong levels,. The instructions are not very good and you just Have to wing it. It also does not have a remote control like my last fan did. That’s a really nice feature I miss.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Finally we were able to assemble","reviewDescription":"Another call to Customer service and she was able to understand the issues and helped me correct it.  Fan is now assembled correctly and operational.  Cover is cheap but fan is loud and strong.Purchased as a gift earlier in the year and did not unpackage to assemble until months later.  The problem is extension pole that attaches to the stand pole and fan does not fix into the stand housing pole.  Very disappointed","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Slightly noisy","reviewDescription":"Black color is contemporary, nice solid base hard to tilt but a bit noisy. I had to raise volume on my tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Works great","reviewDescription":"This fan moves a lot of air. Only drawback is that it’s noisy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Worth the money","reviewDescription":"I just got mine today... I'm super happy for it, it really does blow air, with a white noise to help u fall asleep... I'm a fan person and this was worth the money...","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"Fan put together","reviewDescription":"Well the instructions could have been better . After a little trail & error went together nicely. The front casing is easily dislodged but a few zip ties solved the problem . Fan works great .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Large but nice","reviewDescription":"My trusty fan died, I went on the hunt for a new one. The instructor for this fan are lacking, you tube to the rescue. It is a little loud, hoping it doesn't because an issue. However, this fan puts out some serious air. I would recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Good price","reviewDescription":"Directions are not great but spend some time and you’ll finally get it right! Took a 3rd person to get it and the whole thing is like 6 peices!!! Very lightweight which is really convenient. Packs a heavy punch with air flow but is quite noisy. All in all great for my needs","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Very Disappointed","reviewDescription":"The fan arrived and was much needed for the next 3 days.  Unfortunately the fan is NOT well designed and unusable.  The plastic ring\/nut will not attach; another plastic piece barely fit or attached; the other plastic nut that is used for adjusting the height barely tightened enough to keep the fan from slowly dropping.  Very disappointed in the plastic components. Again, not well designed.  Have bought Lasko box fans for years so was confident this fan on a stand would be the best choice but it wasn't.  Will return this fan and buy a metal fan that hopefully is better designed with parts that fit and properly function.  Again, very disappointed.  Expected so much more from a Lasko product based on past purchases.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686873600000}
{"reviewTitle":"Broken less than a year","reviewDescription":"Bought this in may 2023 and now it’s April 2024 and already broken sounds like the motor is gone smh","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Works fine but customer service is a complete joke","reviewDescription":"The fan itself works, I can't complain about that.However, the knob thad controls the fan speed arrived broken & instead of sending me a 50¢ replacement knob they asked me to ship back the entire unit?!That's unacceptable, sorry.So:- 1 ⭐ removed for receiving a damaged item- 2 ⭐s removed for having unacceptable customer serviceMight seem harsh, but theses days when there's so much competition, customer service matters more than ever & theirs completely failed.I'll get a knob myself from the hardware store instead of shipping the whole thing back & risk getting yet another damaged unit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Very Poor Design","reviewDescription":"I have always been happy with Lasko fans. This one is very poorly designed.There is no way to secure the pole in the base so if you bump it it tips over, if you move it the whole fan comes out of the base if you're not careful and you have to hold down the top of the fan to keep it from coming out of the base when you change speeds.Another problem is the adjuster on the pole keeps sliding up and down and to keep it in place I have to tighten it so much I have to have someone else losing it to adjust the height.I think this is going to be a return.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"Fragile","reviewDescription":"I originally liked this fan very much. My Old Lasko fan had a controller and a few other bells and whistles. The motor eventually gave out, so I went in search of a new fan. I liked the old fan, but I just wanted a basic no frills model. I went with the same company, and what a mistake that was.Within a few months the fan got very noisy. It turns out the threads of locking piece which holds the fan blades in place had disintegrated. The fan blades would work themselves towards the front grill, clang against them at high speed, and then return to their original position. This repeated so rapidly, it was just a constant clanging. Luckily, the locking piece can be put in backwards and still screw on - just with half the remaining threads. My parents have the same model, and they have the same problem.This lasted me a little over 2 years, and I've had to buy a new fan. I'm not going to buy a Lasko fan ever again.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1653350400000}
{"reviewTitle":"Not a Fan of this Fan","reviewDescription":"The price is great but you pay for what you get I guess.  I have several Lasko products and all are great but this fan not so much.  The entire thing feels a bit flimsy.  Some pieces don't actually secure to each other with screws, they just slide in.  When carrying the fan, sometimes it slides a little loose.  I could live with that. What I can't live with is the fan blade assembly cover.  The other fans I own have solid covers that are eitehr latched in with plastic latches or screwed in. This one uses plastic snaps as pictured here.  The problem is the snaps don't line up 100%.  You get them all in but one or two are just a little out of alignment. Even when they snap they easily pop out.  At one point while the fan was running, my kid bump it and the front cover just fell off.  Now if I were reading a post like this, my first thought is \"This guy put it together wrong.\"  Yeah I can't rule that out 100%, but I hav put together a ton of things, toys, grills, furniture etc... I rarely have problems like this with other products.  My review may be a rare scenario but I have decided to by a more sturdy fan.  I still like Lasko products, I am jut not a fan of this fan.","isVerified":true,"ratingScore":2,"reviewReaction":"13 people found this helpful","country":"United States","date":1562716800000}
{"reviewTitle":"Poorly designed","reviewDescription":"The front of the fan casing does not fit or lock into the backing piece.  Mine generally holds on through sheer force of will, but a casual bump will usually knock it off.  The stand doesn't do much to counteract the skewed center of gravity, so the whole assembly has a considerable forward tilt.Other than that, I can't really write a review for anything except the motor.  I've had it for a year, I quite often leave it on continuously for weeks, and the motor hasn't burnt out, so one point in its favor there.  If, \"It's a fan\" is enough for a five star review, then maybe I've rated it incorrectly.  But honestly, there are so many glaring problems in terms of build quality that I hesitate to even give it a second.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685750400000}
{"reviewTitle":"Blows great designed terrible trust me but another kind.","reviewDescription":"I received this fan today and have to say it blows pretty good but everything else about it is horrible trust me. The whole way they built it to be assembled is terrible the end of the top pole connecting to the fan is backwards they flanged the side facing down towards the floor which doesn't fit in the connecting pole instead it has to sit and you have to tighten them together using a piece connecting them. But the fan itself is pretty heavy so the way the connecting bars go doesn't secure the fan good over 8 times the whole fan bent almost breaking the cheap plastic piece used to tighten both poles together and in the end I had to station it and hope it holds and can clearly tell it's little crooked and probably will fall over completely soon or later. If the price wasn't so cheap and I didn't destroy the box already and could survived with my other smaller  standing fan and the ceiling fan I wouldn't wasted money on another fan especially since I'm buying a indoor A\/C after summer when their cheaper for next summer. Also says theirs a remote with it but I didn't see one or the manufacturers just forgot to add it before boxing it up for sale. But for some reason I tend to keep crap instead of returning it depending on item and price and if it works or not.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1564704000000}
{"reviewTitle":"It’s very loud!","reviewDescription":"The fan has an 18” blade housed in a 20.5” grill.  The base of the fan is also quite big.  While it works well enough, it is loud.  At is lowest speed setting it’s louder than my now defunct 16” fan when it was set at high speed.  At medium or high speed, it is super loud.  I like to have a fan on when sleeping in the warmer months of the year.  The description of the fan indicates that it runs “quiet.”  Not true.  Just a word to the wise…if you want a quiet running fan to keep the air moving, especially on warm summer nights, look elsewhere.  The 18” Lasko Oscillating Fan is NOT quiet.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Loud","reviewDescription":"If you want peace and quiet from a fan look elsewhere","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"So loud!","reviewDescription":"This fan is extremely loud, even on the lowest setting.  My son complains frequently about the noise and sometimes chooses not to use it.  I think it was supposed to come with a remote, but we didn't receive one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Very Loud but powerful","reviewDescription":"Very very loud. We were going to use this in a bedroom, but even on the lowest setting it is to loud to sleep with on. Very powerful and would work well in a space that noise didn’t matter.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"It's okay","reviewDescription":"It's a very powerful fan but, and there's always a but, it's hard to get it to not sink on it's pole and that makes me angry. It promises to not do that but yeah, it does.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Won’t stay up","reviewDescription":"The pole to the fan won’t stay in place and the turn knob won’t tighten up at all I had to use gorilla tape to keep it in place other then that it good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Effective but somewhat cheaply made","reviewDescription":"LOTS of plastic parts and the attachment to the base is not terribly stable. That said, it functions well and does the job, though a bit loudly. Decent purchase for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Very loud","reviewDescription":"Loud but powerful. I bought this one because they claimed to be whisper quiet. Had it been properly described i would not have gotten this for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Despite the high RPM, it doesnt move as much air as you think. Too loud","reviewDescription":"too loud.which there was a bigger difference in RPM between each setting or at the very least between setting #2 and #1.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Strong Fan, not center stand","reviewDescription":"This fan is strong but the center stand constantly falls from off the threads and does the slant like seen in pictures.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Broken already 🙄","reviewDescription":"Thought it was a good fan, but it fell apart today. I haven't even had it a full year and the cap that goes in front of the blade popped off. In the process it hit the blade, bending and slightly cutting through one of the fans blades. The piece that came off holds the blade in place. It's stripped and can't be used anymore. Have to buy a new fan but it won't be this one. It worked well until it didn't. Cheaply made and I would request a refund but it's too late.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Powerful but LOUD","reviewDescription":"Lots of output but sounds like a rocket - VERY NOISY so not great for sleeping- very easy assembly","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Loud","reviewDescription":"This is the loudest fan I have ever had. My pets were afraid of it at first and took a couple of weeks for them to come around where it is. It does help move the air around but it is loud.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"East assembly.","reviewDescription":"Only complaint is the motor is a bit noisy.  Good air flow though.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Clean frequently","reviewDescription":"Fan works very well the only downside is how much dust it collects frequently. If you have allergies I wouldn’t recommend otherwise it’s perfect","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Good fan","reviewDescription":"Easy to set upInstructions could have stepsNot the coldest fan but still good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Loud","reviewDescription":"This is not whisper quiet! It is however very powerful. Maybe would be great outside on a deck or in a garage where you would be working. I just received this today so I am on the fence about keeping it.  Easy to put together and well built.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Keep cool.","reviewDescription":"Good size circumference fan but only a bit loud!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Moves air great. Not quiet.","reviewDescription":"It does what I needed it to do","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Working fan","reviewDescription":"I think cheaply made, not sure how long it will last. Since stand is plastic it’s a little top heavy! Wish I would have ordered one that extended higher.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"It didn't come with a remote. Should it have?  I would love to have one for it. Please advise.","reviewDescription":"The fan is in my living room for air circulation. Haven't used it much yet but when I did I had no complaints.  There was no remote in the box.  Should it have come with one?  I do prefer not to have to get up to turn it off or adjust the speed.  Great, stable base. Nice black finish.  So far, so good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Ok","reviewDescription":"Reason why I gave it 4 stars is the pole wasn't locking and I used channel locks to tighten the nut and it still moved but its nice and cool in my room now","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Great quality","reviewDescription":"I have had this for months now, it works great, high power motor, it’s quiet too and the plastic is thick and should last for a long time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Lasko Oscillating Pedestal Fan, Adjustable HEIGHT, 3 Speeds, for Bedroom, Living Room","reviewDescription":"I liked that it was easy to put together!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Excellent, Quality Fan at Very Reasonable Price","reviewDescription":"I love my fan!!!!  It has 5 blades, and blows so much air on the lowest speed that sometimes I wish it had an even lower speed.  Quality construction.  Highly recommend!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"Super strong fan","reviewDescription":"Ok I wasn’t expecting this fan to be giant, but this is absolutely the best fan I’ve ever bought. I was super skeptical about even purchasing cause I bought a previous fan that didn’t even last a year on Amazon, but this is literally working better than our window AC unit right now. Wish I would have bought months ago. The instructions weren’t super helpful but I found a YouTube tutorial. If you don’t have ac in your room\/ apartment like me, buy this fan!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Works great! Fast shipping!","reviewDescription":"Fairly easy to put together.18” fan is so much stronger that 16” fan.Works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"I Need Air","reviewDescription":"It's a fan.  If there was a remote control, I didn't receive one.  This model doesn't come with one.  It is quite noisy, even when on low, but does it move the air.  You need to hold onto your hat.  Assembly was a little bulky but fairly easy.  You don't want to lean on the fan if you have it raised high, it will slide down.  Could use little indents to keep it up.  Overall, very satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Fan","reviewDescription":"I really like this fan. I like the high speed, the remote and the low noise level.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"High velocity Fan","reviewDescription":"If you need a inexpensive fan that has a good out put of Air and a wide circular path, this fan is great for the money. I got the manual one without the remote and it works just great for what I need it for. Greatly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"More power than I needed lol","reviewDescription":"Very powerful. Bought for the living room. The 1 level is still too much sometimes. I would have picked another fan had I known how strong it was lol","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Love this!","reviewDescription":"Hated at first bc it’s loud, but now it actually helps me sleep by drowning out my thoughts 😭😂. I can’t not sleep with it anymore. Very powerful too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Almost perfect; fatal flaw!!","reviewDescription":"So I loved almost everything about this fan - the look, the ease of assembly, the huge gusts of air, and most of all, the NOISE.  I live in NYC, and use a box fan for white noise during the day, and to drown out all other noises at night.  I was THRILLED about how loud this thing was, until I heard it - the hum.  No matter what speed it was on, whether it was on the hardwood floor or on the rug, this fan emitted an extremely unpleasant, low hum.  I'm not lying when I say I had a visceral reaction to it - I could feel it in the pit of my stomach, it bothered me so much.I took the fan apart and put it back together again, thinking maybe something was loose, but no matter what I did, it still hummed.  So I very sadly returned it, and now have a weak-*ss Honeywell fan that hardly puts out any noise at all.  *sigh*  I've read reviews for several Lasko pedestal fans, and the \"hum\" seems to be a common complaint.  Buyer beware!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680652800000}
{"reviewTitle":"Very, very cheap","reviewDescription":"I had one of these fans, same brand, that I paid $15 for and ran every night for nearly 20 years. Even though this one was $45, it is made of much thinner cheaper plastic. I will feel blessed if I get 2 years out of this one. And because it was so cheaply made, assembly without breaking something was a challenge.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Old School Cheapo Noisy Fan","reviewDescription":"It looks better than it is. Sure, it's a cheap fan and you get what you pay for. It's all plastic parts, noisy as heck, more like for an industrial situation rather than home use. Try sleeping with this thing going full blast in the room. If you like blowing hot air around the room, look no further.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Not the best quality","reviewDescription":"Instructions are in Spanish. No English translation. But simple to assemble. The height adjustment tightner broke so the fan will be used at its lowest level. That's fine . I'm using it at my desk","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"not built to last....started ‘clicking’ loudly after six months","reviewDescription":"the good:  easy to assemble.  plenty of power.  reasonably priced.the bad:  this is the second lasko fan we’ve purchased that started creating a loud clicking sound after a period of use.  now this fan is pretty loud, even on low setting which is all i’ve ever needed, but that is no bother for me as i like the white noise.  medium and high levels put out a very aggressive hum so if you want a quiet fan, this is not the one.  but it is the loud clicking noise that makes it unusable for me.the first one lasted nearly three years....i prefer to fix vs toss when possible but this sound was coming from the motor casing and was beyond my skillset.so i bought a new one in june 2020.  did not love the way the new cover attached but it worked well enough until it started clicking only six months later.  we only run the fan at night and don’t even use the oscillate feature so i have to conclude the quality and durability of at least one part or parts just isn’t up to standard (and appears to be getting worse).there is only a 90 day warranty which pretty much sums up the faith lasko has in their product.  i have written the company and will update with any relevant update.  otherwise i will plan to move on ftom lasko fans to something more expensive but built to stay in your home and not the landfill.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1608854400000}
{"reviewTitle":"Missing parts","reviewDescription":"The fan received is missing parts.  It’s missing the spinner and the pipe.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Too loud","reviewDescription":"Too loud. Son has stopped using it. Even the lowest setting is loud. He likes white noise but not this. Guess we'll use it in the garage.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Too loud to hear tv","reviewDescription":"Great breeze but cannot watch tv while it’s on. Bummer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Much Louder than Expected!","reviewDescription":"Ok, I will fully explane why I only gave this fan a 2 star review.The first thing is, it is really loud for anyyone, who is considering this as a bedroom fan! I have to listen to my TV on excessive volume, even when this fan is on its lowest setting. It's not an annoying loud, it's just loud, and I suspect it's due to its cheap build.The second area would be the living room, but even for the living room, you don't want to have to talk over fan noise. Also in the living room, you do have the ability to place it in an area where it might minimize the need to crank up the volume, just to here the TV. That being said, this is a very economical fan, everything on it is plastic, except for the motor, and for the living room, I want a nicer looking fan, and one that looked to be better put together.When you look at this fan, it just screams low quality, when it actually works very well, and it does move a lot of air, but I can't give you an actual measurement, as I can't find anything regarding its CFM (cubic foot\/per minute). But again what I can say is, it's a hard blower (even in low).For someone without air-conditioning, I would have to say this is a must by, simply due to its combination of high air flow, and it being a oscillating 3 speed fan.The bottom line it the fan works very well, but is not quiet by any means!I'm going to keep mine, but it's not going to go in my bedroom, or living room!I'll be looking for a different brand to put in my bedroom, and living room.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1463011200000}
{"reviewTitle":"Good fan but doesn’t last long","reviewDescription":"Good fan, give a lot of air but it stopped working after 4 months so don’t buy if you want It to last long","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Rickety but Strong Wind","reviewDescription":"The fan brings a nice breeze, but sometimes it makes whirring noises and sounds unstable.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Basic","reviewDescription":"Basic assembly but one of the pieces didn't look like the instructional picture, so makes you wonder if you got the wrong part. Only real negative is that it's kinda loud, other than that it's a good buy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"riced right","reviewDescription":"Priced right","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Lasko Oscillating Pedestal Fan","reviewDescription":"My wife thought the new unit was a little too noise so I had to swap out another older Lasko unit in the bedroom. Other than the noise issue they are a good value for the money.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"lightweight and heavy breeze","reviewDescription":"it works really well BUT louder than what I prefer","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Works","reviewDescription":"Little pricey for an average fan.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Moves a lot of air. Noisy. Needs a  stop lower speed.","reviewDescription":"I was hoping for a higher volume of air at a lower fan speed. It is just a little bit too loud to have in the same room as your TV.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Works good but","reviewDescription":"Way to loud.. on low it sounds like you have it on high..blows good keep the room cool @ easy to assemble..","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"very nice product","reviewDescription":"fast shipping","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Good for your buck","reviewDescription":"great air flow! the fan actually blew off a pin i had in the wall i front of it. i tend to like louder fans and this isn’t really that loud. but it’s a good fan for what you pay for.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"This fan is SUPER loud and the lowest setting is SUPER fast! Not a fan of the fan.","reviewDescription":"The fan is too loud, even on low, which isn't low at all. It cools off nice, but I've never even turned it on high since low is so fast and furious anyway.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Send me a used one?","reviewDescription":"Well 2 star for sending a used one to customerFan works though","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Noisy n falls down constantly.","reviewDescription":"it was advertised as a  bedroom fan so I expected n hoped ot would be quiet but its noisier than my wind machine. u tighten the nut to hold the fan up to a height but it drops constantly no matter how much I tighten it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Noisy.","reviewDescription":"Fan makes too much noise. there is a constant underlying HUM!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Not what they used to be, this is my last Lasko fan.  It blows air, that's good though.","reviewDescription":"Have an older Lasko we bought from a different store around 10 years ago.  A different fan stopped working so we bought one just like the Lasko we got back then.  Wrong, the first thing I noticed while putting it together was how cheap it felt.  The fan guard feels like it'll give way if you ever fell a little into it.  Then when turned it on it sounded like it was unevenly balanced or the bearing was clicking or making a noise every turn it made.  We tried it out anyway for the first night but I couldn't even sleep with it, it was driving me mad and getting louder.  I returned that for a replacement and the second fan did the same thing.  We wound up keeping that one anyway since it wasn't as loud as the first one.  Still, this one the blades come loose every few months even though I tightened them quite a bit.  The other fan I clean once a year and never had a problem with blades loosening.  Anyway, this is the last Lasko fan we're buying.  It's just about the only brand of all the fans we have but since we're having issues with the newer ones were going with something better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675555200000}
{"reviewTitle":"Gassing Out!","reviewDescription":"I know it’s plastic and it’s very plastic feeling. But I’ve never had anything smell so much. I turned it on and the whole house started to smell. Right now it’s running in an extra bathroom with a window open. If it doesn’t get better it’s going back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"\"New\" Product looks used","reviewDescription":"It had scratches all over and the plug came pre-bent lol.  I'm guessing they just take returns refurbish them with new plastic and sell as \"NEW\". Oh well it's hot so I'm keeping it but just be aware. Really easy to assemble.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Loud! Very little difference in fan speed!","reviewDescription":"I wanted a nice \"breeze\" for the patio this is a thundering hurricane. No one can sit near it and low speed isn't much if at all different from high. I gave it 2 stars only because it seems nice quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Over priced","reviewDescription":"Way over priced. Works good. But I should have just gone down and bought one locally.. my mistake. But won't happen again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"came broken and entirely plastic","reviewDescription":"it came broken. i put it together anyways and it didn’t spin true at all. the whole thing is made out of cheap plastic which was disappointing considering it is $50 and i was searching for metal fans. not sure if this is just the kind of quality you get at $50 or if they are cheaping out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Front is not secure","reviewDescription":"Currently looking for a new one besides this one, we were never satisfied with it. The front doesn’t secure well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Broke 31 days after purchase","reviewDescription":"Usually a good product. I have 4 for the last 8 years.. This one broke 31 days after purchase","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Incredibly cheap and flimsy","reviewDescription":"I read the negative reviews but figured \"How bad could it be?\"Well, it's bad beyond my expectations. The base, grille, blades, motor casing, and attachments are entirely made of plastic. The height adjustment is so flimsy, it barely holds. The front grille is so thin and cheap, it's warped, so it's virtually impossible to fit it on. I finally gave up, and I'm using it without the grille.The pole doesn't bolt into the fan base; it just pushes into a hole, so it constantly turns. Therefore, it's pretty much impossible for one person to adjust the height. You need a second person to hold on to the bottom half of the pole; otherwise, it turns with the height adjuster. The fan motor doesn't bolt to the pole, either; you just shove it on.The fan puts out a decent amount of air, but I don't expect it to last long.My last pedestal fan was a Honeywell. It was not expensive, and it was built like a tank, all metal, and it lasted many years. I cannot believe how cheap stuff is built today--unless you have $200 to spend on a fan.Update: After 15 minutes of fooling around, I finally got the %$&#*&% front grille to snap on. It's never coming off, so dusting the fan blades is not an option. I may try some Gorilla glue to secure the pole into the base and the fan head to the pole. It's absurd that I have to do this stuff to fix the bad engineering on this thing.Update: I used Gorilla Glue to secure the pole to the base. I've been hauling the fan around quite a bit, and so far it's holding.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1467331200000}
{"reviewTitle":"Sounds like it is about to fly apart","reviewDescription":"wish I could return it, but bought it before the warm weather rush and now that I am using it... I am going to dump it for a sturdier fan that doesn't sound so unstable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"It’s okay.","reviewDescription":"Extremely loud of level 1. Doesn’t blow out cool air. It’s more warm than anything.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Height adjustment sucks","reviewDescription":"The fan itself works but don’t try to adjust the height. It will collapse to the lowest possible position. Seriously considering disassembling it and throwing the parts into a bag and returning it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Very loud and stopped working after 5 months","reviewDescription":"This fan is very very loud. The blades are loud, the motor is loud, and the base vibrates which makes a lot of noise if it’s on any hard surface. It does blow a lot of air - probably the only nice thing I can say about it. The head does not tilt down - only directly forward or up. I bought it in mid July and it stopped working at the end of November. Very disappointing, especially from this brand. I’ve had other Lasko fans last years without a problem.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Very Loud Fan and Really Big","reviewDescription":"The fan works good but is it very loud and it is really big.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Powerful, but cheaply made","reviewDescription":"The motor and fan blades work well, though settings 2 and 3 are quite loud.The fan shroud is made of cheap plastic, the pole pretty much just sits in the base and the motor pretty much just sits on the pole, though both do stay \"attached\", so far. Imo, screws or bolts should have been used.The extension part works, though you may need to really tighten the nut to keep it from falling down.The fan speed knob on mine came cracked (3 separate cracks) where it attaches to the speed controller. I put heat shrink around it to tighten it up and hopefully to keep it from getting worse.Two stars because its primary function (blowing air) works well, but I don't recommend nor would I ever purchase again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Don't Buy This Fan Unless You Were Born without Ears","reviewDescription":"I ordered two of these fans. The plan was to conduct air from the north (cooler) side of our living room toward the south (hotter) windows. They were to work in tandem. Our AC is not functioning and we're not willing to spend the money to fix\/run it.Assembly of the first fan took about 15 minutes. Other than the collar that mounts the back grille to the motor and the piece that holds the blade in place, none of the pieces are threaded. You're basically just stuffing the post into the base, then shoving the motor onto the post.The noise and vibration of the motor on the lowest setting -- not the blades moving through the air -- is ridiculous. Our tri-level house is ~2500 square feet; the noise is outrageous on all three levels. You can practically feel the vibration in your teeth on the floors above and below -- and the fan was placed on carpet.Hoping that it was just that one fan, I assembled the other. The second one was worse.I understand this is an inexpensive unit, but it's appallingly loud on the lowest setting. The highest speed sounds like an air boat cruising through the Everglades. The vibration is even more intolerable. They do move air quite effectively, so if you live next to an interstate highway, these fans might work for you.They were disassembled and back in the box for return about as fast as they were assembled. It was worth a shot, I suppose. We ordered a Vornado with a DC motor, which is three times the price of these two heaps combined. Yippee.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1498521600000}
{"reviewTitle":"Not what it used to be","reviewDescription":"Originally had one of these around 2014 and the motor finally died in 2023. Purchased this one and the fan cage came in all warped. Returned to Amazon, no problem. However, the new cage design is horrific. Impossible to get it together and the fan nut between the back cage and fins does not tooth onto the motor well at all. This is an impractical fan if you ever want to clean it. Tried with the same fan from home depot, all the same problems. Lucky that I saved the original cage from the 2014 fan. Maybe worth $15-$20, definitely not what they're charging now. Lasko's engineering seems to have taken some shortcuts at the expense of quality. Giving it two stars because the original quality was excellent for how cheap it was in 2014.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"noise","reviewDescription":"This fan is not whisper quiet, it is really loud and if it were not a pain to return it would have been","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Plastic piece of junk","reviewDescription":"While the motor on this fan (just got it, so we’ll see) seems ok, the actual parts of the fan are VERY cheap plastic. It came with two small broken parts on the head (the grid that protects the blade). It’s hot though, and a big pain in the neck to send back, so I’m just going to keep it. I can tell you why it came broken, though. There was zero packaging. The parts came loose in a big box. No bubbles, no foam, no noodles, no shredded paper, nothing. I guess next time we need a decent fan, we will go for metal and shell out the big bucks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Noisy as heck. Not a bedroom fan by any means","reviewDescription":"So I’m a bit confused and I’m assuming I got the right model per description. There’s no remote, even though other reviews mention it. It’s not mentioned in the actual description so whatever. But what is in the description is bedroom, office and quiet motor. Ok the motor isn’t what makes noise it’s the fan blades. This thing has 3 speeds. Noisy, Louder and 747 taking off. Obviously, I jest but its very loud on all speeds. I bought this for a means to draw cool air in at night into our upper story but it’s so noisy, no one can sleep with it on. So back it goes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Lasko USED to mean quality....now it just means cheap.","reviewDescription":"I have  purchased the cheaper lasko fan for the last few years (Lasko FBA_2521). They would last several months then get louder and more inefficient and I would replace. Wasteful yes but they are\/were cheap so no distress. However this Xmas I opted to purchase a slightly \"better\" version for my son. More costly in this case was not equivalent to better quality.This fan is NOISY. But worse than that its not made properly. Attaching the front and back grill almost made my brain implode. I could put the other lasko together [having owned about 6 over the last few years] in my sleep.This \"improved\" version (EXACT same instructions) took 3x as long because of cheap construction, poor quality and mismatched plastic grill connectors making the snapping together of the front and back grill harder than surviving the Kobayashi Maru in Star Trek.I finally forced it to snap together but after reading the reviews I am not confident of this models safety or quality.Long story short. The cheaper version is easier to work with and you get what you pay for. Don't waste money by upgrading because this model is actually a downgrade.Might be the last time I buy a Lasko if this is what I can anticipate in the future.Cheap cheap cheap","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1611187200000}
{"reviewTitle":"Loud and cheap.","reviewDescription":"I have no idea how this thing is so highly reviewed. Maybe it’s all college kids who never had the pleasure of owning an 80’s Lasko quality product😆. This fan is made of the cheapest crap plastic (you know the type I’m talking about)…the tolerances are way out of whack….. The blade is unbalanced and adds a “whump whump” to the sound, which carries DIRECTLY through the hollow base (which acts like a sound resonating chamber) and directly into your floors. You will need carpets or yoga mat type layer in between the floor and your fan base to stay sane. “Low” is what you’d expect “high” to be on a fan at Planet Fitness. Utter Chinese junk…and not modern Chinese which is actually not bad…but like, 70’s quality Chinese. You are getting Dollar Tree quality with this purchase.. just so you know👍🏼. Might be a good cheap shop\/garage\/workout fan though, so I’m not gonna return it. Lesson learned.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1652400000000}
{"reviewTitle":"Doesn’t stay at height","reviewDescription":"Fan itself does its job but it doesn’t stay at its height. It always falls no matter how tight I twist it. Also didn’t come with a remote like it said it would?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Just OK.","reviewDescription":"Fun was easy to put together. The final front cover over the blade itself was a little frustrating but with a little patience I got it. I bought this fan for white noise while sleeping. My old GE fan that I had for 18 years finally gave out. I'm a little\/very picky when it comes to sleeping so this is my opinion.While in low mode and not oscillating you can hear the humming from the motor itself.  I want just the sound of the air blowing. I never had that with my old GE fan. All you heard was the air blowing. So when you trying to fall asleep you hear a low humming\/vibrating sound of the motor plus the air blowing. The other thing with this fan it seems to not hold it's RPM's good. It's not a consistent air flow. It fluctuates up and down quiet a bit. One second it's blowing normal then all of a sudden the air speeds up (gets louder) for a bit then it seems to almost go silent then repeats. Again this is just me but it drives me crazy so I'll probably go look for another GE fan. They didn't have any on Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581984000000}
{"reviewTitle":"Dud","reviewDescription":"As a fan it does it's job, it rotates and blows air. As an adjustable fan it's crap. You can not tighten it enough so it actually stays at the height you want. Because the motor is so heavy in a matter of time the fan sinks to its lowest level. It also easily pulls out of the base because you do nothing more than stick it in there. I have other Lasko fans and love them, this one is a dud.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Non-existent customer service","reviewDescription":"First, the fan is not of the quality of the Lasko fans I've purchased from brick-and-mortar stores in the past. The plastic is thinner and more brittle. As of this review I've been unable to assemble the fan to provide further details on its function.Second, the package was missing a part (the fan spinner) when I received it.Finally, I was unable to reach customer service via phone or chat during their posted hours. The customer service phone number refers you to the website for chat, and then disconnects. The chat  was also unavailable, the option to contact Lasko being greyed out. I ended up leaving a message on chat with another divisions customer service for call back. I then called Amazon customer service, who does not have the part to send me. They tried to contact Lasko with the same results. The Amazon customer service rep is going to call me back if they are able to get in touch with Lasko.I'll update this review with the results of the customer service interaction (if there is one) and the function of the fan once it's assembled.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623974400000}
{"reviewTitle":"Good amount of wind","reviewDescription":"It is a very strong power fan. Perfect to use in the summer. The adjusting of heights can get loose at time due to the designed of the fan but overall it is a fan good for the summer. There is no remote control so you would have to manually switch the fan on. Ease of installation of the fan.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Noise","reviewDescription":"Moves the air. A bit to noisy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good but loud","reviewDescription":"Nice strong fan but it is too loud. I have it upstairs and it can be heard downstairs","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Fan works","reviewDescription":"It’s a plastic fan but, inexpensive and does the job it’s supposed to do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Excellent airflow","reviewDescription":"When I got the fan and saw the pieces, I immediately panicked, but it was very easy to put together and I truly feel as if anyone can.  It's got excellent airflow and wide range of oscillation.  Love that it has a tilt feature too.  It's a bit noisy on speeds 2 and 3, but it's a fan and to be expected for the price I paid.  I am happy with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Circulation","reviewDescription":"Does what needs to ne done. Light weight.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Good price, but you get what you pay for","reviewDescription":"Loud and cheap, but the price was good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Perfect for background noise","reviewDescription":"This fan is the perfect noise level for those who cannot sit in silence. It’s definitely louder than most other similar fans I’ve had, but not so loud you can’t hear over it.My only complaint is that no matter how tight I secure the height of the fan, it slowly falls all the way down to its lowest height within 48 hours. It’s not too big of a deal, and I will totally buy this again","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Did it's job for about 6 months","reviewDescription":"Nice little fan for my boys room until the fan began to make a loud grinding noise. we took it apart and cleaned it, tightened all the spots that could be tightened but something inside is just making a loud noise even on the low setting.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"very powerful and good for price","reviewDescription":"a very powerful fan! we use it during the day instead of the air con and has been great for our weather. (about 85-98). I initially got it to sleep with instead of air con, but it has a whistling noise that is too loud for me to sleep, but if you don't mind that it would be great to sleep with on. I like the rotation feature, it makes it easy to cool a large space.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Easy to assemble","reviewDescription":"Easy to assemble and very strong fan. A bit loud even on the lowest setting.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Minor changes","reviewDescription":"Unlike the first one I bought back in 2016, this fan no longer has remote control. I used the 2016 fan so much that the motor sized up. Could not even turn it by hand. Worked fine for 8 years. I will miss the remote. Still easy to assemble.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Very guiet.","reviewDescription":"The base has scuff marks, which I do not like. Also on the name. LASKO, scraped up.But the fan was easy to put together.It is very quiet and the fan is strong to send excellent circulation of air.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Powerful but Noisy","reviewDescription":"PROS: This fan is a fan-tastic size for the price point. It creates strong air movement on and off the oscillation setting. The fan comes completely unassembled and well-packaged in a very sturdy eco-friendly box (about the size of a box fan). The instructions are clear and concise. I was able to put the fan together in under five minutes.CONS: The attached video is on the lowest setting to illustrate just how loud the blades are. If you’re planning on running this fan with a television on, be prepared to raise the volume significantly. If, like me, you enjoy the white noise and humming when you’re falling asleep at night, this is a great selection, again, in the lower price range that’ll arrive quickly. I ordered the black version, which added another day to the shipping time. The only metal components are the pole and fan motor, everything else is plastic which does vibrate when the fan is on and adds to the noise level. The upside to the plastic parts: the grills are easy to remove\/clean. I would recommend some THIN insulating foam edging or weather stripping, in either black or white depending on the fan color,  to run between the front and back grill along the outside edge to buffer\/eliminate the vibration noise. Lastly, there is no remote or smart function (which I acknowledge really is just a champagne problem). My solution was a smart power strip. It doesn’t change the speed of the blades but a simple “Hey Google turn on\/off the bedroom fan” works just fine. :)RECAP: Great price. Large Fan. Assembly required. Powerful. Noisy (but not obnoxious). Give it a whirl.FOR THE MANUFACTURER: If you want that fifth star, work on how noisy your fan is because of the parts vibrating against each other. I’m sure it can be done without affecting the price point and it’ll certainly drive more sales.","isVerified":true,"ratingScore":4,"reviewReaction":"75 people found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Great fan, but it's a little noisy.","reviewDescription":"This is a great product and very sturdy. We just wish it ran a litmus quieter, even on the lowest setting, but if that isn't an issue for others, I highly recommend this fan. 👌","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Package\/box arrive opened","reviewDescription":"Box arrived with seal along edge ripped open. Not open due to heat box ragged and ripped open. The hardware is missing from its plastic bag.We bought replacement hardware. It works well. Fan itself is exactly what we hoped.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717027200000}
{"reviewTitle":"Fan","reviewDescription":"Very nice fan, larger than I thought it would be but still like it. It Oscillates also. Keeps my living room cool.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Easy assembly, not quiet.","reviewDescription":"Assembly was very quick and easy! Fan is lightweight plastic. I didn’t realize this model did not come with remote. Even on low (as in the video) it’s louder than I was hoping. I may consider upgrading to the ‘whisper’ model.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Powerful but pretty loud","reviewDescription":"The fan is easy to assemble but louder than I expected. Build quality and fit\/finish are better than I expected. Well packaged. The extra noise is why I did not rate at 5 but well worth the price. This one headed for garage duty.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Works good","reviewDescription":"It works really good, but unlike what I’ve seen in some other reviews the ones we got aren’t overly loud. To me they just sound like a normal fan, definitely worth the purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Loud","reviewDescription":"This fan is not very quiet but it works well at the foot of my bed.... Pushed back towards the wall","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Powerful but large","reviewDescription":"Okay. So I bought this fan to replace my bedroom fan. My bedroom fan was just fine. It’s actually fancy and has a remote with 12 speed settings but I felt like it needed more. So I ordered this one so I could put the old one in my office. If you want a quiet fan, this ain’t for you. If you want a small fan, this ain’t for you. If you want a fancy fan with a remote, this ain’t for you. If you want an easy to put together fan that is loud and powerful, this is your answer! I hate quiet fans, like what’s the point? I do wish it was smaller bc I have a small bedroom but it’s way more strong on level 3 than my old fan is on the 12th setting. It’s not noisy in a bad way, but if you’re the type that needs silence, this isn’t it. I need noise to sleep and this is amazing so far.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"A nice affordable fan","reviewDescription":"The first one i received was hard to put together and the motor made a squeaking noise. Fortunately i was able to return it and I'm glad i gave it another chance. The replacement didn't have either of these issues. I was able to put it together in 6 minutes.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Works Great.....except","reviewDescription":"I ordered this fan to use on the front porch. 4 stars because the stand does not hold in any position except the lowest, which is fine for my use.  No amount of tightening will allow the pole to go higher.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Great Fan!","reviewDescription":"This fan definitely works well to cool off a room but its very loud. Bought it for the bedroom for white noise (replaced a fan that broke) and it was just too loud - shut it off within an hour. Definitely couldn’t sleep with it on due to noise - its been moved to the garage where it works well and noise doesn’t matter","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Great product","reviewDescription":"It works well. A bit loud but pushes plenty of air","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Fan on Stand","reviewDescription":"Works very good.  Might be a bit bulkier than I first imagine.  Also, the clamp to hold the pole stand in place for raising or lowering the height can work itself loose.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"It does the job!","reviewDescription":"The fan is simple to assemble, quiet and efficient. Everything you want from a fan in the desert.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Good product","reviewDescription":"Love the fan itself. The reason I gave it a 4 instead of 5 is the pole loosens up after using it a while no matter how hard you tighten it and fan drops from being tall to being short then. Minor inconvenience but they should address this issue.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Much needed","reviewDescription":"Had stretches of heat waves,much needed behind bowls of ice","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Continuously falls apart","reviewDescription":"Anytime someone gets close to it it falls apart on you. Sometimes when no body is even there! BeWry flimsy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"This is not a fan you want","reviewDescription":"Loud and won’t stay in an elevated position no matter how tight we screw it up, it just keeps falling down. First time it came down on my thumb so I said a few choice words. I have several Lasko fans and all are great but this one sucks. Save your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Cheap, broken waste of money","reviewDescription":"Base does not stay connected falls off .The poles do not stay tight so it cannot stay fully extended . The motor just sits on the pole . If you do choose to buy this product anyway whatever you do don't move it ! It falls apart instantly!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Bad product","reviewDescription":"Not only was this a horrible  cheap plastic overpriced product, it stopped working within 10 minutes of starting it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Terrible terrible instructions","reviewDescription":"Haven’t even decided if I am keeping it yet because I can’t get over the fact that the company can’t even put written directions in the box. Ridiculous I have to go to a video and the written instructions here in troubleshooting are not for this fan.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Won’t stay up, design flaws","reviewDescription":"While the fan is very powerful, the height adjustment bar won’t stay up so it’s always at the lowest height.Also the base doesn’t stay attached to the pole so everytime you move it, you have to pick up the base as well.Very disappointing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Obviously pre-owned","reviewDescription":"Functions perfectly which is the only reason I’m not returning it. Fan pieces are scuffed, bag to hold pieces ripped and resealed, parts already assembled in the box. As long as it works I’m fine but I didn’t pay for refurbished I paid for new.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Very lightweight (cheap!) plastic\/NOT recommended","reviewDescription":"I knew the blades were plastic from the product info, but I expected something sturdier. Battery packages have more sturdiness than this fan blade and its housing. It’s unlikely this will last more than a few months with ordinary use. Highly overpriced for what it is.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"factory assembly problem","reviewDescription":"I received the Lasko Oscillating Pedestal Fan today.  I finished the assembly of the fan and test it out.  The speed control knob did not turn on the fan.  I removed it only to find that the knob was cracked where it fits over the shaft of the switch.  I took a closer look at the switch shaft and there were wires wrapped around the shaft  which were inferring with the control knob being seated properly.This was obviously a problem that was a result of the assembly procedure at the factory.I had a similar problem with a Lasko Wind Machine fan in that the control knob broke as well.I will not purchase any more Lasko fans nor do I recommend them!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Loud whistle","reviewDescription":"I like the overall look of the fan and assembly was a breeze but when I turned it on it started a loud whistling noise that was so loud I had to turn it off. I'm guessing it wasn't properly lubricated.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Stopped working","reviewDescription":"The Daniels is very strong, unfortunately it stopped working after 20min of use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"loud, louder, loudest","reviewDescription":"Do not even consider this for a bedroom. I can't think of what room it would be suitable for, unless you wear earplugs. It would REALLY have helped if Lasko had much lower speeds. It's overkill. Really deafening. You would not be able to talk with another person in the room with it on.It does move air very effectively, is very easy and clear to assemble, easy to adjust, looks pretty good.But the noise. I tightened everything well so there is no rattle, etc. Yet there are three settings; Very High, Extremely High and Tornado Level. I'm not sending it back, but I will have to try something else on a pedestal that has hope of really being quiet enough to use inside the house.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Very cheaply made","reviewDescription":"Made of flimsy plastic.  Doesn't stay up on the stand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"A bit too loud, needs a “low” setting","reviewDescription":"It depends on your needs, but I found the fan too loud, even at its lowest setting. Part of the noise is the sound of the blades. But the motor also hums. And wish the lowest setting blew less hard. I would like it to gently stir the air in the room.In an already loud room, it might be OK.Rather than return this, I may just give it to the Salvation Army.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Fan","reviewDescription":"The pedestal doesn’t stay up !! It keeps falling down","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Floppy Cheap Plastic Farce","reviewDescription":"This product have been value engineered to within an inch of failure.  The motor unit is plastic and wobbles on the pole.  The fan shroud is plastic and if you bump it the outer piece pops off;  it does not latch securely.  It is so flimsy that any real contact would break it.  The blade is a soft thermoplastic and some plastic mold flashing not trimmed is the likely cause of some complaints of noise.  The base is plastic and is loose on the pole so that if you grab the pole to move the fan, it just comes out, and the pole wobbles in the hole.  There's no handle to move the base, you must try to get your fingernails under the edge.  The height adjustment collar is a joke which requires two hands since the lower and upper poles aren't secured to base or motor.  So how do you hold the up while tightening the slippery plastic collar?  You take off the motor, and then the pole since they will both lift off freely.  Since the fan motor is loose on the pole, and has very little depth in it's socket, so it can easily fall off the pole too when moving it.It's cheap and does blow air and doesn't fall over once set up.  But it's shocking to me that so many people think this is an acceptable quality product.  I feel like I'm living in the twilight zone.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1567209600000}
{"reviewTitle":"Cheaply Made: Fan face won't even snap into fan grill","reviewDescription":"It works but without a fan face\/front grill since it's significantly smaller than the base grill that it's supposed to snap into. You can tell they are using the absolute CHEAPEST plastic and molds since the spots where it's supposed to snap in aren't even big enough to hook the top ones into and let hang (their earlier models had that even in the directions and assembly video). I don't have time to try and return it so I'm just stuck with a loud fan (no remote or sleep mode) without a front fan grill unless I want to jimmy-rig it with some zip ties. DO NOT BUY! It was on sale which is why I took a chance but even the sale price doesn't match the low quality of materials. Oh, and the QR code in the directions was at maxed scan limit for that month...how does a company not just go ahead and purchase a cheap QR code service that won't limit the amount of scans it gets!? Another obvious sign of a company\/brand going downhill just to make higher profit margins and F-over their customers.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655424000000}
{"reviewTitle":"Very , very , very 😞 LOUD","reviewDescription":"It's too loud for , a reg size bedroom it's Kool that's the 1 thing I didn't LIKE FOR WHAT I NEED","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Powerful, loud, and unstable","reviewDescription":"This fan is powerful. That is probably its most important feature, and it gets high marks there.It's also quite loud. When it is on its highest setting, you'll have trouble hearing the TV or a phone call, even if you're across the room.My main beef with this fan, though, is that it doesn't really hold together. The kit you get doesn't truly attach the pole to the base, or the fan to the pole; rather, they just kind of slide into a groove and balance in place. This means that if you want to move the fan, you can't simply lift it by its pole. You have to partially dismantle it and then reassemble it once you've moved it. It also wobbles a bit. Plus, because the fan just loosely sits on the pole, the oscillating feature ends up changing the direction of the fan. In the span of thirty minutes, the fan completely turned itself around and was blasting air directly at the wall rather than into the room.Some of the reviews talk about drilling holes and adding screws or glue to keep things together. But that's just bizarre. Why doesn't the kit have some means by which to do this already? Why do you have to be handy and willing to alter the product just to get it to work?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626134400000}
{"reviewTitle":"fan blade arrived bent","reviewDescription":"fan blade arrived bent out of shape and can't seem to get it to bend back enough to stop hitting the housing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"sent me 2 fans only need one","reviewDescription":"hard to put together cut my finger i am a senior citizen","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Too flimsy for the price, but seems to work ok","reviewDescription":"A few thoughts:* The color is not white, but more of an off white.* Instructions were not very clear, but lucky there is a video that walks through the steps.* Materials are mostly cheap plastic, so I don't feel the fan was worth the price I paid and I would not purchase again.* In order to raise the height of the fan, you twist and tighten pole, but it doesn't get very tight and will lower very easily* So far, fan works well and it does oscillate, but the nob that stops oscillation requires a few tugs.* Mine arrived with a couple of stains that won't come out.I was very disappointed upon seeing how flimsy this fan is.  With the flimsy-ness of the fan, I hope it doesn't die soon.  I can't really say I would recommend this fan because the price is too high for the materials used.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697846400000}
{"reviewTitle":"Not returning this *only* because we’re having a heatwave where I am!","reviewDescription":"I needed a black stand fan that’s big enough to seriously move air in my western exposure living room and, based on reviews, this seemed like it would fit the bill. And it does… sort of.This fan does move air, no doubt about it. At the highest setting, I can feel air current even 11 feet away. (Not a strong wind at that distance, but air movement.) If I’m sitting within 4 feet of the fan, I can’t put it higher than speed 1 unless I want it to blow my eyebrows right off!Aesthetically, this is nothing to get excited about. The all-plastic blades and cage are pretty cheap looking. The plastic base is enormous, and looks far larger than stated dimensions even though the measurements are correct.Also, if you need precise positioning, this is not the fan for you! Another reviewer mentioned “pole creep” and was not joking. Touching the fan in the slightest will cause it to slooowly slide lower, which is not great for me because I wanted it to stay at a fixed height. Additionally, the fan head has a tendency to list to one side if it is tilted back to any degree. Blowing straight ahead has worked fine except the head doesn't really attach securely to the pole and just rests on it.In terms of noise, the difference between speeds 2 and 3 is really dramatic. I enjoy white noise and speed 2 provides a pleasant, noticeable whirring of air. It doesn’t affect my hearing tv or conversation but is just enough to make sleeping easier. I know because I had an accidental nap on the sofa one day and am “blaming” the fan for lulling me to sleep! ;-) Speed 3 ups the sound to windstorm levels. I find it relaxing but forget about hearing anything above the whoosh. It’s not the sound of the motor or indicative of an imbalance or defect, it’s just the sound of a lot of air being pushed around forcefully.TL;DR? Unless you need a black fan, as I did, buy the Holmes 4 in 1 Stand Fan with Swirl Base HASF1516. I purchased one in July 2014 and it’s going strong! Same price point but much better made with metal construction, no pole creep or head wobble or other structural annoyances. It also moves as much or more air as this Lasko but does it more quietly, looks great and is easier to position around furniture because of the base design. As my review title says, if we weren’t broiling here right now I’d have sent the Lasko back and ordered another Holmes, even though it isn’t the color I wanted.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1436140800000}
{"reviewTitle":"Loud","reviewDescription":"Nice fan study base but very loud","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Llegó con piezas rotas.","reviewDescription":"Llegó con piezas rotas.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Difficult to put together","reviewDescription":"Difficulty putting together. Otherwise fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Good, but loud :-(","reviewDescription":"So I was in search of a pedestal fan for my room because it is the absolute hottest room in the house. It could be freezing in every other room of the house, but my room turns into a sweat box. Now most pedestal fans that I had seen ran close to, if not more than, $100.00 and I did not want to spend that much money on a simple fan. When on my search I came across this one that seemed to be exactly what I needed at a very decent price. This fan was VERY easy to assemble, it took me about 5 minutes max. Some pedestal fans don't have the option of rotating around the room, but this one does which is a nice feature. It also works very well, I only need to put it on speed 1 of 3 to make it comfortable in my room. Another nice feature is that the height is very easy to adjust. I have not gotten the exact measurements, but I have a rather high bed and it can go low enough to hit me directly with the cool air or high enough to go above my body to circulate around the room.Now the reason I gave it a 3, is even though it was a great price and has some great features, it is by no means a quiet fan. I fall asleep with my television on mostly every night, distracts my mind from thinking about everything I need to get done so that I am able to fall asleep. Now usually, to hear my television perfect from my bed, it stays at a volume of 22. The first night I used the fan, I had to turn the TV up to a 75 volume in order to understand what they were saying on the TV. It is not an option to turn it up that loud as I live in the bottom apartment and the family's 7 year old daughter is right above my room. So now, especially once the summer months hit, I am going to have to purchase a set of wireless speakers to put next to my bed in order to have the fan on and enjoy watching television at night.If you aren't going to have this in your bedroom or in an area where you will be watching TV, then I would highly recommend it. I think it would also be a great fan to have for a classroom if you are a teacher. Just not anywhere that requires you to listen to a TV or if you are looking for a very quiet fan.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1447027200000}
{"reviewTitle":"Cheap, cheap, CHEAPLY made!!!!!","reviewDescription":"As you take the pieces out of the box you're instantly hit with just how cheap they all feel. It doesn't get better as you assemble the pieces. The cheap plastic is meant to give way enough for press fits. The whole flimsy fan cage is held to the motor with a cheesy little plastic ring that's SUPPOSED to thread on to the motor. Good luck.  The hardest part of the assembly is putting the front part of the cage fan on. It is designed to be SO flimsy it can be deformed enough to snap into the rear of the cage.Once it's all assembled and you turn it on, it is pretty loud for the amount of air it moves. On it's lowest setting it's louder than my 20\" Wind Machine on high. I'm not returning it, but I wouldn't but another nor would I recommend you buy one. In fact, I'd recommend a 20\" Wind Machine for $20 more. Yeah, I know. $20, but SO much better.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Loud, head does not stay locked in place","reviewDescription":"Good fan but the head does not stay locked in place when in a higher position. Noisier than expected however it does it’s job","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Loud","reviewDescription":"The fan moves a lot of air but the base for the fan acts like a sound board for the electronic hum the motor emits.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"On high it blows like you’re out on a boat! But…","reviewDescription":"I gave it 3 stars only because it really is cheaply made. It’s all plastic and if tipped over, I know something will break. That said.., it had a pretty wide and heavy base so there is that. I bought 3 black ones recently and a white one last week. out of the three black colored ones, one came broken so I called for a replacement with no issues. Both colors are the same fan just color difference. I use my AC and then put these around the house to circulate the air. Trust me when I say that they 100% move the air on high!I’ve bought other fans in the past and even on the highest setting… it was like nothing. If you want whisper quiet, this isn’t for you. I personally like the noise of the fan when I sleep. It’s white noise to me.5 stars for air flow.3 stars for the fact that it is cheaply made and I hope it doesn’t get knocked over. So far, I love it.I added a video of it on high. It really does blow the air hard enough that it sounds like you’re outside on a boat or driving with your car windows down on the highway. I’d get another for sure if needed in the future. Lasko so far is the most powerful fan I’ve had.","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"But","reviewDescription":"Very powerful but noisy and the bottom of the stand is way too big takes so much space","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Loud, but strong","reviewDescription":"It has strong wind power and oscillates well, but is quite loud compared to what I've had before.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Just a bit loud","reviewDescription":"Using it for a shared space may be a good place, but it’s too loud for a room","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"LOUD","reviewDescription":"Not air loud, motor loud. Wanted it for white noise sleeping but too loud.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Works but kinda flimsy","reviewDescription":"Blows fine. The plastic is kind of light weight and flimsy, making it feel cheap.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Easy assembly, powerful and loud but has an annoying sound","reviewDescription":"It took me no more than 5 minutes to assemble the fan. It has a good standing height and the power it has is great. The fan is very loud which I like but if I put it on the highest setting it is way too loud. I keep it on the medium setting and its perfect especially if you like that fan sound when you go to sleep like me. Only concern was that the wire is a bit short so you can’t really move it more than 6 feet away from the outlet but thats not too big of an issue. My last Lasko fan lasted over 10 years so I hope this one does just as well.Edit - demoted down to 3 stars from the original 4 because I noticed that when I have the fan on the highest setting it makes this really annoying sound like its not strong enough to manage the fan speed. Its this ticking pattern thats woken me up 2 days in a row. I thought I was going crazy but realized the sound would go away if I put the fan onto a lower speed. Still a good fan but could be better","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Noisy","reviewDescription":"The fan works well and provides good air but it’s very noisy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Great air flow but very loud","reviewDescription":"This fan has great airflow for bedrooms, but is very loud.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"……","reviewDescription":"I opened the box and didn't know where this little piece came from.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718928000000}
