{"reviewTitle":"2nd purchase","reviewDescription":"We liked our first purchase enough to purchase them again.  The second purchase has been disappointing for two reasons. The first negative is these brushes leak so it’s like brushing with a water pick.  The second negative is my first brush chewed up my gum in the first week.  I did replace it with another brush and it didn’t tear up my gums.We have two Oral B brushes and both leak while you brush a lot with the new tips. To be fair I have not contacted the manufacturer but when I do I will update my comments to reflect their input","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671148800000}
{"reviewTitle":"Not sure how authentic these are","reviewDescription":"I love putting new toothbrush heads on so I wanted to buy 4 at a time. I have bought them physically in the store before and had no issues. When these came they were a little sketch. The packaging wasn't the best and they had a strong smell that was not very good. I will not purchase these again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Newer version does not work with older models","reviewDescription":"Some vendors are selling the newer model under the listing for the old one. The newer model does not work on the older model handle (type 3709). If you have an older model toothbrush, be sure you get the older model heads. The differences are (see photos)1. The colored circle comes attached in the newer model and unattached in the older.2. The newer model is number 99372244. The older model is 4704132-00.If you use the newer model on the older brush, the fit is bad. The whole brush shakes instead of just the head. Two of them broke within 2 days. Returned them and received the older model, which are working flawlessly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1646352000000}
{"reviewTitle":"Great Until It Wasn't","reviewDescription":"Toothbrush was great when we first got it. Everything worked as it should and it definitely provides a much better clean than traditional toothbrushes (girlfriend used to get a lot of tooth infections - she didn't get any using this).However after less than 5 months of normal use the thing stopped holding charge and then just died. RIP toothbrush. I know it's a cheaper model but I feel like it should last longer than 5 months.I mean 1 year is a stretch but would 6 months be too much to ask for? Oh well, guess I'll have to buy another. Maybe the more expensive one will last longer?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644796800000}
{"reviewTitle":"So. Great price BUT...","reviewDescription":"Great price made me buy these Cross Action replacement heads. Unfortunately, they do not work with my toothbrush. Not sure why but maybe it has something to do with the fact they are made in a different country so the specs may not be the same. Pretty disappointing. Didn't say that they were made elsewhere or wouldn't fit American products.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663200000000}
{"reviewTitle":"On and off feature","reviewDescription":"Have just had it under a month. Will have to come back after I go to my dentist for the 6 month cleaning for a final review. So far the only issue is it’s hard to turn off and on. I press on the circle but nothing happens, I have to slide my finger down below that circle a little. I like the feature how it lets you know it’s time to move to the next section of your teeths better than the Phillip’s electric toothbrush I had","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648598400000}
{"reviewTitle":"Packaging in foreign language","reviewDescription":"I am returning these brush heads because I don’t think they will fit my toothbrush. It’s difficult to tell because the packaging was written in a foreign language that I can’t read!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672531200000}
{"reviewTitle":"Possibly legit, but definitely from a different country","reviewDescription":"The brush heads look exactly like the one that came with my toothbrush and they fit fine. The packaging is mostly in Turkish (I think?). Not a big deal for me, but it might bother others and it'd be nice if it said somewhere on Amazon that these aren't from the US when buying from the US site.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Legit brush heads????","reviewDescription":"The text on the package is completely in German, no English.  Are these brush heads legit Oral B, I guess only time will tell!  I tried them on my Oral B electric toothbrush and the seem to fit good.  Brush heads seem to be of similar design to the Oral B style that I currently have.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"Hard bristles","reviewDescription":"Well made but the bristles are quite hard. I’m a daily flosser but this bristle has destroyed my gums a bit","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Didn’t fit my toothbrush","reviewDescription":"As a follow-up - the other brush heads in the package were faulty. Sometimes of the stems fit,  but brush head, which seemed to fit the stem, would loosen from the stem to the point of falling off the stem!  Others were as listed in my first review below.I’ve been using these for about three years.  However this time, though I’m still using the same electric toothbrush, the brush stem is too loose for the toothbrush - they wiggle off while I brush - and the head wiggles and, if I’m not extremely careful, pinches my inner lips.  I’m hoping the other brush heads in this pack fit better and that this is just a fluke as the brushes are too expensive to just throw away.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1647820800000}
{"reviewTitle":"Fake oral b. Different from sold by Amazon one and head fell apart","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Shady","reviewDescription":"First of all it took like two weeks for me to receive this AND the packaging looked sus with all sorts of foreign language on it not the usual way things are labeled these days also , they fit but they don’t … it’s like the slots in the inside of the brush head are opposite the original one I have after purchasing my toothbrush which it came with . I’m going to return .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"Brush head got loosen an injured my lips","reviewDescription":"I received the oral B replacement brushes with the  package crashed. I was going to return the package then I thought the tooth brushes inside seemed to be ok so I decided not to bother.  I have been using the brush for a few weeks then my lips kept getting caught and pinched badly. I took a look a the brush and I realized the head got loosen up and created a space in between the brush and the handle.  I highly doubt this is an authentic product.  The print of \"Oral B\" getting blurred too.  My lips are in serious pain, not recommend!","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1653177600000}
{"reviewTitle":"Not the same as before. Cheap.","reviewDescription":"I’ve bought these toothbrush heads for years. This is the first time we’ve had problems with them. They’re cheap. The quality is not the same. My husbands has replaced his twice in one week and both (same package) are not spinning like they’re supposed to. I do like that the detached colored ring is no more. Now they’re are individually colored, but the quality is not good.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"They definitely cheapened the quality","reviewDescription":"I have used these heads\/toothbrush for years. I loved the heads as they were stiff and cleaned very well. This last batch of heads I received is a joke, one head lasted three days before the head stopped spilling and broke. I’m constantly being pinched by the spilling head due to the cheaper build quality. It’s really a shame they had to change these heads, because I loved them so much before.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"Not authentic Oral B product","reviewDescription":"I just got them today so I can’t say how they work, I’m sure they’ll be ok , they’re just tooth brushes. My problem is that they came in loose already opened packaging, the oral b logo on them are stripped and rubbing off, and the brushes themselves aren’t the same as the original, dull coloring and bristles don’t look the same, seems like a knock off, not an authentic oral b product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"Bad Batch of Heads","reviewDescription":"After years of ordering Oral-B replacement heads with no complaint, this latest batch is very inferior.  We usually don't check the origin of the product, if it looks like the ones we always order, but will be more careful in the future.  The heads slide off of the brush holder, the tops wobble very loosely in your mouth and generally are not secure on the unit.  3 out of the 4 are unusable.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1654992000000}
{"reviewTitle":"Knock offs","reviewDescription":"These are knock off brush heads.  The packaging of the individual brushes are not well sealed, the paper lifts right off the plastic.  The logo comes right off and looks different from the original oral b ones that came with the toothbrush.  Will not order again, and these were listed in the Oral B store on Amazon. In the picture the real brush is on the left, the one I ordered on Amazon on the right.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"Buyer Beware","reviewDescription":"I have been looking for a good price on Oral B replacement brushes but was leary to try these because I wasn't sure they would fit. The description said the product fit all Oral B electric toothbrushes. Well, the brushes I received were Oral B but there was no way that they would fit. Before purchase I read the questions. One person asked it the brushes would fit model number 3757, which is the same brush I have. The answer was yes. I don't see how that's possible since it didn't fit mine. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1608422400000}
{"reviewTitle":"Three heads included, box and order said four.","reviewDescription":"The box and order said 4 heads included;  only 3 were in the box and there was no evidence that the box had been tampered with. That is why I am only rating this product as a 3.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642982400000}
{"reviewTitle":"Not loving new design","reviewDescription":"Toothbrush works well. I replaced a previous model with this one Only problem is prior model had a rubber grip. This has only a modeled plastic grip that tends to slip out of your hand","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642723200000}
{"reviewTitle":"Non-English packaging (seller: RAH Retail)","reviewDescription":"Non-English packaging (seller: MAH Retail). Seems to be the actual Oral B brand, but packaged for sale outside the United States.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647302400000}
{"reviewTitle":"No real oral-B","reviewDescription":"These are not real oral-b brush heads. They fit a little tight and the bands that fit around the bottom broke after a couple of weeks use. Other than that they work as they should.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641859200000}
{"reviewTitle":"Cleans Great, but Messy","reviewDescription":"I like the way the Oral-B cleans, but the toothpaste\/saliva runs down your arms and all over the toothbrush.  No matter how I held it, it was very messy.  I don't like that, but was very impressed with how my teeth felt after brushing.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1616284800000}
{"reviewTitle":"Wrong amount shipped!","reviewDescription":"I ordered a package of four and only received a package of two. Amazon is crediting half the money, but I have to apply to another Amazon purchase. I feel duped. That being said, I love the product itself. Huge difference in how clean my teeth feel now.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614470400000}
{"reviewTitle":"Not happy with these brush head","reviewDescription":"They are too soft to remove the stains from your teeth , some other heads have plastic rubber to have a better contact with your teeth","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"mixed review","reviewDescription":"it's better than the regular ones, but not great--doesn't last long and leaves some debris between the teeth.the mad hatter","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629763200000}
{"reviewTitle":"Not the packaging as pictured - not for American market","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649203200000}
{"reviewTitle":"These brushes are a good value for the price.","reviewDescription":"The toothbrushes seem weak. Usually when I get these brushes from the grocery store, the first 0  or so uses, the brushes are very firm. These brushes were soft from the start. The price is unbeatable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606867200000}
{"reviewTitle":"Not authentic Braun toothbrushes.","reviewDescription":"I have ordered these toothbrushes twice before.  This time I received knock offs.  The bristles on the brushes were a different color.Braun has  blue bristles that turn light when it’s time to change your toothbrush.  The writing on the package was in foreign languages.None of them English!  I’m sending the package back.  I don’t want any substitutes.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1649030400000}
{"reviewTitle":"Caution: Product does not match description of listing","reviewDescription":"The product description and images listed are NOT the product received. Packaging is not in English, and does not match the official product found in stores. Use caution as this does not appear to be an official product, and the listing is misleading.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1674604800000}
{"reviewTitle":"Buyer beware","reviewDescription":"I just purchased a pack of 4 on 10\/12\/22 and received them 10\/14\/22 and am already on my third brushhead.  That's less than 3 months.  The brush head has broken off the shaft each time.  I would NOT purchase these again.  Very disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673136000000}
{"reviewTitle":"Junk","reviewDescription":"These are breaking in less than a month. The joint that swivels back and forth gets loose and it is no longer able to complete its back and forth brushing action when you apply it to your teeth. You'll end up just brushing your teeth manually...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669075200000}
{"reviewTitle":"Stops working after 2 months","reviewDescription":"I didn’t mind that the package was labeled in a foreign language. Unfortunately tho there is only a 30 day return window.  This worked fine for about 2 months, then it would just stop whenever it touched teeth. I put in new batteries but it didn’t fix the problem. Runs fine but as soon as you actually use it it shuts off. So basically it’s a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1637884800000}
{"reviewTitle":"Sharp ridge cuts my mouth","reviewDescription":"There's an angled ridge at the bottom of the brush which rubs against the inside of my lips and occasionally cuts\/irritates them. Maybe this is just an issue for larger people but it's super frustrating, and I don't even understand why it's there.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"Ordered  \"Amazon's Choice\" 4 pack got a two pack, instructions in four foreign languages, no English","reviewDescription":"Needed replacement brush heads for my Oral-B 1000. Read many reviews  warning of foreign knock-offs. Trying to to play it safe by ordering \"Amazon's choice\".  product arrived with a barcode clearly stating 4 brush heads. Package itself clearly showing two brush heads. Package had four languages, none of them English. I am beyond disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1646784000000}
{"reviewTitle":"Doesn't Seem Like a Genuine Oral B","reviewDescription":"I've ordered from this seller twice before and the replacement brush heads seemed fine. This time, the packaging is written in Spanish and the brush heads are different than Oral B heads. Since I live in the states, this packaging seems suspicious.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"Arrived wet","reviewDescription":"The box it was shipped in was dry. There is moisture inside the sealed package of toothbrush heads. I opened the package and the individually packaged heads were wet. They are in a plastic package with a paper type backing that was very wet. Each toothbrush head has a strange smell as well. I will sanitize them maybe or just toss them","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1631836800000}
{"reviewTitle":"Looks like non-original product","reviewDescription":"I rarely write reviews.  But it was a surprise to receive a non-original product of such poor quality.The difference between the used one and the new product is visible to the naked eye.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675036800000}
{"reviewTitle":"Not as pictured","reviewDescription":"The toothbrush heads I received look like knockoff. They made a weird noise in the toothbrush. Multiple languages in the package. Appears to be repackaged. The item that is pictured is not what you received.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1657065600000}
{"reviewTitle":"Deceptive","reviewDescription":"Full package display shows very little English language.  This is not the same product featured in the local, or even regional drugstore.  On the basis of deceptive advertising, I wouldn’t recommend this product or vendor","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1654819200000}
{"reviewTitle":"Package came in a different language.","reviewDescription":"I have no idea what I actually bought since I can’t read the language. The picture I thought I was buying is completely different. I don’t believe these are true Oral B brush heads. Returned","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"make such a terrible sound","reviewDescription":"i wanted to return the product after the first use bc of the terrible noise but i didn't bc of the good reviews but now after maybe a month its working maybe for a minuet and then shot off ,have to charge it again for 24 hour. Very bad product!!!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1630195200000}
{"reviewTitle":"Painful","reviewDescription":"For some reason, these brush heads are larger than the one my Oral B crossaction toothbrush came with and they hurt. They feel more abrasive. I just ordered different ones to see if they help.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"Knock off brush heads","reviewDescription":"Items shows Turkish, the paint seems lighter than my original oral-B product, not authenticate, why Amazon sells other countries products in the US?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1663545600000}
{"reviewTitle":"Oral B is a great line.","reviewDescription":"I'm sure the brushes are good quality, but I gave this a 1 start because I never received my package.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675209600000}
{"reviewTitle":"Awful brushes! Do not clean your teeth at all!","reviewDescription":"These brushes are absolutely terrible!! They are no better than having a cheap $5 battery operated toothbrush. All these brushes do is vibrate; therefore, they do not clean. Wish I had not let the return window close, otherwise, they would be going back! Live and learn.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"not what's advertised","reviewDescription":"Not even close.  German packaging.  Doesn't include the blue indicator bristles.  Clearly made for a different market. Spend the extra money and get the real product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1657584000000}
{"reviewTitle":"Waste of money","reviewDescription":"This lasted a little over a month, then it quit charging. What a waste of money. Won’t be purchasing an Oral B product again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1661817600000}
{"reviewTitle":"Review","reviewDescription":"Excellent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Good brush heads","reviewDescription":"Buying these on Amazon kinda sucks. I didn't want to buy the knock-off brand ones (since teeth are more important than saving a few bucks) so I wanted the official Oral-B ones but many reviews mention receiving counterfeits from the official listing. I wasted so much time trying to figure out which listings and sellers were legitimate and which were counterfeit. Why is it so hard to buy an authetic Oral-B brush head on Amazon?I finally took a leap and ordered from a seller with good feedback (Mitch Mel Corp). Thankfully I didn't get a counterfeit one. The pack of 4 I got was definitely a legit Oral-B one. The brush heads look and fit exactly the same as the one that came with my electric toothbrush (I have the Black 1000 one). I tried one and it worked perfectly.Glad I managed to get authetic ones from Amazon. The price isn't as good as the knockoff ones but like I said, your teeth is more valuable than saving a few bucks. A little expensive but worth the price.","isVerified":true,"ratingScore":5,"reviewReaction":"99 people found this helpful","country":"United States","date":1590105600000}
{"reviewTitle":"That the product is available through Amazon.","reviewDescription":"I’ve used an electric toothbrush for years so the replacements availability was important to me. I’m fact, I need to purchase more of them in the near future.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Fit","reviewDescription":"These fit the oral B electric toothbrush that I have.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Great replacement brushes","reviewDescription":"I have been using these replacement brushes for a long time.  I like that they are authentic Oral B brushes.  They are very durable, never had problems with bristles falling out or the brush breaking.  They fit the Oral B electric toothbrush perfectly.  They are a great value. I replace them every six months as suggested by my dentist and they always last that long.  I highly recommend these replacement brushes.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1656979200000}
{"reviewTitle":"I Look Forward to Brushing My Teeth!","reviewDescription":"This toothbrush  was purchased to replace my dear old Sonicare, which had died after many years of service. I switched brands with some trepidation, but to my delight and surprise, my new Oral-B has taken oral hygiene to a new level. I love the way the brush head massages my gums - it is soothing and quite pleasurable. Because of the smaller size of the brush head, it is much easier to reach all tooth surfaces. My mouth feels cleaner and healthier because of the gentle circulatory boost on my gums and the ability to more thoroughly reach all surfaces. Now, it makes a lot of noise - like a lawn mower heard through a window - but I do not care! The brushing results are superb.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1645315200000}
{"reviewTitle":"Just a perfect toothbrush.","reviewDescription":"I’ve always been a fan of Oral B toothbrushes. My last one having survived for 6 years.I wanted a mid range brush as I couldn’t justify To myself paying triple digits for a toothbrush.Having looked at a lot or reviews for various brushes I settled on this one. I’m not sure why there are so many reviews of people whining about the vibration of the brush on their teeth, it’s an electric toothbrush not a feather !Personally I cannot see the benefit of Bluetooth on a toothbrush but I’ve managed to pair it with Alexa and it now operates independently of me except on Saturdays when Alexa has the day off.It’s a lot lighter than my old Oral B and the charging light is a lot less bright which does mean I’ll have to turn on the bathroom light now.Hey ho, a price well worth paying. You won’t go wrong with this toothbrush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1597795200000}
{"reviewTitle":"Do not try cheap alternatives","reviewDescription":"After trying multiple cheaper alternatives to the Oral-B brand replacement toothbrush heads, I advise to stick with the brand-name in this case. There is a small hole on the back of the toothbrush head that in cheaper alternatives is placed lower than it is on the Oral-B brand toothbrush heads. For me, this caused a lot of irritation on the corners of my mouth as the internal mechanism would vibrate through that hole too much and tear apart the skin on the corners of my mouth. I do not recommend anything but the brand name.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1675296000000}
{"reviewTitle":"Excellent","reviewDescription":"This is my first time using a spin brush.  I got it from the recommendation of my dentist.I love it!  Easy to use, cleans thoroughly,  has a timer to let you know when it's time to change quadrants and flashes red if you are pressing too hard.  Charge lasts a few weeks. No batteries needed.  Replacement heads easy to chamge. Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"I recommend ordering from \"Mitch Mel Corp Same Day Shipping\" to ensure authenticity","reviewDescription":"They're exactly what you expect, replacement brush heads for Oral-B electric toothbrushes. I recently had to return a pack of them because they were counterfeit and was wondering what I could do to prevent making the same mistake again. I saw a few reviews saying that the brush heads they received from \"Mitch Mel Corp Same Day Shipping\" were the genuine article, so I decided to take a chance and order from them. The text on the package the heads came in was in German, which I found a little odd, but with the help of some online guides and videos, I was able to determine that the heads I received were, in fact, authentic. I'll definitely be ordering from them again the next time I need more.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1651622400000}
{"reviewTitle":"Works great for a low end brush. Good value.","reviewDescription":"Arrived promptly.  Easy set up and good directions. Could be sturdier but works well. I don't need a brush with a lit of extras this model fits my needs. Dentist recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"it saved me a trip to the dentist","reviewDescription":"I was going to visit my dentist to have my teeth clean. I didn't realize how bad my tar build up were until I checked my teeth. So, I bought this to give it a try. I could not believe they actually remove all my tar build up at least 98 percent. Just amazing. Well, it saved me a trip to the dentist office.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1666483200000}
{"reviewTitle":"Seem legit, however...","reviewDescription":"Aside from being in German packaging, the brush heads look exactly the same as the ones I've purchased from the store. I also got them much faster than anticipated, which was nice. I've already replaced my old brush head with a new one and they look\/feel\/perform like you'd expect from a brush head so they seem legit, authentic Oral-B brush heads. These fit both the Pro 1000 and Pro 1500.I would purchase again considering I can get a four-pack for a good price, as the ones I've purchased from the store usually only come in packs of two and are a little pricier.EDIT: I've purchased these a second time and the packaging is written in Arabic maybe? I guess I got lucky the second time because the brush heads still perform exactly the same as the last ones I had. Some people seem to be having issues with these but so far I've been lucky and got legit brush heads.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1603497600000}
{"reviewTitle":"Perfect fit!!","reviewDescription":"Items were delivered ahead of schedule and packaged well. Quality is great!! Will buy more of the same from Amazon!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Nice product","reviewDescription":"Nice product but expensive","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678320000000}
{"reviewTitle":"Inaccurate Description","reviewDescription":"Quality seems ok, but the heads I received are not white as indicated in the description.  They are black.  Not thrilled with them but too much hassle to send them back.  And yes, I realize there are much bigger problems in the world, but just wanted other buyers to be aware.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1663200000000}
{"reviewTitle":"As Advertised","reviewDescription":"Exactly what they say.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Works well","reviewDescription":"Brush rotates well does well in getting between teeth","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674345600000}
{"reviewTitle":"Okay but...","reviewDescription":"Don't like the built in timer that's supposed to guide you to brush parts of your mouth","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"They replace well","reviewDescription":"I've been using these for my brush for a couple of years. I'm pleased. They fit my unit, clean my teeth well. The price is a bit high, but the quality seems to be there. I change my head every 6 months (with my cleaning) so this 4 pack will last a couple of years for me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649289600000}
{"reviewTitle":"Knock off, terrible quality","reviewDescription":"Terrible quality all round, heads falling off. Don't buy!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1644624000000}
{"reviewTitle":"these are grey market,i don't know what language was on packaging,i assume its what i ordered","reviewDescription":"didn't expect to buy a product from another country","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649635200000}
{"reviewTitle":"Received Knockoff. Not Original. Cardboard packaging written in Slavic.","reviewDescription":"Received Knockoff. Not Original. Cardboard packaging written in Slavic.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1645660800000}
{"reviewTitle":"Very cheap feeling. Only lasts like a week","reviewDescription":"It felt like it their lowest end of their toothbrush heads","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1627948800000}
{"reviewTitle":"Turkish packagine","reviewDescription":"The product has packaging in Turkish rather than English.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647820800000}
{"reviewTitle":"Does not fit!!","reviewDescription":"Did not fit my oral b sonic care electric toothbrush as described.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1625529600000}
{"reviewTitle":"Scam heads","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660608000000}
{"reviewTitle":"Too harsh","reviewDescription":"Sorry, but had to throw these away. They feel like they would take the enamel off your teeth.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1600473600000}
{"reviewTitle":"Doesn't match picture. Foreign rip off looking. Not even sure if its legit.","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1641513600000}
{"reviewTitle":"Returned, defective","reviewDescription":"Every after 2 full days charging, it would not turn on","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1623542400000}
{"reviewTitle":"Blood on package + from another country","reviewDescription":"The first thing I noticed was everything was in a different language. Then I noticed dried blood.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650672000000}
{"reviewTitle":"Open and dirty not oral b’s fault","reviewDescription":"Was open and dirty","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1669766400000}
{"reviewTitle":"Imported from Turkey","reviewDescription":"I’m not sure if this is a genuine product, but it is not the same packaging as in the photo. The packaging is in Turkish.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1634774400000}
{"reviewTitle":"Knock off","reviewDescription":"Recieved strange version of alleged product, entirely in Turkish or Arabic.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"not real knock offs, open package","reviewDescription":"not real knock offs, open package","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1659484800000}
{"reviewTitle":"Shut on and off as I’m using it","reviewDescription":"The product works great however shut off by itself to her three times as I’m using it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1627862400000}
{"reviewTitle":"This is not real oral B product","reviewDescription":"Received this in German, so I don't think it's American product and it's not the same quality. Disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1608249600000}
{"reviewTitle":"They were terrible they lasted only a day or two before I had to throw them away!!!!","reviewDescription":"Brushing my teeth. They certainly were not Oral B’s usual quality.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1651276800000}
{"reviewTitle":"Did not work after one use","reviewDescription":"This toothbrush would not accept a charge after 1st use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1636761600000}
{"reviewTitle":"Horrible hurt my dental work","reviewDescription":"Oh my gosh. I have several crowns these toothbrushes are so rough I feel like the loosened my crowns. Just horrible do not buy","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1589846400000}
{"reviewTitle":"Knock off brush heads","reviewDescription":"These brush heads are clearly knock offs. Not true Oral-B product. Do not buy","isVerified":true,"ratingScore":1,"reviewReaction":"97 people found this helpful","country":"United States","date":1603929600000}
{"reviewTitle":"What is source of product?","reviewDescription":"Not from the USA.No English on either side of package except for Oral-B Cross Action Clean Maximizer in the front.Cannot evaluate item as I am considering returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1648857600000}
{"reviewTitle":"Wears down quickly!!","reviewDescription":"The firmness of the bristles is gone within just two weeks and the tips of the bristles also start to discolor suggesting the brush needs to be replaced. Definitely not worth it!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1644364800000}
{"reviewTitle":"Not for sale in America","reviewDescription":"This product is not for US distribution. The packaging is 100% foreign language.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"Very bad product. These bristles are of no use. Don't clean your teeth well","reviewDescription":"Very bad product. Dont waste your money. It doesnt come anywhere close to original Orabl B bristles which clean your teeth thoroughly","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"No instruction in English.","reviewDescription":"The package has no English instruction.  All languages are foreign.  Unused.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665964800000}
{"reviewTitle":"Packaging not in English","reviewDescription":"The product appeared to be what I ordered, but the packaging did not include English. There were at least 3 languages, but not any I can read.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650412800000}
{"reviewTitle":"Maybe defective.","reviewDescription":"These brush heads stop spinning after a week's use.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1676678400000}
{"reviewTitle":"Disappointed","reviewDescription":"These replacement heads go bad after a few uses and do not make your mouth feel clean no matter how long you brush.  Waste of my money.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1627171200000}
{"reviewTitle":"Foreign manufacturer","reviewDescription":"I don't know where these came from but they are not what I ordered.  All foreign language on the package.  Can't read any of it.  See the photos.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1640908800000}
{"reviewTitle":"Was good while it lasted","reviewDescription":"Bought this because my dentist advised me to buy one. Was a good price and good product but motor only lasted a little under a year so now I'm brushing my teeth with an eletric toothbrush that dosnt work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667174400000}
{"reviewTitle":"I was sent the wrong color of toothbrush head","reviewDescription":"The product is fine, however I was sent the wrong color of toothbrush head.  Now have 3 more black toothbrush heads to go with my white toothbrush","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668124800000}
{"reviewTitle":"Moldy","reviewDescription":"The product is really nice especially for our being my first electric toothbrush. My biggest complaint is this that the toothbrush heads get moldy even after taking them off and rinsing them after each use.  I have gone through too may of the heads since buying the toothbrush.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657584000000}
{"reviewTitle":"Not the ones with flossers","reviewDescription":"I thought these were the ones with soft plastic flossers but they're not.  These just have bristles and don't seem to last as long","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"Odd version of these brushes","reviewDescription":"I’m a bit dismayed that I got a foreign version of these brushes.  I’m not sure of the language but I wish I’d been informed beforehand.  I am sure they’re fine but they don’t look like the brushes I’m used to so that’s disappointing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662076800000}
{"reviewTitle":"Good brushes with different color base","reviewDescription":"Brushes work fine.  But did not expect the plastic base to be black instead of white like the handle.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Ordered white, received black","reviewDescription":"They work fine and appear to be genuine Oral-B, just annoying that I ordered one color and received a different one. That's the price you pay for Amazon I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663113600000}
{"reviewTitle":"Oral B Tooth Brush heads a bust!","reviewDescription":"Disappointed for the 2nd time with these tooth brush heads! Not nearly as firm as I anticipated when I ordered","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663545600000}
{"reviewTitle":"They shipped a black toothbrush…that is not what was represented.","reviewDescription":"Good quality, thought I was getting a white toothbrush. It was black. No bueno.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662940800000}
{"reviewTitle":"Wrong brush heads - Thought this was for the Oral-B Pro 3000","reviewDescription":"The purchase of my Oral B Pro 3000 toothbrush showed these as an add on.  I should have checked better which next time I will.  I assumed wrongly that if amazon showed these brush heads to add on to purchase would be the correct brush heads for the toothbrush I was buying.  Unfortunately I started to open the package so now I assume it can not be returned.  Bummer will be now buying the brush heads for the Pro 3000","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1592352000000}
{"reviewTitle":"as expected","reviewDescription":"Works well, looks nice at night - if you want to attach them to a wooden structure they do not include anything for that purpose","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1597190400000}
{"reviewTitle":"Good Service","reviewDescription":"Ordered replacement heads for electric toothbrush.  Received promptly, well packaged.  Good price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608249600000}
{"reviewTitle":"retraction of original review","reviewDescription":"They are individually wrapped - yes they are made in another country as entire package is in another language. But, seem like good quality.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1594944000000}
{"reviewTitle":"n\/a","reviewDescription":"n\/a","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622419200000}
{"reviewTitle":"Cleans teeth really well.","reviewDescription":"I liked the feel of my teeth after brushing with the Cross Action and I can't find a dislike to report.Thank you","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579305600000}
{"reviewTitle":"Thank you","reviewDescription":"Thank you","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"good purchase","reviewDescription":"not sure which of the toothbrush heads i got, but it's pretty firm. fits my oral b toothbrush perfectly","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1559606400000}
{"reviewTitle":"Fit Oral B 3000 series","reviewDescription":"These were the best price for the amout I recieved.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1585008000000}
{"reviewTitle":"Great Buy","reviewDescription":"It does the job well and for the price paid it's a bagain.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Good","reviewDescription":"👍","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608076800000}
{"reviewTitle":"did not last","reviewDescription":"First one lasted maybe a month before the head got all wobbly and loose, second one lasted maybe 2 weeks","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Knock off","reviewDescription":"The oral b logo rubs off with your finger right out of the package. They are very noisy not like the one's you buy in the store.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1659052800000}
{"reviewTitle":"Breaks Easily, Cut my Mouth","reviewDescription":"The heads are priced well. However, after 3 uses, the head broke and tore up my lip. The next head I tried did not spin. These are knock off heads and certainly not \"Oral B\" brand. Buyer beware!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1644019200000}
{"reviewTitle":"Failed in 10 days","reviewDescription":"First Oral B brush head failed to rotate in 10 days, second was loose and noisy in a week.  Returned and bought original Oral B brushes local.  Working fine on rechargeable and battery units","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1645833600000}
{"reviewTitle":"I guess you get what you pay for after all","reviewDescription":"These brush heads appear to be either rejected by quality control, or knock offs. I compared the brush heads with Oral B originals and the bristle density of the ones I got via Amazon was so low, that I very much doubt Oral B would have accepted the lot from the manufacturer. I returned them for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1563667200000}
{"reviewTitle":"Worse clean for Oral-B","reviewDescription":"I have been an Oral-B user for 10 years now.  This new set has me thinking of switching.  I constantly feel my teeth are dirty.  I find myself just brushing manually, seems to work better.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1641340800000}
{"reviewTitle":"Only  2 brush heads were present.  Terrible experience as a result.","reviewDescription":"The toothbrush package was opened in the shipping box and 2 brushes were missing.  It was a terrible experience.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Not as good as the cross action heads","reviewDescription":"I thought these would be better but I'll stick with the cross action. These don't remove plague from your teeth like cross action does. They also turn white, signaling a change of head, about twice as fast.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Do not purchase - Gray market product","reviewDescription":"This is not from Oral B. The back label (see above) looks sketchy AF, and I'm quite curious why there is a sticker over part of the label specifying that the product is new. Returning!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1635638400000}
{"reviewTitle":"Arrived broken","reviewDescription":"2 of the 4 arrived broken. I'll just buy these at physical retails from now on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Heads work as advertised","reviewDescription":"Brush heads worked as advertised, came in an \"Oral-B\" box Distributed by P&Gamble","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635897600000}
{"reviewTitle":"Electric Toothbrush","reviewDescription":"I've only used it twice and it works great. I was expecting a timer to go off in 2 minutes but I probably need to read the instructions over.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620864000000}
{"reviewTitle":"It's Alright","reviewDescription":"I like the ones with the yellow flossers on them better. With peace and love.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Muy buen material 👍🏻👍🏻","reviewDescription":"Todo está perfecto!!👍🏻👍🏻","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"just bought it--hard to assess","reviewDescription":"I just bought it--easy to use. Otherwise it does what it's supposed to do--scrubs my teeth!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628726400000}
{"reviewTitle":"good product","reviewDescription":"useful at a fair price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632960000000}
{"reviewTitle":"They work","reviewDescription":"I like it just fine.  I used them for my Oral B toothbrush.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628035200000}
{"reviewTitle":"Good size and comfort","reviewDescription":"Very comfortable large heads that are noticeable better than the generic brands. Still overpriced and not an attractive designed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1621555200000}
{"reviewTitle":"good product","reviewDescription":"good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644192000000}
{"reviewTitle":"It does what it’s needed to do","reviewDescription":"The price is right also it does what’s it’s required to do. I’m satisfied","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626825600000}
{"reviewTitle":"Revised Review","reviewDescription":"I previously said I had received a different version than I ordered. Although there are physical differences between what I received and expected, I found markings identifying this as the correct item. I suspect it was an earlier production, but it was as described and I'm satisfied.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672531200000}
{"reviewTitle":"As expected","reviewDescription":"It’s a toothbrush head. It works.  Nothing more to say really.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659744000000}
{"reviewTitle":"Good value for this product.","reviewDescription":"Use this product regularly and fine this price is more than reasonable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635897600000}
{"reviewTitle":"Brushes good","reviewDescription":"Brushes the teeth good. What don’t like is it feels like I am sticking a drill on my teeth.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642118400000}
{"reviewTitle":"Label is not in English, but the product works sufficiently.","reviewDescription":"I was a little off put by the fact that the label was written in German. I was not sure if I had mistakenly ordered the wrong item. Fortunately, even though I was unable to read the label; the product was exactly what I needed. The brush head fits my toothbrush and works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1591315200000}
{"reviewTitle":"Too early to rate","reviewDescription":"You need to use this item for a while to see how it performs. These brushes have bristles a little longer and stiffer than the original ones so they feel different.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636416000000}
{"reviewTitle":"Cleans my teeth!","reviewDescription":"Easy install and disposal","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630195200000}
{"reviewTitle":"Product box may come in different languages","reviewDescription":"Product details on the box were in Turkish for some reason. Good value for amount of brush heads but being able to read the details would’ve been a nice touch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Good product but lower priced elsewhere.","reviewDescription":"Durable and well made product. But much better prices are available elsewhere.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643241600000}
{"reviewTitle":"Higher cost than expected.","reviewDescription":"Purchase experience was easy .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630108800000}
{"reviewTitle":"Good wear life","reviewDescription":"These brushes are pretty sturdy. I would say you will probalby need a new brush every 4 months. They feel great in your mouth and are easy to attach. I just with they had black ones.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1645142400000}
{"reviewTitle":"My son loves","reviewDescription":"I bought these for my son. He said he likes them better than the original head that came with toothbrush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1661904000000}
{"reviewTitle":"Oral B is great, will not buy the no name brand brush heads again!!","reviewDescription":"Oral B cleans your teeth better than any other brand!!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1666224000000}
{"reviewTitle":"Great value for the price compared with buying in a retail store","reviewDescription":"These work great and are very durable. Much more affordable to purchase online here rather than in a retail store!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"These are legit","reviewDescription":"If your wondering if these are the real thing or a knockoffGuess again, there the real deal and priced right!They fit my oral b Electric toothbrush perfectlyThese toothbrush heads are amazing, they really do give you that extra floss like between your teeth keeping them whiter and cleanerI recieved 4 in a package and they all were sealed in there own individual package inside of the main package","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1583280000000}
{"reviewTitle":"Perfecto","reviewDescription":"Buena función y efectivo","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"The best!","reviewDescription":"The best spin brush heads I’ve ever used. Like I came from the dentist after every brush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1662681600000}
{"reviewTitle":"here is the news","reviewDescription":"does a terrific job of cleaning teeth - it was worth the short wait. great company","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"they work on. the orlando  tooth brush","reviewDescription":"their isn’t any thing I do not like about it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1664755200000}
{"reviewTitle":"Good Value","reviewDescription":"Found that these were the good price on Amazon and so far they seem to be holding up well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1661299200000}
{"reviewTitle":"The brushes work well with my 3 year old handle","reviewDescription":"It fit on my handle very well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1594598400000}
{"reviewTitle":"Quality","reviewDescription":"They are as described and what I need and expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1589155200000}
{"reviewTitle":"Very nice","reviewDescription":"Save money and time","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581724800000}
{"reviewTitle":"replacement brushes...","reviewDescription":"color code ring to place on head","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1575590400000}
{"reviewTitle":"NOT SURE YET","reviewDescription":"TO DO BETTER CLEANING","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1562889600000}
{"reviewTitle":"SHIPPING ISSUE","reviewDescription":"Product is great as described, check shipping took 2 weeks to get.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1552262400000}
{"reviewTitle":"Works well","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577923200000}
{"reviewTitle":"Good for the price","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1565827200000}
{"reviewTitle":"Good","reviewDescription":"Not bad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1558137600000}
{"reviewTitle":"Great for Sensitive Gums & Teeth.","reviewDescription":"I've been using Oral-B's more elaborate and abrasive heads for years which only aggravated my sensitivity. Finally my new dentist suggested steering clear of coarse whitening toothpaste (my teeth have been whitened professionally already, ouch.)  and stiff, aggressive brush heads. Never looking back.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622592000000}
{"reviewTitle":"Fits my oral B electric toothbrush","reviewDescription":"Ordered these replacement heads for my electric toothbrush they fit perfectly, they’re just like the original that came with it.I’m very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1660435200000}
{"reviewTitle":"Product was meant for a different country.","reviewDescription":"I needed to order Oral-B toothbrush refills and the website showed the correct product, however when I received the package, it was clear item was meant for a different country. The labeling was in a different language. This is just bad business in my opinion.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Nice product","reviewDescription":"Good product for value.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Brushes well","reviewDescription":"They fit my Oral B.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675900800000}
{"reviewTitle":"Great Replacement Brushes","reviewDescription":"I didn’t realize how badly I needed replacement brushes for my electric toothbrush until I used these. I had been using generic replacements and as soon as I put these on, I immediately felt the difference. Worth the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"half the price in stores","reviewDescription":"Purchased these to replace generic ones which used to catch on my lip. These are perfect and were half the price in stores. Fast shipping A+++","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1659744000000}
{"reviewTitle":"Universal oral b fit","reviewDescription":"Good product that arrived quickly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Good Price","reviewDescription":"Great Price, Fast Shipping and Thanks Amazon","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674864000000}
{"reviewTitle":"Good replacement brushes","reviewDescription":"These work well as replacement brushes. They were in a different language, but look to be from the manufacturer","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1668902400000}
{"reviewTitle":"Best to have the original.","reviewDescription":"Good product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674950400000}
{"reviewTitle":"Perfect Refill!","reviewDescription":"We’ve had this particular toothbrush for quite sometime. The convenience of the refills on Amazon are well worth the money for the number of heads you receive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Good price","reviewDescription":"n\/a","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"I love it!","reviewDescription":"I switched to this. My dentist said my teeth look so much better. Tip put the brush on your tooth while it’s spinning and do it for each tooth. It cleans so much better!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1656720000000}
{"reviewTitle":"Great","reviewDescription":"Great brush","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676073600000}
{"reviewTitle":"Oral B Cross-action brush head","reviewDescription":"I like these better than the floss action brush head","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"SPEEDY DELIVERY","reviewDescription":"When your electric toothbrush is missing the brush you want a prompt replacement because the manual version of your youth just does not feel like it’s doing the job.  Prompt replacement is a high priority.  Amazon did NOT disappoint.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1646179200000}
{"reviewTitle":"Better Than Buying In - Store.","reviewDescription":"Buying these toothbrush heads online thru Amazon are really a great value. When I buy them at Walmart, Target, H‑E‑B, etc. they come in a 2 pack & sell upwards of $20. Personally I know I'm still buying the Oral-B brand but I think that they leave my teeth feeling cleaner & last longer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1632528000000}
{"reviewTitle":"As listed","reviewDescription":"Product is what is shown in the picture and description","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1668470400000}
{"reviewTitle":"Oral B brush replacement","reviewDescription":"I bought these replacements for my Oral B. I had bought some generic replacements at a discount store.  They were awful.  I decided yo go and buy these from Amazon.  They came quickly, and were perfect.  I learned a lesson.  Buy quality, not cheap and generic.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"Best brushes","reviewDescription":"Cleans teeth very well.  Nice and sturdy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672963200000}
{"reviewTitle":"Good value for the money","reviewDescription":"Lasted longer than I thought it would.  Good bristles and did a good cleaning job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1666224000000}
{"reviewTitle":"Great toothbrush heads","reviewDescription":"The brush heads fit in easily. The are firm yet soft for the teeth. I am so impressed how well my teeth get clean using oral b cross action brush heads.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1659657600000}
{"reviewTitle":"Excellent!!","reviewDescription":"I have very sensitive teeths so I always do a research before buying teeth products. With full honesty I can tell you that this product is high quality. I received them last then a week in a durable packaging!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1646697600000}
{"reviewTitle":"perfect for me !!!!!!!!!","reviewDescription":"i had another one before , and it stayed with me 3 years, so i wanted the same and so i did find it , i love it , so easy to use, so easy to clean , it is perfect for me","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1640908800000}
{"reviewTitle":"Great brush replacements","reviewDescription":"Love how these clean my teeth had to try them out after the original one on my brush wore out will definitely keep buying these","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1661731200000}
{"reviewTitle":"Good replacement","reviewDescription":"I like this this cross action brush much better than the standard brush. I’m don’t know about the longevity or durability yet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1662854400000}
{"reviewTitle":"Worth the investment!","reviewDescription":"We bought this to improve my hubby's dental plaque. It really works well and he feels as if he spent even more $$ at a professionals cleaning. I bought extra brushes and change out for each of us.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Worth. Every. Penny.","reviewDescription":"I highly recommend this product as it works wonders. It’s like having a dental cleaning daily. I have used the off brands and they don’t compare. Don’t waste your money trying them. I switched back to these and within one brush my build up is gone and my tongue is actually clean! Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1626825600000}
{"reviewTitle":"A winner for Oral B!!","reviewDescription":"The \"cross action\" of this brush head for the Braun Oral B electric toothbrush is amazing! It brightened my teeth- even between teeth- like no other brush head before. I've happily used an Orab B electric toothbrush for several years but this newer brush head is a very welcome addition for my 74-yr old mouth. (It's the little things in life... 😀)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1616025600000}
{"reviewTitle":"Good price compared to drug stores","reviewDescription":"Hubby says there perfect replacement for his oral B . Some heads have hard rubber on them he likes them because soft","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Better than anything else I've tried.","reviewDescription":"I used it to brush my teeth. They are better than another brand I used.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672617600000}
{"reviewTitle":"Oral-B brush heads are the most expensive component of the tooth brush system","reviewDescription":"Oral-B brush are offered in multiple designs and multiple quantities.  Amazon web pages enable identifying the best unit pricing with the most practical number of units to buy.  Four brushes are a year supply with a 3-month change interval.  Twenty brushes would support 5 years of brushing at a cheaper unit price, brushing with a 5 year old brush head may not be appealing.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1628640000000}
{"reviewTitle":"Good Product","reviewDescription":"I felt that this was worth the money I think it does a very good job of cleaning your teeth and reasonably priced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"Works great","reviewDescription":"Been using them before writing this review. At this point on my second head. No difference in quality I can tell from ones I bought at stores. And better priced. You get four instead of two or three for the same price. Last approx 3 months, same as store bought. Writing on back looks like HINDI so maybe INDIA mfg. But just as good as any I have bought in store with ORAL B brand name pkg.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1618617600000}
{"reviewTitle":"Good heads","reviewDescription":"Very good quality! I loved it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675900800000}
{"reviewTitle":"Good brush heads.","reviewDescription":"These do exactly what you expect them to.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Nice bristles","reviewDescription":"Teeth brushing","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Good buy for the money.","reviewDescription":"Convenient- good buy for the money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Very strong and last long!","reviewDescription":"I learned a lesson! Don’t buy cheap replacements!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"Brush it","reviewDescription":"Good price for the pack","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Good Toothbrush","reviewDescription":"These Oral B brush heads are a good value and they work well.  Will order again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Exactly what I was looking for!","reviewDescription":"I needed to replace my brush heads for my Oral-B Pro-5000 and this does just the job. I love how neatly packaged it was and how it feels on my teeth. Durable and firm but doesn't feel like it's hurting my teeth. Will definitely be buying again, in a year probably since these can last quite a while!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1655078400000}
{"reviewTitle":"They look legit and authentic","reviewDescription":"Last time I ordered these heads I chose the \"3 count\" option. I got the ones that other people were referring to, i.e. with no blue heads in the middle, but all green. The packaging was also in German so I assumed they must be some international version or something. They did function very well and I had no problems whatsoever. This time I ordered the \"Pack de 4\" option, and I got the ones with the blue brushes in the middle, i.e. the look is closer to the \"original\" heads. The packaging also has english on it (looks like the main language of the packaging) and other languages. I'm posting some pics of the package. I haven't used them yet, but I don't think they'll be any different from the other ones.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1589500800000}
{"reviewTitle":"Work well, hard to remember to replace them when you're supposed  to","reviewDescription":"Perfect replacement, my favorite head and the only one I use. When on sale it's a good deal and they do have color fade to indicate when to replace them, I'm just lazy with it","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1668211200000}
{"reviewTitle":"Dentist recommends replacing my toothbrush after every appointment.","reviewDescription":"My dentist always recommends replacing my toothbrush after each visit and I go to the dentist every three months and always use Oral B.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Cross Action Replacement brush heads clean teeth better than other replacement brushheads.","reviewDescription":"I have been using cross action brush heads for several years. My first electric tooth brush was an Oral-B and I used the brush heads for sensitive teeth at my dentist's recommendation.  After a while I tried the cross action brush heads and felt that my teeth felt cleaner. I watch the light on the electric toothbrush so that I don't put too much pressure on my teeth and haven't had any problems using the stiffer brush.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1635638400000}
{"reviewTitle":"Have ordered these many times","reviewDescription":"I have had zero issues, the brush heads fit my oral-B well, no problem! For the money, I am happy with purchases and see nothing that leads me to believe these are below standard. Be sure to check the bottom of your device to be sure you are ordering the correct brushes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1655251200000}
{"reviewTitle":"100%","reviewDescription":"The stubby bristle design really works well cleaning teeth.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Buy Cross Action Only!","reviewDescription":"The Cross Action Electric Brush Heads cleans my teeth better than the other kinds of brush heads.  I've tried them all in the last 10 years.  These are by far the best!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"There perfect replacements","reviewDescription":"They replace the head whenever you want them too. Once a month does the trick but my wife replaces every 2 weeks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672272000000}
{"reviewTitle":"Great!  Got 3 and 1 free!","reviewDescription":"For my son's new toothbrush.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Good","reviewDescription":"Good brush heads","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"The brush heads do not last very long.","reviewDescription":"I like these brush heads","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673481600000}
{"reviewTitle":"Name brand is better","reviewDescription":"I’ve tried buying the cheapie toothbrush heads for my oral-b toothbrush and they end up not working and are not of good quality. These are great! Sometimes name brand is better!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1664582400000}
{"reviewTitle":"La calidad","reviewDescription":"Los dientes","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Nice replacement toothbrush","reviewDescription":"Nice replacement toothbrush...but I find myself still using my manual toothbrush because my teeth feel Cleaner? Perhaps I'm not brushing long enough? I'm considering upgrading my Waterpik unit, which I credit for keeping me out of the dentist office for 18 months+! I routinely spent $2000+ annually at the dentists office due to gum issues & cavities. I now swear by daily Waterpik use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643587200000}
{"reviewTitle":"Does a good job","reviewDescription":"I like these toothbrush heads. They do a good job. Last a long time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"ok","reviewDescription":"sent overseas","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"It really works to keep my teeth clean","reviewDescription":"Like Oral B and have been using them for many years","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1663459200000}
{"reviewTitle":"Ordered 4 white, got 4 black. They work fine.","reviewDescription":"Ordered 4 white, got 4 black. They work fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662076800000}
{"reviewTitle":"Knock-offs","reviewDescription":"Like most people who use electronic toothbrushes, we all know how expensive the replacement brush heads are. So, again like most people you start searching around for cheaper options. I came across these “Oral-B” Cross Action brush heads which had an awesome value. Seemed to good to be true but I figured I would just see for myself. Once the package arrived the first thing I noticed was that there were a LOT of different languages on the back of the package as well as the misspelling of Sonic Complete in English (spelled Complate). Once I opened the package I noticed that those colored plastic rings on the bottom of the brush heads were already installed on the brush heads. If you’ve purchase Oral-B brush heads before you know that the colored plastic rings are loose in the package and it’s up to you to install them on the heads. Just to make sure I wasn’t crazy I went to my local Target and purchased a package of Oral-B Cross Action toothbrush heads to compare. Upon comparing the two, one difference is the plastic the heads come in. The ones from Target were a softer plastic while the ones from Amazon were a much harder plastic. Also, the imprint on the plastic from the ones at Target are stamped “PFT” while the ones from Amazon are stamped “PET.” Moving on looking at the bristles you can see that they are different as well. Another note is the Oral-B print on the neck of the head. The ones from Amazon had completely come off after only about a week or two of daily use. The one from Target did not seem to have been affected. While the ones from Amazon are a great value, know you are NOT getting a genuine product from Oral-B. And it’s important to think about exactly how they are made and with what (i.e. chemicals, etc) that could be harmful to your teeth and health. Considering the great value these replacement heads are, I think I will pay the extra money for a genuine product from Oral-B for peace of mind. With all that being said these ones from Amazon do seem to work and perform as an electronic toothbrush head should.","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1653782400000}
{"reviewTitle":"Doesn’t work after a few brushes","reviewDescription":"When I first install these, they work for a few days then stop rotating properly. The first head that came with my brush lasted a while, but these break quickly. After they break it’s like brushing with regular brushes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675468800000}
{"reviewTitle":"2 stars because I got 2 brushes but paid for 4","reviewDescription":"The product is swell, but I didn’t love that I purchased a 4-pack and only received a 2-pack. My teeth and I will not stand for this heinous injustice. I take my oral hygiene seriously.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Not as advertised","reviewDescription":"Listing indicated the color was white, but product I received was black.  Works the same so I will keep, but my toothbrush is white so I don’t lkke having the head black.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673654400000}
{"reviewTitle":"Not made for the US market","reviewDescription":"I sent this package back. The package said it is made in Germany for the Turkish market. I really didn't know if the brushes were the same as the ones for my handle. Really did not appreciate that they did not disclose that these are not for the US market.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662336000000}
{"reviewTitle":"Not actually oral b","reviewDescription":"These brushes are abrasive and not actually by oral b. If you go from using an original oral b head, you’ll notice how coarse these fibers are. They almost scratch my palate. I have dropped my toothbrush many times and the original oral b heads never break, but this one broke right away. The head came off the neck. Not going to order again","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1647129600000}
{"reviewTitle":"Product labeled in Turkish and Kurdish","reviewDescription":"Looks suspicious! I verified with Oral B that product is authentic.  It came in very worn packaging labeled in Turkish, Kurdish and another language I don't recognize.  Worst part is that packaging is worn and close to expiration date.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1658707200000}
{"reviewTitle":"Different Language","reviewDescription":"It looks like it will fit but it’s in a completely different language.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677283200000}
{"reviewTitle":"Not a product for US sales","reviewDescription":"Other people mention German packaging.  I got the exotic model!  My packaging has Turkish, Russian, Uzbek, and a fourth language I couldn't identify.  I won the knockoff lottery!Haven't opened or used them yet, but already I'm underwhelmed.  I got what I paid for.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1642032000000}
{"reviewTitle":"Wrong Color","reviewDescription":"Product is not described as black and pictures show white. Pretty irritating, but not worth the trouble of trying to return them. Ugh.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665273600000}
{"reviewTitle":"Defective products.  One loose head. Second does not stay on oral-b base.","reviewDescription":"May have to return all 4 from pack.  First 2 opened were defective.  Brush head loose on the first.  Second does not stay on the base.  I should still be on the first one but got tired of it shaking around while brushing.  Second one comes off during brushing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Not as shown and misleading","reviewDescription":"It showed up with what appears to he Turkish language written all over it. There is really no way to know if it's a legit product or not. What you pay is what you get but I feel it was misleading what I received vs the picture they put in the listing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Poor quality knock off","reviewDescription":"I have bought these from amazon a number of times without issue. This time, the brush heads seem to be loose and the bristles are flimsy. The looseness of the brush head causes a pinch point so I am throwing them away. Unfortunately I am beyond the return period.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"Does not fit ALL Oral B toothbrushes","reviewDescription":"The order was fast and the package was fine, but unfortunately, the replacement heads do *not* fit all oral b toothbrushes. The seller did mention the brushes \"Fits ALL Oral-B electric toothbrushes except Pulsonic\" well I don't have a Pulsonic and they didn't fit. Seller doesn't allow returns so double check your product and replacement requirements.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1631836800000}
{"reviewTitle":"Rough","reviewDescription":"I have been using these brush heads for many years.usuallly I get them at walmart.these are so rough they actually hurt my gums.very unhappy with this purchase .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Not what I ordered","reviewDescription":"A little disappointed that the picture and description lead you to think that these are the oral B brand like in the store. It should be fixed as to not mislead the customer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1662422400000}
{"reviewTitle":"Check your order","reviewDescription":"Check your purchases. Didn’t check my item right away only to find out this is some international version of the toothbrush head, and I don’t know if it’s fake or not. I’m way over the return window and wasted $25.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663027200000}
{"reviewTitle":"Not Oral B","reviewDescription":"Never fails if I don't check reviews I regret it. These are total knock off. The bristles look nothing like true oral B and they are spaced too far apart. And packaging is in another language. Don't buy.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664323200000}
{"reviewTitle":"Believe the reviews, these are not official","reviewDescription":"These are not official replacement and trust me when I say, they definitely feel FAR from the actual products. Save your time, buy the actual replacements from the official website. Otherwise, you’re rolling dice on these.","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1623369600000}
{"reviewTitle":"Do not buy","reviewDescription":"These are not authentic oral B they are so abrasive, I got an abscess between my teeth and gums in two places after using for about two weeks. Spent big bucks at the dentist getting them cleared up. Such a deal","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1649548800000}
{"reviewTitle":"good for money","reviewDescription":"good and east to use for money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639699200000}
{"reviewTitle":"Extra Toothbrush Part","reviewDescription":"looking forward to replacing the old with the new when needed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Cracked","reviewDescription":"One of the heads was cracked.  It was still a good price for three instead of actually getting four","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1619568000000}
{"reviewTitle":"Foreign language?","reviewDescription":"Packaging in foreign language (turkish?) as well as english. Also, does not list comparability with Triumph model. Makes me wonder if these are real or if they're counterfeit.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1609027200000}
{"reviewTitle":"Too hard","reviewDescription":"Mine were to hard... But I have sensitive teeth so it may be fun for you","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616198400000}
{"reviewTitle":"Oral B","reviewDescription":"They are identical to my original brushes. They work fine, But they have a plastic smell when i'm using them. I can't taste it but I smell it when the brush is rotating.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1562544000000}
{"reviewTitle":"Prob won’t buy again","reviewDescription":"Softer bristle than I wanted","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629072000000}
{"reviewTitle":"Read the ad carefully","reviewDescription":"These replacement heads are black! The picture shows white and my brush is white. I’ve never seen a black oral-b product.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Just OK","reviewDescription":"Just ok for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628812800000}
{"reviewTitle":"Made in Germany","reviewDescription":"Surprised to see it was made in Germany with all German writing but fits fine and does what it is supposed to. Plus price was right.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576800000000}
{"reviewTitle":"German Packaging","reviewDescription":"I didn't know that the package I was ordering was in a German language packaging. Not that it matters since it is a commodity item. But it would have been nice to know that I was getting a deal because the package was not in native English.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1571875200000}
{"reviewTitle":"Great Tips","reviewDescription":"These brush tips works much better than the original tip that came with my electric Oral-B brush. After a month of using this tip, I can tell that my teeth are cleaner when I go to floss and my gums no longer bleed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1593561600000}
{"reviewTitle":"Much cheaper than else where","reviewDescription":"A very good value for your money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631836800000}
{"reviewTitle":"works fine","reviewDescription":"so far so food","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"Good Product, Overpriced","reviewDescription":"Good product, less expensive than Sonic heads (which is why I switched to Oral B), but still overpriced.Like so many products, WAY too much packaging, but . . . It is what it is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1598832000000}
{"reviewTitle":"Love these toothbrushes","reviewDescription":"They do great job cleaning your teeth","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628208000000}
{"reviewTitle":"They look good. have not used them yet","reviewDescription":"I hope its as good as the one that came with the brush.  They look good.  I'm sure they will be great.  They are made by Oral -B","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1601683200000}
{"reviewTitle":"Priced right; Good Product","reviewDescription":"Excellent price for an important tool in personal hygiene.  Strongly recommend this head for the OralB system.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610496000000}
{"reviewTitle":"Exact product ordered","reviewDescription":"Replacement brushes.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634342400000}
{"reviewTitle":"Nice","reviewDescription":"Works perfectly on my toothbrush","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"Wrong Heads","reviewDescription":"Make sure you order the right one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1629072000000}
{"reviewTitle":"Help to do return","reviewDescription":"Need to return does not fix my toothbrush","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1616457600000}
{"reviewTitle":"Great toothbrush","reviewDescription":"Love it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"Not so great","reviewDescription":"Very loud, its like a jack hammer","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1612310400000}
{"reviewTitle":"Brush poor quality","reviewDescription":"These don’t last long ☹️☹️","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1607385600000}
{"reviewTitle":"Bought 8 for about the same price","reviewDescription":"The pric","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1611273600000}
{"reviewTitle":"Bristles are too hard.","reviewDescription":"I am unhappy with this product because the bristles are too hard.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1568937600000}
{"reviewTitle":"INSTRUCTIONS ARE IN GERMAN","reviewDescription":"WHY ARE THE INSTRUCTIONS IN GERMAN???","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1561420800000}
{"reviewTitle":"I think it is a fake","reviewDescription":"The outer package was open and torn. I had ordered a \"pack of 1\" that contains 3 refills, instead I got a package that said 4 pack. It is weird that a \"4 pack\" that I received is not listed anywhere. And I am not confused which one I ordered. I know there is a 4 pack listed here named as \"Pack de 4\", but that's not I ordered or received. This looks like a fake product to me.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1585612800000}
{"reviewTitle":"Fake","reviewDescription":"Unfortunately Amazon must have purchased some fakes.  The ones I got were not Oral B.  I got a refund but still sad to see.  I'm sure others will get taken.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1616716800000}
{"reviewTitle":"Recent reduction in quality","reviewDescription":"In my recent order I noticed a reduction in quality: the head no longer snaps into place and has pinched my lip due to loose fit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Not the real thing","reviewDescription":"I don’t believe these are made by oral b. They came in an unnamed package, different color & not lasting as long. They feel a little different on my teeth as well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648684800000}
{"reviewTitle":"Not real oral b.","reviewDescription":"These are not oral b. They work ok - but the bristles are not the quality I expect from oral b","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662336000000}
{"reviewTitle":"stiff","reviewDescription":"brushes are too stiff","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"Too rough for my gums","reviewDescription":"Can't use these as they hurt my gums. Already opened the package so can't return. Will order something else next time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650758400000}
{"reviewTitle":"Wrong color","reviewDescription":"Never did the description mention black replacement heads, yet that's what was sent.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1662336000000}
{"reviewTitle":"Okay for the price, probably not real.","reviewDescription":"For the price it's okay, but as others have stated, they are in another language and the boxes and bristles seem softer than the real deal. Also they fit perfectly, while the real ones take more force to snap on and off the toothbrush body.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619568000000}
{"reviewTitle":"Not as pictured","reviewDescription":"I received a product that’s in German packaging and the bristles are different colors than what’s pictured","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"Wobbly","reviewDescription":"The bristle piece seems not secured well compared to other replacement brushes I’ve used in the past","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646352000000}
{"reviewTitle":"Don’t last long at all!","reviewDescription":"I noticed that after about 2 weeks the bristles looked more worn and spread out than normal wear and tear.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"A replacement for Oral B electric brush","reviewDescription":"Packaging was all in German, not English.  Hard on teeth, no choice to change bristles.  Plus; 4 heads for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1600387200000}
{"reviewTitle":"Packaging in German","reviewDescription":"This product packaging was written in German. It seems to work fine but I will be very careful when buying anything from Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1558569600000}
{"reviewTitle":"Heads don't last long","reviewDescription":"These last maybe a week before you need to change them out.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1597795200000}
{"reviewTitle":"Ok for price but quality is not as good as OEM","reviewDescription":"Ok for price but quality is not as good as OEM","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578268800000}
{"reviewTitle":"Not for me.","reviewDescription":"They did not fit my oral-b.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1583798400000}
{"reviewTitle":"These are not original","reviewDescription":"They work but they are not the original ones","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1623196800000}
{"reviewTitle":"Wrong color","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641254400000}
{"reviewTitle":"Doesn't last 3 months","reviewDescription":"I've been using these refill toothbrush heads and they do not last 3 months as advertised on the package. After 6 weeks of using them twice a day they'll need to be replaced. However in my opinion even though they don't last as long as the overpriced ones I normally buy at stores like Walmart it's still a pretty great value when it comes to price. They're packaged well and do as good of a job as others that I've used for years the only difference being they don't last as long.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1597622400000}
{"reviewTitle":"Caused bleeding on my gums","reviewDescription":"This is too hard for my gums","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664236800000}
{"reviewTitle":"ok product","reviewDescription":"works well as advertised,.  the handle ergo could be improved, end up w\/saliva on hand after use.  needs a different shape, etc.  & the design engineer has a degree?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1637798400000}
{"reviewTitle":"Soft bristles","reviewDescription":"The brush heads fit on my Oral-B Braun brush perfectly. The bristles are softer than what came with the brush originally so I wish they were a bit stiffer to brush my teeth more thoroughly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631059200000}
{"reviewTitle":"Fine","reviewDescription":"Bought these to go with a new oral b tool and they fit just like the one the machine came with. Price is okay. My biggest beef is the tiny -way to small to be seen) colored band that is supposed to help you tell your brush from someone else's in the family. I had to use a sharpie to mark mine cause I can't see the band.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1568505600000}
{"reviewTitle":"Works nicely cleaning teeth and plaque management","reviewDescription":"The 4 pack of the product is a great value.  Each brush head will last 3 months so it covers a whole year.  That is extra good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632960000000}
{"reviewTitle":"From a foreign country?","reviewDescription":"Seem like genuine Braun toothbrush heads but the writing in the package definitely isn’t English","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1646092800000}
{"reviewTitle":"In German but looks genuine?","reviewDescription":"Purchased the 3+1 from Zebratech - fulfilled by amazon.  As others have said, it is a little strange that the packaging is in German.  Maybe Zebra is based there.  They look genuine, and work fine.  I compared to a zoomed in picture on Walmart and they look identical, so probably OK.  It does have the bacteria guard symbol on it so appears to be the latest version.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1558915200000}
{"reviewTitle":"Good Quality","reviewDescription":"I absolutely love these brush heads. They really do a good job cleaning my teeth. I wish they lasted longer as they are somewhat expensive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631318400000}
{"reviewTitle":"Go with the manufacturers replacements","reviewDescription":"I tried some off-brand replacements for my Oral-B\/Braun but they were not good.  Ponied up the money for these manufacturer replacements and they are just right.  Worth the extra money.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1621123200000}
{"reviewTitle":"Fit my older model Oral B","reviewDescription":"These brushes fit into my toothbrush and worked well.  I had some trepidation since my oral B is pretty old. But it worked out fine.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1626048000000}
{"reviewTitle":"I use this toothbrush, I like it,","reviewDescription":"I use this toothbrush, I like it,","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640908800000}
{"reviewTitle":"don't waste your money","reviewDescription":"bought these as a replacement for brush heads for Oral B electric brush.  They do not fit  and make a weird noise in use.Disappointing because the ad said they would fit like new .","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1580428800000}
{"reviewTitle":"Bummer","reviewDescription":"I like the replacement tips. But I bought a 4 pack and 2 of the 4 tips were broken. Cracked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1590969600000}
{"reviewTitle":"Arrived with foreign packaging that’s not the same as one displayed.","reviewDescription":"Might not be authentic, came in packaging with German writing. Incorrect product photo that is different then what actually arrived.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1557619200000}
{"reviewTitle":"Better late than never..","reviewDescription":"This product arrived today . Although it was late . thank you","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1590624000000}
{"reviewTitle":"These are not soft.","reviewDescription":"These are not soft as advertised.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1619222400000}
{"reviewTitle":"Try your luck","reviewDescription":"Two of the brush heads didn’t work.. this is a hit or miss .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579996800000}
{"reviewTitle":"too hard when the first time to use","reviewDescription":"Too hard to use and it makes me bleed.after 3 weeks it was softer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1565395200000}
{"reviewTitle":"Gives me a headache but gets my teeth really clean.","reviewDescription":"I've used a Sonicare Electric Toothbrush for YEARS. Recently purchased (from Amazon) a new replacement Sonicare but I didn't feel it got my teeth clean. Dentist had recommended Oral-B so thought I'd give it a try. I love how clean it gets my teeth. However, the vibration is so strong that it gives me a headache. Like one of the reviews said - it vibrates like a jack hammer. I called my dentist and they haven't heard of the Oral-B being so strong as to give people headaches. I use the sensitive (feather) setting. I've never been able to use it for more than 45 seconds. It seems to help if I open my mouth really wide. Other than send it back, does the company have any recommendations.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677456000000}
{"reviewTitle":"Beware of loose fit!!!","reviewDescription":"bought a set of 4 of these brushes. So far one is very loose on the brush moter assembly. It has actually come off several time while my wife is brushing. Switching to another brush for her. So one throw away after five days!!!","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"It works","reviewDescription":"It does the job. Nothing mind blowing but I don’t know what I was expecting.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660176000000}
{"reviewTitle":"Wish they lasted a little longer","reviewDescription":"Seems like I have to replace a brush about every 30 days or so, which may be typical?","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1651708800000}
{"reviewTitle":"Good value","reviewDescription":"Lowest price for these that I have found","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662249600000}
{"reviewTitle":"This is a stiff bristle brush","reviewDescription":"This item was shipped, packaged and delivered just fine.  Thr brushes are stiffer than the usual ones purchased at the retali stores.  Stiff bristles can damage tooth enamel so I'm not pleased at all about this.  The package doesn't indicate anywhere on it whether the brush is a \"sift, medium or stiff bristle\" tooth brush.  I am very disappointed these are not what I expected.  May I get a refund?","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"Like em","reviewDescription":"Like em","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661731200000}
{"reviewTitle":"Interesting","reviewDescription":"Not sure origin of product as fits the oral b toothbrush I have altho a bit differently (feels a little loose) from the product purchased in local stores\/marketed for the US.  Second time I’ve ordered and each shipment was pkgd with a different language as primary.  Works fine & a little bit Cheaper price point tho.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614643200000}
{"reviewTitle":"Muy buenos","reviewDescription":"Baratos y duraderos","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Turkish market version of product","reviewDescription":"This was the genuine article, but in Turkish-language packaging and intended for the Turkish market.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650844800000}
{"reviewTitle":"They were fine described as there’s supposed to be","reviewDescription":"Product is as described","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657324800000}
{"reviewTitle":"Ships German made product, not sure if fake","reviewDescription":"Looks ok and does the job but the packaging was German and flimsy , so can't say if it's real braun oral b head replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"Pay more for the one that works","reviewDescription":"I bought these Oral B replacement brush heads AFTER buying some on Amazon that said they were compatible, but were not.  These, of course, fit and work as they should.  Just bought them, so I'm not sure about longevity, but if they are the same as the one that came with the power pack, then they will last a very long time.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1627862400000}
{"reviewTitle":"Good product","reviewDescription":"Fits well, good price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"Replacement heads","reviewDescription":"Works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676937600000}
{"reviewTitle":"Good replacement","reviewDescription":"Great head replacement and fairly priced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674518400000}
{"reviewTitle":"These must be the real deal","reviewDescription":"These brushes hold up and last so much longer than a less expensive package of \"Oral B\" replacement brushes. I have no way of knowing if the other poor-quality brushes were counterfeit or not but these are going to be less expensive in the end.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1644796800000}
{"reviewTitle":"Oral B Cross Action Electric Toothbrush Replacement Brush Heads Refill","reviewDescription":"Excellent quality and durability!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Mis dientes mi tesoro","reviewDescription":"No necesito gastar Miles de dólares en limpieza mis dientes hermosos","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1671753600000}
{"reviewTitle":"Excellent Purchase!","reviewDescription":"I would recommend!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1676851200000}
{"reviewTitle":"Strong brush","reviewDescription":"Gets teeth very clean.  Harder style brush.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Brush heads from Mitch Mel Corp are legit","reviewDescription":"Dec 2021: purchased 4 pack of cross action brush heads from Mitch Mel Corp. Brush heads appear to be legit. They work just like genuine Oralb brush heads from Costco. The clean-cut bristles & grey Oralb logo match the genuine brush head from a recent review with picture.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1640908800000}
{"reviewTitle":"Tough!","reviewDescription":"I really like these Oral-B head refills!  They are tough, but not too rough!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"Works great!","reviewDescription":"Fast delivery. Works perfectly with my oral b electric toothbrush. Price is much better than in stores for the same. Really cleans my teeth pretty well. I recommend. It would be great if they also offered a soft brush too. They last a very long time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1662163200000}
{"reviewTitle":"Easy to replace and clean well","reviewDescription":"People use their toothbrush heads for too long and replacing them is really important to how they clean. We like to buy the multi-pack so we can replace easily.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Provides a great clean feeling.","reviewDescription":"A very strong brush and larger than some.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Great replacements","reviewDescription":"This is my first replacements of my OralB toothbrush heads. These work great!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"Works Best for Us","reviewDescription":"These cross action heads seem to do the best job of cleaning our teeth out of the several styles available. They are easy to use and are holding up pretty well so far. None of these last a long time, but I think these will still be cleaning effectively at the end of their suggested three month life. One thing we do is soak them in denture cleaner at least twice a week. It seems to clean out the mechanisms and reduce the noise they make when running after a cleaning. These have really reduced the plaque levels and have noticeably brightened our teeth. As coffee and tea drinkers, the stain reduction performance was a welcome bonus to my wife and me.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1564617600000}
{"reviewTitle":"Great product!","reviewDescription":"Very durable and great value pack!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"It has some get up and go!","reviewDescription":"My Phillips sonic was limping along after 1.5 years, so I decided to try the Oral B.  Holy Moly!  What a difference.  It revs up like a hot rod, but you can adjust the intensity.  This red light kept coming on which I found annoying.  I finally read the instructions and the red light indicates you are putting too much pressure on the brush.  Now, no more red light.  I like this feature.  I’m not using any of the phone bells and whistles.  I just wanted a good electric toothbrush and feel as if I got that.  I would buy this model again when the time comes.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1594771200000}
{"reviewTitle":"My Dentist recommended this","reviewDescription":"Yes, I hate to floss. As much as I nag my teen to do it, I am just as bad. I don't know why I never noticed this flosser before. I went from string floss to the little plastic things to this and the angle makes it easy to get in and out without cutting off the circulation of your fingers or gagging with your fist in your mouth. My dentist recommended it so yay!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"Oral B Cross Action Electric Toothbrush replacement head refill 4 count","reviewDescription":"I purchase these replacement head for my electric toothbrush and there are 4 heads.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Perfect in every way","reviewDescription":"Normally I would purchase this in the store, but of late you have to have a store associate get this for you, and store associates are not always available. Ordering this from Prime cost no more than if I purchased it in the store, and because I have been using these brushes with my Oral B toothbrush for several years, I know that they fit correctly and work well.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"4 for the price of one\/two!!","reviewDescription":"It’s a great buy since you get more brushes with the price you pay in comparison to other sellers.  I compared their quality and the physical appearances of those to other one I had bought  from the manufacturer website, and the only difference was the language that was used on the packaging. They came quick and had different color rings to differentiate them ( as expected)","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"My dental tech praises my dental hygiene with every visit.","reviewDescription":"These are great replacement heads. They're a little on the pricey side, but they last 6 months each before I replace them (as directed by the instructions). Almost zero plaque buildup on my teeth using these heads.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Long lasting and what else can I say?","reviewDescription":"Use these constantly and they hold up for, I dunno, maybe 3 months? A little on the expensive side for the number included, but that is the way with all of these types no matter the brand. Like printer companies, they make their money on the consumables.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1672963200000}
{"reviewTitle":"Great Product","reviewDescription":"These are a great replacement for my electric toothbrush, the only difference from my last pack is that the bristles are mostly green and not blue but they work the same.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"toothbrush refills","reviewDescription":"These are the BEST toothbrushes I have ever used.  It is a cross brush style and my teeth feel as if I just had a cleaning at the dentist every time I brush.  I ordered another Pro 1000 electric brush and refills for my husband.  You will see a real difference in One brushing","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Great value, packaging is also in another language","reviewDescription":"I compared them with the much more expensive ones I bought from the local supermarket here in America, and these appear to be legitimate Oral B made replacements. The only thing unusual is that much of the language on the package is written in Polish in addition to English. I'm guessing they sell these for less of a mark-up in Europe than they do in America (the retail price of these in the USA is ridiculous), but that's just a guess. I have been using one for a few weeks, and it works and cleans just like the ones I've bought from the store.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1617667200000}
{"reviewTitle":"Toothbrush","reviewDescription":"They are so can be changed when needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1677801600000}
{"reviewTitle":"Clean teeth!","reviewDescription":"Good brush heads for a good electric toothbrush.  I usually get four months (not just three) out of each brush head.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"My teeth feel super clean!","reviewDescription":"I've had my Oral-B tooth brush for a little over two years. Previously I had bought generic Oral-B brush heads because they were a way better deal but my teeth didn't feel as clean when I used them. Some reviews said that these brush heads were a knockoffs. I think they are the real deal, except they may come in a different language. Mine were in Turkish.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"Pro Tip: This goes in your mouth","reviewDescription":"Will not cut though anything thicker than lite mayonnaise with our sawing or using and actual knife.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613433600000}
{"reviewTitle":"Wrong color","reviewDescription":"The replacement toothbrush heads fit fine but I was sent black when I ordered white, looks a little weird on my white handle.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605744000000}
{"reviewTitle":"Toothbrush","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630972800000}
{"reviewTitle":"I keep getting cavities...why?","reviewDescription":"It's not this brushes fault. It's those damn Swedish fish. Why does Canada make and export a Swedish product??","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1609718400000}
{"reviewTitle":"Packaging was all in German","reviewDescription":"Otherwise it was a good product at a good price point","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1616371200000}
{"reviewTitle":"Works very well","reviewDescription":"Worth the money","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1627516800000}
{"reviewTitle":"The product I received is labelled in German","reviewDescription":"I can't read anything on the label because it is all German. The product is advertised in English. It would have been rather helpful to be able to read what's on the box.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576627200000}
{"reviewTitle":"oral b toothbrush replacements","reviewDescription":"The package arrived on time, which now with amazon is a plus.  We have started using the replacement heads and they seem to be working great.  I=","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1594684800000}
{"reviewTitle":"I hope you speak German","reviewDescription":"The product works which is why it got a four rating.  All the text with the exception of Oral-B is in German.  I am keeping it as they work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577923200000}
{"reviewTitle":"very reasonable price, same quality","reviewDescription":"Works well, but are softer than the original design. And like someone else pointed out, there was a fair amount German printing on the package Looks like it’s a genuine Oral B product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1560124800000}
{"reviewTitle":"not compatable","reviewDescription":"These heads did not fit properly and came off while brushing. May have been a faulty batch, but will not buy again. Went to Walgreens and purchased them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646092800000}
{"reviewTitle":"Didn’t fit my Oral-B cross-action.","reviewDescription":"This might be a great product but the advertising says: “fits all Oral-B electric toothbrushes except Pulsonic”. This is not correct. I have an “Oral B cross-action”  electric toothbrush (not a Pulsonic) and it did not fit. Not even close.  I had to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1569024000000}
{"reviewTitle":"Buyer beware— not floss action","reviewDescription":"Do not buy these. The packaging is for floss action but they are actually not! We used them because we were going on a trip and could not rtn","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1643241600000}
{"reviewTitle":"Oral B Cross Action Electric Toothbrush Replacement Brush Heads Refill, 4Count","reviewDescription":"Fall off my Oral B tooth Brush!  .Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"DOES NOT WORK AFTER 2 MONTHS","reviewDescription":"I bought the toothbrush on 6\/2\/2021 and it stop working around 8\/5\/2021. I charged for a whole day but it only worked for a few seconds and dead.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1628380800000}
{"reviewTitle":"Open","reviewDescription":"Received package and the toothbrush package (not delivery package) has been opened.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1662768000000}
{"reviewTitle":"Destroys my gums!","reviewDescription":"I don't know what it is about this brush -- is it the size or the stiffness? But my it's very harsh on my gums and I have cuts on my gums.  It's painful to use.I will not be purchasing these again.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1561075200000}
{"reviewTitle":"Quality","reviewDescription":"This item was not compatible with my Electric toothe brush, as there description said it would.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657152000000}
{"reviewTitle":"Easy to use but get insurance!!!","reviewDescription":"It’s like Viagra…it works for a little while…well…but get insurance because you can’t rely on its longevity!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1636243200000}
{"reviewTitle":"Doesn’t fit","reviewDescription":"I’ve ordered refill heads before without a problem but for whatever reason, these heads don’t stay on.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1634515200000}
