{"reviewTitle":"You get what you pay for, and I'm okay with that","reviewDescription":"I bought this to replace my similar blackview smartwatch. I know I'm not buying an Apple watch or a Garmin watch or Google watch so I don't expect perfection. And I didn't get it.It tells time okay and that's mainly what I wanted.I have difficulty making a lot of the functions work such as heart rate monitor oxygen saturation monitor and others. But again I bought it as a March so I'm not complaining too much..I turned off the Bluetooth connection to my phone so the battery life is phenomenal. I can get at least a month between charges.The screen is supposed to be scratch resistant, but it's still mars up pretty easily.What about another one in the year when this one expires, I'm not sure but probably so. I have a feeling it would beat up $400 watch just as badly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Great watch for price, however…","reviewDescription":"I bought this watch as a way to keep track of time without having to check phone, and also to track my sleep and my heart rate as I sleep. The first few nights, it didn’t track my sleep, but haven’t had a problem with that since then! It works really well and holds charg for a very long time. My only complaint is that as of recent, when I take it off in the mornings to shower, it’s been smelling funky 🤢 I wash it with soap and water, dry it… but it never fails with having that nasty funk. I think changing bands to something not rubber will help. It’s chafing my skin under it from the material and I think that may be the cause of the issue.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Not bad for the price","reviewDescription":"Can't beat the price, but there are a few flaws. 15s is the longest the watch will stay on before timing out. I really wish it had a display always on option because I use timers at work all the time. I'll set a timer for however many minutes I need, but after 15s the watch face turns off and the timer is automatically paused which basically makes the timer funciton unusable. The raise to wake feature is also inconsistent, and I find myself having to manually turn the watch face on quite often which is inconvenient in healthcare\/when gloved up and not able to touch anything","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Not very friendly interface","reviewDescription":"Its not very friendly interfaced device, so if u want simple setups, not for you, but if u want apple watch  design watch - you get get it (but it looks like apple watch, untill it turns on :) )","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Not waterproof","reviewDescription":"Had it for a little over a month. Good watch overall. However. Wore it at a water park for less than two hours. Now its junk. Maybe my own fault. But hoped it would hold up better. Hoped I could return. But too late.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Okayish","reviewDescription":"Could be more user friendly. No\/rare updates and it needs them!!Otherwise, it works, I guess. I purchased it for my brother because that's what he wanted.It's honestly just better to save up more money and buy a Samsung Galaxy Watch 4. Even a used one is superior to any of these cheapies. I know because I bought one xD Much better experience.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"The Jury is Still Out","reviewDescription":"I really want to like this and replace my Fitbit. I saw it on  sale. It has the functions that I need but it's looking that is about it.The directions were not that simple. I finally got it somewhat figured out. I still can't see text messages but I can answer the phone. I set the alarm and it didn't go off.  It looks nice on but it does not hold a charge long. It seems like a 2 day max.Last thing, the charging port is not secure. It is magnetic but the magnet is not strong enough to keep it connected while charging. I charged it last night but it disconnected so when I went to put it on, there was no juice so I had to put back on my Fitbit,I am going to give it another week before I make a final decision as to whether I keep it or go back to another Fitbit.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Cute watch but...","reviewDescription":"I've had this watch for 3 days now and while I loved it at first I'm already able to tell that it is not accurately counting my steps. I noticed that it went 4.5hrs without counting my steps and I have no idea why as I was out running errands and the watch was on. Because of this I will be returning bc I need something that will be accurate. If you want a watch just to tell time and have your messages and calls show up this is good but for fitness it's looking like a no.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"The battery charge doesn't last very long.","reviewDescription":"I like the style and wrist band color.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Not great with apple phones","reviewDescription":"I like that it tracks my steps and heart rate and tells me the weather, but I can’t text anyone with it unless they have a particular app (what’s app) which no one uses. Also it stopped tracking my sleep patterns which is a large part of why I purchased it as I work nights","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Mine worked well for the First 2 weeks,","reviewDescription":"I had to return the unit for a refund, I could not select replace item??My Watch stopped charging, I checked the output from the charger and it has 5.08 volts, I cleaned the watch contacts, but it would not charge?I have been issued 1\/2 of my purchase price, I am hoping the rest will be refunded.I would have been fine if I could have just returned the watch for a replacement, I had only used\/owned it for 2 weeks,  NO scratches or damage to the watch.Jim","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"My music","reviewDescription":"I dislike because I couldn't hear my music come threw my watch from my phone. Like it's said it's supposed to do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Decent for what it is","reviewDescription":"Decent. Can text or anything on it. For the price, can’t beat it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Can't have both txt and call same time","reviewDescription":"Hard to read txt","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Works only part of the time","reviewDescription":"Sleep tracking works about 40% of the time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Get what you pay for","reviewDescription":"It didn't work as well as I hoped it would.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Not so smart watch","reviewDescription":"The only reason I purchased this \"smartwatch was to track my steps. I was comfortable with my previous watch but due to wear and tear had to replace. I figured it was a good product for a fair price.  I set my usual goal of 15k steps. I run 3 miles every morning to start my day that's about 40% of my goal completed before breakfast on the first day it said i only took around 3500 steps, i figured it just need to assimilate to my step pattern by day 5 i wasn't breaking 5k steps a day even though i  run 3 miles (6500 to 7000 steps) every morning. definitely not satisfied with this product.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"neat features but iffy accuracy","reviewDescription":"I loved the customizable watch face, but when it comes to tracking your sleep, it gets confused between awake time and light sleep and will still count sleeping after you get up in the morning, for example when you are sitting down having coffee.  Also, it seems like the calorie count on exercise is way low for yoga... at least it was lower than my previous tracker ... so one of them is wrong.  I would have returned it, but I like having a picture of my mom on my wrist!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"You get what you pay for.","reviewDescription":"Seems to work okay, but I wouldn't pay $80 for it. It's worth $25 if you're looking for a basic step counter and swing your arms while you walk. Heart rate and O2 monitors work fine, but sleep monitor gets a little confused. Music and pictures it's just a remote control for your phone. Can't get the voice assistant to work. App and everything is not written by someone who English is their native language, but it's close enough to figure things out. Not bad for a cheap smartwatch, but not completely satisfied with what I got.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Like it but app keeps crashing","reviewDescription":"This watch is exactly what I wanted. The time is easy to see. The step count seems to be accurate. I only have to charge it once a week.I accidently wore it in the shower and have had no problems with it since.I do like having the ability to answer my phone even though I do not use it much. The speaker is nice and loud and voices come across clearly.The other health functions I do not use, so I can not say anything about their accuracy.The watch face may be a little large for some and I would definitely change the band to a different 22mm band.Overall, I just really like this watch. The price was right and it functions the way I need it to.10\/28\/23 The app keeps crashing on me and I have to keep reconnecting it. That makes me sad because there are so many other things to love about this watch. Had to take away 2 stars because of this.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1693872000000}
{"reviewTitle":"Pretty disappointing.","reviewDescription":"Obviously you get what you pay for, but I am really disappointed with this particular watch. I ordered one similar for my girlfriend prior to purchasing this model. When I went back to purchase the same one I had for her, it was not available. This watch was offered as a similar product, so I took a chance.From the onset, regardless of the settings, it did not track sleep at all, regardless of how tight or how loose it was worn at night. The step tracking and caloric counts are nowhere close to accurate. After an hour of heavy treadmill cardio, the treadmill logged 591 calories, the watch register 167. Definitely off.The app is not very intuitive nor comprehensive. It does not keep a log of daily progress (despite monitoring and changing the settings). Data is wiped out every day with no log of activity to compare progress. The weather monitor is always off every morning. I live in Florida and it continually tells me its 12 degrees. (and yes, I changed these settings multiple times as well.Additionally, I have had this watch for less than three weeks. It arrived on 1\/4. Two days ago it got wet doing dishes. Wet, not submerged...and while it claims to be water resistant, the watch now has stopped responding to the push button on the right hand side. It has simply gone black, only popping on for a couple seconds if there is some random movement of the wrist.It's a shame, as the watch is fairly nice to look at, but again, if you're looking for a decent caliber tracker for health, fitness and to have some interaction with platforms, this watch falls very short. Invest in a FitBit or an Apple Watch.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"Perfect until it wasn’t","reviewDescription":"Update #2- Right after I wrote the previous review, the watch started malfunctioning even more. The screen freezes and nothing makes it work again, and it won’t even turn off. I’m really disappointed. I loved this watch.I bought this smartwatch on December 31, 2023 and I LOVED it. The functions were just what I wanted and it worked perfectly. I mainly used the timer, the watch, and the mileage counter.However, it is now malfunctioning. I keep getting alerts about messages that just say “000000”, over and over, plus repeats of a message from a friend, and no matter how many times I delete them, they come back as new alerts . I turned the watch all the way off twice, but that didn’t solve the problem.I’m disappointed because I really loved this watch and depended on it for work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Worst watch I've ever had","reviewDescription":"I wanted to like this watch. Its features in print were impressive. In reality, I would never call it a \"smart\" watch. It lost its settings routinely. It never responded to wrist movement to show me the time; it almost always required me to push a button, and that is very rarely convenient to do. I set it properly per the instructions, so that it was SUPPOSED to be visible just with movement, but 90% ot the time, it didn't work. The step counter is dismally inaccurate. I wore an old Fitbit on my ankle to get an accurate count and this watch reported approximately 1\/3 of what the actual steps were. I hope other users are getting better results, but my suggestion is: consider finding a different watch to buy than this one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Good quality","reviewDescription":"The watch is very difficult to navigate. I tried for over two hours to set the watch. I try to set the time I was not able to do that I try to set the kilometers into miles. I was not able to do that. Finally, I called Amazon she tried to help she had a hard time herself she told me to go to settings I said there is no setting. She figured out that if I swipe up down or across, I can get into certain settings but we were not able to change the time I think her I said I’m just going to return it because this is so difficult. I was finally able to get it to where it’ll count my steps as I was walking it kind of slipped off my arm I do not know if it’s because I had a grocery bag I was able to put the bed back on the watch worked fine, so when I got home, I called Amazon again seeing if they can help me navigate the watch on how to change the time they couldn’t help so sadly, I have to return it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Don't waste your money","reviewDescription":"The watch came brand new with good packaging and delivery was good. However, despite giving it time to start working properly and contacting the seller, this watch was a waste of money - and it was on sale when I got it.Here goes.- The watch does not record your workouts even when it counts down to start. It just stays on zero. Recently I got it to work for 9 minutes of my 22 minute workout.. needless to say I was pissed it didn't capture all of it.- The sleep function does not work consistently no matter how tight you tighten it to your hand.- The app and the watch does not sync well, despite the Bluetooth being connected. The sync doesn't reflect what's on the watch and vice versa.- Battery life does not last for one day. It has to be charged throughout the day.Basically the watch was a dud.. and it was new so it is safe to assume the brand is trash. When I asked for a refund or replacement the seller kept on giving me more information on how to use the watch which did not work. What trash.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"Lasted less than a year concerned about data mining","reviewDescription":"The watch was a good price that is pretty much the only thing that is good.It did not accurately count steps, particularly when on the treadmill only when walking outside.After less than a year. I kept getting these verification messages. That would do nothing when I clicked on them. The watch would not connect to my phone anylonger so it was just a watch. It didn't accurately capture the location. So the weather was being reported from somewhere else I don't know. Many people have written that the app was.Being used to collect data in china. That said, I will no longer be purchasing this type of watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Glitchy and not worth it","reviewDescription":"Everything about the watch is decent, the one I got off Temu for a dollar was significantly better. My biggest gripes are: 1) the screen is off-center, 2) the screen is always on so i have to keep 'raise hand to activate display' off, 3) i literally got it for my restaurant job and I can't check the time by raising my wrist like i need to, 4) permanent screen burn\/ pixel death around the edges, 5) it gets stuck between 2 screens, mid-transition a lot, 6) DON'T WEAR IT TO BED, it can't handle pressure from different sleep positions.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"This is NOT water proof at all!!!!! So disappointing!","reviewDescription":"I really needed something to use to track my activity as I venture down this new health path! I don’t have a lot to spend so I thought I would try this. I am so glad that I did not spend too much as it clearly is not functioning as it is supposed to. In the beginning it was great and it is actually still is tracking my steps but I can barely see the information at this point. I didn’t dive or swim in a deep pool. I was with my kiddo in the shallow ends. Needless to say, I will NOT make this mistake again. Spend a little more and get something more trusted and reliable!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721088000000}
{"reviewTitle":"Good while it lasted - died at 6 months","reviewDescription":"Got this for my 9 year old. It barely made it to 6 months.He loved it while it worked and treated it well for a kid. Always took it off for showers and pool activities, etc. He got it for Christmas last year and it died a month ago, all of a sudden the display would no longer come on, pretty sure it was still on, but the display died.We had spent the last couple weeks trying to recover it. allowing the battery to fully drain, attempting to power on, charging again, still could not get it to come back online.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Horrible","reviewDescription":"Do Not Recommend!!Did not work anywhere close to as it should.I got this to track my steps, heart rate, sleep and an estimated calories burnedIt did not link my textsI was not able to answer a call on mine although it showed if I had a call and I could end itSteps and paring not accurate the app stalled so it didn’t always merge the infoSaid I was awake when I was sleepingDidn’t register a night when I was sleepingIn fitness modes like walking on treadmill and walking it didn’t always record like it should do the work I did did not show for me to create baselines to help me figure out more to my health and fitness goalsI returned itPiece of garbage even if it’s on saleDo not buy","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Nice, easy-to-use smartwatch (with a few annoyances)","reviewDescription":"I wanted to get my 8 year old daughter a smartwatch with limited functionality (not a full-blown Apple Watch with internet access), and my daughter loved that it looks similar to an Apple Watch.  It does a great job with serving as a pedometer for activity tracking, alarm clock to set time limits, and stopwatch for when she's tracking activities (and of course, telling the time).  The app requires connection to a smartphone for full functionality (many of the features can be disabled in the app so that the watch is not constantly looking for a data signal to await commands).  One the features I wish worked better is the weather\/temp feature on the watch.  When pairing the watch to my phone via Bluetooth, the app appears to be acquiring the current location (for displaying the current location's temp\/weather status).  The app, however, often indicates an inaccurate temp\/weather status, which I'm guessing is because it fails to acquire the current location from my phone.  For example, the other day it was 20 degrees F with clear skies.  The watch indicated that it was 42 degrees F with light rain (and there was no rain the forecast that day).  If I disconnect and re-enable the Bluetooth on my phone several times, the watch will eventually acquire the correct temp\/weather.  But that's annoying, and there's never a consistent number of times for the disconnect\/reconnect to work.That said, if you're not looking for weather\/temp updates on your watch, this might be a good solution for a fun and stylish entry-level smartwatch for someone who doesn't want a full-blow (ie expensive) smartwatch.  The display is large and clear (with great colors) and the band feels secure.","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Pretty good for the price","reviewDescription":"I've had this watch for a couple of months now. Overall, I'm happy with it. I like the functions available and the price point. The app (GloryFit) is free which was a must for me.  It's not prefect, but if you don't need super accurate numbers, it's pretty good.Cons: 1). It disconnects from the app a lot. Even when I'm close to my phone all day. I notice it is disconnected. However, it's easy to resync. Literally, just tap the app and it pairs back up. It only takes like 20 seconds.  2). The distance feature is definitely off!! Probably the most frustrating thing for me because I bought this to keep track of my runs.  I run the same loop a couple times a week. It's given me a different distance every time and it's always short.  I've run 2 miles twice and it shows the distance as 1.75 the first time and 1.77 the second time. My son's app (Strava) shows the run as 2.10 each time. I drove it with my car and it's right at 2 miles. Pretty sure the step counter isn't accurate either but I'm not sure that any of them are really correct. 3). I've somehow put a pretty good scratch on the watch face. BUT I'm pretty rough on stuff and I wear it all the time. So, if you're not real outdoorsy and you're gentle, you may have better luck. It still works fine with the scratch, and it doesn't really bother me. 4). Can't switch out the band. 5). Sometimes the sleep monitoring doesn't work (but works most of the time).Pros: Price point is great!  App is Free!  Waterproof.  Easy to operate. Lots of features. Can answer and make calls as long as your phone is at a reasonable distance (doesn't work if it's disconnected from the app). Fits well even on small wrists and wide adjustability.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722211200000}
{"reviewTitle":"Okay watch with some severe deficiencies for fitness and weather","reviewDescription":"I held off on writing a review until after I had owned the watch for a few months.  My primary goal was to replace an old Fitbit with something that had more capability, but I didn't want to spend a ton of money because I wanted to try some of the features out before committing to a larger expense.  This one looked like it fit my needs and for $30 it was a reasonable gamble to take.Basic functionality:  It's a watch so I expect it to tell time.  It does that, though I have had times where I needed to resync it to the app to update the time, such as after daylight savings time.  There are a couple of faces that you can pick from in the watch itself, but when you go into the Gloryfit app there are additional ones you can download to the watch.  The standard ones I didn't like but one of the app ones I did and that's what I went with.  The watch also keeps track of your pulse and oxygen levels.  The pulse seems pretty accurate, and I compared the oxygen sensor with my pulse oximeter (which calibrated well against one in my doctor's office) and the watch was off by a percent or dead on, so I think it's reasonably trustworthy unless you need real accuracy.  The sleep monitor is interesting and seems accurate for the amount of time I spend sleeping.  It has a \"find my phone\" feature, and it displays a snippet of emails and texts from my phone on its display.  I don't use it to make calls so can't vouch for how that works.  Battery life is good, as I only need to charge it about once a week and it's fully charged within a couple of hours.  The band is comfortable and I don't have a problem wearing it all day and night.  I take it off to shower so don't know about how waterproof it is.  For core function it's pretty good.Now the bad stuff.  The watch is supposed to tell you the weather, but that is highly inaccurate.  The temp is always way off, and the reason is the app picked a city that's spelled similarly to where I live but is always 10-20 degrees colder with different weather.  For me this feature is a joke and entirely useless as it's guessing by the city name it finds and not using GPS or other accurate data for the location.  The Gloryfit app shows the wrong location but there is nowhere to fix it.  All of the location syncing is turned on in my phone but it just ignores what my phone knows about where it is.  My phone's weather app is 100% accurate no matter where I am, so it's just this dumb app.  Sometimes when I travel to another town it gets the correct place and weather information but not always.  Second, the exercise tracker is awful.  There are about a hundred exercises that the watch and app track, but I typically only do about a half dozen of them.  There is no way to reorder the exercises so they show up at the top of the limited list you can see on the watch so you have to go into the app and manually disable those showing up above the ones you want to use.  After winnowing the list down they still stay in the same order they were originally in, so I can't put the one I do most often at the top of the list.  Also, it doesn't track steps accurately.  When on the elliptical machine at my gym my Fitbit counted all of the steps, but the watch only counts about a third or less of them.  When I do a lot of walking the steps are also lower than what I recorded with my Fitbit on previous treks.  This makes the step counter and calorie counter useless since it's not getting good data for my effort.  Do not get this if you are wanting a real fitness tracker.Would I buy this watch again?  Probably not, I would have found a better one with a decent app instead.  When I bought one for my wife after having this one I opted for a better\/more expensive watch and she's very happy with it.  I expect I will get a better one for myself eventually and toss this one in a drawer or give it to someone who isn't into fitness and doesn't care about seeing the weather on their watch.  But for 30 bucks it's worth that much in terms of the things it does reliably.","isVerified":true,"ratingScore":4,"reviewReaction":"57 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Great smartwatch for the price!","reviewDescription":"I bought this watch mostly to monitor my sleep but also to keep track of my steps and other activity. It seems pretty accurate so far with everything I've been monitoring. The watch has an app you'll need to download (GloryFit) and, through that app you can keep track of whatever vitals you want to monitor along with setting different exercises that you can set & monitor.I needed a watch that was compatible with my Android phone (Samsung) but I could NOT afford one of the name brand ones and this one was very affordable, works great with my phone & has almost everything I need. You can receive notifications from almost any app & you can read any messages received. The ONLY thing I wish you could do is reply to messages from the watch face but that's a small inconvenience when I can just grab my phone & reply.The watch face is customizable & I love that because I need to customize EVERYTHING lol the app for the watch has a HUGE variety of free watch faces you can use with different layouts for your vitals, the time, etc. You can also upload your own image (as shown in the last photo I uploaded) and it will just have the time & your steps shown on the screen. When you upload your own image, you can't rearrange the time or steps or add anything else to monitor but you can change the font color to match the background.Overall, this is a great budget smartwatch & does everything it says. I def recommend for anyone who can't afford the name brands!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Good dupe","reviewDescription":"There is a little bit of a learning curve considering there were no real instructions. But it's fairly accurate with steps and heart rate. Swimming, not so much. It got glitchy on me after getting caught in a rainstorm. But I didn't wear it for two days and it went back to normal. I like it for what it is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"I love this watch","reviewDescription":"I am very happy with my watch as it has helped me keep an eye on my health too awake and asleep too. And helps me keep track of some important information.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Decent for the price","reviewDescription":"I bought this after my fitbit stopped holding a charge. It's a decent watch for the price. The only issue I have is it keeps disconnecting from my bluetooth.  Everyday I have to disconnect the watch from the app and bluetooth and then reconnect. None of my other bluetooth devices do this... it also doesn't always send me texts i receive. Lastly, it doesn't allow you to import all your contacts which kinda stinks","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Best smart watch for the price.","reviewDescription":"I’ve had this watch for about 2 weeks now. My last watch was Apple Watch 3. My first impression on this watch is it’s really comfortable. I had a hard time finding a watch band for my Apple Watch that fit well and I liked. This watch out of the box is great. No need for a different band. Setting up is pretty easy. The battery life is amazing, I don’t understand how this watch can have battery life 10x as long as an Apple Watch. I really like the blood\/oxygen reader, works well. The only thing that this doesn’t have that Apple Watch has is the Apple Pay and location tracking, which really isn’t that big of a deal to me. Has a bunch of different faces to choose from in the app through the phone, so pretty cool faces.Dislikes are the screen resolution is kind of low, text looks kind of old school but not that big of deal, I mean I paid $26 for it. No way to control volume when using music\/podcast player through phone. You can only text via voice, no keyboard. The screen brightness is too bright even on the lowest setting. Also to check the time when you hold up your wrist it takes a 1-2 seconds for the screen to come on, kind of annoying. Need to have a “display always on” option.All in all great smart watch for the price, I’d recommend getting one.","isVerified":true,"ratingScore":4,"reviewReaction":"21 people found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"Decent product for the price.","reviewDescription":"I bought this watch because I work in construction and wanted something that wasn’t expensive because I knew it would get scratched eventually. But it had held up surprisingly well for several months now. There are a couple little quirks that are different from other watches I have had but they are mostly personal preference thing. One down fall is that it is really hard to get the charger to connect sometimes. The other thing I would say is the battery lasts over a week, but the last 20% only last about a day.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"It was more than expected.","reviewDescription":"It was more than expected. It tracks: your bpm, blood oxygen level, sleep patterns, allows you to make calls via the phone which can be handy if you use your hands a lot (since you wouldn't have to hold the phone to talk to the other person). It is useful. Other apps also include a weather monitor.  The watch face\/screen display can be changed. After charging the battery lasts for about 2 - 4 days if just using it as a watch but tends to drain faster if taking calls.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Too complicated for this senior","reviewDescription":"I thought, after reading the reviews that this would be simpler than it ended up being. For me, it was just too complicated and had many more things that I would ever use.  I only gave it three stars rather than five because it never really was used.  But I think the style and all the things that offers and the fact that all the reviews are really very good. It probably really deserves a five star.  So if you’re much more savvy than I am, I’m sure you’ll love it.  And you can’t beat the price.  Give it a try.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Loses data after a month of use","reviewDescription":"I loved this watch, then after only a month of use I noticed I had a sleep record, then it would just zero out. Then today about 4:00pm all my steps reset to zero. So sad it’s not reliable after only a month as I loved everything about it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"REPURCHASE CHARGER","reviewDescription":"I like my watch but lost my charger but can’t find where to buy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"the math don't be mathing","reviewDescription":"i have a disability. i can't walk much but i wanted something that would help me aim for a goal, no matter how small. so i picked up this smart watch because it was budget friendly. I don't think it counts all steps. if i walk for a specific time on a treadmill at a constant speed the numbers should be close but they aren't. It's also a pain to keep it connected to the phone to pick up calls. never got the 'face' change thing to work. Pretty sure it was tracking my sleep after i was awake. It's alright. but i would save up for a more expensive one if you haven't gotten one yet.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Util","reviewDescription":"Deben mejorar","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Ok for the price","reviewDescription":"I like that you can customize your watch face from a picture in your camera roll. It works well for phone calls. Can read texts that come in. I do like the watch, but going to return it because of the lag time when turning the watch up to view it. It’s kinda hit and miss when lifting the watch to check time the screen stays asleep.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Limited use","reviewDescription":"It doesn't have the capability of Apple Watch.  And almost everything you do has to be connected to your cell phone.  Example, if you want to change the watch face, do it through the mobile app on your cell phone.  It does not have a calculator and a FIND MY PHONE.  Some features I want.  I can read messages, but can't text back.  I don't know if the phone calls work because I could enter the dial #'s but not hear the phone ring.I'm searching for another smartphone with working features.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Military time","reviewDescription":"It shows the time in military time. I didn’t like that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Interfered with car stereo","reviewDescription":"When using my GPS app and listening to Pandora my watch kept interrupting the Bluetooth connection even though I turned off the watches media sound and phone sound. It was driving me nuts. No pun intended. Other than that its a very nice watch for the price. Very light weight. I should add that the wrist band run slight small. My wrist is 7 inches in circumference and I had to use the the last whole which made it tad snug but doable. Not sure it they indicated the the size in description but will check after writing this review. It's safe to say if you have a 7 inch in circumference or larger wrist this watch band will simply not work. I think this is a great watch for a non driver.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693526400000}
{"reviewTitle":"All  features, no actual watch","reviewDescription":"The watch did everything needed except tell the time and date.  Worked on setting it up for 7 hours and never could get it to connect to my phone except to answer calls.  Sad to return it as I really like the style of the watch and the features.  Bye bye.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Smart watch","reviewDescription":"If recommended it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"My screen is stuck on this what does it mean ?","reviewDescription":"How do I get it off the screen?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Not a rugged product.","reviewDescription":"Had this for 8 days and cracked the screen today on vehicle interior plastic trim.  Overall, it is an okay watch, though not rugged or tough in any way.  Good for a desk job.  I don't like wearing my watches with the face on the inside of my wrist, and if you want heart monitoring, that is where it needs to go.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Just ok","reviewDescription":"I brought this hoping it could hold me over until I decided on another Apple or Samsung watch. The watch is ok for phone notifications. But the health data especially the steps were completely inaccurate. Since that is one of the main reasons I have a smart watch, I had to return after a week.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Customer service sucks.","reviewDescription":"The watch is pretty good, once you figure out instructions. Customer service sucks. I asked about more straps, got a link to 22mm straps , purchased and they dont fit. I need 24mm pins. Absolutely no product knowledge. Watch often disconnects from phone, and doesn't always reconnect without unpairing and re pairing.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1695686400000}
{"reviewTitle":"Monthly fee","reviewDescription":"The watch is fine. But the app it connects to charges a 49.95 dollar monthly fee","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"constantly disconnects from phone","reviewDescription":"sadly it disconnects randomly all day long. even lifting my arm to see the time doesn't work 1\/2 the time and i do have it setup correctly.the point of having the watch is so I don't have to keep pulling out my phone to see the time, calls, texts etc.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"Disappointed","reviewDescription":"Screen only stays illuminated for 15 seconds at maximum length setting. The options for the \"face\" of watch are pitiful. This comes across as a child's watch. I simply wanted the date and time displayed, which is not an option unless you have some horrific background image. You can make a \"custom\" face, which is a waste of time (no pun intended). If you're just looking for something to tell the time, it'll function. Positive note... the fit was fairly comfortable.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"the watch  that's  not  real  accurate","reviewDescription":"the watch  did  not stay connected to  Bluetooth  the app seems to be decent  when  you  lifted  your  wrist  there's  times  it didn't want to  come on","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Notifications are not working properly - had to delete and re-add notifications","reviewDescription":"Good cheap smart watch.. However, text messages, viber, yahoo, outlook notifications are hit and miss. I kept have to add them from the APP so it will work.. Then they will stop again until I removed them, readd them.. It gets tiring. I am on the latest firmware also. Returning this for a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"Only worked for a few months","reviewDescription":"This watch only worked properly for a few months. I purchased in Feb. , by mid May I am already having trouble with it. I can’t get the screen to even light up. Side button no longer works.  Shows fully charged when on the charger, and on the app.It’s a shame, because it worked great in the beginning","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I bought this watch because of all of the tracking features. It worked great for 2 weeks so I bought a second one. Both watches stopped working by week 3. The screen is staticky on one and you can't swipe to different menus. The other one keeps giving an error message that you have wait 15 minutes before you can hit a green verify button while wearing it. Really disappointed with this item because I had high hopes.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Sad","reviewDescription":"I definitely expected much more from this product.  It doesn't even keep an accurate count of steps.  Sometimes it rings for calls and Sometimes it doesn't.  Same with messages.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Inaccurate","reviewDescription":"I compared the values for heart rate, oxygen % and distance walked with those obtained by a nurse in a hospital. They were not even close. I regret I wasn't able to do that while I still had time to return the watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Junk","reviewDescription":"Watch worked well for about two or three weeks then it decided to not work so well. Currently, the battery life will not last more than an hour or two now. No matter how long I charge the watch, the battery dies in a couple of hours. Peace of junk. Money back?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"It's a watch, the other features are useless.","reviewDescription":"After buying 4 Fitbits and none of them lasted more than a year, I decided to find an alternative. For the price this is a decent watch but forget about the 9ther features.The watch alarm is pretty lame and only works sometimes, definitely not reliable.The heart rate monitor does not work when heart rate exceeds 80 bpm. I have Tachycardia and need a reliable heart rate monitor.The sleep tracker is terrible .The phone bluetooth feature is also unreliable.  Works sometimes only.The battery does not last as long as advertised. Usually have to charge every 2-3 days at most.I do like the immense amount of choices for the watch face but that's about all. Hopefully this one will last more than a year.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"trash","reviewDescription":"worthless wates of money the app dont even download iv tried other way and it wont connect and mine came with a cracked screen like bruh","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Inaccurate readings - waste of money","reviewDescription":"Watch counts steps when it wants, it’s very inaccurate. I use to be able to answer calls, I can only end them now. Half the time my text do not come thru.Definitely not worth the money. All this happened after my return window closed, or I would have returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Doesn’t work after 3 months","reviewDescription":"This watch no longer keeps a charge. The screen easily scratched. Also the metal part surrounding the frame is all scratched up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Died in 2 weeks.","reviewDescription":"The watch worked for about 2 weeks and now not tracking anything at all. Ill turn off and turn on for it to work again then a little after it did the same thing. I got frustrated and turned it off again for the 4-5th time and after i turned it on the steps were back to 0. If it keeps happening im assuming its a cheap raggedy ol thing or i got defected one. I definitely dont recommend to buy. Better off purchasing a real watch and spend a lil more.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"not waterproof","reviewDescription":"I liked the watch at 1st but went into the pool a few times and it now doesn't work I might have gotten a bad watch because my wife has the same one and she has no problems! I'm past the 30 days to return so I'll just buy from a different company!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"How does this rate so high???","reviewDescription":"I needto replace my Fitbit (maybe just the battery as it is t bright any longer) but didn’t want to spend the money. I was so happy to find this $20 watch with such good ratings!  It won’t vibrate when I get a text, it finally connected to a phone call, but I only found this out when I looked down after I hung up and found it won’t disconnect!  See the picture above?  It’s still connected 5 minutes later and counting!  The steps are NOT accurate. Put my Fitbit on and walked normal. 57 steps on the Fitbit. 167 on the glory app. Not even close!  Heartbeat is always faster on the glory as well.  Gave me 9 hours and 1 minute of sleep. Counted me watching at least : hours of tv in the middle of the night as sleeping. This is going in the garbage!  And as you can see, phone call is still connected. Ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Functions Inaccurate","reviewDescription":"The watch is nice and mostly works well enough. The issue is that the Step Counter is completely off. It shows that you walk way more steps than you actually have. I can walk about 25 steps and it shows that I walked hundreds more.. Incorrect. Not accurate at all, makes Me wonder about all the other functions. Heart rate, blood oxygen,. Are they accurate? I don't know. Also the sleep  monitor does not work at all. It is suposed to automatically start when you get settled and asleep. It does not. I have worm this watch since Christmas and and so far these two thing do not work properly if at all. Otherwise it is stylish. The watch (clock) works, Connects to phone, accepts and makes calls, ( but cannot hear verywell ), can read texts.. But I am giving it 1 star due to the reasons I mentioned which were what I actually purchased this for in the first place.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Really junk","reviewDescription":"Right off the box, the watch performed erratically. Display would not response to the setting of wrist raising (set in app). The display would flash briefly then disappeared. As to functionality, the watch has many limitations in terms accessories such as timer and stop watch. Watch face design availability is decent, but not many useful ones. The readings of pulse, blood oxygen, steps, etc. are inaccurate. The value of this item is low. The product itself has \"Made in China\" printed on the backside.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Not worth it","reviewDescription":"Had this watch for over a month and that's how long it worked for. I do not get any notifications calls or text messages on my watch. Not even my alarm works on the watch even when I disconnected and reconnected as well several times.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Syncing watch to.phone triggered scam websites","reviewDescription":"This watch required the Gloryfit app to sync with my android phone. The app itself immediately sends you to a third party that insist you give payment info to go any further saying we will never charge you. Immediately I was charged 1.99, then 2.00 from some vendor who I was able to contact and have these charges removed. Here it is a few days later, I am getting alerts on my phone for a 39.99 charge from Bookhub pro that I have not authorized and don't even know but it was somehow related to the same Gloryfit app...where these scam artist get your info. My card is now frozen and I will have to go to the bank tomorrow to get another card. Oh, and did I mention I sent this piece of trash of a phone back? Buyer beware on this one for sure.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"It never wants to stay on","reviewDescription":"It don’t want to stay on , whether it’s fully charge or not , feels like a waste of money for something you buy, you can’t not use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Garbage","reviewDescription":"The first 3 hours it worked great then it started to malfunction. Face themes kept changing on its own, couldn’t use the touch screen buttons, would t shut off or on and constant needed to update the weather.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"The battery life is disappointing","reviewDescription":"The battery life is disappointing—I have to charge it every day, even though I'm not using many of the apps. I do not recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Do not recommend at all, caused burns","reviewDescription":"A few days after purchasing the watch I started to notice a small red spot. I assumed I had the band too tight. After loosening it some the mark disappeared. Last week I noticed a red square shaped mark on my wrist. Again I assume it was too tight. A week hours later my arm started burning when I took the watch off there was an obvious burn where the sensor is located. I haven’t touched the watch since. I don’t what happened but it was definitely the sensor that caused the burn.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"It was a great purchase for 3 months","reviewDescription":"It started off great. I use is daily and it recorded my activities well. Then last week it started to not respond. The button doesnt work. The face will turn on when it wants to. It now stops randomly in the middle of a workout.  I know it was cheap, but not worth it in the end.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Not worth it","reviewDescription":"Don't buy.  It's not worth it.  Only lasted 6 months. Now, it no longer charges.  I ended up going back to purchasing a Fitbit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Overheated and Burned Me!","reviewDescription":"The watch malfunctioned after just 8 months and while sleeping started overheating to the point that it woke me up to see that I was burned and blistered where the watch was and it no longer will take a charge.  Completely unacceptable not to mention highly dangerous as it is a wearable device.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Sent it back","reviewDescription":"It just wasn't for me. . . . Others may like it.  I did not.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Stops working","reviewDescription":"I would give zero stars for this watch. A month and a half after getting watch, it just stopped working. Tried charging it for a full day, but didn't fix it.  I always charged it after one days use and have a full charge but this is my second watch from them and they are horrible.  Save your time and money and buy a reputable watch that's not online","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Damaged\/leaked bottle","reviewDescription":"Product arrived with liquid leaked all over the place affecting other products inside the box.  There was good amount of liquid that leaked from the bottle. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"not very happy","reviewDescription":"It took me a while to order this smart watch due to competition of all, what made me decided is on reviews and stars.I ordered this over a month ago as a gift \"for my wife\", more on walking.1st downloading the apps is very tricky alot of banner that do not affiliated with the watch (be very careful).2nd. Charging smartwatch my 1st 2 charging i did not have any problem, my 3rd charged I started to noticed the bluetooth started to disconnecting, my wife would tell me that the time is wrong, I would have to reset it in order to synchronized with the watch.As of now all i can do is reset it will connect for 10 seconds, disconnected and freezed. 😔","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Cannot make\/recieve calls","reviewDescription":"UPDATE:DO NOT WASTE YOUR MONEY ON THIS WATCH. It  does NOT make\/answer calls as it says it will and I cannot get through to anyone to make this right. Very frustrating!Looks nice and functions well with tons of face options and message receiving-which is why I’ve chosen to not return it.I’ve gone in to settings and it should come awake when I lift my hand or give a shake, but does not and I have to push the side button every time to get time. Often in the work I do I do not have a hand available to do that and it can get frustrating. But that seems to be the only setback so farUpdate: I cannot answer or make calls on this one. Instructions are frustrating and not clear","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"El proveedor NUNCA se contacto","reviewDescription":"Solo funciono 6 meses. Al principio parece que funciona todo bien. Pero despues de 6 meses la pantalla se daño y perdio su funcionalidad.Producto desechable, NO VALE LA PENA.En AMAZON, me dijeron que escribiera al vendedor, pero este nunca se comunico, ni respondió los correos.PESIMO PRODUCTO, PESIMO SERVICIO.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Lasted less than a year.","reviewDescription":"I liked it at until it froze less than a couple of months after I bought it. I attempted to reset it by pressing the power button, it powered off and would not power back on. I pressed and pressed. Then on about the 30th time it vibrated and powered on. Then I noticed lines across the screen like a damaged tv. Since the power button is now useless and the lines increased I’ll retire it. There’s also a loud buzzing noise emitted from the back of the device.  It’s a lot cheaper than the typical smart watch and worked well when did work so I won’t give it zero stars.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Horrible product","reviewDescription":"Watch stopped working a little over a month after I got it. Screen won't turn on. Waste of money. And now I'm just past the return window. Do not buy!! It's junk!! So disappointing!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Very inaccurate","reviewDescription":"I thought it was a good deal on a smart watch but this thing is useless all its features are very inaccurate the only thing it’s useful for is telling the time. I mean you get what you pay for so i don’t know why i expected this to be legit. I’m not trying to hate some people might enjoy having a cheap smartwatch but if you are serious about tracking your health(heart rate, blood oxygen, sleep habits, steps and calories) this is definitely not the watch for you.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"NOT WATERPROOF","reviewDescription":"We had this watch for about 6 months for my daughter. She loved everything about. We were on vacation last week and she jumped in the river for 10 mins. Her watch is now dead and won’t turn on. Such a bummer","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Have to reboot daily","reviewDescription":"I’ve had this watch for 2 months now. I’ve given it an honest try, but I have to turn it off and back on 6-7 times a week and the past few days twice a day. It won’t count steps or do anything other than tell time. Once it reboots it will count again until midnight usually then it resets and won’t do anything. I’ve checked for software updates, I’ve made sure the battery is charged, I’ve checked and adjusted the strap multiple times. The watch just doesn’t work. I would return it but I don’t have the packaging anymore. I do like that they have lots of workout options to choose from… pretty much the whole reason I got this watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Less then 24 hours old","reviewDescription":"I have had this less then 24 hours and I woke up to lines across the screen. I have messaged the selling and waiting to hear back, I will update once I hear.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Didn't last long","reviewDescription":"The watch seemed great at first, but about 6 months in it just stopped working. It will charge to 100%, wake up, then immediately shut down and become unresponsive. Hopefully this was just a defective one, but in my case, it was not worth the money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Short life","reviewDescription":"I purchased two watches a month ago, one for me and one for my husband and they're both giving us problems.  My husband's watch stopped working. Mine works on and off.  I went to see if I could return them and but the window to return it is closed after a month and a half. I'm so disappointed at this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Not user friendly","reviewDescription":"Super confusing to start up. My son loves it but he doesn't know any better. I set it up for him and it was a pain. The watch has a scan code when you first turn it on. Well my son was excited and got off that screen, couldn't find another code to scan to get the app. The paper with instructions had very little help but bright side many different languages for all to read. The instructions didn't have the app named on it anywhere. The app is super sketchy. It's called Glory Fit. The Bluetooth name for the device is weird and doesn't say it's a watch just letters and numbers. I'll be going FitBit next time. This one is a trial run for my 12 y\/o.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Not waterproof as advertised","reviewDescription":"Watch was working fine until it got wet. Even though it is advertised as being waterproof it is not. I don't recommend this if you want a waterproof watch. Video is after it got wet. I have requested a refund so I can buy a waterproof watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Only worked for 6 weeks","reviewDescription":"I only had those watch for month when it stopped working. It would not hold a charge, pair with my phone or do anything it's claims it would do","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Well packaged","reviewDescription":"Good package. Comes with a manual and USB cable. Haven't used it yet, hence the 4stars.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Working Properly","reviewDescription":"This watch is nice for the price.  The issues I seem to be having is that it always disconnects from my phones bluetooth.  I was excited about the sleep setting, but when I got up this morning making coffee and everything it was still counting the minutes that I was still sleeping.  How do you fix that?","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Good watch","reviewDescription":"This watch is exactly as described. Holds a charge for days. I’m very happy with it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Having issue synching contacts","reviewDescription":"I wanted to add my family to bluetooth calls, but was only able to add my sister. It is only showing 10 contacts. How do I get all my contacts?","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Accessibility that provides","reviewDescription":"It's a good device, convenient and functional. What I like the most about this watch is tracking of outdoor activities that you may want to perform such as cycling, jogging, walking etc. Also, provides accessible call answer, which is fantastic. One advice DONT wet it, DONT put it in water. Overall is a good watch.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Great but Confusing","reviewDescription":"The watch has many options which is great, but the directions are limited and confusing.  Instructions for each function should be readily available and clear.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Long battery life","reviewDescription":"Use this watch for everyday wear, lightweight, long battery life.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"not bad","reviewDescription":"works well but sleep needs some work","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Lots of capabilities in an inexpensive smart watch.","reviewDescription":"After using the watch while swimming in the pool, it was still running.  However, the power did not hold up.  It went from fully charged to 40% in minutes.  I have replaced the watch with a new one of the same type.  I won't use it in the pool and will see if it holds its power better.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Nice for its money","reviewDescription":"For the price and looks, I like it and the appearance is very great especially when going out. But don’t expect it to be like the Apple Watch, that’s when you’ll be a bit disappointed. Functions ok, just wished I was able to reply to texts from the watch","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"Pretty basic","reviewDescription":"I will admit that I liked the fact that it looks like an Apple Watch but it isn’t very intuitive. I can’t receive texts (perhaps Apple has something to do with that?) and only works occasionally for my phone calls. It does seem to get most of my notifications but the text is so small, it can be difficult to read. I do still use it. All in all it’s a nice watch with some decent features. This is a good example of getting what I paid for, so I’m not mad at it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Smart watch","reviewDescription":"It was a gift to my husband he loves it, It takes a little while for him to understand it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Not worth it","reviewDescription":"It's a watch. That's all mine is good for. All the other functions only work sometimes.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"works nicely","reviewDescription":"works nicely. ended up giving to wife. long battery life.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Great watch, syching a little tricky","reviewDescription":"I like the clock faces (there are many to choose from). I'd like be able to set the awake time -- it turns to back to black too quickly -- I'd readily recharge more often if I could have the face \"on\" more often, especially when cycling.It sometimes takes a little dance (on\/off interfacing with phone until it \"takes\").All in all, it does what the product description says it'll do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Good For The Price","reviewDescription":"It fits well, great to know my steps, calories burned, heart rate, etc. my only complaint would be that the battery died quickly after 50%. Since then I haven’t allowed it to get below that percentage so it works fairly well!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Smart watch","reviewDescription":"If you don't want to spend an arm and a leg on a smart watch just to be able to track your heart rate and sleep, this is a great option! It should be able to fit on any wrist. I don't know why, but there are times where it disconnects from the app and doesn't share my info with the app. I've only let it die once, but it seemed to still record steps when it was dead.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Band broke 2 weeks after return window","reviewDescription":"I love the easy access timer feature, tracks sleep, heart rate, and steps. Many other features I didn't really utilize. I tried buying a new band for it shortly after getting the watch, bit it wasn't the right size. Started having issues with the band coming off within the last week. Took off my jacket and the watch fell off and the bar to connect the band is now missing. Good watch, otherwise.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Solid watch with a couple of nagging things","reviewDescription":"This watch is pretty solid.  I like all the features and easy to pair.  Maybe I'm not using it correctly or the watch has limitations.  I bought it mostly to use the music feature so I don't have to pull phone out of my pocket.  No volume control and you can only play pause or move to next song.  Also annoying, if I start the walk or jogging tracker you can't go to another app on the watch.  If I want to go back to music it asks if I want to end and exit the tracker.  Again maybe I'm using it wrong.  Any comments?","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"Great Watch","reviewDescription":"Good display and great potential! The steps are not to accurate but besides that it’s a great product!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Great","reviewDescription":"Great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Nice watch","reviewDescription":"First was delivery was delayed. And then was told that it was delivered when it wasn't. When tried calling about it. Was told just Waite 48 hrs. So it took a extra day. Well a gift for my mother. Try get her a kinda a beginner smartwatch to see how she likes it. Kinda had some issues at first to hook up. Ones it finally hooked up. It made calls and received texts just fine. My mother loves the color and look of the watch. Setup the weight and other fitness setting pretty easy. So far the watching is working out like it should. She is super happy with it. If anything changes I'll let you all know.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"First Smart watch","reviewDescription":"I ordered two of these one for my husband and one for me. These are suprisely easy to set up. So far we are both happy with their functions. The only thing is if you have a lot of contacts it will not pull all of them over from your phone. It is not a problem since whoever calls you will still show up. You can answer the call if you are not near your phone and the quality is good. I do recommend these watches.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Works good","reviewDescription":"Nice watch for the price, comfortable wrist band.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Good love my watch","reviewDescription":"Have it for a few months . It’s doing well. Charge very fast. Love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Good watch for the price","reviewDescription":"I use this just for step tracking and telling time. Without texting & calls I get 6 to 7 days out of a full charge. Nice bright adjustable display.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Producto cumplió con mis expectativas.","reviewDescription":"Este Teléfono Inteligente tiene muchas de las acciones que necesito a diario. Me ha sido muy útil en mi caso. Estoy muy conforme con el producto, es mi compañero diario, hasta en la ducha esta conmigo.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Stop working","reviewDescription":"Good for the price. I bought two watches and the button on one of the watches stop working so there is no way to turn it on unless tou get a call or notification.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Nice watch","reviewDescription":"Bought for myself but watch face was too big for my wrist, so my husband took it. He really likes it but the weather app seems to go in & out. He only uses it for steps, sleep & weather.  Well worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"A good watch","reviewDescription":"Good watch for the price. Struggles at times to connect to my phone so I have to disconnect and reconnect it once a week. But when it is connected it does great. I like how I can pick a different face look amd also use personal photos as a face!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"OK watch for the money, but not great","reviewDescription":"This watch provides the basics of any smart watch, but does not excel.  There is no volume adjustment for the ring tone, nor for the vibration level.  There are no notifications from Zoom or Teams, which are important for business.  The App does the basics but not very user friendly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Meh","reviewDescription":"Band broke easy the first time, and now the speaker is broken","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Large screen","reviewDescription":"Love large screen and clear information on it.I don't like that it counts steps when I am on equipment at the gym.It quickly lost connection to the app on my phone and it is not allowing me to reconnect.It takes too much time to get it back up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"El reloj smart no se puede cambiar la hora diaria","reviewDescription":"No se pueder poner la hora correcta. No funciona con ninguna de las aplicaciones, entre ella Fitpro😟!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Seems to loose itself","reviewDescription":"Doesn't always seem to connect to the app sleep mode don't show up on watch doesn't always come on when you raise your arm heart monitor and step counter seem to work ok most of the time","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Losing percentage","reviewDescription":"I love this watch. I just got this on the 31st and the battery percentage keeps going down one every hour, is it supposed to do that? The battery is still full and looks like its not moving but the percentage keeps going down.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"Watch damages skin","reviewDescription":"I want to wear the watch at night to get sleep quality info but it burns my skin if worn too long.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"Really nice","reviewDescription":"I would rate it 5 but my husband broke out from the band so I have to get a new band for it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Might be a good watch but.","reviewDescription":"May be a good watch but the face is much too big for a women's wrist.  Had to return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Watch","reviewDescription":"I love the features and the watch itself but having a problem changing time and setting date.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"easy to set up and great battery life.","reviewDescription":"Easy to set up, quick to charge.watch band is comfortable but watch face is a little larger than I expected.all functions work well, I particularly like the step counter, unexpectedly my second favorite function is the sleep monitor, it lets you know how much deep sleep and light sleep you get per night.overall great value!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Quality and functionality","reviewDescription":"I was skeptical when punching this watch knowing it was so cheap but I'm so happy with it. It was so easy to connect to my phone and the app is surprisingly well design and easy to use. It does whats advertised , the battery life is excellent and it usually lasts me a couple of days. I love that I can customize the watch faces as well.  If you're looking for a cheap but functional and quality watch look no further, this one is great.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Perfect for kids or adults","reviewDescription":"This watch has so many features considering how inexpensive it is!  I purchased it for my 10yr old son and it was so easy to set up!  He can now send texts or take calls through the watch. He loves counting his steps. The charge lasts forever!  It honestly comparable to an Apple Watch. And waterproof!  Very happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Incredible watch","reviewDescription":"Easy to use it and setup. My wife loves it cause it tells her all the things that she needs to keep up with it like exercise, health measurement,time etc. The best part is the screen is big enough to read everything really easy, charging us easy to do, I love all the features that this watch bring but the best part is the price is so low I can't beat it,I recommend it to anyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Super Impressed with this Smart Watch","reviewDescription":"I was impressed with the packaging upon arrival. It was in great shape, I opened it and the nice professional box was covered in a thin plastic film. I opened up the box and took out the smart watch, instructions and charging cord.I ordered this Smart Watch in Rose Gold with Pink wrist band and it was just gorgeous. High quality watch face, strap and metal clasp. I am extremely delighted with this product for only $32.I charged it up a little then downloaded the APP from the QR code that the watch automatically displayed. It was super easy to get everything set up and only took about 3 minutes. I know it came with instructions but I tend to not follow directions well so I got it set up without reading the booklet.I bought this watch for 2 main reasons. One, to receive calls on it while my phone is in my purse or on the counter so I won't miss a call going from room to room while staging homes or if I'm just at home. The second reason is so I don't miss a text and easily respond without picking up or finding my phone b\/c I heard a ding from the other room.I also love that I could choose my home screen from several different options and chose a simple but classy style with a gold emblem in the middle of it.I know this watch has other features like heart rate, step counter, etc but I really bought it to easily receive and reply to phone calls and texts so I can seamlessly run my Staging business.I definitely would recommend this watch to anyone. Since the packaging and watch is extremely nice, I would also recommend it for a gift for someone. Again, I'm very impressed with this watch. 😊👍❤️","isVerified":true,"ratingScore":5,"reviewReaction":"38 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Does the job","reviewDescription":"This watch is a good value for the price. Shows calls\/ notifications and text messages. Only down side is you can't text back from it but thats kind of what you get for the price. Charges fairly quickly and can hold a charge for a few days before going dead. Arrived with charger. Only thing is it does disconnect from Bluebooth a few times but fairly easy to re connect just depends.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"How much sleep I actually get..","reviewDescription":"My watch is perfect, great with notifications, step and sleep tracker and connectivity. Still learning to use all the features.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Very happy","reviewDescription":"I’m very happy for the product. Exactly what I was looking for. Being using for last 3 months, no complaints","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Good value in this smart watch","reviewDescription":"I purchased this smart watch as an replacement for an older-style tracker watch that I had been using.  I liked the appearance of this watch, as well as its features.  It does almost everything that a much more expensive watch of this type does.  I would highly recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Excelente","reviewDescription":"Esta muy bueno el reloj para lo que cuesta","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Durability","reviewDescription":"I've worn this watch for work about 2 months now and the watch band broke. Pretty basic watch. I figured this to be the case considering the price point, but kinda upsetting it broke so quickly. Wouldn't but again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Only worked for 2 weeks,now it won't even turn on","reviewDescription":"Stopped working after 2 weeks, now it won't even turn on","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"NOT WORTH THE MONEY","reviewDescription":"This watch worked ok for the first week or so. Tried using it at the gym, and as soon as you get slightly sweaty it stops tracking steps and heart rate. would not recommend this watch to anyone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"This watch has to be charge every 2 days?","reviewDescription":"The fact that the,watch goes dead all the time!!This watch was not worth the money soI find myself charging this watch every two days it goes dead?? I do not understand this? How can I resolve this problem?Or how can the manufacturer resolve this? Please let me know should I return the watch?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Not worth my time or money","reviewDescription":"Did not learn until product arrived how heavily it relied on pairing with my phone. Despite numerous attempts, could not get the two to connect. Makes the whole thing g worthless to me.  Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Couldn't find my phone function does not work","reviewDescription":"Couldn't find my phone function does not work even though both were paired and only 4 inches apart.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"sent back","reviewDescription":"I ordered this watch and it had a scan box I had to scan before I could download an App . When I did I noticed I couldn't use my flashlight and my phone kept telling me my camera was in use . It took over everything on my phone and my camera was always on along with my microphone . I don't know if this is normal or not but I had to factory reset my phone and I sent this watch back .","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Doesn’t keep track of steps. Sensor doesn’t work. Not keeping track of sleep, steps, or heart rate. Doesn’t work at all. DO NOT SPEND MONEY ON THIS!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Stops working","reviewDescription":"I got this watch in November and use it for work and working out. It randomly will no longer hold a charge or turn on at all. It still looks like new, has had no drops or accidents, contact with water but it will not work. Not very happy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"So sad can't run.","reviewDescription":"Not user friendly. Still can't set it up. Not enough directions to instruct what to do to start to end and how to do anything on it, like even set the time. I like how it looks, but if I can't run it its no use.Im sad about it. I will need to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Smartwatch","reviewDescription":"Arrived as promised - I have been using it for 3 days and so far so good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Don't get it wet.","reviewDescription":"Do not get this thing wet. Other than that great for a kids first smart watch.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not so good","reviewDescription":"Doesn’t fully work for iOS 17-4","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Decent watch","reviewDescription":"The watch is decent I just do not like the app you have to get in order for it to function because it’s 89.9 that’s using way too much data for me. I will only wear as a watch🤷🏽‍♀️","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Doesn't count all your steps!","reviewDescription":"This is an OK low-cost Smartwatch. Unfortunately it doesn't start counting your steps when you start walking. It waits until you have gone ten consecutive steps before the count begins. I have suggested to the company that they adjust their software to start counting when you start walking, but they have not responded. If you are looking for a device that counts ALL your steps, keep looking!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Can't write text back via sms","reviewDescription":"Looks great and quality seems good but u can't add apps on it and only receive text but not respond back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Pedometer is wack","reviewDescription":"I got this watch mainly to count my steps, but apparently it doesn’t start to count until you’ve made 10 consecutive steps. I used to have a Fitbit but didn’t feel like paying the hefty price tag but now am regretting it. I averaged around 15,000 steps a day on my fitbit (I have 2 young children 😅) but am now only averaging around 7,000 steps a day with this watch. Lame.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Great price","reviewDescription":"I waited to write a review to see how it does. It’s great does everything it should. The only thing i had problems with was the phone calls, I can hear them but they can’t hear me","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Not completely happy","reviewDescription":"I have tried everything to connect to my phone for calls and to messages to be displayed on screen and it's a no go.Kinda disappointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Lili","reviewDescription":"El reloj está acorde con su precio,tiene sus dificultades pero con el costo sabìa q podía pasar, se desvincula con bastante facilidad del teléfono, el alcance del Bluetooth es muy corto, t alejas un poco del cell y ya no puedes contar con el reloj, la batería dura 3 o 4 días, los medidores d salud son un poco extraños, aun así, vuelvo y repito, esta en correspondencia con su costo, espero me resuelva hasta q pueda tener otro q verdaderamente cumpla con mis expectativas👍👍","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Horrible","reviewDescription":"Does not do as advertised and will drain your phone battery and does not stay connected","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Smart watch","reviewDescription":"I would like to return watch. Not what I wanted.  Pls send a return ticket","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Not Waterproof","reviewDescription":"My 2 kids both got this watch, it was working great.  Then they wore them swimming and both watches stopped working.  Now they will not turn on.  Super disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Do NOT recommend.","reviewDescription":"Returned. It would randomly stop tracking my steps, etc. for absolutely no reason. It would also read that I had a (for example) 70% charge and then die. Do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"waterproof","reviewDescription":"Loved this watch but it quit working after swimming. Totally went black. Only had it for 30 days. It was a gift.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Stop working after the month of warranty they give you","reviewDescription":"I purchased 2 pink ones and 1 blue the 2 pink ones stop working just after the month they give you of warranty will never purchase this item again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Don't make this your first choice","reviewDescription":"Dose not connect all the time. Have to turn my watch off in the car because it want allow my phone to connect to car. It doesn't track your steps,heart rate, sleeping, etc. At all every once in a while it will get your steps. Keep getting a message saying heart temp over 65° even when on charger.  Just kept it because I can make and take calls on the watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I charged it once I opened the package and took 12 hours to charge. I took it off of the charger once it said fully charged and 2 minutes later it was at 17 percent. I wish I could give it zero stars or even negative stars.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"complete piece of junk.","reviewDescription":"The software that you have to use is terrible. Watch connected with my LG but no functions were available even after all permissions were granted. Complete waste of money and time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Didn't last a week","reviewDescription":"This is my second watch. First one lasted about a year. I stopped wearing it for a while and charged it back up, it worked great and then just died. Bought this one and it did the same thing but within a week of delivery it died as well. Great while they worked but didn't last long.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"So cute and affordable!","reviewDescription":"I like how this watch tracks sleep, heart rate, steps, and so many other things. It's convenient when I'm at work and I'm getting a call for it to display who's calling and I can pick up or ignore the call right from the watch. I have very sensitive skin and am allergic to nickel and I haven't had any bad reactions to this. Very pleased with my purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Excellent Purchase for the Price","reviewDescription":"I'm absolutely satisfied with the purchase of this watch. This smartwatch has exceeded all my expectations, especially for the price. From its exceptional compatibility with my iPhone to its lasting battery life, easy app integration, waterproof feature, and accurate health tracking, I give this smartwatch a 5-star rating.First, it has a remarkable battery life. I charge it once every week, so I don't have to bother about charging it frequently.Also, being able to read text messages, and make, and receive calls directly from my wrist is really cool and convenient for me. The volume during calls is impressively loud, and I appreciate the ease with which I can adjust it according to my surroundings.Setting up the watch was easy and straightforward: Connecting it to my iPhone was quick and hassle-free. The app's interface is also user-friendly.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"Great","reviewDescription":"Great watch","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Unbelievable battery life.","reviewDescription":"I have a Samsung smartwatch... battery lasts maybe 10 hours max. This watch seems to keep a charge for weeks! I do not wear it daily, but my Samsung didn't even care if it was worn or not... battery would just tank very rapidly. I do not use any apps of other features on this watch other than for time and heart rate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Amazing product","reviewDescription":"When I say this watch runs circles around the expensive galaxy watch that I had... I got it on Sunday,  charged it and on the next Sunday it was still at 52% battery.  My galaxy watch wouldn't even hold a charge a full day. And I did 2 factory warranty exchanges so it wasn't just a bad lemon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"I like this watch","reviewDescription":"I have bought many of them as gifts for friends and have gotten 100% positive feedback. I wear one myself and I think the health monitoring feature works very well. It helps me to detect the quality of my sleep and sync it with an app. Its analysis seems to be very accurate so far and also gives me actionable suggestions.My friends are more interested in the sports mode, I haven't tried it myself yet, but all my friends agreed the fact that it gives accurate data and has a lot of variety.In addition, the battery is great, with a short charging time, it is enough to keep it going for a long time.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Excelente","reviewDescription":"Se lo regalé a mi hermana y quedó fascinada! Además el precio es espectacular!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Makes hands free easy","reviewDescription":"Seems accurate so far for heart rate and steps. Sleek appearance with the rose gold trim. I get notifications from my phone sent right to my watch. Only problem is the speaker is on the underside so calls are muffled. Besides that the device runs smoothly and efficiently","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"5 stars!","reviewDescription":"Wow, guys I definitely recommend this watch. There are so many features that I didn't think I'd use, but they have come in handy. I use the running app (program) that tracks how many miles I have ran or walked. I love the heart rate and sleep monitor and how it counts your steps through out the day as well. Another thing that is cool, is there are tons of display faces you can change to, there are even holiday designs. It was really easy to set up and the battery life is insane, I can wear my watch for a week before having to charge it. Super cool for a low price and worth every penny. 5 stars!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"Easy to use, syncs to phone, durable!!","reviewDescription":"I wanted to wait to write my review until I have had the watch for a while and I could honestly write a review. I have owned a samsung fit watch and used that until ordering this watch. I love that the screen is clear, bright, and easy to navigate. The watch synced to my phone with no problem allowing me to answer calls, read text messages, play music. It tracks sleep, steps, heart rate. For being an offbrand smart watch I am honestly impressed with it. I love it!!","isVerified":true,"ratingScore":5,"reviewReaction":"34 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Just as Good as a $130 Apple Watch","reviewDescription":"I got this watch mainly to track my steps and heart rate. I thought well its only $30 and I was not expecting much but let me tell you this watch is GREAT! It connects to my iphone via bluetooth and alerts me of texts and calls. It tracks my heartrate, sleep patterns, steps, displays the weather and more. You can choose from around 50 different home screens, depending on what you want the watch to tell you. It holds a charge for around 2 weeks and when it does need to be charged it only takes about an hour to charge up. In my opinion, it is just as good as a $130 apple watch without the inflated price tag. I have recommended it to several people looking for a smartwatch.","isVerified":true,"ratingScore":5,"reviewReaction":"37 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"It was a good buy for the money","reviewDescription":"This watch is useful I found it that it doesn't really record my sleep well or my steps when I'm using it also I got two scratch on the screen and I had it for like 2 months already overall for the price I think it's good. Also it has so many workout options but I also find it inaccurate","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Love!!!! Love this watch.","reviewDescription":"My old Wofit band broke in two places so I had to shop for another one that did similar things. After looking over many reviews I settled on this watch and I am SO happy with it. This watch does much more than my old one did. I love the features, you can use your own watch face which I love. Long battery life. If your on the fence about this one BUY IT!You won’t be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Bonitos y funcionales","reviewDescription":"Gracias","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"It works!!","reviewDescription":"I bought this smart watch solely to record my steps. It was cheap so I was a little worried, however it surpassed my expectations! Not only does it show me steps, miles, calories, but there's an exercise program as well. Check your text messages and email in a glance and the app is simple to use. I 100% recommend this, oh and the batteriy life is ridiculous- 3- 4 days without worrying about another device to charge","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Long lasting. Easy to use.","reviewDescription":"Wanted to track basics: time, steps, if messages came in on iPhone text & weather. Perfect for all of it. I don’t need\/to respond to msgs- just want to see what they are for emergency. Has way to link steps- not totally aligned but better than other ways. Can pick image. Not thrilled with sleep tracking. Is too large for my wrist size and it only tracks when I’m sound asleep, nothing else. I might be too sensitive to wear it. Battery is awesome- lasts 5+ days for me.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Reloj inteligente","reviewDescription":"Me gusto mucho , peroes muy liviano.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Value! More than expected!","reviewDescription":"I had a $300 ticwatch pro 3 ultra until my son whacked my wrist with a stick. Needed a replacement for a while till I could get a Samsung on sale so I bought this on prime day for $19. Tbh it does everything the tic watch could do except change the wallpaper or go on Google play. It blew my mind how amazing this thing is! And the best part is that the battery lasts 8 days while my $300 watch only lasted one after a year. I'm riding this baby till she dies. It's amazing especially for the price","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Awesome watch","reviewDescription":"The wife loves the features on it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Great value","reviewDescription":"Bought one for my husband and he loved it so much I bought one for a friend. She loves it too. The color is beautiful, the screen is big and bright the value for this watch is amazing. There are tons of other super expensive Smart watches then don't compare to this watch. It has tons of features. It is durable and I would highly highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Inaccurate step count, hard to read display","reviewDescription":"My Fitbit died so I thought I'd try a less expensive smart watch...boy do I regret it.*inaccurate step count*weird buzzing sound while charging*display font for texts and other notifications are very hard to read.*watch band gives me rashes*app for the phone is frustrating to navigate*can't get back to the text message once it's gone awayCan't return it since it's past the return window, so this is going in the garbage when my Fitbit arrives tomorrow.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Stopped working after 4 months","reviewDescription":"I waited to write this review, because I wanted to make sure it worked.First, when counting the steps , the watch stops at anytime it wants. I have to reset the watch.Second, when working out the watch stops in the middle of it all.I hope this helps someone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Calibrations are inaccurate","reviewDescription":"I bought this watch to jump start my fitness lifestyle. I also wanted a cheaper version of the brands that are more popular as well as more expensive. I too chose this because if I recall this was also an Amazon pick. I was excited to get this watch after reading the description and the positive reviews. I must have received the defected version of this watch that received those good reviews and I'm very disappointed. To make a long story shorter. One of the alerts I'm receiving on my phone 'daily' is \"sitting too long\",atleast twice per day. The last time this happened I was sweeping my floor-go figure and another time I was walking to my car. Certain features are  inconsistently visible on the watch, example, at times I can access the correct weather and then there are other times when it may be sunny and I see a forecast on my watch for thunderstorms.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Can't find the charger","reviewDescription":"Watch was great for the week that I used it. :( but now the charger is gone and I cannot for the life of me find the same charger to buy for it. Only reason for 1 Star is because I cannot find a replacement event charger.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Good luck getting replaced","reviewDescription":"Worked great the first month and then stopped working correctly. I reached out to the seller and they insisted on me sending them a video as to what was happening and wouldn't even bother exchanging for a new watch. It was not staying synced with phone, wasn't keeping track of steps, and wasn't keeping the correct time and wasn't tracking sleep. Now it's in the trash, money wasted.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Doesn't do most of what it claims","reviewDescription":"I wanted to like this watch. I read good reviews. But, nope.The watch does not send notifications for texts, emails, and calls. I know those permissions are allowed and I know they worked at first, because I tested them. I only get notifications for Facebook messenger which is the thing I use the least.The watch does not monitor my sleep most nights.The watch prevents my other Bluetooth devices from connecting. My ear buds and my car will not connect to my phone with this watch. I try to manually disconnect the watch and it just reconnects on its own.This watch is supposed to make things easier and more accessible, but it did the opposite.When I finally do receive a notification from messenger, I cannot read it because the print is so tiny.The touch screen on the watch is not very sensitive and I cannot get it to react most times.The language used in the app and on the watch - please hire a native English speaker to write your app language. The translated English is absolutely horrible.I have asked for a refund and am sending it back.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Barely works","reviewDescription":"Checking BPM or oxygen is useless - the functions glitch out and rarely ever work. Even factory resetting it all the time doesn’t fix the issue. You can decline a call on your phone but it’ll continue ringing on your watch","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Difficult to program","reviewDescription":"Difficult to program the multitude of functions it is supposedly capable of providing. Frustrating.Aside: Unknowingly by me, my wife bought the same brand in February and it failed in June, unable to be recharged.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Had so much potential","reviewDescription":"This watch had SO much potential and I really wanted to love it but after a full week there are some issues I’ve noticed. My step tracking is very inaccurate. I got this because I work remotely and I frequently leave my phone around the house instead of in my pocket so my daily step count was inaccurate. I’ve only taken this off to shower this week and somehow there have been several days that my phone is showing significantly more steps than my watch. By thousands of steps.I go for walks during my work day or I’ll walk on the treadmill and there are 4 different times it didn’t track my steps at all.Today I did a pretty long Costco run and it didn’t track any of my steps but my husbands Apple Watch tracked that we had walked 1.5 miles.I loved so many of the other features it had and really wanted to love it but I’m probably gonna return it.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Bought 2","reviewDescription":"I bought two of these watches. One for me and one for my teen daughter. Less than 2 months after we got them they are both not responding to touch or the side button.  Early on I noticed that it did not record sleep accurately though it was not a big deal for me.  Now nothing works.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Not good for running","reviewDescription":"For everyday usage and all that, it’s fine. However I’m training for a 5k and it’s not the greatest at all. Somedays it work’s fine, but more often then not it will just stop reading shortly after I start my run, stopping counting steps, or sometimes it says it’s working then just stops and doesn’t record anything. Most of the time I have to go in the app during an outside run to make it work correctly. Setting it for treadmill in the app is ridiculous! You have to find the workout first, then once you click it it doesn’t let you go and use it for the workout. Pointless! If you are training for a run, best to get a more accurate one. You get what you pay for","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Doesn't work well and it's not accurate","reviewDescription":"It's okay if you're in a pinch, but mine stopped working pretty much after only a week of wearing it. The step count is currently stuck at \"99,999\". When you try to read the time, the digital display is very slow to respond. I get a \"target achieved\" notification every single time I get a message notification. Instead of seeing the actual message, I only see the yellow\/orange trophy symbol. It also went from only buzzing once to buzzing three times per notification, so it's become a nuisance to wear. You get what you pay for with this one (a bad watch).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Unfortunately not as good as I’d hoped","reviewDescription":"I like the appearance of this watch. I like the ability to answer calls with it and continue my conversation when I’m away from my phone.However, it is pretty useless as a fitness watch. It will not read my steps when I am walking or when I am riding my bicycle. These are my two primary forms of exercise and why I ordered this watch. I wanted to be more health conscious and mindful of fitness goals. My new goal is now to find a new watch that will enable me to do that. It is also completely inaccurate for measuring sleep. I am up and down all night with an infant, and it will show I had 7 hours of sleep, mostly deep sleep. Ummm I WISH! I do good to get 4 hours most nights so that’s completely inaccurate. And it’s not from when I lie down and then awaken-it doesn’t show any periods of being awake. Very inconsistent results.I missed the return period by a couple days as this was my Christmas gift I chose from the hubby, and I didn’t start using it right away. It had such awesome reviews that I honestly didn’t expect to have this problem. I guess it’s true you get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Can't get text messages.","reviewDescription":"I have an android phone. I've tried everything but almost no text messages come through. I don't think the step count is correct either. It always seems like it undercounts my steps. I bought this after my Fitbit died because I thought this would be a cheap replacement. It's not going to work for me but it's too late for me to return, which is my fault. Battery life is excellent and it tells time well. I would not recommend this watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Don’t Get it Wet!","reviewDescription":"I purchased this watch in January of this year and it was awesome watch it did everything that described. however, I went to a pool party and got the watch wet. One of the descriptions is that it’s water proof, not water resistant. Well it worked the remainder of the evening but the next morning I woke up to that screen display and haven’t been able to get it to work since. So be careful not to get it wet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Had to return.","reviewDescription":"Bought this for my mom for Christmas because she wanted a smart watch to track steps and what not. Found this one and I saw you could receive calls and texts, plus even call out and I was shocked to see how cheap it was for those features. After I set this up for my mom's Samsung A32, I was very disappointed. I was able to hook everything up, even to receive calls and make calls out and her contacts, but I had a hard time getting regular text messages to come through. I trouble shooted everything I could. After I couldn't figure that out, my mom was still going to keep it because she honestly just wanted it for the exercise portion, but as soon as she put it on and we walked out the door, it started vibrating and causing my moms phone to go off too. I thought it could have been it telling her she's up and moving or some type of alarm to start moving, but I messed with literally every setting and turned everything off and it wouldn't stop. No way my mom could used this watch when she couldn't even get up or move without everything going off and her constantly having to manually turn it off. I wanted to buy one for myself because of the price and how lightweight it was, which I loved that part, but now I don't think I will. I returned it and bought her a simpler one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Only worked for 1 month","reviewDescription":"I wanted to love this watch. It wasn't  very easy to set up but once I had it working, I really liked it. It would notify me of texts, emails, and calls. A month after I got it, it started restarting every 15 seconds. I tried shutting it down manually but couldn't get it to work ago until I disconnected it from my phone and did a factory reset.  I re-set everything up and and enjoyed a couple more months until it flipped out and got stuck in some kind of restart mode again, but never actually starts. In this mode, I can't get it to turn off. I let the battery die so it would turn off. But as soon as I charge it again, it goes back into the restart cycle. Very frustrating. I gave two stars since for the brief time it was working I loved it.  I didn't get any help from the manufacturer (no response to email).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"It’s ok","reviewDescription":"As far as counting steps it’s pretty accurate. I had 2 issues with it. One was the my iMessages wouldn’t sink with the watch which is important. And second the messages from other apps that did come in I could bearly read. The font is too small.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Apenas 1 mes de uso y se me dañó","reviewDescription":"Soy una persona muy cuidadosa con mis cosas y no entiendo cómo es que este reloj se me dañó luego de 1 mes de uso. Me lo quitaba para bañarme y todo. En verdad, súper insatisfecha y lo peor de todo es que no lo puedo devolver","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great for the price","reviewDescription":"So far I am super impressed!!!!I paid $29.99 because I had $10 off. I was tired of my Fitbits dying after less than a year so why spend the money? I'm a nurse so a watch is very important to me.I've only had a day but it's easy to figure out. Will update my review when I've had a week and it's tracked sleep and such. So many watch faces to choose from. Do not see an option to use own picture from gallery? Also need to figure out how to change weather from celsius. Going to of course try messaging options (seems this watch will let you get multiple messages from different apps unlike fitbit) and making calls, music, etc. Excited to really take this thing for a test run!Update: 9\/25 I came on here 2 weeks after I had this watch and wrote a LONG update and honest review on it and they didn't post it\/deleted it!!!! Workout tracking is poor, sleep tracking is poor and you can't edit sleep like you can a fitbit. It says I had a 3 hour nap when I was reading a book (I did move during this time) honestly at this point its just a pretty watch. I set a timer it didn't go off, a plus is my alerts and texts go to the watch 99.9% of the time. Calls are a different story. I guess this is a true case of you get what you pay for. Oh well!","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Very cool!","reviewDescription":"I really like this watch. It has so many function just as it states it has. I wear it everyday even while taking a shower, bath, and water aerobics. It keeps on working. For some reason I have to charge more than the previous watch but no big deal. I gave it a four star being that I developed a skin irritation from the rubber band. I’m looking into changing the band. Overall a great choice.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Cheap watch ok for the price","reviewDescription":"I like that it counts my steps and does your heart rate I do not like that it doesn't turn on very good now you have to restart it a dozen times to make a phone call on it you can rarely do that it's really not a very good but it's cheap quality it hasn't really lasted I've had it for a couple of months and I can only turn it on if I'm lucky every so often","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Smart Watch","reviewDescription":"My watch has been really great so far minus the fact my notifications don't always go to my watch. I almost have to recalibrate every single time if I am going to get notifications pertaining to text ect. Other then that, it's been super great to use as a 'fitbit'. Counting my steps daily, my heartbeat, keeps track of my sleep when I wear it to bed, it's waterproof\/resistant; so it's been fabulous in that regard. I would recommend this product to anyone if they didn't care about receiving notifications\/other features, but rather using it as a fit bit.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"We're to find a new band that fits","reviewDescription":"Watch works fine the band broke I bought the watch 1\/9\/24. I would like to know where I can get a replacement band that actually fits","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Great watch, but the fonts are a bit small","reviewDescription":"I like the watch a lot. The one complaint I have about it is that the font of the text messages is a little small. Admittedly, my eyes took a turn recently, where suddenly I need reading glasses on a more regular basis, but I do wish the font was a little bigger. That being said, I love that I can have conversations using the watch! That was a major reason I chose this particular watch, and I'm VERY happy with that feature.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Charging cord to short","reviewDescription":"Right out of the box this charging cord is way to short. Won't even sit on my end table plugged into the outlet. I have to go buy a surge protector that will sit on the table. There a nice decor look, not. Beyond that I haven't had a chance to use it, still trying to charge it. Now, off I go to buy that plug. 😒","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Pretty good overall.","reviewDescription":"I didn't have high expectations for this watch but I'm pretty well satisfied with it. It does a pretty good job of all the tracking features which I really don't care about. I just needed a watch that works when I look at it but it's pretty slow about coming on when I turn my wrist...the reason for 4 stars.  It's well made and has endured my abuse quite well, also setup was a breeze on my S7. It's a great alternative to the overpriced fruit brand...I think you know who I'm talking about ;-)","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"It's a minimum, but great customer service.","reviewDescription":"A few years ago I got a watch for about half this price, it does all the same things as that one did. All around, it's just okay. My side button doesn't work and it plays media unexpectedly.Updated to add a few stars to remark positively on their customer service. No hard feelings- I was offered a full refund and can move on with my watch search. :) The person I gifted the watch to seems happy with its basic function, and has found workarounds for its issues relatively easily.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"My new stepcounter!!","reviewDescription":"I use the watch primarily to monitor my heartbeat and a daily stepcounter.  The numbers are large enuf for me to read.  Hopefully it is semi-waterproof!!  My old one was!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Good product","reviewDescription":"Happy with this purchase. Step count differs a lot from fit bit so now we don’t know which is right! Lots of watch face options and seems to wear well.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Only worked 6 months","reviewDescription":"Liked it fine for six months","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Lightweight","reviewDescription":"My girlfriend likes it to keep up with her heart rate,O2 and whatever other things it does. This is the second one because the first had a faulty button. Will update in the future with the second one. That's why the 3 stars!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"muy malo","reviewDescription":"esta muy muy basico y la  verdad nada extrairdinario, un reloj x","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"Poor battery","reviewDescription":"This watch is not working properly. Its battery after one and a half week stop and a have to charging again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Band is difficult","reviewDescription":"The watch is fine, but the band is difficult to stay flat; the little \"guides\" don't stay in place","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Don't Need Another One Like This One.","reviewDescription":"Very difficult to set up, maybe it's just me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"You get what you oay for","reviewDescription":"For 29.99 don't be surprised most of the features don't work. The pedometer doesn't pick up most of my steps. Heartbeat feature works when it wants to. Sleep monitor doesn't work at all. Cellphone and Txt message feature works great. All in all for 29.99 don't expect the world","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Smells like cheap plastic chemicals","reviewDescription":"Great watch beautiful as ever time but smells horrible like a toxic plastic smell! That was the first thing are all noticed when I open the box.  Hopefully it goes away or it won’t bother me. Unfortunately, you can’t change up straps","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Ok watch","reviewDescription":"Programming  not that straight forward.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Caro para lo que brinda","reviewDescription":"Me parece que esta un poco caro para lo que es el smartwatch","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Works great!","reviewDescription":"I needed something cheaper than a Fitbit and this was just the thing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Watch","reviewDescription":"I love this watch!! I like that it tells you that u need to get up & walk. All the settings are great. Totally recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"BEAUTIFUL","reviewDescription":"BEAUTIFUL","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Excelente Producto","reviewDescription":"Excelente Producto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Excellent  watch","reviewDescription":"Excellent smart , watch  great  price, great quality  material 👌10\/10⭐️⭐️⭐️⭐️⭐️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Get it","reviewDescription":"Best watch ever, sound quality on point, battery life amazing, love everything about it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Love this watch","reviewDescription":"I really just needed a watch for work (nurse) and I ended up getting so much more with this! It receives calls, texts, has a heart rate monitor and sleep monitor,  records steps and calories burned, the battery lasts forever. Honestly I maybe charge it once every week and a half. One of my favorite things is that you can upload a personal picture to make it your watch face. It has a to do disturb mode that I put it on during work so my watch doesn't go off during a delivery and you can set it like a  timer (0645- 1900). Overall I am very happy with my purchase plus I purchased it on sale which made it even better! If you are on the fence about it...I say go for it. I have an Android phone and I just downloaded the app for the watch, no issues...easy peasy! Hope this helps.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"I Love this watch!","reviewDescription":"I was leary of getting a smartwatch because, in my experience, they are complicated. Not this one. I downloaded the app, and I was off and running...so to speak. I love that it reminds me if I've been sitting too long. As for the sports on it, well I think it has every sport known to man. It even has Pickleball for crying out loud. I'm 81 years old so I doubt that I'll be partaking in most of them, but I think I could handle fishing. All in all, it's a great watch.I had a different one that I returned because in order to use the sports feature I had to buy a subscription. Not only that, if I wanted a different watch face it would cost $2.00. This watch has every kind of face you'd want...no cost. You won't be sorry if you buy it.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Everything you need in a smart watch","reviewDescription":"This watch is amazing.  This is my third Fitbit type watch and I love this one the most.  I love the size of the screen.  It's very comfortable to wear I forget it's even there.  It's super simple to connect with my phone and the app just as easy to use.  It looks just like an expensive apple watch but at a fraction of the price.  There's different colors to choose from, you can easily change the face of the screen to fit your needs. I love that the watch will vibrate when I get text messages, before I was missing important texts, not anymore.  It changed really quick and the battery lasts about a week. The best part is being able to take calls on this watch.","isVerified":true,"ratingScore":5,"reviewReaction":"53 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Accurate, stylish, and motivating!","reviewDescription":"I absolutely love this fitness watch! It has all the functionality of competitor watches at a fraction of the price! The step counter is extremely accurate. There are several functions to monitor heart rate, oxygenation, sleep habits, etc. The watch syncs easily to your phone. Seeing how many steps I’ve taken (or failed to take) is in red motivating - it pushes me to stay active and contributes to my overall health. A full battery lasts about two weeks before needing a full charge, and it charges so quickly. Lastly, there are SO many cute watch faces, it’s almost overwhelming! I love how you can switch up customize the watch faces based on your mood and what matches the color of your wristband. Highly recommend this product!","isVerified":true,"ratingScore":5,"reviewReaction":"43 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Great purchase!","reviewDescription":"I purchased this watch as a gift and it's absolutely gorgeous. It fits well and works great. I will recommend 100%.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"WoW","reviewDescription":"Watch is awesome! You won’t be disappointed in the quality of the product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Ahorro y tiempo!","reviewDescription":"Todos los productos me agradaron mucho.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Great Smart Watch for the Money","reviewDescription":"I'm so glad I bought this smartwatch! It's everything I've ever wanted in a wearable device. It's stylish, comfortable to wear, and has all the features I need. I love that I can answer and make calls with my watch, and that it tracks my fitness activities. The battery life is also great, and I can easily go a few days without having to charge it.Here are some of the features I love about this smartwatch:Answer and make calls: I love being able to answer and make calls without having to take my phone out of my pocket. This is especially convenient when I'm driving or working out.100+ sport modes: This smartwatch has a variety of sport modes that track my heart rate, steps, distance, calories burned, and more. This helps me stay motivated and on track with my fitness goals.Heart rate monitor: The heart rate monitor on this smartwatch is very accurate and helps me track my fitness progress.Sleep monitor: The sleep monitor on this smartwatch helps me track my sleep quality and identify areas where I can improve.Pedometer: The pedometer on this smartwatch helps me track my steps and distance traveled.IP68 waterproof: This smartwatch is waterproof, so I can wear it in the shower, pool, or even the ocean.Overall, I'm very happy with this smartwatch and would definitely recommend it to others. It's a great value for the price and has all the features I need to stay connected, active, and healthy.","isVerified":true,"ratingScore":5,"reviewReaction":"32 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Make sure your phone's playstore is compatible with glory fit app","reviewDescription":"I bought this watch for a 10 year old boy. He absolutely loves it! He doesn't have a phone but he does have a Samsung tablet. The galaxy store as well as the Google Play store said the glory fit app wasn't compatible with his tablet. However, I was able to maneuver around that by installing glory fit via apk. And it works! He now can receive messages and calls from me on his smartwatch even though his tablet isn't really a phone, (a smartwatch is an accessory to a phone\/tablet) as long as he's connected to wifi at his cousin's house. He's obsessed with all the many functions and customizable faces he potentially has at his fingertips. The only thing I wasn't sure about was night one with the sleep app. I kept checking to see if it was tracking his sleep on his watch and it didn't look like it was. However, when I went to the glory fit app on his tablet, it let me know I wouldn't start to see results until after the first 4 hrs sleep. I was surprised by how accurate it seems to be! We had never used a smart watch before buying this one and didn't want to spend too much money on one without checking a cheaper one out first. I purchased this when it was on sale for 30 bucks and cannot believe how cool this thing is! I plan on buying the pink one for myself.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Great \"Trainer\" Smartwatch!","reviewDescription":"I bought this watch to see if I could actually wear something this large without it being too noticeable on my very thin wrist. I was considering an Apple, but again, that is a lot of money for something that might look out of place on an older woman. I got the rose gold tone with the pink strap and put on a background that is solid pink with a rose and it only shows the time. Those busy black backgrounds are just too gaudy for most senior ladies. I love the sleep function because my doctor is constantly telling me I need more sleep! Now I can prove I actually am getting some sleep! Buy one, it is worth it! I may just forget about the Apple!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"Surpassed expectations","reviewDescription":"I love the watch so far. I live in a very humid environment and the last watch corroded up. So far since the button on this sticks out i not had any problems with it. I am however allergic to the band which is not the fault of the watch. i will replace the bands. i like the many faces it has and that you can make custom faces.it does the same thing as most other smart watches. so far there has not been any problems with the watch. My main concern was corrosion from humidity and salt air. since it is suppose to be a diving watch i was hoping that it would not do so and so far it has not . App is glory fit it can tell a lot of stuff more than the watch. For example give monthly readings and patterns. Battery life last a very long time it seems almost a week before i need to charge it. There is one thing i dont like the speaker is muffled by your wrist and you hold the watch off your arm to hear. the speakers holes are covered up by your wrist. Wished they would have made the speaker holes higher up perhaps on side or top rather than the bottom.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"It's pretty cool","reviewDescription":"Its set up in military time but you can use the app for it to change it to a 12hr time clock. The heart rate tracker is pretty cool. It's super easy to use. The touch screen is great and it comes charged at about 96% and charges pretty fast from what it seems","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Bueno","reviewDescription":"El.reloj en general cumple con todas las funciones","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Works well","reviewDescription":"Would like blood pressure to be given","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Great watch for the price.","reviewDescription":"I couldn't be happier with this smartwatch! It tells the time so for a watch that's a good start Thw ability to change my music or videos without needing to pull out my phone has been very useful. The touch screen is crisp and responsive, making navigation a breeze especially since you can change the layout of the apps and settings I love the wide range of watch faces available, and being able to customize with my own photos adds a personal touch. The battery life is impressive, lasting up to 7 days on a single charge. Plus, the multitude of features like weather forecasts, music control, and sedentary reminders make this watch a must-have for anyone looking to stay connected I Highly recommend it","isVerified":true,"ratingScore":5,"reviewReaction":"27 people found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"Great value","reviewDescription":"Nice activity watch with lots of functionality for decent price. App interface is easy to use as well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"excelente","reviewDescription":"lo recominedo, funciona a la maravilla","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Best watch ever!!!","reviewDescription":"This watch does everything the expensive ones do. Very durable. And easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Cómodo","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Good watch","reviewDescription":"I think it works great does everything I need it to holds a good charge etc. In 2 months it will be a year since I purchased it. Couldn't ask for more from such a cheap watch.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"Beautiful Face","reviewDescription":"I love the look but am 85 and having trouble setting it up and pairing it up and setting it up. Instructions are printed very small but I had one before and got a new phone and can’t pair it with new phone because family reset it because I tried to set it up myself. So family deleted everything so can’t set it up. I need to have this watch to record all my pb hr  slp rates and others. I’m attempting to do it now a d set face and time. But I like the looks and everything it does if I can get it set and price was fenominale. .","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"SENCILLO","reviewDescription":"BUENA CALIDAD POR SU PRECIO","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Nice","reviewDescription":"Nice watch for the price. My wife loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"The watch","reviewDescription":"It’s a gift we just have to find out how to set the time it’s a perfect gift he loves it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Lightweight","reviewDescription":"Bright screen","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Nice watch","reviewDescription":"So far so good.  I really like this watch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Great watch for the price","reviewDescription":"It does everything i want and check my heart rate and count my steps. Simple and affordable watch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Average product. Lags to update the steps some times","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Va bien","reviewDescription":"Facil de utilizar, hasta ahora va bien.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Functional","reviewDescription":"For a reasonable price for this watch it’s quite functional and just as good as expensive ones.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Great watch for the price","reviewDescription":"I would have given the watch a 5 star rating, but there are so many exercise options & not one for out door walking & the feature to remove & ad only the exercises you want to display....is not working.But everything else is awesome I can even take a call from the watch.I will buy another as my freind thought it was an apple watch....I am an Android user 😄😄","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Nice watch","reviewDescription":"For the price it's really a nice watch","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Nice!","reviewDescription":"This was a gift and the appearance of it was very nice for what it was however, what I did not realize is the person I gifted to already had something similar so due to that I had to return. Otherwise, this is a great gift for anybody!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Better than expected","reviewDescription":"I waited until I'd used this for a couple of weeks before reviewing. I am very pleased with it. I did have my granddaughter set it up for me, so I wouldn't mess it up. But she did it quickly, so I assume it wasn't hard.  The only negative I have is that the weather is not accurate. Seems like it is set for another location. It said it was raining when I had bright sunshine and a warmer temperature. But other than that I like the features.  I got it on sale for under $30 and highly recommend it. I've never had anything but a simple watch, so don't know how this compares to more expensive models.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Good for the price","reviewDescription":"Product is good quality for the price!Setup was a bit of a struggle and definitely not self explanatory but I eventually figured it out.Touch screen works great and, pro tip, if you want to change measurement settings (i.e. Celsius, kilograms, etc) you have to do it IN THE APP. App isn't that great and my watch disconnects from my phone frequently but, like I said, it's a good watch considering the price.Plus- it'll keep a charge for over a week! So that's good 👍🏽","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Buen Smart Watch por el precio","reviewDescription":"Es barato a comparación de otros que vi, igualmente lo compré en rebaja pero se siente bastante sólido y hasta el momento sus aplicaciones has funcionado como debería ser. Si no se tiene un gran presupuesto y quieres un reloj que sea decente por un precio accesible este Smart Watch es una buena opción. Lo único que me pareció flojo fue la interfaz no se puede que sea muy fea mía pero eso es lo que sentí no es mala pero le falta como ser más sólida y pulida","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Doesn’t show calories only kcals","reviewDescription":"I would love this watch if it should calories instead of Kcals. I work out everyday and my Fitbit shows at least 2000 calories burned for the day. This watch shows about 250 Kcals. How can I keep track of my calories burned like that.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Instructions are practically worthless","reviewDescription":"Instructions are practically worthless, that being said that watch does work very well and through trial and error after a month still working on all of the features. Next time I'll prlook for more information about the product and a help desk?","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Frustrating App","reviewDescription":"I received this watch yesterday. I followed all the directions. I cannot get my Google Calendar or my text messages to connect with the app. Google Calendar and the IOS messages app does not show up in the  Gloryfit app. I have been a lot of searching and cannot find any way to add it. The manual sems to be geared more to Android phones. I need the calendar and texts for notifications in my business. If I cannot find a solution I am going to find another watch.Also, not a major problem but there is no flashlight on the phone. I get up a 4am and use my flashlight on my watch to allow my wife to sleep find a few things I forgot to put out the night before.Update 7\/29\/23:There not a lot of improvements to be made. It is the best smart watch I have had in the past without paying the money for an Apple watch. This watch has great battery life, the size and brightness make it easy to read. It does have a flashlight wrongly stated in my original review.I believe this can be a great watch after some of the software is addressed, it shall be worthy of a five-star rating.I made an error the watch does have a flashlight.","isVerified":false,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"Does well and simple design","reviewDescription":"The watch performs well. I only use it to tell the time and date, but has so many other features, particularly for healthy lifestyle. The design is simple, but has many options to jazz up the face.","isVerified":false,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Easy to setup and use","reviewDescription":"User friendly interface, a lot of settings you can customize and the battery lasts me 2 days with a lot of use. The face plate is bigger than most so it looked a little big on my wrist (F).","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Good for the price!","reviewDescription":"Let's begin with the bad things first, the weather widget is not good, it pulls data from a specific server that does not update quite frequently unless you update manually in the app so it would be better just to check your phone. The watch display is not that customizable as I personally don't really like that much some of the designs in the app and the \"Custom dial\" does not have more widgets than time and step count (yeah I know it's a watch but it would be nice to have the date and other features from other watch faces). Also, you can't change the font so that might not be so appealing to some users.With that said, the watch is really solid in every other feature I tried, it syncs pretty quickly, notifications arrive as desired, the sedentary monitor is accurate, BPM and O2 saturation tracking are pretty good, and while I have seen some people complain about the step counter I haven't seen any problems with that, the watch itself tracks it so it doesn't need a phone with step count. The Music control feature is quite simple but it does the work, would appreciate it if it was possible to add volume controls to the screen. The rise to light on the screen works quite fine and when it stops doing it properly a soft reset solves the problem.When I started using it I got the \"Temperature too high press verification\" message and I was disappointed by that because I used to get the message quite often, after two days the message stopped appearing and I have never seen it again, what I noticed at that time was that I was wearing the watch way too tight and when I loosened it a bit the watch stopped raising the said issue. Can't say anything about It being waterproof as I have not tried that.Battery lasts for a long time, up to 12 days without charging nor turning off. If you turn it off at night it can last for 3 weeks. For the price, it's a good deal, some improvements could be made to the weather widget and the customization but overall it is a good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Worth the cost","reviewDescription":"After using it for over a week I have a good idea of the watch functions. Overall I like it a lot and would buy it again. I will share my pros and and cons.ProsLooks goodFunctions wellDoes a nice job of not over counting stepsBattery life is goodNice choice of watch facesComfortableConsToo few phone manufacturers in watch for setupNo option for flights of stairs in steps functionBlack finish coming off alreadyOnly water proof rated for shallow water for 30 minutesFor the price it really does work well and I can deal with the cons on my list.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Funciona bien","reviewDescription":"Relación calidad precio está muy bien, obviamente no tiene las funciones de uno de gama alta pero está bien. La batería dura bastante. La única pega que tiene demasiado grosor y queda grande sobretodo en mujeres si tenéis la muñeca pequeña.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Spain","date":1719619200000}
{"reviewTitle":"not very good","reviewDescription":"really difficult to have the watch on I can't see my steps daily , sleep tracking not working at all","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714176000000}
{"reviewTitle":"It was working at first","reviewDescription":"I wanted to like this watch so bad but it malfunctions. The sleep tracker worked 3 days then stopped. The step tracker is inaccurate and goes back and forth to 12-24 for some reason. I’m disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Doesn't last","reviewDescription":"At first I really was happy with my watch. Then, after about a month, I noticed difference in step counter. At one point my friend and I were walking through a large store and my watch said, YOUVE BEEN SITTING TOO LONG. Whaaaat?The app and the watch were continually unsyncing. The watch will only work with the Glory fit app. It doesn't give you the information it promised.  I have started a return. I'll buy a whole new watch from another company.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Smart watch","reviewDescription":"Had this watch for a while, haven't had any issues with it at all other than when it tracks my sleep isn't as accurate. Battery does last a few days.Less than a year of having it. It messed up. Would not buy this product again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"No","reviewDescription":"It does not keep step tracking correctly.  I had to wear another watch to get my steps correct.  It has good sound for the phone but the watch dies out quickly.  Sent it back","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Very laggy","reviewDescription":"I tried to find a new watch that I didn’t need to pay a fortune for, and I guess it wasn’t a good idea. This one was extremely laggy and slow with any swiping or movement. The watch faces are really tacky and not at all what I want. You can’t edit them either. I do not recommend this. Just buy a SE Apple Watch which is still fairly cheap. This item was Returned the next day","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"No really effective watch faces as shown...","reviewDescription":"None of the faces shown on the advertising or in the reviews are available.  There's one that I can use, maybe 2.  Most frustrating is that the watch is typically on black screen and there's no option to have the screen lit to show the time.  You can activate a wrist motion wake feature through the app but it's not great.  The band is more comfortable than I expected.I wanted to try one since I've not had a smart watch.  It's nice seeing the alerts for texts but the message has to be short to see it all.  I'd like more watch and less questionable functionality like calorie count and a lagging outside temperature tracker (3 hours behind).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Date and time incorrect","reviewDescription":"No instructions to change date and time. I returned it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Not very accurate","reviewDescription":"I bought this watch to monitor steps and sleep. I just finished walking one block and it says I only walked 87 steps. I would say it is not quite accurate. The only accurate things on this watch are my heart rate and the time. I have had a great deal of trouble getting this thing to monitor my sleep. I contacted the seller who made suggestions but it still will not monitor my sleep. The one thing that the seller told me that is not available in the product description is that it only monitors sleep between 10 PM and 8 AM. If you work alternate hours and sleep different hours, this product will not be for you.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"No tan bueno como se esperaba","reviewDescription":"Las llamadas sólo funcionan en ocasiones.. deja de funcionar el encendido de las pantalla al voltear al poco tiempo de uso.. no es contra el agua…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Bit buggy","reviewDescription":"I like the product when it was working however I had to return the first one due to issues. I replaced it with the same one hoping it would be better. The second one's sensor stopped working after 4 days. Returning this one as well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Doesnt work well\/inaccurate with steps","reviewDescription":"I have had this watch for just over a month. I tried to give it time to see if it would work better. It does not track my ateps accurately at all. My family has smartwatches and can track their steps. They will have walked a couple thousand and may watch only calculates a few steps. This has happened no matter how tight or lose I set it. It also randomly recalculates throughout the day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Short lived!","reviewDescription":"Loved everything about this watch. Custom screen, all the apps and tracking were great. Light weight and very comfortable. Everything I wanted for 1 month. Touch screen and button on side all quit working. Short lived!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"an okay watch, but not reliable","reviewDescription":"This watch doesn't accurately track my steps - and the options for personalizing the watch face are limited. I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Stopped turning on","reviewDescription":"Worked just fine, took it off for a month, wont turn on tried charging still dead.7 months old.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Doesn’t last long.","reviewDescription":"Lasted for about a month before it just stopped working… I recommend investing in an Apple Watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Inaccurate heartrate","reviewDescription":"The heartrate would be off my friend's apple watch by like 20bpm pretty often.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Does not track steps correctly","reviewDescription":"Watch looks good. The display is bright and crisp. The band is comfortable and the little bands that keep the tail of the main band in place locks into the holes making them a stay in place easierCons. Does not tracks steps correctly. This watch has to be moving to track. Pushing a shopping carts for 3 hours. Galsxy watch 3000 steps this watch 100 steps. Push mowing 3 acres. Galaxy watch. 9872. This watch 1590. Any time your wrist is not swinging like you are walking. It does not track. It will not even track if I am holding my wifes hand with the arm that the watch is on. Doesnt track. I do not recommend this watch. Not accurate","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"It stopped answering the phone","reviewDescription":"Watch was good for a while.Pedometer feature seemed accurate. But it never gave me the correct temperature outside and it stopped answering the phone when it rang.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Wonderful watch while it lasted","reviewDescription":"My husband told me to pick out the watch I wanted for Christmas, so I after reading all reviews, I chose this one. It arrived the week before Christmas and he let me have it early, to track my health. I absolutely loved this watch!!!! The charge on the battery was wonderful, only needing to charge about every 5 days. I wore it ALL the time, only took off to wash dishes and shower. However one day last week, it just would not turn on, charge, anything. I'm not sure what happened, but it only survived three months before going out. I would have rated it 5\/5 until this happened. Now it only gets a 2\/5, because a watch should last longer than 3 months before needing replaced.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Watch stops working after several months -  cannot return after 30 days.","reviewDescription":"Purchased 12\/2023 , stopped working April 2024 . Could not return  after 30 days.  Unable to reach seller for communication .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Worthless after last update","reviewDescription":"Loved it.  Worked great until last update.  Now it won't hold charge 5 minutes.  I turned off all monitoring, dimmed the display and about everything else I could and the longest charge has been 20 minutes since the update.  I was getting at least a week or more from a full battery.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Definitely returning","reviewDescription":"Subpar UI, annoying buzzing\/vibration, stuck on military time. Annoying chemicla like smell when opening out box","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"i was expecting the minimum, calories and steps","reviewDescription":"so i bought this as a gift. he wore it to the gym, and did 2 hours of cardio and weights, and it only counted 46 calories. then a whole day walking around and it counted 120 steps.  Here i am trying to return it, and it has been imposible, they are charging me more  for the return than the actual watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Notifications don't work w\/ Pixel","reviewDescription":"I tried to love this watch but the main reason I bought it was to get message and phone notifications on it. I gave it every permission I could find on my phone regarding messaging, push notifications, background running, etc. to no avail. Messaging and contacts just won't connect and notifications don't happen.As just a fitness watch it does fine, but that's not why I bought it. So I am returning it and will just save up to buy a Pixel watch maybe.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Barato, mala tecnología","reviewDescription":"Tecnología muy mala","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Not the best","reviewDescription":"Price was good but it didn’t change the time easily and you cant say i like it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Good looks but not durable and not long lasting","reviewDescription":"After just a week after the return period (30 days) expired, the watch is not showing the display or displays it intermittently so you really can't get the info you need when you need it.You get what you paid for, 2 stars for the look-alike but not durable and can't be counted on to last more than a few weeks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Nice watch if it worked!","reviewDescription":"I had the watch for about 3 days and it quit working. The screen went blank after charging, I never got it to work again. I proceeded to return the watch. I could not return the watch to the seller, I had to go through Amazon. I've been dealing with Amazon since day 1, and never had a problem with them. If I had an issue, it was taken care of. I requested an UPS pick-up on Aug 25. The package has not been picked up as yet. I have contacted Amazon twice now, with being informed they will put in a request for pick up. I'm very dissapointed with Amazon about this issue. I hope this isn't the future of how Amazon is going to handle customer service.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Works","reviewDescription":"Pros....It works and is okay quality.Cons.....Not even close to being accurate. Wrist\/motion activation was horrible for me.Step counts were less than reliable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"You Get What You Pay For","reviewDescription":"I didn't expect much out of this watch based on the price. But continued to turn off. This was especially annoying when trying to use the \"Stop Watch\" to time my rest between sets. Screen would go black in 2 seconds, then when I woke it back up it defaulted to the clock face. So basically worthless. That was one out of 10 issues but you get the point. RETURNED","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Reloj digital","reviewDescription":"Lo devolví","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Uncomfortable.","reviewDescription":"I wore for a couple days and my wrist was bruised I had not had on to tight or anything odd. It just rubbed on my wrist bone that made it so tender to touch I had to remove watch and Planned on returning. I also could never get my contacts uploaded to it. Never did figure out what I was doing wrong.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Problems with the software","reviewDescription":"It turn on ok but after a few hours it send an error that it is overheated and it couldn’t displays the hour not recommended","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Watch burn","reviewDescription":"I love the features on this watch however, after wearing it for 11 days for 11 hour days the watch gave me a burn. I had to go to the doctor and get antibiotics as well as a steroid cream. I do not recommend this watch it. The doctor was unsure whether the lithium battery caused a burn or the  watch as a wholeDo not buy this watch","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Function Inaccurate","reviewDescription":"The issue is that the Step Counter is completely off. It shows that you walk way less steps than you actually have... Incorrect. Not accurate at all, makes Me wonder about all the other functions. Heart rate, blood oxygen,. Are they accurate? I don't know. It does not. I am giving it 1 star due to the reasons I mentioned because I couldn’t give less than 1 star.Don’t waste your time and money for this bad product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"NOT ACCURATE","reviewDescription":"i got this watch mainly for steps and heart rate, i got it today, i had it on all day, almost 10 hours  but i noticed it was stuck at 800 steps for a full day despite running errands and a work out. even when i would re sync it, nothing was getting this watch to work properly, definitely pay a little more for a better quality watch.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Battery will notcharge","reviewDescription":"I Bought this watch is September 2023. It worked fine until March of 2024.  The watch will not charge it will charge to 25%  and then go bak to 0  and the watch will get extremely hot.  Can not use this and can not return it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Will not sync","reviewDescription":"Keeps good time. Tracks steps and send to phone. It will monitor heartrate beats per min etc. Dislike that it will not sync contacts, can not text, answer nor make calls due to this. Phone carrier, and 3 family members have tried to sync. None were successfully. For the price it's not a big deal.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Not worth it","reviewDescription":"Watch came as if it was used and returned by another customer. Button is defective and doesn’t wake up the watch. When you just want to look at time or anything on screen there is no reliable way to see the information on screen. Sometimes it works, most of the time it doesn’t","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Decent for the price","reviewDescription":"Definitely worth the price but if you are expecting a branded watch with tons of features this isn't the one for you. You can receive texts but you CANNOT answer them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Awesome","reviewDescription":"I think I paid$25 for this smartwatch and it is the best thing I have ever bought as far as phone devices go. It does all the things my phone does. I feel like Get Smart when I answer my phone on my watch. Younger kids probably don't even know who that is but some of you will. I really have nothing bad to say about it my friends that have paid hundreds for theirs or jealous because mine seems to do more than theirs. I have no complaints so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Great value","reviewDescription":"Watch appearance is good, notifications are great and accurate. Watch is comfortable and syncs with my android well. Recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Calidad-Precio","reviewDescription":"No hay nada malo en el, por este precio no podrás obtener un mejor Smart Watch.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Smart watch","reviewDescription":"Bought this for my husband. He loves it!! Works great with his phone . Great price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Works well.","reviewDescription":"I have had no problems so far, it works as advertised. Would highly recommend it's purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Works great","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Awesome heartrate tracking","reviewDescription":"I bought this for my daughter's walking class. She can't do class without it!  It records accurately plus has great exercise options. It feels weightless and she has been very happy. And you can make calls!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Smart Watch","reviewDescription":"Order came in good tme, watces are great for tracking steps each day. Also great for getting your attention when you can't hear your phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Muy bueno","reviewDescription":"Muy satisfecha cumple con todo mis requisitos","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Like the watch but","reviewDescription":"I love the watch itself but wish there was a way to buy an extra charging cord","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Very inaccurate","reviewDescription":"This watch keeps time and nothing else. The step counter froze! The heart beat rate was wrong. Returning.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Corrección.","reviewDescription":"Tiene mucha informacion. Uno de los 2 que compré se dañó parece que no es IP a prueba de agua ,  la bateria tiene buena autonomia","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Not good","reviewDescription":"Not impressed with the product. I struggle with connecting it to my phone, I thought i could learn to operate it but it is very complicated.  wish I could replace it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Junk","reviewDescription":"Stopped working after a couple day absolutely junk watch","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Not up to expect","reviewDescription":"Watch looks nice but some functions didn’t work as they should. Also don’t like how many functions you have to do through app instead of on watch. Retuned item","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Poor quality","reviewDescription":"This watch looks nice but does not always sync. It's a pain to have to connect it all the time. Didn't like the yearly cost for fitbit but at least it worked all the time. I  know I can do fitbit without the premium so may go back to that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Watch","reviewDescription":"The way how it feels and looks an my wrist.,however the watch doesn't keep charge, it cannot last for 3 hours without going dead.Also the watch stop working after 2 months. Try to turn it on nothing even when I charge it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"It isn't user friendly","reviewDescription":"It doesn't stay on even a second so you can look at anything. It doesn't let you scroll very well or look at the different settings.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Don't work","reviewDescription":"This watch will not pair with my phone. It keeps disconnecting","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"I love it, just don’t receive texts","reviewDescription":"I have an IPhone and after setting everything up, I am able to receive phone calls but not text messages on any platform.It does everything else as advertised and I do think it is worth buying if you don’t care about the messaging service that may or may not work. I am still learning new things about it just after 2 weeks of use. Hopefully I will be able to figure out my messaging issues.The battery life stand-by is awesome and I didn’t have to charge it for 4 days during use. All in all, a very good watch in my experience.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Good Product for the Price","reviewDescription":"I have had this watch for almost 2 months now, here is what I think:PROS:- Good for step counting- Sleep tracking works OK- Sound works OK- The two strap loops keeps the watch band secureCONS:- The weather forecast is absolute GARBAGE- The voice assistant doesn't work without a sim- The watch doesn't update unless you go into the appOverall I give this a 3.5 stars","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"It works","reviewDescription":"Frustrating at first, because watch wasn't syncing with Android and was thinking of returning item. After few days of wearing the watch... It works fine. I just wanted a watch I could wear at work and when I'm out power walking. You just glance at ur text\/ calls with out having to fumble for your cell.  I don't need all the other functions.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Good value","reviewDescription":"I am happy with this watch. I am lousy with tech so I was happy to find it easy to set up. The heartbeat,  blood oxygen sensor, steps etc are pretty accurate. In addition there are numerous functions and watch faces.My only beef is that the watch face comes on intermittently when raising the wrist, which was mentioned by other reviewers. If it were not for that I would have given 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Great for the price","reviewDescription":"I mostly wanted this for notifications, step tracking and sleep tracking.The notifications do not work the best admittedly.Love the step and sleep tracking.Also purchased this particular model because of the multiple watch faces available and I am pleased with them.I didn't know if I would like how large the watch face is but I do love it!For the price this is a terrific smartwatch!  I'm very happy with it.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Buen Producto","reviewDescription":"Buen producto, aunque me hubiera gustado que dure un poco mas la batería. Pero se puede recibir y hacer llamadas y funciona bien. El precio me pareció justo.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Recommended for like me not willing to spend too much for smart watch","reviewDescription":"I recently started to feel that I wanted a smart watch but didn’t want to spend too much like $400. As a smart watch beginner, this does not have a many functions but Great price and does work as nice digital watch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Better than expected","reviewDescription":"I didn't need anything fancy. Works well. App won't let you see individual days, so if you don't write it down its lost, and the band makes my wrist stink, but otherwise I like it. I got what I paid for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Good for the price","reviewDescription":"Not sure about the accuracy of step count, but it's a decent tracker for the money. Face is larger than my wrist, and caused my wrist to get a rash. Would recommend it though","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Nice little smart watch","reviewDescription":"Seems to have a Lot of features for such an inexpensive watch. Can get stats on iPhone with app that came with phone. Fun to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Great","reviewDescription":"Battery lasts forever","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Definitely worth the money","reviewDescription":"Great smart watch can't complian at all.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Very nice watch","reviewDescription":"I absolutely love this watch ❤️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"All this is new to me I love the watch and date feature.","reviewDescription":"I decided to buy the watch for my safety in case I fall again , you can’t beat the price and so far no disappointment!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Reliable, affordable smart watch","reviewDescription":"Watch works well, looks great and is comfortable to wear! Easy to set up and use. Worth the price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Muy practico","reviewDescription":"Si resiste al agua","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"That it was very hard to hook up for senior citizens","reviewDescription":"I love it after I got help from Amazon to connect it , but the accuracy of the heart,the instructions are so complicated for people who don't understand electronics,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Wristwatch","reviewDescription":"This watch is very effective, it is very useful to me and it is very similar to the Apple one. I would buy it again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Best watch","reviewDescription":"Very reliable and is very best for me. I highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Great watch!","reviewDescription":"I got it for my wife and she just loves it, it can do almost anything she wants without any problems! I plan on getting one for myself plus my son and  daughter in law","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"You get what you pay for","reviewDescription":"It's an ok product. It's not accurate. I walked from my bedroom, to the bathroom, to the living room, to the kitchen and it counted 0 steps.It uses the app GloryFit which isn't compatible with my work insurance incentive apps.It can't tell when I'm sleeping. It has a space to record hours slept, deep sleep, light sleep but mine is always at 0.It looks nice, the texting and call feature work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"Charger quit  just stuck with. A dead watch.","reviewDescription":"I purchased this watch loved it for 2 months then charger quit working now I have a dead smart watch I can't use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Good Functionality But No Email Notifications","reviewDescription":"Update: I don not believe the heart rate or steps is accurate.This is a good watch so far, and very comfortable. It was probably my mistake that I thought it sent notifications for email also. I did get it to show texts and phone calls. Very good display. Manual is very hard to read. I've only been wearing it a few days, so not sure about its durability. Seems like a good watch for the price. I have never had a smart watch before so I wanted to get an inexpensive one to see if I like it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Frustrated","reviewDescription":"The instruction booklet have printing so tiny that even with a magnifying glass I could not figure out the directions. I misplaced the charger and don't know if I can reorder one please let me know if I can","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Settings","reviewDescription":"I cannot set time of day or duration on or be sure it is on Bluetooth thinking about returning itPeter.Embree","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Not great quality","reviewDescription":"Watch rarely comes to life when you raise your wrist but it does like to come on a lot while I'm trying to sleep.  Heart rate monitor often inaccurate sometimes showing over 180 BPM - the picture is from yesterday when I did not do that much activity.  The oxygen sensor has only given results once.  Sleep tracking regularly shows a longer times than my actual sleep.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"This isn't waterproof.","reviewDescription":"I spent almost half an hour yesterday walking in the rain, and now it won't turn on. There's no point in returning it, it won't work. I would just like another one and not go out in the rain with it.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"I COULD NOT DOWNLOAD AN APP FOR THIS WATCH.","reviewDescription":"I DID NOT LIKE ANYTHING ABOUT THIS WATCH.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Not impressed","reviewDescription":"Not impressed  👎Heart monitor,  sleep tracker,  oxygen. Doesn't really work correctly. Gives totally different heart\/oxygen rate than at doctors.  Sleep, shows I am getting deep sleep when wide awake.Doesn't connect to my text message (Android)Android app constantly has errors and ended up just deleting so can't receive calls.What I use it for: I like the steps, time, stop watch feature they are accurate.Would I buy again... No.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Not great","reviewDescription":"Phone app is junk, the settings will change on their own, one day you can answer calls on the watch, the next day it won't, no idea why.  The text and email notifications are too small to read, and the font looks like an old dot matrix printer from the 80s.  Just buy a Samsung watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Just okay","reviewDescription":"It doesn’t track your steps in exercise mode, so I never meet my step goal if I use that feature.Exercise mode also pauses randomly, so it doesn’t capture the full workout half the time.Sleep mode doesn’t always work.On the plus side, heart rate and steps do seem to be fairly accurate (as long as you aren’t in exercise mode).  It is also easy to set up and use.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Waterproof it says","reviewDescription":"Definitely not waterproof.Barely was even in the water not deep very shallow not submerged for a long or for a long time and it died. Cannot see screen anymore turns on can tell it's on but screen no longer works","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Stopped working after 4 months","reviewDescription":"I love the design and would buy it again but the screen stopped working after 4 months and battery life was not as long as other brands I had and it does not have a flash light built in like some other brands do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Junk not worth the money!","reviewDescription":"Junk","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Basic tracker","reviewDescription":"This is not my favorite watch. I will be returning it.It does the job and tracks basic things as pictured. It tracks sleep and heart rate. However it doesn't have a place for you to track other metrics like blood sugar, blood pressure, 1 lead ekg, weight, a break down on what your heart rate means, or even sleep for that matter.The cool thing is that is has the option for a lot of different kinds of activities to track. That doesn't outweighs what it's lacking though. Even though it doesn't have the ability to measure some things, I do think you should have a place to record. I also think it should track long term. More than 7 days.Fits great, charges quickly and lasts a long time.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"Doesn't seem to connect with messages","reviewDescription":"Seems to not always show when text messages come through and you can't be too far away from your phone either, when they do come through.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Watch is great. Band broke. Now hard to get help from seller & Amazon.","reviewDescription":"My sweet husband bought me this. I am happy with my first smart watch. Easy and super convenient to use. Helped me with my health too. I am very hard on my things. There are a few scratches around outside of watch shell. The face is protected with screen protector. But wristband  broke 6 months into use. Now it is hard to get Amazon or the seller Huruo-US to tell me how to replace the wrist band.  My husband bought a protection plan through Asurion. We will see if it is covered with the plan or if they only cover electronic features.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Alittle disappointed","reviewDescription":"The watch is alittle disappointing.It is not staying synced with the phone, it didn't update with time change so I was late for work..the feature for it to wake up when I rotate my wrist is also not working. I've only worn it a week or 2 I'm kind of bummed 😕","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Inconvenientes","reviewDescription":"Ya comencé a utilizarlo.Es un Relog de fácil manejo, sin complicaciones.  Sin embargo  se me ha presentado que se me desconecta  mucho a través del bluetooth entre mi iPhone y el reloj, tengo que estar reiniciando el reloj para que se me active las notificaciones. Alguien que ha adquirido este reloj, le ha pasado lo mismo?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Great features, so uncomfortable and heavy","reviewDescription":"I love the features of this watch and the pink color.  I wish it also had temperature monitoring.  If it wasn’t so heavy and uncomfortable, it would be amazing!  I’m going to try to get used to the size and weight because the features work well and are very convenient for the price.  I wish it detailed REM sleep, not just deep sleep.  Overall, it seems to have most features anyone would want… please add temperature, REM, and make it less bulky\/heavy.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Looks nice","reviewDescription":"Looks nice and works.  I do question the reliability in step tracking","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Good Quality","reviewDescription":"Watch was a good quality for the price, but I wished it received more notifications from apps that were on my phone.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Great quality for price","reviewDescription":"Great quality for price. Stylish and functional","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Exceed my expectations","reviewDescription":"The watch is very good for the price. I love the way it fit and it is has a light weight","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Not bad.. Not great","reviewDescription":"The watch would have been 5 stars for price. The battery life (new) lasted a week and a half before I finally charged it.The bracelet attachment broke after a month-ish of having it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Big","reviewDescription":"Too big fur my wrist","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"linda pantalla y comodo","reviewDescription":"por ahora no he tenido problemas .Me resulta facil y estoy saisfecha con mi compra","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Good deal for price","reviewDescription":"It seems to have connected seamlessly with my phone so im pleased.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Easy to setup","reviewDescription":"Work great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"This is amazing watch","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Handy","reviewDescription":"All works but the sleep mode. But love everything else.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Must be patient.","reviewDescription":"Updating my review here. It worked with my android but took patience. After the 4 time trying i finally got a code \/instructions for android. Thars why i only give it 4 stars.Took 4 tries to get it to pair. It finally did and I am pleased with the result.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Good value for the money, however ...","reviewDescription":"Good value for the money. However the location detection most of the time does not work properly and give wrong weather forecast on a location totally different from the true location.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Nice","reviewDescription":"Good watch , it is little big","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Love color","reviewDescription":"Love all the functions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Very simple","reviewDescription":"The watch itself is basic, but it didn't lie to me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Nice watch!!!","reviewDescription":"Fits my hand perfectly. Good features for the price. Excellent battery life! I only found one problem with the watch. It plays sounds\/media from my phone even when I disable the function. Might be a software issue with the app.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Good battery","reviewDescription":"Wish it a a glucose monitor but battery life is great lasts almost a week,my last one lasted only 2 days..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Very good","reviewDescription":"Nothing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Watch","reviewDescription":"I like the watch.  But, I  can't  set the time...","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Failed after 4 months","reviewDescription":"Watch worked great for my mother, but went dead and would not stay on for more than a minute after 4 months. Tried a different charger from another watch just a different color but had the same results. Due to a quickly upcoming trip and her long learning curve on technology I had to order another, but I hope this one lasts longer or we’ll for sure have to get from a different company.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"No realiza llamadas","reviewDescription":"El reloj no realiza llamadas ni las recibe. Solo muestra el teclado y ya, Es un fiazgo","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Stopped working after a while","reviewDescription":"After around 2 weeks or so of use, the watch started flickering and stopped responding when I tapped or swiped. I recently went into a lake and I thought it was just the water making it hard to swipe, but it’s been fine underwater before. When it was working it was a good product, but I’d suggest steering clear of water just to be safe","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Don’t get if you have an iPhone and want to call and text","reviewDescription":"It’s a watch that has a few extra things. I can’t text since it won’t show my iMessages and I can’t even call or answer calls on it. I can’t complain since it was $30 but I really miss my Apple Watch. Most of the time find my phone doesn’t even work unless my phone is unlocked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"No messages","reviewDescription":"The watch itself looks as it was advertised. It keeps time well. Other than that I am not pleased. For a few days it worked well. After that all my messages started coming over the same. So every time my notifications went off on my phone. The watch would vibrate with a message from a completely different sender. And that same message showed each time no matter who the sender was. Now it’s just a blank screen when messages come across. I think I received a bad one. And I wasn’t expecting greatness from the price. I have only had this watch for a week.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Short Life","reviewDescription":"Daughter loved the watch and it worked great for 3 months until things started to break. Screen will freeze, will not always take a charge and the band broke and it’s now unusable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Poor Quality","reviewDescription":"Lasted less than 4 months, don’t buy it.  It’s also not waterproof","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Quit within 1st Month of purchase","reviewDescription":"I don't recommend this watch as it quit within 30 days of purchase.I liked this watch very much. It provided me with everything that I wanted: heart rate, oxygen levels, sleep... And physical activity's. I was 100% satisfied with the up-to-date 24hr information the watch provided on these thing's.I never set up & used the txt, phone calls, or anything else on this watch as I wasn't interested in any of those things.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Disappointed","reviewDescription":"I really wanted to love this watch. I ordered the first time and the watch worked great until it didn’t. It randomly stopped counting the steps. I figured it was defective so I returned it and got a replacement. Here I am only 10 days later with the same exact issue. I threw away the box so unfortunately cannot return this watch. I am super bummed because I loved everything else.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Cheap quality","reviewDescription":"I disliked the product, too weak too cheapskate","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Defective screen after 2.  months","reviewDescription":"This product was good for 2 months only. The Lcd\/screen display had lines or spots at the beginning of 2 months.I would not recommend this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Just horrible!","reviewDescription":"Well, how does it go. You get what u pay for. But in this case, even less. I wanted to keep watch from answering the phone cause it would be through the watch. Their suggestion, shut off watch to save power also. Does that even make sense? Whats the point of having this if you have to keep it off. Not an intelligent answer. Yes message notification, but cant reply. Again, whats the point. Their are watches half the price with the same \"features\". Just sucked it up and baught a galaxy watch.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Malo","reviewDescription":"No se conecta al Bluetooth, se le daño el botón de encender","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"underwhelming","reviewDescription":"Due to the app constantly crashing and requiring the smartwatch to be re-paired via bluetooth thru the phone app, the only thing this watch ended up being useful for was counting my steps.  After about a month i stopped using it.The one thing i found impressive was the battery life and how quickly it charged.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"I can’t receive message notifications","reviewDescription":"I am a little frustrated with This device. It came 4 days late. I connect it to my Bluetooth I’m receiving calls and is able to make calls everything works except for my message notifications. Can someone help me and tell me what I am doing wrong please ! However everything seems to be great. I was able to see my progress at the end of my work out","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Watch is not working right.","reviewDescription":"The watch is not working right. Can not get the correct time. Will not get off of military time. Can not get the right day. Does not send notifications from the phone. Cannot get the weather on the watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Worked for a year","reviewDescription":"Worked for a year and now it overheats and battery dies. The sensors on the back of the watch actually got hot enough that it burned my skin.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"I can’t get the sleep part to work","reviewDescription":"I received this watch today. Everything is working except the sleep part. I’ve tried everything so, i might return","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"producto equivalente a su precio","reviewDescription":"Un producto barato que sirve pero tiene la calidad de acuerdo a su precio. La tipografia de las notificaciones es muy mala por ejemplo","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"App doesn't work","reviewDescription":"I got this watch to tell time so it's not too bad but the watch can't get messenger notifications and will only load 2 out of about 30 contacts to add to the watch. Also the custom watch faces refuse to load on to the watch from the phone. It's annoying. Also the app continually shows a notification about steps on your phone which is annoying for someone who hates notifications.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Easy to use","reviewDescription":"Full of good information. Easy to set up. Wear tight around your wrist to pick up exercise. Make sure back is clean if it’s not picking up exercise. I recommend this over the other more expensive exercise trackers","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"IT HOLDS  FOR A LONG TIME.","reviewDescription":"I BOUGHT THIS AS A WATCH HAD TO HAVE MY DAUGHTE-IN-LAW SET IT UP ON MY PHONE BECAUSE I WASN'T SMART ENOUGH. It quit when I went to charge it and just quit. I liked it so I had it just had it replaced with another one. I set it up and it works just fine. This\\watch is synced with me SAMON  cell phone and works fine GREAT PEOPLE","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Love","reviewDescription":"I love love love these watches I’ve ordered 3 total so far","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Love it!","reviewDescription":"Perfect size, super easy to use and program, comfortable, super cute! Excellent in relation to the price. Recommended 100!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Good","reviewDescription":"Very good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Worth buying","reviewDescription":"Liked the look and its accurate reports. It’s easy to handle and long battery life. Most importantly fair price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Smart watch","reviewDescription":"So far everything is good. Battery life is good. For the price, I highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"NICE!!!","reviewDescription":"Pretty hod watch for the price. I love the on watch phone feature, it was easy to setup too! I'd buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"smart watch","reviewDescription":"Nice watch, but having a problem setting it up. My fault because I am old...lol","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Best purchase ever","reviewDescription":"I love my watch, helping me with my sleeping habits and cardiovascular health","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Stopped working","reviewDescription":"It no longer works after only 4 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Can't wear it","reviewDescription":"Laser gives my wrists little red dots where the laser sits that are incredibly sore. Almost like an acne bump. I've tried wearing it really loose and cleaning it every day\/every other day but to no avail. I don't have sensitive skin either so idk why this happens. It also keeps disconnecting and reconnecting to my phone every millisecond regardless if I do anything the \"troubleshooting\" guide says to do. Would return it if I could but it's out of the 30 refund policy thing. So there goes my 20 bucks down the drain.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Step counter just doesnt work","reviewDescription":"I really wanted this watch to work out, but it just wont. The step counter doesnt work. I thought maybe I got a defective one, so ordered a replacement and the same issue. Returning and looking for a better option where the features work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Don’t waste your money!","reviewDescription":"I’ve had this watch for one week. It doesn’t track you accordingly. Steps, heart rate, exercise, all incorrect. You can’t have a consistent BPM and burn 2 kcal in 30 minutes. Plus, steps are WAY off.Another example is a HIIT workout. 33 minutes, 94 kcal. My watch reads that I have burned 11.3 kcal. The tracking is extremely inaccurate.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Sending this back ASAP.","reviewDescription":"This watch is garbage. The QR code takes you to a page that does not work. Bought this for my boyfriend after convincing him he'd love a smart watch for working out and stuff, and now I'm extremely disappointed because I feel like I was scammed. Do not buy this watch. It's not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Nice looking watch","reviewDescription":"It was a great looking watch till I had to update it and after it updated I got a code in it that stated I needed to reset it and when I tryed to reset the stupid thing it never would reset itself and it happened right after my return was up so I wouldn’t buy it ever again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Quit working after 1 week","reviewDescription":"But this $30 watch thinking it has all the features of a $200+ Fitbit. Looked good, nice app, but intermittently would stop counting steps. And just a little while ago a full screen of cryptic text appears and I can't get rid of the text or turn it off. Not worth the hassle, just bought a Fitbit to replace it. I Should have known better, you get what you pay for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"RETURNED","reviewDescription":"Wouldn't recognize the sim card.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Not working for me","reviewDescription":"I could not get this watch to connect to the app that makes it work, I will be making a return tomorrow morning it should have an easy task but it was not","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Not worth the headache","reviewDescription":"Lot of headaches to connect.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Nice Watch","reviewDescription":"I like the fact that the watch came with detailed instructions (that were written in correct English) on how to set up and use it.I also like the many features that it has and the fact that it is user friendly.Battery life is very good also.This is my second purchase of this watch (I bought the first one as a gift for my girlfriend). She likes hers very much too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Simple set, more functional than other smart watches","reviewDescription":"My wife and I had top of the line smart watches, which were paired to our phones. When we traded in our watches for new versions no one could pair our watches to the new phones. Bought this smart watch for my wife. Very attractive, just as attractive as her previous watch. So simple to set up. More functions than her previous watch that cost many of hundred dollars more. My wife learned to use all the functions after a few days. Buying another watch for myself.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Me encantó este producto lo recomiendo mucho.","reviewDescription":"Este es un bonito reloj muy practico. Mide la frecuencia cardiaca es preciso pero puede emitir alertas cuando hay medidas altas. !Es realmente! También mide la oxigenacion, hace seguimiento del sueño,  cuenta los pasos es muy útil para hacer ejercicio, la duración de la batería es excelente.  Recibo mensajes para ver pero no puedo responder en el reloj.  El audio suena muy bien y fuerte.  También puedes personalizar la imagen de la cara.  ¡Funciona muy bien para lo que lo necesito!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Stopped functioning, but a Factory Reset solved the issue.","reviewDescription":"*updated* - after several weeks of frustration, we found the factory reset option in the settings. A hard reset seems to have solved the glitches for now.I bought this in mid-January it currently will randomly turn off after being fully charged and need another full charge. It also no longer vibrates for alarms or messages. Either I got a lemon or they are all like this. At this point, it's just a pretty watch that records my steps. I'm bummed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Great watch for the price!","reviewDescription":"I chose this because of other reviews and they were spot on. It's been 6 days and the battery is still at 56%. It has all the features I need: alarm, HR, O2, exercise tracking, calls, texts, weather. I'm 50-something\/less tech savvy, so it took a beat to figure out how to customize everything, but I got the hang of it! I love the many different watch face options. Great list of exercises to customize your top go-to's. Love it so much I bought one for my daughter!","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Good Quality at an Affordable Price!","reviewDescription":"THE WATCH IS EXCELLENT!  Arrived on time. The box was not damaged. I like the color and the Smart Watch is comfortable.  The price is great because it's a high-quality product. The watch size is correct because I can see the numbers without my glasses. I hesitated to purchase the watch, but I'm glad I did. I also bought one for my friend, and she loves it. The battery last around three days. I receive text messages and calls. This is important because I don't need to grab my cell phone when I am at work. I noticed that I am more inspired to walk because I can see the steps that I have walked and the calories that I have burned.Activating the SmartWatch was easy and I can also change the main screen because it has different choices.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Smart watch","reviewDescription":"This watch is great for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Health Companion","reviewDescription":"I walk about 2 miles daily. I also walk from one location to another but had no way of keeping track of the number of steps that I usually make. A friend of mine suggested acquiring a smart watch. I went to Amazon and there were turns of them to choose from. After an exhaustive search, I ended up with this one. I soon realized that I could make and answer calls, in addition to the step counting. More importantly, it reads my heart rate, measures my blood oxygen, and even alerts me when I sit down for too long. And so, I get up to move around. The other thing that this watch does is to tell me how long I slept through the night and what proportion of it was deep sleep and light sleep. This little piece of equipment is indeed my health companion. I encourage you to give it a try, it might help you improve your sleep as it has done me.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Watch","reviewDescription":"Very convenient.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Definitely worth it! 10 out of 10","reviewDescription":"I got this on sale for about $24.99 and let me tell you this is amazing for the price. Yo YOU CAN ACTUALLY SPEAK THROUGH THE WATCH WHEN YOUR ON THE PHONE!!! I just thought you could only see who's calling but no. You can dial, pick up and dismiss calls. Overall I'm satisfied with my purchase, until then God bless and keep up the Great work. 🙌🏿😤😎🔥","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Just OK and Needs a lot of \"permission\"","reviewDescription":"I still can't seem to find this permission the watch is asking for. I have given it access to everything but my social security number and it's only okay. It sometimes doesn't work as I sleep. It says it monitors your sleep and it says I NEVER hit REM sleep and while I do sleep terribly this thing says I'm literally never asleep. But I have Obstructive Sleep Apnea and it says my heart rate is normal all night whem it does record me sleeping and so is my 02- which can't be right. I don't know how accurate this is.Additionally It will also say I've taken maybe a few hundred steps after going to Walmart Costco petsmart and grocery shopping. I once took my work iPhone and this along on my errands and the iPhone had me at 25300 steps this watch had me at less than my 8000 step goal but THE NEXT DAY it had me at 12000 steps for the previous day. SO again I don't think this is accurate or there is a lag so bad it misses some things? I do like that I can answer my phone and start and stop my music but that's about it. The messages never synced off my phone and there's this permission it's asked for that I SPENT HOURS LOOKING FOR... and I gave this thing every permission I could and it still says I missed something- I don't know why that bothers me so bad but I am NOT buying a brand new phone just so it works","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"I can see it outside, and the clock works","reviewDescription":"Nice bright screen, good battery life. Otherwise, it's fairly awful. The app is not intuitive, which is a shame, because the text is not well translated to English. Does not track my sleep at all, often loses connection to my phone (Pixel 8 Pro), sometimes stops tracking steps so I have to restart it. The good thing is, when it dies, I won't be out $350 for a fourth time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Worked for about 8 months","reviewDescription":"This watch worked fine for about 8 months, but then the side button stopped working, making it so that I can’t get the face to light up to show the time. Other features still work fine, but it makes the watch close to useless. I will have to try to find a better option for my next one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"How to use","reviewDescription":"Some what different from my other smart watch,still trying to learn functions","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Not all functions work","reviewDescription":"I have this watch for a few days. Overall, for the sale price it was not bad. I also have not used all the functions but will only rate those I used.The weather function only seems to update automatically once a day. Even completely opening the app will not cause an update, you have to actually push it. Not sure were it gets the reading from, but it not from the watch itself; however, it is fairly close.The locate the phone from the watch does not work at all. You can locate the watch from the phone, but using the watch to locate the phone does nothing but cause the watch to vibrate.I also used the heart rate. Close, but like anything like this don't count on it as a medical device.The phone function seems to work with only a slight delay.Battery life is about a week if not used a lot.The do not disturb function seems to turn itself off often in the app.For a good sale price, it will be worth it; but not for full price.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"As good as the price","reviewDescription":"Bought this item to replace my old smart watch. In general, its nicer. I like the size and the fit on my wrist. The audio when you receive a call is great, you can hear very clearly. The graphics look pretty neat too.I was however disappointed in the microphone. The person on the other end could barely here me. The fact that it does not automatically reconnect to the phone. I need to reconnect it myself each time. The battery runs out too fast, I feel that I am always charging. I couldn't find or use  any mobile messaging apps including Whatsapp, facebook and twitter.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"It is dead after 6 months","reviewDescription":"I used it well in another country. battery life is long. but screen is dead after using 6 months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Not a real fitness tracker","reviewDescription":"I bought this watch as my fitbit's battery is not holding a charge well, after almost a decade. So, I thought I'd try something less expensive. I made a mistake.Pros: the price is great, the watch faces are fine, it looks good, it does relay texts and phone callsCons: it doesn't track your sleep. I wore it to bed several nights, and it showed I slept 0 hours each night.It doesn't track your steps well. I took a walk I knew to be around 12K steps, and it showed less than 6K. So I wore two watches, this new one and my old fitbit, and compared the results. My fitbit showed I slept at least 5 hours, this watch 0, reach night. Fitbit showed more than twice as many steps every day. The heat beat detection was similar. And while my fitbit detects what activity or sport I'm engaged in, this watch has to  be told what I'm about to do.All in all, it's good at getting calls through, but is useless as a fitness or health tracker. The interface is meh, about what I expected for such a cheap watch.","isVerified":true,"ratingScore":3,"reviewReaction":"39 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"It's Ok","reviewDescription":"Getting to programs by touch screen a little tedious. It does do what it says it can eventually.  It's so big, it's too hot to wear in summer for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Watch works well, but!","reviewDescription":"The watch holds a charge for several days and choice of watch faces is nice. Step, sleep, and heart rate work well.However, I need to restart my phone each day in order to reconnect the Bluetooth to the watch. It consistently disconnects, which is very frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"It’s alright","reviewDescription":"It’s an okay watch for what it is. I don’t think it’s worth more than $15 though. Raise to hand screen turn on doesn’t work so I have to keep clicking the button, health functions aren’t working, music artists and titles aren’t displayed when music is playing, speaker is nearly under the watch so it effects the sound quality a bit with music and calls, and there aren’t many good themes to choose from but you can customize your own to some extent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Great at first but in the garbage now","reviewDescription":"Worked well until a month ago. Now won’t charge and the bands keep coming off. Thrown out. Didn’t even last a year","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Ok, but I don't feel that it is user friendly","reviewDescription":"I assume some user error bc I am tech challenged and this is my first smart watch fitness tracker. There are not any detailed user instructions. I can not use the music, call or text features. Charge only lasts 4 days. The fitness tracker seems to be working well. Not sure about the sleep tracker as it just takes the hours slept and makes about half of them light sleep and the other half deep sleep. I am unsure of the accuracy. I do like the appearance, shape and size of the watch. UPDATE: Watch not working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Not waterproof","reviewDescription":"It was a good watch but definately not waterproof. It died the first time it was in water 🙁","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Good watch and easy to hook up to iPhone and operate but did not last much longer than six months","reviewDescription":"Watch battery overheating ( high temperature) while laying on countertop while I rinsed offWas not on chargerAfter this it would never come on or except a charge againNot a real high priced item but I still expected longer life than this!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Can’t Text or take pics","reviewDescription":"So one of the main reasons I got the watch was to be able to text discreetly from it. It does not allow you to text or reply only allows u to see the text and the font looks cheap and pixelated.  Does not have any apps like the actual Apple Watch. It’s a decent watch for the price but there’s not too many options and the main drawback for me was the text looks cheap and you are unable to reply back via text. Does Not allow you to take pictures like the Apple Watch? But it is a really good looking watch. It looks just like the Apple Watch without the functions.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Bought it sept 29th, dead on oct 13th","reviewDescription":"Sadly, I had high hopes for this thing, when it worked it was fantastic. Never took it swimming, never used it in the shower, even though some on here said that was ok, but this thing died sadly a few weeks into using it. Would have loved it to work more & was great when it did work, tracked my sleep well, was good with steps, but just, dead. Not turning on, not working, I guess ya get what ya pay for in just 30 bucks.FYI: The customer service was A+ & I take my hat off to them. They contacted me & offered a full refund & were 100% helpful & amazing. Hope you guys see this update & you guys are the best. Truly an A+ company. cannot tell you how amazing it is for a company to contact me to do something so awesome.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Face doesn’t light up unless the venal is tapped.","reviewDescription":"The description said you just halve to lift your wrist. For me this watch doesn’t work. Also the date doesn’t show up on the initial screen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"It's not as accurate as I expected.","reviewDescription":"I don't know if it is damaged or not, but after a week I realized that it had a big difference in measurement with other measuring devices.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Too large.","reviewDescription":"The watch strap was soft and pliable but still too big for my wrist. If the watch face was a tiny bit smaller it would have worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Disappointment","reviewDescription":"Liked the watch initially but started to run in you issues after only having it a short while. Watch frequently came unlinked from bluetooth. Only text messages from a single person would come through to my watch; if it was a group text, messages did not come through to my watch. After having it only a month, the screen stopped working and could not get it to restart. Tried charging it to see if it would make a difference and didn't help. Couldn't find customer support to contact.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"4 months of use","reviewDescription":"I wanted to love this watch but unfortunately after 4 months of use the display screen is malfunctioning. Will not buy again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"It's no Fitbit","reviewDescription":"Cool features You can customize.  Menu is clear and easy to navigate.Setup was pretty simple.  But this doesn't count calories like my 2 previous Fitbits.  Gonna try it for a few days.  But probably returning.Gonna see if there's any way to correct calorie counter.... ****after a few days..  picks and chooses when it logs sleep.Barely waterproof, says so right in manual.  Look for other options if your budget allows.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Good watch, but...","reviewDescription":"I really like the fit and style of the watch but had issues with getting all of the features to work properly. I own a Google Pixel phone. I was never able to get text messages to display on my watch. Sometimes the audio from my phone would play on the watch as well as from phone's speaker. I've owned another watch that used to Glory Fit app, so I was hopeful that this watch would be a great purchase.It was a good watch but just not for me.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Steps Tracking Does Not Work!","reviewDescription":"I bought this watch so I could track my steps reliably without having to carry my phone everywhere, however it does not track steps accurately! I got up and walked several times to see if it worked and my iPhone logged over 400 steps while the watch logged 93. Super disappointed as this was the main reason for the purchase!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Great graphics...while it lasted","reviewDescription":"This watch has it all. Great graphics..accurate readings...an elegant big face...all at a low cost.The glowing statement above was posted soon after my purchase. But, after actually owning the watch for a few months...my satisfaction had seriously degraded. After about a month or so, I began to have difficulties recharging my watch and thereafter, the ability to recharge only deteriorated...until it no longer recharged at all. I was very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Not what I was hoping for.","reviewDescription":"The smartwatch would not retain the contact list and had to upload everyday.  The advertised software was not the same software I was instructed to use when I opened the package to sync my phone to.  I was also charging it every other day. Watch came almost 10 days late.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"No texts, scratched screen","reviewDescription":"Returned, came with a scratched screen and wore for 3 days only got notifications for text the first day.Pros: battery lasted the 3 days on one charge, lots of apps I just don’t know what the symbols signify.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Pretty decent","reviewDescription":"I like my watch but some of the functions don't work. I didn't expect much from a watch under $30. It does record BP sleep & steps. I wasn't able to transfer most of my contacts or use the message feature. Overall this watch is decent","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"Not compatible with all Apps, stopped working after a month.","reviewDescription":"Not compatible with all Apps, stopped working after a month. Does not track food\/calories which would be great. Does not automatically know when you are exercising; you have to choose your activity.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701216000000}
