{"reviewTitle":"It was great--for about an hour","reviewDescription":"Got this vac to replace a 20-year-old Dirt Devil that I use upstairs so I don't have to drag my big, heavy vac up and down the stairs.  It came over the weekend and I didn't have a chance to try it out until today. I have a greyhound and four cats, two of which are long haired.  It is quite maneuverable, relatively light weight--just what I need.  I was very impressed with its ability to pick up the animal hair.  My bedroom rug now looks terrific.  But as I moved into the hall to vacuum, I noticed it was no longer picking up the fur.  On closer examination I realized the brush bar was no longer turning...the belt has apparently snapped.  My rugs are not high pile and I had had no trouble pushing the vac.  I put the box out with the trash this morning, so I no longer have the box in which to return it.  I guess I'll order a new belt and see if I can put it in myself.  Meanwhile, other rooms upstairs continue to accumulate pet hair until I can get this thing back in working order.  I am very sad and disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"VERY cheap, NOT worth it.","reviewDescription":"I needed a replacement vacuum so badly (ours had been broken for more than week, and we have dogs), so I was so excited to get this new one after reading many positive reviews.  It was easy to assemble and the suction was good enough upon using it the first time - but unfortunately we found that if the very small container gets even 1\/4 full, large clumps of hair get caught and wrapped around the filter mechanism at the top, and there is absolutely no way to empty the cannister without having to reach inside and pry all of the dirt and hair out.  It's dirty, messy, and the dust is literally making me sick from being all over me each every time I need to clean\/vacuum.  I can't finish even half of a room without having to empty it 3 or 4 times - just to be sure I can dump the dirt out without touching it.  Hair gets wound around the brush very easily as well (although this I had expected), and after each use we have to cut\/pull it from the brush mechanism.  I absolutely dread vacuuming now - when in the past it was one of my favorite chores.  For such a great price and with so many good reviews I had a lot of hope for this one, but it is most definitely very low quality and not a good buy.  Do yourself a favor and get something else.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"YGreat vacuum, but my cord was sliced halfway through so i had to wrap it with electrical tape :(","reviewDescription":"This vacuum was great at first. I tried it, & loved it the first time. So I threw out the box & everything. The second time I went to use it, I noticed that at the top of the cord, it was sliced about half way through the cord where it came out of the vacuum near the top. I didn't try to return it since I had already got rid of the packaging. I wrapped it with electrical tape & it still gets the job done I guess. I never splurge on myself & I sucks that when I did, this happened. But I missed my 30 days to speak up & return it, which is my fault. Just beware I guess.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"It's loud","reviewDescription":"Even though we empty it out regularly and make sure nothing is blocked in the hose, wheels or canister it makes a high pitched sound when vacuuming and boy is it annoying. I have to wear my headphones.The suction works good though. I like the different levels to select the floor pile level. I didn't see a way to turn off the rotation brush. I assumed on hard floor setting that the brush would not rotate. Boy was I wrong. It ruined a brand new area rug on the hard floor setting because the beater lifted the pile in tufts.This is also not that lightweight.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"I got a good 4 months out of it until...","reviewDescription":"I was excited to get a new vacuum cleaner since I have 2 young kids who love to leave messes all over the house. I used it multiple times a week and the vacuum worked well initially, good suction, useful attachments, easy to maneuver, and lightweight. However after a few months, all of a sudden the vacuum would randomly cut on and off while in use and the suction wasn't nearly as strong. I've only had it 4 months and now I'm already in need of another. This is ridiculous! I definitely won't be purchasing this brand again!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"One of the worst vacuums I ever had...","reviewDescription":"I recently bought the EUREKA PowerSpeed Lightweight Powerful Upright Vacuum Cleaner, and I’m giving it 2 out of 5 stars. Unfortunately, it's one of the worst vacuums I've purchased. While it’s lightweight and easy to maneuver, the suction power is disappointing, and it struggles to pick up even basic dirt and debris.The build quality also feels flimsy, and I doubt it will hold up over time. It’s not completely useless, but it definitely doesn’t live up to its claims. I wouldn’t recommend it if you're looking for a reliable vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"Unwieldy","reviewDescription":"First, the suction is OKAY. Not great. The cord is decidedly too short. The housing is high, and that prohibits you from reaching under beds and low furniture. For a unit with average suction, it is quite heavy and difficult to maneuver. Had Eurekas before. Seems like they were better made.  This is a little too heavy to push around. Basic vacuum, no bells and whistles. I will keep it. I have used it. It does the job, just didn’t leave me smiling.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Not good","reviewDescription":"I purchased this vacuum because it was the #1 sold, but since I’ve gotten it, it’s not really doing a good job. I constantly have to go back over areas 3-4 times because it’s not picking up. It does this thing where after 10 min or so it coughs up what it just swept up and makes a fuzz\/hair ball. I’m not having a good time with this one, maybe I have a bad one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Its decent","reviewDescription":"This vaccum isn't as impressive as I'd hoped it to be , it doesn't have great suction it missed stuff when vacuuming the hose is short so really useless when needing to use extensions and the handle has an open hole at the top which looks funny and feels strange . I would pass on this unless it's the best you can do at the time","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Do you have pets?","reviewDescription":"Are you looking for a vacuum that will easily suck up all that fur? Something dependable with a strong suction, and doesn’t clog every time you use it?Then look for a different vacuum because this one isn’t it. The attachment with the brush for furniture barely works either, the best I can say is that my couch doesn’t look AS furry as it did before.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Not as advertised.","reviewDescription":"To heavy and big for light vac","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Basic cheap vacuum","reviewDescription":"I honestly don’t think this vacuum will last very long in our home. It’s made with VERY cheap parts! Not self propelling so you have to work to pull it back towards you when you are completing a row. The hose disconnects as your vacuuming which makes it impossible to work quickly. I do not recommend!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Huge disappointment vs their older model","reviewDescription":"I've had 2 of these in the past and was very happy with them.  That is why I bought another one.  Wow, that was a mistake.They have cheapened this up and sucked every cost cutting penny out of it.  The motor is FAR smaller than on the older one.  The old attachments don't fit on the new hose and the new ones aren't nearly as good.  They saved money by not including extention tubes and replacing them by offering the handle.  This doesn't work at all for close spaces.  It's bulky and very difficult to use.The new model blows around dog hair much more than the old model.  This makes it difficult to properly clean dog hair off hardwood floors.  The dust bin is large enough so that earned it one more start.Overall, DONT BUY THIS.  They've gone too far on cost cutting and it shows.  I am no longer a loyal customer.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"durability and replacement parts seem to be a problem","reviewDescription":"I purchased this vacuum (NEU280 series) in Feb. 2022. It worked very well until Early Nov. 2022 when the belt broke. I purchased a replacement belt, but could not find a Eureka belt or equivalent that would stretch enough to allow me to attach it properly. I am a seasoned vacuum belt replacer, and I was worried that using a leverage tool to help get the roller brush back in place would damage the belt pin. So I kept trying to install the belt with manual strength alone. I even purchased a different brand belt with the service manual's recommended part number on it. Then the brushroll broke. Ugh! I looked for a replacement brushroll, but Eureka does not stock them. So much for advertised \"newer model.\" I give up. Although I have always been very satisfied and confident in purchasing Eureka floor care products, I have purchased a new vacuum cleaner that is NOT a Eureka (and have purchased that brand replacement belts as a precaution.)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664928000000}
{"reviewTitle":"Buyer Beware! LIMITED warranty. Be ready to purchase, service & replace the belt every 5 months!","reviewDescription":"Most people who write reviews do so too soon. I've had this for less than 6 months and the belt snapped. When I contacted Eureka customer service they asked me a lot of questions and then asked me to take the unit apart and send them a picture of the belt! After 20 minutes of back and forth and taking the unit apart, the belt was indeed broken. Customer service pointed out that belts are NOT covered under warranty and should be replaced every 6 months! However even if your belt breaks the first day you use the thing it's YOUR responsibility to purchase extra belts and repair the unit yourself! DO NOT BE FOOLED by 1 year Limited Warranty like I was. I'd highly recommend SHARK vacuums instead of this brand.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"It didn't really do the job","reviewDescription":"When I was using it for the first (and only) time I was vacuuming up some small pieces from the medium-depth carpet. I was on the correct setting. The vacuum would repeatedly shoot out the same pieces of hair, dust bunny, small dusty particles onto the floor. So, no, $90 is not worth that to me. I need the materials to be sucked up and stay there. It is a very light vacuum and that is a very nice feature.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"Lasted less than a year","reviewDescription":"Worked fine for 9 months. Now there is a gap where the dirt chamber meets the tube so it spits out whatever it sucks in. No longer of use","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Honest review","reviewDescription":"I got this hoping to help the amount of bags I buy for my canister vacuum. Love that it is bagless however in the front of the vacuum it pushes air out so it's blowing things away before I can vacuum it. It does a great job picking up heavy things but dog hair just flies away before the vacuum can get to it. It's easy to clean and easy push. Don't know how durable it is because I just got it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Smoking","reviewDescription":"I’ve had this vacuum for a month. I read the views and the good seemed to out weigh the bad so I decided to go for it. Plus I wanted to find a cheaper vacuum that would work for my pet hair and this is how they advertise it right? Well I’d say it worked fine for the time being, nothing special, I didn’t notice any difference in how it picked up my dog hair though. Some would still be left behind. I did love how lightweight it was but the downfall of that was the cord was short so if I overextended it the whole vacuum came down. The reason I’m leaving this review though is that I’ve used this vacuum only a handful of times, I was just getting ready to use it today, dumped it out to make sure it would have good suction and turn it on, after a few minutes I smell a burning smell and then notice the bottom was smoking. So I shut it off and here I am.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661731200000}
{"reviewTitle":"Already Fizzeling Out","reviewDescription":"Thought this was going to be better and different than most. It is not. Clean and maintain it regularly and still the motor is getting very loud. Sounds like a jet engine with a whine. The suction too is lessening with each use. Disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"We Absolutely LOVE This Vacuum – Affordable and Effective!","reviewDescription":"My wife and I are thrilled with this vacuum! It works incredibly well, picking up dirt and debris with ease, and leaves our floors spotless every time. The suction power is impressive, and it’s lightweight enough to maneuver around the house without any hassle.The best part is how affordable it was—we couldn’t believe we found such a high-quality vacuum at this price point. It’s made cleaning so much easier and more efficient for both of us. If you’re looking for a reliable vacuum that won’t break the bank, this one is a fantastic choice!","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"This Vacuum Really Sucks!","reviewDescription":"We had a 20-yearold Eureka bagless that broke, and this was the nearest we found. Glad we did! It's a little larger than the broken one, but a bit less large, heavy and cumbersome than our old Hoover upright. And a lot lighter in weight! This one (somehow) came with the extra pet-hair mini roller brush, but I had to go look up the Bissell version on line to find out how to take it apart for cleaning the mini roller. Works the same, and the device is REALLY useful for getting into small places. We have a long-hair cat.With 8 amps, this thing really pulls up dirt! Seriously pulls up dirt! I set it to the low \"Carpet\" level, for an old shag carpet in the trailer house. I'm living here, but the owner's been here for a long time. I've been cleaning with that old Eureka, and it's (I thought) been pretty clean. I was getting a lot of fuzz, cat hair, and some fine dirt, but all in all, okay. Then I used this guy! Holy Cow!!The first pass after setting it up, there was almost an entire \"bucket\" container of something greyish-brown. Plus a lot of fuzz and a lot of cat hair. I asked the owner, who told me that many years ago, she'd had a flea problem and sprinkled diatomaceous earth all over. Fixed the fleas, but she never cleaned the carpets.Suddenly, I'm using this new Eureka and it's pulling EVERYthing out of the carpet! After only two times using it (back in April; it's now September), almost all that \"dust\" was gone. Now, I'm getting general dirt, cat hair, dust and carpet fuzz. Normal.1. After the first-time use, with the massive amount of \"newly discovered\" dirt, the roller bar was almost entirely clear! No wrapped hair or anything gunked up in the brush bristles. Amazing!2. Disassembling for cleaning, I found that the main vacuum body was almost entirely clean! No outer dust anywhere on the plastic. The only dust was at the connection hole between the body and the container bucket -- easy to clean with a swipe of a sponge or rag.3. Cleaning the container and filter was pretty simple, but a little bit of time involved.Cleaning:A push-button on the top handle releases the catch bin as a complete unit unto itself. There's another button near the bottom of that basin, which then releases a gravity-operated \"lid.\" BE SURE TO KEEP THE BOTTOM OF THE BUCKET WELL BELOW THE UPPER EDGE OF YOUR TRASH CONTAINER!By pushing the release button to open the bottom of the bucket, you're simply dropping out ALL the crud you've picked up in the catch basin! It comes flying out, dust-cloud and all! Still, there's some remaining junk clinging to the clear plastic bucket walls.I like \"BANG!\" cleaner spray, which is cheap (Dollar Tree), and works very well. I also have a spray attachment on the kitchen sink, which makes it very easy to get water inside the bucket \"tube.\" There's a plastic \"clasp\" or catch you pull on, to open the top of the overall basin. I'd imagine that catch will eventually break, but who knows.....none of the plastic on the 20-yearold ever broke.With the bottom open and the top hinged back, you can clean the entire catch basin. It's large enough (easily) that you can get your hand in there with a sponge. The BANG! makes it easier, and water rinses it all out.The entire filter section comes apart, which is why I bought this. You lift out the filter assembly (the instruction manual shows how), and there are several parts. The filter itself is foam with some sort of paper on top. It's there to prevent dust from blowing into the motor, and both the bottom (foam) and top (paper) got totally covered with dust. Being gentle with it, I was easily able to clean it under running water.I couldn't find these round filters anywhere in stores, so ordered a 6-pack of replacements on Amazon. Not all that expensive. I've used and cleaned this vacuum now probably 8 times (since April, it's now September), and the filter is still pretty together. I can see it's going to degrade, but if it lasts four months (or more), then I only need to replace it three times a year. Very cost effective. And this place has all the old micro dust along with the cat hair, so the filter has to get cleaned after each use. For \"normal people\" and their homes, I think you could use the cleaner several times without cleaning every single time.The attachments are all there, easily stored on the body of the machine. The hose attaches to the roller base during upright use, and comes loose to attach to the handle for portable use. DO follow the instruction manual! The places for the attachments, and how to connect the different hose operations aren't immediately obvious.Some people complain that the roller bar always turns. The old Eureka had a 2-way switch for upright (with roller bar), and portable (for smooth floors and portable use). This power switch only is On\/Off. I don't care. You can raise the level of the roller for \"wood floors,\" if it really makes you anxious.All in all, having sold vacuum cleaners in the past, I'd have to say this is one of the most powerful machines I've ever seen for its size, weight, and price! Yes, it's all plastic, to keep the weight around 8-10lbs or so, but today's plastics are pretty rugged. I'm thinking it'll last long enough to be a good investment.","isVerified":true,"ratingScore":5,"reviewReaction":"483 people found this helpful","country":"United States","date":1663286400000}
{"reviewTitle":"Great vacuum!","reviewDescription":"Just got this vacuum in the mail today. Super easy set up and works great! I just vacuumed my living room yesterday with my old vacuum and today with my new one. Look at how much this vacuum picked up that my old one missed! Absolutely impressed by this vacuum! Easy to use, suction is great, cord is long, easy to clean the container after use, very light weight.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Strong suction","reviewDescription":"This vacuum cleaner works well. I love everything about it. It has great suction and it is light and easy to clean with. The cord could be a bit longer but that is the only thing I would change. Changing from floor cleaning to utility is easy and so is emptying it. Very happy","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"It is light and perfect","reviewDescription":"This vacuum is exactly what I was looking for. It goes from floor to carpet with ease and has great suction. It is light and easy to move around… the long home and attachments make it easy to reach farther than just vacuuming. And they come in handy when cleaning the stairwell","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Wow!","reviewDescription":"I looked at lots of vacuums and read lots of reviews.  This Eureka PowerSpeed NEU 180 sounded good, with lots of great reviews.  I need something that will take care of pet hair (dog and a cat) and be simple to use and  empty, and not require replaceable filters.A lot of reviewers showed  how much hair the vac got up after using their old vacuum first.  They were not kidding!  I ran the Eureka over a short nap carpet about 15 x 15 feet, and the dust bin was nearly full of hair and dirt.  it had only been a couple of days since I vacuumed with my old Rainbow.  I am amazed!  This thing is light and easy to maneuver, gets under the toe space and under the edges of furniture easily.  It cleans right to the edge.  Unlike any vacuum I ever had before, this is NOT noisy.  I always wore hearing protectors with the old ones, and don't even need them with this  Not loud or obnoxious at all.The ease of dumping the dust bin is a big thing for me.  I hesitated to use the Rainbow because you have to fill it with water, then find a place to dump the water\/dirt\/hair sludge.  Then rinse and clean the cannister.  My old Filter Queen used paper filters that need to be changed, and it was a nasty dusty mess to empty.  Also very heavy.  Also expensive:  I paid something like $450 for that think way back in 1972!The new Eureka Was $78.  Both the Filter Queen and Rainbow were getting problems, but still worked.  I also have a Dirt Devil I bought years ago and used about twice and hated.  (Want them?  Come and get 'em for FREE.)I can't find anything negative about the Eureka.  I am looking forward to vacuuming the rest of the house and picking up a bushel of pet hair.Some notes on things previous reviewers complained about:Some folks talked about the hole in the end of the handle, and that the hose was too short.  They must not have gotten the instructions with theirs.  The handle doubles as a wand that extends the hose so you can reach furniture, drapes, etc.  The Owner's Use Manual that came with mine is great.  Well Illustrated,  thorough, and easy to understand.  Another plus.Several people said the height adjustment did not work, and it either was too low and burned the carpet, or too high and wouldn't clean.  I checked min before  using it, and the height adjustment wheels were indeed stuck and would not  lower when you turned the knob.  I called Customer Service right away.  Got a person quickly who was very helpful.  While she was taking my information, I kept fiddling with the height rollers, and it started working!  I am not mechanically illiterate, but do not know why it unstuck or what was holding it to begin with.  So, it works fine.  I did find that Customer Service was very responsive.I will update this review if anything changes or problems arise.Maybe it is kind of sad that at this stage in life I get excited about a new vacuum (smile) but it is a real treat to find a great product at a great price that really works!","isVerified":true,"ratingScore":5,"reviewReaction":"280 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"This thing SUCKS (literally!! It works so well!)","reviewDescription":"Alright, I got this vacuum cleaner today, so I can't speak for the long-term durability of it, I sure hope it holds up, but let me tell you about my experience. I assembled it in maybe 10-15 minutes and I can't follow written instructions for nothing, so it'd probably take a normal person even less time, 5 minutes maybe. I was skeptical given the price point, but I read some reviews and took a chance on this vacuum. I want to start by saying I'm 30 and single, I do -not- fall in love easily y'all, but this vacuum might have been the one to change that. I might love this vacuum more than half the people I've dated, okay? I wanted to test this sucker (no pun intended) against the vacuum I previously had (which is now going in the closet for eternity- it's been replaced, and was also, might I add, more expensive than this one), so I started by vacuuming all the carpeting in my house with my old vacuum. My upstairs is entirely carpeted and I have a few rugs downstairs, so keep that in mind. It ain't like my entire house is carpeted. I ran this son of a gun over it AFTER I vacuumed with my old vacuum and this thing still got a POUND (.45 kg for the whole rest of the planet) of crap out of my carpet. I'm pretty sure this thing pulled up ick that's been in this carpet since 1953. I think I vacuumed up dog hair from 3 owners of this house ago. There's probably dust in there from before I was even born. I have never felt more disgusting and cleaner in my entire life now that I've used this. I can't believe I lived will all that in my carpet for all that time. If you're considering this vacuum, just do it. Totally worth it. Can't beat it for the price. Heck, I'm pretty sure it could outperform even more expensive units if it holds up.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Wowza! 🤩","reviewDescription":"I bought this vacuum because my Dyson’s battery life is very short and my Roomba doesn’t go into the bedrooms. I wanted something corded, that could tackle pet hair (we have a chihuahua, a long haired cat, and two poodles) and lots of dust. We (humans and animals) spend a lot of time outside in the garden and are constantly tracking in dirt, plus we keep the windows open to cool the house so dust gets everywhere. All that to say we own two very expensive vacuums that we use constantly to stay on top of the dust and fur.Now, this was after just ONE PASS in our carpeted master bedroom. I can’t believe all the dust and hair that the Dyson was not picking up! It’s wild!Anywho, setting up the vacuum was very quick and easy! I will say that the hose does seem pretty short but I will not be using that function with this vacuum so that’s not a problem for me. It is lightweight and easy to maneuver. I also love that the canister is easy to remove and empty, as well as the filter being so easy to wash! I highly recommend this vacuum.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"The suction of fine dirt from Carpet","reviewDescription":"I vacuum my house 1x a week having 2 pitbulls whom I take to daily walks along river in which they live to swim and of course running in the dirt they collect lots of river grit and dirt.  I was Amazed how much grit and fine dirt this vacuum sucked out of my carpet This pic of the collection from just the living room. OMG . The pet hair attachment is just as Amazing. Once you snap on the pet attachment it starts spinning and it Actually picked up fine hair that Pittbulls shed on furniture. I'm absolutely a fan of this vacuum. I had a cleaning business for 16 years and I know vacuums. This one without hesitation is a Winner. No need to look any further. It's also very light weight to move back and forth  without any effort.  Installion was easy didn't need instructions. Snap on and go 👍","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Old Man Approved","reviewDescription":"When my trusty Hoover finally gave up the ghost I started looking for a suitable replacement. First I visited the Hoover website hoping to find this model or something close. Wrong! They’re all making the same cheap plastic versions now.Like most things made today they no longer make them to last. They purposely design their offerings to wear out in a couple of years forcing you to buy a new one. Oh well … so it goes.The task of finding one like mine was daunting. I didn’t.😩So the next best thing was to find something close that wasn’t too expensive and had reasonably good reviews on Amazon.This Eureka fit the bill nicely. My price was only $89.00, and as you can see in the pictures, it looks very similar to my old work horse.It functions very much like my Hoover upright but sadly without the automatic cord rewind. No biggie.It is much lighter than the Hoover and it glides around the floor with only a gentle push required. Nice.The operating noise level is comparable to the Hoover. About what you’d expect. Not that horrible.The performance was stellar and it was a pleasure to use without a learning curve coming from my Hoover upright.I also like the way everything easily snapped together upon assembly without any issues, except one.At first I thought there was something wrong with the height adjustment. It was locked in place. But then I discovered it works perfectly once you release the handle from its upright position.So far so good.I also appreciate the foot controls that release the handle and turn on the power. Although plastic, they click in place firmly and seem well designed. Time will tell.I first vacuumed my bedroom which has a low pile carpet. I was amazed at all the dust and debris it captured in just a couple of passes (see photo).For the price this thing rocks. You can spend extra to get a few more bells and whistles but why would you want to? Other models seem to have the same motor and dust collecting systems. This Eureka is all I need and I’m thrilled with my purchase.It’s definitely old man approved. lolHope this helps.If it conks out prematurely I’ll leave the appropriate update.Happy cleaning!","isVerified":true,"ratingScore":5,"reviewReaction":"54 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"(Update - 8 months later and brush motor dead) Pretty good for a cheaper ($$) vacuum","reviewDescription":"UPDATE:  So, I want to preface with, this was still a decent vacuum for the price and although I expected it last a bit longer than 8 months, it still was not a bad overall vacuum for someone on a budget.*** HOWEVER:  the motor that spins the brush in the vacuum head (part that is over the carpet when vacuuming) has stopped working.  I was using one of the handheld attachments one day and suddenly noticed what smelled like small electric motor burning (I think we all know that cliche smell lol).  And looked over at the vacuum and the actual brush motor was smoking.  I immediately unplugged the vacuum, no fire or anything like that.  I let the vacuum sit overnight.  Plugged her back in and turned it on, vacuum still “works,” but the motor for the brush head died, so I can only use the handheld attachments now.*** Be aware, if you are using handheld attachments, the brush head in the actual like vacuum is still spinning. So, what looks like happened to me is that it was spinning and sat idle in one spot too long, started pulling up some of the fiber from the carpet which cause strain on the brush and motor, ultimately causing it to burn out.  I hope that makes sense. *** Again, not a bad vacuum, just be aware of some of the little caveats.  Previous, bit more “high end” vacuums I have owned, the brush in “vacuum head” (part that pushes over the carpet as you vacuum) would still spinning if you were using the handheld attachments.(Original review) I was skeptical buying a cheaper dollar amount vacuum, but this one is definitely worth it.  I downsized to a smaller apartment with only half carpet, didn’t need anything super expensive but wanted to get the job done.  This vacuum definitely accomplishes that goal.  Lightweight.  Good auction.  Decent onboard tools, long cord.Overall, if you’re looking at this vacuum because of the price point, definitely worth it 👍🏽","isVerified":true,"ratingScore":2,"reviewReaction":"27 people found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Vacuum","reviewDescription":"Unfortunately I  had to return it.  The product description on line was \"ultra light\".  It was not.  Too heavy to use due to my multiple medical issues relating to my back structure.  I tried but it was to heavy.  It was a beautiful machine overall but just not for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Lightweight  Eureka","reviewDescription":"Eureka is a long standing name for quality but in this case it failed me in this category.On the outside it's a beautiful lightweight vacuum with all the attachments on board,Then you turn it on and it's ear piercing.  Never had a vacuum as loud as this.  I do not recommendthis product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Displaces dirt and dust","reviewDescription":"This vacuum seems to just create dust clouds. The front vent blows debris around before you even get a chance to vacuum it up. I have asthma and allergies, and the two times I've used this it has blown around the dust causing me to have a reaction. You can see the dust blown out by the vent in the photo.I only used this on hardwood and tile, so I can't speak to how it works on carpet.I don't recommend this product for those with respiratory issues and\/or with hardwood or tile.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"Decent basic vacuum but has a major problem","reviewDescription":"After months of having this vac, I've had to take it apart with a screwdriver at least 8 times to put the rubber band back in its place. It slips so ferquently that I don't even want to use this vacuum out of fear that I am going to have to take it apart and fix it again. I had to buy new bands the first month bc the initial one broke. This is not a vacuum I would ever recommend to anyone. Will be purchasing a different brand in the near future.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Dont buy for the attachments!!","reviewDescription":"The attachments suck no pun intended!!The entire vacuum falls over every time you use attachments. Its hit me in head several times and nearly broken a glass end table.  The hose is way too short and because it attaches at the middle of the vacuum not at the base it cause vacuum to rotate and fall.  This is a terrible design flaw and safety issue.The hose also does not have the typical hose extenders that allow you to reach further away.  Between the short hose and no extension it only allows you to use attachments within a foot of vaccum. Then because the main vaccum doesnt turn off when you use attachments it blows lots of air around and all the dust and dirt you are trying to reach winds up in your eyes and face not the vaccum.The pet hair attachment works okay but because hose is so short you cant actually use it for entire sofa....It works pretty good if you are using it to do floors up right and canister empties and reattaches easily.I had a similar eureka vaccum for last 13 years I loved. I wish I would have kept that one and replaced belts. I thought I was upgrading.I was unable to retun because I didnt keep the box so keep your box!!Epic regret buying this one!!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Poor quality","reviewDescription":"The suction is weak, doesn’t pick up dog hair. The vacuum broke after 10months and I was not permitted by customer support to use my 1yr warranty because they claimed it was “out of warranty according to the calculations.” I will not purchase anything from Eureka again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Pretty low grade","reviewDescription":"Had this vacuum a few months and really wanted to try and like it as it’s light weight and promises great features.  The problem is that it. Just doesn’t deliver.  Shorter cord than we prefer, minimal attachments that are not simple to use, seems to spread dust and the wheels or undercarriage have scratched our hardwood.  Not our cup of tea.  Gonna have to go back to a Dyson or shark product.  Really wanted to try and like this and kept trying to convince her that it was a user issue but she was was right - it’s just not a great vacuum — at least for what we need and how we use one.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Not so good","reviewDescription":"Works okay, not great by any means, but okay. The belt slips off regularly, the extensions are not very good, the cord it a little too short, and the agitator doesn't bite in very well. I would NOT buy this again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Short, inconvenient hose","reviewDescription":"I didn't even try vacuuming with this machine once I put it together. Put it together in spite of the poorly written instructions, , I should mention. I used to teach college tech writing. I know poorly written instructions. This one gets a red pen. No, the reason I'm returning isn't because of the instructions, although the company is too cheap to hire a professional tech writer, they also seem to be too cheap to hire a designer who actually uses a vacuum cleaner. Maybe I'm just too accustomed to my Dyson, but I'm not going to have anything to do with this short, inconvenient hose. People say size matters, let's be specific: length matters. This hose has nothing to extend it to the appropriate reach for cleaning anything lower than my knees. That little crevice tool? Ha! A few inches won't reach the floor, the baseboards, the tops of the windows where the spiders like to spin their webs, behind the dresser, under the bed .... It's a hose that's about four feet long. In order to use it, you have to bend over and disconnect it from the bottom of the vacuum and either use it as a round hose end or attach one of the three tools. The reason the Amazon listing doesn't show a standing adult using the hose is because an adult has to bend way over to vacuum anything that isn't waist high. When I vacuum, I pull the hose on my Dyson out several times and use it all kinds of places: under the couch, along the kitchen cabinets, around the baseboards, on the stairs. No way this thing can do those jobs unless I crawl on my hands and knees. And I won't get on my hands and knees for a too-short hose. For all I know, it sucks just fine, but I didn't even plug it in once I saw how poorly designed it is. I'm not sure why anybody gave it a 5-star rating, but obviously a lot of people are willing to settle for a short, inconvenient hose. I'm too old for that. I bought this so I'd have a second vacuum when I didn't feel like lugging my Dyson down the stairs. I'd rather lug my Dyson than try to get the job done with this cheap vacuum. Next!","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1633824000000}
{"reviewTitle":"Always Clogged","reviewDescription":"Good suction but the design is horrible. The canister is always getting clogged if you have to vacuum more than tiny pieces of dirt, I.e. pet hair. So I constantly have to remove the top part and pull it all out with my hands instead of just dumping it. Sometimes when I turn it on the filters blow out a giant cloud of dust. Would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"THIS IS NOT A GOOD VACUUM TO GET...","reviewDescription":"I HAD TO GET REPLACEMENT PARTS AS THE FIRST VACUUM BROKE BEFORE 3 USES. THEN, THE THING WOULD NOT TURN OFF AS THE ON\/OFF SWITCH STAYED IN THE ON POSITION, SO HAD TO GET A REPLACEMENT VACUUM AS THAT WAS DANGEROUS.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Great vacuum but ruined my rug :(","reviewDescription":"Has this happened to anyone else? It was my first time using it on this rug in particular and somehow there are white skid marks all over my rugHowever the product itself works great! As well as the attachments","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"No thanks, here's why...","reviewDescription":"This is an average, cheap vacuum. I'm a stay-at-home-mom and I've used several through the years. Comparing this vacuum to others, the biggest issue I had was not just the noise, but the high-pitched frequency\/ringing sound when it was on. I have kids with special needs that cannot tolerate that sound, but neither can I. My ears were ringing after only two minutes of using the vacuum.Also, the hose is seriously too short. I read that in another review, but it's obnoxiously too short. When I used the hose, I was right next to the vacuum and the whole thing fell over on me as soon as I pulled the hose only inches away.I think if you're looking for a cheap vacuum for a small space or dorm, it's ok. It does pull things up as it should. But daily or weekly use is out of the question with the ringing sound and the hose. I returned it right away.Hope this helps!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Do not buy.","reviewDescription":"This Eureka vacuum did not live up to it’s reviews.  Does not have enough suction power to pick up dirt or hair from high pile or low pile carpeting. Cheaply made .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"emmits dust","reviewDescription":"used it a half dozen times, when i noticed when after i disposed of dirt contents from holding cup and placed  it back it emmited  dust into the air. I have tried it several times and did it again at this point I will not be using probably throw it away.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Not Great","reviewDescription":"I got this vacuum for my upstairs since it is all carpet. I have to go over certain spots at least three or four times to get something up. Super disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"My vacuum is missing a piece on the handle","reviewDescription":"My vacuum, which is a present, is missing the handle wand—- so the handle has no closure on it, with a notch on the side, which is obviously for something to snap in there, I would appreciate it being shipped to me ASAP, thank you","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"to much plastic.","reviewDescription":"I needed a new vacuum and I bought this one. It is all plastic and when using it the hose does tend to come out from the vacuum and the dust goes everywhere.Have to watch that.I've had it about a month and now it won't pick up. I used it yesterday and it did not clean at all. I have to call customer service tomorrow...No, I don't think I would recommend this vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"I really wanted to like it....but","reviewDescription":"Okay, I don't feel like you're supposed to feel like you just did a full body workout after 10 minutes of using a vacuum??? It does not glide well on carpet and I have normal low carpet. This is the second vacuum this week I have tried from this Eureka brand and both were a bust. The suction on this one seemed great at first, then a few minutes into using it I noticed it wasn't picking much up. I checked the bottom to see if maybe I forgot to remove something when assembling, but nope! I might have just gotten a bad vacuum? Not sure. I can't even get in touch with customer service which is even more annoying. I really wanted my vacuum search to be over, but guess not.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662336000000}
{"reviewTitle":"That my wife likes it.","reviewDescription":"The machine was a bit noisy when its running","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great vacuum for the price especially","reviewDescription":"It's a little cumbersome and doesn't get under small spaces but the hose and things makes up for that. Good price and has great suction.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Easy use","reviewDescription":"Easy to assemble and use, so far. Seems to be well made. Have not used Attachments yet","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Corn Buster","reviewDescription":"Seem to work very well rent in Sr Apt so carpet our not new but to made them look a lot better","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Amazing vacuum!!","reviewDescription":"I had vacuumed the day before when the vacuum died. I bought this one and was surprised. I went over the same place where I had cleaned the day before with my old vacuum. I was pleasantly surprised how much stuff the new vacuum pulled out of the carpet! Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Powerful vacuum","reviewDescription":"Vacuum has very good suction. Been using rechargeable vacuum. Than went back too a real vacuum couldn’t believe the difference. Good price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Nice suction","reviewDescription":"Have small area to vacuum and works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Eureka Vacuum","reviewDescription":"Love it! It’s perfect and a great value.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Very good product","reviewDescription":"Works extremely well. Strong suction and great accessories","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"So far so...","reviewDescription":"...good! It is brand new. Here's what I know so far:It's very light in weight (which I greatly appreciate)It has great vacuuming power (the dander and cat fur it picked up is crazy!!)I don't love that I have to switch the main hose position to use the handheld feature, but other than that, I like it very much.I'll give an update review in a few weeks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Great for all cleaning","reviewDescription":"This vacuum is great on any surface and will pick up dirt fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"bought for a gift","reviewDescription":"can't say anything first hand, but my son and his wife love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Helpful vacuum","reviewDescription":"I like that it picks up dirt so well and easy to clean.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Love it!","reviewDescription":"I meeded something simple with a strong suction.  Better than expected.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Hands down get job done!!","reviewDescription":"I am a mom of 4 boys. So sports and dirt is easy in this home. It seemed small and I underestimated its power. Not loud and pick up dust and all. I would definitely buy again. Had Hoover and it started to smoke. So happy with this vacuum.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"QUALITY","reviewDescription":"HAVE NOT USED PRODUCT YET !  PURCHASED AS A BACKUP !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Not bad","reviewDescription":"It's not bad for the price. It does a good job cleaning I must say. Its a bit heavy for me . Other than that it's a good deal.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great Vacuum!","reviewDescription":"Needed a all around good vacuum at a reasonable price.  This one really fit my needs completely.  I would recommend to anyone!  Thanks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Lite weight easy to use","reviewDescription":"This works good  light weightBagless emptying is a breeze","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Lots of suction!","reviewDescription":"After both our Hoover corded vacuum and our Dyson stick vacuum bit the dust within two months, I desperately needed a new vacuum but didn’t want to pay hundreds. I landed on this one after reading lots of good reviews and it arrived today. It was super easy to put together and HOLY MOLY, the amount of stuff it sucked up was…disgusting! Our house was vacuumed less than a week ago and I was horrified by how much this vacuum picked up! Tells me just how badly we needed a new one!It’s only been a few hours, but I’m very pleased with this vacuum and the value for the cost!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"It’s *alright*.","reviewDescription":"Well, I was really excited about the looks of this vacuum when I first looked at the product details and other reviews on here.I’d never loved a vacuum more than the Dyson Ball I had back in 2016. This appeared to be a pretty good “knock-off” version of the Ball so I bought it!Pros: Lightweight, easily transforms from beater bar to handheld hose, several attachments, bag-less.Cons: Falls often when vacuuming with hose, does not work too well on hardwood floors even when on hardwood floor setting, (Debris often get flung around and not sucked up), area around filter gets clogged quickly (especially with pet hair-need to open and pull hair off filter area), when emptying canister need to pull apart filter casings to get a try everything emptied- not just an open and dump typically.In short, works well on carpet but be prepared to empty and unclog often. If you have a lot of hardwood floors or LVT, this vacuum should probably be a pass.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Light & Stong BUT.....","reviewDescription":"I refuse to buy expensive vacuums because the ones I've had have broke after a few years so I decided to try this one out.  I'm a big fan overall.  It's light nah easy to use.  The attachments are conveniently stored and don't get in the way.  There are 2 buts....1). You can't vacuum up large even light things. Think pieces of torn paper or a puff of cotton.  They will get stuck in the hose and it's kinda a pain to disassemble and clean out.  2) I've only had it a few months and the belt for the brush has broken twice.  It's very easy to replace and easy to find the replacements.  But overall I'm happy with the strength of the vacuum","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"Be aware that the rolling brush cannot be stopped!","reviewDescription":"The construction of the cleaner is very cheaply made. I used to have a very similar model from the same brand and it was robust, and the filters abundant and reusable, and that is no longer the case. The main issue and why we had to return it is that you cannot stop the brush on the cleaner when using on  for rugs that have very long threads. The threads of our rug got immediately caught and cut on the vacuum cleaner, so it is definitely a problem when the roll cannot be a stopped. A previous model had the option to stop the brush as needed, but this one doesn’t, so it didn’t work for us. Other than that, the sucking power seemed OK.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Could Suck Stronger","reviewDescription":"I'll give this thing the benefit of the doubt and say that it may be my carpet that's the problem. It's old and worn and has the carpet equivalent of loose threads, so the vacuum always has something stuck in it. I feel like a better vacuum would just easily suck it in without anything getting caught in the roller. Not only that, a lot of debris somehow dispenses itself out of it. Maybe I'm vacuuming wrong, maybe I just have it on the wrong setting; I didn't think the procedure of vacuuming was rocket science.With that being said, it mostly does the job. It's not a terrible vacuum, I guess I just expected a little more. It's also easy for the attachments to fall off of their holders so that's annoying. Anyway, get this vacuum if none of the things I mentioned is a big deal to you!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Disappointing - Light Weight Light Duty Only","reviewDescription":"Purchased this to replace a shark unit we had for years and the handle broke.While this get's good reviews, it's no nearly as powerful and robust as the Shark.  My wife wanted the hand tools to clean couch cushions, but the brush can't tolerate and pressure and it stops easily (pretty useless).  the power is pretty light and it has not filtering which we had on the shark.  The shark also has much more propelling power when in use.I would have returned it, but we got outside the return window.I repaired the old Shark and keep using it as the Eureka is disappointing at best.  These are comparative statements based on a vacuum I really like and Eureka doesn't come close to.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Great suction but not worth it","reviewDescription":"Update after using for few weeks:: the cord will be the death of you - if you have a huge distance to vacuum get something with a WAY longer cord. It is placed low so it gets stuck and you keep running over it. Also it doesn’t swivel so I can only seem to vacuum my rugs in one direction or I literally can’t seem to push the vacuum in the opposite direction on the rug, which is annoying. Good news- was missing a piece so it does have a location for the cord to wrap. Overall I’d spend a little more and get a shark or other vacuum.I only received this vacuum yesterday and used it for the first time. I’ll update here as time goes on. I had an Oreck vacuum for 14 years. It was a powerhouse, and if that’s what you’re going from you may be somewhat disappointed. This Eureka vacuum doesn’t have the swivel head, there is no place to roll up the cord and the place it somewhere , the cord is extremely short (that has been mentioned in many reviews) so if you don’t have many outlets this isn’t a vacuum for you, also the hose that you can detach to clean is very short so you’ll have to lift high above you if you’re looking to work on curtains, blinds, skylights, etc. The pros are that it has great suction & there is no bag needed. It’s exceptional suction for this price. I have a ton of plants and it’s useful as in it blows the air up and sucks the stuff up, so if you have loose leaves it will get them off the plant and suction- you won’t have to repeat the vacuuming once you’re done in that area. I have lots of kids and a dog so was excited to try something without bags. I’ll keep you posted with how this holds up. Another few reviews said this vacuum is quiet- I have mostly hardwood floors and highly disagree. It is an average loud, but definitely nothing quiet about it. Must know: no place to food up cord, cord is located low so if you don’t wrap it between the handle you will keep vacuuming over it and it drives you insane, need many outlets because cord is short - amazing suction on a budget, no bags required, easy assembly and operation.","isVerified":true,"ratingScore":3,"reviewReaction":"18 people found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Dust","reviewDescription":"If you live in an area that's very dusty, like you clean and within a day there's already enough dust that it's noticeable and by the end of the week it looks like you haven't cleaned in a month, you'll probably want to go with a bagged vacuum unless you've got some tricks.I went to empty out the container for the first time and nearly died at all the dust and the fine particle dirt cloud that filled the air. In retrospect, this much should have been obvious. In addition, the top of the tank is still filled with all the dust particles that wouldn't come out even after emptying it.Still, I'm apparently too lazy to return this so I guess I'll have to figure something out. It's certainly better than the old vacuum we were using. Powerful suction, great attachments, the cat tree finally looks clean and the carpet just feels and looks cleaner than it has since we shampooed it.People complain about it being light but the whole point was for it to be light to make it easier to carry around and up stairs and whatnot, it's literally in the description. It works exactly as described.And despite the amazingly strong suction that got even the deep rooted hairs out of the cat tree and practically sucked the fine dust off the floor underneath the carpet, I don't have a problem with the suction of the hose knocking the vacuum around like many others complained of. Then again, maybe I just know how use vacuums so as to not run into such issues. Lord knows I used to have that issue even with the heaviest of older vacuums when I was younger so I learned how to position the vacuum so that it didn't happen and now I don't have the problem even with super light vacuums. You CAN work around this, you CAN'T have the best of both worlds. Well, maybe someday we'll be able to click a rotator selection wheel to adjust the weight of an object, make it super light to carry around or super heavy to ensure it sits in one place, but that day is not yet upon us.Addressing other concerns I noted in the reviews: could the hose be longer and less stiff? Sure. Will it grow to be less stiff over time? Almost assuredly.","isVerified":true,"ratingScore":3,"reviewReaction":"32 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"It's very loud","reviewDescription":"UPDATE:  I am returning  this vacuum.  Not only am I not happy with the blowing of items, and the loudness.  The cord is not long enough, I can't reach anything with the handle, and cleaning it out is a nightmare.  I used it twice, and am returning it.This vacuum is very loud, the handle isn't very long, I'm short with high ceilings, so I can reach the corners.  I bought it for upstairs use (as I'm getting older and carrying mine up and down has become a nuisance).  If I had bought it for my main vacuum, I'd be returning it.  That being said, I didn't notice any issues with it picking up anything off the floor, even got the cat litter.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Eureka Bag less vacuum cleaner","reviewDescription":"What I like about this vacuum cleaner is that it is lightweight, it was easy to put together, the dirt collector is very easy to remove from the vacuum cleaner to empty. The suction is also really great. What I don’t like about it is that the hose is very short and there is no extension  tool. It also is very noisy, noisier than other vacuum cleaners I’m used to. In general, I’m happy with the vacuum cleaner","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Not as powerful as I hoped- need a floor model","reviewDescription":"Stick vacuum cleaners are a wonderful thought but not very effective even for my apartment where I live alone and have no pet and few visitors. I mainly walk barefooted inside but my helper wears shoes that are clean. She has dogs. My stick vacuums have not been satisfactory x 3 different ones. Get a light floor model.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Overall Great Vacuum, Great Suction and Excellent for Pet Hair","reviewDescription":"Got this vacuum and tried it out on a 10X11 foot room.  I had been using a Bissell prior which basically started to malfunction (damaged motor bearings) after only 9 months.  Set up this Eureka (very easy) and on the first vacuum the dirt container was FULL.  It picked up that much hair the Bissell had left behind!! The suction is strong and will easily swallow a curtain if it gets caught in it.  It vacuumed up cat hair easily and thoroughly.  It is sturdy and a great vacuum especially for the price.  The filter is washable.  The only reason I gave it 4 stars instead of 5 is because 1) the hose should be longer however that is an issue with all vacuums.  This one is what you would expect and works fine, but with stairs you need a LONG hose.  A hose extension should be an attachment for stairs.  2) I wish it would go flatter to move it all the way under the bed.  It outperforms Bissell no question and a comparable Hoover I purchased before that.  Its a keeper and I am now relieved to actually have the built up hair and dirt suctioned up! Summary good overall, very good suction, great at getting up pet hair and a sturdy vacuum well worth the money.  Outperforms other comparable vacuums of other brands.","isVerified":true,"ratingScore":4,"reviewReaction":"70 people found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Great suction, few minor quirks","reviewDescription":"Really great suction, it got a lot of pet hair out of my carpet even after I had just run over it with my old vacuum. The pet upholstery tool works well but when there’s suction the little brush stops spinning so I feel like it could be doing better. The hose is technically long but doesn’t stretch out easily so you usually end up tipping the base over. The canister is very large and holds a lot of dust but when you empty it it gets all over the outside and makes the vacuum always dirty. There is a puff of air that shoots out the top of the vacuum while you’re running it that blows papers off of coffee tables, which is a little annoying.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Nearly returned it, glad I didn't.","reviewDescription":"So let me start off with saying when I received this it was used (had hair and whatnot in the bottom part) so I automatically was going to return it because I didn't pay for a used vacuum cleaner and felt like if someone had returned it there was a reason. So I accidentally missed the return date so I was like well, whatever if I'm going to keep it I might as well use it. Our other vacuum cleaner has been messed up for a couple weeks and I kept putting it off getting a new one. We have an Australian Shepherd which shed like crazy and I needed a specific vacuum to pick up his fur, well this is it! This was one real quick sweep over an area rug. I also love how light it is! Only complaint was I wish it had a retractable cord, I probably wouldn't have purchased it had I realized it didn't. Still glad I did though!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724112000000}
{"reviewTitle":"pretty great for the price","reviewDescription":"I bought this little Eureka vacuum because I was tired of carrying my Kirby down the stairs hence I haven't swept as much as i should. And I have allergies and CATS.So, this vacuum was easy to put together right out of the box. I consulted the assembly instructions on the first page of the manual but didn't really need that because it was pretty self explanatory. It was all assembled and ready to roll in about five minutes.I was impressed by the amount of grime that came up right away. There is a setting for low pile carpet , a setting for high pile carpet and a setting for bare floor.I used both the bare floor setting and the low pile carpet for my area.The one drawback I found is the cord is only twenty five feet long. My room is not even that big but I found I had to change to another outlet to finish the other side of the room.The outside of the unit is equipped with mostly hard plastic pieces for power button and handle release, so time will tell if those will hold out.It had been about two weeks since I had vacuumed downstairs previously. The amount of dust, cat hair, and filth that I got up was amazing. It pretty much filled half of the canister. Maybe more. Unfortunately some of that stuck up in the top of the canister and it empties from the bottom so I had to stick my hand up there to get it the rest of it out.The unit is lightweight and easy to push.It blew hot air from the unit and that was powerful enough to knock some papers off of my desk three feet away. So that is a little annoying because I know it's blowing dirt all over as well. Luckily it picks up dirt really well also! I think this eureka model is going to be exactly what I intended it to be and save my poor back!I used the crevice tool attachment to get in behind my desk. Unfortunately the hose is a little short, but I stretched it out and made it work.For the price it's exactly what I needed.Minus one star for cord length and the amount of pressured air it blows out.","isVerified":true,"ratingScore":4,"reviewReaction":"29 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"This sucks!","reviewDescription":"Literally! The picture I took is after 1 sweep of my living room. Mind you I vacuumed with my inse just 2 days before I used this and this is what got sucked up. I immediately fell in love. Worth the money and especially if you have a shredding pet get the pet tool!The only issue I have is with the handheld brush. It does often get stuck and stops rotating during vacuuming and I would need to either shake it or manually move the brush so it'll start rotating again.Other than that the main base works so well. It is a little heavy especially when you're doing the stairs but worth it to get all the dirt off. The power is great and assembly took 5 mins. I didn't understand why the handle was hollow until I realized it's also used as an extension for the hose.I just hope this lasts for a long time.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Great vacuum","reviewDescription":"This is really a great vacuum cleaner for the price. the suction is great, it’s not too heavy, all the extra accessories and parts are stored right on the unit itself, the cord is long and it’s easy to empty and clean out. The ONLY problem I’m having so far is the detachable handle part is a bit short. I’m only 5’4” but when I use that attachment I feel like I have to still bend down quite a bit to reach everything. Still a great purchase and probably my favorite vacuum cleaner I’ve owned, but I will be seeing if there’s an extension piece available","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Does the job, but nothing great","reviewDescription":"I purchased this Eureka vacuum to replace a 6 year old $50 Bissell Power Force Helix, which had a burnt out motor (after using roughly 5 minutes per week while keeping filter clean and canister empty). So I wanted to try a different brand. Honestly, the only improvement over the Bissell are the extra attachments with longer wand. It cleans carpets well, and solid floors okay. The suction is about the same, the noise is about the same and the cord is about the same length as the cheaper Bissell. Hopefully this one lasts a bit longer. My guess is, you need to step up to a $200+ model to get better performance. Bottom line, the final star rating will depend on the longevity. This one is fine if you have a small home, but don't expect anything amazing.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Great vacuum","reviewDescription":"Perfect for my apartment. Feels well made for the price. Good suction. Huge debris container. Great selection of fittings.BUT I REALLY wish it came with the tube extension that most vacuums come with. I wasn't paying attention and just assumed it did.  I really need the tube extension to reach my tall ceilings. Had to order one separately. Only reason I deducted a star. Otherwise great vacuum.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Not lightweight","reviewDescription":"It's a good vacuum cleaner. But it's not really what I wanted. It's heavy. It's not lightweight at all. I was looking for a powerful, lightweight but I guess I can't find it. I liked the smaller green one better, but that one doesn't have enough suction.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Works well but...","reviewDescription":"I like the machine, it works well.  Its fairly quiet. What I am having a bit of a hard time with is that it doesn't have another length of extension and I have to bend over quite a bit (its easier just to get on the floor) while trying to vac where the floor meets the wall. I can take the handle out and attach it to the hose and crevice tool but the hose while being sturdy, doesn't stretch to far without tipping over the machine. I am trying to see if there is another piece available. I had a eureka that quit but before I threw it away I checked to see if the extension pieces would fit - of course they don't.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Don’t buy this! Noisy!!!!","reviewDescription":"I purchased this to have a backup vacuum for our basement, I have used it 4 times for light pickup as we are rarely downstairs! This evening I went to use it and it sounded like it was going to blow up! The squealing was awful! I turned it off asap, looked for issues something caught in the roller,.. no, something thing in the hose.. no. Turned dials to see if the noise changed.. no.. unplugged, restarted, Same noise! Checked the belt and it was fine. I emptied the  canister it was barely full.. still the same noise. Unable to return as I bought the beginning of the year. Super disappointed in this vacuum!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Not what I expected","reviewDescription":"I purchased this vacuum because it was higher than average ratings and because it was for people with pets. I have 2 dogs that shed constantly and this vacuum couldn't do the job. After the first 3 times of use it stopped it's suction. Hoses were stuffed with fur. Made sure all hoses and filter was cleaned out. Then it happened even more frequently. After 3 weeks there was little to no suction even after clogged hoses. Took apart vacuum and found fur in the motor. Could have actually caused a fire. I've owned other Eurekas that worked fine but they stopped selling those models and ended up buying this one. Not pleased.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Might have been a good machine, except for a high-pitched squeal.","reviewDescription":"I needed a new vacuum, and it seemed like this would meet my needs. But above the sound of the motor, there was a high-pitched squeal. I decided I couldn't put up with it, so I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Easy to put together but already partly broke :(","reviewDescription":"good, cute vacuum for the price. Very manageable. However, after the 5th time I used it the rolling part of the bottom of the vacuum just stopped working (doesn't pick up anything). Only the hose works.  Unfortunately, I will need to purchase another one :(. So disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Design flaw","reviewDescription":"Powerful vacuum, however the exhaust blows dirt and hair away from the path of the vacuum before it can be sucked up. Poor design flaw. Makes it very difficult to pick up hair on a hardwood floor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Decent suction, design could be better","reviewDescription":"The good:Vac has decent suction, is lightweight and affordable.The bad:Cord is too short and needs to be attached up near handle. Where cord is attached now you have to hold it up off the floor with other hand to keep out of way while in use. Crevice tool is too short and needs to be a little narrower. Pet turbo brush tool is useless. It bogs down and quits spinning as soon as you touch the fabric of a couch or dog bed. Suction hose is attached too high on canister which causes the vac to tip over easily when using handle attachments. Speaking of handle, it also is too short when using tools for floor level dust bunnies.I would not recommend this vacuum for people that are tall-ish, have pets or, large rooms to vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"I guess you get what you pay for","reviewDescription":"Just replaced it w an Oreck. A reasonable and inexpensive vacuum; it does its job decently, but cleaning it well is a lot of work, including screwdriver, and you have to clean it frequently. The hose is quite stiff so be careful on stairs you don't get smacked in the head by the upright as you extend the hose. Believe me. For pet households, it does a pretty good job getting the hair, but you still should use one of those carpet rakes and then vacuum...which sort of makes you go, why am I doing two things? Plus the vacuum reeks if you have pets.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Exhaust in an idiotic spot.","reviewDescription":"So far I’ve had this vacuum a few months, I bought it in anticipation of getting a golden retriever puppy.  That day finally came and when it came time to vacuum the house of dog hair, I was met with the most idiotic product design for a vacuum marketed towards pet owners.The exhaust is right at the bottom of the front of the vacuum.  Meaning the air blows directly on the floor in front of the vacuum, sending hair not only up in the air but also 4ft in front, making it impossible to actually get most hair in the unit.Im giving this two stars because the couch attachment works great, and the vacuum itself has good suction when trying to clean anything but pet hair.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1705190400000}
{"reviewTitle":"Not the best..only because the short cords n hose","reviewDescription":"This deception is really great on this vacuum boy didn't pick up a lot of dirt but I was really disappointed on the length of the court itself and the length of the accord to the attachments I can barely use the attachments because the cord is so short the hose so that's disappointing because that's half of the reason I bought this vacuum so if they do a redesign I really hope they consider putting longer cords and hoses so we can actually use the vacuum properly thanks a happy housewife","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Great Product but Eureka support SUCKS!","reviewDescription":"Works great! When I was setting it up,I noticed the latch on the dust cup didn't \"click\"shut when closing the lid. Product manual states it should \"click\" to secure the lid. The bottom lid needs to be manually put into locked position. Contacted Eureka support. They asked for pictures and verification of purchase,which was provided. After 7 calls in two days, they called back and requested I send more proof the item is defective.I will be ordering my own dust cup to replace it. Really frustrated with that company!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Great vacuum","reviewDescription":"Purchased this vacuum to clean carpeted area and large rug in a showroom. Suction works great, it was super easy to assemble and easy to clean.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Good buy!","reviewDescription":"I’ve had just about every vacuum possibly imaginable and they all end up crapping out on me. I decided to go back to basics and just purchased this vacuum as I had one many moons ago and I never had any issues. Good deal and it works great for a household with pets and children. No complaints.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"It's not bad","reviewDescription":"The vacuum is light weight, has attachments. It does the job. I don't like that the carpet brush never stop, even when set on bare floor. It shoots sand around.  But for the price...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"vacuum","reviewDescription":"it's decent no complaints.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Nice item!","reviewDescription":"All is pretty good, I just do not really like much the fact that I have to fold the cable myself. Other than that, the vacuum is really good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Kicks Butt but Lousy Instructions","reviewDescription":"Update: It is growing on me, does good work.  Assembly Manual was bad. 2 pieces were not in the manual. Found a small insert for the items in a zip bag.  Not very descriptive instructions.  One picture is even reversed of actual unit.  Not confident of sturdiness.  I assemble lots of things and this one that should have been so simple was frustrating.  By the way...do I leave the plastic 2 pcs that hold together the filters?  Not mentioned.  I assume I should snip them off like you do new socks?  or maybe doesn't matter?  Too heavy to carry up\/down stairs, so I have one vac per level in house.  Just mentioning.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Great vacuum!","reviewDescription":"This is a great vacuum cleaner and it does a great job. The only thing I would like better is if the hose were longer. It’s difficult to reach under my furniture and I end up knocking the vacuum cleaner over trying to reach under things.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"great","reviewDescription":"botten as a unit with beauty defects (which I couldn't find), its perfect for my light  duty  inmy basement---and at a price underBought as a unit with beauty defects (which I couldn't find), it works well for  my basement use---and for less than $60!  Happy with the results!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Really Good Product","reviewDescription":"Lightweight and does a great job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Great Value for the $","reviewDescription":"I recently purchased a cordless vacuum which works well; however, I missed having a hose attachment for vacuuming the stairs and hard to reach areas.  I looked at several vacuums and their reviews, deciding on this one.  A good decision!  It does really well on both carpets and hardwood floors and the suction, which is my #1 priority, is great.  The only issue is with the dust cup.  It has a button to press and release the cover on the bottom to empty the contents.  However, there is no way to empty contents stuck at the top of the dust cup and now it's stuck there.  Typically, there are buttons at the top and bottom.  There is no way to get to the top to get the content out since the filter is at the top and when you remove it, the plastic cover is screwed down.  Overall, I like the vacuum and it does the job well.  I just wish that I could empty all of the contents!","isVerified":true,"ratingScore":4,"reviewReaction":"47 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Great inexpensive vacuum cleaner!","reviewDescription":"Ii love this vacuum cleaner!  I have an older upright vacuum that was much more expensive than this, but it was becoming too heavy to lug up & down stairs.  This lightweight Eureka is so much easier to use & has much more power than I expected. It comes with all the attachments & an easy container to open & dump the debris ~ no bags to buy ~yay!  I great product that I would definitely purchase again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Best Vacuum Ever!","reviewDescription":"I don’t normally write reviews but I felt like I needed to on this one! This was the first use after vacuuming two days before with the old vacuum! I am amazed at how much was left behind! 🙌 Go buy now!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Great vacuum that saves time","reviewDescription":"I recently purchased laminate floors for my home. Beautiful but now I had to use 1 vacuum for floors and another for rugs. This solved my problem. High quality, easy to use, good size and very lightweight. It has not clogged so far and the attachments are easy to use. When I vacuum the house now, I only have to turn the switch to choose bare floor or rug. Made my life easier. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Very good buy","reviewDescription":"My vacuum came in yesterday. So I vacuumed three of six rooms and pulled up a load of dirt and pet fur which tells me my old vacuum had not been doing anything but surface cleans. After I cleaned all rooms I went through the entire house again, this time using specific flooring settings, and this buy here kept on removing the dirt. So far I love it! Just hope that the life span on this vacuum is as good as the job it does, but we will see.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great deal","reviewDescription":"I love this vacuum!  I can’t believe it is under $100.  We’ll see how long it lasts.  But it is not too heavy, it has great suction and pulls so much out of our carpet!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Loved it","reviewDescription":"I really like this vacuum it was a perfect size. The cord size was long. I was very stable. It wasn’t too too loud. I wish I was able to take a picture of it but my husband by accident threw away my vacuum. I really did like this product maybe someday I will purchase this one again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"LOVE LOVE LOVE!!!","reviewDescription":"I absolutely LOVE this vacuum!!!  I havent had a new vacuum in quite some time but needed to get one so I opted in for Eureka.  This thing is AMAZING!  The amount of debris it picks up, even after I've swept or think an area is clean, is crazy!In my video review, I show how much it picked up from my carpet, which was clean...I highly recommend at least giving it a shot.  Its super simply to put together and just does such a great job!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"impressed","reviewDescription":"my dyson never picked up dog hairs and i used to vacuume over the same spot on carpets multiple times to pick up the hairs. my dyson recently stopped working on carpet so i needed a new vaccum which killed me bc my dyson was 650$. i bought this vacuum and its literally a dream. it works excellent. i hate that it has a cord but it is so worth it. works better than my dyson ever did. i’m obsessed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Absolutely Love this Vacuum","reviewDescription":"Its so light but powerful. Easy to clean. The amount of dirt that came out of my carpet I was amazed that thing sucked all that up. Gross! But I'm happy i'm not breathing it in at least. Great product and very lightweight. Easy to carry up and down the stairs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Absolutely love this","reviewDescription":"The quality of this vacuum is amazing. Perfect size for home or apartment. Easy to setup. The vacuum is super portable and the cord is long enough to vacuum multiple rooms. Highly recommend. It has spots on the vacuum for all the accessories and can clean bare floors to shag rugs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"I bought this March 16-2024 ,  and already the carpet height  switch does not work.","reviewDescription":"I used this to vacumn the living room carpet.  I can't use it now at all.  suctions down so hard it won\"t push on the carpet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Vacuum cleaner","reviewDescription":"It is very heavy and missing parts. Just ok on suction.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Not ideal for pet hair on hard surfaces.","reviewDescription":"Update: The hose is ridiculously short, every time I used it regardless of how far I am pulling it the vacuum ends up falling over and hitting me in the head.So first, I want to acknowledge that the price for the vacuum is great for what you get, no doubt about that. However, when I use it to vacuum up hair on hardwood surface I noticed that the vent is on the front so it just blows the hair away from me and all over the room (into my sink and all over the furniture) making the job much harder. That being said the suction power is decent for the vacuum and it functions well enough for most people. I ordered it as a temporary fix until my Dyson V15 gets here, which I would recommend to anyone with pets, get the Dyson V15 for the extra money, it is very worth it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Difficult to push","reviewDescription":"It pulls a lot of dust dirt and hair but it is so hard to push around even  on the highest setting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"MEH","reviewDescription":"pros:Suction.Cons:HeavyLoud 98 -102 dBA.Useless on hardwood floors.Hose is very short.This vac has good suction but for us, we have hardwood floors, the vac seems poorly designed for that purpose.The vac has its exhaust facing forward in the front of the vac and close to the ground.  Due to this design the exhaust blows some of the dust and dirt away from the vac before you reach the area you are going to vacuum. This vacuum only has one level of suction and its set to very high this unit is extremely loud, 98 -102 dBA loud. The hose on the unit is very short, if you think you are going to vacuum tops of your blinds or high up areas the hose is to short and its elastic nature of the hose is very tight so it will snap back very quickly... due to the hose shortness, its elasticity and weight of the vac it makes cleaning anything high up a pain in the butt to do ... the hose attachment seems to be an afterthought.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"Stopped Working After 3 Months","reviewDescription":"Received this before Christmas 2023 and it worked great! Fast forward 3 months and it started to both suck up and spit out what it was vacuuming. Thought it may have needed a new belt, but the belt was fine. Cleaned it out and made sure no blockages and it still continues to suck up and spit out dust and dirt. Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Static!","reviewDescription":"I constantly get ZAPPED every time I use this vacuum and have to stop halfway because it builds up so much that it becomes painful. The worst part is all the dust and dirt that clings to the OUTSIDE of the vacuum because of all the static. I have never had this problem with a vacuum before.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Pass on this one","reviewDescription":"Poorly designed, attachements are awkward to use, cord is too short, it’s very loud and clunky. I can’t wait until it breaks so I can get something else, I’m guessing I won’t have to wait long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"does really work that well","reviewDescription":"Its a cheap price for sure but just doesn't work after only 30 days of use.  Went to return it but was one day late.  Usually saying something doesn't suck is good, but a vacuum cleaner...well I wish this one worked. I wish I would have gone for one of the other brands ;(","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Avoid this vacuum","reviewDescription":"Lasted 3 months. Sweeper bar is no longer working.  Very low quality, overall.  Eureka help desk is slow to engage. Over three days, they are still debating the format of my proof of purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Ease of accessories","reviewDescription":"The hose is definitely not long enough to comfortably use the accessories..you have to bend over excessive or kneel to floor while using accessories. The unit is lightweight which is nice, has good overall workable suction. The canister is easy to empty.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Light weight","reviewDescription":"I don't like the fact that the cord does not coil itself inside the machine. It is light weight in general and I can't see how it can last for a long time if use every day. No more Eureka for me.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Bad Design","reviewDescription":"If you want to use the wand, you have to disconnect the hose from the vacuum and connect it to the wand.  And then the reverse to vacuum normally again.  Mine did not come with the flexible extendable crevice tool as advertised.  The power cord is too short.  Have to unplug and replug to get to all my areas.  So far, the suction is good though.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"Disappointing","reviewDescription":"I guess it just don't understand the way it was designed. You basically have to take it apart if you want to use the hand tool and then you have to take it apart to use the vacuum. Meaning you have to disconnect the hose to connect one or the other. Unlike most vacuum cleaners.I bought the pet version because I have three dogs and they shed well. When your vacuuming the exhaust comes out the front. So as you're vacuuming up the hair, it's blowing the hair away from the vacuum up into the air so that doesn't make sense to me either.As far as the canister that catches the hair and the dirt, it doesn't make sense because there's a mini container at the top of a canister. So as the hair comes in it feels that little cup blocks the opening so nothing else can come in. And basically you still have 90% of the canister empty but you're emptying it because the top part is blockedI just don't think this was meant for animals","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Attachment and short power cord.","reviewDescription":"Attachments w\/ hose are terrible.The vacuum suction is excellent, the unit is a little bulky. 6 out of 10 in my opinion","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Powerful suction but....","reviewDescription":"Still doesn't do the greatest job with pet hair on my couch. The \" pet hair attachment \" just stalls out immediately upon touching fabric.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Looks like a return.!","reviewDescription":"The box was taped with postal tape, ,items loose in box, and vacuum started when plugged in, not turning it on. I will watch it for a few weeks, it’s very loud and I am not sure that is a normal sound. Maybe why it was returned.  As for the vacuum, lots of power. The vacuum was not expensive, so I will hang onto it if it continues to work well,","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Read written review below.","reviewDescription":"It leaves brush streaks on my carpet, (bristles spaced too far apart). It has no light.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Muy de plastico","reviewDescription":"Me incomoda tener que cambiar el pico para aspirar rincones. Es muy de plastico. Aspira bien.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Mediocre","reviewDescription":"I purchased this product, in part, because I have a large hairy dog. The pet attachment is useless. Any pressure whatsoever and the brush doesn't spin. In any event it doesn't work well. The attachment hose is short and  stretching it even  a bit causes the vacuum to fall over.  I guess it's OK for a basic, cheap vacuum.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Mostly happy with this","reviewDescription":"I have area rugs and hard floors in my home and it has been a struggle to find one vacuum that can handle it all. This is the third one I’ve tried and it’s the one I’m most happy with. It can be a struggle on area rugs as it’s very hard to push, but it’s better than the other vacuums I tried. It gets up a tremendous about of stuff - especially the first time I used it. It’s not perfect, but it’s definitely above average..","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Great vaccuum","reviewDescription":"You can’t beat this for $80 it did a great job. 4 starts because it did squeak some moving it back n forth but no biggie.  The pet and upholstery accessories are wonderful","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good vacuum but bad for back!","reviewDescription":"Like the vacuum very much; has option for either floor or carpet.  Only drawback is the long cord that must be wrapped around the machine which entails body movement of up and down, up & down, up& down etc., etc., etc!  Not good for a bad back!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Great product","reviewDescription":"I wish the canister was a little bigger but overall the vacuum itself works great and the power is strong!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Decent, but squeaks","reviewDescription":"Straight out of the box the roller or wheels squeaks with every pass","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Great vacuum!","reviewDescription":"For the price it would be tough to beat! It has great suction even with the tools that come with it... It's not to heavy & easy to clean. I'd recommend it to everyone!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Good for per fur","reviewDescription":"It was easy to put together and set up. Was able to do half a two bedroom apartment with a big shedding dog, on one load. Easy to dump container.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Good Powerful Vaccuum","reviewDescription":"This sucks up dog hair from wood floors wonderfully. I wish the hand tool had a longer reach on it, but it still does a good job. Empties easily, and is easy to clean the canister.I like it enough that I bought one for my son who also has a big dog that sheds a lot.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"woks  great but wish it had a bag","reviewDescription":"Love this!  Has great suction.  Cleans up dog hair on carpets .  I just wish it had a a retractable cord . Cleaning out the container is a mess! Hair dust  is sucked up in container yes you can open it up and dump into the trash ,but hair gets stuck on the side of the container and either I have to put an object up the container  to remove the stuck debris or put my hand up in the container to remove the stuck debris .  I like the bag i can throw away much cleaner .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Pretty good, but horribly short cord length","reviewDescription":"The vacuum is actually great. It has really good suction, it's easy to clean, and it's not made out of cheap plastic. The only downside, is the cord length is absurd. It's the shortest cord I've ever seen on a vacuum. You have to constantly search for a new outlet to plug into, which is just plain annoying. Other than that, the vacuum itself is a good buy, although it is now $20 more than what it was just 2 months ago when I bought it for $69.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Short lived","reviewDescription":"It worked great at first but it didn’t last.  Great suction and easy to use but the pet hair clogs up the top of canister.  It broke after just one year.  It’s too big to fit in small spaces.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Inaccessible belt keeps popping off","reviewDescription":"Both times I tried to use this vacuum I sucked up a little piece of fabric and the belt pops off and does not spin any longer. You have to takeoff six screws in order to access the belt and put it back on. once you resume vacuuming try not soaking up anything because otherwise, you have to take all six screws off again. worst vacuum ever","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Eureka joins Shrink Flation industry","reviewDescription":"Have Eureka AS 1008AX, got a freak clog, thought it bit the dust. Took apart fixed it.Did side by side comparison of Eureka NEU 181D and Eureka AS 1008AX.The NEU 181D is lighter, slightly taller. Cord is 104 inches shorter, the hose is much shorter and smaller diameter, useless to use on stairs unless they are barbie size.The AS 1008AX hose will stretch the length of 12 steps. The NEU 181D 6 steps.NEU 181D handle seems flimsy. Suction about the same.Both have a pet turbo brush.Instead of improving Eureka got Cheap.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Doesn't work for non-carpet floors","reviewDescription":"It is an okay vacuum cleaner, however it has a major design flaw - motor air outrun is designed to be in front of the vacuum. It blows away all the dust in front of the vacuum before it can suck it in. Really frustrating every time when I need to clean tile\/plank floors.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"a disappointment","reviewDescription":"I was replacing my Hoover Wind tunnel that had a broken switch after 9 years...Big mistake.  I am 5'8''.The hose on this Eureka is only 32 in long with a stretch of about 6 more inches.  the crevice tool is only 7 in long.  If you only want  to vacuum the floor, it does have good suction.  If you want to reach something high the entire machine tips over onto the floor so no walls or drapes or bookcases can be done.  The hose\/crevice combo is not long enough to reach under cabinets or between cushions and again the machine falls over if you attempt to stretch the hose even a little. The price was affordable in dollars but a fortune in frustration.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Very loud.","reviewDescription":"This doesn’t seem to have great suction at all and it’s extremely loud. I’ve never heard such a loud vacuum cleaner before I wish I would’ve returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"You get what you pay for. Cheap.","reviewDescription":"Sadly, this product is not a durable vacuum and has multiple issues to say the least. The handheld vacuum attachment for your upholstery doesn't work at all. Never has from out of the box. The suction quality is extremely lacking. The motor is just not enough for a standard household. Even on low carpet setting. It doesn't pick up hardly anything. Not only that, the thin plastic that it's made out of brakes very easily, it doesn't have a large capacity and overall just stinks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Doesn't pull hair up","reviewDescription":"This vaccum is ok. The bristles on the brush don't seem long enough to pull up hair from any length of carpet. It works well on bare floors though.  I would not recommend for anyone who needs to pull hair (human or animal) from carpeted or upholstered surfaces.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Not worth it","reviewDescription":"Should have invested in a better vacuum. It doesn’t have enough strength to suck up anything off my carpet or hard floors. It just flings it around!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"don't waste your money","reviewDescription":"I've had this vacuum for just shy of a year and it's already lost suction. I was using it, emptied the tank that wasn't full and then went back and noticed it just kept smearing the hair across the carpet rather than picking it up.I have german shepherds and a cat so I vacuum often, use a carpet rake and also use a carpet cleaner. By the time this vacuum stopped working and I was raking out imbedded hair, it became pretty obvious how little dirt and hair it was actually picking up, despite frequent vacuuming and carpet cleanings. The tank is small and holds less than other vacuums I've had in the past and other than it being light weight, there is nothing special about this vacuum to warrant the price.Unfortunately, this is the one product I apparently didn't get a warranty on, so it's going straight into the trash and I will purchase something that does a better job and actually picks up pet hair.Of all the many vacuums I've had to purchase over the last 7 years, I'm the least impressed with this one considering what I paid for it. I will go back to Bissell or Shark and avoid Eureka. It was my first and last purchase with them.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Don’t ask for customer service!!!!","reviewDescription":"The vacuum itself is fine for the money. It has good suction, maybe too much. The attachments are good but don’t stay put on their racks. THE PROBLEM IS COMPANY POLICY.  I received the vacuum on Dec 07, 3023. By Dec 20, 2023 the belt broke. I called the company for replacement, and although the person was friendly and polite, the company policy denied me a fast replacement on a NEW MACHINE. THEY WANTED: pictures of the broken belt, model number and copy of warranty, written explanation of problem. This is a $3.50 item on a new machine!!!  Really??!!!  I ended up buying the belt myself, delivered the next day without problem. If a company won’t stand behind what they sell, DON’T BUY FROM THEM.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Eureka","reviewDescription":"The suction is great and the smaller size make it fit into tight corners. I did not know it would require taking 6 screws out to get to the brush roller. Not happy with that.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Clogs easily with dog hair","reviewDescription":"If you have a shedding dog like me, this does clog easily. Love how it vacuums and mops all at the same time!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"feels great","reviewDescription":"easy to use picks up everything lightweight , I'm happy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Wood and tile . Floors","reviewDescription":"Don’t have to change vaccums because this does it all","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Nice","reviewDescription":"Nice smaller vacuum. I've used it several times now and it does a fine job. The thing I was bummed about, there are extention pieces for the hose.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Worked good for the price","reviewDescription":"It is better than the last vacuum I had","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Worth it!","reviewDescription":"I’ve had the vacuum for a month now and have an Australian Shepard\/sheepdog mix that sheds ALOT!! This picks up EVERYTHING. It showed me what my old dirt devil wasn’t picking up. The attachments were easy to put in place. I’d recommend this to all pet owners.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Gets stopped up.","reviewDescription":"There is a sharp turn for the dirt to get stuck in before going to the canister.u uasband had to do surgery to get a pen out?  How would it even suck up a pen?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Vacuum cleaner","reviewDescription":"Very good vacuum cleaner. Picks up alot and cleans great. Easy to assemble and to carry. Perfect size, too. The only downside is the cleaning of the filter and gets clogged easily.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"My daughter loves it","reviewDescription":"Gave this vacuum as gift for my daughter and she loves it. She says it’s like a shampoo job when she uses it. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Estupenda","reviewDescription":"Es una aspiradora potente, no estoy acostumbrado a su forma y me parece algo pesada, aun asi, su poder de aspirado es genial y recoge el pelo de mis 2 perros con facilidad, sus accesorios y la forma en que los lleva a todos encima todo el tiempo es genial pórque permite cambiarlos sin tener excusas por pereza de ir a buscarlos, es un poco incomoda de llevar el cable pero no es nada a lo que no se pueda acostumbrar","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"This works like a charm","reviewDescription":"I vacuumed over what I previously did with my old vac. Filled the bag with dirt and hair.This thing works! Really like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Eureka PowerSpeed is awesome!","reviewDescription":"Very easy to put together and use. Has a lot of suction power but still light weight. Switched back to this corded vacuum after trying a cordless for a couple years. Hated having battery die in the middle of cleaning and cordless had much less suction power. This is vacuum is a winner!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Powerful but lightweight and easy to use.","reviewDescription":"As others have stated, I vacuumed a large room with our existing cordless vac two days before this arrived, just vac'd with this and was amazed by how much it picked up that the cordless left behind.  The dust bin is very easy to remove and empty.  Very reasonable price as well.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Fabulous Vaccuum","reviewDescription":"It is super powerful, easy to clean, and lightweight to carry. Best vaccuum I have ever owned!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Me llegó rápido","reviewDescription":"Funciona muy bien  es lo que yo quería","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Great Suction & Versatility","reviewDescription":"Easy to use, great suction, excellent versatility. Great value.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"It's just my opinion,","reviewDescription":"But I think this vacuum cleaner really sucks 😁","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"great extra vacuum cleaner","reviewDescription":"great on our carpet and the tools are great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Works well","reviewDescription":"Works as expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Vacuum","reviewDescription":"Does it's job","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Very Good Vacuum, Until It Wasn't","reviewDescription":"So, this was a solid vacuum for the first two months and then the brush roller quit spinning. It seems like I just got the short end of the stick with this one. I went through manufacturer and they are sending me a refund check. Shame it broke because it was a really good vacuum while it was working, did a great job on cat hair but with no brush roller it's turned into one of them old school restaurant sweep brooms. 4\/5 based on the quality of it when it was working (I understand I probably just got an unlucky one), it was lightweight and did all we needed it to do. Unsure if we will buy another one or try another brand TBD","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"An OK Vacuum","reviewDescription":"This vacuum is just ok. It’s not wonderful (the detachable part is not long-which means you have to bend). The cord is super long which I like bc you can move about the room. It does not clog up at all! Very easy to throw out the dirt!! It has strong suction. It is a nice looking vacuum. It does the job & it’s inexpensive !!! Hope this helped!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Vac","reviewDescription":"Simple and works as it should","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Lots of suction!","reviewDescription":"Eureka Lightweight Upright Vacuum Cleaner. Took a chance on a low priced, but still a Eureka vacuum, and we're not disappointed. Loads of suction, adjustable height from bare floor to thick carpet. Bag-less, easy to empty, on-board tools, and did I say suction? Interesting that tools from other vacs do not fit the hose, since this one is inside, rather than outer fit. A few things to consider: the cord could be another 6 feet longer, hose is rather short, the roller is always on, even when using the hose or on bare floors. But I may have been spoiled by my old expensive vac!  Well worth the price, fast shipping, well packed.  We're happy!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Vacuum","reviewDescription":"It's light weight. Easy to use and carry. I have 3 dogs one being a husky so hair is everywhere. It picked it up with ease. The cord seem short but thats okay. Works really well.Vacuums are so much money to find a decent price one that gets the job done is always nice.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Excellent value for the dollar","reviewDescription":"I received my vacuum today.  Assembly was a no-brainer.  I was very pleased with the quality and power.  I have a St. Bernard and 4 cats and it picked up the hair no problems.2 small drawbacks that keep it from full 5 stars.... the power cord is too short and it doesn't get to the edges the way I had hoped but worked well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Nice vacuum","reviewDescription":"Works great, powerful suction the cord is long enoughEasy to clean for sure just take the tank off clean it and put it backThe tank has big capacity you don't have to clean it everytime you use it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"It's sucks good, but also sucks bad","reviewDescription":"Needed a 'real' vacuum for those times my cordless vacs aren't appropriate--like stairs, cracks\/crevices, under appliances, or cobwebs, etc.Pros: light weight, good suction, dirt cup is easy to release and empty, & has onboard tools. Seems to pick up pet hair nicely.Cons:Power cord is way too short. I live in a small house, but still had to change outlets from one end of my livingroom to the other to be able to vacuum the whole room. Make sure you have an easy to access outlet in every room, or a handy extension cord.The hose is also way too short and extremely stiff. There are no hose 'extension tubes' to give it more length, so above the head cleaning is impossible unless you want to lift the entire unit in the air. Same with stairs--be prepared to lift the whole unit every 2-3 steps.The crevice tool is too short and too fat to be of much use other than in-between furniture cushions or easy to access baseboards and the like. It can't fit more than 3 inches under or between any appliances, unless you move the entire appliance. I expect it won't reach very far under\/between car seats either.If a long hose and useful tools aren't important to you, this may be ok for you, as the suction capabilities are good. I'm going to keep searching for my next vacuum...","isVerified":true,"ratingScore":4,"reviewReaction":"114 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Great Vacuum with Major Shortcoming","reviewDescription":"This vacuum is actually great. It really is. But the shortness of the hose is hilarious. It's nearly useless. It barely stretches from its connection to the vacuum to the other side. It definitely doesn't work for anything further than 4 feet away. Can't clean my vents. Can't clean fans. Not unless I want to hoist the whole machine up on my shoulder. I can't even reach behind my shelves. It's ridiculous. But, for the price, if you don't need any of the attachments to be useful, this is an otherwise great product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Messy","reviewDescription":"Sooooo- for the price it’s fair. You get what you pay for.I should of known this has the twist and Empty receptacle, which they are a pain to empty. They are messy and never go back together easy. Takes few minutes to manage it so it aligns just right to put it back together. It’s LOUD!!!  There’s nothing quiet about it. It’s louder than my vacuum that’s 15 years old🤷🏻‍♀️With that said it seems to do ok, nothing fancy , it’ll get the basic jobs done. Perfect for the office but I’ll be getting a different one for my house. The tool use is a pain and not at all user friendly. There’s no rigid long pole for the tools to attach it’s a flex hose all the way, so your hands and knees when using the tools. Again that’s not ideal. The attachment area to pull out the hose to attach hand pieces is such a pain to use, the swivel doesn’t rotate right and it knocks the canister over. Overall this is a cheap vacuum with a terrible design. I really should return it & get something else.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Broke buy insurance","reviewDescription":"Sweeper quit working only having it two months. Won't spin and won't pick up. Started out working great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Sucks good but no wand for high places","reviewDescription":"Overall, this vacuum was easy to assemble and has great suction and dirt storage capacity. But the cord was very short, there is no wand attachment for hard to reach areas and the floor dial is on the front of the vacuum so you can’t adjust it on the fly. The wheels are made of cheap plastic and they are already squeaky after just one use. The beater bar did get all the cat fur off of my fabric dining room chairs, but I had to stop several times to move the cord as it was too short to even vacuum my entire living room from one outlet. There is a strange hole in the back of the handle, and a sticker that states that the hole is intentionally there, but I’m not sure why! The design of the canister does not allow the vacuum to lay flat and get under the dining room table, as it is rather bulky.It did remove the very fine dirt from the area rug in the living room and overall, it seemed to get the job done, but I am not confident that it will last more than a year.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"This is an OK vacuum...not great","reviewDescription":"This vacuum does the trick and works ok. It seems to be picking up most of the pet hair and dirt that is on the floor.  My issue with it came when I had to empty the cannister.  I have 2 dogs and 2 cats, so there is a lot of fur to be dealt with.  Once the cannister is about 1\/3 of the way full, the fur stops being pulled down into the cannister. It just sits up around the filter and collects.  You have to completely dismantle the cannister to get to the filter, which means that you have to stick your hand in there with all the dirt,  fur, and whatever else you just vacuumed up.  I've owned several different vacuums, and this one is definitely not at the top of my list. I won't purchase this one again.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Not as good as older Eurekas","reviewDescription":"Unlike the much simpler dirt canister on our old Eureka Capture\/ Pet Lover 8852BVZs, the new style \"cyclonic\" dirt canister is very difficult to properly clean.  Any stringy sort of trash can get wrapped around a central hard-to-reach fixture in the canister and requires a wire hook to reach and clean off.  The amount of dirt picked up by this new Eureka Blue PowerSpeed NEU280 with Washable Filter is at least a third less than our old Eureka (motor finally wore out after several decades of use).  The power cord is much shorter and requires us to jockey between electrical outlets twice as much.  Very disappointed; it feels cheap and is unlikely to last more than a few years, but it seems to mirror the throw away mentality of many products (more landfill trash).  Eureka is no longer making a superior vacuum sweeper.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Very hard to maneuver. Gets the dust up but not easily","reviewDescription":"Not as easy to maneuver. I find it hard to use when in low floor mode. $100 more dollars and i could’ve gotten a better vacuum smh. Does have a wooden floor mode. Does clean up cat hair and debris. However i can tell that in about 7-8 months, this vacuum will be trash unfortunately.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Could be a LOT better","reviewDescription":"Im probably being too generous with the 3 star but it’s mostly because i can make the vacuum work for me. The best about this vacuum, and its saving grace, is that long black attachment piece. It works great and if i was rating that part only, it would be a 10\/10. The suction is pretty nice and it gets the job done. Now for the rest of the vacuum, its a different story. Considering i bought the pet one, you would think it vacuumed pet hair, but it does not. And another thing is the amount of dust it blows everywhere. I read other reviews that said it blows air out the front and they were not kidding. Im sure its not the bad if your house isn’t to dirty but for deep cleans it becomes tedious.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"hose placement is poor.","reviewDescription":"it works as it should, but the placement of the hose causes it to tip over OFTEN when you use the hose separately.  the Eureka vac I had prior to this has a hose at the bottom of the machine and that worked much better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"The belt comes off easily when vacuuming","reviewDescription":"I’ve had the belt repeatedly become dislodge and stop spinning the brush as soon as it encountered any type of thicker rug. It does not effectively clean up the mess in thicker rugs on the lowest suction setting designed for the rugs. The product is just ok.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Worst vacuum","reviewDescription":"Doesn’t pick up well spits out dust. Cleaned out nozzles not happy with vacuum","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"Works if you don’t need to actually pick up any dirt. I should have saved my money and just bought a different vacuum. The suction is terrible. I have to go over the same are at least 4 times to have it thoroughly vacuumed. It constantly get clogged. I’m not talking about every once in a while. I mean every 5 minutes. I have used many many vacuums in my life and this ranks at the very bottom of my list.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"PRODUCT DOES NOT WORK","reviewDescription":"After vacuuming for a month once -2 a week the product stopped working, it wasn't great with suction to start, but I have owned two of these vacuums, one for my office and one for home, and both have turned out not to last or work well.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Eureka lightweight power vacuum cleaner over rated","reviewDescription":"Hose is too small to reach under beds, etc. Same is true for attachment tools, which are ineffective. Too difficult to return so will use in basement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Bad for pet hair","reviewDescription":"This vacuum doesn’t suck well at all, it just pushes pet hair to the corners of my rug and leaves huge clumps of pet hair. I’ve been out of a vacuum for over a month now, so there is certainly a build up of pet hair, but nothing I’d expect a decent vacuum to have trouble with. I’m going to give it another chance tomorrow but if not, may be looking for another vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Performance was below par","reviewDescription":"I purchased this vacuum because it was supposed to be good for rugs and hard flooring, but was lightweight.  My old Shark became inoperable, but I was pleased with its performance.  But this Eureka is below par!  Leaves large balls of rug fiber behind, does not suck it up.  On hard flooring it spits out debris from behind so I have to go back and re-vacuum it up.  The handle is so short it won't reach up to retrieve cobwebs from the ceiling.  I am of normal height and have to bend over a lot to complete even a mediocre cleaning.  Would not recommend at all!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Suction powerful I can not vacuum my rugs","reviewDescription":"Not sure what I can be doing wrong as all the reviews seem to be very positive, but I can not vacuum my rugs as the suction is so strong and you can smell the belt burning ..and yes I have tried all the settings. The rug in the picture is an example of the rug I’m trying to vacuum- very thin.  However this does work wonderful on all my hardwood floors","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"It blows dog hair around","reviewDescription":"I would not purchase. I went back Shark vacuum cleaner.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Cheap...","reviewDescription":"Haven't had this thing a full year yet, and the carpet part no longer engages...just hard floor. The beater bar does not turn at all during any of the carpet choices. Also, the bottom cord keeps snapped off. Not worth the money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Light weight to a fault and so so-so design","reviewDescription":"I have no problem with the suction power of this vacuum. two big problems that drive me nuts. first it is light weight, but if you use the hose for attachments or baseboard\/crevice cleaning you must keep one hand on the unit or it will tip over with just the hose extended even a foot. After being hit in the head half a dozen times I don't even bother to use the attachments. Second the exhaust port is below the collection canister in the front and aims down so if you do have pet hair it will blow it all over the place before you can get it sucked up. I have since duck taped a piece of cardboard to deflect some of that tornado  blast. This would be an ok unit for the dorm room to clean up the dumped cereal, but that's about it. Going to  shop for a less frustrating vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687996800000}
{"reviewTitle":"Not very good suction","reviewDescription":"While I will say this is much more lightweight than my old model, the suction isn’t great and a lot of air blows out pushing dust and fur away from the vacuum, even on the lowest setting. The tools don’t work very well, and are kind of difficult to maneuver. The tube for the tools is the main form of suction for the whole vacuum and has to be reattached to the base and it often pops off so you will randomly loose suction and then realize the hose is out. I miss my old pet vac, it lasted for years and years","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Get what you pay for","reviewDescription":"I read reviews before purchasing, but decided to take my chances anyway. It does definitely feel cheap, but it IS cheap, so that's fair I guess.My biggest issue is that hose isn't part of the detachable wand. The product video made it look like you just detached the wand to get into crevices or at the ceiling or whatever, and then just pop it back in. However, the annoying reality is that you have to detach the hose from the vacuum base, secure it to the wand, detach that, use it, and then reverse the process. So it's not like you can simply whip it out as you go along, it's a whole procedure.The suction does seem to be very powerful, and that's the saving grace of this machine. I did not find the power cord to be too short, as some reviewers complained; and as for it getting in the way since it comes out of the base, I simply hold the cord up in my hand that's operating the machine.It's not a great vacuum, but it's okay and that's good enough for my basement.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"Came with a great recommendation--from a site that gets a commission!  :-(","reviewDescription":"It's just average.  What really sucks (haha) about it is that this hot air (like an exhaust) blows out from the top on the front of the flat part (hope that makes sense).  Blows dirt around.  Very frustrating.  Hard to push and not as lightweight as they made it sound.  But it was only $85.00.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Just okay! Has a high pitched whine that's terrible.","reviewDescription":"The high pitched whine is hard to handle. May return. Would definitely NOT buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Blows out a lot of air, hose falls off quite a bit","reviewDescription":"LOVED it at first, love the large canister to hold the dirt, I got it because I have a cat who sheds like crazy, and while it does suck it up, it BLOWS air out of the front blowing the cat hair all over the place which kind of defeats the purpose of what I need it to do","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Great Power","reviewDescription":"For the price the Vac has great suction power.  However, using the reach hose w\/out additional attachments will cause the Vac to fall over during use and there is a high-pitched noise the Vac makes during use.  Capacity is large which is good so you don't have to empty it often during use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Just a few minor issues","reviewDescription":"Just unboxed and used this vacuum for the first time today. Bought it for the upstairs carpet as our Dyson, only 2 years old, is suffering battery failure on high setting. Decided we needed a corded vacuum so we could complete more than half a room at a time! The reviews were good and I agree this is a powerful little vacuum for the price. I was AMAZED buy the amount of dust and hair it picked up in a small area. Gross. I’m can’t believe we have been living with that! Just a few points.1\/ Took me a while to locate the power on. I know, I should have just run downstairs and looked at the manual but I though it should have been obvious. You really have to look closely for the symbol but it is in a good place for a foot operated on switch. It would have helped if the symbol was colored as well as embossed.2\/ the attachments kept falling off the vacuum so I’d have to stop and pick them up.3\/ I pulled the hose to attach the brush attachment and a bunch of dust flew out onto the floor, which, thankfully I have a good vacuum to clean up. This happened each time I went to use the hose.4\/ the machine is so light it falls over easily. I hope it doesn’t break5\/ the release for the dust container is super easy but when I went to empty it I had to dig my hand up in there to get all the yuck out! It did not just fall effortlessly into the trash can. Now I few like I need a shower. Probably got stuck due to my long hair getting wrapped around the center cylinder. If you have short hair you will likely be fine.So overall, it is lightweight, has great suction and easy to use, but has those annoying little quirks that you probably get with most corded vacuums. Great value for the money.","isVerified":true,"ratingScore":3,"reviewReaction":"42 people found this helpful","country":"United States","date":1680480000000}
{"reviewTitle":"Too many belt replacements.","reviewDescription":"This is a great product for floors, it has great suction and cleaning power. However, if you vacuum any small rug or such the belt breaks quickly. This version without a belt would be amazing! But for a rug person it is just too much trouble.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"EXAGERADAMENTE RUIDOSA, PESADA, NOS ASPIRA TAPETES PELUDOS","reviewDescription":"El producto se ve de muy buena calidad, aspira muy bien, pero es EXAGERADAMENTE RUIDOSA, como el pedestal solo tiene movimiento vertical y no horizontal se hace muy pesada de manejar, por otra parte, en mi apto tengo tapetes altos que son peludos, no los aspira el rodillo se enreda.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"It's just ok.... Turbo Pet feature is a gimmick","reviewDescription":"It has powerful, good suction!!. Easy to handle. Lighter than my Bissel. The cord is long.However if you want to use the attachments, the suction hose is too short, so the whole machine just tipps over. Very annoying and cumbersome.I tried using the \"pet turbo\" attachment. Forget it! It's impossible to use it - the suction hose is very short. the entire machine just tipps over, you struggle to somehow get to use that turbo pet attachment! Huge machine on the floor, you on all four trying to somehow..... forget it!!  It's a joke! I looked like Lucille Ball in I Love Lucy!! Hahaha.  Plus it doesn't do anything.My suggestion - the pet turbo thing is just a gimmick! There is an exact similar vacuum for $79. Get that one. This one is $89. You pay an extra $10 for a gimmick that doesn't do anything.The machine otherwise is good. I will keep it.  Just wasted an extra $10. Oh well...","isVerified":true,"ratingScore":3,"reviewReaction":"19 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Not Bad For Price","reviewDescription":"Just received this item and have to say I'm impressed on how well it picks up. I really like the way it cleaned up the bare floors as well.  HOWEVER there are a few drawbacks that had I  known before buying, I probably would have a chosen a different model. 1. This item does NOT come with an extension wand for the hose and the hose on this is very short to start with. So if your planning on using this to reach higher places-it's not happening.  2. The cord on this is shorter than most of my other vacuums.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"vac","reviewDescription":"Okay for the money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Product not what Amazon described!!!","reviewDescription":"The product is fine.The problem is Amazon and same issue several times!!Your product description says it is wet\/dry vacuum, IT IS NOT.It also says that I would receive a pet tool and extra filter, DID NOT RECEIVE.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Mistaken as pet cleaner","reviewDescription":"Wrong purchase. Needed a pet cleaner constantly get clogged. Requires deconstructing vacuum cleaner to remove dog hair. Maybe good for people with no dogs","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Eureka's cheapest vacuum ever.","reviewDescription":"I bought this because of the low price but still assumed high quality from Eureka. NO. It is very light, and its features are almost non-existent. The hose has to be moved from the base to the wand, the exhaust for the air is in the front of the vacuum and it blows dust all over the place when you're trying to clean. Worst of all, the belt broke in the first 2 weeks, and I had to order more (they're not very expensive or hard to replace, but that's not the point). We're going to order a \"real\" vacuum soon and keep this as a spare. Would not recommend.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Works ok for the money","reviewDescription":"Not a great vacuum by any means. Hose attachment is weird and not at all lengthy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Great power for value but terrible maneuverability","reviewDescription":"I understand this is not a swivel steering, but something in the wheel\/operating system is flaw. I have hardwoods with rugs and it refuses to be pushed in certain directions, my guess is opposite of the grain of the weaves on the carpet. I previously had a stick vacuum shark that had absolutely no trouble doing this. I would not recommend for people in my situation, stick to stick vacuums or find one thats self propelled.This thing has extremely strong suction though,  purposely purchased this due to its higher amperage and it did not disappoint in that field.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Good price","reviewDescription":"Dislike trying to remove the dust part, says once a month.. friend looked, it has to be disassembled, good price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Shorter hose","reviewDescription":"I do not like the shorter hose on this model.  We have an older bagless Turbo Eureka that is very similar to this one but the hose is longer.  When using this newer one you cannot use the attachments to vacuum anything that is more than one foot from the machine.  Every time I tried to vacuum something behind a chair or under a table it would fall and hit me in the head.  I do not like this one and cannot recommend it because of the shorter hose.  It did work very well on vacuuming my carpet but it's not good for using attachments on anything else.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"This is second, Used Good Condition Eureka vacuum I received, first I returned. This one is better.","reviewDescription":"Handle does not click in and stay fastened, but at least this one works otherwise. The first I ordered smelled hot and made bad noises. On the plus side, it seems to do a fine job on our short office carpet and bare floors. I can't complain for $40 and fast delivery!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Convenient, lightweight, and easy cleanup","reviewDescription":"I’ve tried uploading it being vacuumed on different surfaces but it seems like it doesn’t let me do that here. Anyways, from first glance and appearance it can be stored easily in small spaces, it lives in my closet and because it’s so compact, I’m able to place it anywhere in my house without it being in the way or that I even remember that it’s there. It’s much more lightweight than other vacuums I’ve tried out.I have kids so with the messes they make and the crumbs they leave, this vacuum makes heavy duty cleaning a much simpler task. I have 2 long shag rugs and this vacuum on the carpet setting will pull up dirt along with the crumbs that are on it, it does wonders. Then when I put it on the bare floor setting, I can do the rest of the floors no problem. The one gripe I have about it though is that even on the bare floor setting it will blow air sometimes when I move it along the floor, pushing debris away from vacuum slightly, but it’s not to say it isn’t a strong sucker, it sucks well.Clean up of it as well after I am done is quite easy. I just push a button and the dust\/debris falls out easily. I am able to dump in the trash without manually removing with my hand. Other vacuums that I’ve tried that have a built in filter and no bag, I’ve always had the experience of having to remove the trash with my hand. Also cleaning it is easy. I just take it apart, wash with soap and water, scrub dirt away and let it air dry, and it will look new.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Pretty good!","reviewDescription":"I love this vacuum. I have two pugs and a cat so I have to vacuum every day but this thing picks up a decent amount of hair. I also use it on my kitchen floors sometimes when I'm too lazy to sweep so it works great on all flooring.My only criticism is the attachment features. When I take the handle off, there's some moisture trapped in the compartment for some reason. My vacuum is sitting in a dry corner of my hallway so idk how that could happen. Also, if you're using the hose, the vacuum smells a little smokey for sitting in one spot. It's nothing to be concerned about, it's just a weird smell.However, despite all that, it picks up everything, including fine kitty litter. I still recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Good purchase","reviewDescription":"In terms of usability, the Eureka Vacuum excels. Its lightweight design and swivel steering allow for effortless maneuverability, navigating around furniture and obstacles with ease.With its array of attachments, including a crevice tool, upholstery brush, and dusting brush, it transforms into a versatile cleaning companion capable of conquering every nook and cranny of the home. Whether reaching high ceilings, tight corners, or delicate surfaces, these attachments make quick work of even the most challenging cleaning tasks.the only drawback i found was that the cord length was too short.. but other than that highly recommend","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"OK as a basic vacuum","reviewDescription":"This should not be considered as the only vacuum for your house. It has excellent suction for cleaning carpets. However, the vacuum hose is rather short and stiff, making it of limited use for overhead cleaning. Additionally, because of the light weight, the vacuum is prone to falling over when using the attachments. The attachments are not very robust and the crevice tool is very short and stubby, making it of limited usefulness. Being a low cost appliance, there is no light on the front of the vacuum and the beater bar doesn’t shut off when using it on hard floors. This allows debris on the floor to be blown away due to the air flow created by the beater bar.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Careful taking out of the box","reviewDescription":"This is a great vacuum too bad it's held together by a small piece of plastic which I broke trying to get it out of the box","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Vacuum","reviewDescription":"Easy assembly, great price for a great vacuum.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Eureka vacuum","reviewDescription":"I like the vacuum. It does a good job. The only problem I found is that it is difficult to close the dust cup lid after it has been cleaned out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Turbo brush not very effective","reviewDescription":"I think this vacuum is good and does great in my hardwood floors with lots of power. The attachments work well with the exception of the turbo brush. This is the attachment I really needed. Used it on my couch (have a lab) to remove any dog hair even though she doesn’t get on furniture. I assumed the rotating brush would help but it does not spin if apply any pressure. So pretty much just a suction as the other attachments. So if u want a spinning brush attachment I’d suggest another brand.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"OBSESSED IS AN UNDERSTATEMENT","reviewDescription":"I have tried EVERY FREAKING VACC that is supposed to be for “small spaces, and lightweight” other than the viral Dyson because let’s face it… i’m just not gonna pay that if its not the best. But i got this on a deal, read the reviews and WOW i am so glad i did. What my other 5 vaccs didnt pick up even my parents OG dyson… this baby did. I wanna clean everything lol.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"Good, standard vacuum cleaner","reviewDescription":"The Eureka Lightweight Powerful Upright Vacuum Cleaner works well, very good suction & is a good standard vacuum cleaner.  Gave 4 stars as it doesn't have headlights nor swivel feature (as my former one did) but really needed one & can't get a more expensive one at the moment so this one works fine!  Would recommend if you need a decent vacuum cleaner for a more affordable price.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Vacuum","reviewDescription":"This product is very heavy especially carrying up & down steps. Performance is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Nice","reviewDescription":"Super","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Average vacuum cleaner.","reviewDescription":"I replaced my Bissell with this Eureka. The Bissell cleaned deeper in the carpet than Eureka.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Gets the job done well enough","reviewDescription":"After about 2 months of use, this vacuum is holding up fine and has decent (not superb) suction.  The bagless feature works well, and the on board hose and tools are convenient. The tools sometimes fall off their spots.  Don’t bother buying the “pet hair” small brush attachment—it’s only air and thin rubber band driven and stops as soon as it meets resistance.  The rest do the vacuum works fine—we have mostly hardwoods and a low pile area rug.  The vacuum is a little louder than our last one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Great! Suction is almost too strong!","reviewDescription":"Love this for low pile area rugs and stairs! And love the attachment for cleaning the car interior.Only drawback. The vacuum suction is so strong, it will suck up and mangle anything that is not fully secured to the floor. For smaller or high pile rugs you will have to use the hose with attachment.  My previous Eureka allowed me to vacuum rugs without trying to eat them (when on high carpet setting).","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Great","reviewDescription":"Love it, very powerful.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Powerful, efficient but a bit too noisy","reviewDescription":"For my home with both wooden floors and low carpeting. This is a handsome piece of vacuum, well worth  the price of $79. Easy to push around and switching between types of flooring is easy. I've had this since January 2023 and use it regularly for the entire 1000 square foot house. So efficient that you're done before you know it: 25 minutes and my floors are clean as a whistle.WHY 4 STARS AND NOT 5: Well, it is powerful (which is good) and so the machine is a bit noisier than I like. Put on your ear phones and play some early Miles or Beethoven. The only other irritation is that it's hard to unwrap and rewrap the conveniently long extension cord. Other reviewers have also pointed out the bottom notch to wind the cord around is behind the loop of the suction tube. Difficult to wrap or unwrap the extension cord. I'm used to it now - hold the suction tube a few inches away.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Great value","reviewDescription":"It works fine but lacks the cord retracting feature of our previous Eureka.  Cleans very well.  Great value for the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"So for 75 dollars this does the job okay.","reviewDescription":"There are definitely some cheap design elements in this but also you get what you pay for decent on carpet could be better on hardwood and laminate -  seems to pickup a good amount I need to change the receptacle for dirt every 3-5 uses. Also it seems Like if you don’t keep at least one wrap of chord around the back the cable is prone to getting caught under the wheel this is frustrating and caused me to fray the chord slightly.  I repaired with electrical tape. Still if you need a vacuum and you’re in a smaller space this is a definite go. Especially if you get it in 3 no interest payments from Amazon as I did.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"A lot of power easy to clean","reviewDescription":"It picks up well, wish the hose was a little longer but it does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Second time purchasing","reviewDescription":"The last one I bought lasted 7 years :) it’s a sturdy and durable vacuum","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"works great","reviewDescription":"way better than my hoover. deep cleans carpet and weighs far less. easy to push.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Save yourself thousands! Get this! 😍","reviewDescription":"The vacuum is INCREDIBLE. Listen I’ve been using a Mi*** vacuum for the past several years. Recently I purchased a Water filtration vacuum (you know the one that starts with an R and costs about $2,700.) when my old one bit the dust. Although I must say that yes it cleans well and the filtration is unparalleled…IT’S a PITA to use! I have two Dogs a chihuahua and a German Shedder, so I must vacuum almost daily. The other one is better for deep cleanings and when you have the time to really use it to its max potential… but for use everyday? It’s too much. Thats where this Eureka power speed came into play. I wanted to spend around $100 for a “daily driver”. I received this today and was super excited to put it together and get her purring. WOW JUST WOW. I literally vacuumed yesterday and the amount of dander, dirt and sand that this vacuum cleaner pulled out in a 5x5 area of carpet has me questioning a lot of things. First of all where did all this come from? And why did my EXPENSIVE vacuum not get it!?! I could have saved SOOOO MUCH MONEY. needless to say I’m in love and my neighbor who thinks that our other vacuum is amazing will be inheriting it in the morning! EUREKA! they have really SUCKED ME OUT OF THE WATER! (Pun intended) please get this vacuum. You won’t regret it.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Best vacuum ever","reviewDescription":"I love this vacuum. It made of quality material, it is easy to use. Easy to put together. It does a wonderful job cleaning my carpet and wood floors. It is not too heavy, light enough to move vacuum with ease.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Wonderful little vacuum!","reviewDescription":"This is such a handy little vacuum! Lightweight, easy to use, all gadgets fit right on the machine so they are handy when you need them! Would buy again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Excelente producto  me  encanta","reviewDescription":"Me encanta  su funcionalidad  lo único  que  no me gusta es que se calienta  cuando  ya tienes unos 10 minutos de  uso","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"WOW","reviewDescription":"As if there aren’t enough good reviews of this product… I’ll leave one more. This was the canister after vacuuming *1* bedroom which I *thought* was clean! We had just vacuumed a few days prior. We have a dog and two cats all of which spend the majority of their time in this room. I am so surprised at how well this vacuum worked considering the price!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Great vacuum","reviewDescription":"This is a great vacuum for pet hair. I had a carpet covered in cat hair and this cleaned it up quick. Powerful . Easy to use and put together. Emptying trap is easy too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Awesome vacuum","reviewDescription":"I did not realized I ordered the wrong vacuum until it was delivered. I am very happy I did not send it back. I vacuum my entire townhome and cleaned out my ducts. This vacuum is light and very easy to use. Do not pass up on this beauty!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Lighter weight vaccum that still picks up pet hair and excels in deep cleaning thick carpet","reviewDescription":"I was more than pleased with the ease-of-use of this vacuum. Does extremely well on both thick and thinner carpet. The uphostery attachment  did an excellent on pet hair on the furniture. Price is more than reasonable for such high level performance.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Easy to assemble","reviewDescription":"I have always had Hoover vacuum cleaners. When my Hoover quit I looked at product reviews and the Eureka seemed to be the best bet for the money.The suction is very good. It was simple to assemble. It is very similar to the last vacuum I owned. The cord is long, although I would prefer an automatic cord winder. Unfortunately, this vacuum is all made of plastic, which everything is now, but I am very pleased with this Eureka so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Not a bad vacuum for the price","reviewDescription":"I bought this vacuum on PRIME day. and I love it. the only down fall is the pet attachement head. you have to hold it at a weird angle to get it to work and when you do that it tends to fall off. but other then that my whole house it tile and it works great. GREAT BUY  when you dont want to spend a lot of money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Will take a little getting use to but should be okay....very, very, very loud","reviewDescription":"I think it will be fine once I get use to using it....I had my previous vacuum cleaner for over 20 years.  Also, it is very loud but I will get use to it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Good for the price","reviewDescription":"We've had Dyson's and Shark vacuums in the past. This model Eureka is not on that level of quality, however for the significantly lower price it works just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723593600000}
{"reviewTitle":"Impressive, little vacuum cleaner, lightweight, and affordable","reviewDescription":"I was originally looking to get a Dyson or something comparable but didn’t want to pay the Dyson or top-tier price on a vacuum. I use the occasionally, this one popped up, decided to go for it, and could not be happier with this little vacuum cleaner. Only drawback is The short hose does not have much flex. Other than that, it’s great for all lengths of carpeting and Bere floors.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Powerful Suction","reviewDescription":"I bought this vacuum to replace my older Eureka vacuum that I had for many years. This vacuum is lightweight & has a powerful suction but the cord seems a bit shorter & it does not have an auto-coil cord holder, which was one of my favorite things about my older model. Overall a good vacuum.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Great value for price","reviewDescription":"This vacuum works amazing for the price point! We have used it in carpet and kitchen tiles. The suction works really well and we don't need to sweep the kitchen floor anymore. Very lightweight. However, the cord isn't too long, compared to our previous one. Also you have to be very careful with the wire because ours has totally started chipping off in several places within a couple of uses. The wire on it is not good quality or sturdy so exchanging it for a new one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"light","reviewDescription":"light, nice recommend","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Exhaust in front \/ good suction","reviewDescription":"The exhaust on this vacuum is in the font just above the floor piece. What that means is that unless you have the vac reclined a good bit, everything you want to vacuum is blowing away in front of it, like cat hair and litter. The hose is not 7 feet long. When I use the hose and attachment head to vac cushions the unit is right next to you and falling over. The attachments fall off constantly while using. On the plus side it does a good job on carpet and its easy to dump the dirt from the canister. BUY the replacement filters for the top of canister now as you will use them.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Good value vacuum","reviewDescription":"I like this vacuum a lot. It was easy to put together and does a good job cleaning the floors. I do wish that the back would lower down more to get further under furniture.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"This Vacuum Sucks Hard","reviewDescription":"This vacuum sucks...but in a good way.  Replaced a 15 year old Dyson with this Eureka (didn't want to spend 5x on the Dyson).  I don't ever recall my other vacuums with this strong of a suction.  It catches everything my family drops in the carpet.  It's also lightweight and easy to maneuver.  It could use a longer power cord but that's a very minor issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Great product","reviewDescription":"I am usually a Hoover buyer, but didn’t have a lot of money to spend. This vacuum has great suction ability. The pet turbo attachment actually works after 5 minutes. Cord is long enough and I had seen people don’t think hose is long enough when you use attachments.  I think it does the job. I am pleased. Only  down fault  is canister and everything else besides tube for attachments is very lightweight plastic. Also you have to be careful on how you pick it up by handle on canister","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724112000000}
{"reviewTitle":"Great deal","reviewDescription":"Perfect size. Perfect weight. Strong suction. Gets pet hair up really easily. I have mostly hard, concrete flooring then one room has carpet. It cleans all of them really well. The cord is long so I don’t have to move the plug too much. Very good quality for such a cheap price. Really versatile from hard floors to carpet to using the extender to reach hard places.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Wouldn’t believe it if I hadn’t seen it!","reviewDescription":"Now be skeptical if you want, but I read reviews and decided it was worth trying. I have a German Shepherd who does serious shedding. Hair everywhere, all day everyday. This vacuum IS A BEAST!! Unbelievable amount of hair vacuumed! If you are on the fence I recommend buying, you won’t regret it! I have an Electrolux, but wanted something less bulky to be able to use regularly. I’m just shocked by how well it works! You won’t be disappointed!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Cleans sooo good","reviewDescription":"So I believe in vacuuming often like ..everyday and I have had a shark but moved and wanted to try a new brand and I vacuumed with the shark and this thing got up SO MUCH MORE .it cleans super good ,easy to use and perfect size ,it doesn’t clog up and gets deep into the carpet ,the picture is of what the shark left in the living room then I immediately used this one to test it to see if it would pick up more and the picture speaks for itself","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Amazing!!!!","reviewDescription":"By far the best vacuum! Super easy to use! Easy to clear. The size of it isn’t unbarrable. It doesn’t take up to much space. I love the versatility! I can use it on carpet, hardwood and walls! Yes I said walls! The cord could be a little longer but it’s not terrible in length!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Works great.","reviewDescription":"I don't have a lot of carpet in my home. My old vacuum just want cutting it so I bought this one. This works great.  So good in fact that silly me didn't adjust the setting and had it set so low that it sucked up the strings of my carpet and I had to cut it off. That was my fault though. Point is it works on wood floors or carpets. Had a long cord that in didn't feel the need to keep searching for the next outlet to plug it in. Light enough to carry up and down stairs. Easy to empty canister. Had a nice holler to wrap the cord back up on. My only problem is that one of the accessories that hooks on at the top sometimes falls. But that's not a deal breaker just got to put it on just right. I would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Incredible Cleaning Power","reviewDescription":"I LOVE this Vacuum ! I can’t believe it’s power. Cat hair, cat litter, etc! All gone! It is the vac I wish I had years ago. I’m actually glad my old one died. This new one will make my life easier saving time and effort.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Gets the job done","reviewDescription":"This vacuum is a powerful little guy. I love not having to sweep my floors before mopping. It has zero trouble picking up all the dog hair and mine for that matter. Best part is it’s light weight and my kids like to vacuum now.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Wow!!! Fantastic!!!","reviewDescription":"Man this vacuum rocks!!! I just got it. Put it together, and used it. It picked up a ton of stuff my old vacuum did not!! And so light weight! Just so happy with it! You won’t be sorry buying this for sure!!! 👍👍👍👍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Sweeper","reviewDescription":"I thought it would suck better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Vacume cleaner","reviewDescription":"So noisy vacume","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Would not purchase again","reviewDescription":"This vacuum is strong and it does vacuum well. However I've had so many issues with it since buying it, bands breaking , not normal noises etc... I would never buy it again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Feels cheap","reviewDescription":"Made out of plastic.  It feels cheap.  I hope that it holds up. I wish that it had cord rewind. The cord could be a little longer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Not as it states","reviewDescription":"Not lightweight at all.  The hook to connect to the front of the sweeper to hold an attachment is missing.  The suction is not that strong.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Very hard to clean dust out","reviewDescription":"And harder to put back together or contact them. The size and suction were nice but i had to trash it. The dust cup would not stay in place either.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Too Noisy","reviewDescription":"I ordered one and I thought it was damaged because it was too darn loud. So, I had it replaced for one more of the same model. I got the second one and it is as loud as the first one. It works GREAT, it does what it says it will do and it is super light. I will be sending the second one back also.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"It's a professional vacuum","reviewDescription":"This vacuum is larger than expected and appears to be very good for professional cleaning.  It's not the type of vacuum you would take out to pick up crumbs or small items\/touch ups.  It is for big jobs.  I am average in size and weight and found this vacuum to be much heavier than described.  Very clumsy for stairs.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Treat gently - easily breaks!","reviewDescription":"I use this vacuum for wood floors and area rugs. On the plus side, it is lightweight and easy to  push. I like how convenient it is to empty the collection canister and that I don't have to deal with vacuum bags. On the downside, it is so lightweight that when you go to use the hose, the whole vacuum falls over. The hose does not stretch as much as I'd like and could be longer. It can be very frustrating trying to vacuum when it is constantly falling over. The reason I gave it 3 stars, though, is that after only 2 months of using the vacuum, the rotating brush was cut by a string that had unknowingly gotten caught around it. I have never had a string cut through the plastic on a vacuum (see photos)! At least I was able to easily  replace the part by ordering it on Amazon. It does make me suspect that it might be a common problem, though.","isVerified":true,"ratingScore":3,"reviewReaction":"17 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Not ideal for detailing","reviewDescription":"The floor brush doesn’t stop spinning when the vacuum is upright, which is extremely inconvenient.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Great vacuum overall!","reviewDescription":"I have 3 cats and I own a Homeika Stick Vacuum, it is great on hardwood but doesn’t work on carpets at all and with it being summer my cats are shedding a lot. With 3 passes over my area rug you can really tell a difference! This vacuum has so much suction and works on hard wood, and any kind of carpet. So much suction that my small 2x3 carpet doesn’t stay in place when I vacuum over it. Definitely not a deal breaker though. Has so many attachments and dirt bucket is huge. Cord is very long and vacuum is not too heavy. Highly recommend if you have pets and carpets!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Powerful…..","reviewDescription":"Love this vacuum.  Very inexpensive but works great.  Dog hair is an issue and picks up very well.  However, I did receive one more attachment than there was a place for it and no real diagrams to help.  But I looked as did my husband and no where that works.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"This vacuum sucks! In a good way!","reviewDescription":"Purchased this to replace an older model that gave up with a snap and a blue spark.  This new one is lighter, less noise, better design and bigger wheels.  Works great, sucks up everything that’s in front of it.  I currently work at a construction site and it has no issue with the debris off my work boots at the entry way.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Works great","reviewDescription":"I was concerned that for such a good price that it would not work well.  I was wrong! It does a great job on all my floors. I have a huge hairy German Shepherd and it sucks it all up! Great for a very reasonable price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"BEST VACUUM EVER!!","reviewDescription":"I use this vacuum for literally everything! The quality is absolutely amazing. This vacuum has great suction power and ZERO clogging. It is very easy to use and comes with many different connections for the vacuum. Can be used for carpet, hard wood floors, in between cracks, on furniture or even in the car. I am just amazed as to how great this vacuum is!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Eureka power Pet","reviewDescription":"Great little vacuum cleaner, very light weight, Long cord. Everything in accessible on board the vacuum. Powerful suction and easy to maneuver. I would definitely recommend this vacuum cleaner.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Works very well","reviewDescription":"I have a expensive shark and roomba.  I bought this for my parrots room.  It is very impressive.  I would recommend and feel its a really good deal for the price point.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Does exactly what I want.  Has ability to go from deep shag to hardwood.","reviewDescription":"My shark had a hard time with the deep carpet, that was my only complaint, but it was enough to drive me to purchase this.  This machine isn't really super light, but I tell you it really takes care of business on the first floor and the shark has been changed into the \"second floor and stairs\" vacuum.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Easy to set up and use, does the job well","reviewDescription":"I was surprised by how easy this vacuum is to set up and use even without looking at the guide, and also how efficiently it cleans an area. It really does pick up a ton of dust. It does not have the best maneuverability if you are looking to clean tight spaces, but I feel the attachments can adequately adapt to this issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"A Wonderful BEAST!","reviewDescription":"I bought this vacuum about a year ago. My daughter \"borrowed\" it and I finally said \"just keep it.\" So I  went straight back to this one! It is by far the best vacuum cleaner I have EVER owned. I am 73 yrs old. I've owned them all. They don't compare to this one. Look how much pet hair and dirt it picked up with a few passes over a 9'X12' low nap rug! The engineers and instruction writers are on point with the assembly! So easy, I quickly put it together by myself. (I'm a single retired woman.) Kudos, Eureka! Not only would I buy it again, but I DID buy it again! Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Works great for pet hair on furniture","reviewDescription":"It works great, the only negative is that it's incredibly loud.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Superb Upright!","reviewDescription":"I've been through way too many vacuums (they certainly don't make them like they used to) and every style from rechargeable stick vacuums,  dust busters, cannisters, to uprights for carpeting, and this one is by far the best! I've tried other upright vacuums for hardwood floors, and they didn't work as well as they did on my carpets, but THIS one works phenomenal on my hardwood floors! The powerful suction is absolutely amazing! Way better than stick and canisters!! I have 4 cats and 2 dogs, and the hair that this Eureka Pet Turbo picks up is beyond amazing! I do clean it out after every use to make sure that nasty stuff doesn't stay in the cup, but that is super easy to do! Just hold it over my trash can and release! The reason I gave it 4 stars instead of 5 is that the vacuum is not very sturdy when using the hose\/attachments. It tends to fall over very easily, but with a little maneuvering to keep it sturdy, the suction makes up for that. I vacuum my floors pretty much every day, but I also put on the brush attachment and do my dusting too! The Eureka Pet Turbo is a must have if you have pets!","isVerified":true,"ratingScore":4,"reviewReaction":"36 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Picks up very well","reviewDescription":"It is a little noisy but nice and  light","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"This Vacuum cleaner Sucks! In a good way!","reviewDescription":"I finally gave up on my Dyson.. And took a chance with this cleaner. And I couldn't be MORE pleased. I'm obsessed with vacuuming now. I always felt like my carpets were dirty even after vacuuming. And I was right! My pictures are AFTER vacuuming with my old Dyson. Filled the canister 3 times just for the living room. And my Shag is back!! It's not a matted up mess like it was! Highly recommed this vacuum. No it doesn't have a huge reservoir and the hand tool hose is worthless. But for the money and what I got it for is right on.","isVerified":true,"ratingScore":4,"reviewReaction":"36 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"It sucks great haha but it’s loud and bulky.","reviewDescription":"I am pleased with the cleaning ability, the size of the rubbish container and the ease of the attachments but it doesn’t go under our cabinets because it’s a bit bulky. Don’t get this it you want the ability to go under beds and things easily.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Vaccum Cleaner","reviewDescription":"It is ok for now","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Perfect for my apartment.","reviewDescription":"I had originally purchased an Amazon brand vacuum for the compact size a little over a year ago and the thing just sucks...or didn't suck and that was a problem so after seeing the reviews I went with this one.Assembly was very straightforward, took less than 5 minutes and didn't even require the extensive owners manual they provided.  This thing works great.  My apartment carpet looks as good as when I moved in, and I have a cat that sheds constantly.  The large bagless collection tank is nice as well; about twice as large as the former one I had.The only thing that could make this vacuum better is if the detachable hose was about a foot longer.I'm very pleased with this product!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Cord gets in the way.","reviewDescription":"This vacuum has a lot of suction and does a good job of picking up cat hair.  The cord is nice and long.  Too long for some jobs but you can't unwrap part or the cord.  The cord is hinged on the top of the motor so you end up running over it.  It should be hinged part way up the handle.  The motor blows air out the front of the motor and it blows any loose papers  on tables or sofa around the room.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Good budget vacuum cleaner","reviewDescription":"On bare floors, there is so much suction going on that it blows some of the lighter debris around instead of sucking it up.  Several passes to get all of it.  Works great on carpet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Very good for the price","reviewDescription":"Highly recommended. Fairly light and easy to handle. Cleans carpet and flooring very good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Pet Hair Magnet","reviewDescription":"I LOVE this vacuum! I have two cats and they are constantly shedding and when I used this for the first time, I could not believe how much hair and debris it picked up that my old vacuum left behind. Very good suction and bag less to. I emptied it three times after vacuuming my apartment! I highly recommend this vacuum - especially if you have pets. I would give it ten stars if I could!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Love the pet hair attachment","reviewDescription":"This vacuum really gets up the dirt and pet hair. Has great power. Easy to push. Love all the on board attachments. For some reason the small oval brush opening is too small and it doesn’t fit on board like all of the other attachments. This is my first Eureka and love it. I won’t buy a dirt devil ever again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Great vacuum","reviewDescription":"This vacuum picked up more kitty fur from my carpet than what I ever realized was on the floor.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Powerful little vacuum, buy it!","reviewDescription":"Perfect price, great vacuum for hardwood floors and carpet with dog hair and dust. Don't hesitate buy it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"GREAT GREAT GREAT","reviewDescription":"Back in the day, and yes I'm old enough to remember, they used to sell you vacuum cleaners door-to-door and some guy in a suit would knock and there he would be with this artillery looking unit with 8,000 attachments and they would try to sell you vacuum cleaners that not only clean floors but pureed fruit, steam cleaned curtains, sharpened knives, but nowadays things are very different.Nowadays people buy a vacuum cleaner they use it and abuse it and eventually it quits working, and there's no retirement program for old vacuum cleaners so coming from our world of toss it out and get a new one, it was time for me to get a new vacuum cleaner since we have a German Shepherd and there is hair everywhere.I recommend this vacuum cleaner because the front end brushes reach closer to the floor and carpet and grab everything in sight. It has the no bag system so you unclick the chamber open it up and dump everything out. This vacuum cleaner has tremendous suction. It has a great front end brush. They're really cool feature about this vacuum cleaner is the handle comes off and you have an extended hand vacuum cleaner and you can slap on the attachments as well. As I'm vacuuming I can pull the handle and vacuum the hair off the couch suck up the dust in the corners and grab a few cobwebs on the wall. As a sidebar I wish to note that although I use this vacuum cleaner a lot my house is clean and it's not as dirty as I'm making it out to be but but I am pointing out that this little unit was very affordable less than a hundred bucks and it works better than some of the other fancy more expensive vacuums that cost a fortune.In closing I also want to add that you can easily take this thing apart and clean the inside the brushes to the point that it's working at a new level again.Highly recommend this vacuum cleaner and I was not compensated or rewarded for saying nice things.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"Great suction!","reviewDescription":"Lightweight, many vacuum configuration options, easy to maneuver, easy to empty\/clean out dust canister.  Would recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Nice vaccum","reviewDescription":"I love this little vacuum cleaner the nice thing about it is you can dump whatever you pick up off the floor immediately into the trash and you can see what you’re picking up from your floor. Very nice. You don’t have some dust bag sitting in your closet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Household loves it!","reviewDescription":"All the floors are debri free! Holds so much dirt before you have to empty it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Great for pets","reviewDescription":"This vacuum is decent quality for the price and suction is great. We have dogs and cats and ferrets and the floors actually feel clean after I vacuum. Great on both carpeting and multi surface floors as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"I just love this vacuum","reviewDescription":"I love everything about this vacuum.  I bought it a year ago.  I love the way there are no bags to empty.  I love the suction.  I love the long cord.  I love how easy it is to pull and push.  I love how light weight it is.  When you empty the receptacle, you can wash it and all of a sudden you've got a brand new clean machine.  Eureka customer service is fantastic.  I had an issue and emailed them and they resolved it within a day.  I just can't say enough good things about this machine.  I just bought another one for a different floor.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"This Vacuum Barely Lasted 2 Months!!! Very if not Extremely Disappointed","reviewDescription":"This vacuum would squeak when it was being moved, which was a very unpleasant noise. It also struggles to suction up the filth from the carpet. It even started spewing out dust all over the carpet making it dirtier. I would not recommend this Vacuum. We even at one point cleaned the vacuum to see if it would improve the quality of it. It did not. I hope future potential vacuum buyers take note of this review. Do not avoid spending the extra money for a better quality vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Needs extension for attachments","reviewDescription":"This vacuum  is very lightweight. It does work well on carpet but there is no extension for the brush attachment. This means you have to bend down to only get about a 3 ft reach when cleaning in corners, along baseboards and on stairs. Too frustrating. I’m sending it back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"I wouldn’t recommend","reviewDescription":"This vacuum constantly gets clogged up, throws debris back out, and can barely handle anything. Might work if you live in already really clean brand new apartment. But I wouldn’t recommend for most. So disapointed after trying to fix time and time again over 2 years of use. It’s so bad I’m not even going to try to resell or give a way for free. I wouldn’t want to treat my neighbor this way. Therefore, I’m just going to take it straight to the scrap yard.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"Features not great","reviewDescription":"I gave Eureka a chance and sorry to say this vacuum is disappointing.  1. The suction does not cyclone enough in the container and everything gathers up top.  This means you either have to dig your hand up to the top and pull the log jam of dirt and fur out or take another mechanism off to empty it.  It's not a simple, open and shake.  This is advertised as a pet vacuum but it struggles to move the hair into the container  2. The hose to use the attachments doesn't come with an extender tube - that means it's so short that the vacuum constantly tips over if you try to use the hose.  3. One of the attachments already broke.  4. At the lowest floor setting lots of reverb goes out the back of it so you have to look behind you and go back and vacuum what shoots out the back.  It's lightweight and affordable so those are positives.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Frustrating","reviewDescription":"Have always liked Eureka products and very disappointed in my new Eureka Bagless vacuum.  In a month I've only used it once because putting dust cap back onto vacuum was so frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"flicks stuff","reviewDescription":".. it gets the fur but if there's even the slightest pebble like thing in the way, sand or otherwise.. it flicks it rather than sucking it up more than enough for me to be dissatisfied.but hey.. it gets the \"fur\" right...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Great on hard floors, terrible on rugs","reviewDescription":"I needed a vacuum that could easily transition from hard floors to area rugs.  Based on reviews, I went with this one.  It does great on hard floors.  But on rugs, it sucks up area rugs to where I can’t even move it.  It’s like the rug forms a seal around the vacuum.  I’ve had this thing for 6 months now and at first was able to put the carpet height switch where I could manage on the rugs.  Now no matter if I have it set on high carpet (none of my rugs are high carpet), I cannot push it on any of my rugs.  Therefore, it is worthless on carpet.  If I am able to push it all, it doesn’t even pick up obvious crumbs.  And it’s really loud.  I definitely would NOT recommend this vacuum!","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Too loud","reviewDescription":"The vaccum is way to loud","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Not suitable for Huskies","reviewDescription":"Top vortex clogs immediately with any substantial quantity of dog hair. Probably not an issue with short haired dogs. Our Huskies have always been vacuum killers. This vacuum is pathetically EASY prey.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Good but not long lasting","reviewDescription":"Really liked the vacuum but it unfortunately didn’t even last me a year","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Great suction","reviewDescription":"This vacuum has suction power. So much so that it is hard to vacuum throw rugs or bathroom rugs. It sucks them up and wont let go. It is a little awkward to use, but what dan you expect for an inexpensive vac. It is easy to empty.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Good pickup power.","reviewDescription":"The sweeper picks up well on carpet or bare floor. The power cord is too short and the way it was designed were it comes out of the sweeper it is very easy to run over the cord. There is a little cord hook to use which kind of keeps it out of the way,but caution should still be used. Also,the hand pet attachment does not work well. It's easy to take apart to clean,but constantly needs attention.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Needs improvement","reviewDescription":"This vacuum was a good price so I thought I would give it a try. It does have a decent selection, however, there are a few things that they need to improve on this design. First of all it does not come with an extra attachment so the hose is very short when you’re trying to vacuum furniture, baseboards, etc. I’ve never bought a vacuum cleaner before that did not come with the extra plastic piece so you could make it longer. The area that collects the dirt is super narrow and stuff gets stuck up inside and it’s almost impossible for you to stick your hand up there and grab the stuff that is sticking and pull it out. I have super tiny hands and I cannot reach all the way up in there to pull out what gets stuck and stuff is always stuck in there after each time I vacuum. I probably won’t buy this again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Vacuum","reviewDescription":"It was very nosey to run.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Good price","reviewDescription":"It’s an okay vacuum for the price. For me, the price is the best thing about it. For a senior,  bending over to switch from hard floors to carpet is not pleasant and I have area rugs so if it isn’t on the right setting its impossible to move and if it’s on the easiest or next to the easiest setting , then I’m not sure it’s cleaning effectively.  Doesn’t have a light and it doesn’t swivel.  But like I said, it’s okay for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"The price was good","reviewDescription":"This vacuum cleaner is very noisy it does pick up well I don’t like the way you have to wind up with the cord and the cord isn’t very long","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Decent upright cannister vac","reviewDescription":"Pros:Upright gives those with mobility issues (like me) something to hang onto.Cannister means no more bags. Also means I can vacuum up heavy debris that a bagged vacuum can't.Adjustable Height for carpets, rugs, and bare floors. Almost replaces my broom.Cons:Short, manual rewind cord is good for only one room (or less). Then I have to unplug it, rewind the cord manually, and roll this vacuum to the next outlet.Insufficient onboard attachments means I have to go hunt for extension wands every time I vacuum. Then attach them to this vacuum. Then get my vacuuming done. Then return the extension wands.Handle has a huge, hollow hole at the top. Why? It makes ZERO sense.This is a decent upright vacuum. I prefer it over those light-weight \"easy-to-move\" vacuums because I can actually use this. But it has it's flaws. Eureka, please take note: Add more attachments, put a cord rewinder on, and remove the gaping hole at the top of the handle?It's already hard to vacuum when one can't move around well. Stop making it harder.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Works good but came with frayed cord","reviewDescription":"The vacuum itself is very nice and works well but the cord was frayed out of the box, before I even plugged it in :(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Underwhelming, get what you pay for","reviewDescription":"this thing is okay i guess for the price. i broke my bissell 2998 and that's the only reason i ended up buying this eureka. i gotta say, it just doesn't have the same kind of suction power \/ just isn't nearly as effective and maneuverable as the bissell, and seems to leave a lot more hair in the carpet. finna buy another bissell and just try to not break it this time ._.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Not made for deep cleaning","reviewDescription":"This vacuum is VERY loud.  It clogs easily with pet hair, so constantly stopping to clean out the upper canister.  Works well if all you plan on doing is vacuuming the floor, hardwood or shag carpet.  The hose and tools are a JOKE!!  The hose end does not stay attached and awkward to use.  The small roller tool has no power head so it does not turn if you put any pressure on it. Guess you get what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"It's heavy","reviewDescription":"It's got alot of attachments very easy to clean very good quality, easy to use, and perfect size","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Really powerful","reviewDescription":"The old vac we had gave out and I decided to buy a Eureka based on reputation and reviews. We have several cats and the pet attachment was a type we had before. For those complaining that the brush doesnt turn, a light touch is what you need to use.Overall very satisfied with this vac. Even with some of the short comings I'd very much recommend buying this vac.Pros: Good strong suction! It also has a lower sound which is better than the high pitched sound of other vacs. Large dirt container. Good attachment holders. Easy to release the handle and turn on\/off. Easy height adjustment. Washable filter.Cons: No extension tube attachment for better reach. Using the handle is awkward and not enough reach. I kept the extension attachment from our old vac. Power cord could be longer. The exhaust blows out of the front which tends to blow the cat hair away.Recommendations to Eureka: Redirect the exhaust and use a simpler handle with regular extension attachments.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"New vacuum","reviewDescription":"I like the light weight.  It cleans laminate flooring very well.  It is all plastic, we will see what breaks first.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Missing pieces","reviewDescription":"2 of the brush attachments are missing but the vacuum is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"cheap vacuum replacement","reviewDescription":"Vacuum suction is good.good for pet hair. I have 4 cats. Use daily. Needed something cheap, only dislikes are. Really short hose. Has to stay attached to you or it falls over, also when using hose roller is spinning from bottom, shoots debris,  also no light","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Works better than a canister!","reviewDescription":"I’ve had standard vacuum cleaners for years and this one works like the others. I wish it were a little less heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Value","reviewDescription":"Do what is it has to do, good quality and price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Smaller but powerful","reviewDescription":"Not what I was expecting. It’s small, but very good suction and vacuums up dog hair on the carpets.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Nice little vac","reviewDescription":"Nice little inexpensive vacuum.Easy to put together.  Easy to empty the dirty cannister.  Vacuum is very light.All the switches are foot level which can take awhile to get used to. The hose for attachments is very short - BUT the suction power is incredible!!  The man vacuum part is also very strong.I have low carpeting and don't switch from \"bare floor\" to \"low carpet\" and everything is vacuumed up.  Which is great because the dial to switch levels is in the front of the machine on floor level.  On\/off and the level to I guess kneel the vacuum are also at the base towards the back and you just step on them.Nice little vac if you don't want to spend too much money.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"It works great","reviewDescription":"Living room and bed room","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Lasted about 1 year","reviewDescription":"The vacuum was okay. Worked great for about 6 months then slowly the suction got weaker and weaker. It stopped working properly about after 14 months, so I suggest to invest on a better vacuum cleaner.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Inexpensive product for sure","reviewDescription":"Cord and vacuum hose too short to do serious cleaning. The vacuum is too high maintenance. Couldn’t get it to turn on so a closer look showed the start pedal wasn’t in place. If it happens a lot it could snap off.  Great suction power for a cheap vac. Would be good for a dorm or tiny low traffic apartment.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Bulky, not easily maneuverable and high pitch whine","reviewDescription":"I bought this in a rush when my other vacuum died on me one day and I wish I had shopped around more. This is bigger than my old vacuum, not as easy to turn and there is a high pitched whining noise when I use it. Also, I don't like that the brush doesn't turn off when you aren't moving the unit, for example, when you're using the handle to vacuum something up high or down low. I'm kind of hoping this dies out quickly so I can get something else. It does suck up a lot of dirt, so that's about the only positive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"The cord is very short.","reviewDescription":"Product is good. The cord is very short and doesn’t get anywhereVery disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Not very powerful","reviewDescription":"You get what you pay for. This is cheaply made and not as powerful as something more expensive. Works ok for small jobs- like the office at work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"One of the poorest vacuums I have ever purchased","reviewDescription":"Yes this looks like a good product. I think it is poor at picking up on floor or carpet. The saddest thing is the belts break so easily. i have had three to break recently and will not replace. I am replacing the vacuum.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"No Power","reviewDescription":"The vacuum doesn't have any suction power.  Waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Using the hose sucks","reviewDescription":"It picks up hair very well and the dirt chamber is easy to empty but when you try and use the hose the vacuum falls over because it’s too light weight and the hose is too stiff.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Died after 3 months","reviewDescription":"Horrible.Don't buy!I normally love Eurekas.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"no","reviewDescription":"this vacuum sucks it barely sucks anything up it just pushes the dirt away and then you’re vacuuming the same area for 20 minutes and keep finding more dirt because its just getting pushed somewhere else","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Not As EZ 2 Clean as the As One Model","reviewDescription":"I was looking for a newer model similar to their washable As One model. This is okay and does a nice job; but, I got dirty trying to clean it; Eureka has made it so convoluted to take it apart! Why not stick with the As One design thats so much easier to take apart and clean?!? If you vaccum up dog hair, it gets stuck up inside the cup and doesnt fall out; so you have to dismantle the whole thing every time! I'll keep it. But I don't understand why these vacuum companies make such ridiculous designs! I guess the people who design them never vacuum or clean a house! They think, \"that looks pretty cool and space age! Uhha uhha.\" Oh well...maybe someday...","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"OK for the price","reviewDescription":"Seems to be cheaply made but ok for the price. Gets the job done","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Good suction","reviewDescription":"Vacuum works good. Hose not long enough and pet suction is ok..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Meh","reviewDescription":"I have low carpet, put it on that setting and started to vacuum. It barely had enough power to spin the bristles, I honestly thought it was going to blow up. If the suction wasn't so good I would've given it less stars, but it at least had that going for it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Discharges dust.","reviewDescription":"For $87 it’s a halfway decent vacuum, considering what I really liked about this is the adjustable powerhead for carpets and other surfaces. But for the price, it kicks out dust and debris and it blows it around, so I don’t know how they can classify this as HEPA?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Cons outweigh the pros","reviewDescription":"While this vacuum has decent suction and is easy to empty, if I had to do over, I'd spend more money for a better vacuum. Yes, it lightweight (easy to carry up the stairs) but if you are using the attachment tools don't expect it to stay upright. The stretch hose is too short so when you pull on it the least little bit, the vacuum tips over. Forget trying to vacuum your stairs with this thing. The electrical cord is SO SHORT. No going from 1 room to another without changing outlets. And the canister is too small especially if you have pets that shed.If you live in a very small apartment or house, and cost is a factor, then this may be for you. But if not, I suggest you look for a better model.  Sometimes being cheaper is too cheap. This one is going to the garage and I'll find a better one (more pros than cons) for my upstairs vacuum.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Gone in 60 seconds","reviewDescription":"Purchased in February gone by July. Waste of money 💰","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great suction but not much else","reviewDescription":"The suction was great but the vacuum was cheap and the head popped loudly when you needed to start using it. I don't mind a vacuum that has plastic but this was the bottom of the barrel cheap in my opinion.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"High Pitch Whistling noise","reviewDescription":"Good suction, light weight, cheaply made but for the price wouldn't expect better quality. My biggest issue is the high pitch whistling noise that won't stop. Very loud.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"It’s perfect for easy jobs. Get a new one every year and enjoy.","reviewDescription":"Pretty good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Love it","reviewDescription":"Super light weight, easy to get up and down stairs, I like that it's not big and heavy, nice quality. I wouldn't say it's extremely durable, but I've had no issues so far. Easy to use, simple and to the point. Works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Really SUCKS!  😁","reviewDescription":"I was surprised how well it worked for the price. The photo of the dirt in the dust cup is AFTER I just used my Dyson. Easy to put together, love bagless with lots of attachments. Will probably buy one for second floor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Eureka PowerSpeed: A Lightweight Cleaning Champion","reviewDescription":"The Eureka PowerSpeed Upright Vacuum Cleaner is a pleasant surprise. Its lightweight design makes maneuvering around furniture and stairs a breeze without sacrificing suction power. It effortlessly tackles both carpets and hard floors, picking up dirt and debris with ease.I appreciate the multiple height adjustments, allowing for a customized clean on different surfaces. While the dust cup capacity is decent, frequent emptying might be necessary for larger homes or those with pets. Overall, the Eureka PowerSpeed is a reliable and efficient choice for maintaining a clean home without breaking your back.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Eureka vacuum","reviewDescription":"This pet vacuum cleaner works fantastic!!! My sister recommended it liking it even better than her Dyson. And she was right!!! Fantastic price and fantastic product. Recommended to anyone looking for something affordable that works like something expensive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"My vacumn is a magician!","reviewDescription":"With 3 dogs and carpet, OMG you just can't keep this place clean...........or can you!??!?! Holy bananas, this vacumn is amazzzing! Do you ever just come across a machine and think, ..where have you been all my life? I surely have found my right hand man in Eureka. 1. Shipped quickly 2. VERY lightweight, easy to manuevere 3. Attachments are perfect for cars, couches, stairs, and hard to reach places 4. Leaves awesome crispy lines across the carpet where you can absolutely tell that someone has vacumned!!! Don't think I don't use that one with my spouse when I am trying to win brownie points =) If you are looking for a cost effective, amazing option, this is it!! Thank you amazing Amazon!!!!!!!!!!!!!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Powerful","reviewDescription":"This vacuum is so lightweight. Very powerful. I was using an old heavy Hoover and this makes vacuuming so much easier.I love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Pet hair WHERE?","reviewDescription":"Well-functioning vacuum picks up everything! Especially fur from my fluffy cat who sheds everywhere. So many options to clean all around the house.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Amazing for the price","reviewDescription":"My daughter messed up my beloved Shark vacuum so I had to get a new vacuum. I didn’t want to spend that much again even though I love my Shark and have had many of them. I gave this a try based on the reviews. It’s just as good if not better than my Shark. I’m thrilled. Amazing quality, powerful and easy. We have two dogs, carpet, rugs, hardwood and it works perfectly on all surfaces.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Such a good Vacuum","reviewDescription":"So lightweight, easy to clean. Love the washable filters. Hair never gets trapped in rotating brush. Works so well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Great vacuum","reviewDescription":"Really like this product and works great would recommend and way to put together and easy to use use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good suction, but primary accessory broke","reviewDescription":"It’s got powerful suction and works great rolling the unit on carpets. The turbo attachment for pet hair literally just disassembled the first time I tried to use it. I think it was just manufactured poorly. I frustratingly tried to put it back together to no avail. I called Eureka and they gave me a lot of runaround. First, they wanted me to return the entire product to Amazon, which is obviously not easy because it’s a vacuum cleaner. Their warranty makes no mention of that but sounds like you deal with the company directly. I told them this is bull and that I simply want a replacement for the broken part, then they said “Well, then we will proceed.” I thought that pivot was odd to say the least. They sent me an email with my case number and I had to respond with model\/serial numbers and photographs of the broken part. I’m still waiting for them to respond from there.UPDATE: dealing directly with the company, I was pretty clear I just needed them to send me a replacement part. Instead, they refunded the whole purchase price. Ummm, thanks. Once you start interacting with them over email, it’s hard to tell whether you’re dealing with a person or some AI bot. I don’t think they ever understood how simple my request really was. The vacuum and its other accessories work great.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Works well but not for soft carpets","reviewDescription":"I bought this because it had height adjustments and I needed a vacuum easier to push on my smart strand soft fiber carpet. With it set on the highest setting and the suction adjusted, it is still  VERY hard to push. It’s a fine vacuum but doesn’t meet my needs.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"It's cute and light weight","reviewDescription":"I liked that it was light weight worked poorly on carpet.  The flange that allows you to change the filter is hard to open.  In an older model it was a latch with a spring.  The bottom of the canister where the dust collect has grooves collecting fine dirt if you are not careful you have a mess on your hands.  the canister is smaller from my older Eureka pat vac. also set lower so if you are taller it is harder to push if you have back issues.  as far as having the handle that come out to attach the hose that is cool however it is very short.  So little help if you have something tallish to reach.  Works well on bare floors.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Get What You Pay For","reviewDescription":"Dislikes:  Power cord too short, have to use extension cord. Using accessories is an \"adventure\", hose should be longer.Likes: Lightweight, good suction.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Belt issue","reviewDescription":"2 weeks in I had an issue with the belt - it will be a simple enough fix, though slightly inconvenient.Be careful to not overwork the vaccum in any way. I have just a small rug I use this on but didn't realize something got caught in the brush and it broke the belt quickly.In hindsight even with the user error I wish I had something smaller with more power behind it but for my budget, this is a good price and will do fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Belt keeps coming off","reviewDescription":"First of all I really like the vacuum cleaner it does clean my wood floors very well. It is loud as stated before but I don't care about that. The only problem I gave is the belt keeps slipping off while i'm vacuuming my area rug. I do adjust the vacuum cleaner for the correct height for the rug. But the belt still comes off and busting.  Then I have to take the bottom plate of the vacuum cleaner off . There are 6 screws to take out. Put a new belt back on, which is no easy task and then screw everything back in again. I really like the vacuum cleaner but I'm probably going to returning it because of this issue. Or either stock up on vacuum cleaner belts.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"A bit klunky","reviewDescription":"A nice vacuum for the price. A bit klunky & heavy but gets the job done.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Powerful Vacuum","reviewDescription":"This vacuum was powerful and the upholstery attachment was amazing. Had to return as it scratched our hardwood floors.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Short lived","reviewDescription":"I bought this vacuum for the great reviews and found it worked great the first handful of times I used it but that changed very quickly. The suction is way less and it skips things regularly. It’s heavy and difficult to maneuver. I empty it after every use and I have checked for clogs or hair stuck on the wheel. It just lost quality quickly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"Very efficient but cumbersome","reviewDescription":"An excellent vacuum if you don't mind lugging around a 20# machine. On first vacuum, it picked up stuff its predecessor had left behind for months. I loved it, but I'm certain my 105# wife won't be able to use it.Owner's manual is ok, but it left out how to store the crevice tool—it attaches to the bottom cord hook.Overall, glad I bought it, but it's not for everyone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Lightweight Vacuum","reviewDescription":"This is my first time purchasing a vacuum from this brand.I wanted it to be lightweight, which is important to me.  It does feel extremely cheap compared to my last one.  Probably cheaper feeling than any vacuum I ever owned.I am not sure how I like the feel of it either when you are vacuuming carpet.  It doesn't seem to suction going forward, only when you pull it back towards you.  BUT I will say it vacuumed up more than my other vacuum ever did.  After I saw in the container how much it actually swept up I realized my other vacuum really didn't get much off the floor, even though it felt like it was.I am going to keep it, only because it was pretty inexpensive and seems to get the job done.The one thing I don't like is how you attach the hose when you need to use that.  It just seems backwards to me and I also don't like the main piece that you use to sweep.  I feel like it needs to be longer (without having to use attachments)Overall it will be fine and I like that you can just empty the container easily when it gets full.UPDATE:Now that I have had some time to use it, it is my least favorite vacuum I've owned.  The cord is too short and I find I have to keep switching plugs for it to reach.  I really don't like the hose feature that you use around baseboards, etc.  When you plug it in is is extremely loud, the vacuum is VERY loud in general.  I finished vacuuming the other day and my husband said, \"why is that thing soooo loud??\"I also realized it blows air out of the front of it!  I go to vacuum something and it starts blowing all over so I can't even get it.  So annoying.  I would recommend looking for a different vacuum!UPDATE #2I wish I would have returned it!  It gets worse and worse every time I use it.  The upper clip broke off that holds the cord when not in use, I swear it gets louder every time I use it, its obnoxious!  It also isn't picking things up as well anymore with the hose attachment.  I will need to buy a new vacuum soon, I can't deal with this one anymore!  I love vacuuming and this is taking the fun out of it!","isVerified":true,"ratingScore":1,"reviewReaction":"51 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"100% wouldn't buy this again","reviewDescription":"I have mixed feelings about this vacuum because I was replacing my old one that I really loved and was looking for an upgrade. To be honest I was heavily disappointed because even though I read all the reviews I could no one mentioned what I'm about to mention.PROS- Has great suction power.- Comes with a lot of accessories that can be attached to the vacuum (no pieces laying around or getting lost).CONS- Not light weight. My arm ends up tired from carrying it and moving it around. Out of curiosity I put it on a scale and it weighs 12.5 lb, not 10 like advertised.- Too bulky. Doesn't fit into semi-narrow spaces or under most furniture. I end up brooming the room and collecting all the hair and dust in one place to then vacuum it (which defeats the purpose of having a vacuum).- The electricity cord is placed in a way that makes it harder to keep out of the way. The vaccum is always either rolling over or sucking it.- Comes with a hose that is too rigid and not flexible enough. Every time I use it I end up holding the hose with one hand and the vacuum with the other one so it doesn't fall to the floor.- That same hose, gets detached pretty easily. So I find myself holding the vacuum from the hose's attachment to help it from falling and from detaching.- It doesn't have any headlights (I find this particularly helpful since I have a golden retriever who sheds blond hair that is difficult to see and a light helps me identify what spots I've missed).- It has so much power that the air that comes out of it through the vent makes all the dirt and hair fly around when you're getting close to it (so you actually end up chasing it).","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"DO NOT BUY!!!!!!!!!","reviewDescription":"DO NOT BUY! I bought this vacuum cleaner as I have a dog that sheds a lot. The suction power was good and picked up the hair fine. The issue I had was when vacuuming the bathroom the rug got caught up in the brush. I immediately turned it off and got it unlogged. After that the brush would not come back on. I looked everywhere for a reset button only to find out it does not have one. I called Eureka customer service, told them what happened, they put in a reference number and told me to call Amazon. I then called Amazon who called Eureka on a three way call. This time when speaking to a rep at Eureka they stated they see where I had just called and told me it was my fault the vacuum quit working and there was nothing they would do. I was just out the $100 I spent and had only had the vacuum for 1 week. Needless to say I was angry to think I spent $100 on a vacuum I got to use 1 time. I have never had a vacuum that didn't have a reset button. You can't tell me that you have never sucked something up in a vacuum before..a sock, blanket, rug, etc. Luckily, the Amazon customer service person stepped in and asked them twice \"are you saying you are not covering the warranty on the vacuum\" in which, the Eureka person stated \"we will not as it was her fault\"! Amazon then hung up with them and proceeded to take care of the return for me through them and gave me my money back. I will NEVER purchase anything from Eureka again! I took the money from the return and bought the \"Bissell Swivel Pet reach\". It was about $30 more but well worth the money after this ordeal.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Did not hold up","reviewDescription":"As a mom of 9 I wanted something that would work on hardwood floors as well as area rugs…this did not hold up. I used the vacuum a total of 4 times…husband used it once…I turned it on yesterday and noticed the brush was not spinning anymore…complained to husband about it and found that the drive belt for the brush had nearly been worn in half!!  While it will still suck-seeing the brush not move leaves me feeling unclean bc I expect ALL of the options to work. After walking on floors I noticed that it left thread and hair as well as small debris not only on my thread-bare area rugs but also on my hardwood floors.I do have to say the wand has a nice suction to clean furniture but the reach is less than ideal…I guess I now have a doorstop that can reach arms length areas…while fighting the vacuum to stay upright.All in all TOTALLY LESS THEN THRILLED WITH THIS PURCHASE!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"So many problems, ended up returning","reviewDescription":"I had high hopes for this vacuum but it was so awful that I had to return it.Cons:- The base is too lightweight so when you use the extension wand, the whole vacuum just falls over and the brush roll is still spinning trying to suck everything in its path- The brush roll doesn't shut off when using the extension wand or hose, so it ended up sucking up part of an area rug and ruined the edge of it- All of the materials and base of the vacuum felt like cheap plastic- Wand and hose are really short and you end up having to bend over most of the time- The filter is extremely hard to clean, it's not as simple as opening the hatch at the bottom. Hair and dirt get trapped in the upper portion of the canister which then you need to unscrew and clean it out- You can change the height of the vacuum, but they are all pretty much the same and I saw no difference on what height you use- Didn't pick up any debris, lint, hair, etc. - which is the whole point of a vacuumPros:- Lightweight","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Dissapointed","reviewDescription":"This vacumum is lightweight and the electric cord is marginally long enough. However, I don't feel it is of good quality. I primarily have hardwood floors throught my home with a few carpet runners scattered about. While on the hardwood floors, rather then the vacumum sucking up the dust, I can actually see the dust being blown away, toward the front, from the machine. In order to achieve a reasonably good result, I have to vacumum over and over again and it still doesn't do a good job. Vacumuming carpet, it doesn't even pick up my cat hairs. My broom and dust pan does a better job. I called customer service. The machine is put together correctly. Customer service said send it back. To me, it's not worth the effort. I feel this machine is a piece of junk and will go out with my trash. Would I recomend this machine, no. I would give it \"0\" stars if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Horrible...burnt my carpet","reviewDescription":"I know this is a cheap vacuum, but the reviews were decent and I needed it more for the attachments than for vacuuming, as I have a cordless Dyson. First thing is that it tips...it's so light and flimsy that there's no weight to it...so I found I had to be careful so the thing wasn't falling on me or the furniture. But I figured I could live with that...especially since I mostly use my Dyson and have only used this four or five times since I bought it. The other day I wanted to vacuum the edges of my living room carpet and when I was done, and moved the vacuum off my off-white carpet, there was a huge black mark. At first I thought it was grease, but when I felt it the edges were crispy like they were burnt. I looked at the bottom of the vacuum and didn't see anything, but my husband looked at it again and the roller brushes at one end were hard and burnt. Turns out the roller brush, which is supposed to stop when you use the hose, does not stop and heated up and burnt the carpet. We also realized that the brushes are still turning on the bare floor setting as well...so this vacuum is clearly defective and we are past our return window. Found another spot on my hall carpet where it happened as well, but thankfully that spot is almost unnoticeable because the carpet is darker. I am absolutely livid, because I don't think my white carpet is fixable, so this cheapo vacuum is going to wind up costing me thousands, because I now have to replace two matching rooms of carpet. I will be calling Eureka corporate on Monday, but just wanted to warn buyers about this piece of junk. I will never buy another Eureka product again.","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Don’t do it","reviewDescription":"Honestly I bought this because my vacuum broke and I just needed something that would help get the dog hair up because I have 5 large dogs who shed a lot. I knew it wasn’t great but I didn’t want to waste money on something nice that would break due to use. However I’ve only had this for a couple of months and it won’t turn off. The only way I can get it to turn off is by unplugging it. The hose is small and doesn’t have great reach, the cord is short so I have to plug it in to different outlets to be able to reach a vast area. And the fan on it just blows dust and dog hair around before I can get it sucked up because of its placement. I’ll never buy it again and I wouldn’t recommend it to anyone","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Looks and works like a $30 vacuum","reviewDescription":"I was so excited to own this brand again having had to deal with much cheaper versions for a while but I actually cried when I used it.I became ill shortly after getting it and have missed the return window.Not only does it not work very well, mind that we're talking about new carpet, but it emits a horrible high pitched noise. The noise seems to be getting better with use but I still have to wear my son's noise canceling headphones when I use it.It got clogged with pet hair after maybe 10 minutes, thought maybe there was just that much even thought the carpet was only 6 months old and we only have 1 cat and it would get better after a bit and started vacuuming twice a day. That didn't make any difference. If anything it's getting worse.My husband only used it once a day while I was sick but we have 1 cat that doesn't shed much by breed and there is a no shoes in the house rule since the new carpet, this shouldn't be a thing.Same thing every day, vacuum for about 5 or 10 minutes, there's no swirling action, empty cup, reach in and pull out a glob of yuck and start the process over.I never thought I'd be saying this about a Eureka but DO NOT BUY","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"The WORST Vacuum Ever","reviewDescription":"I spent HOURS comparing vacuums and I’m not sure why this one has even one good review. Back to the drawing board I go because this vacuum is absolutely awful. Let’s start with the weight, which is supposed to be a selling point. It’s so light because the pieces are complete crap. It’s all put together by Lego duplo pieces. You know the big, light Lego pieces for toddlers?? Yes. Those.The hose sticks onto the thing with the security of a post-it note, so I’m sure the tiny stuff you vacuum just blows back out at you from one of the two “connections.” I wouldn’t know because the piece of work gave up on me after about 30 minutes of use. I did my bathroom floor, then the roller part literally stopped working when I started on my bedroom. The height\/floor selector is so funny-looking and feeling… it literally feels like you are operating a children’s toy vacuum. Oh yeah, I can’t forget the fact that the light never worked. Brand new… never turned on for a second. First and last Eureka product… will never purchase anything from this brand ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716768000000}
{"reviewTitle":"Didn’t last 3 months","reviewDescription":"I take very well care of things and I don’t have super dirty rug nor did I have a challenging task at all for this vacuum. I just upkeep once a week m6 bedrooms with rug. This vacuum has barely any suction and it smells like something is burning when it’s on. Nothing has been sucked up the vacuum besides dander. My dog doesn’t shed and I don’t have toys or anything lingering. It did not meet my expectations at all. It was very short lived. I will pay the extra money for a shark vacuum.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Died after 2nd use","reviewDescription":"I bought this vacuum specifically for dog hair as the reviews were great. Was amazing the first use. The 2nd time the motor made a terrible winding noise with an awful smell and shut off never to turn on again. Last the return date so now I have to contact the manufacturer. Bought a cheap $40 Walmart vacuum in the meantime that I’ve used on the same floors no issues. Would not buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Terrible for hardwood floors","reviewDescription":"This is an embarrassing product for Eureka. After using this vacuum for 15 minutes in my living room and bathroom, I immediately repackaged it and an sending it back. Thin plastic wheels, weak suction, and a short extension hose are just a few of the strikes against this vacuum. The adjustment knob that has 5 settings from a high pile carpet down to a bare floor is a joke.  On its bare floor setting the front end drops to the floor leaving no room to roll over debris to suck it up, but instead just pushes debris like a snow plow because the front is touching the ground. And because it's touching the ground and because it's made entirely out of plastic with no rubber anywhere, dropped down to the bare floor setting just scratches the floor. The wheels have no rubber treads so it's just hard plastic scraping against the varnish on the floor. I tried raising the adjustment height one notch up so the vacuum has enough height to roll over debris but the suction power is so weak that it can't suck anything up and misses even the tiniest debris. Now while the vacuum itself is lightweight, this poses an issue when trying to use the extension hose. With the extension hose being short and the vacuum being lightweight, as soon as you pull the hose to get those \"hard to reach places\", the vacuum topples over because they're isn't enough weight to keep it upright. Terrible choice for hardwood floors, but thankfully Amazon allows returns.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1642896000000}
{"reviewTitle":"Not lightweight. Doesn't pick up anything on carpet","reviewDescription":"I have had this vacuum for a few months and was talked out of returning it. Not sure what all the other raving reviews are talking about. I have chronic shoulder pain now because of how hard this vacuum is to maneuver on my carpet. And it doesn't pick up anything off the carpet either, no matter what setting it is on. Every single time I use it on the carpet, I have to pick up pieces of lint and fuzz myself that the vacuum refuses to pick up. Or lint roll them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Don’t buy","reviewDescription":"A day after my 30 day warranty the suction cup stop sucking. I have sent the company pictures of my invoice and the date of purchase blah blah blah and they are saying it still not enough very very upsetting","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Disappointing purchase","reviewDescription":"I purchased this vacuum for our new home, use it once and now it doesn’t work. The outlet works fine but the vacuum is not. The return time has expired now I’m stuck with this junk.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Nothing Powerful or Turbo About This Vacuum","reviewDescription":"Terrible vacuum. I should have known better, but wanted to save some money on this purchase. I am now going to have to buy a new one AGAIN. I'm sticking with a Shark vacuum. My last one picked up SO much. This ones brush doesn't even move on its own. It's manual so it only moves a little while I'm pushing it. Doesn't even leave tracks in my carpet. I hate it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Pet turbo tool","reviewDescription":"This tool doesn't work, it doesn't spin and then you take it apart to make it spin and the whole thing falls apart.  I'm so pissed!  my husband fixed it but it should not have been broken","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Do not buy!","reviewDescription":"This vacuum blows everything you try to vacuum up away from the vacuum. You will need to dust after using this thing. Awful! Real awful if you have pets, even thought it’s supposed to be good for pet hair.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Weak suction","reviewDescription":"Even after adjusting the height dial, we could not find a setting that sufficiently cleaned our carpet (low pile). It was ok on hard floor, but would leave a pile of dirt after the vacuum was shut off.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Useless","reviewDescription":"Belts on this model break frequently.  Even using their branded belt, was able to use for less that 1 hour before rollers stop turning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Already Broken","reviewDescription":"This vacuum lasted me 4 months before breaking. The band just completely snapped and my husband thinks the manufacturer put it on wrong. I've never been down a vacuum so quickly. Will never buy this brand again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Buyer remorse","reviewDescription":"I don't understand why they don't think these things through when they make stuff. Number one. The cord is too short. Number two. The hose is too short as well. Every time you  use it, it's falling over hitting you in the back. Can't reach anything to clean. What's the point of having a vacuum if you can't use it for anything ?? Very inconvenient. I'm sending it back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Terrible. It sucks geat, it collects tons of dirt, but","reviewDescription":"Terrible. It sucks geat, it collects tons of dirt, but It is extremely hard to push. I've had it for 9 months now and I've hated it since day one. I love how much dirt it gets  but it is set too low from the factory, or something is wrong with it so it is very hard to push forward. I tried all the adjustments etc and I looked for anything broken, nada. It's just super hard to push forward. Backwards towards me is fairly ok but even on the highest carpet setting it is way too hard to push forward and makes my arm sore after 10 min. This pos will be going to the garage sale","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Worst vacuum I have ever owned","reviewDescription":"I wish I didn’t have to give this vacuum any stars! With the overwhelmingly loud sound it makes you would think it’s doing something. First, it has a fan on the front of it that blows anything out and away from you as you move across the floor making it useless.Second but very important if you use the attachments it blows what little dirt and hair out of the opening that you have left when using the hose. Terrible product\/design! Do not buy this!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Nearly useless","reviewDescription":"This is the worst vacuum I have ever used. Every time I turn it on, it releases a cloud of dust, even after cleaning. If I go over hard floor, it does not pick up anything and blows debris around. On carpet I have to go over the same spot 3-5 times. Any hair gets stuck in the intake port, requiring frequent cleanings mid-use. The hose is difficult to use and the pet hair attachment is entirely non-functional. DO NOT WASTE YOUR MONEY.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Review 3 months in use","reviewDescription":"Terrible vacuum. I have 2 small dogs and 3 elementary school aged kids and this thing can’t even pick up a piece of paper.The only reason I never returned it was bc of the “cool” handle features. Even that is not as strong as I wish it to be.Thankfully I still had an older vacuum in the closet- that is my go to!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Not Made to Last!","reviewDescription":"It burned up after 1 1\/2 months of use, the motor started smoking and now it is trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"What good is suction if the exhaust blows up the dust before the area is vacuumed","reviewDescription":"Unfortunately, suction for my 9lb shark only lasted a year, so I replaced it with Eureka Lightweight Powerful Upright Vacuum Cleaner for Carpet and Hard Floor a little over a month ago.Although the suction is great, the exhaust is somewhere up front, so it blows the dust up, right before you vacuum the area.  It is very clunky to maneuver, sucks up (with the brush) the corners of my area rugs and is much heavier than my old vac.  It is loud and did I mention, clunky?The extension tube is very short and so is the bent handle, which makes it impossible to vacuum under the furniture.  The vacuum also keeps on tipping over when using the extension.  By the way, the brushes continue to spin despite the fact that the extension is in use.Emptying it out causes a cloud of dust and you have to wipe the bin after emptying because the dust gets all over the bucket.The only PRO is that it is under $100 lol.  I should have known better.... really hade this piece of equipment.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Junk!","reviewDescription":"I've had this thing for less than 3 months. I've maybe used 6 times. Today, I go to vacuum the couch and smells hot. So, I take apart enough to get the roller out, clean that, put the vacuumn back together turn it on and now sparks flying. This is beyond ridiculous!Don't waste your money! Save up a little and buy a shark.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"WORST VACUUM EVER OWNED","reviewDescription":"I COULD NOT BE MORE DISAPPOINTED! I HAVE USED IT 3 TIMES NOW AND WILL NOT USE IT AGAIN. THIS VACUUM MAKES YOU WORK FOR IT!! THE SUCTION ON THIS VACUUM IS HORRIBLE FOR FLOORS. IT DOES NOT PICK UP PET HAIR, DUST, SPECKS OF DIRT OR ANYTHING ON THE FLOOR THAT CAN GET BLOWN AROUND. WHEN YOU TRY TO VACUUM IT UP - THE AIR FROM THE VACUUM SUCTION BLOWS IT AWAY - YOU HAVE TO KEEP CHASING YOUR PET HAIR AND SPECKS TO TRY TO VACUUM IT UP. GOOD LUCK WITH THAT! TOO MUCH WORK WITH NO REWARD OF CLEAN FLOORS.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Worst Vacuum We Have Bought","reviewDescription":"We have owned several vacuums over the years, and remember when they actually had metal pieces! We have dealt with the cheap uprights and even bought a Dyson once (one of the top worst vacuums we have owned). This vacuum is by far the overall worst.It is extremely cheap, thin plastic which lends to the lightweight part, however this also seems to cause issues with the height adjustments, as they did not work at all. Trying to vacuum over a flat oriental rug was a joke - vacuum would not budge forward on ANY setting (because the height settings did not change) and we had to drag it backward over the rug, pick up the vacuum, place where we wanted to begin and drag backward...over and over.For the regular carpet, it was barely leaving tracks where I had vacuumed, once again, on ANY height setting. We did look the height leveler and it was not working.Got on Amazon chat, and CS approved a return and refund asap.Not sure why this thing received good reviews, or maybe we just got a Lemon. Either way, will not be buying the same one again.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Broke on 3rd use","reviewDescription":"Do not recommend. Very disappointed. I was using the hose feature when the vacuum ran over the cord accidentally  and shredded the cord. I filed a damage request because it was under warranty (5 times) and my only response was to submit photos again.For background, I am a behavior therapist in a school and a common training I do is to teach children how to use vacuums at home. I am well aware not to run over vacuum cords but this was a freak accident and it shredded it under 10 seconds. I do not recommend this vacuum","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Poor Quality, cheap","reviewDescription":"Unfortunately this is one of the worst vacuums I have purchased. It doesn’t suction or clean up anything very well. It just shoots the dirt everywhere and once you stop vacuuming it just leaves a pile of the dirt on the floor. I don’t recommend and will be switching back to Dyson.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Poor","reviewDescription":"At first I was happy with this vacuum. But after using it about 3 times I have come to really dislike it! When you use the removable wand, and you are trying to reach high places or low nooks and crannies, it doesn't do justice,  it either doesn't reach, or it falls over. Also being an owner of dogs and cats, it just blows the hair around and you get to play chase the furball, without the fun! And of course since I have used it, I can't return it! So now I am stuck with this POS vacuum!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Not great at vacuuming and very loud.","reviewDescription":"This vacuum was a disappointment. It is very loud and not good at vacuuming. I will be ordering a different brand 3 weeks after I bought this one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Trash","reviewDescription":"Used three times, two belts broke and we have 80% tile in our house. A couple low rugs and 8 year old construction grade carpet in two bedrooms. Thankfully Amazon is so great on returns. Too bad too because attachments fit great and probably would have been very useful.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"It destroys belts quicker than it picks up dirt","reviewDescription":"I don’t have much carpet in my house. It worked well for about a month. Now every time I use it the belt basically melts off. Not worth the hassle. The extra pieces for cleaning don’t stay in their holders. Disappointed to say the least. Waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Eureka Vacum-waste of time","reviewDescription":"Delivered without foam filter. As per instructions contacted Eureka to correct problem. They were out of filters until at least end of August. (Now July 9) Eureka advised I contact Amazon and send the unit back. Why would Eureka send out a product with part of it missing???","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Shoots out dust","reviewDescription":"Bought this a few months ago, worked like normal until the last couple of weeks. It shoots out dust when powering on and can’t figure out why. Took apart everything cleaned it, and it still shoots dust from time to time. Never buying this garbage again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Terrible cheap waste of $$","reviewDescription":"Right out of the box the unit just feels cheaply made, low quality. Works ok but the turbo pet tool attachment didn’t work at all and after several exchanges with manufacturer customer service they wouldn’t even replace the one small piece, just went straight to telling me to return the whole thing. Nightmare to deal with. Not worth the price tag. Returning👎🏻Don’t buy eureka, they s*ck","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Unimpressed","reviewDescription":"This is the first review I’ve written on Amazon, but I feel I have to. I bought this vacuum because it has great reviews, but I found it only works on high carpet, and even then I have to go over areas twice. On harder surfaces, I can see it spewing dust from the sides of the brushroll, leaving plumes of dust in the air. I am very disappointed I spent any money on this and wish I had bought a different vacuum.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Poor design","reviewDescription":"It has power, but is super LOUD!The beater bar runs nonstop and the hose is short.  It needs another pole attachment to reach low places without having to bend over, and I have to lift it up to reach the ceiling.  When I lift it up, I have to be careful that the beater bar doesn't catch the bottom of my shirt or dress.  This happened twice and the third time it happened, the belt broke.  Now I have to get a new belt.  I should have known that the price was too good to be true for a quality vacuum. I will now only buy a vacuum at a store, where I can really check it out, before purchasing it.  It's hard to feel comfortable returning something after getting it dirty!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712707200000}
{"reviewTitle":"Sucks, in more ways than one","reviewDescription":"It’s a light compact vacuum that when I plugged in offered good suction. It arrived super late but that’s an Amazon issue that was never resolved and as a result I’ve only used it for a bit over a month.  The brush wheel no longer turns making it useless as an upright vacuum. Other people mentioned the same. I should’ve paid attention. The second time I used it I smelled burning rubber. The attachment system is flawed as is the hose connection. I was able to work around that but not the rubber band that makes it go on the floor or carpet. It’s cheap for a reason.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Updated review","reviewDescription":"Originally I was going to rate this 5 stars!  Just a short time after using the product one of the accessories fell off and just broke into 10 pieces or so.  I contacted Eureka immediately and sent them everything they requested.  They are now not responding to my request for updates.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Don't buy this. Worst vacuum I have ever owned","reviewDescription":"I basically used this 3-4 times and couldn't return it so I just left out with garbage hoping someone didn't pick it up and then experienced what I did. Pushing the vacuum is like trying to move a tank. Rollers get immediately clogged, hose to container clogged, terrible suction in all kinds of situations. Short carpet, long carpet, and hardwood floors. Terrible just simply terrible. I did a back and forth on 2 pictures included and you can see the results. Terrible!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"If you buy this, plan on getting a new one yearly....","reviewDescription":"It's been a year since I purchased this vacuum.  I have two long haired cats.  I will admit this was great for picking up the hair, so kudus for that. However, after emptying and cleaning the cannister out last time, I screwed in the interior top part (where the screws are) like I always have done and now I cannot get the two pieces to unscrew.  I broke the plastic twist part as I was trying to loosen it, so the vacuum is now useless since I cannot undo the top piece to empty it or remove the fur.  The bottom latch part works fine.  This is a noisy vacuum and the hose is short and stiff, so that's an issue as well.  But for $80.00, don't expect it to last too long.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Damaged my carpet","reviewDescription":"This vacuum certainly has powerful suction. So much so that it pulled up two of my area rugs and damaged the corner of one of them. The roller attachment stopped rolling as soon as I touched it to the sofa and was therefore useless. When I remounted it on the vacuum (after trying to get it to stay there many times), it finally fell off and broke into pieces. The hose is extremely short inflexlible., so you can't really do anything more than an arm's length away.  The cord is also very short (and I have a tiny house), and it comes out at the bottom of the vac, so you or the wheels are constantly getting tangled in it even if you tuck it in the little hook at the top. I am returning this item.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Piece of junk","reviewDescription":"Used it as soon as it arrived…very flimsy and cheaply assembled…worked fine fir 29 minutes and all of a sudden was throwing dirt back out of roller area. Removed plastic cover and found broken plastic controlling height adjustment. Couldn’t get it back to UPS fast enough!!Price indicates it’s quality! Don’t buy!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Worst vacuum","reviewDescription":"I have purchased a number of vacuum cleaners in the 47 years of my adult life and this is by far the absolute worst one I have ever had. It doesn't pick up everything even with a few passes and leaves tracks of dust on the carpet. Never again!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Rotor brush-failure","reviewDescription":"The rotor brush stopped working and I checked for any jams or obstructions, none to be found. I have only used this vacuum less than a dozen times (8-9)I’m not very happy with the product.  And of course, my return date just passed a month and a half ago  🤦🏻‍♀️","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Does not suck well","reviewDescription":"I tried to give this vacuum cleaner a chance, but trying it out for almost a month, I want to throw it in the trash. When I use it, the vacuum does not suck well, it blow the dirt to the back of the cleaner. I had to turn around and suck it a few more times. I got to the point where I just use my broom for the hard floor. I would not buy this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Doesn’t work!","reviewDescription":"I waited all day for this item just for it to arrive and not work!It makes a weird noise when it on and it’s not even picking up trash.I’m extremely disappointed and will be returning it tomorrow.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Stopped Working Second Time I Used It","reviewDescription":"It worked great the first time I used it. I went to use it the next day and it was dead. Absolutely would not turn on. How are these products being made? Back it went. Complete waste of time and energy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Spits out everything","reviewDescription":"Worked great the first couple of times then spits out everything as soon as you turn off the power. I've connected everything as supposed to. Very cheaply made. After taking out 6 screws to unclog the vacuum and clean the brush thoroughly, I put it all back together to smell burning. The belt needed to be replaced just after using the vaccuum a few times! It’s worth spending more money on a vacuum that’s easier to use and maintain.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"This vacuum sucks and NOT like it should","reviewDescription":"Go figure like 2 days after my 30 day return window the vacuum starts blowing out more than it sucks. WOW what a mess and total disappointment.What i may have saved in money is gonna cost me nothing but headaches and a paperweight that sucks horribly.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"First and LAST Eureka!","reviewDescription":"Wow, there is not enough words to speak about how absolutely horrible this vacuum is. It does an okay job and sucking, I have shag carpet and I just kept seeing little white things sitting on the carpet after going over it several times so its not great, at all at sucking. There is NO WAND, the little handle is the \"wand\" and the hose is like 4 feet long so had fun with that when I was trying to vacuum my couch. I was attempting to use the pet tool but as soon as you put the sloghtest pressure it stops spinning. Speaking of the hose, when you disconnect it from the unit, the vacuum keeps spinning and as the hose is super short, you are constantly lifting the unit and moving it, well, guess what?! The electrical cord gets sucked in and gets cut up. I have had this 3 days and I will never buy a Eureka again. I have never had one previously and now I know why. Also, keep the box. I made a makeshift box so I can return this big pile of garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Smells like it’s burning after less than 3 months of use","reviewDescription":"Was a great vacuum at the start, but after some use it now smells like burning whenever we use it. We’ve went through everything and it appears the motor is overheating because everything else looks fine.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Not for a house","reviewDescription":"Chord too short, canister release button never releases in it's own, canister fills up roo fast and clogs up every use. When trying to use hose too short, vacuum tips over often.  Not for use in a 1,200 sq.ft. house. Maybe a small apartment. This vacuum has been used in a home that has no children, no pets and has 1 year old low pile carpet only in bedrooms.  The rest of house is hardwood and is always very clean. So,  for it to clog up everytime I use it, is a flaw. Bummed cuz I have only had eureka vacuums. This model has left me disappointed. I need a reliable efficient tool and this item is not that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Piece of crapppppppp","reviewDescription":"I have always purchased sharks but due to some unfortunate circumstances I had to use the vacuum (shark) that I had and I needed a new vacuum quickly so I bought this and it honestly is terrible! The belt has broke more than 3 times , I replaced it yesterday and the first time using it broke again!!!! Do not waist your money! I even reached out to the company and they said a belt should be replaced every few months and I don’t think that is exceptable!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Broken after only 3 months- just skip it","reviewDescription":"I would give this a zero if I could. I guess I should have known given the price. You get what you pay for. This vacuum didn’t suck right out of the box, there was always a burning smell, which are the top two questions when visiting the support page (yikes), and finally gave up the ghost in January. Took me this long to finally write the review.We have dogs, cats, carpet, area rugs, and laminate floors. Trying to get “support” is next to impossible. Eureka used to be a good brand. Maybe the more expensive vacs are better. Still searching for something that can do the job…..","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Constant Clogs","reviewDescription":"This vacuum is the most inconvenient thing I’ve ever owned. Every time I try to use it it clogs up immediately. I tried to take a video after clearing out the three handfuls of dust and fur in it to show how fast the sound changed from normal to clogged BUT IT STARTED OFF CLOGGED SOMEHOW. At least I know not to buy from Eureka, that “filter” at the top is the worst design I’ve ever seen.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715904000000}
{"reviewTitle":"I would not recommend this even to anyone including my ex...","reviewDescription":"I don't think reviewing something like a vacuum can be done right away. I bought this in Oct 2022 of last year so I think this is a good time to review. I really wanted to like this. First off, the wheels are made from the cheapest plastic I have ever seen on a vacuum, and they have zero grip. They glide more than they spin on surfaces. The extension hose is too stiff for the machine which weighs a feather... When you use the hose, it will knock down the entire vacuum unless you have it up against something, which is super annoying.. When I vacuum my thin rug in my living room even on the highest setting I have trouble pushing it across the rug.  The suction barely picks up easy things like Cheerios from my toddler. This was the first and last time I plan on buying a vacuum online. Wish I would have just returned this and gotten my money back!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Horrible!!!","reviewDescription":"Roller bar DOESNT STOP!!! When upright and using wand.  Therefore, it sucked up its own cord!!!!!  Highest level on hard wood, it shoots debris instead of picking up!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Eureka Lightweight","reviewDescription":"This vacuum is not really light weight.  No luck with this vaccum picking up the dirt from my tile floors.  I had to sweep after using the vaccum.  Vacuum also doesn't flow through my rugs even on the high carpet setting.  I'm very disappointed in the performance of this Eureka.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Does not pick up or suction very well.,","reviewDescription":"This vacuum is horrible, no matter what setting we put it on it does not suction very well. I do not recommend this product, do not waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Broken within 3 months","reviewDescription":"At first I really liked this vacuum. When I first used it, it seemed to have a lot of sucking power. But unfortunately within just a couple of months the vacuum power significantly weakened and I could not figure out why. Nothing was clogged, filters clean. And now it just completely does not work at all. And I only purchased it in January. Just a complete waste of money. Do yourself a favor and just spend 50$ more dollars to get yourself a vacuum that will actually last. Now I have to buy a new vacuum again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Terrible","reviewDescription":"I bought this vacuum about six months ago. This thing couldn’t pick up a feather. I’m extremely unhappy with it. Sometimes it blows more dust and dirt out then it picks up. Maybe it was just the one I received but this vacuum does not suck. It’s worthless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"No good","reviewDescription":"It arrived broken.  The nozzle of the handle would not stay in the base.  It would lock in place when the vacuum was in the upright position but would slide out when  inclined, making it impossible vacuum.  I contacted Eureka and went through several phone calls and did everything they asked.  They ended up telling me they did not have the part.  They suggested contacting Amazon for a replacement or return.  I wanted a replacement because it is lightweight and the suction seemed good, but Amazon did not have any in stock.  I am frustrated and very disappointed in Eureka!  The name used to insure quality.Update on 11\/13\/23:  Because of the runaround with Eukeka and a trip out of the country, I missed my return window.  Now I am stuck with a brand new vacuum that the handle won’t stay in.  I had to duct tape it to try to get the handle stay.  I would advise against this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Extremely disappointed","reviewDescription":"Unfortunately, I just opened my vacuum cleaner and attempted to use it for my Easter weekend cleaning. What a joke at first I thought this is gonna be a great vacuum cleaner. There was very little assembly needed however when you place it on any heights or rugs or carpet, the vacuum cleaner will not move, it is not push able. My returnable window closed on March 21. And although I’ve used the vacuum cleaner once or should I say attempted to use the vacuum cleaner once it does not work and I am stuck with it.😡😡😡😡😡😡😡👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Horrible product.","reviewDescription":"Should have checked the reviews more like insult do. But this is the worst vaccumed I ever purchased. I needed something quick and for the price I gave it a chance. This vacuum doesn’t even work properly. On hard floors and carpet it doesn’t not collect anything. Just shoots dirt and debris back out…. The only thing that’s “ok” is using the handle attachement to collect it all but that’s it. Also the vacuum is pretty big but feels so cheap and lightweight. Again I just needed a vacuum that exact day so it was a quick buy. Will not purchase again. If I could give this zero stars I would in a heart beat.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Don't buy","reviewDescription":"First off I've had the vacuum for less than a month and it quit working. So I'm returning. Of course o have to figure out how to box it up to ship back and wait for my refund.Other reasons for one star- this is made of very cheap thin Plastic. Also, the knob  to change for flooring is inconveniently placed making it a pain. Having used other vacuums to is is definitely a cheap base model .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Does not work well,  even brand new","reviewDescription":"I waited to write a review until after owning for a little while,  but this ranks up there as one of the worst I've ever owned. Brand new, first use had horrible suction.  It doesn't pick up everything,  will have to go over a spot a few times then I still have to pick up small things,  even pine needles on wood or tile aren't picked up easily.  The design makes pet hair get stuck at the top of the cannister regularly and the only way to get it out is to stick your arm up inside the cannister. It's gross and doesn't work, don't waste your money!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Belt broke wit 2nd use","reviewDescription":"Used it one day and it worked next time brush wasn’t turning.  Took bottom plate of to access belt.  Put it back on.  came right back off looks like it had a small piece off.  I am 70 years old had a hard time getting g back on don’t want a sweeper that belt comes off.  unfortunately my son-in-law threw box away don’t know if i can return it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Save your money","reviewDescription":"I have had a Dyson for the past 10 years. I knew there would be a quality difference but man I poured over these reviews and saw so much positivity on this vacuum I was encouraged I felt like it might actually be a good one. It seems very popular that solid surfaces are what most people have. However, I needed a good vacuum for carpet. Didn’t want to spend a whole lot of money and I totally got what I paid for in this situation. This vacuum is awful, the hose doesn’t work when you turn the vacuum off debris comes out of the hose because there’s not enough suction to get it into the canister. There is a specific attachment that seems like would be so great. It looks like a little mini handheld vacuum that you put to your hose that does not work at all not at all again because there’s not enough suction. This vacuum is for pure novelty. So frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"ONLY BLOWS DUST AWAY. DOESN'T SUCK IT IN AT ALL.","reviewDescription":"It's such a pain to use this vacuum. It's strong for a carpet maybe but if you have hard floor it only blows all the dirt and dust around and away from what's supposed to be sucking the dirt in. You then only breath in dust. It's so exhausting to get anything clean. I now only use my dustpan. Will have to buy a new one. Very disappointed - for this price it should at least work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Cheap, awkward, stopped working in 15 minutes","reviewDescription":"There are a few flaws. The brush’s don’t ever stop spinning. So hardwood floors are impossible. I bought this because I spilled cat litter on my carpet. The ultimate test, which it rose to the occasion by emitting a plum of dust like a Sahara dust storm. Getting bogged down. Then the drive belt slipped off and the brush’s stopped working. What a bust of a product.I also found that the carpet attachment is driven by the flow of air instead of a motor. So it stalls on any carpet that is even remotely “shaggy”. With the hose wanting to fight me the entire time to return to its resting position.Save your money. I’m certain there is another vacuum of this price range that is vastly superior.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Everything is terrible about this","reviewDescription":"I used to sell vacuums and remembered good things about this brand. So I was disappointed when i got this model. I wish i kept the box to return it. it doesnt have good suction and misses easy messes even on hard floors. very loud and even on highest height setting it scratched my wood floor. Destroyed two rugs no matter how careful i was. the rollers are insane. literally trashing it now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Bought 2 years ago for very light use. Never worked well.","reviewDescription":"I should have arranged for a return, but this item was purchased for a rarely used cabin shared by several people, and the message of a poorly working vacuum cleaner got lost.  Now that information is flowing, and the word is it never worked well, was missing some vital pieces for non-floor cleaning, and doesn't work at all now, 2 years and only a handful of uses later.  Of course, it's way too late to make any attempt for return, and that's on us.  But,  don't waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"I took this to the dumpster after just 2 uses.  The roller brush completely stopped working....it was not clogged with hair.  My wife bought this as a replacement to our Shark, which we had for over 10 years.  The quality between the two brands does not compare.  We would have sent this back for a refund, but we threw away the packaging the day we got it.  After all, who buys a vacuum cleaner expecting to return it after the second use?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Terrible Vacuum","reviewDescription":"This is the worst vacuum, it spits dirt all over, because the roller can’t be turned off. Don’t waste your money! It is also very hard to push on even short carpet.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Very Disappointed","reviewDescription":"After reading the reviews I thought this was a pretty safe choice. I was wrong. When I turned it on it made a very high pitched ear splitting sound that never stopped. Sounds like it's coming from the motor. I tried every trouble shooting idea I could find online. Nothing helped. I called the Eureka help line. They were totally worthless. Also the hard floor and carpet adjustments suck. On hard floor the brushes hit the floor. To vacuum any rugs you have to change it to the highest setting or it will eat the rug. The adjustment knob is very inconveniently placed. You have to stop vacuuming, put it in the standing position,  bend over and turn it. Should be a foot pedal.My ears are ringing after using it for a little while. No choice but to return it and try a different brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"DONT BUY!","reviewDescription":"I have had this 4 months. Now no suction. I'm an older person in small space with NO carpet and still it has fizzled out. Unfortunately I'm too late to return. DONT BUY","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Buyer beware","reviewDescription":"Every time I use the vacuum for light household cleaning, the belt comes off the brushroll and it quits rotating (and has no suction power). I highly regret spending money on this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Low suction","reviewDescription":"I bought this vacuum in May, I used it two times and I was shocked by how good the suction was. On the 3rd use suction was very low, today is the 4th time am using it the suction remains low. I checked to see if the hose is blocked, nope. I can't return it because its past the return date. Such a waste!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Poorly made","reviewDescription":"We had this vacuum for a few weeks, used a handful if times. Everytime I used it, the belt would come loose and not work the brush. After the 4th time fixing it, the little metal piece that helped hold the belt broke off at some point while using the vacuum so now it doesn't work at all and is not something I can replace. This vacuum was lightweight, but appears cheaply made. I've never had a vacuum have this issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Vent in front?  Why?","reviewDescription":"I'm not sure how people are rating this good for animal hair.  The vent is faced forward.  As you push this, it blows animal fur away from the vacuum and all around the room.  This has to be one of the worst designs I've seen in a product.  One use and we returned it.  What silliness.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Throws dirt into the air","reviewDescription":"For the money, you get what you pay for.  For the Quality, you also get what you pay for. I've loved the big retaining container, but disapprove of the short cord. Found dog hair coming out of the vacuum cleaner around the solid parts was a little concerting. Thew dust, particles throughout the rooms and I was dusting more. I would not buy this ever again, but I did take this vacuum cleaner and throw it in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Horrible","reviewDescription":"Doesn’t do its basic job which is to vacuum. Just spits up debris and the hose has zero suction. I know it’s cheap but it lasted one month?!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Worst vacuum I've ever had, don't waste your money","reviewDescription":"This worked \"ok\" the first two uses. Then stopped sucking anything up. Took it apart, found there was no filter, and the belt was in pieces. I feel I wasted money trying to find an affordable vacuum and should have just spent more on the one a little more expensive but proven that it works. VERY DISAPPOINTED","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719878400000}
