{"reviewTitle":"Upgrade the Touchpad driver!","reviewDescription":"I couldn't justify spending the amount of money on the laptop I really wanted, and opted for this because it's good for the price. Initially everything was fine. Less than 24 hours later, the touchpad became unresponsive. I noticed shortly after startup the icon indicating the touchpad was off would pop up. I could only get a cursor by using a mouse in the usb.TL\/DRGo to drivers.softpedia.com and search for Acer Aspire ES1-111M Elantech Touchpad Driver 13.6.3.1 for Windows 10 64-bitIf there's a newer one, I didn't bother, this resolved the issue as soon as I setup the driver and rebooted the laptop. The driver that the laptop uses by default is an old 2006 Microsoft driver which can't handle the newer touchpads.Things that did not work (aka maybe don't waste your time):1. Turning the touchpad back on (also this laptop had the touchpad on f10, not f6 or f7 like other models)2. Checking updates (even the optional ones)3. Uninstalling the driver and rebooting to force it into reinstalling uncorrupted4. Entering BIOS and changing touchpad to PS\/2Save yourself the time and hassle, just install a better touchpad driver as soon as you're done with initial setup.Other than that, it's a good laptop. I do minimal gaming (I don't play AAA titles on pc but indie games are great), a bit of programming, some spreadsheet work, and a little graphic design work. This does what I need sufficiently. 4 stars only because of the issue with the touchpad driver, which seems to be very common if you read reviews around online.Update: I've knocked this down to 3 stars. I shut down the laptop last night, and after coming home from work today, I turned it on and it won't register my docking station anymore. I thought maybe an issue with my dock, but I did every troubleshooting step I could, and went to Google. When I was there, I noticed the touchpad was acting up. It wasn't allowing me to scroll. I checked the driver, and to my horror, it had reverted back to the outdated 2006 Microsoft driver. I looked at the rest of my drivers (as I had done the previous day to make sure nothing else was outdated) and EVERY DRIVER was a 2006 Microsoft driver, when just yesterday the oldest I had found was from last year. At this point I'm thinking about returning the laptop. I'm in the process of doing a system restore to what I had that worked, and if this still won't correct it, I'm sending it back. I have had this laptop for 3 days at this point, and two of those days were spent trying to fix it.Update: Leaving it at 2 stars. The restore slightly worked, all my drivers were back to normal EXCEPT the touchpad driver was still outdated from 2006, only now it won't let me install a newer driver. I reset the entire computer to see if that would help... Same, but at least now the other drivers aren't magically reversing to outdated garbage. I usually have my laptop hooked to a docking station so it's not the end of the world that I can't use the touchpad, but having to carry a mouse with me if I do want to take the laptop even into the other room is a nuisance.Unacceptable that after 4 days the touchpad became useless.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Engineered to hurt your feelings.","reviewDescription":"First off, I scrutinized this purchase to make sure it fit my needs moving forward. Acer Nitro had done great in the past for me. The excellent lifetime given by my previous Nitro 5, i5 Gtx1060  from 2018. Brought me back with established brand confidence.Then it hurt my feelings with deceptive system write ups, misleading access port specs, ect...The short version.This is a whole lot of all the right components forced to live with each other against their will. This laptop is an uncooperative disappointment.All the gripes:I picked this model specifically for its Thunderbolt 4 USB C Display Adapter Port and was thrilled about the RTX3060 GPU.It took 20 hours of setup (WTF seriously) to find out that besides all the issues that would have made it a defective return anyhow, the Display Port is hard wired to the Intel HD on-board graphics processor. It is built to fail on that point.This system has issues built into it in ways that boggle your bogs. The screen had 7 to 8 light discoloration areas around the edges like it had been beaten on from the inside. The new power cord design is something I hope they have fixed in 2023. My experience was it caused power failures when moved while plugged in.  Sudden total power failures, it was like to a blackout.Speaking of feedback, the audio on board sends back slight popping sounds.  Digital distortions from all operations and outputs was intermittent; it does seem consistent as reported by other owners of this model. Some speculation whether this is a new WinOS build issue.If you are a VR user just looking to occasionally link to a laptop, find another. It is possible but the performance of the  RTX3060 in this systems build is surprisingly dismal. At midrange settings, no ray tracing, CP2077 (Cyberpunk 2077) was not able to hold 15 FPS for any interaction beyond the menu screen. The RTX GPU and the CPU share a studio apt with inadequate airflow. It heats up fast and \"The GPU Little Dual Fans that Could\" can't . Why they even let this build go into manufacture is beyond me. This machine cannot keep baseline operating temperature while watching a Movie. This is actually the first time in 13 years of having a laptop as a critical tool of my trade that I even noticed they had any fans. I always just gave them proper ventilation. You will notice these fans thiugh, when the 95 to 110 degree air starts blasting from all possible routes. This is the GPU warning you that an \" Emergency Safety Shutdown\" is about to occur because you are playing Fortnite or whatever. This was the only helpful unintended feature. I found I had about 15 to 20 seconds to save my game or work. By the time I figured out that workflow hack, I finally admitted to myself that I had been naive and was being stubborn trying to create work arounds and validate the value of my purchase.If you are the kind of person who enjoys taking badly designed hardware platforms and tinkering with them you found a deal here..Cyberware PC, ASUS, NITRO have done well by me for the 3 previous workstations I have built on their bare bones. My 2018 Nitro 5 survived, falls, collisions and was even stepped on (In my bag) and made a cracking noise that brought so many simultaneous gasps in a room full of technicians that you could feel the air leaving the room.So please don't let this lengthy review of this one product turn you away from the brand. It has been solid so far.Goodbye 2018 Nitro 5 you were a adequate tool and a  nobel machine.R.I.P.  \"MiniPrime\"2018-2023 Death by Winter Storm  😭 Like tears in Rain,,I found it next an open window after a storm, in a puddle.Waaaah!If you read this whole thing, thanks I guess. I wish you the best in all that you give your best to.","isVerified":true,"ratingScore":2,"reviewReaction":"17 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"2 repairs needed since purchased 11 months ago...","reviewDescription":"If you're looking for a affordable gaming laptop, I'm sure this model came up. I mean, it looks cool, pricing appears reasonable, and there's room for upgrades, so what's not to like right? Well if only it was that simple.First the pros.1. Pricing.2. Ports (3 usb-a ports + 1 usb-c port + 1 hdmi port + ethernet port) ... yup, it's chunky!3. Wifi 64. upgradeable RAM5. Additional StorageFor me, I loved the fact that I could upgrade the RAM along with the SSD's and HDD. So I did just that. I swapped out the old RAM for 2 Crucial 16GB DDR4, boosting my RAM to 32GB. Not too shabby. Then, I added an additional 256GB M.2 PCle SSD and a 1TB SATA SSD making it even more chunkier.Parts List below (purchased through Newegg: Total cost $300.00):-Crucial 32GB (2 x 16GB) DDR4 2666MHz DRAM (Notebook Memory) CL19 1.2V DR SODIMM (260-pin) CT2K16G4SFD8266-Silicon Power 256GB NVMe M.2 2280 PCIe Gen3 x4 TLC SSD (SP256GBP34A60M28)-WD Blue 3D NAND 1TB Internal SSD - SATA III 6Gb\/s 2.5\"\/7mm Solid State Drive - WDS100T2B0ASo you would think it would be running amazingly well with all of this under the hood. At first, yes, but I noticed after a while that it would freeze up every now and then. Meaning the screen would freeze but would then go back to normal. I never took it anywhere so it stayed in one location on my work desk and stayed running into about 9 months of its purchased life (June 2022). Then it just died. No power. Nothing. Tried all the reset tricks but nope. Nada. So I sucked in my pride and went crying to ACER directly who shushed me and told me they would make it all better. They mentioned it was a faulty motherboard which they replaced since it was under warranty. No harm no foul. However....I've only had it for 9 months!Now here we are...2 months after I received it back from ACER and now I got the notorious black screen of death. Yup. It finally happened. Oh I've tried everything. Even turning it off and on again. But no, I must suck up my pride once again and go crying to mommy ACER to fix this yet again. And you know what they said? Of course little Timmy! Ship it to us free of charge since it's still under warranty. I mean, I'm impressed with the warranty to be honest. But they're trying to distract me from the fact that it's been 11 months since I bought this thing and have had to turn it in for repairs TWICE!!! Yeah the customer service is great, yeah the warranty is great, but c'mon!!! Oh, that brings me to my cons list:Cons (The bads, the uglies, the face palm moments)-It's loud (like standing on the tarmac loud)-Heats up fast (The cooling system isn't that great. I would recommend getting an external cooling pad)-It's Big (I call it my BBC...big black computer. errr...what were you thinking I meant?)-the power cord in the back requires a double push-in to ensure it connects (there are so many forums discussing this it's not even funny)-Requires a ton of power to run this thing. So yeah, the power brick is literally a brick.-And just because I'm picky, unfortunately you're stuck with the black & red ensemble. The glowy red color does not change. Either red or no red. That's it.So all-in-all, for under $1k bucks, you can have an okay laptop with about 1.5TB of Storage and 512gb of ram. It's loud and hot, might shut off sometimes and never come on, but long as you get the extended warranty then you've got nothing to worry about. So make SURE you get the EXTENDED warranty if you do buy it. Trust me, it pays for itself and you'll be using it sooner than you think. But if you want to save yourself a headache and have the extra $$ to burn, then you can definitely do better than this machine. Avoid if possible, but if it can't be helped then at least get the warranty. You've been warned my friend.","isVerified":true,"ratingScore":2,"reviewReaction":"16 people found this helpful","country":"United States","date":1661731200000}
{"reviewTitle":"Nonstop Issues","reviewDescription":"I've delayed this review for so long because I wanted to try to rule out every other possibility beforehand. I can't fathom what else it could be but the computer at this point.Ever since I got this computer for when I travel, it's had issues. My first week consisted of reinstalling the OS 3+ times just to fix those issues (by this point I don't even remember what those original issues were). Then, ever since then, I know I've had the issue of USB ports.The USB ports will randomly lock out inputs. My microphone will randomly cut me off often, making calls very annoying. My controller will lock up my inputs randomly and for random lengths of time, making some gaming sessions impossible. I've thoroughly checked for viruses. Nothing. I've replaced my controller and the cords for both the controller and the microphone. Nothing. Everything works perfectly on other devices, then doesn't work on this one.I've since reinstalled the OS again, going back to Windows 10 instead of 11, while also completely wiping and reformatting the hard drive this time around to get an absolutely clean slate. Seemed good for a while, but no longer. Same USB issues. Also, Python's multiprocessing package fails to multiprocess on this machine correctly, despite the same exact code working perfectly on other machines with the same OS, same IDE, and same code. At this point, I'm convinced there's just underlying issues that's affecting all of these.I can't stand it anymore. I can't keep upping my IT skills until I can build a laptop by hand. A computer repair place couldn't even correctly diagnose my issues. I'm tired of this, grandpa. I don't want to do this anymore. I'm selling this soon and finding a replacement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Can't use PIN for login without wifi","reviewDescription":"I set up a pin for my laptop when I bought it. Was using it and logging in just fine for the first week. And then took the laptop somewhere else where I wouldn't be at home or by wi-fi.I didn't realize that when you log in with your PIN it needs wi-fi to let you log in. I found this out the hard way once I was away from the wi-fi.You will get an error saying \"Something and went wrong and your PIN is not available, click here to set up a new pin.\" When you go to set up a new PIN it tells you you need Wi-Fi to do so.  I wasn't at a place where I had access to Wi-Fi and intended to do work for the day at a location away from home. If I had known you need Wi-Fi in order to use a pin I never would have set one up and it was not apparent that this was the case when I set up a pin. I'm going to try and see if I can remove the necessity to have a pin but then I worry about the security so I'll probably have to get a thumbprint login for the USB or something. If I can't figure out another solution I will be returning the laptop. I have another Windows 11 laptop that does not require Wi-Fi to do a pin login so it seems that if something specific to this computer. I think it's quite ridiculous to not have a system or you could log into a computer without wi-fi. But I mostly annoyed because there was no warning that this was the case when I set up the pin. Or if there was they did not make it obvious.Rest for speed, it does okay but it crashed when I was doing render work for video editing within the first week and what I was doing was not very intense. It also is not substantially faster than my basic laptop that has no fancy video card before rendering.It was a reasonable deal money wise but I'm not as impressed as I hoped to be. And then the pin thing happened and I was just very annoyed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Stupid Design","reviewDescription":"Most annoying is that the keys are black and requires light to see the keys.  The keys do light up so they can be seen, but the backlight goes out after 30 seconds of no activity.  The user then has to press any key to get the backlight back on, which then enters that key on whatever you are working on.  If a backlight is required to see the keys, then you would think they would make the keys a more visible color than black.  Also, and this is really stupid, the keyboard goes black every 30 sec. of no use so it can qualify for some \"Eco\" designation.  Really, how much electricity is saved by a laptop keyboard going black every 30 sec.?  There is no way to change this 30 sec. interval. Stupid!Also, for some weird reason, to adjust volume, you have to press the \"Fn\" key and then the up or down arrows instead of dedicated keys.  Stupid!  Also, the layout of the keyboard is different from other laptops. So if you're using 2 computers, you have to place your hands in different positions. Stupid!The screen image is not very sharp.  Again, 2 hands needed to change the screen brightness instead of dedicated  keys, like most computers.  The \"F\" keys for volume and brightness do not work. Stupid!I would have returned this laptop, but I had it open and was setting it up when I realized this stupid design.  I won't buy an Acer again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Very disappoiting","reviewDescription":"I had this for almost 2 years. Since day one is overwhealmingly not do the job for most some of the games. Like for the older games it would work fine but for the newer games it's just too slow. Honestly specially nowadays I am pretty sure you can find another options with better prices. Also the storage is just way too small and getting it upgraded is just a hustle.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Poor Hinge","reviewDescription":"This laptop makes a strange sound before fans kick on, runs 90c gaming and has a wobbly screen. It's brand new and the screen moves when I type, very annoying...Update: so the noise seems to be coil whine from what others have told me and it does run hot but only if you're maxing the games out, nothing a cooling pad can't fix. The wobble is annoying but I've heard it's normal, I think it's luck of the draw for that.My question is could I possibly tighten the hinge? It's not bad yet but with heavy use I could see it degrading over time.Update: hinge is already getting worse, making a clicking noise now. Frustrating thing when the laptop is now $700 vs the $800 I paid.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Not what i was expecting.","reviewDescription":"As someone who knows his way around computers after building several, knowing the market inside and out for prices on each components for just about anything. Seeing this made me gasp thinking it was a good deal when it was on sale for 850 US. i was so wrong. A 3050 with a miserable 10300h at 8gb at 2933 was a horrible combination. it is hard to just play simple high giving fps games like fornite, pubg, rocket league and many more. the only game i would cap out at 144 is rocket league and even then it would flicker every now and then to 90 or so. but other games at LOW texters no shadows whatever it may be, bottom of the barrel low barley gives you 60 and half the time your playing at 40fps. this is a honest review and i should have spent the extra hundred on something like a tuf laptop with a 17inch and better specs. this is not the computer for any real gaming. also when you receive the computer at \"256gb\" you realistically only get 180 because windows takes about 70-80 gigs just downloading. the drivers for this gpu is horrible at the moment and is bottlenecked by the absolute worst cpu i have ever used. every game is full load on gpu while the cpu cant push anything and dont think about overclocking because this computers psu wont allow it because its so bare minimum with the voltage that you cant touch anything about it besides upgrading the ram. dont go with this laptop is is HORRIBLE.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1653609600000}
{"reviewTitle":"Died after 18 months - past 1 year warranty","reviewDescription":"Laptop worked fine for what I needed it for. Had a little bit of power, nothing special, but worked. Turned it on, booted to windows - black screen. Rebooted by holding power, nothing. Keyboard lights up, fans spin for 3 seconds and then shut off. Several sites say ways to reset but nothing works. It's a brick, no warranty. Do not recommend. I've had much cheaper laptops that lasted many years and simply upgrade drives\/memory and keep trucking. Steer clear","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Wonderful gaming pc for the price","reviewDescription":"Bought this laptop solely for playing vr and other games lots of people have shot it down for idk why sure it's not a high end laptop and if that's what your looking for move on but rather it's a solid choice for the price starts take seconds, loading into vr is seamless and runs vr games vr well! Again this is not a high end computer and should be expected to have some prefromene issues but still I am very impressed by the quality of this pc for the price","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Best Bang for your Buck","reviewDescription":"I'm an architecture student and I bought this laptop as I needed an affordable but powerful laptop to run some of the architectural software (Revit, Inventor, etc) while on the go. The dedicated 3050 comes in handy when rendering finished models and the CPU is beefy enough to handle all the processing requirements these programs take.While the i5 is great for my own needs I would recommend going with the i7 if you can afford the extra costs. I haven't found a laptop yet that can beat the performance this offers at this price.However here are some drawbacks and considerations.The screen quality is great but the backlight shows slightly and the color seems a bit off compared to when I link the screen to another monitor. Maybe that's a user error, but its a noticeable difference from when I look at the same image on another screenTerrible battery life. Make sure you always have a charging cord handy and don't expect it to last the entirety of a long flight. The battery last around 4 hours with light usage. 3 hours if I'm rendering or designing. If power-saving mode is enabled you can extend this time frame at the cost of performance.Low Storage and mediocre ram. Luckily these issues can be mitigated. Additional storage slots for SSD and HHD are available to increase storage capacity. The RAM is acceptable for what I need, however, if you plan on rendering large projects or want to play some AAA games you'll want to upgrade these features.I'm very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1648166400000}
{"reviewTitle":"Perfect for Video Editors","reviewDescription":"Let me start with my job turned me on to using high powered laptop’s plugged into docking stations for productivity. This is awesome because you can take your projects with you. I use the Nitro for video editing (4k 60fps) with Adobe Premiere Pro for youtube content. This thing remders 30 min 4k vids in LESS THAN 25 minutes. My old pc took an hour and would fail at times.It runs three dell 32in monitors no problem. I suspect it will run most games spectacularly. Though you may have to adjust frame rate. The picture quality is awesomeProsPrice pointThis thing is FAST!Graphics are on par with higher 4 digit cost laptopsPicture qualityProcessing powerFast boot upGreat for video editing and moderate gamingThe keyboard is solid and big for a laptop which is a plus.ConsWindows 11Only 512gb storageIts a heavier laptopFans are loudWindows 11The battery life is… what you’d expect.Looking at maybe 1-2 hours if you’re heavy in use and maybe 3-4 woth light use and power saving settings.Lets look at the truth and that is you’re not gonna be gaming on batt power and this thing shines hooked into bigger multiple monitors. The laptop lets you carry to a buddy’s or coffee shop to continue the fun.Did I mention windows 11?Keyboard light doesn’t stay lit too long, even on power and can’t find a setting for it.","isVerified":true,"ratingScore":5,"reviewReaction":"101 people found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"After 32gb ram upgrade plays battlefield 2042 max settings.","reviewDescription":"The 8gb ram will not play current video games on high or low settings aside from counterstrike 2 \/ valorant. Battlefield 2042 lowest settings is unplayable choppy and freezes.After 32gb ram upgrade it plays battlefield 2042 on max settings perfectly and the best notebook gaming machine I've ever had.It needs the upgraded ram to function as a gaming high-end PC.CORSAIR Vengeance SODIMM DDR5 RAM 32GB (2x16GB) 5200MHz CL44 Intel XMP iCUE Compatible Computer Memory - Black (CMSX32GX5M2A5200C44)","isVerified":true,"ratingScore":5,"reviewReaction":"92 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Great display and does everything you'd a Gaming laptop to do.","reviewDescription":"I've had one for over a month with heavy use and its been great. It runs most game very smoothly at relatively high graphics. Th only downsides is that the fan can get loud and the battery life off the charger is bad. but even those aren't deal breakers especially when you can manually turn down the fan speed in the settings.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Best bang for your buck","reviewDescription":"I bought this laptop to game on World of Tanks and with standard server and all the graphics turned on high in the game settings it runs about 150fps like it’s nothing. I keep mine plugged in all the time so I’m not too worried about the short battery life. Overall great purchase laptop looks great with good performance and I’m happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Fluidez","reviewDescription":"Me llegó incluso algo mejor de lo que pedí, es muy buena calidad, muy fluida, los juegos me van perfectos en calidad media a 1080p, creo que incluso si subo la calidad aún seguirían yendo bien, se siente la pantalla de 144Hz, es muy fluida, la refrigeración es buena, aunque es laptop y se calienta como todas sigue yendo fluida, de todas formas es buena opción comprar una base refrigerante","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Buena compra","reviewDescription":"Se puede ayuda con una base refrigerante, pero en rendimiento es genial. Ya aproveche los slots qué tiene para ssd","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"It's great as a base for a good gaming PC.","reviewDescription":"The first thing you need to do is install at least 32GB of RAM and 2TB of hard drive. Everything runs smoothly. Very good.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724630400000}
{"reviewTitle":"Powerhouse for what I needed it for","reviewDescription":"It works to 3d sculpt with, it works well with gaming. Audio quality is much lower than youd expect, but not a huge deal. I wholly recommend this laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Loved then upset","reviewDescription":"I got my daughter this computer for Christmas and she has absolutely loved it.... until one of the keys broke off. Most of the time she uses an extra keyboard for gaming, she was using the laptop keyboard and the s key broke off!! I can't put it back on very upset about this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"Worst laptop","reviewDescription":"Don't waste your money buying this laptop. Bought this computer for my son's birthday a couple months ago. The screen started glitching and turn black. The lcd cable needs to be changed.  Waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1666396800000}
{"reviewTitle":"So the battery died after less than a month","reviewDescription":"It just started blinking orange and dindt turn on, when connected it won't charge, hopefully i can have a refund of this if not well whatever im sending it to someone to fix it and lose money....good luck","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1658275200000}
{"reviewTitle":"Motherboard issues","reviewDescription":"Purchased mid 2021, computer worked amazing well for 8ish months  but now all the sudden the computer can't utilize the GPU (3050) and the motherboard will not launch BIOS... if anyone has any idea what is causing this it would he greatly appreciated.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"One of the usb ports keep shorting out","reviewDescription":"One of the usb ports keep shorting out","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670630400000}
{"reviewTitle":"Requires higher than average amps from wall","reviewDescription":"This product will not charge \/ power up from all wall outlets. Worked in home location but failed to power up when connected to apartment locations. caveat emptor","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642723200000}
{"reviewTitle":"Good laptop for entry-level gaming but","reviewDescription":"Really good laptop but the Esc button gets stuck and is annoying I will like to fix it but is a really powerful laptop for entry-level gaming","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1637712000000}
{"reviewTitle":"Charger was faulty","reviewDescription":"Came with a busted charger but other than that its a great laptop","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648598400000}
{"reviewTitle":"Updated drivers?!?!","reviewDescription":"Destiny 2 originally played at 80+fps when I updated the drivers for gaming it dropped to 30fps why?!?!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1634947200000}
{"reviewTitle":"DOA computer","reviewDescription":"Computer was dead on arrival and still waiting on my refund","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1645228800000}
{"reviewTitle":"It's a pretty great gaming machine!","reviewDescription":"This particular laptop cost around $700 total when I bought it. I use it mostly for gaming, and it's been fantastic at that; I have some of the newest games (Like Baldur's Gate 3) run on max settings, and this laptop handles it like a champ! The glowing keys are extremely helpful when playing, as the neuropathy in my fingers makes playing by touch impossible. I will say, I thought this was the model that had the multicolor\/programmable key highlights. It's not, this one is just red. Still neat, though!Only thing I'd change is I wish I'd have sprung for the 1TB version (or more, if they make it). Two of my games were 150GB each, so the memory filled up almost instantly. I think you can expand the hard drive, so I'm going to try that.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Good budget laptop","reviewDescription":"No issues and runs smoothly","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Muy buena compra","reviewDescription":"Para juegos y refrigeración 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Wow this thing is fast!","reviewDescription":"I am not a gamer. I bought this for fixing my car. And boy this thing is fast!!!I’m not “into” computers, but for me it is super fast and works very well. It runs GM Software and HP Tuners like a champ.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"La mejor relación costo beneficio","reviewDescription":"Ya llevo con esta laptop casi un año y estas son mis impresiones:1. Lo que más me gustó es la capacidad de expansión: ahora tiene 32 GB de RAM (crucial 3200MHz), dos discos NVMe (256GB, y 1 TB) y uno SATA de 1 TB.2. El rendimiento para los juegos es aceptable: Halo Infinite corre a unos 90 FPS a 1080p y calidad media-baja de configuración. Otros juegos menos exigentes corren por encima de los 100 FPS.3. Hablando de la pantalla, la tasa de refresco es alta, no es tan cómoda frente a la luz directa (el brillo no es muy alto) y la representación de colores no es la mejor. No lo recomendaría para edición de video o fotografía, a menos que se contara con un monitor secundario de alta calidad.4. Para desarrollo de software es un gran equipo, el procesador, aunque ya de dos generaciones atrás, responde bien. Windows inicia inmediatamente y funciona bien para virtualización.5. La batería dura máximo 3 horas y media.6. El puerto USB C no tiene capacidades de carga de la laptop o de salida de video. Sería ideal que un tuviera un lector de tarjetas integrado.7. No tiene el switch MUX (tampoco es de esperar en el rango de precios).8. El teclado se siente bien, el touchpad después del primer mes empezó a mostrar un brillo como si tuviera años de uso, sin embargo, mantiene su funcionamiento normal.9. No es un computador muy vistoso y la calidad de los plásticos no es la mejor. Más pesado que un equipo no orientado a juegos pero sigue siendo transportable.10. La cámara y el micrófono son aceptables para videollamadas. Creo que los streamers preferirán conectar mejores dispositivos.Conclusión: revisar el precio y comparar. Si hay equipos con i5 o i7 de 12° generación o con RTX 3060, a un precio similar, sería mejor ir por esas opciones. Si el presupuesto es muy ajustado o está unos 200 dólares por debajo de la competencia, el Nitro 5 vale la pena.","isVerified":true,"ratingScore":5,"reviewReaction":"27 people found this helpful","country":"United States","date":1661990400000}
{"reviewTitle":"Awesome gaming on the go!","reviewDescription":"Really enjoy having a gaming laptop for working out of town. It plays all the games I play and even some of the modded games very well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Best bang for your Buck","reviewDescription":"Good laptop, this i5 10300 H and RTX 3050 is a great combination add a extra stick of ram make sure it’s @2933 and you should be okay. I would suggest just buying a duel channel kit of Corsair vengeance @ 2933 just to make sure the ram dimms work together probably. You can always add more storage later as Acer acutely advertises right on the laptop itself you can basically open it and add more at any time you see fit. For games like WoW open world 89-144 fps out questing. PvP epic or random around a average in the 90s fps with medium\/high settings can handle being upscaled in game to 1440p with a small performance hit. But is great at 1080p seeing it’s a smaller screen resolution @ 1080p looks amazing. color is a tad lack luster but not a dealbreaker by any means at this price point does well with fallout series and other games as well. I honestly did not expect this to perform as well as it does. Honestly I think it’s handles games just as well as a gtx 1070 or in at or right under 1660ti desktop version. The 4GB v ram is not going to be able to handle ultra setting in most newer games. but with the smaller screen turning down certain settings are going to get you great performance With almost no visual quality loss. I would take higher refresh rate over higher resolution any day certain games you may not be able to achieve the 144hz but anything over 60 is going to stay buttery smooth. You will have one extra nvme ssd slot under the one in use I do believe that can handle up to a 2TB drive and a 2.5 sata drive slot as well. I Iiked it so much my girlfriend wanted a laptop and I couldn’t justify buying anything less even though she only plays sims 4. I can’t bring myself to buy anything in the 600 to 700$ range that only runs on integrated graphics it’s just not worth the money.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1638662400000}
{"reviewTitle":"So far so good with tips.","reviewDescription":"I’ve only had this product for a day and about to take it on a trip, I’ll update if anything goes wrong but here it goes.1. Saw a lot of reviews about the laptop box arriving in a way larger box with a piece of paper used as “stuffing” this is correct… the laptop was shaking all around and I was nervous however the laptop box itself was very well packaged but Amazon could have done a lot more, easy way would just be use some bubble rap or even a lot more of the paper used to secure it.2. Opened everything up and I went to turn it on and nothing …. Kinda made me nervous but I plugged it in and it fired right up, after going through the whole setup and landing at the desktop I could see that the battery was at 80%. I think they enable it so you have to plug it in the first time you use it since it connects to the internet and does updates so that makes sense.3.  Right after going through the long tedious setup process the very first thing I did was go to settings and search for “reset”, from there you tell it to download a new copy of windows and let it do its thing. That way it gets rid of Norton and all the bloatware installed and you get a fresh vanilla copy of windows.4. Got everything back up and even installed a few games and so far everything has been great, no issues with screen, keyboard or anything else.5.  The picture of the laptop looks kinda goofy and I didn’t want this weird computer but for the price I said let’s try it. It looks very professional and it’s actually a great design In person, very sleek and everything is in the perfect spot including the charging port in the back.","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1645920000000}
{"reviewTitle":"Una ch  1  n  g  0  n  e  r  1  a","reviewDescription":"Por el precio q la agarre ,la verdad si vale la pena... Mucho mejor q la Lenovo idealpad oseria q ya estaba viejita,,, Quiensabe pero la verdad esta si esta buenala agarre por 500 y algo","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Amazing screen quality and performance at its price, but loud fans and poor speakers","reviewDescription":"The screen was sufficiently bright and could run games pretty well, but the fans were pretty loud and the speakers were kinda meh quality. The build quality of the laptop itself was very impressive, very rugged and durable, and the hinges seem like they would last at least 6-7 years.I found that you could lower the fan sound a little by setting the Power profile of your computer to Balanced, and helping it even further along by setting the display to 60 Hz, but it might require you to use Vertical Sync\/VSYNC in some games.  I was able to run Starfield at 100+ FPS on Low, but the fans were blaring at me the entire time. The fact that it also comes with SATA drive support is also very impressive, because most laptops have completely abandoned SATA support for NVME to save space and for slightly better thermal performance. This computer also has 2 fans for improved thermals (weird fact, I know, but some laptops only have 1), but they also generate twice the noise.Aside from that, this is a very solid entry-level gaming laptop and will be able to run modern games at low-medium settings for at least a few years.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Buena","reviewDescription":"Me.gusto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"For the price, this thing rules. However, upgrades may be required.","reviewDescription":"There are plenty of reviews already, so I will be brief. I got this thing over a year ago now and have used it fairly extensively. For the price I paid, it can do some serious gaming. Primarily when I got it I was looking for a high(ish) CPU clock speed, a dedicated graphics card, and enough USB ports to support a second monitor\/mouse\/external HDD.I will note that one thing about this laptop is that it has two major limiting factors. The SDD that comes with it is great for the OS, but modern games and having a bulk of files made it essentially required that I add on additional storage. My solution happened to be an external HDD, but it has space for additional internal drives.I also had problems with capping out the RAM. 8 GB is not enough for serious gaming with a modern web browser opening. I was experiencing some choppiness. I did just upgrade to 16 GB and it is running nice and smooth. If you plan on using it for a main gaming computer, consider replacing the RAM with something more appropriate.For the price, it really is hard to complain. Even with the cost of my upgrades to it, the total cost pales in comparison to the utility. If you are looking for a gaming laptop for under 1k, this is a worthy consideration imho.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Gaming laptop","reviewDescription":"Great quality  nice graphics  good battery life value for your money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"A lot of power for a budget like this.","reviewDescription":"I was looking for a new laptop and didn’t want to spend a fortune, since I already have my desktop. I wanted to be able to do other things PLUS gaming if I was somewhere else in the house other than my office. Definitely worth the money. Acer really made a legend with this one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"Crazy powerful unit","reviewDescription":"This laptop is crazy powerful and fast for the price point. Great battery life, crystal clear graphics and great built in features.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Excelente por el precio.","reviewDescription":"Cumplió la mayoría de mis expectativas, la uso para la universidad, para editar video, para jugar y rinde de maravilla.Refrigeración 10\/10, buenas temperaturas, incluye su software para elegir el modo de los ventiladores.La batería me ha llegado a durar 3 horas con ahorro de energía, bajo brillo y haciendo tareas sencillas.La cámara se ve lo suficientemente bien, no es la gran cosa pero tampoco necesito que sea un punto fuerte.Micrófono combinado con la reducción de ruido por IA se escucha muy bien para reuniones.Teclado muy bueno, suficiente recorrido y buen tacto, la retroiluminacion funciona bien con diferente intensidad, solo es rojo pero funciona.El i5-12500h, va de maravilla, nunca he logrado usarlo al 100%, no importa cuántas cosas este haciendo multitarea. Es una maravilla.La 3050ti, es una gráfica de la gen pasada pero rinde lo suficiente, en juegos AAA nuevos si va a 100% pero siempre arriba de 60fps en especial con tecnologías como dlss. Su límite creo que son los 4gb de vram.Recomiendo mucho la versión con 16gb ram, hoy en día son una necesidad.Los puertos son muy variados y son todo lo que necesito, varios USB 3.2, USB-c, HDMI 2.1, Puerto Ethernet, jack de auriculares.Los únicos contras que le ví son:1. El trackpad no es tan fluido, se te traba el dedo, he usado mejores en computadoras más baratas, pero en lo personal siempre la uso con un mouse aparte y casi nunca uso el trackpad pero cuando salgo y no llevo mouse si se nota que es un punto débil.2. El brillo de la pantalla, me parece poco. Obvio no es una computadora para exteriores, pero incluso en interiores, a veces siento necesitar más brillo. Fuera de eso la pantalla se ve muy bien.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Excelente","reviewDescription":"Máquina muy buena cumple con todas las especificaciones y expectativas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Best laptop for your money, if memory ain't an issue...","reviewDescription":"Basically, the best budget computer. Yeah, including Desktops.You're telling me I can buy a gaming computer that outperforms AND replaces Xbox, can be used on the go, and only costs 800$?? That's amazing. Gaming laptops have never been more affordable, and powerful, all at once. Half the price of your standard gaming laptops, without the assembly of a gaming desktop.Enough gushing, though. It's not perfect. At this price, you can play generally any of the standard games with only minor problems. I played Halo Infinite and Modern Warfare well, loading faster than my Xbox buddies, but some menu navigation issues here and there were difficult to ignore. These games themselves run very well, but really push your computer's GPU, which means don't expect to play high end games for long without charging. That is to be expected.The material that makes this computer aren't the best, but good for the money. It's not the most delicate computer, but maybe don't go crazy and throw it or spill anything on it. It's a bit heavy if you plan to vibe out in bed or on the couch. Definitely don't game with this thing on your lap. Keyboard is so-so. Maybe don't eat over this computer unless you are okay with crumbs in the keyboard. Speakers are fantastic in my opinion. You can connect some Bluetooth speakers or earphones easily if you think otherwise.The AN515 model, the cheaper 800$ish you're likely looking at, you'll gonna lacking in RAM and SSD memory. It's not the end of the world...who am I kidding? 250gb SSD? That's way to small! Maybe consider the models with more RAM and Storage. They can run between 1000-1200$, but if you can afford it, or upgrade the RAM and storage yourself, it makes a world of difference. The most you'll need is an external HDD, which is maybe 80$ for 1tb. Still cheaper than most laptops and desktops.The Nitro 5 is definitely the best computer for a budget or if you're starting out and want a computer you can play right out the box. This can replace your Xbox, or a spare Xbox when you have friends over. This plays the majority of PC games at good resolution and framerate.  As a casual laptop for websurfing, videos, programming, Photoshop, you're in good hands, and can be easily upgraded if RAM or memory is an issue. Think of it as a portable desktop, or even a portable Xbox. You won't be disappointed, especially at this price. Great for newcomers.","isVerified":true,"ratingScore":5,"reviewReaction":"50 people found this helpful","country":"United States","date":1645056000000}
{"reviewTitle":"Acer laptop","reviewDescription":"Awesome laptop. I purchased the laptop for my son and he's very happy with it. The games run fine and graphics are awesome. Highly recommend. The laptop was also delivered with care.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Buena computadora y bastante práctica para juegos de bajos y medios requisitos","reviewDescription":"Fue un regalo, pero quién lo recibió me ha dicho que le ha servido bastante y puede jugar el helldivers 2 sin problemas.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"The nitro key is THE WORST, it absolutely RUINS this model, and is DRIVING ME INSANE","reviewDescription":"It sounds silly, but there is one fatal flaw in this laptop design: the 'nitro' key. This key is positioned next to the Backspace key, and absolutely RUINS the user experience. It's so bad it makes me want to toss this laptop out the window and buy a different one (I don't have the money). Whoever designed this needs to be FIRED, and I don't say that lightly. I'm pro-worker! Pro-union! Extremely anti-nitro key. Definitely a fireable offense, I'm sorry. Terrible oversight. The should fire the designer's supervisor as well, and perhaps every product tester they employed. Just my 2-cents.Imagine you're typing up a paper for work or school. When you inevitably reach up to tap the Backspace key, your finger isn't perfectly centered. Maybe your nails are slightly too long, causing you fingertip to slip, or perhaps you were typing a bit too fast and your coordination lagged for a moment. It doesn't matter the reason, because the reality is that you're gonna hit that ridiculous \"nitro\" button, positioned immediately behind the Backspace key. After that you have approximately 2 seconds to close out of the start-up prompt before the computer fully engages the program, opening it over top of whatever important thing you were working on and turning your laptop's fans on jet engine mode (opening the program that manages this laptop's fans is apparently very taxing for the laptop????).Trust me, this WILL happen to you, and it will happen A LOT. SO MUCH. It's really driving me insane, but you cannot grasp just how often I open the annoying fan app on my laptop when all I want to do is fix my dang typos. And you gotta wait for the program to boot up, it's not like you have the time to keep typing while it loads. I begged my boyfriend (a computer science graduate) to help me turn off the sticky key, creating a dead useless nitro key that takes up space on my keyboard for no reason. He did, and everything was OK for a while, but guess what? Acer must've done some crazy update or something, BECAUSE THE NITRO KEY IS BACK and as annoying as ever. When you go to the Acer website, desperate for a way to get relief from the terrible nitro key, THE INSTRUCTIONS THEY PROVIDE ARE USELESS. The options that their example solution provides literally DO NOT EXIST. The fact they had to dedicate a page of their website to turning off their terrible nitro key says a lot, but the fact that their instructions to do so are completely wrong says even more. The nitro key is cursed I tell you! Cursed!DO NOT BUY THIS MODEL IF YOU WANT TO KEEP YOUR SANITY. DO. NOT. BUY. THIS. LAPTOP. If you're ignoring my warning and press on, I'll give an honest review on some other features:- anti-glare screen is actually very nice and useful, though I was a bit put off by it at first- key backlighting only works once you've pressed a key, not just from moving the mouse; good luck finding that first key in the dark lol. hopefully you don't accidentally press that nitro key...- battery dies fast; you get about 2.5 hours unplugged, even brand new out of the box- fans are way too loud. yeah, i get to play my favorite games, but I can't hear them unless I have my earbuds in and turned up to the point of damaging my poor cochleas- you cannot adjust fan settings. even if you drag the little dials that determine each fan's power, they literally do nothing. I think it's like when you're at a crosswalk and you press that little button to make it switch to pedestrian crossing faster but it doesn't really do anything except pacify you. that's what the fan settings on this laptop are like.- audio quality sucks noticeably, plus this laptop never gets loud enough to hear over its godforsaken fans- i like that this laptop has some weight to it, it doesn't feel super fragile and paper-thin like so many others on the market todayDo not buy this laptop. Trust me. It's a piece of junk.","isVerified":true,"ratingScore":1,"reviewReaction":"40 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Will not turn on or charge after 4 days of using it.","reviewDescription":"Firstly, I would like to mention that despite the fact that this laptop stopped working after 4 days, the other features and performance of it were very positive. If it wasn't for it dying, I would leave a 5 star review.Secondly, I would like to mention that I know how to do maintenance on laptops, and I can't locate a simple problem like a lose cord. So the problem is nothing simple.Thirdly, I have been handling this laptop far better than all the others I have ever owned. And this one has not even moved from the spot I had it in.I received this laptop Sunday night (7\/21\/24) and set it up the same night. The next morning, I had everything installed and signed in and it was working great. Opening applications fast, running several different things at once well. And I even upgraded the RAM by 16gb (so it had 24gb) so it ran games a lot better too. The laptop would not turn on or charge Wednesday morning (7\/24\/24). It was completely locked up.VERDICT: IF this laptop did not die, it would've been spectacular. ONLY IF you are willing to gamble 750-ish dollars on this laptop, and have it either die or do great, I recommend fully.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Amazon won’t guarantee what you get!","reviewDescription":"We bought this laptop NEW for our son for Christmas last year. Right before Christmas, we unpackaged the laptop to get it all set up so it was ready to go Christmas morning. To our surprise - the laptop would not turn on. We tried several different ways and we still could not get the laptop to turn on. So, we called Acer customer service to see what was going on. The Acer rep told us that our laptop had been serviced in September for issues! We told him that that couldn’t be so because we just bought it brand new off of Amazon - he insisted that it was a refurbished laptop and even had case #’s for the services done to the laptop in September. We immediately called Amazon, to complain that we had purchased a new laptop from them and had received a used one. It took a half hour of bickering with the rep before she offered to “speak with her manager” to issue us a refund of the difference in price. Unfortunately, it was too close to Christmas to return and receive an actual new laptop in time for Christmas morning. Amazon eventually gave me the refund of the price difference and the rep stated that “Amazon has no control over whether a customer receives a refurbished or NEW laptop!” Are you kidding me?! They are sure to make you pay different price points though - even though they don’t know what you’re actually going to receive.Although - my son was thrilled to get this laptop - you can imagine our disgust. To top it off - the laptop lasted less than six months before the screen went out on it. Do you think I can find a replacement screen? What a joke. Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1669680000000}
{"reviewTitle":"Black screen when playing","reviewDescription":"I bought this less than a month ago but I'm already having this issue. Every time I play a game, it goes black screen with fans, keyboard and mouse on. I only play classic games and not AAA games. Temperature is at 50-70s. The only fix is to force shut down which is kinda annoying. It works perfectly well if you only use it for browsing and work but not for gaming.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Essentially DOA","reviewDescription":"When I recieved the laptop, it was in perfect physical condition, but it kept crashing due to hypervisor errors during setup (every 3-5mins) It also kept losing connection to the wifi. After spending about 4 hours giving it the benefit of the doubt trying to make sure it had all its updated drivers (it arrived with roughly 2 hours of updates missing) the same error still occurred every 3-5 mins. I called acer, after some quick troubleshooting, they requested for me to send it out to them. The shipping & repair time were quick. I recieved it back within the 5-10 days promised, only to find... the exact same error. It immediately threw identical hypervisor errors (I dont know how Acer support missed those and said it was fixed) to which I called acer, and they said I'd need to mail it back.  Thankfully, I wasn't outside of Amazon's return policy yet, so I returned it to the seller instead. Take the 1* reviews seriously; my husband and I saw a few people had issues, so we tested ours almost immediately. The specs on the device are great, but we were given an error-riddled device.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Are you kidding me","reviewDescription":"Bought 2 months ago screen kept flashing and kicked me out of my game. Sent in for repair all they did was flash bios and reinstall windows. Tried to install game and play but they locked me out and I can't install drivers because they are the administrator now..... call support again they are sending me a recovery drive...... two and a half weeks later call again they never sent the drive and say it will be another 2 to 3 days for a confirmation email and 6 to 8 days delivery. Basically I have a paperweight \"gaming\" computer.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"I wouldn’t buy.","reviewDescription":"This laptop worked fantastically for a good few days but it started to degrade quickly. The screen would randomly go black then would fix itself after a few seconds which is concerning since I just bought this laptop. After a few more days I was trying to play a game online and my fans ramped up to 100 and there’s nothing I can do to fix it. Not to mention this entire time I’ve owned this laptop the battery life has just been crap. I do not recommend this money and I will probably look into getting a refund if I cannot resolve this issue.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1716768000000}
{"reviewTitle":"It's good, if it works","reviewDescription":"It works great if it works. The specs are great but the battery keeps saying it doesn't detect the charger ans literally kills itself before it will charge. It's so annoying. This is the key flaw with this laptop. I haven't found a fix for it yet.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Might have been nice, but it's dead right out of the box","reviewDescription":"Power brick is live, but no life at all from the Acer.  No fans, no LEDs, held down power button for minutes, paper clipped the reset button in back.  Stayed cold.  Don't know what's up with it, but it's a brick","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Return within 24 hours.  DO NOT BUY!!!","reviewDescription":"Don’t waste your money.  If I could it 0 stars I would.  Was setting it up and turned off within 30 minutes.  Would not turn back on and customer support was no help.  Don’t waste your time with this Laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Tarde pero seguro","reviewDescription":"Mi ladtop tardo en llegar, x problemas de envio pero llego al final. Es de execelente material y es leas a lo q se promociona. Teclas suaves y todo bien protegido para q te llegue a tus manos. Excelente calidad de cargado y aun estoy probando respuesta de sistema y sus cosas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Good value for gaming laptop","reviewDescription":"I used to play world of warcraft 11 years ago but the game got ahead of my technology. So I had to give it up. in  Facebook group I saw this laptop recommended as a good value for a gaming laptop. I decided to treat myself. I love it! I love how the keyboard lights up, I love how it boots up quickly, the great response in gameplay. The only thing that I do not like about it is the battery life is like 3 hours. I called the acer help desk to see is this is a problem. I was told that this is normal. This is not a problem for me because I do not travel and can plug it in when I need the battery recharged. This might be a problem for other folks.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Good Piece of Portable Tech","reviewDescription":"It's not going to win any races. It's not the fastest, but it gets the job done. I added a larger RAM kit and a second hard drive, because that is the kind of thing I do, but it was very usable right out of the box.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"Incredible gaming PC when on a budget!","reviewDescription":"LOVE this computer. Bought this to replace a near-10 year old computer I had which was on it's last legs. I knew I wanted a computer which was capable of playing high-graphics games at a decent fps, and this computer delivers.Great graphics quality, very good processing speed, good sound quality, good storage. My only issue, and this is pretty minor, is that the cooling fans are a bit loud. But they definitely are doing their job, and I so far haven't had any issues with my computer feeling too hot.8\/10 purchase. Only wish the fans were a bit quieter, and the storage was a bit bigger. Otherwise, an excellent computer.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Excelente máquina","reviewDescription":"Sin problema, sin conflicto entre programas, fácil manejo y las opciones, casi que XP parte tres o Windows Vista parte 2, me encantó, la pantalla cuesta acostumbrarse si trabajas con programas viejos que no estén hechos para HD, he jugado Starcraft y no chistea","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Excellent laptop","reviewDescription":"Came in good condition, excellent performance for price been gaming on it solid for about a month and I gotta say it does not disappoint","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Buen equipo Exlente Precio🙏👍","reviewDescription":"Rápido, un obsequio para mi sobrino q estudia Diseño Gráfico. Excelente maquina","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Excellent secondary or beginner gaming computer.","reviewDescription":"I bought the Acer Nitro 5 with the i5 10300H CPU and the RTX 3050. I upgraded to 16 GB of RAM and added a 1 TB internal SSD and the review is based on the computer after the upgrades.Pros:-The visual fidelity is outstanding. Games like Battlefield 4 and 5 run perfectly and look amazing. Forza -Horizon 4 runs amazing at high FPS around 80 to 90 on high settings.-The Windows home screen and Cortana work great since it has a built in mic and designated buttons on the keyboard. Much better usage than on a PC.-It is very lightweight and portable.-Screen has soft colors but is very crisp.-Boot times are very fast.Cons-The battery life is atrocious but who isn't gaming without plugging in first? Watching Youtube only the battery lasted unplugged around 3 hours.-The laptop gets pretty warm and the fans are loud almost instantly loading into a game. This is not a huge issue for anyone wearing headphones.-The layout of the keyboard is very tight and you will click the wrong keys at some point. Also the touchpad is in a very strange position offset to the left so you'll want to disable it and use a mouse.Overall, this is a fantastic laptop for anyone getting into gaming computing. I own a PC with a 2080ti and even still am impressed by this little computer. The budgeting option to spend $168 a month for 5 months was a no brainer to me. If you are going to buy a laptop for any reason, might as well get a gaming one like this!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1634860800000}
{"reviewTitle":"Unleash your gaming potential","reviewDescription":"I bought this for my 9 yr old grandson. the Acer Nitro 5 AN515-55-53E5 Gaming Laptop, and he's loving it! The Intel Core i5-10300H processor and NVIDIA GeForce RTX 3050 Laptop GPU make it a powerhouse for gaming and other tasks. The 15.6\" FHD 144Hz IPS Display is a visual treat, and the backlit keyboard is a nice touch. The laptop is sleek and stylish, and I love the way it looks. Overall, I’m very happy with my purchase and would recommend it to anyone looking for a high-performance gaming laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Gets the job done","reviewDescription":"Call of duty, Helldivers, And Star Citizen on Ultra with little to no problems","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Impressive","reviewDescription":"First off, thank you for the reviews saying to ignore the 1 star \"won't turn on reviews.\" 2 clicks when plugging it in!Arrived on time, runs great, and it'll run all the newest games, for probably several years to come as it's an rtx with directx12 ultra.  I went with the cheapest option, mainly just wanted to turn on Ray Tracing in Minecraft, yet totally impressed. It's an i5, but one made specifically for gaming, 3 times the voltage, twice the thread count, and slightly better then the i7 9th and Ryzen 5. Currently the 6th best benchmarked chip despite being now 2 gens old. Ram is easy to upgrade, just a couple screws.As for frames per second, I could only find 2 games that dropped it under 100 in performance mode\/game mode with ultra on: Cyberpunk at 70, and ghost recon at 45.I'd say it's weakest link is actually the wifi. Plugging in an Ethernet I was capped by Steam at 100mbs, but wirelessly, 10mbs.  Even did a broadband check at speakeasy, 10mbs. Fiddled with every setting, driver and windows update to no avail. Still happy with my purchase, just seems weird I could of downloaded 7 times faster with any other device in the house.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1659571200000}
{"reviewTitle":"Solid machine","reviewDescription":"So first off for the price of this laptop, you get a whole lot! Since my purchase it’s been nothing but great, great screen, fast, and gaming is absolutely fine! I highly recommend this purchase if your looking for budget friendly laptop as well as solid performance!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Excellent laptop for the price!","reviewDescription":"At this price, you'll have a hard time finding the same raw power anywhere else. So far, I've played No Man's Sky and Planetside 2 (at default settings) with no framerate issues that I can notice. Minecraft with RTX also works. It has a few framerate hiccups, but I've seen the same from some desktop RTX cards.The screen is nice. The colors aren't washed out by the backlight, like in other laptops, and the higher refresh rate makes everything feel liquidy smooth.A big factor that drives the price down is, of course, the storage. The more modern games you'll probably want to play on this machine are usually 50+ GB in size, and at that rate, the 250 GB hard drive is going to fill up in no time. Just remember that the storage is extremely upgradeable--another feature that's hard to find in laptops at this price point. Don't need a ton of storage? Great, enjoy the low price. Need more storage? The option's there for you when you're ready.P.S. I was wary at first, because Acer has a bit of a \"you get what you pay for\" reputation. But I've had it for about a month now, and haven't encountered any issues. I also purchased the 4-year protection plan, just in case.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1647302400000}
{"reviewTitle":"Great upgrade from using a business laptop where GPU is part of CPU","reviewDescription":"Very impressed with this my first gaming laptop. While personally I have always owned Macs, I down have ownership of a few noteworthy games that are now Windows only I had to finally bite the bullet. Veryimpressed so fr. I had 2 \"disappointment, none are earth shattering, while I would have loved to change the color of the keyboard, I'll settle for it lighting when I need it with a steady red glow. Also not that keen on Win 11 but I'm smart enough not to try and retro fit the OS.  I will be looking at additional drive storage, but the memory was a wise choice at 16GB. I see there are icon above the keyboard, but they do not light up and the also would have been handy. But is working and doing a great job!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"A gift","reviewDescription":"I bought this for my grandson, he says it a very good laptop he loves it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Very good for the price :)","reviewDescription":"This is my first laptop after a decade and I am very happy to purchase this one. So many good words about Nitro 5s, even this one is not one of the better ones, I added another 8Gb ram and 2 TB 2.5 SSD to make it bit more usable. Not that anything wrong with 8Gb ram and 256Gb SSD but 8Gb rams are not that expensive at all these days.. I had 2TB SSD from my big computer, just switched it over. Talking about upgrading the laptop, it's so easy. Comes with everything you need to add another 2.5 SSD. YouTube videos helped me out though, made my job a lot easier. This computer does play FPS games, and plays them very smooth. The fans start running though, and you might think it's overheating, that's not the case, it's normal. They don't go full speed. I also play mobile games and stream through laptop... no heating no fan issues at all... it's like so smooth and easy for the machine. For this price, I highly recommend it, if you are in a tight budged like I am. One more thing for this laptop, I am going to travel Europe next year, and it won't be problem bringing it with me, since it is travel friendly :)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1634688000000}
{"reviewTitle":"Nice gaming computer","reviewDescription":"Perfect Xmas gift for my 14 yr old who had been asking for a gaming computer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Great Visuals. Great for Technical Work. Great Computer","reviewDescription":"This computer works well as promised.I'm a freelancer helping clients with video editing\/marketing work and find this laptop to be a great upgrade to my prior equipment.Running programs such as CAPCUT, Adobe Premiere, and online courses are smooth and effective.Very smooth. Happy I bought it.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Just what I needed... it delivered","reviewDescription":"Awsome... great price. .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"The perfect mobile flight sim computer","reviewDescription":"X that I could take on vacations or winter get-a-ways that had the capability of running X Plane 12 and this fills the bill !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Don't waste your money..","reviewDescription":"While I enjoyed the computer initially, after purchasing a new 1tb hard drive to install in the machine, I've realized the geniuses at ACER have made it almost impossible to change the boot order in BIOS, making it impossible to install Windows from a USB. Why any company in their right mind would do this, I don't know.. but I wouldn't recommend wasting your money on this trash.Edit - So I ended having to return the new drive that I bought for the laptop, and purchased an M2 drive, to replace the one that was in there, this was how I solved the problem. The laptop has the ability to add 2  M2 drives, and one 2.5 drive. I wanted to remove the M2 drive that came with it, and just install the 1tb 2.5 SSD... but that was not possible, and I was in contact with support on multiple occasions. Since then, I have had no issues with the laptop. I wish it could be upgraded past 32gb RAM, but I guess this are the limitations that come when buying a \"budget\" laptop, which this considered to be. Laptop works great for what I use it for, which is video editing. I don't use it for any gaming, so can't speak on that part.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"FEW PROBLEMS BUT IT WAS WORTH THE COST","reviewDescription":"Model & Specs: Acer Nitro 5 AN515-55-53E5 | Intel Core i5-10300H | NVIDIA GeForce RTX 3050I had this laptop for a little over 2 years and, despite the problems, I'm pretty happy with it.First a Warning: The new laptop didn't turn on and I thought it was DOA but it was b\/c you have to push the power plug fairly hard into it to hear the *snap*.Whether for gaming or something else, its CPU & GPU are strong, but you'll need to buy additional SSD & RAM to really make it shine.PROS:- The CPU & GPU are excellent for the price. (This is the biggest PRO)- Great cooling ~ I never had an overheating problem while using a cooling pad.- Easy access to multiple slots for adding extra Storage & RAM.- Backlit keyboard is really nice, even when using it in a well-lit room.CONS:- 2 USB ports died after 10 months. Sending it in for repairs takes over a week so I had to buy the $50 part and replace it myself.- The mousepad started acting jumpy and annoying to use. No problems with using a mouse but sucks for pad users and I've never had this problem with other laptops before.- The Delete [Del] key, in the top-right corner, is moved one space to the left and [Home] key is in its place. Didn't think moving 1 key out of place would be so annoying but I always find myself pressing the \"Home\" key when I want to press \"Delete.\"","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Best Priced for the Quality!","reviewDescription":"I've been searching and reading about all the different laptops because they don't make them like my old Toshiba laptop anymore. Mine finally died after replacing parts for over 12 years. This one was missing the RGB customization for the keyboard and I love having 2 mouse click buttons at the bottom of the mouse touchpad but it's impossible to find that now besides the Lenovo's Thinkpad. The camera quality could be better than expected and some of the keyboard keys are smaller when trying to type on here but I think this should suffice me for the next several years. I'd suggest buying a webcam for clear picture quality if purchasing this and using it a lot. I also think for the price, they could've made the \"N\" logo on the bottom of the screen light up as well with the keyboard.BTW**TO DISABLE THE TIMEOUT ON THE BACKLIT KEYBOARD:You have to go into Nitrosense. Personal Settings. Keyboard. Press the toggle button next to Disable 30-second backlit keyboard timeout.These instructions are different from the other laptops and took me days to figure out 😅","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Good Laptop for the price","reviewDescription":"The Specs and the price were a great match when I bought it. The laptop is noisy while playing as all the fans start. You can add more memory according to your needs. It comes with a padded sleeve, so you can carry it in a non-laptop-friendly backpack.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Fit for purpose","reviewDescription":"It meets what my boy needs for his perfect higher education engeering requirements.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Powerful machine","reviewDescription":"Using it to write this review right now!Powerful gaming machine with great memory and gpu which can run all modern games at max settings.Battery last no time, has to be plugged in regularly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Great for quick set up gaming","reviewDescription":"Really big fan of this laptop. It handles modern games extremely well, the screen is a great mix of size and quality. The biggest thing to keep in mind, this is a great machine for transporting from house to house, or coffee shop, or office. This does not do well with long battery life. It's a great solution if you are trying to save on space or know you will need to move every now and then to another work\/game area.This is not an everyday carry to do office work on the airplane or train. The laptop battery goes fast, and the whole setup is on the heavier side.If you need something to travel with, this isn't it.If you want something you can set up at home, but the ease to move it every now and then to take elsewhere, this is exactly what you want.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Eficiencia","reviewDescription":"¡Muy buen servicio! El artículo llegó intacto y al tiempo indicado.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Upgrade!","reviewDescription":"Great upgrade from my last computer","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Great laptop but bad battery","reviewDescription":"Its a great gaming laptop, especially for the price. My only complaint is that the battery drain is awful. A less than 10 min game play took it from 80 to 40 something. Great otherwise.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Great Reasonable Gaming Laptop","reviewDescription":"Going in, I thought this might be a disappointment. It was at first because I fell pray to the tricky charging port. I plugged it in, didn't turn on at all. I unplugged, tried again. Nothing. I was furious. I called support and they did tell me it was tricky. You have to push it into the port harder than you think and it will click. I will admit, I was being gentle because it was a new laptop, but push the port in a little harder than you think and it will click and charge. I felt so stupid. It's unusual to have to be a little rough, but it has worked spectacularly and I haven't had a problem at all. Runs everything I need it to run and runs online games flawlessly. I will buy another one when they are on sale again.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1661040000000}
{"reviewTitle":"An excellent option for limited budget!","reviewDescription":"So, I was tracking it's price for a few months and it reached it lowest price in Black Friday so I didn't hesitate. After almost six months of use I'm really glad of the results, I bought it mostly for work, present content in virtual meetings while having some programs running. Since the beginning I only ran a few games (Halo Infinite and Destiny) because the storage is a huge limitation, but after a few months I bought an extra ssd plus 8gb for ram and the results are really admirable. Must games run smoothly at high definition (not top but four out of five) and in some more demanding games you can still play in good quality. Lately I plugged it to the tv (standard Samsung) to play a little more comfortable and my experience has been really pleasant. No crashes until now. I've tried RE2, DBZ Fighterz, COD and FIFA22.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"3 months in and it still seems to be running great","reviewDescription":"I had this laptop about 3 months now and everything still seems to be doing pretty good. the temp never went over 200 degrees F... but I do have it on a cooling pad, and I turn the internal cooling fans on the highest settings with the nitro sense when i play something somewhat intensive and I don't play many intensive games. the I5 core will most likely have a rough time playing the latest games but it will run something like escape from tarkov like butter at 75 to over 100 fps in ultra-settings. you might want to get another 8gig stick of ram to pop in and upgrade the ssd storage but over all I'm very satisfied for what this computer is and can do. it is my very first gaming laptop and I feel it somewhat replaced my xbox. for someone who's never had a dedicated laptop for gaming or a computer at all, I feel this is one of the best first steps into pc gaming.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1638576000000}
{"reviewTitle":"Push the plug in all the way!","reviewDescription":"This was the first gaming computer I ever bought, so I had no idea that the plugs were different from regular computers. When I first plugged it in and tried to turn it on, nothing happened. I thought I got a bum computer! I called the number on the package and was told that gaming computers have different plugs than standard computers, and that I had to push the plug into the back of the computer all the way until I heard a click. I thought I had, but when I pushed on it again I heard the click and it started right up.Onto the computer itself... the graphics are great, the speed has worked well for all the games used so far (Minecraft, Bloons TD6, etc.), the picture is vivid, and I have no complaints so far!","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1665619200000}
{"reviewTitle":"Excellent Laptop","reviewDescription":"Being able to upgrade a laptop, and was easy to do, with a great screen, fast processor, good graphics, and efficient cooling, for a good price was important to me and this one checked all the boxes. I've been using this laptop for about 3 weeks now and I love it. The only issue I have is using a KVM switch to switch between my work computer and this one using a single monitor, this laptop would not switch back. So, I would have to unplug the HDMI cable and plug it back in to get it to switch. Not sure why this is happening. Tried several different cables but still same problem. It could be the switch I'm using but it does work with an older laptop I have. Other than that it's a great laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1661731200000}
{"reviewTitle":"Great laptop for my 12 year old","reviewDescription":"I bought this laptop for my 12 year old. It’s his first laptop and he mainly uses it to play Roblox. It works well for him and the price wasn’t so bad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Works great","reviewDescription":"For the price, does well and runs games smoothly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Love it","reviewDescription":"Using it for work - mostly office stuff.  It is fast and quiet.  Love it.  And it looks cool","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Runs amazing with the sims 4","reviewDescription":"I mainly got this gaming laptop for the sims 4 because I have almost every single add on you can get for it and a few mods. I have been playing on a regular laptop for years! It was always so laggy and took forever to load even to just the main screen. I had it now for about 2 ish months and WOW it works amazing and runs smoothly. I also have Apex Legends and Life is Strange installed and they also run amazingly smooth!! I do have a lot of add on and mods so my sim game is the tiniest bit lag but not enough to bother me! I give is a solid 9.5\/10 I gave it a 9.5 because it does get hot so I got a cooling laptop stand and haven’t had any problems so far!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"Bien","reviewDescription":"Bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Easy to upgrade 2nd HDD, ideal for gaming.  Ship to HK in 5days","reviewDescription":"144Hz refresh rate gives smooth scrolling and gaming","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636848000000}
{"reviewTitle":"Great quality for the price","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1643328000000}
{"reviewTitle":"Es rapida","reviewDescription":"No tiene mucha memoria","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640217600000}
{"reviewTitle":"Es un producto bueno","reviewDescription":"Para trabajar en familia","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636848000000}
{"reviewTitle":"Pretty good gaming laptop.","reviewDescription":"Review for the \"Acer Nitro V Gaming Laptop | Intel Core i5-13420H Processor | NVIDIA GeForce RTX 4050\".In my opinion the webcam is okay but quite noisy. The little microphones sound okay. Wish there was a hardware disable switch for the webcam and microphones.Gaming performance seems good for 1920x1080p Gaming at medium settings. In BFV while using performance mode I never dropped below 60FPS while at medium settings.Fan noise is a lot louder in performance mode, but if you switch to balanced mode then your FPS will suffer at the gain of decreased noise level.The screen is 144Hz which is great for non-intensive games and scrolling. It also seems pretty good with color accuracy.The CPU and GPU seem well matched performance wise. However, battery life is not great.There is only 8GB of RAM Which seemed in my testing to be fine if you're not doing too much at the same time. I only had a couple things open in the background while gaming and the RAM usage was at about 94%. So if you plan on doing more than one activity at the same time then I recommend getting 16GB of RAM.I thought the speakers sounded really good, and even without headphones I was able to track enemy positions. At max volume you will feel the explosions.The keyboard seems good to me. Not the best I have used, but it's good. For a laptop there is a lot of key travel, although there is some key wobble and the key corners sink too much for me. The backlight does not shine through the key letters.Overall, I think it can play games and give you a pretty good user experience. There was not too much bloatware, but I got rid of the McAfee before I did anything else. Trackpad is okay, screen is good, keyboard is mostly good, speakers are good. Internet connection with ethernet is fantastic.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Good performance but very lacklustt control over the performance","reviewDescription":"The setup was easy as it was a standard Windows setup, and the laptop itself feels solidly constructed as much as a plastic case laptop can feel. The keys feel alright, like typical scissor switch laptop keys and the screen is pretty good and clear looking.The primary focus of the laptop of course is gaming performance and in that front the laptop performs quite admirably. While plugged in with the included charger, the performance is on pair with a desktop 3050 but, however, when not plugged in and the max performance mode isn't able to be used, the performance is about 20 to 30 percent worse which is probably for the best though since when not plugged in this bad boy burns through the battery juice like nobodies business with the battery going down a percent basically every minute and a half while gaming.The battery life while not gaming is better but still not too great as the battery still goes down at an appreciable rate of about a percent every 2.5 minutes. Luckily, you can charge the laptop using usb c so you can charge the laptop using a power bank while you're not hooked up to a wall. The 65 watt usb c charging is enough to counteract the drain while gaming, but for some reason while charging this way the performance takes a leap down of about 20 percent, being even worse than when the laptop is on battery even though the laptop is being charged just not with the included charger.This brings me to the worse part about this laptop which is the horrendous amount of control that is given in terms of the performance and fan speed. The software is ass when it comes to fine tuning the power of the GPU and CPU as there are basically only 3 settings - eco, normal, and max. Similarly, the fan speeds have only around 7 speeds and the difference between each is too great so you can't get the noise level or heat of the GPU or CPU down to the amount that you actually want. As far as I know there is no way for any additional amount of control to be given since afterburner doesn't work as the GPU just throttles down to the standard performance setting.Still, the performance of the laptop is satisfactory, and it will run any games on the go as long as you adjust the settings to be lower since the laptop doesn't have too much power especially when not plugged into a wall and even more so when charging using a power bank using usb c which you may want to do whenever you want to use the laptop but also want to maintain the battery percentage but don't have an outlet to plug into.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Great for gaming","reviewDescription":"The whole thing is made mostly of plastic, but doesn't look low-end at all. The design is very nice and relatively thin. The keyboard feels average, not suitable for typing, but fine for gaming, and it doesn't support RGB settings. But the touchpad is better than expected. The screen isn't too narrow, but it's not too wide either, which is nice. The screen is a 15-inch matte screen, does not support touch, and is of average quality. Because of its 1080 resolution, there's noticeable graininess on the 15-inch screen, but it supports a 144 refresh rate, which is great for gaming. The heat dissipation vent in the upper right corner is a bit awkward, as it blows hot air towards the display for a long time. I wonder if there will be permanent damage to the monitor later on.In performance mode, when running Cyberpunk 2077, the CPU performance can reach up to 20W, and the 4050 has a maximum performance of 75W. The average performance is about 56 frames, with a maximum of 85 frames and a minimum of 41 frames. The graphics card temperature was about 170 degrees Fahrenheit, but the keyboard position was only about 90 degrees Fahrenheit. , does not affect normal use at all, and the game is still smooth, because the monitor only supports up to 1080. Then use furmark to use 100% of both the CPU and graphics card. The maximum temperature is only about 170 degrees, the GPU power consumption is 75w, and the CPU is 20w. The fan is a bit noisy, but the cooling effect is good.Laptops in 2024 only have 8g of memory, which is indeed less, but you can add an extra piece of ddr5 memory. There are also a total of two SSD slots, m2 ssd PCIE x 4, and a 512G one is included. Equipped with a 57Wh battery, it can be used for about 4 hours under normal use. If used at full capacity, it can only last for one hour. There are also built-in speakers, the sound quality is very poor, and there is a popping sound when turned up to the maximum volume.This entry-level game console is actually equipped with Thunderbolt 4, which is very surprising. It can be used to connect external displays or transfer data quickly. It can also charge mobile phones, iPads, etc., but unfortunately it does not support powering laptop PDs. So you have to carry its bulk adapter.Best of all the price is $779. I think there are better options at this price point.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Size vs Performance!","reviewDescription":"I chose this Acer Nitro for my wife as she basically does everything on her iPhone, however, not everything can be done on a smartphone, easily! I ran a benchmark of this Acer vs my Lenovo and this Acer is rated twice as good and good for gaming. I think an experienced gamer may hesitate with the i5, being more for a beginner. My Lenovo is i5 and after typically using i7, I noticed a big difference in response time when processing requests. I do have to say the Acer Nitro is much more responsive than my Lenova, though! As I am not a gamer, I can only go by my many years of using different laptops. The keyboard is standard qwerty, the included number pad is a must, for me, and the separate up\/down\/left\/right arrows are very useful. Setup was quick and easy. Sleek case, modern. The 15\" is screen is crisp and clean, making text easy to read. Images are excellent. Where we travel quite a bit, the easy of throwing into a back pack is great. the charger is by 3.5 mm or similar, but it also has a thunderbolt, type-c, port for additional charging options. My 65 w charger from the Lenovo would charge it, albeit slowly, and get a warning the charging is weak! The included Acer charger is 165 w, which explains the difference, but it is one less device of equipment we need to carry. In this day and age, not sure why they do not include a type-c charger. The other thing I miss on the Acer vs my other laptops, the touchscreen, I never realized how much I use a touchscreen until I'm on a laptop that excludes it.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"512gb storage in 2024 is NOT Enough!","reviewDescription":"Let me preface this by saying I am a Mac\/Pc technician for over 20 years, so my Review may be a bit more harsh than Your average Person who just wants to play Fortnite or Call of Duty On the go, so keep that in mind!I have been a fan of the Acer nitro series since 2018 when I purchased my 7th Gen intel an515-51 outstanding price to performance! Flash forward to 2022 when I picked up a used  An515-54 which was just about better in every way  with a 9th Gen processor, Nvidia 1650, and ample room for storage!Now on To this Anv51-51 13th Gen i5,8 core, with a 4050 6gb!Outstanding Performance for an entry level Gaming system!Pros:13th gen 8 core(ish) ProcessorNvidia RTX 4050 6gb (75w)DDR5 5600mtWifi-6Gen 4 NVME SpeedThunderbolt 4144hz IPS ScreenLit keyboard (white)Easily upgradibleCons:(out of the box)Less Storage potential than previous Nitro SystemsONLY 512gb Gen4 NVMEONLY 8gb single channelScreen is the usual 45% Ntsc washed out dull displayOnly white Keyboard no RGB (I kinda liked the Red)4050 is a 75w mobile version (not full blown desktop 4050 performance)All of this to say that even out of the box this system is a Performance beast! High\/ultra 1080p gaming at or above 60fps minimums (for the most part) The weakest part of all this is Ram and  storage! Why in 2024 are OEMs still ONLY putting single sticks of RAM in systems, further more for a Gaming system 512gb is simply NOT ENOUGH Storage for modern games ( example: Warzone is well over 200gb alone!) 512gb on a daily driver? No issue!I have upgraded to 16gb DDR5 5600, and the performance uplift in *most* games is 11% to 20% which is pretty significant . As for storage, I am disappointed we are limited to just 2 NVME slots, having a SATA drive with a much larger lower cost SSD or even Larger HDD was VERY handy on my previous Nitro. Time to price out another 2 or 4tb NVME drive. I have never had any issues with Acer devices! I don’t expect to with this unit!  I Do recommend it, just find it on sale so you can pick up extra storage and ram if needed!","isVerified":false,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Basic and budget friendly","reviewDescription":"The NVidia Geforce RTX 4050 in a gaming laptop at this price point is the real winner here.  Does the rest of this budget gaming laptop stack up?  As an entry level experience, yes.  This is not meant to be a powerhouse machine and the price reflects that.  The case is bare bones and only has the necessities; however, it does have room for expansion.  The num pad is crammed in, leaving less room for the rest of the keys.  The keyboard is backlit, but there’s no RGB or customization.  One particular annoyance I noticed with this keyboard is the num lock key has to be reset every boot up.This laptop can run all of the latest and greatest games so long as you aren’t attempting to max out the settings.  The harder it has to work, the less battery life you’ll have between charges and the louder it will get (and it gets LOUD).  The battery is the biggest issue here.  Even with basic use, it doesn’t last long.  I got about 4hrs out of it before it hit the 10% mark, and this was only from my testing various games and software.  I wasn’t playing any one single game for longer than twenty minutes, nor was I multi-tasking.  If you plan on using this in one place, it’s not really a big deal.  If you want something portable to travel and game, this probably isn’t for you.The screen is 1080p; not horrible, but not the best.  I do appreciate the matte surface, it cuts out a lot of glare.  The speakers are acceptable, but not something I would use on the regular.  A headset or a pair of nice external speakers is a must if you want a truly immersive experience.Overall, it’s not a bad deal.  It offers decent performance and has room to add a little more power if you want it.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"This laptop has become my backup computer","reviewDescription":"I bought this laptop when Amazon gave it a monthly payment option at the time.My Desktop was constantly breaking down and I was trying to figure out what was the problem. While my desktop was in the shop (not knowingly the repair men there didn't do jack to figure out), I bought this laptop as a backup until my computer was fixed.Looking at the specs, 8GB RAM and only 250GB Storage isn't really enough to run and install most software (like games), so swapping out a 16 GB RAM and Adding a hard drive really helped it out exponentially. I only installed a few games that doesn't require too much GB's and they play well.That 144 Refresh rate though, I need to get me a monitor like that. Very smooth and fluid.At the time of this review, my desktop is fixed (by me replacing a faulty motherboard). I do want to keep this laptop as a backup in case something else happens.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1645228800000}
{"reviewTitle":"Great machine so far!","reviewDescription":"I like everything about it. It has great graphics, great sound, and it's lightning fast, much faster than my previous I7 laptop. I'm only giving it 4 stars for no other reason that it is only 2 weeks old. I will up it to 5 stars when I've had it a while longer and it keeps up this level of performance.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Buena Laptop para su precio, pesima bateria, touch pad y mouse","reviewDescription":"Tengo la computadora 4 meses aproximadamente. Para el precio de compra las especificaciones son buenas, compre la version mas basica que comprende un i5, 250 gb nvme, 8 gb de ram y RTX 3050. Adicional a ello le compre 16 Gb de ram en dos Dim de marca Gskill y la cambie por el modulo que viene de fabrica. Los materiales de fabricacion son un 7.5\/10, el touch pad es pesimo, lo peor es la camara de pesima calidad y los parlantes no suenan nada. Finalmente la bateria no dura si la utilizas para trabajar, en mi casa arquitectura, lo maximo que me a durado son 3 horas, el resto de tiempo debe estar 100% conectada.Los componentes son buenos pero si tiene puntos malos como los citados anteriormente.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1659052800000}
{"reviewTitle":"Great gaming PC but one part did not work","reviewDescription":"The pc itself is beautifully detailed. I love the red and black. The only issue is the battery charger cord is not the correct fit. I bought another cord and it worked perfectly. That is important, the cord needs to fit properly. Other than that it was easy to setup and the keys glow in a red color. Perfect for gaming. My niece will love this birthday gift.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1685145600000}
{"reviewTitle":"Great Laptop but Check it all when it comes","reviewDescription":"I'm definitely loving this laptop.I have a gaming rig with a Ryzen 5 3rd gen and XFX main card, and this laptop holds up with all the AAA titles I play on my big rig, BUT I can take it anywhere!The only reason this gets a 4 star is because it clearly states that there are supposed to be 2 stick (PCIE) SSD slots with a 2.5\" HDD port to upgrade storage.When I popped this bugger open to add storage and RAM, low and behold I find it has only 1 stick SSD slots and a 2.5\"Luckily I bought a 2.5\" SSD instead of a stick (PCIE) since this thing clearly has a spot on the MB to have that extra PCIE slot but there is nothing there. So basically I get 1 PCIE and 1 2.5\" HDD port instead of 2.Super disappointed, considering there is even a Nitro 5 sticker that says \"Available slots: 2 SSD, 1 HDD\"Unfortunately not true at all.....","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1630540800000}
{"reviewTitle":"Not bad at all!","reviewDescription":"I purchased this item and it works really well. I love the design of the screen and the keyboard. The only thing that I'm really disappointed with is the battery life, on the descriptions says up to 11 hours of battery life, the first weeks I had only 2 hours of battery and tan I had to plug the charger again. I called customer service and they told me that I needed to re-calibrate the battery. I was 1 day trying to complete the process and just gave me 2 more hours. I'll have to purchase another battery and change it because it was not was I was looking for, other than that it is perfect!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652659200000}
{"reviewTitle":"Es una buena laptop relación calidad precio","reviewDescription":"Instale Howard Legacy, configure la tarjeta de video un poco hasta que di con la correcta.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"This lil guy has some power","reviewDescription":"Honestly as far as cheaper gaming goes this is really good. It can run most high quality new games relatively easy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Great laptop for price","reviewDescription":"Would have preferred a little more storage and a little better battery life. Overall great value for price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Excelente Laptop","reviewDescription":"Mejor opcio calidad precio","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Vanishing Disk Space","reviewDescription":"I've downloaded NOTHING to this laptop except for a few games totaling 30GB, yet I only have 68GB free out of 237GB total.170GB being used on...what? I just bought it. What could possibly be taking up 75% of the space? Well, you can't find out - unlike any other computer I've had, there's no way to see what the space is being used on, which makes it seem like Acer does this deliberately. There's no other explanation for only 25% disk space straight out of the box.It's a scam computer. Yes, it is a competent gaming laptop, but it's NOT 256GB of space. It's not even half that. Don't bother.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1658448000000}
{"reviewTitle":"Battery life is garbage","reviewDescription":"Battery lasts maybe an hour off plug. I'll I'm playing is minecraft and still drains super fast. Also doesn't hold a charge while in sleep mode. Will drain battery off plug no matter if the computer is awake playing games or with the lid closed in \"sleep\" mode. Yes I checked power\/sleep settings and they are gtg but this computer can't hold a charge","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Can't be unplugged","reviewDescription":"In less than 6 months time this laptop will not function unless it's plugged in. It doesn't even take a few seconds it will die INSTANTLY the second it is unplugged from power.  I bought this laptop to trade stocks while my other laptop was being repaired (which is about 6 years old and still functions better than this even before being repaired....) and the only thing I've had open was chrome. Looks like I can't readily swap a battery out either which shouldn't even have to be done after 6 months.  If there is no warranty I'll probably just sell it somewhere with my receipt attached of this new laptop and share the glory of ACER with the next lucky winner.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647388800000}
{"reviewTitle":"Two different computers, neither worked","reviewDescription":"My son saved up for months to buy this computer. He was so excited when he finally had enough money! When it arrived, he plugged it in, eager to start gaming on his new laptop. Unfortunately, it never charged and it never turned out. So, we got a replacement. He was frustrated but willing to wait. The new one came quickly. However, the replacement had the exact same problem; it wouldn't turn on or charge. Now I have one very sad teenager on my hands and he is afraid to buy another laptop for fear of this happening again. We're not buying another Acer gaming laptop again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1654905600000}
{"reviewTitle":"Just sad","reviewDescription":"Goodness. I ordered one of these laptops, only to have it arrive and find it has a defective charging port (I noticed it, and a representative at Best Buy confirmed), there was a bent prong in the port. I talked to an Amazon rep, and they sent me a replacement. Having gotten now a 2nd laptop with the same defect, I can confidently say to STAY AWAY from this. I was really looking forward to using this laptop, and even used my free trial of Amazon prime I'd been saving so I could get it over my vacation from work. Having gotten two defective laptops just killed that for me.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1632700800000}
{"reviewTitle":"DO NOT BUY THIS!!","reviewDescription":"I received this laptop and pulled it right out the box only to learn that it does not work!! The repair for the laptop has been an absolute nightmare!! I was responsible for packaging this laptop up to send in for repair and finding a local fedex to ship it out of which was also a horrible experience!! According to the company, my repair is complete and now lies in the hands of fedex! I wish I could get rid of this headache by simply returning the product back to Amazon but I don’t even have the product to send back!! Worse decision ever was purchasing this laptop! Be careful!!","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1630627200000}
{"reviewTitle":"Don't buy this laptop","reviewDescription":"The laptop has a hard time staying connected to the internet with the ethernet cable. It's very laggy which makes this system very unstable for playing games. What you see in the video is me in the middle of a game teleporting somewhere and the whole screen just stay frozen. As soon as you start up the game the fan is going crazy and it blows out a lot of hot air underneath the left side of the laptop and it's loud.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1645228800000}
{"reviewTitle":"Bateria super corta","reviewDescription":"Para ser una laptop gamer tiene una gran desventaja en cuanto a la duración de la batería. Con un uso normal, la batería de esta computadora dura aproximadamente 3 horas, lo que es bastante bajo en comparación con otras laptops de su categoría. La quiero usar para juegos o modelar en 3D pero siempre tengo que mantenerla conectada y esto resulta muy molesto.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Model has known Charging \/ AC issues","reviewDescription":"Bought 2 units, first did not work out of the box, Charging  \/ AC light was not lit, was unable to get power to the unit. Unit 2 worked for 3 hours, however when we tried to reconnect to the power cable to charge the laptop there was no power indicator.Contacted Acer, they advised that power plug was positional, I informed them that it was correct according to their own manual, The tech support person admitted that this model has known issue with it's AC\/ Charging ability. I returned both units and will be purchasing a different brand at this point.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1647388800000}
{"reviewTitle":"Misinformation on battery life","reviewDescription":"I bought this two years ago and guess what they lie. The battery lasts two hours if your lucky!!! It's also a built in battery...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Good for games.","reviewDescription":"Bueno para juegos 🎮.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Worth the Purchase","reviewDescription":"Not sure why it wants you to rate it as a touch screen model when there's no function for it. However, after a few months with it I'm happy. I don't game much but I've played a few easy going games and have had no actual issues, and will be upgrading to 32GB of RAM just because. My biggest issue is that if you stay on a bright screen for a while, like Amazon for example, and then go to a website where you're using a dark mode, like I do on Discord, the ghost image can be seen. Also, when streaming shows\/movies there's always a bright spot in the bottom left corner as if someone is home and forgot to turn the light off in a room. It's distracting.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Does the job","reviewDescription":"I purchased the laptop for my daughter, this is what she said!“ Great brightness settings, decent colors but not fantastic for \"hardcore\" gamers or people wanting to get true colors for content creation\/art. But for on the road projects and entertainment it is perfect, no complaints!It is not but it is very solid for what I need.Price to performance I give it 5\/5, overall with personal preference if you could do decimals I'd give it 4.8\/5.  Otherwise just 5\/5”.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Not as good as I hoped","reviewDescription":"I expected so much more. Ready to trade it in already.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"The cpu heats itself to hell, 90degree temps","reviewDescription":"So i got this and I don't really mess with these things but what pisses me off is haven't to fix every little thing. This laptop well really good for like a week or two until i noticed stupid frame drops, fortnite literately being unplayable and all. I then found the darn reason, I used Intel Xtu and saw the problem, overheating every darn time. I have a coolpad for this and my room is literally cold not blazin hot but yeah the cpu will hit 90 degrees! The gpu temps are always fine but the cpu sucks so hard so no wonder fortnite is unplayable. I found a couple options on reddit, they were to fix it myself by buying thermal paste, send it to acer to add shitty thermal paste so i can have this problem in a couple weeks again, or return and refund. Thing is, i got this well priced and the 3050 does what i need it for. I kid you not i play almost every game nearly max with optimizations done at that 144 fps and i have used programs to see my avg so yeah. Forza horizon 5 is the only thing I can't run at those frames cause the gpu has too few ram or whatever it uses, it's only 4gb. And yeah i did buy additional 8gb ram and 1tb ssd.So yeah, the games run well (overwatch, apex, definitely not fortnite, rainbow 6,).But it has heating issues, I'm personally going to exchange this and see if amazon does my a biggie by sending a unit before i send this one in cause i need a laptop, i know they did me this one time with another big purchase so shoutout to them.Edit: forgot to include that yes even with max fans the cpu thermal throttles. I know how to use nitrosence.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1642291200000}
{"reviewTitle":"It's a really nice laptop!","reviewDescription":"I don't do a lot of heavy gaming, so I wanted to buy a low-level gaming laptop because I knew it would do everything I needed to do. For context, the main games I play on my laptop are The Sims (with a ton of cc and a few mods), Stardew Valley (with a fair amount of mods), Terraria, and then basic in-browser games like tetris and whatever else when I'm truly bored. For the most part, this computer has handled running them all super well. Surprisingly, it has the most difficulty with the in-browser games, which tend to lag or drop frames. To be fair, I don't really know why Mahjongg 3D needs to be rendered in such intense detail anyway, but whatever.I don't have a lot of complaints about this computer. It does what I needed it to do. A couple of times I've had to reset my settings because my built-in microphone will randomly turn itself completely off. Also, sometimes, when I'm switching tabs or something, my screen will just go black for a second or two. That's the biggest complaint. If I needed to use this machine to play Valorant or Fortnite or whatever, a few seconds of a black screen could cost me the game. However, I'm still satisfied with all that I'm able to do using this computer, especially considering the price. I've been using the same old computer for ages because every subsequent computer has just been too slow for me. I'm happy to say that this is not the case with this computer, and as long as it runs decently and lets me play The Sims and watch Netflix, I probably will stay pretty happy.","isVerified":true,"ratingScore":4,"reviewReaction":"40 people found this helpful","country":"United States","date":1660694400000}
{"reviewTitle":"good for what it needs to be","reviewDescription":"Model: Acer Nitro 5 AN515-55-53E5 -Upgrade & Linux infoMy first order of this came DOA. It happens sometimes. The replacement came quickly. this has 2x M.2 NVME slots. I added a Samsung 980 1TB (no need to buy an extra screw). I also added another 8GB ram Crucial RAM 8GB DDR4 2666 MHz CL19 Laptop Memory. By adding things myself it made it cheaper than buying a more expensive unit. Yes it is only an I5 but I do not need a lot. I does exactly what I need and well. Battery life is about 2 or 3 hours depending on what youre doing. I always expect horrible battery life so Im not shocked. the keys feel nice. red backlit only (Meh) but the intensity can be decreased or increased via the keys in Linux & Windows.LINUX - load Windows into safe mode, go into bios, ctrl + S will show the add the option to allow you to change the mode to AHCI. reboot to windows and take it back out of safe mode. Install linux as normal. For this unit I install ElementaryOS with zero issues and left windows on the factory NVME. Everything works as expected including the microphone and camera. I would recommend a mouse & mousepad but thats your call.  If you are nervous about installing linux or it is your first time, remove the 256GB nvme, install linux on the added drive, replace 256GB, update grub [ sudo update-grub].  Hope this helps someone out there. I know the open source community and Linux always look for someone who has run gauntlet to see how it works. My husband is still fighting an HP Omen because Intel and their Microphone :)","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1640649600000}
{"reviewTitle":"Arrived today, running quick and smooth so far","reviewDescription":"I see a lot of people complaining about the disk space and yeah, it’s low for a gaming laptop but I just got me a 1tb m.2 ssd for $126 so I’m not complaining. Even with 8gb Ram it seems to run smooth and work well also (though I am upgrading to 32gb). I can’t comment on the gaming bc I can’t install a real game until my ssd upgrade comes in but I’m hopeful and I’m happy thus far. It is important to note that to charge you have to push the cable in kinda hard until you hear the click sound, otherwise it doesn’t charge. It took me a few minutes to figure that out. Also, not a lot of bloatware installed so that’s good too; it’s unnecessary to use Norton when you have Windows Defender so I’d uninstall it along with Dropbox. Laptop isn’t very heavy and to keep it that way I’m opting to not use the HDD bay and instead just use m.2 ssd instead. This seems like a quality product so far so hopefully it lasts as long as my last Asus laptop did (6+yrs & still going). Wish a Blu-ray drive was included but not a deal breaker as you can buy an external slim one for around $100. Highly recommend this system so far, just know you’re going to need to upgrade the storage immediately before playing storage heavy games like WoW, COD, etc hence 4\/5 stars.edit 3\/5\/22: I've had this awhile now & no issues at all still. I really like this laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1643587200000}
{"reviewTitle":"Fantastic overall though some things to keep in mind\/be aware of","reviewDescription":"So I've had my Acer for almost a year now and here are my thoughts, struggles, FYIs for those thinking on getting one.First big thing is RAM 8gb is a very small amount and if you're planning on any sort of heavy gaming beyond some old titles or mmo you'll want to upgrade it (great thing is though that it's easy enough to swap out).Second is battery when I was still deciding on buying or not there was a few reviews mentioning a possible battery issue where it it will start losing its charge and having to swap it and sure enough after a few months I saw my battery slowly but surely losing its charge and decided to order a replacement. Now as I was waiting for it I lost power for some hours mid gaming and chose to just run the battery out until it came back after draining it and the power got back on for charging the battery issue was gone which while great was a bit frustrating having to go through a return for the replacement battery.Lastly temperature it can get fairly warm so I'd recommend getting a cooling pad if anything for longevity especially if you're like me and plan on using it for years to come.Outside of those couple things it's been perfect for me especially for an under 1k laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"58 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Nice laptop, especially for the price","reviewDescription":"bought for around 640 $ on black friday, what a dealthe laptop came and didnwt work! I was so worried. turns out, it was just the charger, and after replacing it works greatthe main thing I have to say isn't aabout the laptop but about amazon..they were so kind and proffesional with their help. the momentit turns out to be a problem with the charger they ffer a full discount for the defective charger. no trouble at all. I took more time writing this review than explaining the problem and getting help from them. if you want to buy latop from amazom I highly recommend it - and in Israel especially - much better service than the local companies and MUCH cheaper.now for the latop itself:it is a capable laptop. nothing to fancy or heavy ( i bought the 1 5 10300H version with RTX 3050 )PRO:price, hardwareCONS:the screen is weird. it hurts my eyes sometimes, and even thogh it is configured to 144 HZ, something doesn't add up. not feel right (checked several times, it is configured to 144 HZ)other than that:keyboard fels cheap, and the cover is a cheap plasticthere was also the issues with the charger I saidoverall, for the price, I think it was a great choice. for people who want a gaming beast or even just high quality laptop - this is not the place. but if you want a capable cheap laptop I thinkfor the price it is quite a fair bargain","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1639180800000}
{"reviewTitle":"slow","reviewDescription":"slow wen it comes to games","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651449600000}
{"reviewTitle":"If you can swing it, get the Legion 5 instead.","reviewDescription":"In the \"almost touching four figures\" range, there are a lot of surprisingly good gaming laptops coming onto the market from different manufacturers. Assuming each one was available, you'd be spoiled for choice this summer. Decent processors, nice midrange RTX GPU's, and at least a certain degree of expandability should be expected.Acer's Nitro 5 is... well, not great. Personally, when I think Acer, I think \"budget\". And there's nothing wrong with budget systems and components. I'm quick to recommend Acer to people on a tight budget who are looking for entry-level laptops. Their stuff isn't top-tier, but is usually fine for what you pay. Few of us have infinite dollars to spend on computers. Though Acer tends to make their products *feel* like they're not quite as good as everything else, and the Nitro 5 is no exception here.Case in point: at the time of this writing, another hundred bucks or so gets you the. And for that hundred dollars, you get build quality that makes the Nitro feel kind of flimsy, you get a processor that absolutely trounces the comparatively anemic i5 10300H, twice the RAM, twice the storage space, an ARGB keyboard, and a faster refresh rate on the display.All that, for a hundred bucks. Give or take.So, is that a testament to Lenovo giving you an incredible value, or Acer not being up to par? Yes.Having both systems side-by-side, it highlights so many places where Acer could have delivered, but cheaped out. When you delve into what you're getting with the Nitro 5, everything about it feels like you took the cheapest thing on the shelf. From the very beginning, you need to dedicate nearly an hour out of the box just for Windows updates that Acer didn't add to their shipping image. And not because of a slow connection (I was hitting in the neighborhood of 800 megabits over 802.11ax) but you can feel how constricted the system really is with that i5 and only 8 gigs to work with.Once you've got your Windows updates set, you have to navigate the sea of bloatware that Acer loaded the Nitro 5 up with. No, I don't want Express VPN. No, I don't want Dropbox. No, I don't want your weird app store. No, I don't want your... whatever this password manager thing is that I've never heard of. No, I don't want... And it hits you that while you'd wading through all of this junk, Acer thought it would be good to put their system update software other than in the Acer folder. It's kind of a head scratcher.All the while, the bottom of the laptop gets scorching hot. Yeah, a gaming laptop without a great vapor chamber is going to get toasty, but again, it's one of those areas where Lenovo figured out how to make efficient heat pipes that make the Legion 5 bearable. Why didn't Acer?So I moved on. Let's get 3DMark and PCMark on here, and see how it compares. And even that produced a \"Go home, Acer. You're drunk.\" kind of emotion. Load up 3DMark, and it says \"Hey, you've got an i5, and I see this RTX 3050 over here...\" and then it barfs at the end saying that it couldn't quite figure out what you have. I installed official GeForce drivers, uninstalled and reinstalled 3DMark, and still got the same \"This isn't official because reasons.\" message. But don't take my word for it. Check out the pictures I've attached.So the results, while not \"official\" tell a pretty interesting story about what a hundred bucks more gets you. As you can see, these are the Acer Nitro 5 against the Lenovo Legion 5. While 3DMark is calling the GPU \"Generic VGA\", you can see for yourself that the specs are correct for a 3050 dGPU and are too high to be the iGPU from the i5. But they're also 1618 apart.For perspective's sake: the difference between the Nitro 5 and the Legion 5 is 100 points greater than the difference between the Legion 5 and my desktop Ryzen 9 5900X with an RTX 3080 GPU. And again, you can see that the dGPU is running at full frequency. Even if you're thinking \"Oh, this dude is a total Lenovo shill, and the results don't have approved drivers, and I'm an internet detective and blah, blah, blah...\" look at the CPU scores. There's no CPU driver. And it isn't like Acer or Lenovo are like \"Yeah, go hog wild with settings for undervolting and underclocking in our expansive BIOS features\" on either system.In my review of the Legion 5, I took it apart and ran PC Mark, and dug deeper into it because I couldn't believe how much power you were getting for the price. But with the Nitro 5, I didn't see much point. The moment you try to slap more RAM into it, you're at the same price point. It would cost you more to bring just the RAM and NVMe drive to the same specs as the Legion 5, and you'd still have a slower computer with a slower refresh rate, worse warranty, inferior build quality, middling keyboard, and terrible heat management.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1627171200000}
{"reviewTitle":"Don’t do it","reviewDescription":"I saved up for this laptop, did all my research, took care of it like the baby she was. But right after my warranty expired she is a a brick. Took it to get fixed and they said it’s not worth repairing and that these laptops have been known to just die. Maybe 700 dollars is chump change to some but she hurt my pockets and broke my heart. Also she’s super laggy during games and the screen glitches out literally mid game. Also so so hot even on a cooling fan and the battery life is non existent so yah no don’t do it…","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657670400000}
{"reviewTitle":"USB ports all died within 1 day of purchase. Turns out to be a common problem.","reviewDescription":"I bought this laptop intending to make it dual-boot into Windows and Linux. To do that I had to get it to boot from a USB stick and let me repartition it and install a new OS.Right away I found issues. Nowhere in the limited documentation that came with the laptop do they tell you how to get into the bios. I had to google that. Then the BIOS itself was total crap. I had to jump through many hoops to even get it to consider booting from another drive. Around that time the USB ports started failing, one by one (Windows would *sometimes* see a USB drive, but could never read them. The BIOS couldn't even see them).I did everything I reasonably could. I made sure I had the latest version of the BIOS and the latest version of all relevant drivers and checked Acer Support for information. Nothing. This thing is being returned.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"Canada","date":1650758400000}
{"reviewTitle":"No hay garantía en México","reviewDescription":"El equipo es bueno el problema es que en México no aplica la garantía","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1716422400000}
{"reviewTitle":"Lowest quality laptop I've ever bought","reviewDescription":"Performance-wise, it's not bad. Sadly the rest is frustrating. The touchpad is a joke. If you don't clean it frenquently the cursor jumps to the sides of the screen when you move it. The top left corner of the screen shows problems of brightness where it is a lot brighter than the rest of the screen during dark scenes in movies and games.Also the frame is so flimsy that the screen starts to show an horizontal scratch because the plastic of the bottom part presses on the screen when you close the lid.Save yourself the trouble and buy a better quality rig.","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"Canada","date":1648080000000}
{"reviewTitle":"Dead pixels and blue screen.","reviewDescription":"Right out of the box the screen had dead pixels, and I also got a blue screen only after a few days of use. I Will be sending back for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1669852800000}
{"reviewTitle":"Buy the one with the 3060 it will be more worth it","reviewDescription":"Perf are pretty ok but buy the 3060 version it will worth the price more than this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1676851200000}
{"reviewTitle":"Llegó súper bien a Colombia","reviewDescription":"Encantado con el equipo. Me impresionó lo grueso que es, pwro también lo pesado. es bastante pesado, pero creo que lo vale. su cargador de 230W me impresionó también, es grande y el cable es bien grueso. Lo que no me gustó mucho fueron las temperaturas que marca el ssd (66 grados), pero es bastante rápido","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Light up keyboard = Easy to use at night","reviewDescription":"Definitely a great upgrade from the dinosaur I've kept alive for over 8 years. I'll admit I worry at times if the screen top half will snap at the base like the last one did or if the screen will fitz out from picking it up sometimes (it's managed to shut itself down & restart just carrying it on my forearm to the kitchen while I voice-chatted with friends a couple of times), but I definitely recommend this laptop for its reliable speed & space compared to older models.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1681948800000}
{"reviewTitle":"Perfecta","reviewDescription":"Si tienes poco presupuesto pero buscas una laptop para jugar esta es perfecta para ti el juego q desees ella puede con el ahora si la necesitas para edición 3D y cosas así no te la recomiendo te lo digo por experiencia 😅 (Espero q te sirva el comentario para tu compra) ✌🏻😉","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Solid Performance for Planet Zoo & Steam","reviewDescription":"This is a great and not too terribly expensive gaming laptop. I have a Mac for my work\/schoolwork and was looking for a laptop that I could play Planet Zoo and some other Steam games on because they aren’t supported on Mac. This one fit the bill! It does get a little loud and hot when expelling heat through the vents, but that’s understandable considering how large Planet Zoo is. The graphics and speed are great too. Are there better gaming laptops? I’m sure, but if it’s not your primary laptop and you only use it for gaming\/entertainment purposes, why spend the money when this one gets the job done pretty darn well and looks awesome while doing it?","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1654732800000}
{"reviewTitle":"Runs anything","reviewDescription":"Works just like I wanted runs every game that I would like, just need to make some changes in the NVIDIA control panel and your set. YouTube helps with this. Battery life needs to be plugged in after an hour , allot of power.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Christmas","reviewDescription":"This was a present for my step son and I can say he absolutely loves it. Hasn't put it down at all","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"My daughter is so happy with it","reviewDescription":"Works great looks cool gift for my daughter she loved it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Mas de lo que esperaba","reviewDescription":"La verdad esta laptop ha sido mas de lo que esperaba, ha cumplido con mis expectativas de gaming casual y de trabajo de oficina. La recomendaría sin lugar a duda para quienes necesitan un equipo con potencia y que la bateria le dure un buen de tiempo.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Feliz con mi nueva laptop","reviewDescription":"Estoy muy feliz con mi nueva laptop, la relación costo beneficio es lo esperado. De igual forma, tiempo de envío y embalaje excelentes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Great for the price","reviewDescription":"As someone who is always pretty tight for cash, this was quite an excellent find especially given the price of most gaming laptops out there. When it arrived, I was delighted to find it neatly packaged and remarkably effortless to set up. Considering its price point, the performance and battery life it offers are truly exceptional, catering perfectly to my needs as both a programmer and avid video game enthusiast. Without a doubt, I highly recommend this laptop, especially considering its unbeatable price.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"If it doesn’t start up the charger is not clicked in your laptop properly","reviewDescription":"When I plugged it in there was no life no lights whatsoever. Was very disappointed but when I called customer service they said to make sure the charger that is on the laptop end make sure it clicks in properly. And that was it! It started up right away. I thought it was not working my son was very upset. But it was pretty simple issue. So if you have this problem just make sure you hear a click sound when you plug the laptop in charge","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664150400000}
{"reviewTitle":"Give me my kid back","reviewDescription":"Ever since my son got this for his birthday, he has yet to emerge from his room.  I walked into his room the other day, not knowing he was there, opened the shades and got hissed at by what I can only assume was my son.  I did not recognize him through all the soda cans and candy wrappers.This laptop has changed his gaming experience.  No lag, great graphics and lightweight.  I asked my son if he liked it, and I can only assume he said yes, as he just got a sly grin and continued to slaughter the aliens with his eyes wide open.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1641772800000}
{"reviewTitle":"Great budget gaming laptop! (Don't get if not comfortable changing the ram)","reviewDescription":"This little laptop is very good for the price. Only problem is that only has 8gb ram. I highly recommend you to upgrade the ram right away. 8gb ram isn't enough for windows 10\/11 these days. 16gb is perfect. But after the upgrade it runs great! Plays games great! Video edits great! And handle FL Studio great! Great little budget laptop if you're willing to upgrade the ram!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1672704000000}
{"reviewTitle":"Really worth it IF","reviewDescription":"So i play fortnite so thats what the reveiw is mostly gonna be about. With right settings u can get easy 120 - 144 stable fps in battle royale and 300 fps in creative. Thats only 8gb! No paid upgraded. (im upgrading it soon tho cuz i dont recomend 8gb ram). My fortnite settings i keep low - medium and i play on stretch res (THIS HELPS SO MUCH i recomend it) really easy to do it to. (i recomend 640 x 480).","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1669507200000}
{"reviewTitle":"Mouse Touch Pad is terrible","reviewDescription":"Only thing I did not like about this is the left\/right mouse click buttons, there are not any, they are built into the touch pad and if you move your finger at all when you push down the pointer moves off the target on the screen.  Also unless you are on the very left or right of the pad when you click you don't know if your going to get a left or right click.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"very good","reviewDescription":"ok for gaming but lately experiencing lag spikes","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Push in the charger hard and u will hear a click then u will know it’s charging","reviewDescription":"Product is great got to my house 5 days early only thing is that mine came with a scratch","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Broken out the box","reviewDescription":"Got this as a christmas gift for my kid and its a good thing I checked it first. I plug it in and notice the charging light doesn’t activate. I try to power it up and it wont turn on. Hoping this gets resolved soon but even if I get a replacement it wont get here in time for the holiday. This review is going to be a 1 star pending a working replacement being sent.Updated.Got the replacement laptop in and it works fine so I adjusted the rating to 4 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1639699200000}
{"reviewTitle":"will handle Ray Tracing on Minecraft","reviewDescription":"Good overall ComputerI purchased it for playing Minecraft with Ray Tracing enabled it has decent graphics for gaming good keyboard layoutThe RAM is low at 8 Gigs but it is upgradeable to 32 Gigs so far it has not been a problem for meif you are looking for a cheap computer that can handle Ray Tracing this will satisfy you .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"Clarity is not very good","reviewDescription":"Does the job works well","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Does not charge or turn on","reviewDescription":"Date of purchase did not match Acer support, if they accept the proof of purchase change then i can send it off to be repaired. Seller does not offer replacement, only refund upon receipt of item. Very upset this was defective and immediatly a pain in the butt.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Does not turn on","reviewDescription":"I ordered this gaming laptop so that my son (9) and I could play online games together. This was a Christmas gift. It DOES NOT WORK. It will not turn on, charged or uncharged, while plugged into any of three different outlets, all of which work for other devices. Basically, I was sent a $1000 non-functional device. This is unacceptable at best and my son is DEVASTATED. I cannot begin to express how upset I am with this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1640390400000}
{"reviewTitle":"Dead on arrival","reviewDescription":"Just purchased this for my daughter. She's been waiting a week. Unfortunately, it doesn't work right out of the box. The unit won't receive power at all. It's been on charge for over an hour. The battery indictor light doesn't come on. My oldest has a similar laptop so I swapped the chargers and they both work fine. Laptop was a total dud. Complete waste. I'll be updating this if they make it a pain to return. Taking my money elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1651708800000}
{"reviewTitle":"My computer wouldn’t play WoW! This computer a blessing!","reviewDescription":"Edit: This computer was sold to me with a bad battery. It won’t charge and is slowly discharging while being plugged in. It won’t work unless plugged in. Of course it waited until after the warranty was over. Be careful buyingMy computer wouldn’t play WoW and I was disappointing a friend because I kept getting disconnected all the time! This think runs it like a dream! I highly recommend! 😍😍😍","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"Batería defectuosa","reviewDescription":"La batería llego en mal estado no carga y solo enciende enchufada","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Broke down right outside of warranty","reviewDescription":"The computer was very noisy and was difficult to charge once the year warranty was up. It finally stopped charging just in time for it not to be covered anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Charging problems","reviewDescription":"got it and was unable to charge, and this isn't the \"didn't plug it in right\" issue that you can find, trust me, I googled a lot.As I shipped this through freight forwarders sending it back wasn't a feasible option and I had opted for a local repair shop, turns out the cable itself was faulty.Why is this issue so common? why can't you QA your products?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1643932800000}
{"reviewTitle":"Arrived and did not turn on. No charging light when plugged in!","reviewDescription":"I bought this item last september. It was not working upon arrival. I then contacted amazon customer service and they sent me a few suggestions which did not work. I was then sent some contact information for acer warranty service and i have been unable to get into contact with them. Now for the past 6 months I have been stuck with a laptop that is broken.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1647734400000}
{"reviewTitle":"Dead on Arrival","reviewDescription":"Product arrived dead on arrival. Plugged in (firmly after reading other reviews) to charge for the first time and light would not come on to show that it was charging. Attempted to power on laptop and would not turn on either. Offered a refund but price has gone up and would have to pay more. Will not be ordering another after further reading reviews.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Disappointed","reviewDescription":"The laptop can’t hold a charge, if unplug from power the laptop turns off.Also, trying to get a refund but the process isn’t easy.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Good Baseline Laptop for Gaming","reviewDescription":"I like the laptop for gaming, I am able to stream as well. I will say the HD and Memory size is a bit underwhelming but very easy to upgrade.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665187200000}
{"reviewTitle":"Awesome Graphics","reviewDescription":"Really good laptop for the price. Runs games at ultra graphics like a gem. The only reason I give it four stars is because they sent me a broken charger and I had to buy a new one. But they did refund me for the charger at least. Also the battery does die pretty quickly. Other than that it’s a great purchase!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"Decent beginner\/budget gaming","reviewDescription":"The case is great, super slim and modern. The keyboard is only red, no customization. Keep having an issue with the audio driver. Will randomly stop all audio output and will tell me no audio device installed. Good for games like minecraft and roblox, but seemed to get choppy with Stormworks.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641945600000}
{"reviewTitle":"Great for gaming","reviewDescription":"Great laptop for gaming runs super smooth  overall it's a great laptop it's just that the battery life is not very good lasting around three and a half hours.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"poor battery","reviewDescription":"The battery was advertised as a ten-hour battery.  I realize it is refurbished, but I am very disappointed.  It does not even hold a charge for two hours.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660867200000}
{"reviewTitle":"First unit DOA","reviewDescription":"I think the legion has more of a quality feel to it. for the price, this unit is a workhorse and good spec that’ll last a few years.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659225600000}
{"reviewTitle":"Great for the price","reviewDescription":"This is great for light gaming but don't expect high fps.  I saw someone complaining about it not having enough storage.  This laptop comes with a extra m.2 slot and a 2.5\" SSD slot.  It's easy to upgrade storage and ram","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"Reliable","reviewDescription":"I definitely recommend if you are looking for something portable and small. The screen was smaller than I thought but if that’s not a dealbreaker to you I highly recommend!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"Pretty Good For The Money","reviewDescription":"Got this a week ago and can I say, I didn't expect the RTX 3050 in here to be this good (It has a low TDP). I suggest getting more storage and ram. It will vastly improve your experience with the machine","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1638230400000}
{"reviewTitle":"Beware the charger","reviewDescription":"You must firmly press the adapter to the back. It looks like it's plugged in but it probably isn't. Keep pushing against the back of the laptop until you feel a click. Failure to do so will result in the laptop not powering on.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1634688000000}
{"reviewTitle":"Fast Computer","reviewDescription":"Had it two weeks and it is going in for repairs. Merchant has been extremely helpful. I bought it for the graphics card, as I am a graphic artist. Needed for my work, BUT after two weeks it has stopped working. Acer on the other hand has been difficult to get anyone to talk with...take a number and we will be with you. I am not impressed with Acer Company. I will buy from this merchant again, but not the Acer brand. This merchant had very fast delivery and the machine was packed very well. They were very responsive to my need for help! Good merchant, but poor quality Acer Laptop. I have not used it for gaming only for graphic work (Excellent machine for graphics), so I can not speak to the gaming quality this machine is usually sold for. Merchant receives 5 stars for communications, support and fast shipping. Acer ZERO Stars!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1649548800000}
{"reviewTitle":"Do not waste your money","reviewDescription":"I have bought 3 of these computers and all after the year of having the computer have quit working.... don't buy waste of your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Twice Bad","reviewDescription":"I order laptop from my daughters account, after plugin no lights no charging, I run small computer repair business, I know little bit about computers, I used my testing power supply and other option to reset machine from keyboard but nothing works, no replacement options from Amazon other than return so I did return, I am not able to reorder the product due to 01 per customer.Beside my disliking to Acer products (due to poor tech support), I want to give it a try therefore I orderd another machine from my personal account and I was in disbelief that 2nd laptop also not working no lights no charging, this time I called Acer support line, they try to help me out with tips which I already tried, 2nd machine going back and I will save my money for better laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1638144000000}
{"reviewTitle":"Came in not working.","reviewDescription":"This is the first item I have ever returned from Amazon, as you have probably seen from other reviews, a common issue is the laptop will arrive simply not turning on or charging. I was one of those people that ignored technical issues such as these because they have never happened to me. That being said: I would be careful with this one, it is packaged so loosely that it very likely bounced around during its shipping and knocked something important, when it arrived sure enough, didn’t indicate a charge, simply did not turn on. I would save your money, and get a gaming laptop from your local Best Buy instead. Depending on what you’re after, maybe even a prebuilt from your local Best Buy, or perhaps a more reputable website to order from.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1640736000000}
{"reviewTitle":"DONT BUY DOESENT CHARGE!!!! GET A LENOVO LEGION 5 FOR A MORE WELL ROUNDED LAPTOP","reviewDescription":"the laptop comes defective from the box.... doesn't charge at all and the screen flickers because of how cheap this garbage is compared to a Lenovo Legion 5. don't waste your time or money, please. Y si hablas espanol no te atreves a comprar esta porqueria, no sirve, este compu es como un nissan altima de los laptops , un yonke.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Defective.","reviewDescription":"Apparently there I a defect in the fan and other things that just started now this was bought in Feb and it is only April.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"Nitro computer is on sale bc it’s garbage","reviewDescription":"Horrible computer. It won’t turn on . After having the computer for a month  it stopped working properly. I saw on YouTube how many complaints it had about the same issue . Do your homework on the issues a product has before you decide to buy .","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Didn’t charge","reviewDescription":"It didn’t charge at all. The screen would turn on with the cord plugged in but the power level stayed at zero. I am disappointed in it.I really liked the build quality tho. it seems durable and for the time I had it it worked great except for the no charge problem.. anyways thanks for reading my review!I will update when my (hopefully) working one arrives","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"Didn’t Last Long","reviewDescription":"Screen stopped working after minimal use.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Broke after 2yrs and out of warranty!","reviewDescription":"Only ever was used on a table for its short life, mysteriously overheated and fried itself with no warning. Called Acer and it’s out of warranty. Local repair shop said motherboard was done. This product should have lasted longer than 2 yrs. Guess Acer knows they are junk. I won’t be buying another Acer product ever again. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Mostly good, but there are something the computer can do better","reviewDescription":"For example, this computer should have a thunderbolt USB-c port. Second, the screen is kind of terrible.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660348800000}
{"reviewTitle":"Battery life could be better.","reviewDescription":"It's a great laptop for gaming and streaming. Battery life is the weakest part. I only manage 2-3 hours.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657843200000}
{"reviewTitle":"Only supports one pcie3.0 x4 and one pcie3.0x2, you cannot run 2 full speed nvme ssd","reviewDescription":"Gpu only limited to 30W on battery, meaning mist be pluged in using dgpuAlso you cannot undervolt the cpu, it throttles beyond 75CThis suits a perfect gaming stationary pc for TV setup","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638835200000}
{"reviewTitle":"El uso es de DJ","reviewDescription":"Sirve muy bien a la hora de mezclar música, no se queda, muy buena inversión","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657670400000}
{"reviewTitle":"muy buena maquina ,","reviewDescription":"la compramos para mejorar la velocidad y la calidad para nuestro hijo y ha sido una gran inversion .","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Screen is very good on quality","reviewDescription":"The speakers are horrible 😫 that's the only thing for me other then that I love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"not bad","reviewDescription":"good for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673136000000}
{"reviewTitle":"Short battery","reviewDescription":"Short battery duration. You need continue charging the computer","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656288000000}
{"reviewTitle":"Push the charger cord in all the way","reviewDescription":"Make sure that you push the charger cord in the back of the computer until you hear a click or it won’t charge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"Good value","reviewDescription":"Is a fine computer , is not the best but is good enough.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650931200000}
{"reviewTitle":"Don't buy this","reviewDescription":"I've had this for 13 months. It was great for about the 1st 10 months then the screen started showing extreme distortion. Buy at your own risk","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680480000000}
{"reviewTitle":"Advertised as Oculus 2 ready.  Confirmed with Acer before purchase. This is not Oculus 2 compatible.","reviewDescription":"I got this because Acer told me this was compatible with Oculus 2.  When I received it, it was not compatible. When I contacted Acer support.  Support told me I needed to purchase a model with 32MB memory.  Sales tells you one thing, support tells you another.  I got the better model at $1400.  That one did not work either.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1639094400000}
{"reviewTitle":"Sell used as a brand new one","reviewDescription":"Died just after one yearWarranty of manufacturer was 1 month after my purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Arrived dead","reviewDescription":"I was so disappointed, lab top would not power on.  Tried several know good plugs, charging light would not come on. This is a total waste of time. Do not waste your money. Do not fall for the reviews or the hype. Not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1648252800000}
{"reviewTitle":"Didn't even start","reviewDescription":"Got sent a broken unit. It didn't start at the beginning. Wouldn't charge. Had absolutely no signs of power. Returned it as fast as I could and got my money back. What a waste of time.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"New item open!","reviewDescription":"Just like the sticker states \"VOID.\" Thats exactly what I did, and I'm returning it. The low rating is because I was expecting a brand new item, and I received this. Total waste of time seriously what are the workers thinking when shipping out open items ! So frustrating!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1644969600000}
{"reviewTitle":"Done with ACER.","reviewDescription":"My first ACER lasted a little over a year before it died.  I saved up and purchased this ACER and it is pretty much DOA.  The manufacturer wanted me to ship for up to 10 business days. Don't have time for that so returned through Amazon.  Done with this brand.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1641772800000}
{"reviewTitle":"Laptop Didn’t Turn On","reviewDescription":"I have always wanted this laptop but unfortunately it didn’t turn on once I plug in the charger. I thought maybe I let it charge for a while, so I let it charge overnight. Turns out it still didn’t turn on so I returned it the next day.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1643846400000}
{"reviewTitle":"Terrible quality control","reviewDescription":"Bought this computer and was sent one that was dead on arrival. Filed a complaint and requested a new one, same thing dead on arrival. Terrible quality control, would love to write an actual review for the product but it's been over a month and I still have yet to get sent a laptop that turns on.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1635897600000}
{"reviewTitle":"Defective screen, failed right after warranty period","reviewDescription":"Buyer beware! Screen\/graphics card starting showing distortion on the display about 3 weeks after the warranty period was over. My previous laptop went for 10 years before lightning destroyed it. This one barely made it a year, which is abysmal.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1667779200000}
{"reviewTitle":"Great laptop greater price but still found it Cheaper somewhere else","reviewDescription":"Nice reasonably priced gaming laptop. Day after I bought this as a Christmas gift for my daughter, I found one at a local discount freight store for 400, just lucky I guess. If I wouldn’t have found the cheaper one I would’ve been happy with this one. So as far as quality;; this laptop is great !! And even without the freight discount markdowns I would have been ok with it because it’s still a good and economical choiceFor gaming laptops","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1643414400000}
{"reviewTitle":"Decent computer","reviewDescription":"Computer is decent but battery is horrible. I only really play sims on it but I have to leave it plugged in to the charger other then that computer is good","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1679788800000}
{"reviewTitle":"Low memory and battery life, but well worth the price!","reviewDescription":"I am not at all disappointed with this laptop! Screen is beautiful. It is super fast! It does need an upgrade in memory(8GB for $40) and HDD(1TB for $80), but it appears to be pretty easy to access and upgrade. They even give you the cable for the HDD upgrade. Will be testing out a few games, in the next couple days. Did not purchase for high end gaming, so I think I will be pleased, based on how quickly this thing moves for everyday activities!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"Fan noise is its main drawback (45 dB)","reviewDescription":"After a month of use, I have identified one major drawback of this laptop - it is very noisy for a laptop (45 dB).I can understand if it was a server in a server room, but it's a miniature laptop that makes a noise like a vacuum cleaner. The design of the cooling system failed the designers.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653350400000}
{"reviewTitle":"Great Deal, Will the hinges hold up over time?","reviewDescription":"Very happy with the laptop.  Will upgrade the memory but was still a good deal. I am a little apprehensive about the hinges as the look awful flimsy and each hinge is only about 2 inches each.  We will see if it holds up to a preteen gamer…","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"Pretty good laptop for the price","reviewDescription":"Only hit against this is it doesn't support 3 monitors. If anyone knows a solution to this please let me know. I brought this laptop specifically to review Amazon purchases and my work laptop is infinitely better. But still does it's job and is worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1657152000000}
{"reviewTitle":"Good value for the price be ready to upgrade a few items.","reviewDescription":"I liked the price of this gaming laptop. However, sound quality is an issue as is the graphics card. I bought it to be able to play MMORPG and got constant messages to upgrade graphics card. Will be buying seperate computer speakers as the current ones I can hardly hear even at the highest volume setting.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646697600000}
{"reviewTitle":"Overall pretty good","reviewDescription":"I can't complain much the quality for the price isn't bad if I had to nitpick I would have 1 issue I live in the us but I got a Eu charger so spent some extra money on that other than that it's a pretty good gaming pc","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652227200000}
{"reviewTitle":"Great gaming laptop for $850 bucks","reviewDescription":"This laptop does the job when it comes to gaming. Playing the latest games I pull 75 fps. The only thing that is crappy is the hard drive space. I went out and got a 2tb external hard drive to put my games on. But other than that it does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646265600000}
{"reviewTitle":"Good laptop for price","reviewDescription":"Great laptop for the price and easily upgradable. Bought to play elden ring and some other games with friends instead of console, and elden ring runs great and smooth. Does get a little warm if airflow isn’t clear but that’s to be expected from a gaming laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648684800000}
{"reviewTitle":"Nice game PC for beinner an beginner\/mid leverl gamer","reviewDescription":"As an entry\/mid-level gaming laptop,it hits the mark. It's affordably priced without compromising on performance or features. Whether you're exploring open worlds, conquering battlegrounds, or even diving into content creation, this laptop offers a reliable companion that won't let you down.It is a stellar choice for those entering the gaming arena or looking for a cost-effective yet capable mid-level gaming machine. With its impressive specifications, stunning display, and essential gaming features, it's a gateway to unforgettable gaming experiences. Begin your gaming journey with confidence, powered by the Nitro 5!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Very satisfied with this gaming laptop","reviewDescription":"It performs and runs as expected. I have not had any issues with this gaming laptop since I purchased it 7 months ago.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Grand daughter loves it","reviewDescription":"My 19 year old granddaughter wanted this exact laptop but couldn't afford it herself. I surprised her with it a few weeks ago and she absolutely loves it.  I am not computer savvy so I have no idea what it can do, but if she's happy with it, I'm happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Good quality for the price","reviewDescription":"I have used it for work (programming) and for games (Valorant, The Last of Us) and the performance is really good. The fans are loudly in the performance mode, but it seems normal for gamer laptops.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Insane","reviewDescription":"My husband is the techy person that's got me into games. I was previously using my old school laptop. But THIS thing right here...Runs everything like a dream. Display is gorgeous, a shame I have a monitor, but it rivals my expensive gaming monito with graphics. Video game split scene look like movies. Best gaming pc I could wish for","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"Cannot beat the price","reviewDescription":"I first bought this as a replacement to an Alienware laptop that was damaged. The price made me weary being 1500$ less that I spent on my previous laptop but it has exceeded expectations","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Great value","reviewDescription":"Powerful laptop, nice and bright screen. fans are a little loud but if that doesn't bother you this is great for heavy work or light gaming. kinda big so not the best for travel","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Won’t find a better option at this price point","reviewDescription":"I’m very happy I bought this. It’s cheaper to get this laptop than it would be to build a machine to a similar spec from scratch.For an extra $120 I was able to buy 2 sticks of 16gb ram and take this from 8gb to 32gb in less than 5 min.They’ve made space for upgrades (storage and speed) and made upgrading easy which I love.Even without the upgrades you’ll be able to have fun playing games. If you’re looking for a great budget option this is the best you’ll find.YOU WILL WANT A MOUSE. The trackpad isn’t great, and that’s my only gripe. Still a 5\/5.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1662336000000}
{"reviewTitle":"La mejor laptop y barata","reviewDescription":"Muy buena laptop me gusto cumple con lo requerido para los principiantes todo juego lo corre de buena manera a buena calidad lo malo es que se descarga muy rápido pero bueno es normal de una laptop gamer bueno en fin muy buena laptop","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Plays everything I need it for but the fan is crazy lol","reviewDescription":"I don't play alot of games with extremely high requirements. BUT this laptop is just what I was looking for. It plays the games I want to play. The one thing I will say is the battery life while playing a game is a little short but honestly that's to be expected in a gaming laptop sometimes. The fan does get a little loud and crazy while playing sometimes but that really doesn't bother me too much. It does a great job with most of the games I've tried it out on. So if you're a casual gamer who loves games like The Sims, this is perfect tbh.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Dud","reviewDescription":"Got this thing last night because it was on sale, new, now the keyboard doesn't work and I can't even sign into windows to use it. Garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Got a lemon :(","reviewDescription":"Received the new laptop with a hardware issue right out of the box. Laptop powered on but had no display (just black) on the monitor screen. Where's the quality control on this product? Sent it back and got a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Would never purchase from here again.","reviewDescription":"I purchased this as a gift for my nephew and we did not open it until Christmas. The screen ended up being cracked and there customer care was well below satisfactory. They would not even work with me on an exchange or refund of any kind even after I sent pictures. I now have a 900 dollar laptop that does not work and a child without his Christmas present. Would never purchase from this company again. I recommend you Work on your customer satisfaction and service.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1640908800000}
{"reviewTitle":"It came dead, why would you not test before shipping??","reviewDescription":"I got the laptop, plugged it and allowed it to charge for 20 minutes or more, pressed power button and it was dead. No lights or anything coming from it, I read reviews and majority of the negative ones were for the same issue, a dead computer. I still gave it a chance and I also received a dead computer. Went to best buy in person and got me a different one and was able to use it the same day.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1659052800000}
{"reviewTitle":"Be wary of keyboard","reviewDescription":"I am a 66yr old man with Red\/Green colour blindness. The keyboard was so hard to read (even on full brightness) that I sent it back on that alone. If you are a young dude or someone with good eyesight it won't be a problem to you. I also learned that some Nitro's have a menu where you can change the keyboard colour, not my one. I learnt: 'Turn the lights off and see what colour the keys are, if White you have RGB if Red, they stay Red.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1633219200000}
{"reviewTitle":"It was running like a dream until it wasn’t.","reviewDescription":"The display won’t turn back on after restarting the laptop. I had this product for 3 months. Very disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"SCAM PRODUCT","reviewDescription":"Brand new laptop doesn't power on doesn't charge. Used multiple different outfits and chargers and still doesn’t turn on. I open up the laptop to try and fix the issue there is rust on the screws. It’s so bad four screws won’t even come undone they literally chipped away and broke my screwdriver. Do not buy, this is a scam","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1667088000000}
{"reviewTitle":"Product was tampered with","reviewDescription":"I ordered this as a birthday gift  and was pleased that it arrived in a timely  manner. Unfortunately my happiness soon turned to disappointment after noticing the void tape had been cut. After plugging it in and giving it fifteen hours of charge time then attempting to turn it on nothing no power it was defective someone  had clearly tampered with it.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1655683200000}
{"reviewTitle":"Be prepared to order a new Acer charger adapter dead battery","reviewDescription":"After charging this laptop for an hour it stopped working the battery no longer works at all the charger outlet stopped workingonly reason I'm giving it lower score because something wrong with power supply charger that comes with it doesn't work...Thankfully I had extra adapter cable from my 2018 old laptop acer. I think there could be problem with battery or charger adapter connection even when plugged in.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1646697600000}
{"reviewTitle":"Worthless customer support.","reviewDescription":"Product lasted less than 1 year. I called Acer support service, three times already and a host of worthless  people with fake names were unable to solve the situation or give me instructions to send the laptop for repair or replacement. I guess they are waiting for the expiration date…So disappointed! We are never buying this brand again.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1666828800000}
{"reviewTitle":"Battery life poor graphics great","reviewDescription":"Just received mine today and will update my review after owning it for a while. So far I've read other reviews and the battery life is indeed quite poor. When I fully charged it and turned on the battery saver. It went from 100% at around 5pm to 31% about 1-2 hours later and that wasn't even playing games just downloading off of steam. I tested out the graphics and glad to say its runs quite well, though maybe not at the max and highest of definitions but at the least medium to high graphics. The fans on the laptop are quiet and I have yet used the nitro key when gaming. I mostly expect to play on the laptop plugged in since the battery doesn't last too long even in battery saver mode. The balance between gaming and battery life I would say equals out. I would recommend this as a first gaming laptop or for those who are on a low budget.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Weird Graphic Issues","reviewDescription":"Never had a PC or Laptop given me this kind of issue until now and the random abrupt shut downs or bluescreens even after updating the drivers and windows update for 11. Was hoping for no issues but most likely sending back and getting a different laptop but could be faulty parts?? Not too sure.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Good laptop but keeps crashing..","reviewDescription":"I like the laptop at first but then i downloaded valorant after 2 days of receiving the laptop and it keeps on crashing.. idky it does i barely have anything in it, csgo, minecraft, sims, roblox, fornite. I thought this computer can take all that game but everytime i play valorant it crashes and the screen turns black. I dont even play most of the games i download there. What should i do?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Misreading specs","reviewDescription":"Good laptop so far but the product page has misleading specs. The ram listed is ddr4 3200 mhz and this is listed twice on the product page. When I order ram to upgrade I notice they deliberately use a sticker to hide the ram specs. Once I peeled it off, it's apparent that this ram stick is ddr5 sodim.Good laptop but I'm docking points for this for making me fo through the hassle of returning this now worthless ram.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"ATTENTION: YOUR ACER5 NITRO NOT POWERING ON OR CHARGING? Push it in Then Push it a second Time!","reviewDescription":"ATTENTION IF YOU CANT POWER ACER NITRO 5 ON READ THISI just got my Acer5 today 6\/5\/2022 so I can't say much about it yet in regards to experience, however I can tell you how it was delivered, I didn't like the delivery method at all. When the package arrived the box was hanging open with some garbage quality amazon tape barely holding it closed, the box it was in for shipping was WAY larger than it needed to be, rectangular wide almost 75% bigger than my laptopsactual box and had no filler to keep it from moving, im surprised it was still in the delivery box at all.None the less I tried to test the laptop and it wouldnt turn on I figured it was dead as I tested it in my car with an outlet in my car at work, fine whatever. I bring it back home (just go with it) and I try an actual wall outlet when I get off work, doesn't work just like the car. At this point i'm thinking, I know how computers work this is stupid and defective and I'm frustrated. I got all the way through starting theprocess of sending it back on amazon when I googled one last time for answers and this worked for me.TLDR Answer: Plug the laptop in, it will feel like its in but its not, make sure its plugged in with the plug facing sideways in the socket, then press down HARDER, and you will hear a click, basically you push it into th slot once and then push it a second time to get it in. It's some kind of feature and it made me think my laptop was bonked up. I hope this helps people, I know I was FRUSTRATED, otherwiseseems like a decent laptop so far.Edit: It seems this has helped 50 people thats cool. Would be kinda cool to see what people have to say. If you'd like to direct thankyou messages feel free to email \"deudomufo@gmail.com\" im moderately enthused to hear how it's helping out.P.S. laptop is still working great, but it does run into some issues as a video editing laptop in after effects. The software eventually freezes permanently and you have to close it. Which is a shame because the GPU should be great for it.. I believe it may just need another ram stick, the laptop is expandable.","isVerified":true,"ratingScore":3,"reviewReaction":"138 people found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"For the price, a solid laptop","reviewDescription":"For the price, this is a solid laptop to be used for basic gaming. However, I would say that this laptop is not really great at anything it does. The SSD is too small for a lot of games to be installed, but it does have an extra SSD and HDD slot, so you can easily upgrade (which I did after about a month). The RAM is also lacking, but another easy upgrade to make. Another negative is the build quality. The laptop feels cheap and plasticy (which I don't think is a word), but for the price that you pay it can be expected. The battery life for basic tasks, like writing, internet research, and light movie watching is pretty terrible. At most I get 3-4 hours. But for gaming, you wouldn't use it off the charger anyways so its a mute point if you plan on using the laptop for its stated purpose.Now for some positives. The display itself is really nice. Games look great as well as movies and it has a really nice refresh rate. I actually enjoy the typing experience of the keyboard.For games, this laptop plays Farming Simulator perfectly on maxed settings. Call of Duty Modern Warfare 2 can be played at slightly less than max settings as long as you are using it off the laptop screen. If you are using an external monitor, depending on the size of the monitor you might run into a little bit of trouble. I have a 49\" monitor and when I tried plugging the laptop into it wasn't able to maintain the same quality and performance.Overall, I would say that if you are looking for a cheap gaming laptop to do some light gaming on the road then this is a good laptop for that. If you want a gaming laptop and one you can do work on the coach with, this isn't it. If you want hardcore gaming, this also isn't. For the price though, I would say that its a solid laptop just don't expect to do everything you want at max settings.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"It's okay","reviewDescription":"I have had this laptop for over a year now. It's just.. okay. The screen is big and high refresh rate is always nice. As expected, battery life is not that amazing, but that's a trademark of all gaming laptops. It's slow on battery, but not bad once plugged into a wall. The audio jack has this awful whining from electronic noise, but I was able to fix it by using a USB c to audio jack on the other side. keyboard's decent, touchpad is alright. Seems like a great gift  for a younger person who wants a \"gaming laptop\" without blowing out your bank. Having an ethernet port is great, as it allows me to troubleshoot networks more easily. 3\/5 Gaming laptop. As stated it's a good middle of the road laptop. It can be quite cumbersome to use as an actual laptop is some cases though, because of its size. I was able to run VR on it decently okay as well. VRchat has some issues during large events, but for average use or Beatsaber use it'll work just fine.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Good Laptop but poor battery life","reviewDescription":"The laptop is really good for its price but just need to carry a charger around since the battery life is not the best","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Spend a little more","reviewDescription":"I’ve never owned a performance laptop before but build my own PCs.  Take with a grain of salt and form your own opinion if you dare.Pros:  Fast, no lag or bottlenecking, runs balders gate an wow easily on med-high graphic settings.  The keys are comfy and satisfying Cons:  The screen is pretty flimsy so it only a matter of time…it runs hot, like uncomfortably hot.  if you leave your hand or arm next to it, you’re going to feel it and likely move.  It is loud in game…totally fine for tasking though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"I'm having all kinds of problems with this laptop","reviewDescription":"I don't know if this laptop is a remanufactured one or it was damaged but I'm having to completely turn it off and back on every time I want to login because it keeps telling me my login in incorrect but after I restart it the pin login is just fine and I don't understand it. Theirs a lot of other things that I've never had any issues with a regular laptop as well. I also still have not received an email from my 2 year warranty for my account with them and I don't know how about getting that information but I do have a screenshot of my account number and order number.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Its pretty great.","reviewDescription":"Overall great bang for buck gaming wise, the cons are, low storage space standard, and playing games makes this thing sound like a ps4 pro. (Jet engine)","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Would give this 4 stars","reviewDescription":"Lapttop runs pretty smoothe and can handle most games. only issue i have is that at random intervals the screen would start flickering and it's get kind of annoying. Restarting the laptop usually fixes this temporarily.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Mom wanted to play Genshin Impact","reviewDescription":"I bought this for my mom. She wanted to get a laptop for work but also because she had gotten into a pc game called Genshin Impact. So I got her this laptop and she cried she was so happy. Mom says battery runs out a bit fast but over all good laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Durable","reviewDescription":"Bought for daughter she loved it for teen but it was hard for her to set up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Good enough for entry\/mid level gamer on a budget","reviewDescription":"I bought this laptop as a gaming laptop, of course, but also as a day to day worker. I upgraded the ram and added another m.2 drive immediately, so I'm not sure how the computer was \"out of the box\". The nitrosense is cool on this because I can hit the button and accel\/decel the fans quickly. I'm not sure how I feel about the killer wifi, I've noticed it's stopped some of my background processes when I'm streaming video, even after I changed the profile. All in all, I definitely recommend to anyone looking for a laptop far superior to most production laptops that can support gaming.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"Great product","reviewDescription":"Just took a week extra to arrive but otherwise nothing to complain about!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"You can't utilize half of the storage","reviewDescription":"So after doing some digging around and setting up my laptop I checked my storage after I had downloaded a single game being stardew valley which is a game that is really small its only take 500 mbs to download. Well I found out with a game that's 500mbs and all the things the laptop needs to be bale to cuntion I only am able to use roughly 90 gbs so if you want to play any shooter or any game that has decent amount of content you have to upgrade the storage cause 150 ish gb are used on nothing but the of and other default items which you cannot Uninstall to free up space. The fact of the matter is you are only able to actually use less than 100 gb which you have to really pay attention to other wise your storage will cap. I would have loved to get ark survival evolved but it's a pretty big game being 231gb and with this laptop you can only use just under 100 of the advertised 256 gb memory","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1648512000000}
{"reviewTitle":"Incredibly solid gaming laptop for the price, with some flaws.","reviewDescription":"Just to cut to it, this specific model of the Nitro 5 is incredibly a solid all-around; from the lots of room to expand storage\/RAM, great keyboard, good cooling, etc.. The performance is great as well as it can play most modern games at 1080 ultra settings at great FPS.The negatives for me come in two-fold: the display and battery life.1. The display being 144hz and IPS is great and all, but the actual quality of it is below mediocre. While backlight bleed is expected for an IPS panel, it's weirdly uneven and discolored. Also, I'm not sure if it's a defect with my specific device, but the display can't produce the color red accurately (it's more orangish) and overall things look a bit flat and there's no way to actually fix it besides finding your own ICC file. And even then you might as well use an external monitor.2. The battery life is terrible. Even on powersaving mode the laptop barely lasts 5 hours, and that's just doing basic internet browsing. I'm honestly considering not being bothered with it and just removing the battery entirely.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636329600000}
{"reviewTitle":"Solid product, minor issues","reviewDescription":"I'm generally very pleased by this laptop but there are a few issues worth mentioning:- The trackpad is weirdly offset to the left for some reason instead of being in the center of the frame. This means that whenever I have my left hand on WASD, the base of my thumb rests on the corner of the trackpad which then slightly adjusts the mouse whenever I have to press space or alt. I don't play any games that would require this degree of precise aiming (like FPS, because I suck at them) but I imagine it would be infuriating if I did.- When I'm alt-tabbing from a graphics-intensive game like dark souls 3 to a different program, the screen flashes black for a second. Not really a major issue but it was slightly worrying at first.Aside from that, performance is great, can't really speak to the battery life since I've yet to use it while unplugged, but it's a powerful machine and I haven't had any issues with performance.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640995200000}
{"reviewTitle":"Good Performance","reviewDescription":"I like the performance allowing you to change the graphics settings of a game on the GeForce Experience app.Pros: Good Performance, easy to use and navigate, High GraphicsCons: Always having to discharge and recharge it for performance and battery multiple times, Poor Battery Life,","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693872000000}
{"reviewTitle":".","reviewDescription":"It’s a good laptop overall but there seems to be problems with it every now and then, for example the laptop freezes up every now and then but not so often","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1644278400000}
{"reviewTitle":"No display port, only hdmi","reviewDescription":"Can't utilize gsync or 144hz refresh rate because there is no display port. 😕","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659312000000}
{"reviewTitle":"The battery life is bad, but with the charger in it’s pretty good","reviewDescription":"It’s pretty fast and runs some games well. The storage is low and the battery life is bad.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1642636800000}
{"reviewTitle":"Battery life is terrible","reviewDescription":"Underwhelming unit with very poor battery life.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663113600000}
{"reviewTitle":"Ok","reviewDescription":"It looks find after fix","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"Good","reviewDescription":"Good but the charger didn't fit. Luckily my son had one that fir","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639612800000}
{"reviewTitle":"Over heat","reviewDescription":"Good for price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646092800000}
{"reviewTitle":"It’s died and didn’t turn back on","reviewDescription":"It didn’t charge","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642636800000}
{"reviewTitle":"Scam","reviewDescription":"This is a scam, way too expensive for what i gives","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Seems like no one is talking about temps","reviewDescription":"I bought the 4050 version with the 12500H and it seems like this laptop likes to run at 80-95° unless you take a lot of steps to limit. 1. Limit processor max power from 100% to 95%. 2. Disable onboard graphics. 3. Lift laptop high so intake fans on bottom can breathe. You can't undervolt this thing. I bought a Legion 5 Slim and no modifications were needed to keep temps low so I will be returning this. Lastly, the bezel feels cheap so don't be surprised if it cracks in a year or 2. If you plan on keeping this laptop perhaps purchase a spare bezel so you have it on hand when that unfortunate day comes.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Opinion","reviewDescription":"Excelente mercancia y servicio gracias","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Work well over half year","reviewDescription":"So far so good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"These Gals Are Great...","reviewDescription":"The price was right and was in great condition when I got it. Unfortunately due to some unseen foreseen circumstances I had to return it. However I could not have asked for better customer service. Through the whole process they were very supportive and understanding. I highly recommend them and thier items for sell.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Una excelente compra","reviewDescription":"Cumple con lo prometido por un precio justo, y lo mejor es que puedes agregarle más Ram y cambiarle el disco duro cosa que te recomiendo por que tendrás una maquina más potente si para lo que quieres es para juegos o tareas demandadas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Buen producto","reviewDescription":"Por el precio que tiene es un muy buen producto y hasta ahora no he tenido ningún problema.La construcción es de plástico pero se entiende para recortar costos centrándose en la potencia.Producto recomendado siempre que se le coloque más memoria RAM, 8GB no es suficiente.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"so far, good  fast laptop","reviewDescription":"It has an I5 cpu that scores 19,000 on Passmark.  Graphics are good, with the 3050  gpu scores about 9300 on 3D pasmark test.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Amazing Laptop!! Check out Battery Config at end!! 🔥 Best Budget Gaming Laptop of 2022!! 💯","reviewDescription":"** UPDATECHECK OUT MY BATTERY SETTINGS AT BOTTOM OF REVIEW! LEAVE A LIKE IF IT HELPED YOURS!Definitely Best Budget Laptop of 2022! The I-5 10 Series is a video editing and gaming killer! 💯Great hardware to get you in to the 2020's! I've use Devinci Resolve 18 (Free) to edit my GoPro 9 and Sony FDR-X3000 vloggs. It even handles 4k editing which is expected with this powerful processor! 8GB RAM is decent but i put anotger 8GB into the machine, which was really easy to assemble and disassemble.1080p editing is breeze! 💯👍I also have Steam and a few games like War Thunder and I'm able to play with 60fps, easy, high graphics on every setting, no problem. I don't play the newest top notch games but this could handle it, unlike some other commebts kinda under dogging this machine.I boosted the storage with an extra  1TB M.2 Samsung SSD (amazon) for the extra storage capacity.PC fan run while plugged in can be a tad loud, nothing you have to talk over, graphics these days arnt Galaga, almost everything use CPU and RAM, best thing to do, make sure your ram and extra sroage have heatsink. Get a laptop stand but never run the extra fan. Just packs extra dust into the machine. I have one just as a base for better bresthing of my own laptop.The keyboard is also quite nice. I don't mind the short stokes, my fingers glade across like a gizzle.Just make sure to lower the keyboard brightness (helps with battery)Windows 11 isn't bad either, they did it right, has a Mac-ish feel, i like it. Quick and snappy!Win 11 also comes with a video editor as well which now lets you edit 1080p videos for free!Another Mac move 👍 Which is fine! Not complaining!The computer is super snappy, it's got a badass look to it, it's not heavy by any means! It's a low profile, not flat, it needs room for fans ect..The battery great as long as you follow my settings advice.And think of this laptop like a manual car, you have to change settings constantly. If your just browsing on battery they have to be set one way. If your about to get on some video editing then set the otherI'm very please, with extra parts my total was $967.Absolutely love my new Acer Nitro 5!!Battery Settings1. Nvidia Control Panel - Manage 3DBattery ModePreferred Graphics - Auto-selectGaming ModePreferred Graphics - High Performance Graphics2. Battery & Power SettingsBatteryMode - Power SaverGamingMode - Acer3. Nitro SenseBattery Mode - Disable CoolBoostGaming Mode - Enable CoolBoostSet your profiles on bottom right, Acer - Plugged inBattery Saver - on battery4.  Intel Command CenterBattery Mode - 60pGaming Mode - 60p or 144p5. Battery Saving Mode (Taskbar)Battery - OnGaming - Off6. Windows Mobility CenterBattery  - Power SaverGaming - Acer7. Keyboard BackliteFn + F9 (decrease to last setting)Battery on these settings = ~7hr 46 mins(Gaming Mode plugged into wall)","isVerified":true,"ratingScore":5,"reviewReaction":"84 people found this helpful","country":"United States","date":1647302400000}
{"reviewTitle":"Excellent Value Gaming Laptop","reviewDescription":"Good sub-$1000 gaming laptops are hard to find, but The Nitro 5 gives great value without breaking the bank.  The 10th Gen Core i5 processor is 2 generations old at this point, but it has plenty of power to run pretty much all modern games at a decent setting.  The Nvidia RTX 3050 graphics processor is an entry level to the new Ray-Tracing sexiness that's the next big thing in graphics.  On newer games you probably won't be able to get past the 60fps barrier at 1080p with the settings cranked, but dialing the details down a bit will give you better rates. The display is rated for 1080p and 144hz, and while it's not the brightest or most vibrant screen out there, it's fine for this price point.  There is also a (full size) HDMI out, but I have not had occasion to connect this to an external monitor yet.  The cooling fans do a good job of keeping this machine within temp specs... but do note they can get pretty loud under load (honestly that's almost inevitable on a gaming laptop, it's hard to keep things cool in such a small box. Anyone who games on a laptop should invest in a good headset IMHO.)I have opened this computer up to install a few upgrades (more on that below) and I will say I'm pretty impressed with the build quality for a computer in this segment.  The components are reputable makes rather than mystery off-brands (WD for the SSD, looks like Micron on the single 8gb RAM stick.) All the panels fit together nice and go back together easily after disassembly, making upgrades something you don't have to dread.Speaking of those upgrades... for a computer at this price point you have to live with a few compromises and here is where they may be found.  The storage this model comes with is a paltry 256gb m.2 drive... If you do plan on gaming on the Nitro, either be ready to upgrade this quickly or learn to love delete-ing and re-installing games and apps constantly.  Fortunately, there is a second un-used m.2 PCIe slot on the motherboard to accommodate an upgrade (this processor and motherboard supports PCIe up to gen-3 speeds.) There is also an open 2.5 inch bay for an SSD. Memory-wise, this unit comes with a single 8gb DDR4 SODIMM RAM stick installed.  This should be fine for most gaming- if you don't run big apps in the background-  but since this has two slots total for an upgrade I removed it and installed 2 8gb sticks of Kingston FURY Impact DDR4 RAM,  just for a bit of extra headroom (the max speed the i5 10300H will operate memory at is 2933 Mhz, so it's not worth it to spend more on faster RAM.)All in all, this is a fine machine for someone who's interested in a good no-fuss entryway into PC gaming, or a seasoned gamer who wants an inexpensive but capable machine to go mobile with. Highly Recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"45 people found this helpful","country":"United States","date":1651795200000}
{"reviewTitle":"Budget friendly for new-to-PC","reviewDescription":"This is very much a highly modifiable and budget friendly starter PC. As soon as you look at the hardware you know there are going to be bottleneck points if you want to actually use this for more than 1 modern program. I immediately put it a Predator SSD and upgraded the RAM to 32 bit @ 3200 MHz (two RAM sticks at 16 is going to benefit more than a single 32) which skyrocketed the CPU performance. Every upgrade video you will see show a bunch of adapters that you don't need. There are two (2) M2 ports you can easily access removing the bottom; one hosts the original Hard Drive and the second I put the new SSD drive in, I then followed the Hard Drive copy process on their website and within 10 minutes I was done. It also opened up the bottleneck in the system and allowed games to appropriately use the GPU.Now, the GPU is just midgrade but you get what you pay for. You're not going to play Battlefront \/ COD at 1080p by any means without a lot of lag, but after just the two upgrades every game so far it flawless at 720p. I could have also lowered the refresh rate from 144 Hz and gotten the responsive 1080p at the cost of smoothing. You can plug in an HDMI-ported high refresh display that bypasses the graphics bottleneck but you got a laptop for a reason and the GPU can still only handle so much.Overall, this is my first time getting a dedicated gaming PC and I'm extremely happy with not only how well it performs but how well laid out it is to modify\/upgrade. I would recommend it to people starting out and don't have a high graphics demand.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"great","reviewDescription":"great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Delayed for several weeks, box had been open","reviewDescription":"The delivery was a total nightmare and when in finally got the seal had been violated and the box had been open","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"I've been sold a used product","reviewDescription":"replacement with a new model ASAP.Furthermore, the product was delivered without operating instructions (booklet)","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Didn't charge or start","reviewDescription":"I anticipate your questions - was the AC adapter plugged in correctly, was the outlet working? I checked both several times, all fine, just no response from the battery charge light, no lights whatsoever, no charge, no start.This is directly after unboxing, btw, so it was incredibly disappointing to be shipped a 750 dollar paperweight. I am in the process of getting my refund, and will never purchase an ACER again.","isVerified":true,"ratingScore":1,"reviewReaction":"41 people found this helpful","country":"United States","date":1634601600000}
{"reviewTitle":"Dead Upon Arrival.","reviewDescription":"As many others have stated, this product arrived dead. I will not deal with Acer and risk more terrible quality control. You can see it’s plugged into to laptop and wall and doesn’t receive power. Who’s to say if it’s the cord, or the laptop itself. It’s a problem that’s been reported enough to not still be sold to consumers.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1648339200000}
{"reviewTitle":"Arrived Dead.","reviewDescription":"This laptop arrived dead. Multiple reviews have stated their laptop arrived dead as well. Don’t waste your time with this. I tried charging through 3 different outlets and still nothing. Returning and refunding. Tech support was very helpful in making my return and refund. Again- do not waste your time with this Acer Nitro 5 laptop. It should be taken off the Amazon site as a whole.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1642032000000}
{"reviewTitle":"Can't run dual monitors","reviewDescription":"This laptop says it's for gaming but you can't even run dual monitors. It has one. ONE! HDMI out port and the USB-C port isn't lighting so you can't run a monitor on it. Even after buying a USB 3.0 doc for it with an additional HDMI port on it you still can't run a second monitor.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1660176000000}
{"reviewTitle":"Plugged in for 8 hours to charge and no charging lights, computer wouldnt even turn on.","reviewDescription":"We received this laptop yesterday. Plugged it in for almost 8 hours to charge. No lights came on showing it was charging. Pushed the power button. Nothing. No pull tabs, or on off switch. This is a $700+ paperweight.  Now just waiting for UPS to pick it up so we can get a refund. I do not recommend buying this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Can't fulfill it's purpose as a laptop","reviewDescription":"Only bought this for the portability that supposedly comes with owning a laptop. However the battery life is awful and it consistently drops connection on Wi-Fi every 10-15 minutes. If I wanted to be plugged into a router and a wall I would just use a desktop.Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"1\/5. Unlucky Dead on Arrival for this guy...","reviewDescription":"I wish I could give this 5 stars...Dead on Arrival. Returned 1 hour after opening. Unlucky I guess.That said, it's a nice build and the weight\/form factor surprised me.I have an Acer chromebook, so I do trust them for quality. The return process is simple:just print label and drop it off at a UPS store. Good luck to everyone!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1639440000000}
{"reviewTitle":"may fail without reason","reviewDescription":"Did not manage to use it really. Mainly have it stored on the shelf and use about 10 times. Last week start to look for ssd to increase storage, and screen died, completely. Honestly it's very disappointing. So far it's my worst purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664755200000}
{"reviewTitle":"ARE YOU KIDDING ME!!!  🤬","reviewDescription":"We bought this computer in June of 2022. It is now January 2024. It's not even 2. so the computer wasn't holding a charge, we took it to a computer repair shop and they told us that the charging port on the motherboard is needs to be fixed.  So so we called the company talk to Tech Support. And because the warranty limited 1 year ran out after a year and a 1\/2. The goddam thing broke? And they want to charge $500 to fix it.  And no, no remorse, not a care in the world. Because the limited warranty ran out! I am so pissed. $725 Computer and they want to charge another 500 to fix a charging port on a motherboard. And not even have a care in the world. Customer service sucks!!  I would've given it zero stars but it won't let me","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Does not Power on!!","reviewDescription":"🚨 DO NOT BUY!!!!!! 🚨This was supposed to be a gift for my son’s 14th birthday. Unfortunately when we tried powering it on it wouldn’t turn on. No indicator light that it was charging. It gets worse, when I tried to return it I wished to get a replacement one sent out but I was informed that it was not an option. Only a refund . Fine I agreed to that but then I was sent a return label that needs to be printed out. I requested a QR code but they didn’t want to provide me with one . Long story short I am now waiting for a return label to be delivered to me . Once it’s all said and done I’ll have to wait 30 days for a refund!! Horrible product and horrible customer service. Epic fail for my son’s birthday. Thank you Amazon and Acer!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"DOA-DON’T DO IT, ITS RUSSIAN ROULETTE","reviewDescription":"Like a moth to a flame I was mesmerized by the value and great review ratings and I ignored the fact that there are at least SIX REVIEWS IN THE LAST TWO WEEKS saying their machine (like mine) wouldn’t even turn on!! Most stores would recognize this as a problem but Amazon shamefully just keeps selling this junk.  This was in my house 3 hours before I got my money back along with arrangements for them to pick up the craptop at my door to return it.  I will find another (non Acer) laptop, and I will buy it from somewhere other than Amazon.  There has to be a price to pay for knowingly selling defective products.EDIT:  Just want to address the “you have to press the charger plug in extra hard” comments from other reviews. Imagine you buy a brand new car and the dealer tells you that you need to use extra force when you close your door otherwise it will stay open and the car won’t run.  Are you going to be ok with that? Not me. And even if that’s the issue,  why didn’t support know it when I talked to them?  Also why is the battery at zero % therefore requiring the charger to power up? My replacement MSI worked perfectly right out of the box.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1639440000000}
{"reviewTitle":"Black Screen","reviewDescription":"It’s only been 2 years and my screen is completely black. I’ve only used it to play The Sims (only during the summer) and create a few PowerPoints. Also, the batter life has always been horrible. I don’t even think it has ever lasted a full hour (no games being played).This shouldn’t be an issue for a laptop that was barely used (only during summer months).","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Doesn’t work","reviewDescription":"My computer has been randomly shutting off and I just want a refund doesn’t run even the sims and 10 year old game","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Don't buy, support is Horrible","reviewDescription":"I have been in the IT world for over 20 years. I left the laptop on the charger and woke up to a cracked screen. Called Acer support and they wouldn't cover my cracked screen. Two days later the computer would no longer turn on. Acer Support said that a cracked screen can stop a computer from working and it's not covered.Remember, I have been in IT for over 20 years so I'm not stupid. I have worked on hundreds of computers and never seen a screen issue stop the whole computer form working.So I guess after just little over 120 days I now have an expensive paperweight. I thought I would give this Acer a try because of a good Prime Day deal but this was my first Acer and my last because the support is so horrible. The Agent wouldn't listen to me and played games with me to get me waisting my time to get me off the phone.I would suggest paying a little more and go with a company that actually supports their products.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"80% RAM preoccupied","reviewDescription":"I got this pc for solely entertainment purposes, and when i download league of legends, it keeps lagging really bad, when i checked task manager, the ram is already at 70% preoccupied, which is very unusual for a brand new pc. Also, this pc does not recognize my headset and gave me a hard time.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Pointless","reviewDescription":"Waste of time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Can’t open games 75% of the time","reviewDescription":"I got this laptop to play with my friends on Roblox but it never open it closes on its own so I tried a Minecraft and guess what doesn’t work your better off buying a laptop like ones you get at school they can at least open games.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Crashes constantly","reviewDescription":"Just bought this \"gaming\" laptop, and all it does is crash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Perfect!!.","reviewDescription":"Perfect!!.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"LOVE IT!","reviewDescription":"The product came perfectly. Everything works smoothly. I’m very happy with this product. For those that say it doesn’t come on just plug the charger to the computer, when you hear one click sound push it in a bit harder until you hear a second one, plug the charger to an outlet and there you go. It happened to me and I thought I bought a computer that doesn’t even come on but then I remember a review I saw and it worked.Received within one week to Guyana!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1696118400000}
{"reviewTitle":"great","reviewDescription":"good choice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"BUEN EQUIPO, EXCELENTES PRESTACIONES","reviewDescription":"El equipo es un buen equipo, si estas buscando un equipo para jugar. En cuanto a portabilidad es un poco pesado, si estas buscando un equipo de facil transporte este equipo no es el tuyo. Si lo que buscas es un equipo para jugar y hacer tus deberes diarios sin necesidad de tanta movilidas, es perfecto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"BEAST","reviewDescription":"I dont usually write reviews but i purchased this laptop for my son whos a gamer and this thing is a BEAST! YES we did some mods and utilized some of the upgradable features to make it a little better which cost us all of a couple hundred bucks and let me tell you for a teenage boy he is STOKED! Im one happy momma for the price and hes rockin and rollin! It has a fan better then his bedroom fan and he can do his college work, game, watch his videos, etc and im confident i wont be replacing it for years to come! The warranty amazon offers for it is AMAZING also! If your on the fence DONT be! JUST DO IT!","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1683417600000}
{"reviewTitle":"Good mid range laptop","reviewDescription":"I bought this....2 years ago? 3? It's been serving me very very well. You're gonna have to pop it open and add a larger SSD but otherwise it's a solid laptop for the price. I can blow through games at non-4k resolution well, it handles VR, did some programming on it. It's great I love it to death","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Perfect for modern gaming without overdoing it on the budget","reviewDescription":"Supremely happy with this purchase. Got it for Black Friday and I absolutely love it. Would've been worth the price even without the BF discount to be quite honest.Excellent high refresh rate, high resolution monitor. Runs smoothly. The keyboard feels light and good to the touch. Very light for its size and zero noise from the fans.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Great for getting started on PC gaming but...","reviewDescription":"So, I got this laptop so I could start pc gaming for the first time, and I love it so far. However, the first day of having it, I've noticed that the charging indicator would flash orange nonstop after a full. I've tried calibrating the battery(No flash for 2 days), battery resetting(No flash for 10 hours), unplugging the battery(No change). None of these things would get that darn light to stop flashing. So, to remedy this issue, I've changed the battery. Low and behold, it never has flashed orange since. First thing I recommend with this laptop is change the battery ASAP for two reasons. 1. The battery life isn't very long. 2. Prevent that issue that I ran into when buying mine.(plus it lasts 4 hours longer than the one it came with.)I haven't hit my 80 Days with it. So, I will update this review when I do if I run into any other problems.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1660608000000}
{"reviewTitle":"Fantastic Computer","reviewDescription":"This is the first computer I've ever bought myself now at 18. Previously my dad would usually get the PCs that were being replaced where he worked in IT. I never had a computer that could run the beefy games that I like smoothly and this was the first to ever do it and do it well. It doesn't overheat and the fans are great.My 16 year old brother eyed my computer and loved it so much that he bought one for himself.You really can't go wrong with such great specs and RTX 3050. The only thing that I've altered is the ram. Please do yourself a favor and get 32GB to see this baby run like hell. Purchase this computer.TLDR: Buy this and buy 32GB of DDR4 ram.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1679184000000}
{"reviewTitle":"My 12 Year Old Loves It!","reviewDescription":"This is a great entry gaming laptop for my 12 year old who will be 13 next month. The colors and graphics are great, he loves the lighted keyboard, and this definitely has a bit of weight which contributes to the sturdiness. I also like that it’s also just a great laptop as well. We were able to upgrade for Windows 11 for free.  At home, he now uses this computer vs the school assigned Chrome, for his Zoom math tutoring sessions (the camera and microphone is decent we still use a separate microphone), and to also complete his homework on Google classroom.Other features: I also like the number of inputs which has more than my Lenovo X1 Carbon ThinkPad, and the  ability to wirelessly connect the laptop to your tv as a second extended screen is pretty cool.Overall this was a present for his good grades, and it also works great for homework assignments and video conferencing as added bonuses.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1640044800000}
{"reviewTitle":"Myeh","reviewDescription":"I would say that there are a lot of problems that I am not sure whether to attribute to the laptop itself or to windows 11 being terrible. Basic functionality like, \"If you close your lid, you'll need to restart your computer every time you open it again or it won't play videos,\" or \"The search button doesn't work at all,\" or \"Plug and play usb functionality stops working and you need to unplug and replug things constantly.\"The hard drive space is too small too as my only hardware complaint, and that's easily remedied.Otherwise it's just fine I guess.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656633600000}
{"reviewTitle":"Good specs for the price but the display is unacceptably bad.","reviewDescription":"For a budget gaming laptop, this Acer Nitro 5 has good enough specs, the Core i5 and the RTX 3050 are sufficient. The problem and it's a big one, is the display. The image on this laptop is AWFUL. No matter how much I tried to calibrate the colors, it looks bad. The colors are washed and the screen is dim. whether it's game or a movie this screen won't do it justice. Too bad because I like many other aspects of this laptop like the relatively long battery life and the red-colored keyboard. I find myself playing more on my 2 years old Legion 5 which looks way better than this newer Acer Nitro 5. Even for under $1000, you can get something better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640390400000}
{"reviewTitle":"Looked good on paper, but underperformed","reviewDescription":"Bought this to play games with friends since GPUs are astronomically overpriced and this laptop was extremely underwhelming. The screen is very dark and the colors are so muddled and muted. I expected more from a 144hz display. The GPU could barely handle running call of duty on the lowest settings at 1080p. The biggest downfall however is the SSD storage space. I opted for this model over a more expensive model because it was cheaper to add on an addition 2.5\" drive than the model with a 1tb ssd from the get go. This laptop refuses to acknowledge any SSD I plugged into it. Save your money and buy something else.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648339200000}
{"reviewTitle":"Sent it back. It failed twice within the first two weeks","reviewDescription":"I had to return the Acer Nitro to Amazon.  The computer failed to boot properly twice within the first two weeks and both times it said the system needed to be completely reset before using it again.  I have had an Acer Aspire for more than 5 years and it has performed without a problem during that time, so I do not have the patience to keep wiping and resetting a brand new $800 dollar computer.Amazon did take the computer back without question, so that part was good, but I'm still shopping for a dependable, start-and-run-everytime-without-problems-computer for less than $1000 dollars. I don't know if they even exist anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646438400000}
{"reviewTitle":"My 2nd time getting this computer and it’s just okay","reviewDescription":"Their are definitely better gaming laptops out there but this one is just okay. I’m kinda stressed out. This is my 2nd time buying a nitro 5 and they just seem like they are prone to breaking. First one just shut off and never turned on after having it for a couple months, my second one the ram, cpu and screen started acting up pretty much just messing up the whole laptop, only with in a couple months again. I enjoyed gaming in it but for the price you can definitely get something better or build something better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655510400000}
{"reviewTitle":"The SCREEN.","reviewDescription":"I'm sorry to say, but I am so disappointed. They don't make things like they used to.After having this laptop for some time I've noticed some weird artifacting on the LCD\/SCREEN.So, to explain, with night mode on or off you can see these rapidly moving lines that go through only certain colors like greys and blue's. This is unacceptable. It's very noticeable once you see it, and nothing software wise fixes it, so it's definitely a hardware problem.I painfully had to make the decision to return this and I'm very upset.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"Was Great For a Day","reviewDescription":"So I loved this laptop for a whole day. Thought it was great. But suddenly after just 24 hours, it’s broken. It says that my battery is at 100% yet if I unplug it, it automatically shuts off - just goes straight to black. If I wanted a device I had to keep plugged in to use, I’d have bought a desktop instead.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658016000000}
{"reviewTitle":"BUYER BEWARE - Keyboard is not replaceable","reviewDescription":"The laptop was designed so that the keyboard could not be replaced. Was shocked to find this out as that is a common thing to replace with a laptop. So FYI - if you break it, you're looking at buying a new laptop.It's a shame because it's not a bad budget gaming laptop otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661040000000}
{"reviewTitle":"Screen not the best","reviewDescription":"Colors look dull, screen could be better","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Dies after 3 days","reviewDescription":"Laptop comes in the mail. Second day gets error and blue screen. Third day sparks and kills itself. Manages to turn on. The plug in port would beep nonstop and might shut off again as if the battery is nonexistent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657670400000}
{"reviewTitle":"👍🏾👍🏾👍🏾","reviewDescription":"It is what it said it was. 👍🏾👍🏾👍🏾","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651536000000}
{"reviewTitle":"Great for being on sale!","reviewDescription":"For the price you can't go wrong. Acer hasn't treated me wrong yet. 100% would recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640649600000}
{"reviewTitle":"Good value for money","reviewDescription":"I had to add another SSD","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"Debí de pedir una con más capacidad","reviewDescription":"Todo excelente pero recomiendo comprar una con más capacidad","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1643414400000}
{"reviewTitle":"Great laptop!!","reviewDescription":"The battery life isn’t great but other than that it’s great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642032000000}
{"reviewTitle":"Good laptop for creating models","reviewDescription":"+Fast work, bright display,- 8GB ram is low for some programming","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641600000000}
{"reviewTitle":"Nice PC for it's price.","reviewDescription":"It works just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Buena compra","reviewDescription":"Buena compra, su relacion precio\/producto es 4\/5","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642204800000}
{"reviewTitle":"Great laptop","reviewDescription":"Wish the mouse pad was more centered. Easily bumped while playing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"Not bad product","reviewDescription":"Looks great. Easy to configure.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645833600000}
{"reviewTitle":"Didn’t live up to the description","reviewDescription":"The only reason I’m rating this not good is because they claim it is more than strong enough to hook up an oculus quest 2 and run be gaming on it but in reality the games were so slow it wasn’t doable. I’m sure it’s good for some pc games but if the product isn’t what the description claims that’s a deal breaker for me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"PLASTIC CRACKS AFTER 18 MONTHS","reviewDescription":"I have used this laptop for college and I have played a little bit of video games on it as well. I have always been careful with this laptop and I am genuinely careful with where I put it and how I use it. 18 months after buying this product, it has now had parts of the plastic crack in 3 different places without misuse of the product. The Plastic around the screen has cracked near the connecting points and the keyboard has cracked by the ethernet port without use of the ethernet port ever. This product is nice for school and videogames and streams videos and video games very well. Very disappointed in the quality of the plastic.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"It did not work out of the box.","reviewDescription":"This laptop did not work out of the box. It had a loose cable on the motherboard that was preventing it from  booting. The webcam has one of the noisiest images I have ever seen.On the plus side it has great cooling, upgradeability and I love the keyboard. The memory and storage are lacking, but can be upgraded easily.The cpu is not horrible, but only having 4 cores is holding this laptop back. It is too easy to peg it to 100%. The battery is just ok. It could be a lot better.I would not call this a gaming laptop. It will be ok for casual gaming, but it is too easy to hit 100% cpu use. I would not get this unless you are planning on upgrading the memory and adding another m.2 driver.I would have rated it  3 stars if it turned on without needing me to take it apart.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"WAS A GREAT LAPTOP UNTIL IT WASN’T!","reviewDescription":"i ordered this laptop on january 5, 2022. it worked great, i only used it for sims 4 including custom content and mods. only a little over two months later, the screen has went completely black. the computer is on and still works but you just can’t see anything. the fans and keyboard lights work fine. i connected it to the tv via HDMI and everything looks fine just can’t use it alone. i contacted the seller, no response. this computer was over $800 when i purchased it, not sure if it’s the same now. but for all that money, and the little bit of time bc that’s passed, i shouldn’t be having ANY problems with this computer. so if you’re thinking about buying, BE CAREFUL. also, you don’t have the option to get a refund, so love that for me!! 💀","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647129600000}
{"reviewTitle":"Restarting issues right out of the box","reviewDescription":"The laptop worked good, I would have been happy with it. But my big issue was when I wanted to play a game. Since it IS a gaming laptop after all. The game would shut down and the computer would restart every ten minutes or so. I haven’t had this thing for a week yet and it won’t stop. I’ve tried every troubleshoot for this issue with Acers. Apparently it’s the most common issue. But nothing worked and I shouldn’t have to dig this much for a brand new computer with only one game installed.  I’m sending it back and going with a different brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672963200000}
{"reviewTitle":"It’s not very good.","reviewDescription":"It can hardly run fallout 4 on the lowest graphics settings. It’s so choppy it’s no longer fun to play.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Audio drivers fail every other day. Avoid this one!","reviewDescription":"This would be a decent laptop for light gaming and daily tasks, but every other boot, all audio devices, including the motherboard audio, will fail to show up in Windows. Like, at all. Reinstalling the drivers only provides a temporary fix. It'll be fine for like a week. Then they'll disappear again.Stay away from this laptop!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Worst battery ever","reviewDescription":"What I like about it it's Uber fast...but so is the battery losing even with some tips it just goes so fast","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Super hot","reviewDescription":"Produces allot of heat. Unless you have a cooling stand I wouldn't get it. Battery lasts about an hour. The power cord goes in the back and you have to make sure it's positioned right or the heat will start to melt it. Performs great otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Arrived Broken.","reviewDescription":"When I received my Acer laptop it had what looked like a small ding in the top left corner of the screen-- to my disappointment, this meant there were very large, awful crack streaks & lines going down the side of the panel, rendering this laptop useless. Currently awaiting a refund. When I got it in the mail, the factory seal on the box was already broken, meaning this laptop may have been a refurb or previous return. I'm sure this laptop may otherwise be a great model. Buyers take caution.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658880000000}
{"reviewTitle":"Weird specs choices","reviewDescription":"My brother bought this on my account, didn’t realize that the i5 was 4 cores. Paired with the 3050 makes no sense. He likes it just for what he paid for it could’ve been better","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"Overpriced for what you get","reviewDescription":"The battery life is awful. I leave it unplugged for an hour (while lid is closed) and it dies on me. Other than that, it's okay. Gaming is about the same as you could get on a regular laptop. I just think it's overpriced.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Good so far","reviewDescription":"Am writing this review from the actual laptop. So far, it's going well .... When this laptop arrived, it came with a protective box over the actual laptop box, that protective box was flawless BUT the laptop box was opened. The seal was propped up and the sack the laptop came in was upside down. I bought this laptop new. A sticker on the laptop has a little minor peal on it. I was hoping to keep it on for aesthetic reasons, but I might peal it off in the near future now.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658188800000}
{"reviewTitle":"Automatic Fans Dysfunctional","reviewDescription":"I try to use this in class as well sometimes since I did spend several hundred dollars for it. No matter what fan settings you put it on it will randomly have moments where it sounds like a fighter jet in the middle of the room you're in. Even worse when actually gaming. Would tell myself not to buy it if I could go back in time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669766400000}
{"reviewTitle":"Decent for price, but…","reviewDescription":"Laptop doesn’t hold more than 2 MMO games. Decent graphics and nice looking laptop for price. The reason I gave it 3 stars instead of 5 is it doesn’t hold many DL games AND we bought 2 of these and one of them got a white screen of death after 4 days, had to plug it into our PC monitor just to see anything and to be able to clear everything off it to send it back and request a new one. So that really sucked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651276800000}
{"reviewTitle":"This laptop pc gaming rigs cpu runs really hot the i5 10300h runs hot","reviewDescription":"I5 10300 H is a great CPU but it runs really hot normally around 95C which worries me because that’s the melting point I would recommend putting on a new layer of thermal paste to help you keep it optimal but it is a good gaming laptop I use it to play VR chat oblivion Destiny 2 and a few other games like the Sims but it it runs well and it also runs well playing fallout new Vegas","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Screen glitches!","reviewDescription":"The computer was great! Until it started randomly glitching! If the screen is barley moved it blacks out and sometimes (as I’m the video posted) the screen just starts randomly glitching","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1673740800000}
{"reviewTitle":"powerful, but SOO loud and SOO heavy","reviewDescription":"yes, I can do video editing on it, but otherwise, I hate using it. can't wait till I can replace it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683244800000}
{"reviewTitle":"Junk","reviewDescription":"It did not work on arrival had to clean power terminal. Than 3 months in stopped working completely had to send it back for fix. When it worked a nice laptop. For price though not a great machine should work out of box and for years not a few months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650931200000}
{"reviewTitle":"Not for AAA titles","reviewDescription":"If you're trying to play minecraft or other small games this is perfect, but AAA titles like Warzone and demanding games alike this isn't your best bet. For reference in warzone with the lowest possible settings you get 50fps on a good day.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656979200000}
{"reviewTitle":"Quit working after three days","reviewDescription":"This is less a review about the product than about Amazon. Yes, the product did quit working after three days and that's not great. However, Acer has offered me an option to get the laptop fixed. Unfortunately that means I'll be without it for an unknown period of time. What got this to a 1 star rating is that Amazon will not offer a replacement. They'll give me a refund but will not guarantee me the opportunity to purchase a replacement at the same deal. Thanks for nothing Amazon!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Worst mistake of my life","reviewDescription":"Came with a corrupted BIOS, which I fixed. BIOS was severely outdated, fixed. Came with 40 bloatware programs, also fixed. Had to configure 200 settings just to dual boot Ubuntu, another fix. Then I booted Windows 11 and Acer's software BIOS corrupted again, which I fixed, again. By uninstalling Acer's bloatware version of Windows and installing my copy of Windows 11. Worked for 2 weeks before corrupting Ubuntu to the point where I had to reinstall everything. I've been using Linux for 12 years, never had this much of an issue.See the problem here? I wanted to try something other than a Dell laptop and instantly regretted it, I'm past the 30 day return window just from troubleshooting and from what I've been seeing in the reviews I might as well use this laptop for parts and buy a Dell. I will never purchase an Acer product in my lifetime again.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Buyer beware","reviewDescription":"It was decent till it gave me the black screen of death I’d go with a different brand","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Repairs","reviewDescription":"Costly for repair ,must pay for shippingCustomer service needs improvementRepaired laptop at computer repair store, aces wanted too much for a broken screen replacement,Only to find out aces ruined the motherboard when they removed the bottom panel of the laptop attempting to find why the screen wasn’t workingNow the cost is more than the computer !","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"It doesn't boot","reviewDescription":"It was functioning very well, but I noticed that it was getting kinda hot sometimes, I tried to turn it on two weeks ago and it didn't work. I'm from Venezuela, so it's hard for me to get a refund or change the product, so I sent it to a technician here that told me the mother board was broken. I hope you improve this kind of problems so they don't happen again!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Bad","reviewDescription":"Probably one of the worst laptops I've gotten, the storage is so little that you need to buy a more, the keyboard itself wasn't properly put together, it broke within and year and has been running on blood, sweat and tears until it stopped working altogether just recently. I reccomend putting your money towards a real computer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Warning. Serious problems!!!","reviewDescription":"I purchased two of these.  Neither worked properly.  The first one made a very loud clicking noise from the fan.  See video.  Returned it and received a second one. The new one would not turn on initially.  After trying for 30 minutes or so it finally started.  The next day, it would not turn on for several minutes again.  Now it seems to be completely bricked - Not working at all.  Not sure if I will try again.  First time Acer product user.  I’m not impressed","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Died less than two years old","reviewDescription":"I suppose I should be grateful mine didn't die a month after warranty like some buyers, still for $900 I expect at least 3-4 years of use. It began with a swath of fine horizontal lines clustering near the top of the screen; they'd get worse and then it would freeze. This happened more frequently and sooner after power-up until I couldn't even get 15 minutes of use. I tried all suggestions at the Acer support website to no avail. No fix can cure poorly-built imports. After so many disappointments I have sworn off HP and Dell laptops. I will now add Acer to that list of Never Buy companies.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Stop working after 2  years of use","reviewDescription":"It stopped working after two years of use. A short circuit fried the processor. And it can't be repaired. I lost my money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Half-functional - Other brands do it better.","reviewDescription":"It's been a few weeks, the machine has the following issues;- Runs extremely hot during games, performance will still drop to sub ten FPS or hang completely. Alt-tabbing borderline lags out\/crashes the machine.- USB ports on the left side fail to detect any and all new hardware, rendering the machine useless without a USB dock.- Sound coming out of the speakers is almost impossible to hear, so good luck watching videos\/movies\/etc. without headphones.The only good thing about this is the battery life, but since I spend most of my time with my machine plugged in because there's no way I'll be able to game on battery due to the performance drop battery life is useless to me.This is a very weak machine. Get an Alienware or MSI if you want a higher quality product. I've seen Dell and HP laptops sell for $200 that can do more than this joke of a machine can. If you want barebones that MIGHT be able to run some games? Sure. Purchase at your own risk, though - as USB failures seem to be a common ACER problem.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1642291200000}
{"reviewTitle":"Over heats","reviewDescription":"I've had this laptop for almost two years and the main problem I have with it. Is it over heating and it doesnt stay charged long.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640217600000}
{"reviewTitle":"A strange combination","reviewDescription":"The CPU isn't the best it could be for the money, the gpu is a 3050 which reviews are saying this mobile version is inferior to the old RX 580 from AMD, which means it's not very good at all and only has 4gb of vram, the amount of RAM and storage is also low. But they give you a 144htz screen. It does not make sense and for the money you could get better. If you want to game a 3060 should be the least you accept, since the 3050 is quite poor outside of old games or very low spec modern ones.It's rather overpriced to me and I'm not impressed with the cost cutting they did.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1626566400000}
{"reviewTitle":"Not good but cheap.","reviewDescription":"Acer produces cheapest computers. The low price comes from cheap chips. Still worth to buy if want to save money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630454400000}
{"reviewTitle":"After a panic attack and some deep research","reviewDescription":"I thought it was dead on arrival, but you have to really pay attention to how you plug it the port in the back. There is an extra pin that clicks when you push a little harder. I learned this after a mild panic attack and much research.As a single mom I bought this laptop on Black Friday. With working in retail I didn’t have a chance to open it and charge it\/load it with all the cool things from Steam before Christmas Eve when I was about to wrap it - saying I had to work but secretly went to a friends house to wrap gifts. When plugging it in, the charge light didn’t light up. I must have unplugged\/tested the outlets a million times, crying because all my son wanted for christmas was a gaming laptop.After some googling I found a forum talking about this. Glad I did. I’ll update and see how it actually performs once my son starts gaming on it.What a heart attack for no reason. It should really specify this, because when you just plug it in there is a click before you have to push harder, for another click to charge.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1640304000000}
{"reviewTitle":"No es tan potente","reviewDescription":"Deja mucho que desear de mi parte, ya que Fortnite de 60 fps en medios no sube más y da tirones hasta los 28 fps, juegos de bajo rendimiento como L4D2, BF4, y por ese estilo están super bien, pero los de última generación ni de broma los corre, cabe aclarar que le subí la ram a 32GB y le compré un M.2 y ni así, aunque actualices drivers no da para más el equipo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1707609600000}
{"reviewTitle":"It's just alright","reviewDescription":"I bought this laptop for my dad as I have the same one but mine has 16Gb of ram while this one only has 8Gb. I can definitely tell the difference. This one is a lot slower doing just routine things like setting it up and downloading the usual programs such as office and Adobe. It may look just like mine but it's definitely not as responsive, however it will do for what my dad needs it for. If you're a gamer you definitely don't want this. If you want a fast and responsive device that will last you fir years, this also isn't the device for you. If you want something to just check your email and the weather daily then this will do the trick.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1667088000000}
{"reviewTitle":"Received defective item","reviewDescription":"Received a defective laptop. The screen had some lighting issues. S","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1675987200000}
{"reviewTitle":"Buena pero la pantalla es pequeña.","reviewDescription":"No me gustó la pantalla, es pequeña creo más de lo q dice el producto","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1698364800000}
{"reviewTitle":"Don't bother contacting support","reviewDescription":"Their BIOS is about as locked down as I have ever seen one, many options simply missing.  COntacting support it seems they don't really care.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Not even close to my previous laptop","reviewDescription":"I replaced my aging Acer laptop with this 'comparable' model only to find out it is NOT COMPARABLE AT ALL. I had driver issues right out of the gate and still can't get the sound to work consistently. I am frustrated beyond at the several steps down I've taken with this purchase. NOT HAPPY. (One week after my initial review, my opinion has only gotten worse. This laptop will not stay connected to my Bluetooth devices and the sound still is not working properly, although I have gone through all the trouble shooting I've not found a solution. I am going to take that old laptop in to have it gone over and put this $800 paperweight on the shelf.)","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"works well until it doesn’t !","reviewDescription":"I had this laptop for a year and 9 months, and it worked very well, until it randomly shut off and refused to turn back on ! I tried customer support on the acer website and found no solution, and they have been unreachable since it is out of warranty. A laptop under 2 years old, taken care of, treated gently, and yet ! The support chat option has not worked, and when I send any emails to their support email they bounce back and tell me this email does not exist !! I’m extremely frustrated with this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Decent power, POOR battery life","reviewDescription":"The laptop itself is good, processing power is acceptable. Backlit keyboard, big track pad, light weight, bright screen.The bad--The laptop has a very short battery life (the price of the laptop being light). The mouse track pad left mouse clicks too easily (while moving the cursor, its too easy to inadvertently click the track pad with the problems that comes with that).At the price point, it's not a slam dunk, but not horrible.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Shoddy","reviewDescription":"The product is a solid all around gamer, great for a modern pick up. BUT! It needs a ram upgrade and it needs more storage. I put in a 1tb ssd. However, the product I received was clearly defective, it wouldn't let me do the windows start up, and even now that I swapped the ssds and installed win 11 manually. If the screen shuts off or the lid is closed my computer blue screens. So buyers beware, some driver issues already, otherwise it's a great budget laptop and easy to upgrade.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"It works","reviewDescription":"I've had this for over a year now and it works alright, only issues is it does tend to crash every once in a while, more frequent when gaming, and honestly can't leave it unplugged from the charger for very long","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"Laptop","reviewDescription":"This was a perfect gift for my teen son. However 2 years and a month later and the motherboard is fried and nothing they can do at this time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Battery","reviewDescription":"My only complaint,  which is a huge one for me,  is the battery life is horrible!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Crashed right out of the box - very hard to complete setup","reviewDescription":"I know it's a cheap PC, but really - it should be able to complete setup without crashing. It kept freezing forcing me to hard reboot, and then it kept dropping the Internet connection, even though I'm 4 feet from the router. All other devices are working fine.No manual at all - no way to get help that's apparent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Worked great for a year, however overheats pretty fast","reviewDescription":"Unfortunately the GPU burnt out and causing the PC to crash often, looking for a replacement. It’s a laptop so you get what you paid for, just be very careful.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Average","reviewDescription":"Main issue is screen display all the way turned down while playing a card game, I’m lucky if the battery even lasts two hours! Disappointed about battery life mainly! Sucks having it plugged in all the time!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658275200000}
{"reviewTitle":"Just got mine today BUT for some reason it won’t turn on or charge while plugged in. HELP anyone","reviewDescription":"I don’t know what could be possibly wrong with it or if I’m not doing something right . I just opened up this new laptop out of the box and it won’t turn on nor will it charge . Can anyone help me please ?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650672000000}
{"reviewTitle":"Issues with keyboard.","reviewDescription":"Several keys on the keyboard have fallen off and even after trying to reconnect them they come loose.  Got tired of them not staying put and started using a wireless keyboard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662076800000}
{"reviewTitle":"Great besides battery life sucks","reviewDescription":"Great besides the battery barely lasts maybe 2 hours just browsing on the internet. Very dissapointing. Great otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668988800000}
{"reviewTitle":"Charger port","reviewDescription":"I received the laptop and couldn’t figure out why it wasn’t charging.  Read a lot of reviews to see what the problem was and after 20 minutes I just pushed the charger into port harder until it clicked a second time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641772800000}
{"reviewTitle":"Thought it was DOA but it is not","reviewDescription":"So on Christmas morning I thought it was DOA. However, you really have to push in the power cord into the back of it computer. There is a noticeable click. If you do not hear the click then it will not charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640390400000}
{"reviewTitle":"No touchscreen but A+++","reviewDescription":"I needed a touchscreen and a ten key. I had to return it because it didn't have a touchscreen. It's important for multitasking while gaming at the same time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652918400000}
{"reviewTitle":"Bad Gaming Laptop","reviewDescription":"Frames will be locked at 60 automatically, you have to change the settings yourself. The laptop can barely run a small game without issues, I’m kind of disappointed. I use this “gaming laptop” for everything besides gaming now.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640563200000}
{"reviewTitle":"Not very fast","reviewDescription":"Couldn’t handle beamng on steam for very long before I had a gpu crash. Not clear if memory is expandable","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1659571200000}
{"reviewTitle":"so far so good","reviewDescription":"currently charging, nearly had a heart attack after an hour of it not lighting up or turning on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655164800000}
{"reviewTitle":"DO NOT BUY!","reviewDescription":"Ordered this computer for my son's birthday. It would not turn on despite having it plugged into the wall and confirming everything was set up properly. I reached out to the seller and did not receive a reply. I went to return the item and I'm being forced to pay for shipping??? On a defective item?! On an item that was meant to be a birthday present for a child and they opened it, set it up and it did not work? And you also expect me to pay a restocking fee - for a laptop that doesn't work? This seller is engaged in preditory behavior and I demand my money back. I'm happy to return the computer but I will not pay for shipping for a defective computer and I certainly won't be charged a restock fee for a computer that is TRASH and doesn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1664236800000}
{"reviewTitle":"Keyboard might have some keys not work and Acer support is horrible.","reviewDescription":"I decided to buy this laptop to work and play games while I traveled it arrived today when I started it up I noticed that multiple keys were not registering when pressed. Calling Acer support I was told that this is a hardware issue and I would have to send it back to them for them to fix it and it would take 10-12 business days when I leave in 8 I was then told that they wouldn't be able to mail it back to me if I was in another country so I would have to have it delivered to a family members house and then pay for international shipping and that was the best they can do. despite them shipping a defective device they make it seem like them fixing it for free is something I should be thanking them for when it's the bare minimum they can do overall a horrible experience.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1660521600000}
{"reviewTitle":"Dud","reviewDescription":"Amazon recommended this with a monitor it usn't compatible with. I wasted three hours and more dollars following instructions from Acer support. Stay away from this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"crap gaming computer","reviewDescription":"If you want a gaming laptop, this is not the droid you seek.  i have 1 (one) game installed.  it will not run it.  constant errors, failures, crashes.  Ive dedicated an entire day to making this single game run on this pc and it will not do it.  I even had my brother come over who is an AVID pc gamer come over to try and fix it, still the same issues, and he has a bachelors degree in computer science.  It literally does not have the hardware to play even one game.  DO NOT BUY THIS PC.  Do yourself a favor and find something better.  I can not, NOT recommend this purchase enough.  This is absolute garbage.  Don't waste your time, effort, energy or money like i did.  Go get an actual gaming PC.  I don't even trust this enough to write this review.  Hope you see this.  Sincerely, Disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1649635200000}
{"reviewTitle":"Broke for no reason. DO NOT BUY","reviewDescription":"Almost a thousand dollars for a laptop that just breaks for no reason. Had it on one night playing YouTube and when I woke up it just stopped working out of no where and the power button wouldn’t working. I do not recommend this model or BRAND unless you want your laptop to break after just 3 months.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Don't Buy this laptop","reviewDescription":"I've never had to leave a negative review however I had complications with the laptop. The laptop would constantly freeze making it unresponsive therefore the laptop was not useful and I had to send the laptop back. After returning the laptop, with my warranty I was able to receive the laptop back but unfortunately their were still errors with the laptop crashing and freezing. After doing my own personal research I found out that the wrong bios were installed. By then My warranty was up so there was nothing that could be done without paying out of pocket for repairs. Moving forward I will not be shopping with this company!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"The worst possible experience","reviewDescription":"The battery damage at 2 weeks :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Didn't turn on. Delivered in a loose oversized box.","reviewDescription":"Laptop did not turn on or recognize power source when plugged in. Looks like a nice expensive paperweight.  The laptop was received in a large cardboard Box commaxe come up about twice the size of the product Box. Possibly damaged during delivery because there was plenty of space to bounce around. After looking at reviews it seems that this power issue is a common issue for this laptop.Decided to purchase this laptop after my original pick was lost during delivery for almost a week and Amazon wanted me to pay an extra $100 after the price went up. Customer service was not accommodating in the least.  The whole ordeal has been a major frustration and waste of time. Will not be purchasing any big ticket items or electronics from Amazon again.","isVerified":true,"ratingScore":1,"reviewReaction":"55 people found this helpful","country":"United States","date":1637452800000}
{"reviewTitle":"***WARNING - DO NOT BUY- OVERHEAT ISSUE****","reviewDescription":"Laptop will overheat over a 20+ year old game. I was playing World of warcraft one night, and BAM, laptop turned off and died. Never to be revived again. Spend your money elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"days after getting laptop and playing Warcraft, hardware became corrupted and laptop was completely FUBAR. Read mixed reviews, a lot were good but a lot were bad. Not to knock the computer completely I’m sure the ones that aren’t lemons are great, but the odds of you receiving a lemon may be higher with this particular laptop. The bells and whistles of aesthetics are cool but there’s no point in having a cool looking laptop if you’re only going to get a week of use out of it. Spend your money elsewhere","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1695513600000}
