{"reviewTitle":"Looks and sounds great.","reviewDescription":"Has tons of apps preloaded. Everything I use. Clear sharp picture and sound. Not sure what the complaints about the sound and stand are. Went together easily and works great. Yes, a lot options. Use only what you need to. Ignore the rest. Good value!","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"At this price, we couldn't resist. We are well pleased.","reviewDescription":"Who can resist upgrading at this low price? This is a great value on a beautiful smart TV. My wife and I are in our 70's. We had difficulty reading captions on or old 24\" TV. Problem solved! I completed the install with a little help from our caregivers. We purchased a mounting kit with an extension arm for our bedroom. This enables us to fold the TV against the wall when not in use, and easily extend the set for viewing. I plugged in our Amazon Fire Stick with no problems. The numerous streaming services included with this TV will expand our viewing options. We plugged in a new DVD player and our DVD library has been revived with a 40\" picture. We are thoroughly delighted! Although... We have several remote-controlled accent lamps in the bedroom. The remotes for the lamps interfere with the TV remote. Ho hum. We are still exploring lighting solutions. Meanwhile... Pink Floyd rocks in 40\" splendor!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Best size, Best price TV!","reviewDescription":"Didn’t want a ginormous TV, no space for it.  Searched for long time at Best Buy, Costco and Amazon for a 40” TV that would fit on my etagere shelf.  Not all TV measurements are the same, you have to consider height with the stand.  This Vizio 40” with the stand fit perfectly into my shelf space width wise, about 2” to spare in width and height, and 2” was just enough to allow for angle adjustments.  My other existing and prior TV’s are all Vizio and I am quite happy with the Sony brand. I am using a Roku device and everything works great!  Very happy with it so far.  I’ll update my review later if there’s any problem.  I also purchased the extended warranty just in case. In my decision process, other criteria that I factored in is that Amazon would deliver to my doorstep, therefore I would not have to drive anywhere, look for or wait for assistance, or ask for help at home to carry or drag it in from my SUV.  That was a big plus!  I only wish I had bought it sooner.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Vizio D- Series","reviewDescription":"It is perfect . Easy to set up , great picture , awesome features !","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Great quality for the money","reviewDescription":"very easy to install and the picture is great.  I have been able to install streaming channels and antenna channels as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Exceeded My Expectations in Every Way","reviewDescription":"Purchased this TV during the 2023 holiday season on sale. With the cost saving I included the 2 year warranty as I am not someone who enjoys replacing things constantly beyond the original manufacturer’s warranty. We also have a competitor’s tv in OLED and a larger format in our home. I prefaced these detail in my review because I went into purchasing this item as a bedroom tv with the expectation that the image quality and the tv’s operating system would be disappointing compared to our competitors brand OLED television; boy was I wrong. If the image quality of this tv was the only thing I could shared positive reviews about I would be doing an injustice to the really well engineered user experience this television accomplishes. As someone who has worked in the field of IT that supports knowledge and learning end-user experiences, I can say first hand that Vizio did their homework to give this SmartTV its Smarts with intuitive and intelligent software features in the TV and the App that works seamless together. Now about the image quality. It is clear from the initial setup, the demo and ultimately the software update of the tv’s user interface that this tv’s processor, for the cost, does an exceptional job at image reproduction. The 1080p Full Array LED is balanced,  clear without appearing overly saturated and glossy which differs from OLED.  I think for people who prefer a more balanced image reproduction that feels a bit more natural and not as “processed”, this Vizio’s full HD engineering provides an experience that delivers on this description. I have not yet fully tested my Switch experience on this television beyond toggling  a few games back and forth in the Switch UI and playing a few YouTube videos and some Hulu programming. So far, again, I am impressed. Having purchased this tv only based on the holiday sale price and reading a few reviews of other shoppers for this price, this television far exceeded everything I expected in a SmartTV at this price point. If you are shopping for a value driven over achieving SmartTV that isn’t 4K or OLED, this is the one I would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"53 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"It does come with Optical cable, you must cover the dust cover over it of course","reviewDescription":"This is for : VIZIO 40-inch D-Series Full HD 1080p Smart TV with AMD FreeSync, Apple AirPlay and Chromecas...I was concerned on conflicting answers in the reviews and bought an hdmi arc cable just incase. There is an optical port but you need to remove the cover.I tested the arc cable from my Sony S100F 2.0ch Soundbar to the tv and the input was to a new google chromecast. Works fine after getting the soundbar to answer me with some power resets.Everything works. It fits well. The quality of 1080p did not stop my experience watching at all. I'm happy with the purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Wall Mount bolts","reviewDescription":"Normal wall mount boats do not fit in the holes in the back of the TV. I went back to study the specifications for the TV and found a wall bolt package for this TV and they also are too big for the holes in the back of the TV. I'm getting no satisfaction nor proper bolt size for back of the TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Great TV... I love Vizio TV's","reviewDescription":"I broke my TV in my bedroom and it was an okay TV. I have had a Vizio in the living room  for like 13 years now. I think it out lived every  TV I have bought  in that time frame. So , I am not chancing it anymore.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Connects with my phone","reviewDescription":"It’s super easy to use. It comes with a remote but you can also control it with your phone. Has one click access to all the major streaming networks (if you pay for them). I’ve been very happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"excellent product with amazing expansion built in","reviewDescription":"very easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Excellent TV","reviewDescription":"Easy set up. No need to download apps, they are all there. Easy set up for smart phone also. Excellent picture.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Have been using for years","reviewDescription":"Great product; I've been using mine in my bedroom for a few years now. Quality hasn't gone down. Connects seamlessly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"High quality for the price","reviewDescription":"Bright and clear picture. Clear quality sound.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Great little smart TV","reviewDescription":"Great tv for a spare bedroom.  It’s a smart tv with plenty APPS.  Easy to set up.  Great price.  I would definitely recommend it to others.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Finally, a decent review","reviewDescription":"To begin with, this review is for the Vizio D24f-J09.  Amazon reviews can be very helpful...to a point.  Unfortunately, they often include models other than the one you're viewing, so you have to be careful when relying on them.  In this instance, reviews go as far back as 2018, which means they are for TV's other than this one.I tried two other 24\" TV's (LG and Insignia) and the pictures were very mediocre (although some reviewers thought they were fine).  I had a Samsung 24\" before with a beautiful picture, so I had something to compare them to.  The picture on this TV is not as good, but it is pretty good, once adjusted properly (I'll speak to that in a moment).  It is the most recent 24\" TV from Vizio (as of March 2022).  There is one other 24\" model in their recent lineup, the D24f4-j01 which has a bezel-less design.Of interest to almost everyone getting a 24\" TV is the sound.  Out of the box, the sound is OK, but not as loud as many would prefer.  However, there is a way to correct this, which I'll get to shortly.As to reliability, I've had this since November 2021, so it's too soon to tell.  So far, so good, although Vizio has a bad track record in that regard.It comes with lots of apps built in, probably all that most people would want.  I don't see a way to add more.  I can't tell you how well they work on the TV itself, as I use Amazon's Fire TV stick.  With that, you can add tons of apps.  That works very well.There are two HDMI inputs on the back.  It should be noted that this is not the traditional ultra-thin TV.  It is 2 1\/4\" thick, which allow for better (not great) speakers.OK, the settings you will need to get the best picture.  This is the results of weeks of fine-tuning that seemed the best to me.  You may need to make minor adjustments for your eye, but I suggest you try these for a few days before making any changes to allow yourself to get used to them.Go to settings (the black and white \"sun\" button below the Pluto button on the upper left)\/picture. These settings are in the order that they appear.Backlight 100%Brightness 48%Contrast 50color 65Tint 0Sharpness 30Color Temperature  NORMALNow, for the sound.  Go to Setting\/Audio.Surround  ONVolume Leveling  ON (This will noticeably increase the volume)Dialog enhancer  HIGHThere you go.  This seems to be one of the very best choices available for the ever shrinking 24\" TV offering.","isVerified":true,"ratingScore":5,"reviewReaction":"173 people found this helpful","country":"United States","date":1647993600000}
{"reviewTitle":"New TV","reviewDescription":"Easy set up and programming.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Great WiFi television","reviewDescription":"The tv is easy to setup and gets lots of free viewing channels. Log in to those you subscribe to and easy to pass shows from the iPhone to the TV. I lost the internet signal after a few days and needed to enable DHCP settings, not an issue since. Wife loves the small tv in the bedroom.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Love it !","reviewDescription":"AirPlay is the most important part of this TV for me !But I can’t express how excellent the whole experience is to know it’s a smart TV . Plus the price is very reasonable !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Very nice!","reviewDescription":"Great picture quality and it walks you through setting it up. My Mother loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Es una buena marca ya que es la secuencia de la sony","reviewDescription":"Is good company in electric","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Big screen","reviewDescription":"Love da quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Good Resolution!!!","reviewDescription":"Really good 💯!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"I love this SMART tv","reviewDescription":"Great picture and easy set up for a great price. Just go ahead and buy it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"ZIVIO tv and DVD player","reviewDescription":"Fabulous size -40 inch. Fits well on my wall. Easy to use remote that has controls for the TV and the DVD player. Great sound.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Awesome tv","reviewDescription":"Lightweight for a 40” flatscreen. Love the size & clarity👍 awesome fast delivery!!!👍💃","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"works perfectly","reviewDescription":"works perfectly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Love the tv","reviewDescription":"Loved it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Great TV","reviewDescription":"Great TV, Service was excellent with Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Excellent Product","reviewDescription":"NA","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"LOVE THIS\/ IN LOVE","reviewDescription":"In Love with my new TV OMG! the features and the color Amazing , I am able to connect with all devices, the only thing is it does not have as many port as the smaller 32in , but over all love it for the price Beautiful.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Happy!!","reviewDescription":"Thought 40inc for a bedroom would be big. Boy was i wrong.. haha.  But its nice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Challenging","reviewDescription":"I purchased this TV for my Husband for Christmas. I asked our Son in law to look for me and this is the TV he choose. He considered cost, reviews, weight, picture, etc.He did a great job, My Husband loves it! He has wanted a TV on our patio ever since we built it 2 years ago.Getting it programmed was difficult. My Husband tried, then he spent 2 hours on the phone with support, very nice Lady, they couldn’t do it. So we had our cable guy come (direct TV) It cost $100.00 for the wireless box and set up. We are good to go!I also bought a cover, which is excellent !","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Great for the price!","reviewDescription":"I bought this as a housewarming gift to a friend and it's been a gift so far! I've owned a few Vizio TVs in the past and while they aren't top tier, they are fantastic for the price you pay for them.  Excellent for kids and teenagers or as a fair well gift for college students.  Perfect size for small rooms and fits neatly on a dresser.  The built in Chromecast has been a nice bonus as well!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Decent TV.  So far, so good.  Has VESA mounts.","reviewDescription":"This review is for the 32\" version of this TV.  I really came here to share a picture of the back of the TV because the images that were available on here before I bit the bullet and bought it really didn't show any VESA mounting holes that I could see.There are in fact VESA mounting holes.  The picture is great for the price.  Definitely go with this one if you're debating between this and the much less expensive 720p version of this TV that you might come across in your research.It works great as a medium sized monitor to wall mount in an office for a security camera system.  Pretty happy overall and glad I decided to give it a shot.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"If it works leave it alone","reviewDescription":"Tv is in 3 now 4 season porch. Perfect for the size of the room. And it puts my dog ( Bruno) to sleep every time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Regalo de mi madre","reviewDescription":"Compré esto como un regalo y llegó a Puerto Rico antes de lo esperado y la calidad y precio son muy buenos","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Great picture","reviewDescription":"This is the perfect size tv for my office. Great sound and picture.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Perfect","reviewDescription":"I need a small TV for my bedroom. This was perfect. Added bonus, it’s a smart TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"It worked","reviewDescription":"It worked for my 5 yr old grandson son","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Good TV for a small space","reviewDescription":"I wanted a TV for a small bedroom for guests. The picture on this is good as well as sound level. Internet access is good and free channels are not bad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Love the quality","reviewDescription":"This is the tv I bought for my bedroom.  The picture is clear and bright, the sound is amazing, and it’s large enough for me to read the tv guide. I couldn’t be happier.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"So glad I bought this","reviewDescription":"The feet went on easily and straight (I've had others that didn't).  It was a breeze to set up all of my streaming services.  It has a great picture and the sound is good.  The last tv I had, I had to turn the sound up to 60 to actually hear it. Everyone works like a dream.  Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Good Buy","reviewDescription":"Nice ,clear, bright picture. Can’t go wrong for the price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Amazing quality!!","reviewDescription":"This 40” TV was honestly the best purchase i have made in awhile, it was so clear and SO easy to set up. The sound quality is also SO SO SO good and i am so happy i made this purchase. You are able to mount the TV, but i didnt because i didnt have enough wall space. 10\/10 RECOMMEND!! Delivery wasn’t SUPER fast, but it was about less than a week. You do need an OTP number to receive the product, but it wasn’t very difficult to get. I LOVE IT!!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Great deal","reviewDescription":"Love the tv picture and sound.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Smart tv. Vicio de 40 pulgadas","reviewDescription":"SE VE SUPER SE LO MANDE DE REGALO A PUERTO RICO A MI HERMANA Y LE ENCANTO","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Good tv","reviewDescription":"Right size for the kitchen","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Great bang for the buck","reviewDescription":"Wow this tv is nice. I had an old 20” tv in my son’s room that was a hand me down from one of his older siblings, and the fire tv stick was soooooooo slow on it, instead of spending $50 for a new fire tv stick I was able to buy this tv which has firetv built in for not too much more. The picture quality is really good, and the sound is nice too, is this a high end tv to be the center of your media room, definitely not, but for a bedroom or someone who’s on a budget go for it,","isVerified":true,"ratingScore":5,"reviewReaction":"24 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Good picture","reviewDescription":"Needed a little TV for the dash of my motorhome, don't know how long it will take the bounce from the road. Roads really suck, especially in California, I can close my eyes and know when I cross the border from Oregon into California just by the rough roads,  of course when I am not doing the driving. So time and miles will tell","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"A great, compact 1080p flatscreen at a great price with a few issues.","reviewDescription":"We purchased this a couple of months ago (with our own money, no communication with or compensation from the company) as our old 43\" 720p flatscreen was starting to give out and have problems with the picture.  We wanted to downsize a bit given the space in our living room, and didn't want to spend a lot of money for a TV with a ton of features that we weren't going to use.  We did our research and settled on this 32\" Vizio as it had integrated Chromecasting (which we use every day) and a sharper picture than our old set without taking up a lot of room.After using it for a while now, we've got a pretty good idea of the ins and outs of this TV and how it works for our viewing habits.  Some pros and cons:PROS:Sharp screen\/picture quality - granted, it's not 4K\/8K\/etc., but it's quite a step up from the 720p screen we were used to.  Even though it's much smaller size-wise, shows and movies are noticeably better.  It does take some adjusting through the settings to find your ideal viewing settings; there are a few different settings for different use cases like gaming, and turning off the motion setting improved things for us as well, but make sure you play around with them to find what looks best to your eyes.Size and weight - it's featherweight compared to our old TV, very easy to mount and adjust and get where you want it without a lot of strain or stress.Inputs - you've got two HDMIs (one with ARC for using a soundbar), a USB port for powering something like a Roku, an antenna input and some various audio ins\/outs.  Unless you're looking for a plethora of input\/outputs, this will do the job for the average person out there.  Especially given the price, it would make a great secondary TV for a kids' playroom or similar location where you want to have one available but don't want to sink a lot of money into extraneous features.Built-in Chromecasting - this is a great included feature, and frees up one of the HDMI inputs that we were using on our old set for a 2nd Gen Chromecast.  We ran into a problem with this initially that I'll talk about below, but it seems to have smoothed itself out somehow.The Vizio TV app - we have Android phones and I really like the Vizio app for controlling the TV (switching inputs, scrolling through Netflix\/Hulu, etc.).  We have a cable box that can also scroll through inputs but not other settings, but for cord cutters or people who don't want to bother with a few different remotes the app connects quickly and reliably to allow you to control things.WatchFree - I just started scrolling through the included free movies and shows last night, and there's a good selection to watch.  Granted, if you're using other streaming services then you might either run into duplicates or option overload, but it's nice that Vizio gives you some extra choices for viewing when you purchase their TVs with this feature.Streaming apps - we use our phones and Chromecasting to watch Netflix\/Hulu\/etc., but you have a bunch of apps that you can load onto the TV itself and use in place of your phone if you so choose.  Better to have more options in this respect than fewer, I figure.CONS:The speakers - they're not great, our old TV was more powerful but we've gotten used to them at this point.  We thought about getting a cheap soundbar but decided against it.  Just know that for the price, you're not getting an audio powerhouse.  You can link a soundbar up multiple ways (look at the user manual online for instructions) if you require sharper sound.  It can get plenty loud, it's just that the quality overall isn't fantastic.  We don't watch a lot of stuff where we'd need super-high-def sound, so it works fine for us.  They're down-firing rather than forward-firing, which may have something to do with it.Chromecasting - I haven't had any problems at all, but my wife's phone wouldn't connect reliably for a while.  We plugged in our old Chromecast for her to connect to, and now she hasn't had any problems with either the built-in or external Chromecast.  I'm not sure what did the trick, but I'm not going to question a miracle.  She found online that other have had problems with reliable built-in Chromecasting, but given our experience YMMV.  I made sure that the TV connected to our WiFi with a static address to isolate that variable, but the only thing that seemed to work was the solution above.The picture settings - there are a few different default settings for things like gaming, motion enhancement, etc.  It can be a bit to go through in order to find your perfect setting(s), but if it's not looking great at first just try playing around with those settings.  I thought I was going to have to return it because the picture was a little dark around the edges and the motion enhancement was driving me nuts, but luckily I decided to play around with things and voila - I haven't messed around with the picture settings since the first week we got it.  It'd just be nice to have it start with a more common 'default' setting rather than one that's supposed to give you a great picture but in reality is just full of supposed enhancements in color, motion, contrast, etc.All in all, I think it's a great TV for the price.  It's got enough extras to cover the bases for most people and use cases if you're looking for a TV at this size and price range, without a bunch of stuff you'll never use.  It sets up quickly in terms of getting it out of the box, upright, and plugged in in order to use without having to go through a phonebook-sized manual (anyone remember phonebooks?) to figure it out.  The phone app is also very helpful and easy to set up, and I'd recommend this TV to others looking for the same thing we were.","isVerified":true,"ratingScore":4,"reviewReaction":"67 people found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Amazing Image Quality but Vizio OS Sometimes Slow","reviewDescription":"As someone who loves cozying up with a good show after a long day, I must find the perfect TV for my room. And let me tell you, my journey led me straight to the VIZIO 40-inch D-Series Full HD 1080p Smart TV. Let's talk about the star of the show first: the image quality. Simply put, it's jaw-dropping. From the vibrant colors to the crisp clarity, every scene comes to life in a way that makes you forget you're sitting in your living room. Whether watching an action-packed movie or indulging in a nature documentary, the visuals never amaze me.While the Smart TV functionality is a fantastic addition, I've encountered some sluggishness with the VIZIO OS. There are moments when navigating through menus feels like trudging through mud – slow and frustrating. It's not a deal-breaker, but it does detract from the overall experience, especially when you're eager to jump into your favorite streaming app.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"Kept showing \"channel not available\"","reviewDescription":"I did love the tv; HOWEVER, during the rain storm we had in Phoenix, it showed \"channel not available\". I thought it was due to rain weather, until it cleared up and still showing no channel, when my other 4 tv's were showing it was available. I rescanned the channels twice (using \"find channels\" and \"find more channels\"), to no avail. So I started over with the system (after trying \"restart\" and unplug\/plug back in\"). Tried the channel again, still \"not available\". So I rescanned the channels twice, and it finally showed the channel 7.2 I was looking for. It took me an hour to get it to work. Very annoying!! It's a brand new tv, two weeks old. I WAS happy with it.....now I'm not sure. Now I find myself going back to that channel all the time, making sure it still works. If it does it again, (return time limit permitting), I'll have to exchange it for another tv. So I just wanted to let people know, in case they encounter the same problem. Very weird!UPDATE: 4\/4\/2024: After I posted this review, I lost the 7.2 and all channels in the \"7\" range on all of my tv's. I contacted the broadcaster, who informed me they are having technical problems with the affiliates in Phoenix. So apparently this had nothing to do with my TV! I can't explain why my other TV's were showing the channel(s) and not my newest Vizio earlier. But right now, none of the TV's are receiving the \"7\" channels. Thank You.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Good Quality TV","reviewDescription":"I've purchased several Vizio TVs over the years and I've never experienced any problems with any of them. They are good quality TVs. The picture, sound, and the different settings options are great. The Vizio 40\" D-Series is also a good purchase for anyone wanting a quality TV at an affordable price. One thing to be aware of is that it doesn't have an ethernet port. If you're looking to plug an ethernet cable directly into your TV then this is not the TV to buy. I thought that it had an ethernet port and only realized it didn't when I went to plug in the cable. Never assume, always read the specifications before you purchase. This in no way takes away from the quality of the TV. Vizio is a good brand that lasts.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"This is a gift for my Mom!","reviewDescription":"Unfortunately, she was spending a ridiculous amount of money for cable TV.She barely watches TV and my brother and myself, we just stream.Obviously, I need to teach her how to use everything. She in an intelligent person. I know that she can do this easily.I am not going to review separate items.I also have a new Firestick and the simple power adapter.I have used all of these devices.Now, if it was for me, I buy SONY!There hasn't been a decent American TV since the 1960's.The last one was the Curtis Mathis. That was not a great TV 😕.I have seen the Visio before and it has a good quality picture. Actually, Walmart is in the process of buying Visio for themselves.Seriously, if you have a smart TV, get a Firestick!! The picture is great 👍. I just don't like 3D and the movie theaters are very loud.I have to bring earplugs.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Good For The Price","reviewDescription":"The TV was easy to set up.  I wish it had a center stand rather than the two flimsy legs.  I had to move cabinets around to have one in the right place for the TVs wide leg stance and height.  The maximum sound is very hard to hear from the ensuite bathroom and my sound bars connecting cord didn't have a way to plug it into the TV with the small optical plug cord I used with the old TV.  There may be another option I don't know about like the three holes (yellow, red, white)  My other TVs have a better vibrance and color but this is fine for the bedroom.  Sound is fine for the bedroom area.  It was easy to set up and connect to my wifi and load the apps.  Very inexpensive when I bought.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Delivery of Product","reviewDescription":"Great Product for the money highly recommend. Decent picture for a spare TVTV is slow on remote interaction, number 1 complaint is advertisement pop up every time you turn on TV.Amazon Prime not so great, you have a 50% percent chance they will meet expectations or the benefits they state for $129.00 a year subscription.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"For the price it’s pretty decent.","reviewDescription":"Needed a TV for our guest bedroom with apps. This was in expensive enough for sure. It’s very light and the picture isn’t bad either. The native apps are sometimes slow, and the tv will act as though it’s updating internal software. But I suspect it could be the processing power. Anyway, that’s speculative. If you want a tv with all the apps, a decent list up of free content, and it’s not a daily user. This set is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Perfect for the kids","reviewDescription":"TV is good for the kids. They play the games on there and very nice. I like the fact that it’s a smart TV only thing I did not like was the stand that came with the TV too wide.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Problem solved","reviewDescription":"I never got this tv to connect. I wrote negative review. I ordered another tv and had same problem. I found out would not connect because of password. I was using password on my router that never worked with tv. After logging in on my Spectrum account I found out it still using password from an older router I replaced. Funny how cell phones connect to new router password but TVs won't.Anyway lot of bad reviews here on connecton problems. I tried everthing with no luck but the password did it. This TV is better than the new one I got.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Good quality!!","reviewDescription":"It has a great picture, and the quality of the TV is super.  I love the Vizio TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"great tv","reviewDescription":"don't need cable with this set. just wi fi.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Nice","reviewDescription":"Good picture, nice price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Very Clear Picture!","reviewDescription":"My daughter requested this TV for Christmas and she loves it! She is a gamer and she said that the picture is super crisp and clear!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Cant go wrong with a vizio","reviewDescription":"The funny thing is i meant to order a 32\" and they sent me a 24\"...i was pissed at the size but the tv is everything i need and now i can work and watch tv or work and play the game and i cam mount it easily now so it all worked out im my favor. Idc about the size, u cant go wrong with a vizio","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Amazing for the price.","reviewDescription":"Just the right size to fit on a bookshelf in the den, I like the way the legs are designed it can fit on  a not very deep bookshelf, with no problem. I am in no way techie, but set up was a breeze connected to my Wi-Fi. No problems. I think the color is great, but then I’m only setting 5 feet from it. If there is one drawback the sound could be better, but if I want to listen to something, I’ve got two other TVs I can watch. You won’t be disappointed.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"great!","reviewDescription":"super easy to setup and use!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Bueno","reviewDescription":"Muy bueno !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Excellent picture and a great little TV Packed With Features","reviewDescription":"Just as advertised","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Great for RV","reviewDescription":"Very nice TV, perfect size for RV. Good picture and enough apps that you will not need satalite or cable, just need WIFI.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Worst TV I have ever purchased","reviewDescription":"I have had this TV for less than a year and I HATE IT!  Every time someone wants to watch this TV, they have to start fooling around with it 20 minutes before the show they want to watch.  Every time we turn it on we get the death spiral for a few minutes before we get the notice that it can’t connect to the internet.  Then we have to try to uninstall the WiFi and reinstall it.  Sometimes it works, sometimes it doesn’t.  If we are lucky enough that it does work after that, you can bet that at least 4 times between 8 and 11 pm, we will lose the signal and have to restart the TV and go through the install process again.I thought it might be my router, so I bought a new, more powerful router but that hasn’t helped at all.  The internet provider was out and couldn’t find any problem with their equipment either.If we do get this thing to work, it is difficult to navigate a streaming movie.  There are no fast forward or fast rewind buttons.  Instead you have to click on the circle around the ok button to go forward or back, but it is difficult (with my big thumbs) to do that without going to a menu below and eliminating all the rewinding already done.We have a small TV in the kitchen and an older TV in the master bedroom and we never have any issue with either of those.  They turn on immediately and have access to the internet.  No uninstalling and reinstalling every time.I will never waste my money on another Vizio product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Connectivity issues","reviewDescription":"Over the years we have owned several Vizio smart TVs. Our experience has been that the larger, more expensive sets function beautifully. Although they do require a soundbar, they have a bright screen and function quite well for our needs.However, we have found that the smaller ones such as this are quite temperamental. Each one eventually has one problem after another and away they go to be recycled.I have this exact TV in my den. It's been fine, but glitches quite often. It's an ongoing joke in our house. The other set we had of this size died within a year.Forever an optimist, I decided to give Vizio one last shot with this set. Maybe we'd get lucky?Unfortunately, we have found ourselves in the same boat as prior.I purchased this TV for our workout room to exclusively play exercise DVD's. Plugged in the DVD player and the screen came right up, they play perfectly. We installed a soundbar and this also functions properly.The issue is connectivity. We are a large household with a myriad of devices, a strong internet connection and several boosters throughout the house. My password for my router works for all of our devices.Not so with this TV. After several attempts we finally gave up and have relegated this set to purely workout DVD's. Thats fine for our needs, but the set should connect regardless.At this point it's far past time for our family to move on to another brand.  We gave it our best shot.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Not suitable for watching over the air (OTA) TV","reviewDescription":"Pro: full HD (1080p) screen resolution.Cons: everything else! Especially OTA TV support and [the total lack of] Visio technical support.We bought this TV to use in the small bedroom on our RV where anything larger would be too big. We wanted a Smart TV for occasional streaming, but most importantly, we require solid support for OTA channels so we can watch local weather and other travel critical information.Well, while this TV technically supports an OTA antenna, Visio seems to have gone to great lengths to make sure it isn't suitable for OTA channel watching.The setup process was unnecessarily convoluted, and after finally getting thru it, the TV did an update that made OTA surfing, to say the least, difficult and frustrating.Normally, when using the up\/down channel buttons, an OTA TV will show you what channel you are on. Nope, not on this set. That requires the annoying need to constantly reference the guide (loaded with disruptive advertising) to figure out where you are and find where you want to go.Visio has this \"Watchfree\" operating system that definitely does not favor OTA watching. If you don't care about OTA this may not be a problem for you, but overall I was completely underwhelmed and downright annoyed compared to other more mainstream TV operating systems.Another major flaw IMO, is this set only supports 2.4ghz Wi-Fi. Really?To top it off, a request to Visio service via Amazon went totally ignored. I for one will never consider purchasing another Visio product based on that fact alone.We ended up instead buying a Westinghouse 24\" Roku TV set that is incredibly more user friendly and very nicely supports OTA. When surfing OTA channels, you get not only the channel numbers displayed, but signal strength, resolution, the time, and even basic programming info. And it supports BOTH 2.4ghz and 5ghz Wi-Fi. The Westinghouse Roku set also acts as a DVR (pause live TV) if you plug in a USB stick. Even better, the Westinghouse Roku set was 30% less expensive than the Visio! A much better choice IMO.On the downside, the Westinghouse Roku set was only 720p, but on this small size screen the picture clarity difference is not really noticeable to ordinary humans.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Cheap TV that's fine when it works.","reviewDescription":"Knew going into the purchase that at under $200 this was not going to be an amazing TV. Initial thought when I mounted it was that it felt cheap and plastic-ee - but also, who handles your TV, so not a big deal since it looks like a very regular TV with a normal if not slightly thick frame. But I just intended to use it in my office, so again, didn't need anything flashy. The biggest problem is the software and the connectivity.We get our content through wifi on apps like Hulu, Netflix, etc. To navigate to an app, you have to sit through and click through several options where Vizio tries to sell you stuff or get you to use their apps. I haven't had this issue on any of my other branded TVs - mostly Samsung. So it's annoying to turn the TV on and have to navigate for a comparatively lengthy amount of time just to get to the app that has the content you want to search through. The software is also slow but recently updated and is slightly faster. The second biggest issue is that almost 30% of the time, it doesn't want to connect to your wifi. Sometimes it can't find your network. Sometimes it just doesn't like your password. Sometimes it doesn't want to respond to inputs on the remote. If this were my main TV, I'd be unbelievably angry and I should probably rate this TV 1 star. But because it's an office TV, and don't rely on it, I'm not weighting the connectivity issues as severely.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Wifi reception is abysmal, had to add a Roku to access streaming","reviewDescription":"This is my 2nd Vizio 32\" tv in service.  My first one had difficulty with Wi-Fi reception, it was just poor.  I thought due to distance and walls between the access point and the tv.  My second one has just as poor, if not worse, Wi-Fi reception that is so poor you cannot stream Netflix, Prime, PBS, etc..  I just purchased another Roku stick for this latest Vizio and Roku reception is \"excellent\" per the device.  So, if you purchase this TV, just know you'll either need a hardwire ethernet or you just bought a \"screen\" to which you'll add additional peripherals.  I own three Vizio TV's, in general they get the job done however the lesser cost of the tv has been offset by the cost of the peripherals - just know that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Dumb smart TV","reviewDescription":"This has to the the dumbest smart TV I have had.  The picture is nice but the Smart portion of the tv is horrible.  First off, the Vizio, is more concerned about getting your information than giving you a good experience.  At least with Roku Tv's they do that in the background and give you what you want not what they think you need.  The TV constantly disconnects from thew Wifi and you have to manage into the settings to get the wifi working again.  For the price and size of the tv I would expect it to have bluetooth headphone capability, it does not.  If you are going to use this as a smart TV then I would look elswhere","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"WiFi connection issues","reviewDescription":"First for those with the same issue (the TV claims your password is incorrect),first go to all settings. Then to network,then to manual setup. Go into the DHCP (Dynamic Host Configuration Protocol) and turn it off and then on again. Make certain you are actually in the list that shows on off.  Turn the TV off. Then back on. Go to the list of available wifi sources and click on yours.It worked perfectly when I first set it up. But then it was updated. It was still working. I turned it off, and the next day the password is incorrect issue started. By research and experience I tracked down the problem. But it appears to be only a short term fix. The next day I had to do the same process again.  I went to the Vizio web site, but their chat system errored out on my firefox (latest build) browser.  This does not bode well. Lacking the connection issue I'd be quite happy with it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"after just a month am having problems going to Amazon prime and Netflix","reviewDescription":"I purchased this when i went to Arizona to stay for the winter and getting Internet from cox.  I didnt have a smart tv but had the Firestick from Amazon.  Since I also had a subscription to NetFlix i thought it would be  a good purchase.  I have had it less than the one month return allowed and now it is acting up.  i press Amazon prime and it come up as YouTube, I cant get the Amazon prime link no matter what i press.i like watching a series at a time over several nights.  after watching a season and 1\/2 of the Jack Ryan series and not i cannot finish watching it,  i havent called it yet to Vizio to see if i can fix it, but really feel like i should not have to.  i have Vizio tvs at my home and havent had a problem","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Good picture but sound is poor, no Bluetooth for headphones or external speaker","reviewDescription":"While this TV has a wonderful 1080p picture, the sound is far from good and poor, in fact.  It comes from the bottom of the TV and is very tinny sounding and seeming has LOTS of treble on it.  I have adjusted all sound adjustments with very little change:  going no treble, full bass and everything in between.  Since the speakers are under the TV itself, it does not project into the room at all.  I am not satisfied with this in the least.The poor sound is the same on all channels, movies and free TV.  As I like the picture and all other features, I will keep it and most likely add a sound bar.In addition to poor sound, there is no Bluetooth for headphones or external speaker.  Even my 10 year old Samsung has Bluetooth.  Yes you can add it, but that engenders other problems with connection and having to manually turn it on when you want to use it.  My old Samsung is totally automatic and connects when the headphones are activated.  Vizio should take note of this.  Bluetooth is not that expensive to have come with the TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Useless user interface","reviewDescription":"The picture is decent enough and on occasion, the WiFi connection is a bit wonky (and it is not the fault of my internet).The remote weight is backward, awkward, an un-intuitive. The bulk of the weight should be at the bottom of the remote and not at the top. This allows for a more intuitive approach when picking up the remote in the dark where you expect the bottom weight of the remote to rest in your hand. Instead, the weighted top of the remote falls off your fingers (who's the brilliant architect who designed this?). Backlighting would help a lot.I will never purchase another Vizio simply because I cannot re-arrange the user interface. In its current form it is loud, abrasive, in-your-face advertisements. I wanted an interface more like Roku that shows my apps in big tiles with easy access. In Vizio, my apps appear as tiny little tiles to which I have to scroll.Using the apps feature allows me to remove unwanted apps, but I can do nothing about the tile size or placement, and I cannot rearrange or remove any other sections like Trending and Recommendations (which never align with my tastes)","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Ok TV - Malf Stand","reviewDescription":"The screws to support the TV stand don't even fit. Good luck if you want the stand, you better have some glue or a power drill to drill your own holes. I will be doing one of those two options because I want the stand to function properly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Freezing picture","reviewDescription":"This is my first smart TV. Not sure I appreciate the Vizeo-specific programming... but I really don't appreciate the picture freezing up at random.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Good picture","reviewDescription":"Works well in my office to check the news now and then. Picture quality is good. Easy to set up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"Very pleasing TV at a great price","reviewDescription":"We bought this TV to replace one that expired after 4 years of ownership. We were delighted with the low cost.The only reason we did not give it 5 stars is that the pair of feet do not sit well on the table where we have the TV. There are two sets of legs on either end of the TV, and we cannot turn the set adequately to get an straight-on front view. Maybe the manufacturer would consider a fix for this.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"No Internet Explorer app","reviewDescription":"Can't search internet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Buy an additional tv stand","reviewDescription":"The leg stands are not good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Good tv","reviewDescription":"First one didn't work. They replaced quickly. Second one works. Not the best TV I've owned, but pretty good and a great value for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Nice","reviewDescription":"Pretty decent TV","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Good Value","reviewDescription":"This TV is a good value, especially for a smaller space. Ours did come with a very small amount of discoloration in the upper corner, but it’s only noticeable when it’s off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Funciona bien","reviewDescription":"Esta bien para el precio","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Hate the remote and that Vizio 'controls' far too much! Want my Alexa Remote!","reviewDescription":"The darn Vizio app talks - during setup that was fine and actually helpful.  But, with the tv it tells you everything! NOISY!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Quality","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Good TV for price","reviewDescription":"The price and the value for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Very nice tv","reviewDescription":"It’s a small but nice tv.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Updates take forever","reviewDescription":"I’m sure the tv will be fine but heads up the install process will take 30+ minutes on mediocre wifi I guess. So plug it in, put in some setup info and go cook dinner or clean your den or call a friend.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"The remote is confusing","reviewDescription":"Too many buttons on the remote control","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"OKAY SERIVCE","reviewDescription":"Image quality during prime viewing hours is poor","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Nice","reviewDescription":"Nice picture nice size","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"ok","reviewDescription":"working with optimum, you need to do many Manvers","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Almost there. These new smart tvs do not respect film modes.","reviewDescription":"Design is excellent and function works. Quality wise I was expecting more from Vizio especially after owning another Vizio TV for 10 plus years. The film mode frame blends and does not look clear in terms of the gamma. The colors are hard to dial in.If you’re into sports or games this works out perfect. But it lacked just this portion. Hope Vizio upgrades this.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"NO BLUETOOTH","reviewDescription":"No BLUETOOTH - WOW!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Great tv","reviewDescription":"Perfect fit for my rv kitchen tv replacement... not very loud so u need a sound bar. I typed in tv with built in DVD player and bought this one but that was Amazon's mess up and I didn't read it but all in all I replaced a 12 inch tv with a 24 inch and it's great for me","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Broken new in box, but Amazon made it right","reviewDescription":"After talking with a service representative they did exchange the TV free of charge. I do appreciative that. I already have bought 2 before this and they are good tv's. Thanks for making it right amazon!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"I needed a smallish smart tv","reviewDescription":"My homestead is powered by solar panels and batteries. I need to be somewhat frugal with my power use when the sun goes down, so the power drain was a huge factor in my selection of this pc. Roughly 56 watts for the Vizio, compared to the 15 year old Sharp Aquos that consumed upwards of 190 watts.EDIT:  The processor seems fairly slow, the screen is slow to post all the channels, and the remote can be clicked faster than the screen can keep up.  I have had to restart the tv in order to get the remote to work correctly.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"Heads up you’re getting what you paid for","reviewDescription":"I had read the reviews and seen a lot of positive ones and a few negative.  I still went ahead and purchased the 40in. I like the screen size and brightness, clarity all the good stuff. Speakers are a little low but not a deal breaker.Only thing for me worth noting were the screws for the feet. They’re too large. They get down 3\/4 and don’t move from there. Feet still not fastened. I put my own smaller(width) and shorter screws and feet and nice and secured. Nothing major for me. But could be for someone else.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"The menu portion takes a little to get used to","reviewDescription":"The menu portion takes a little bit getting used to.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Easy setup","reviewDescription":"The tv part of setup was unbelievably easy.  Only took about 15 minutes.  However - getting the feet attached so that they wouldn't wobble took about 30 minutes!  That part should have been a cinch but the screws were very stubborn about going in straight.  I've done a lot of building in my life so it's not like I don't know how to use a screwdriver. :-)","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Value for money!","reviewDescription":"Pros: the price and the fact it is 1080 when most TVs in this range are 720p is a plusVesa Mount compatible, so you can get a small Vesa stand and watch TV in the bedroom if you are running out of space. You can buy a stand like thisUniversal Swivel Tablehttps:\/\/www.amazon.com\/gp\/aw\/d\/B073F8D8ZZ?psc=1&ref=ppx_pop_mob_b_asin_titleCons: Not compatible with 5ghz newer modem WiFi standards it does connect to 2.4ghz band but make sure the modem supports the standard.Everything depends on an online update so this TV does require an active WiFi Internet connection to truly enjoy the TV.","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Does the job with one issue.","reviewDescription":"A good mid-range TV.  Picture quality is good enough for the price. (wasn't expecting OLED quality at this price). Set up is easy and wifi connects right away. The one thing that irks me is the USB port is inoperable and is not identified in the settings.  HDMI ports work fine.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Great TV for the price","reviewDescription":"Overall I like the features of the TV and it's clarity. My only issues with it is every once in awhile when I turn it on an ad type thing for Vizio pops up and it takes a little longer to start up then I'd like","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"35in, not 40","reviewDescription":"Great tv and great price but it’s advertised and yes, I made sure I bought the one that says 40 ins but it is actually 35.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"I like it but loads slow","reviewDescription":"I like the tv, does great when Im playing my PS4. This tv loads streaming stuff slow","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Great picture","reviewDescription":"Like everything  about this TV  except  the sound is a bit underpowered.  Often  have watch the TV at 60 + .","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Price was great. Tv has beautiful picture. And the Vizio customer service was terrific.","reviewDescription":"The  Vizio I had died after many years and this was its replacement. Delivery was fast, and so easy to set up.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Very nice picture","reviewDescription":"It looks nice.hooked up to my internet and other devices nicely.only complaint is the speakers don’t sound that great,but ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"present","reviewDescription":"this was a birthday present  for my wife  easy set up","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Vizio tv","reviewDescription":"It was a good tv for the amount I paid for it. Definitely on the Lower end of tvs though. Would recommend for a bed room. Only thing I don’t like about it is that volume quality","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Decent compact TV","reviewDescription":"Bought this to replace an earlier model Vizio whose audio had become unreliable. This TV is wall mounted and size was the number one criterion for the replacement. It fits the standard VESA mounting bracket. This TV is connected to our cable box (HDMI connection), so we don't use a lot of its built-in network capabilities (not its own remote).It did fix our issue with sound cutting out, but it has all the audio quality of a tin can on a string. Use of an inexpensive sound bar is highly recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1677369600000}
{"reviewTitle":"Good enough","reviewDescription":"Overall was a good deal. No control buttons on main TV mean if your remote is out of batteries (or I suppose lost) you won't be able to use.  It can also be a little slow to turn on and respond at times, updating software or whatever.  Had read about this in other reviews and maybe has a slower processor?  Still overall pleased given price point.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1681603200000}
{"reviewTitle":"Vizio smart TV","reviewDescription":"I got this TV for my bedroom. Fits nice on top of my dresser. It’s like the fire stick without the stick. Apps are on it when I got and you can download ones you want. However the remote is not very good. Some apps I haven’t been able to sign into because of it.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Great value","reviewDescription":"I like the apps and free Vito tv. I did think it offered Roku but it does not which limits the streaming apps you can have. For one if you have Gaia you can’t watch it on this :(. Said chrome installed but no internet web access. Speakers are decent and better than Walmart brand. Still good and no need for speakers. I love it and perfect as a second monitor and bedroom\/kitchen TV. I couldn’t air play my surface pro but that could be my tech skills with TV. All in all great bang for your buck","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Tv","reviewDescription":"Great picture on it and easy step by step instructions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Great 40 inch.. everything connected well","reviewDescription":"Great TV .. only question is how do you use the mic? Maybe mine doesn't work... But I'm keeping it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Replaced a 10 year old Samsung  Nice TV but not much nicer than old one","reviewDescription":"I would say the 10 year old Samsung actually may have a better color saturation even though it was only 720p.  This is 1080i but no matter what color pallet I use has more of a washed out look (I have found that the viewing height is pretty important on this TV though which is a bummer since we use in our kitchen so when I stand I'm looking down a little at it (washed out)  If I sit and am more straight across picture is better.Otherwise it is thicker than our old TV but more energy efficient.  Sound is good.  I would recommend this for the price (honestly not many options in the 24\" space but I would temper your expectation as good not great.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Great TV for the money.","reviewDescription":"This is a great TV for the money. Easy to hook up and easy to operate. Bought for a guest room.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Vizio...great brand","reviewDescription":"Purchased for bedroom. I have an older, larger Vizio in my living room that I've been so happy with that when I decided I wanted a bedroom TV Vizio was my go to. I saw some reviews as to lag time & this model being slow. The only things that took forever were to updates upon setup. Haven't had long so I can't give 5 stars just yet but setup was super easy. Basically plug in & let update. Picture & sound quality seem good to me...I saw complaints about that too. It fits the small space where I wanted it perfectly too. Overall I recommend Vizio TVs because I think they're great quality.  I don't game so I can't speak to that aspect.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"connectivity","reviewDescription":"I sleep with the tv on and it seems to lose connection to my internet every night.  Sometimes I turn it on and have to reset my modem because it won't connect.  I have another (larger) Vizio in my living room and I don't have this issue so I'm pretty sure it's not the modem!  I'm a bit disappointed in this tv because of it's lack of connectivity.  It's always a hit or miss and the last thing I want before I go to sleep is aggravation of having to wait for connection or having to go reset my modem.  Not real happy with this tv.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"quality picture","reviewDescription":"Main tv in living area. Good sound and picture.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Works as it should it should","reviewDescription":"My daughters old TV finally died. We replaced it with this and she has had no issues with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Good Audio","reviewDescription":"This flat screen has Good quality sound, compared to most other flat screens.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Broken TV","reviewDescription":"VIZIO is a wonderful TV but it came with screen broken.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Nice picture when it's working.","reviewDescription":"I gave this TV 3 stars because it cuts out a lot. I get \"connection error\" often. It only lasts about 10 seconds, but it happens a lot. The wifi is not the issue, my other TV works great. I'd upgrade to a newer model and not buy this one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"won't stay connected to internet","reviewDescription":"When this tv works it is good but it frequently can't connect to internet.  When it does this it usually takes about 15 restarts to get it to connect.  Very unreliable as a television, maybe it will make an ok monitor.Don't buy it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"TV only works if you accept Google’s terms","reviewDescription":"You’ll need to accept google’s use and privacy terms (on top of vizio’s) for this to work properly. Can’t use apps or tv casting unless you accept everything! Can’t opt out (only skip), so you’ll be prompted to accept them repeatedly after an initial set up.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Apps","reviewDescription":"Tv doesn’t support my local cable company app","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Doesn’t stay connected to Wi-Fi","reviewDescription":"Tv has a weird color spot on the screen, perhaps a manufacture error. Tv didn’t stay connected to Wi-Fi","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Slow response.","reviewDescription":"The remote control and tv does not respond quickly. It’s super slow. I wouldn’t buy this tv again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Cannot stand TV","reviewDescription":"TV works fine. Screws do not fit so cannot put the TV on the stands that were provided.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Poor audio quality","reviewDescription":"The sound on the tv sounds like 2006 quality. Seems faded and higher pitch then normal audio.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Apps","reviewDescription":"Had the tv for about 4 months, now I can’t access the apps for some reason.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"No hard wired network connection","reviewDescription":"I bought this tv because it was supposed to have a hard wired network connection. It does not. Other than that, the tv is fine. Its one of the few 32 inch tvs I found that had 1080p.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"it was Bluetooth compatible. I told them I need to return because it was not Bluetooth compatible","reviewDescription":"I loved it, the volume wasn’t very loud but a beautiful picture if I had known about a Bluetooth adapter would fit and make it work. I wouldn’t have sent it back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Has trouble staying connected to wireless internet","reviewDescription":"This TV has a great picture for the price but it has trouble staying connected to my wireless internet and does not work with AT&T internet air or Direct TV via internet. I returned it for an LG TV which was comparable in price and the LG TV is working great.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Bluetooth and WiFi are not up to date. They're two years old.","reviewDescription":"Sadly, Amazon doesn't give full descriptions of what this TV is built with.I went on online to download the specs for this TV. finding out it's two years out of date. Bluetooth on this is a 4.0 not 5.2. Wi-Fi is two years old. Speakers say 18 watts, but the manual specs say 7 watts for each speaker. I bought this for my mom because the remote was easy to work. I have a Samsung and I do love my big TV. The only thing I hate about it is their sucky remote. My mom does not do well with Internet. or Bluetooth. So I'm not that worried about it. But if I knew it had two-year-old components in a new TV, I would not have bought in it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Does not connect to 5G wifi","reviewDescription":"TV works fine. Speakers are cheap and sound bad but overall not bad. Beware the TV does not connect to 5G\/5Ghz wifi and only can detect 2.4 Ghz.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Bought for the built-in chromecast, but it crashes constantly","reviewDescription":"Look elsewhere if your primary use is for casting youtube, etc to it.  Mine cannot go more then 45-60 mins without randomly stopping the cast for seemingly no reason. This doesn't happen on other chromecasts I have in my home. Good TV for the price otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"The picture is just okay.  The sound is bad, I have to turn on the closed captioning to know what they are saying. It is slow to react when you want to choose an app to use or exit the app. It also freezes when a commercial is going to start. Which means that I have to exit out of the show, go back and when it starts playing, fast forward it 10 seconds. Then the commercial will start. Not real happy but like the title says, You get what you pay for. ☹️I was wrong, it does have HDMI and I’m so glad it does because I can use my Roku. I can plug earphones into the Roku remote and the sound is better than the sound coming out of the TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Horrible picture that cannot be fixed","reviewDescription":"If you like a washed out picture this s the TV for you.  No matter how many adjustments that are made the picture is awful.  In addition except for straight on viewing this TV is hard to see the picture.  Being returned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"purple stripe","reviewDescription":"have had the tv for one month and it now has a purple stripe down the middle of it.  we had thrown box away so didn’t know if we could return so it looks like get to live with the purplestripe.  😩","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Disappointed","reviewDescription":"Color is very nice but the tv is small, not a problem but the picture is cropped bottom and top Sound pretty poor very disappointing. Problem you can not control settings like on other tv brand . Do not base your purchase on other comments as I did you will be disappointed. Going to Costco to get a real tv . Not worth the pain to send back I can use it on gest bedroom","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"This is not a good option for older users!!","reviewDescription":"This is not a TV by my definition. it has to be connected to your Wi-Fi and it basically runs on apps like a phone or computer. I had to get a cable box to use it with the remote and process that my 87yr old mother was accustomed to using.  Total hassle.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Had For 6 Months - Ehhhh","reviewDescription":"This TV is annoying at best. Constant connectivity issues, which is a common complaint if you look it up online. It will disconnect from the internet and we have to reset everything to get it fixed. That’s not a once and a while thing, it’s multiple times a week. This issue started about a week after we got it, so it’s not an aging problem.The picture quality and audio are fine. The input response time is pretty slow.I personally wouldn't recommend this TV, and I intend to replace it very soon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Forget about Wi-Fi working","reviewDescription":"From day one this thing would connect to Wi-fi fine and the next time it wouldn’t.  Couldn’t get it to work so finally set to factory reset.  After a couple of hours downloading\/updating it worked again.  Until next time.  I kept meaning to send it back but now it’s not returnable.  It literally will not connect to the router.  The same router that works great for everything else.  Way too many hours invested trying to get a tv to work.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"No Ethernet connection","reviewDescription":"For a “Smart TV” a wireless only option is a terrible compromise.  For those of us without great WiFi or want to reduce the WiFi bandwidth having an available wired option is a must. I went to great lengths to make sure I had a good, solid Ethernet connection available wherever I needed to hang a TV and now I have to add one more wireless device to an already overcrowded wireless network.Picture is about as expected but nothing special.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"The TV constantly drops the WiFi","reviewDescription":"Every 2 or 3 days the wifi can not be connected, so the support page suggests restarting my router, which most of the time fixes the connection issue, but what a pain.  My other TV's don't have this issue.  I would not buy this product again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"NO USB OR HDMI PORTS!!","reviewDescription":"Had I known a current model TV did not include these ports I would not have purchased.Regarding performance, I have scanned for broadcast channels many times but never received all available channels even after trying 3 other antennas.The remote’s small keys and numbers were not easily seen or used.Regardless of the channel chosen, a clear distinct picture has not been displayed.I will request Return Authorization and buy another brand TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Poor picture quality and worse sound.","reviewDescription":"Set-up was laborious and non-intuitive.  Having multiple free channels is nice but switching to antenna channels is cumbersome.  My 15 yo Vizio has much better picture and sound quality and is easier to use in any mode.  Overall bad experience, would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Terrible sound, mediocre picture","reviewDescription":"We bought this to replace a 2018 Sanyo dumb TV with a Roku stick in our camper. The sound compared to the old TV was MUCH worse, and the picture was no better, and on older pre-HD content it was worse.The app choices also weren't as good, so we'd have to keep the Roku stick to access some of the content we love.We returned it and bought a Roku TV.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Only works on 2.4 Internet","reviewDescription":"Has problems with volume you literally most the time have to take it up to 100 just to hear it. I had a normal level and you know the commercials come on and then it’s beyond blasting. I’ve tried to adjust and follow instructions in addition to it’s constantly falling off the 2.4 Internet constantly having to redo your router, so it’s a bummer big bummer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Works correctly about 30% of the time","reviewDescription":"I’ve had multiple issues with this tv.Sometimes the apps don’t work. It’ll let you scroll thru stuff but you cannot open any apps so you have to unplug the tv and plug it back in about a minute later.Other times it decides to not connect to the wifi & it’s truly a struggle to get it to connect and work properly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Mmm","reviewDescription":"Update: there's also no Bluetooth capability , this tv is 35 inches not 39. Nothing. I will be returning for a full refund! It's a scam! Mmm I'm not really impressed.The remote is TERRIBLE AND LAGS UNCONTROLLABLY. There's also no mic on the remote, but claims to have voice control. HOW SWAY?! It's giving FALSE ADVERTISING.SOUND IS HORRENDOUS! No matter how you try to adjust it, more than likely will only sound good with a soundbar. I got this for my bedroom, & I'm really disgusted. Sounds like static noise behind what you're actually listening to.Color could be better, adjusting settings don't make a big difference.HD quality is actually really good. Does work with Alexa, and the app is okay.It's not giving 40' inches to me, looks small. I will measure it and update.I got it on prime day, even as it being \"discounted\" I feel like I wasted money. Mmmm don't know how I really feel just yet, but I know I'm not impressed.You're better off with a Samsung, and investing your money. I have a Samsung in my living room, that never misses. Sound on 20, but it relays like it's on 50. Picture quality & color immaculate! Depending on the model you get, the remote may or may not have a mic.SN: last picture is my mounted Samsung in my living room.","isVerified":true,"ratingScore":2,"reviewReaction":"18 people found this helpful","country":"United States","date":1697846400000}
{"reviewTitle":"D40f-09 does not connect to local channels.","reviewDescription":"The WatchFree+ feature does not load local over-air channels. You will be stuck with a bunch of preloaded nature, cooking, and shopping channels instead. After the 40\" set arrived, I spent 2 hours trying and over one hour talking to Vizio reps, who finally gave up and said there was nothing more that could be done. The Vizio D32f set that I bought a week or so earlier loaded some 50 of my local channels perfectly, but the 40\" set would not load any, even though it has a stronger WiFi signal. I figured that set was just a lemon and sent it back to Amazon, and a replacement arrived the next day! Same problem as with the first set. If you want to watch, say, local news or sports, forget about it on the Vizio D40 TV.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"no sideloading, can't replace power cable.","reviewDescription":"The tv came in one peace looks great setup took longer than it should but it's a smart tv and everything needs to update. picture quality is really good the back light bleed has its moments where its noticeable to being very impressive. sound as well isn't bad. it's a thin tv small speakers its more treb then bass but overall, for the price and size it was better than I thought.so why the two stars? not being able to replace the power cord in case of damage or wanting to make it longer is unacceptable its nothing more than ewaste. most if not all people will toss this tv out and not attempt to fix it. cats, dogs, vacuums. who knows maybe when moving it gets smashed or ripped on and now the tv is junk.second is only being allowed some apps.. no crunchyroll or internet browsing just casting from the phone. but I don't want to always be on my phone. it would be nice to be able to sideload or download what I want on a tv I bought and not have to use not only my phone and its battery life but the remote control. what's the point in a smart tv if I have to buy a device to make my smart tv smart? makes zero since to limit so many apps to this thing for no real reason besides money.if this is a tv you're buying for say games, movies or the listed supported apps like FUNimation, Netflix, Hulu, Disney + then this is a great option. but if you want Crunchyroll, moviebox pro, or anything else than looks for something different or spend some more cash on a firestick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"AirPlay not working at all","reviewDescription":"I just unpacked the TV. Setup was easy although it took about 15 minutes with all the updating. I was able to mirror my iPhone 14 but I am unable to Airplay to the TV like I do to my other Apple TV devices. The TV says it’s connected to my device but neither sound nor picture show. Screen mirror is rocky at best and that’s with me getting 50\/20 mbs up\/down on my iPhone right next to the TV.Since the whole purpose of the TV is to watch youtubeTV and watch movies from my phone I can’t really give more than 2 stars.I will search for more help online and leave further feedback when I get answers.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Keep your return box.","reviewDescription":"This television is really meant to be a security monitor, for the picture isn't bad, but everything else is garbage.Underpowered, so navigation is slow and clumsy, no Bluetooth, so listening through the terrible speaker is the only option, and why it's called a smart tv I do not know, it doesn't even have the ability to download additional apps.The upside it's affordable, but you get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"This little tv is mediocre, at best.","reviewDescription":"So listen, I had an idea of what I was kind of getting into with this TV after reading mixed reviews. I didn’t really need a high quality television that was super large, so I settled on this one. Ha ha… Thank God I got it on sale.1. It’s very small and very frail2. Believe the reviews that say that it is slow and or lags very hard. It also tends to just freeze.3. At one point, after having the tv for almost 2 months, the bottom half of the remote, from the “Home Screen” button down, stopped working.  It took over 20 minutes and a few taps on the side of my couch (literally) to get the remote to pair back to the tv.Literally, at this point, it’s doing the bare minimum job of what I need it to do, I got it for half its worth on sale so I’m just rolling with the punches ha ha.  But if you’re looking for a good quality television, even for a smaller size, I would pass on this one.Update: just today as I write this review the remote once again has stopped working from the home button down so I’m not able to turn the volume up or down Baha! I mean first world problems but still…this tv would be worth about $50 at best!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Los que parecia bueno no sirvió","reviewDescription":"Recibi el TV, las principales funcionalidades no sirven fuera de USA, sin embargo lo programé con Netflix, Amazon Prime, y canales locales, al tercer día dejo de funcionar, se enciende pero queda en pantalla blanca, al ser una marca que no esta representada en el Pais de instalación, no hay un centro de servicio que lo pudiera revisar. Lastima parecía un excelente producto, pero fallo.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"It's good","reviewDescription":"The tv is fine.  I needed a small tv to fit into a design scheme and this was it.  I gave this 2 stars because they either gave me the wrong legs, or there is a problem with the fit where the legs go.  I will be mounting the tv so I only have to deal with this issue temporarily.  In the meantime, I can't use the tv at all because it tips over and I don't want to break it.  I wouldn't of even bothered with the review, however, It's been one quality control issue after another with Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Apps on this tv","reviewDescription":"Althought this tv has a great picture it does not have a big supply of apps for instance if you have direct tv or Spectrum you can not download their apps with out buying some other device , it also does not have bluetooth so you can not connect a bluetooth speaker thru wifi. Needless to say i am disappointed in this purchase","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Mmmmmm","reviewDescription":"So overall the set up of the TV as in programming etc. that was super easy. There’s like a QR code for all of the apps just about so you don’t have to input from your phone which made it again super convenient BUT the legs attaching them—- the screws were complete. Crap. no seriously the screws are so crappy and the wrong size and so it would not screw all the way in where it was flush and so it’s a little wiggly. If I wasn’t so lazy I would send it back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"A bit outdated","reviewDescription":"A bit outdated but it’s still a good flat screen for the money. The phone jack is the old 3.5mm round jack, so a bit outdated. No bluetooth.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Very Pleased With This Purchase .","reviewDescription":"I Was Anxious At First Due to The New Fixtures.Now I Am Very Comfortable Using It And EnjoyingMy New Smart TV Set","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Only has HDMI (ARC) external speaker output. There are no RCA type output jacks.","reviewDescription":"Great picture and decent sound. I would have given 5 stars had it not been absent the RCA style speaker output jacks. For the money it's a decent purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"I wish the remote lit up","reviewDescription":"This is just an extra TV we have in our family room, nice size, and a bit of a pain to set up. The remote does not light but which is the downside to this Picture quality is good","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Good quality, very breakable","reviewDescription":"I love Vizio but every TV I've had fell once and the screen completely shattered. It just fell slightly. Its not durable. It also turns on when my roommate uses her remote fire stick, so kinda of an inconvenience. But they replace my TV so it all works out.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"I love it","reviewDescription":"I love this TV. Really easy setup. My only issues is the feet stand. Getting the screws in was a pain. Be ready with an electric screwdriver or a lot of hand and wrist strength. I love being able to use the YouTube app and sign into my account with ease.I highly recommend this!","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Great value, good 1080 picture","reviewDescription":"Great cheap TV for someone who does basic viewing.Super slow\/laggy UIOnly use it with something plugged in to hdmi","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"3 out of 5","reviewDescription":"I didn't notice that this TV doesn't come with Bluetooth. Otherwise I would have given it 5 stars.Update: I am sending this TV back in exchange for a TCL 43\". I started having a lot of problems and since I'm still in the return period I am avoiding future issues that will prevent me from returning it. The HDMI input would freeze and prevent me from switching to my Xbox from Smartcast. The TV also would not power up without unplugging it and plugging it back in. The apps lag and Chromecast worked 50% of the time. I hope the TCL performs a whole lot better.","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Audio is truly unbearable","reviewDescription":"The picture is nice which is unfortunate because you cannot ignore the audio. It sounds like the speakers were already broken\/water damaged when the TVs are sold new. I wish it was something you can just ignore but its not. It’s too low and it’s blown out. I had to return it not even a week after buying it.Im trying out the d-series and honestly, Vizio is just a crap company and a bunch of scamming liars. The d-series has good audio and picture, but now it keeps saying that it cant connect to my internet every time i turn the thing on. There is absolutely nothing wrong with my modem and this has never been a problem with any of my devices. Try a different company altogether. Vizio is pathetic and I hope their business drowns.","isVerified":true,"ratingScore":4,"reviewReaction":"31 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Easy to set up","reviewDescription":"The Vizio connected wirelessly to my internet. And it was easy to set up although it did take awhile to install updates. It's not a high-end tv so the picture quality isn't as crispy as others. However the price makes it just fine for me. The sound is actually quite good. I used the legs instead of wall mounting. The legs seem a bit flimsy but I don't plan on moving it I may not but another one but as a traveling healthcare worker it's light enough to travel with. Especially when some locations have no television.The biggest flaw is there is not an option to install more apps. However it comes with a ton installed and it has everyone I want. If you have a rare app this may not be for you.","isVerified":true,"ratingScore":4,"reviewReaction":"50 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Very Poor Sound, No 5G connectivity, Set-up Hassle, only 2 HDMI ports, picture good for price","reviewDescription":"My TV took a very long time to get set up downloading and trying get set for operation.  It never was successful in getting my account set up even though I tried multiple times via the computer and mobil phone & app.  Guess it's not that important but I'm not sure since it was not successful.I hate the internal speakers they are terrible and I'm just using the TV in my bedroom.  Kind of hate using this TV because if I turn it on I have to listen to it's internal speakers and I often can't understand what words are being said.  I used audio settings to try to get the loudest\/best sound I could based on others recommendations and my experimenting still audio is no good.  I had to order a sound bar which cost close to the price of the TV but now I have to wait for it to arrive and hope that works out.There is no Spectrum App in the installed apps and I could not download it into the Vizio control center, so I have to use a current Apple TV box.  Since you have to use a Roku, Apple TV, etc to add apps you have to use one HDMI port for that and the other for sound then you're out of HDMI ports.  The Apple TV with the Apple\/Spectrum remote that Spectrum sent me works much better than the Vizio control center of apps and having to use the Vizio remote the Apple\/Spectrum remote is far superior and it is lighted.  The DVR through the Apple TV does buffer, pause and shows freeze, I think it might be because this Vizio TV does not support 5G connectivity, kind of a turn off for a new TV purchased in 2023.The TV seems to turn on all by itself which is annoying and distracts me when I'm trying to work or concentrate on something important.There is an annoying light that lights up real bright at times and then blinks for several minutes.  When it's pitch dark in my bedroom at night and these lights come on it is not good, it is also distracting and annoying.  When I turn off all my bedroom lights for bed it's suppose to be a peaceful time.The picture quality seems pretty good but not as good as my 2008 Samsung 32\" 1080p TV which recently started malfunctioning.  But the sound of the Samsung was way, way better than this Vizio.  Others have said that the sound is so bad because of the very thin screen.  I'd rather have a TV with decent sound than have a TV with a thin screen.  Wish I didn't have to order the sound bar to hear the dialog in my shows I watch.","isVerified":true,"ratingScore":3,"reviewReaction":"29 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"OK, But Poor Sound and Xfinity Issues","reviewDescription":"This TV is just OK.  It serves its purpose and was a decent price, but there are some things people should be aware of if this TV is on their shortlist.  First, the sound is not great on this TV.  It's tinny and even with adjustments it's OK at best.  I bought an external sound bar that helps (thankfully).  Also, if you are an Xfinity customer, you cannot use the Xfinity app directly.  :O  You have to use an external streaming device such as a FireStick or Roku Stick and download the Xfinity app via the other device and use it from there (so stupid!).  Oh, and if you go the FireStick route, you need to have a FireStick running Fire OS 6 or higher, or it still won't work (learned that the hard way).  So be prepared to spend $160 on the TV itself... but possibly more if you like decent sound and are an Xfinity customer with an older FireStick.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"An exceptional value; but the stand fit poorly and program data is difficult to view!","reviewDescription":"The picture and sound of this set are easy and intuitive to personalize -- and the on-air tuner pulls in most of the broadcast channels in my area, and the image is clear and sharp. The dimensions of this unit are also just about perfect for use in a kitchen or small bedroom.Switching channels is also fast, and most parts of the menu system are intuitive and easy to negotiate.(However .... )My vision is better than 20\/20 in both eyes -- but even two meters from this set, the numbers and letters on the screen are impossibly small to read as you enter channel data using the remote.  Rectifying this problem was \"the opposite of intuitive,\" and required my utilizing zoom\/adaptive features that allow you to only view the center (not the corners) of the broadcast image.And, the (plastic, weak) stand components did not fit correctly -- screws to secure them had to be forced into the edge of the screen: a scary moment, during which I worried that I might crack one of the plastic parts.Generally happy with the value; but not with the on-screen data presentation or the fit and finish.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"I wouldn't buy again, but it's not terrible.","reviewDescription":"So, I felt like I struck a good deal when buying this TV. And I sort of did.It displays pretty clearly, volume is crisp and clear. It easily runs the PS5.There's just a few downsides.1. It will randomly freeze up and\/or turn off.2. After a few months of use there is sometimes a random line of black across the screen. I haven't left it on paused or anything, and the blocks of black come and go. No matter what I do, I cannot seem to get amazon to allow me to upload images of this. Just know you may have random areas where the display is darker or where it is blacked out.3. Updates are annoying, but don't take terribly long.Though I am glad I purchased this TV because it is an okay purchase, I plan on investing in a better one for my living room and moving this one to my bedroom. I wouldn't purchase this again due to the darkened spots that appear every so often, and the fact that it sometimes just shuts off.If you are on the lower side of income and are looking for something decent, I'd recommend this for you, but I definitely want something more reliable at some point.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Looks can be deceiving","reviewDescription":"Well most of the tv's in my home are Vizio's so when I saw a sale I thought let me get one in each room. Got them up and running and it's been an interesting set of events the tv's work they only can get the apps that are there so that's not cool I have to watch my tv in livingroom to watch my xfinity app. They take a few to respond to a request from remote control. These are good for a guest room that is not used much or kids room. I will be looking for new TV for my bedroom.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Poor Wifi connectivity","reviewDescription":"I was excited to put this Vizio TV in our kitchen, and the 32 inch size was perfect. My advice is if you intend to use this TV with only a wifi connection, don't do it.We just upgraded to fiber optic cable, and every other device in our home is working great. This TV had a LOT of difficulty connecting to our network, even though our router is split for 5ghz and 2.4ghz connectivity. I tried connecting multiple times to both, and after calling our internet provider to make sure everything was stable on our end, the TV finally made a connection.Almost every time we turned on the TV, it would have to buffer to make a connection. The picture quality was good, and the remote works well, but I couldn't deal with the slow wifi connectivity.If you're plugging a coaxial cable directly into this TV, or using it with a digital antenna, it should work fine. Just don't depend on its wifi capability.Grateful to Amazon for easy returns. Went with a Samsung TV instead, which connected to our wifi flawlessly and has been working great.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Great Picture, Limited App Selection","reviewDescription":"I recently mounted a VIZIO 32-inch D-Series Full HD 1080p Smart TV in my kitchen, drawn by its features like Apple AirPlay, Chromecast Built-in, and the promise of a crisp picture. True to its claims, the TV delivers nicely on picture quality, making my cooking shows and morning news much more enjoyable with clear, vibrant visuals.However, calling it a \"Smart TV\" feels a bit misleading due to its restricted app ecosystem. The main downside is the limited selection of apps available. Unlike other smart TVs that offer a wide range of applications, this VIZIO model limits you to a handful of pre-approved apps, which feels like a way to nudge you towards their subscription services. This was a bit of a letdown for me, as I expected the flexibility to download and use any app I wanted.I found myself purchasing an Apple TV to bypass this limitation and access the apps I needed. While I appreciate the TV's quality and performance, be prepared to invest in additional hardware if you're looking for a truly smart experience with unrestricted app access.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Bad screws","reviewDescription":"the screws that you use to attach the legs to the tv were both too long and too wide. Like the ones that came in the box specifically for that. I stripped the holes they go in trying to fit them.  I had to spend 35$ on a separate tv mount and dry wall anchors in order to watch the tv safely. So if you buy this tv, you’ll need to add a wall Mount to the cart too if you want to watch tv the same day it’s delivered.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"This tv has a great picture","reviewDescription":"I was surprised this cheap little smart tv packs a punch! If you see this just get it. It has all the plug-in ports you need for gaming and video watching. It’s a smart tv so you can watch your apps right from the tv. It also has airplay so you can cast movies to the tv. It has a headphone jack so at night I can put my headphones on and not wake anyone. It has a crystal clear picture as well. It has many color\/brightness adjustments as well. I absolutely love this tv and am surprised at the performance. You can download the Vizio app and operate this tv from your phone. It looks just like a remote, plus the vizio app has tons of great movies etc. I just love it! Better than Roku in my opinion!UPDATE: The picture is very pixelated on dark scenes but so crisp and clear on bright scenes. I’m honestly thinking of returning this. Dark scenes look so blotchy and awful. Dropped my rating down to 3 stars due to the pixelated mess!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Alright for the price, but does crazy stuff on its own","reviewDescription":"This TV isn't bad as far as picture or volume quality, for a bedroom, as far as I can tell, at least. I did originally rate it at 5 stars, because when it first arrived we of course took it out of the box and plugged it in and everything to make sure everything on it worked, which it did, so it went back in the box for a little while until we got moved into our new place, which is why we bought it to begin with, but after setting it up in the new place finally, now it keeps randomly turning itself on, somehow. At first we thought maybe one of the cats stepped on the remote that was on the bedside stand or something like that, so we finally decided to put the remote in our dresser drawer to make sure it didn't get \"accidently\" turned on again, but it is still randomly turning on, which we realized is the actual TV itself turning itself on, somehow, and nothing to do with the cats or anything else, since the remote is in the dresser drawer now, and the dresser\/chest it's sitting on is to tall for the cats to jump on and get anywhere near the TV, so at least once a day we end up having to shut the TV off, after it turning itself on. I'm not sure what could cause such a crazy issue with it, but just make sure to keep an eye on it and don't think you're crazy if it happens to you, because you most definitely are not! I wish we would've tested it out a little better during the 30 day return window, even though we weren't going to be using it during that time period, I just like to plan ahead, so I probably bought it much sooner than I should have, but anyway, the moral of the story is to just make sure to properly test it over a few days time period, and don't make the same mistake we did. Other than it doing that crazy stuff, the TV itself seems nice (would definitely be a lot nicer if it didn't randomly turn on by itself, but what can you do, lol). That's the only reason I changed my rating to 3 stars now, from 5 stars previously, though. Good luck! 🌝","isVerified":true,"ratingScore":3,"reviewReaction":"39 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Not a simple TV","reviewDescription":"Purschased for my wife's office to just watch cable TV.  Got it hooked up and working.  Next day, turn on TV and it is going through software update.  Never ended.  Finally unplugged the tv and restarted it.  Got it working again and decided to disconnect the internet so it won't do more software updates.  That lasted a day and wouldn't work.  Called Vizo tech support and we went into the settings to set it to always go back to the last setting it was on just before shutting off the TV.  Then in the middle of the night the TV comes on with an error code it is not connected to the internet. So I had to go into settings and set it up to go back to the HDMI 1 to get to cable TV.  Conclusions:1. The sofware on this little 24\" TV is more complicated than need be for a little TV.2. It will not display the HDMI connection you are using so switching it back to the settings is not possible.  Very aggravating.3.  If I don't want the TV connected to the internet, then Vizo get over it and let it be!!!This TV offers lots of options.  Probably more than needed for this size ofTV.  I have a Sony 77\" TV that doesn't offer these many options.  I can accept all the software options if it would leave me alone when I only want the watch cable TV and NOT stream!!  Vizo fix your complicated software scheme on this TV and you'd have a very nice product.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1656633600000}
{"reviewTitle":"BEWARE NO SPOTIFY APP","reviewDescription":"BEWARE this TV and apparently all newer Vizio Smart TV's do not have the SPOTIFY app and there is no way to add it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"The quality of this model is not so good.","reviewDescription":"I purchased this TV about 4 months ago, it was all fine but a couple days ago, it couldn’t connect to WiFi anymore. I tried several methods to solve it, but still failed to connect the WiFi. This model seems not good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Will not hold WiFi connection","reviewDescription":"Will not hold a WiFi connection.  Plug in a FireStick and it works perfectly.  Other issue is an occasional buzz in the sound.  How to return?  Box went to recycling several days ago.  We have 3 other Visio tvs, never had a problem.  Because I cannot connect to the WiFi from the main Visio Home I also cannot change or adjust some settings.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Some apps not allowed\/ discoloration in pixels already","reviewDescription":"Won’t allow local cable apps and there is already discoloration in the pixels on one corner after only 2 months of use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Looks used","reviewDescription":"The box looks like it had been around the world. The screen had smudges and finger prints. Missing some of the hardware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"I had owned better Vizio products","reviewDescription":"This TV is not like other Vizo tv's I have owned. It was difficult to set up and quality is basic.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Vizio tried too hard on this one","reviewDescription":"Hmm, it’s been a few years since I bought a new TV and, at least this one, has way too many entertainment options for its own good. With all the streaming and free apps out there, Vizio, for reasons I suspect are related to partnerships with apps like Pluto TV and Tubi, has them all on a chip in this TV. Which, slows down its performance and makes it more complicated than need be. And if you don’t have wi-fi then you can’t use the apps anyway! Wish I never bought this thing, but, I’m stuck with it so maybe after reading this you won’t be.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"it works when it wants to.","reviewDescription":"Lags, freezes, turns off skips, this tv has a mind of its own but it gets the job done.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"READ THIS REVIEW!!","reviewDescription":"Components in the tv cause it to drop wifi connection intermittently and its a giant pain. Signal remains Excellent as the router is on the other side of the wall, so it’s not the wifi. Picture is awesome. Sound is great. Apps work as they should, if the tv can stay connected to the wifi long enough. Plan on using a wired connection or plan to call support and be stuck for 2 days waiting for a service request. If Vizio Support can help me out this would be a 4-star tv for the price and quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Really small and low res","reviewDescription":"I don't know why I totally spaced out on how small a 40\" tv would be, but this was too small for our needs and the image quality was really low res. I suppose for the price point, if you're not too concerned with image quality and actually looking for a 40\" tv (not 55 or 60\") this is okay, but I had higher expectations so it was returned.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Didn't really want smart tv","reviewDescription":"Only can find smart TVs now, need two remotes to work tv and my tea network!  Volume on Vizio ,no controls on set. Need to reboot quite often. Hard to figure how to use","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Buena tv","reviewDescription":"Llegó bien, se ve bonita y el sonido está bien. Lo único es que si vives fuera de EE.UU el sistema de Vizio no te funciona, por lo que compré un Chromecast para usarlo con Google tv.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"No ethernet port as advertised","reviewDescription":"No ethernet port as advertised and vizio support don't know that.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"All around quality TV.","reviewDescription":"Remote is less functional than I am use to (ROKU channel rotation) ,but all-and-all it is a good unit.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"It looks great!","reviewDescription":"It looks great but its slow when loading, I haven't been able to get on Netflix yet because it won't load.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Good TV","reviewDescription":"Got this to upgrade from my 32 inch Vizio that is now in my bedroom.  Set up was easy. Nice picture. Volume seems less than the old 32.  Also the stand is nowhere near as stable as the old 32 inch as well.  Don't know why they changed that.  Have not tried the apps yet but the updates all went through smoothly so I assume there will be no issues.  All in all it suits my needs.  The old 32 inch has served me well, I hope this one does the same.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Good value","reviewDescription":"I bought this for my wife to use in her study as a replacement for an old 20 inch. The High Def picture was a big upgrade as well as a slightly larger screen. Also, it was very light weight and I was able to turn it upside down on my thighs to screw in the support feet. The whole thing weighs just a little over 6 pounds. On the negative side, Vizio tries to get you to use all kinds of video services so I had to decline a lot. All I wanted was to link up with our cable provider which was also easy to do. The instructions were not top notch but I watched a couple of you tube videos which made the set up quick and easy. Recommend the 24 inch a good second TV.","isVerified":true,"ratingScore":4,"reviewReaction":"39 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Very good quality TV with a nice price.","reviewDescription":"This TV has a very good picture quality and is packed with a lot of nice features. The reason for 4 stars is because during use of remote control there’s a slight delay in the signal transmission of the buttons pressed. So it takes a special talent to operate it.  However, I would like to offer some advice:  if you are purchasing a TV for an elderly person in the beginning stages of dementia, don’t purchase a different brand than what the elderly person has previously used because they will find it very challenging.  I purchased this TV for my elderly mom and the best she can do is turn it on\/off, I have search and select the channels for her.  Today’s TVs are very sophisticated to operate by seniors.","isVerified":true,"ratingScore":4,"reviewReaction":"46 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Great price for it's size","reviewDescription":"One caveat is that it can't show dark scenes very well. Otherwise, the picture is crisp and true to life at a bargain price.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Awesome  Pictures.","reviewDescription":"So far, so good, I have had it almost 2 weeks awesome picture, easy to set up. I like it, I pray it stays good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"I Like It","reviewDescription":"So far so good, no complaints and it works great to date!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Best product from very well-known Company","reviewDescription":"Excellent choice and a great valued product from the great Amazon listings.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Amazing service","reviewDescription":"Keep up the amazing job you do. I love the product and the shipping was awesome and on point. The delivery driver was an awesome person and was very respectful and professional and very polite. I say all involed need a raise or treated better.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Great value","reviewDescription":"Bought this to put in my workshop.  Could not believe the price and features.  A total solution.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Great","reviewDescription":"It’s clear and has all my apps","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Not hard to set up n easy to move around","reviewDescription":"My samsung of 15 years quit n wanted new ,small,easy to set up love this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"No Internet","reviewDescription":"The TV worked perfect. 2 days later I got a error message saying I didn't have the internet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Came on time, in good condition for a Christmas gift for my sons bedroom.","reviewDescription":"Happy with our purchase. Came in time, in great condition and works great. Bought for my sons Christmas gift for his bedroom for when he comes home from college and he loves it. The remote is super easy too, I hate a remote with too many buttons! It comes with legs which you don't see in the pic because our cat pushed the TV off the nightstand so we have to reapply them. Happy with the purchase and the vendor. Hope the pics help!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"The quality","reviewDescription":"Price right. Fast delivery.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Stuck updating for over 2 hours","reviewDescription":"Immediately went into an update after turning on. Took almost an hour. Then it did it again. Now it’s stuck updating the Apps. Still updating…..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Bueno","reviewDescription":"Muy bueno excelente","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Smartcast isn't available in the Caribbean so can't fully enjoy the tv","reviewDescription":"Not a bad TV jus ashame it smart hub can't work in the Caribbean making it useless if u don't have firestick or cable","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Don't buy","reviewDescription":"This TV is a bargain but remember you get what you pay for. It constantly freezes up. I have to do a restart almost everyday because it will show a message that says the channel is not available. When you change the channel it doesn't show what channel you are on. You can't block channels that you don't want to see. I will never buy another VIZIO.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Issue after issue","reviewDescription":"I am about a week out of the return window so returning isn’t an option. In this short period of time, so many connection issues with this tv. Every other tv in the house will work except this one. Can’t find the network. It will connect and open streaming apps then not play any of the shows. It’s a crap shoot when it gets turned on: will it play or won’t it. Such a hassle. Pick something else.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Technically it works.","reviewDescription":"This was rebuilt or something. My son has a hard time using it because it’s extremely slow to react when you press any button. Press volume down and it will go down after a couple seconds, keep pressing volume down and it remembers , then your watching the volume go down for however long it takes to get to zero. I’m very upset that I bought this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"The sound has to be turned to about 50 to even hear it","reviewDescription":"Color isn't that good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"TV review","reviewDescription":"Worked good for a couple of months. One day I went to turn it on and everything was in Spanish. I watched YouTube to try to get through it. It’s confusing. Now it doesn’t want to operate at all still in Spanish. Tried to get help through Visio And all that does is revert you to YouTube channels confusing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"tv pictue develop strips in the screen","reviewDescription":"poor quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"TV was sold used like new, but, shipped like an used  item out of original box","reviewDescription":"USPS dropped of the item and it seemed very loose in the box. I opened the box to find just a TV wrapped in plastic with foam ends , not in original Vizio box just loose in an oversized brown box with no extra protection to take up the extra space or protect the screen. The remote and stand legs were loose in box, no paperwork or even plastic wrap to protect the screen. I unpacked the TV and immediately got hit with the smell of overheated or burnt electronic component smells.TV powered up and went thru several cycles of screen updates, finally was able to see TV function and picture quality.Picture quality was pretty good, some text \/ titles seemed blurry and the sound at 40% was decent but had to be that loud.We are very unhappy with this purchase and are in the return process.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662508800000}
{"reviewTitle":"Keeping children happy","reviewDescription":"My kids love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Televisor vizio","reviewDescription":"Todo esta bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Love this TV so much!!!","reviewDescription":"I love them streaming apps. So easy to set this tv up for streaming or watching regular channels on this TV. The picture somes in crisp and clear. For the price this tv is a steal. Get yourself a Vizio TV. I bought this 40 inch for my living room but I also go a 40 inch foe my bedroom that is 2 years old but still going strong .","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Great picture and super lite","reviewDescription":"Just what I needed for my camper. Great picture with a lot of functions.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Great TV","reviewDescription":"Great TV for a good price!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Plenty of apps","reviewDescription":"Connects to a smartphone by an app, great picture, nice medium sized screen","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":",","reviewDescription":"Muy bueno ahora ya tengo paraf ver películas con mi niña 🥰","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Easy setup","reviewDescription":"Great deal and very satisfied","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Awesome TV","reviewDescription":"Wonderful tv for the money!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Very happy with it.  Well priced, excellent picture quality.","reviewDescription":"Very happy with it.  Well priced, excellent picture quality.  I pair it with Apple TV with very good results.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Good Picture, Horrible Response","reviewDescription":"Overall a pretty okay TV at the price, not a horrible picture and the bezel isn't too big. The part that bugs me is the mess of aps that the tv has on it. There are so many and the reaction time of the TV is pretty bad. Maybe if there was less ads and clutter on the home screen it would help. Again it is a cheaper pick and not bad at the price range but offload some of the apps if you want it to run decently at all. Also it is almost impossible to stream my phone to the TV without it glitching and trying the same with Youtube is a pile of hot garbage. My advice would be to spend a little more $ and get a TV that can handle the 30 app minimum most of these Tv's nowadays come with.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Very nice!","reviewDescription":"Bought this to replace a tv that went bad in our kitchen. Hooked it up today and watching NFLplayoff games. I use Chromecast to stream and the built in Chromecast in this TV worked perfectly and was more than easy to set up. In fact as soon as I went through the initial set up process the TV already knes I had chromecast and the TV responded as soon as I used my phone to start streaming. I was a little concerned about sound quality from other reviews but in my set up its really very good. Remote is fairly simple and intuitive. Its a very lightweight TV and worked really well with the TV wall mount I also bought. Only negative is I wish the power cord had been a little longer. But overall very happy!Update - after using it for a few weeks I’ve noticed the built in Chromecast device is not the same as a “regular” chrome cast. On many channels it does not download video and audio at the same rate, so the video lags noticeably behind the audio, and it gets worse the longer you watch. I’m talking several seconds after watching 2 minutes. I plugged in my separate Chromecast  into one of the hdmi ports and now the problem is gone. Still like the tv but it’s disappointing I need to have another device plugged in to make it work properly. I’m going to contact the manufacturer to see if this is normal or the set is defective.","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Smart TV. Not so smart. 🤷‍♂️","reviewDescription":"Let me begin by saying that I worked as a Home and Business A\/V Professional for the last 17 years. Highly adept with technology and computer programming. Having said that, this particular “smart TV,” is not so smart, nor intuitive. I’m accustomed to setting up a vast multitude of tv and stereo equipment. This is just a tv. You would imagine you can just screw in the coax cable and begin watching your provider’s channels. In this case, no. It defaults to Visio TV, online. I could stream all my services fine, but I jumped through a vast multitude of hoops, before I could watch my Spectrum channels. Not happy. Then after a week of watching these channels, we lost power and I had to go through the entire process again… most frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Not too bad","reviewDescription":"Light quick simple tv if your WiFi is strong… only down side is the sound .. it sound like cheap headphones","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Just OK ...","reviewDescription":"I wanted a small smart TV for my bedroom and it was just right. The good ... It has good features and streaming options. The bad ... the functionality is not user friendly. 1. It takes a long time to power on. So long, over 30 seconds, till I question if the on registered so I click on again only to realize that I just turned it off! 2. Finding PBS app once installed was like finding lost keys ... where is it? 3. Volume is so low! I don't really like it to loud, but except commercials and talk\/game shows I need to turn up to over 50% of max to get a comfortable setting. 4. Changing channels is a manual pop up menu and another 30 second pause! 5. Impossible to read small screen fonts and there is no way to adjust font size. Enough said. Would I buy again...NO!","isVerified":true,"ratingScore":3,"reviewReaction":"14 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"power bar speaker","reviewDescription":"This TV does NOT hook up to a sound bar. It has no hdmi connection available","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"TV","reviewDescription":"Can’t add new apps on this smart tv. I would not have purchased had I been aware of that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"TOTAL PIECE OF CRAP!!!!","reviewDescription":"It was delivered August 30 and by September 29 it started acting up. Twice today and I turned it off and it came back on by itself a number of times! The first incident it came on at least six times after I had turned it off. The second incident it took three times before it would stay off. I’m not sure what to make of this issue. Any suggestions?  I did a factory reset on it and it seem to take care of the problems for now.  It is now the middle of December I have had this TV for 3 1\/2 months and I have had to reboot it six times! It is slow to load when you turn it on even though I just booted it! It freezes the screen. I’ve never been so disappointed with an appliance in all of my life and I’m 56 years old.  UPDATE: 2\/10\/2022Turned on the television this morning and it told me that it’s services were not available. I am now trying a factory reset again to see if that will help clear up the problem. I’ve never had so many issues with the television in my life as I stated earlier. This is the biggest hunk of crap I’ve ever wasted my money on! I only bought it because I wanted a larger TV and 40 inches fit the spot that I wanted to fill. Never ever ever ever ever buy a Vizio product you will be disappointed!  Update Sept2022: still a piece of crap but now it will not update and I cannot use it at all. I wish it was heavier so I could at least use it for a boat anchor. Don’t waste your money on this crap!","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1632960000000}
{"reviewTitle":"Not great, even for the money","reviewDescription":"First off, I didn't know that I would need to be a surgeon to get the legs on this TV. I had to send it back immediately because the holes were not big enough for the screws. Very inconvenient. Got the second one and it is just okay. Very slow and laggy, and the hybrid version of this Chromecast tv is lacking in features from a regular external Chromecast TV device. The picture is just okay. I usually buy Samsung TVs because I like their screens and generally the TVs hold up very well. I only bought this one to replace the 8-year-old 20-inch TV in my kitchen. So far, the TV is serving its purpose, but I would not buy this again, especially in a larger size, and I would never buy another Vizio anything.","isVerified":true,"ratingScore":3,"reviewReaction":"18 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Cheap TV","reviewDescription":"Its a cheap \"smart\" TV. Slog through the interface with too much buffering while streaming","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"The remote is the worst I have ever used.  I have to be within two feet and no voice activation","reviewDescription":"The remote is so weak it only works within two feet of tv aand has no voice control.  It has made it the worst time to not use.  I got it because I am so I’ll.  I can move to the tv easily at all .  I pretty much can’t use it.  Wtf","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Menus are terrible","reviewDescription":"Hard to set up this tv. Wasn't sure I even wanted to keep the thing.  Doesn't play well with the Vizio sound bar either. No pause on remote. Did I mention setup was terrible? I'd pass on this if I knew. I have a 70 inch same brand. It's fine. This 40 inch. I'd skip","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Not a good buy","reviewDescription":"My television worked fine for the first few months now it is constantly turning off and losing all of the settings.Is this planned obsolescence so I have to buy a new tv?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Great picture! The screws for legs do not work","reviewDescription":"I am giving this a two star because the screws do not work so you can’t put it on the stand. You have to go to Home Depot and find the right screw. It’s ridiculous..","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Not for me","reviewDescription":"It is not for me! For someone who struggles with technology and wants something straightforward, this is not it. The choices are limited because most of the apps I had used in the past could not be downloaded on this TV and I could not program my local channels.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Tv is ok as per cost","reviewDescription":"Software not that fast . Remote response is very slow. s","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Choppy Movements","reviewDescription":"The television picture is clear and vibrant, but when you start to maneuver through the TV with the remote, the way the screen movement is choppy and delayed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"settings","reviewDescription":"There is no way to lock in channel choices. I have been at this for months and tryed every concieviable way but when you select the channels you want there is no way to hold them. none. You will have to reset them pretty much every time you turn the set on. really sucks. finally gave up and just work around all those channels i dont want. Lot of treouble. buy something better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"got what i paid for","reviewDescription":"this tv has a remote issue,the first week i had this tv my dog ate the remote,(my bad) make no excuses for myself.but the tv has no buttons what so ever to turn off and on.try to use the vizio app to use my phone as a controller, it let me turn it on,soon as it came on it lost network connection and now cannot communicate with phone. it says you have to use remote to remedy problem at same time it is telling me lost network connection.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Just, don't.","reviewDescription":"We bought this to be our bedroom TV, mainly for Netflix or Hulu. We have not been able to get the Smartcast to work. We've connected to the internet, restarted it, and everything and there is no \"main menu\" to get to the apps. We can use the remote buttons to go to Netflix but no Hulu, Youtube, Prime or anything. I use my Xbox for everything now so it's basically just a monitor. Lame AF.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Horrible sound","reviewDescription":"The TV was fine. Setup was very easy and the picture is nice. Then came the bad part. The sound. Oh my goodness I've never heard such tinny echoey noise. I went through all the settings and spent hours troubleshooting with no avail. I ended up buying the same brand sound bar. Which didn't come with the necessary wires. What an ordeal. Finally I have a working TV and decent sound with the sound bar, but with what I had to spend I should have just upgraded and got a better TV. Perhaps this one was just faulty. However when Googling the troubleshooting, I found this is an issue with a lot of these.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Pain to set up, picture quality just okay","reviewDescription":"Pain to set up, picture quality just okay","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Lack of security can be altered","reviewDescription":"Very bad. No security","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Nothing to unique about this Tv","reviewDescription":"Its a very nice television","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Came with screen cracked?!","reviewDescription":"Well, I settled and ordered this TV because I wanted to upgrade from the old 32\" LCD kinda Smart TV I had.  Now, I'm out of nearly $200 for over a month?! NEVER AGAIN!!  And how about I sold my old TV the same day.. So TVless and now have to wait I know what I really want like a 48\" 4K UHD mega SmartTV With Everything but the kitchen sink but I was trying to watch the budget.  Regretting that decision now.  As soon as I plug it in, this is the screen I am welcomed with... I took it right back off the TV Stand and stuck in it box.  All wrapped up nicelGet what you pay for I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1688428800000}
{"reviewTitle":"Nice picture, slow connection","reviewDescription":"Bought this for a bedroom in the RV. Very clear picture\/resolution. Only complaint is the tv operates very slow on wifi and had to setup an external ROKU to be able to stream anything.  Tried it out on several networks and still a no-go.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"constantly looses WiFi connection","reviewDescription":"I have IQFiber throughout the entire house, ALL other T\/V's work fine and are further from the router, this constantly looses internet connection and has to be restarted. going back to name brand T\/V's tired of resetting this piece of junk, DON'T BUY","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"hard to program to Dish Network","reviewDescription":"Firstly, the remote was not as pictures. It did not have Peacock or Disney as two of the buttons.  Impossible to pair with my Dishnetwork DVR and remote.  When turning on, you had to choose live TV and then choose the input EVERY time.Sorry, but it was returned the next day","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Bueno pero...","reviewDescription":"El televisor a veces se desconfigura, debo poner las claves de mis appstore cada vez que quiero ver algo y nunca he podido activar el Bluetooth","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"My tv","reviewDescription":"Just received my tv today, no big issues beside putting the stand on... it was difficult but i did it then everything was good 👍🏼","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"Tenía expectativas más altas con este televisor","reviewDescription":"Este televisor me ha dejado un poco decepcionada, ya que esperaba usarlo para ponerle videos de YouTube a mis hijas mientras realizaba mis deberes de la universidad.Vivo en Colombia y en esta parte del mundo no funciona el Smartcast, por lo tanto no puedo acceder a los servicios de YouTube en mi televisor, es muy deprimente. Solo puedo acceder a Netflix, pero a HBO, Pluto TV y demás aplicaciones no me permite el acceso.La única forma como lo he podido emplear es usando la transmisión de Chromecast de de YouTube en mi celular, es decir pongo los vídeos de YouTube en mi celular y luego transmito al televisor es la única forma como le puedo poner YouTube.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Sound quality","reviewDescription":"Decent picture but the sound quality is not what I would expect from Vizio","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"TV is nice -- but customer suppport is non-existent.","reviewDescription":"It is impossible to add any streaming channels to this TV that aren't pre-loaded by Visio.  When I asked for help on this, I got a round of information that did not apply to my model, directions to visit non-existent Visio support sites, and was eventually told by the Visio \"Chat\" AI that it was not possible to add sites (after two days of following a mixed bag of instructions from both the AI and actual humans that were even less reliable than the AI bot).Otherwise -- nice product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"hardware is fine, software is awful and makes me want a non-smart tv","reviewDescription":"the software is so bad. I never see ads anymore when I'm on my computer because I'm able to use a browser that just blocks them by default, so having to deal with ads on youtube is a nightmare. I'm not okay with it at all. The software on this tv is so clunky and you are required to grant permission for google to collect your activity data as well as a handful of other datasets from you in order to use the tv. This is not worth the price. Now I'm going to have to get an apple tv or a separate computer just so I don't have to interact with the UI on this tv, so you can go ahead and add on about $200-300 to make this an actual usable tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"Not a smart tv.","reviewDescription":"This tv is simple. No smart features. I missed voice remote and personalized home page so much. Went back to Amazon fire tv after just a couple months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Watch free function will not work","reviewDescription":"Difficult to set up, WatchFree feature won’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Annoying talkback","reviewDescription":"This TV has annoying computer voice that talks every time you change channel, turn off you name it. Not impressed with picture quality either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Freezes up","reviewDescription":"Constantly having to power cycle this thing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"I love this TV!—NOT","reviewDescription":"I love my Vizio TV! It has all the apps and is easy to figure out! It’s totally big enough for my apartment and it’s just great!1\/8\/2024 I need to more. In the last three months this tv has gone on and off internet. I thought it was Optimum and got a new modem but that helped for one day. Multiple times a day it just flakes out on me. I turn it off. Wait. Then turn it on again. Eventually it logs on. I am tired of it and when I have the $ I am buying a Sony. Shows me you get what you pay for. I am re-scoring it to a 2-star.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Incompatible w 5 G and blurry","reviewDescription":"Was on phone most of day w Xfinity who said call Vizio who informed me I had to change back to 4 G to work. Hooked up antenna only to see a worse picture than my 20 year old tv...sent back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Information Withheld","reviewDescription":"Sorry Vizio, but only 3 stars for withholding vital information. First, this model will only connect to 2.4ghz and will not connect to 5ghz. In your specification you mention that it is Wi-Fi 4 capable. Who uses this terminology? No one, but it means 2.4ghz only. Second, you cannot install the ROKU app on this TV. Yes, ROKU has an app as I just installed it on my Samsung TV. So Vizio, why not an update so we can enjoy ROKU on our TV? You get what you pay for and in this case NO 5GHZ and NO ROKU!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Complicated to operate","reviewDescription":"I am still taking time to get where I want!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"TV","reviewDescription":"Nice TV, but the sound is terrible 😟","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"READ this before buying!!!","reviewDescription":"Make sure to have a drill on hand, screwing the legs in by hand doesn’t work.Have a Roku and\/or Firestick on hand because it would NOT connect to the WiFi like the other reviews state. Other than that, it works perfectly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Speakers are awful. Remote has a delayed reaction","reviewDescription":"The picture is good, but the sound is AWFUL. It rattles like the speakers are blown, and I've never turned the volume up above 32. I guess my only solution is to purchase a sound bar. The remote control has a delayed reaction, and no matter how many times I've changed the batteries, I can't resolve this issue. I have loved my Vizio TVs in the past, but to be honest, they really should pull this product off the market and go back to the way they made TVs when I started purchasing Vizio TVs back in 2008.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Good but speakers buzz during some speech pitches by people on screen.","reviewDescription":"The speakers will buzz depending upon speech pitch and level.  It doesn't do it all the time, only depending on the speech taking place.  Annoying.  But TV is perfect in all other ways, except cheap speakers inside.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"It's just meh.","reviewDescription":"It's not horrible but it's just average at best.  Yes it's a smart TV and yes it looks pretty good.The sound is REALLY bad on my opinion.  Even if you turn the bass up all the way its still pretty much non existent. It's very laggy and slow. Biggest annoyance for me though is no Crunchyroll app.. wtf!?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Good picture\/Struggle to set up","reviewDescription":"The picture is good. Unit is very light weight and easy to move. It will not recognize our DISH receiver, after several hours, no success. Help responded quickly on 'chat' but suggestions did not help. At one point the screen went blank except an Internal Error message. TV came back on after unplugging and reconnecting to power. Works great for Netflix and other wireless apps. But still does not recognize the coaxial DISH cable. It is unit for guest bedroom, they will be watching Netflix.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Small print.","reviewDescription":"TV is fine except Vizio print is small and I am unable to find a way to enlarge it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Hardware is fine","reviewDescription":"If you use Fubo and want a better option with more control than Roku, look elsewhere. Smartcast is far worse. Every morning the TV has to relearn my network even though it says it’s connected. Then the Fubo app is buried in the Home Screen. Once you are in, there are so many flaws. You’re either in the guide or watching a program. Programs do not play in the background. No button to take you to the previous channel. No previewing channels. It’s sold as 1080p but the settings show everything is in 720p on my 1gb internet. I bought the upgraded Vizio remote for $7 off Amazon and it doesn’t help. This remote shows “guide” and “menu” buttons but both just open the settings menu.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Won't install the Xfinity Stream App","reviewDescription":"I bought this TV mostly to use as a computer monitor.  I got it setup and found that it won't install the Xfinity Stream app.  Had I known this, I wouldn't have bought the TV.  I can work around the issue by buying another Amazon Fire Stick, but I shouldn't have to.  Other brands of TVs have installed the Xfinity Stream app just fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"not pleasant to use","reviewDescription":"the menu is not intuitive, searching movies\/shows does not pull up what you want so you end up having to look up what app anything is on and searching through there, it takes longer than it should for the tv to register that you are pressing buttons on the remote. The apps on the tv are limited to what is already on it, you can't really add different apps\/services. A positive is that is very easy to stream from your phone or device onto the TV.I wouldn't recommend it, it would be a better to spend a little more on your TV and have it be a pleasant experience to use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Good for a spare room","reviewDescription":"I like this little TV but it has some weirdness about it! The volume will go mute out of the blue, have to used closed caption, and as you're switching channels it will mute. I have literally increased the volume and have no sound!!  Also, because it's a little ways from my router,sometimes the apps won't connect.  Those issues withstanding, it's not a bad little tv but wouldn't necessarily recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Eh! U get what you pay for!","reviewDescription":"Lightweight and connecting snd adding my apps was good until i tried to add netflix. It just wont open the app. As if it does not recognize it! I will have to connect my old firestick . Sucks!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Not great","reviewDescription":"This tv is just ok.  There is definitely some vibration with the sound from time to time and the remote has stopped working - now I am looking for a replacement.  I would not purchase again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Very slow and very low quality construction.","reviewDescription":"It has problems connecting and streaming over wifi, and most importantly the backlight is detached from the edges where it's supposed to be uniform. The quality issues mean that the TV is slow to boot, slow to connect\/disconnect, sometimes bugs out for no reason, and looks HILARIOUSLY bad when showing a white screen as the backlight is horrible assembled.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Do Not Buy!","reviewDescription":"The speakers are blown so do not buy this if you want to hear your TV!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Screen","reviewDescription":"My tv is not goodThe screen has problem when I switch it on","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Cool","reviewDescription":"How. How is this okay. We have this tv in a different size & it’s great, but I’m so disappointed in how it was delivered. What is this. I also expected it to come in an Amazon box. I definitely was not expecting it to be delivered in the manufacture packaging right on my front porch for the world to see.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Bummed but oh well","reviewDescription":"Got this because I needed a small TV for a specific space.Its okay but I've got 2 complaints:A. It seems that Vizio has been resting on their laurels.  When Vizio first hit the scene (at lease in my eyes) in 2007-2009 they had great TV's for the best price.  Now, 15 years later, it seems they have not continued to innovate or even keep up with the times as this TV (just like a larger one of theirs I had a couple years ago) desperately needs a faster processor.  This TV struggles to simply scroll thru its own menu.  Way too much lag!B.  The speakers on this TV are just way too weak!  When sitting 4 feet from the screen I (and my kids) need to turn it up to a minimum of 50\/100 to be able to hear it okay.  If i have my fan running to keep cool in Hawaii, then its gotta be up to at least 75\/100.  I've got a $30 Bluetooth speaker that gets way louder.  With my Hisense Roku TV, I rarely have to turn it up past 25-30\/100 and the sound is much clearer.Time to get back in the game Vizio!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"Low price low quality","reviewDescription":"The operating system on this TV is buggy and slow. It's wifi only no ethernet port and the built in wifi is so slow.The video quality is always sub par as a result. It will get you by but I feel like after 90 days this thing is about done with some light but regular use.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Nice affordable TV, a bit slow, horrible sound","reviewDescription":"Firstly, no regrets - this is very affordable, the video quality is great, and it was very easy to set up.That said, browsing the apps is a bit slow\/lagged, even volume adjustment takes a few seconds. And the sound....the sound is really bad. When I turned it up to even a low to moderate volume, the bass goes overloaded and flat\/garbled. I am not a sound snob at all but I found this very distracting, so I bought the vizio SB2021n-J6 for $99. All together, I got a nice modestly-sized TV with excellent sound for under $300, so it all worked out.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"Not what I expected","reviewDescription":"I’m always having trouble connecting to wifi even when my router is so close to the tv I’m very dissapointed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"My bedroom tv.","reviewDescription":"It has a bright picture but , it is very slow to navigate through apps and settings.  I had a Vizio in the past that I really liked , this one not so much . The remote leaves something to be desired . I won't buy another .","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Make sure to avoid the confusion","reviewDescription":"The term 1080p refer to the resolution transmission standard of TVs. not the visual resolution.  It means the device is capable of receiving signals of 1080 lines of picture in a \"progressive scan\" mode (rather than \"interlaced\" mode). But it does not guarantee that it can display it as 1920 dots per line and 1080 lines on the screen, which is the display resolution. That means that the display will be not as sharp as one specified as 1920x1080 display. This TV says \"Full HD 1080p\" but does not give the screen resolution, a yellow flag.Further, the display technology can be LCD (Liquid Chrystal Display) or LED (Light Emitting Diode). There are advantages and disadvantages to either, beyond the scope of this review.  This device advertises as LED but then proceeds to state that it is backlit by LED (a feature of LCD displays), raising questions as to which it really is.  Again, a yellow flag.I personally got burnt enough to be skeptical of fuzzy advertising, you make your own judgement.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"Decent budget TV, but nowhere near great","reviewDescription":"I purchased this TV open box. Saved a little off of the original price. I got the 40\" which is perfect for my office. Upon unboxing, I was a bit disappointed that there wasn't an Ethernet port on the TV. The TV relies on good WiFi connection, so if the room you intend to put this TV in has poor signal, choose a different TV. Setup was easy, standard for a TV. The TV is incredibly light, even with its size I can hold it with one hand. Should be very easy to mount. I find that there are times when I turn the TV on, Vizio's media streaming center (main menu) does not want to load up. I don't know if its an issue with the TV or the internet signal, but I can press a media button like Netflix, then back out of Netflix, and then the main streaming center comes up.The sound is not so good. Sounds like cheap speakers, but expected for a budget unit. Picture quality isn't terrible, but when watching football, the image gets a little blurry during high speed camera movements.This unit would be perfect for the user who wants to have something to watch while working, or for background noise. I wouldn't put this up in a living room for routine use unless you had no other options.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1642291200000}
{"reviewTitle":"Serves Its Purpose","reviewDescription":"I didn’t expect much from a TV at this price point but the last thing I expected was a flimsy base\/legs. Quality seems fine for a TV in the bedroom but if you’re not mounting in a wall bracket, you’ll need a stronger universal base.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Not a fan","reviewDescription":"Had these tvs for my kids for a few months after having them awhile the wifi decided to stop working on them (we have two other tvs Samsung brands and havnt had that issue with them). You can’t do anything with them since they are run by wifi pretty much it just shows a loading screen been trying past two days to get them to work. Will be ordering new ones.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Coax cable antenna connection failed after less than a year.","reviewDescription":"Coax cable antenna n connection failed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Not like my bigger Vizio...","reviewDescription":"This t.v. can only be used with a fire stick (or assuming also a Roku stick).....I spent hours upon hours with amazon, vizio, and my internet provider...HOURS!!! and there was NO way to get the t.v. to accept or even acknowledge my internet wifi, between 3 different businesses, 6 different tech people over 2 days, we tried everything and the only way to get this t.v. to work was by using a fire stick.  Nice now that I can use it, but went thru a lot to be able to use it, even sent the first one back because I thought there was something wrong with it, but the 2nd one did the same.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Get it if you like reconnecting to your internet every day - i.e. entering your password EVERY day","reviewDescription":"The picture is great and once you're connected to the internet, it works fine. The problem is that EVERY day when I turn it on, it says it can't find the network. Mind you the internet box is 6' away and it somehow manages to find it as soon as I \"forget\" it and re-enter the password, which, as you know, is never a fun job with a remote control. Once you get past that first experience with it every day, you're good to go. So I guess whether you get it depends on how much you enjoy re-entering your internet password every single day.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Unless you measure, go bigger !!","reviewDescription":"24 inches is not what you think in your mind. Look up the way they measure TV screens nowadays or you will be looking at a postage stamp. It's my fault but if you're in the market for a small room tv and it will be more than 6 feet away for viewing, go bigger than this.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Perfect for a small room","reviewDescription":"I purchased this to replace our outdated and dying living room TV. The response time is a bit slow, but it's nice that it has so many streaming options. The picture quality could be better, and the volume sometimes doesn't cut it. I'd recommend this for a smaller room or loft, even for a bunk area. I'm going to keep it to play video games in my playroom, but it's not so great for high-quality movies.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Cheap TV it works","reviewDescription":"Picture quality  is not so great even after adjusting, but its a cheap quality TV . Setup is annoying\/painful  and takes a quite a few minutes few minutes.  I have a Vizio 60\" from 2017 i like better as far as picture quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"No audio output","reviewDescription":"Decent TV. Good picture quality. If you download the manual it talks about having audio outputs. There are even audio settings on the TV’s menu that references this feature. However, there are no physical audio outputs on the TV itself. So this is a good buy if you plan to use the TV audio. Find another if you want to use a soundbar.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Slow, laggy, frustrating","reviewDescription":"Bought this for my kitchen to have on while I clean, cook or similar. It has a nice picture quality and sound, but it is incredibly slow and lags, making it very hard to use.After I had it set up for awhileVizeo updated the software and I found no longer find some do the or channels I had been having on in the background.I end up juts watching one channel on it because the menu items are so slow I get frustrated looking for new content. Jamie Oliver and I have gotten to know each other well!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Inputs not at pictured... but overall pretty good for the size","reviewDescription":"I bought this 24-inch TV for my 17-foot travel trailer.  I installed it and used it for two weeks.My #1 criticism is that the photo here on Amazon shows that the input jacks are on the side of the TV.  I was counting on that when I chose to order this particular TV.  They are not on the side as shown.  They are on the back.  I purchased a super flush wall mount and the jack locations created an issue for me.  I had to buy a 90-degree antenna jack adapter, a 90-degree HDMI adapter, and a two-way HDMI switch to make this work.  One of the HDMI ports was not available to me because my mounting plate covered it.  This was not supposed to be the case because the ports shown here on Amazon are on the side, not the back.Next up is the built-in Chromecast.  Turns out this feature only works if the TV is connected to the Internet.  Since my install is in my travel trailer, this is not the case.  Thus, Chromecast won't work for me at all.  I had to buy an HDMI to mini-USB cable to hardwire my phone to the TV in order to show downloaded Netflix content.All these adapters etc cost me a lot more $$ and still left me lacking in functionality that I thought I would have.With the above drawbacks noted, the TV otherwise worked well in my trailer.","isVerified":true,"ratingScore":3,"reviewReaction":"24 people found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Wi Fi card is not up to the job.  Needed to connect to cable.","reviewDescription":"I wanted to put it in a place where I can get WIFi on other devices and it did not work. Had to connect to cable. It is essentially a regular\/dumb TV","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Decent Tv with small annoyances","reviewDescription":"The tv is functional and the sound and picture quality is good enough for what I need it for. My complaints come from the “smart” aspect of the tv. I’ve only had this tv about two weeks and already have had an update that makes it harder to use my tv. It lacks some of the more niche streaming services that I use and I was happy to airplay my shows from my apple devices. Today my firmware updated mid-streaming and I no longer have the ability to use airplay. Which should have been fine because the tv has chromecast “built in” but it is also unusable. That’s where this tv loses stars for me. Half the reason I bought it was because I was tired of watching things on my phone and tablet.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Nice picture but not great for Sound bar","reviewDescription":"This model is inexpensive but the speakers are weak.  I added a soundbar which helped, but the sound quality is still not what I expected.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Works, but not Bluetooth or 5G wi-fi capable","reviewDescription":"The TV came in on time and in great condition. It looks and sounds good. However, I bought it for watching movies in my room. Since I work nights, I have to use headphones with my TV. Come to find out this TV is not Bluetooth capable (the listing clearly says it does). To add to the disappointment, it doesn't support 5 GHz wi-fi either. Since I had already disposed of the box I'm stuck with the TV now. But I thought I should share this just in case. For anyone that's interested, the model number for this TV is D40F-J09.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Box broken and tv trashed.","reviewDescription":"Now we have to deal with the return","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"kinda junkie","reviewDescription":"Stand is thin plastic junk. remote is versatile but very slow. Connections are not very good, too close together for multiple sticks. overall unit is fragile. sound bar is awkward and does not come with USB or optical cable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"The good the bad the dysfunctional","reviewDescription":"Nice lil Tech at an affordable price, does not respond to remote very well, anytime I use any of the apps pre installed with the tv it freezes and lags then pops up with an error.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"It is too small!","reviewDescription":"Do not buy it guys. Go to Walmart website and buy a 65 inch for around 200+ dollars. This one is too small but I figured I'll just keep it in the bedroom since it's a pain to return it!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Eh","reviewDescription":"The OS is crazy slow out the box and never seems to get any better so I just use it as a tv for my Xbox, it goes back to the menu when u turn it on instead of staying on the hdmi input and not sure if it’s just me but often times it turns itself on which is annoying or it will say no internet connection which isn’t that bad since I don’t have to navigate the crappy OS. Like it’s really really really bad it’s like a first gen fire stick with present day updates struggling to hold on for dear life actually I think the fire stick is slightly faster and has more apps, this thing doesn’t even have all streaming apps Crunchyroll, Funimation, HiDive the fire sticks even allow you to download 1,2 or even all 3The TV just as a TV is fine colors are vibrant and black is pretty dark about as close to true black as u can get without selling a kidney for a TV.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Not a bad tv.","reviewDescription":"I couldn't download my favorite app like I did on the Sony I bought.The Vizio was quite a bit less expensive.It would be fine in certain applications.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"TAKES 10 minutes to turn on.","reviewDescription":"my old TV was dumb. Smarter than this one which takes 10minutes to turn on. Vizio's have this issue. If i had known......","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Right out of the box - Specs Say Ethernet Port - Does NOT have an Ethernet port","reviewDescription":"I specifically bought this because the specs say it has an Ethernet port.  I guess you can't believe everything you read.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Meh","reviewDescription":"It's average for the size and price. The only thing is that it's always updating itself upon startup. Very annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Tv","reviewDescription":"The tv freezes from time to time which results me into turning it off , and then most of the time it rarely wants to power on","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Can you be disappointed and pleased at same time?","reviewDescription":"The quality of the picture and sound are good. The power cord is not long enough for outlet, and tv turns on at night by itself.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Defective screen","reviewDescription":"For the price point I wasn’t expecting top of the line but this is clearly a manufacturing error. The screen is misaligned and its edge doesn’t meet the tv frame. The backlight is shining out and you can feel the seam that should be concealed by the edge\/frame. bummer - have to package it back up for a replacement.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Works well but sometimes the audio acts up","reviewDescription":"I've had the tv for a few months now and it's worked really well besides the fact that recently the audio doesn't always line up with the picture. At first I thought that the issue was just with the service I was using but the issue has been happening on multiple services. It doesn't do it all of the time but some times during a movie the audio will stop lining up which gets annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"No Ethernet connection. Shocking","reviewDescription":"Well the tv a very long time to update and set up but once it did it looks just fine. I’m really just blown away that there isn’t an Ethernet connection. We own 11 airbnbs and this lots of TVs. I always try to hard wire the tv connection since it avoid potential router issues. No dice with this baby. It is the only tv I’ve ever purchased that doesn’t have an Ethernet port","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Sound and picture quality","reviewDescription":"The picture quality is really good, I find the sound to be kind of tinny.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Sound is poor","reviewDescription":"Nice tv, but very slow to load. The sound has a vibration from the speaker so you have to keep volume low. I ended up buying a small sound bar, and this fixed the issue. I would have sent back for replacement but we are very rural and isolated so its a big issue to send back. Other then that its has a beautiful picture and easy to follow setup.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Love!","reviewDescription":"Love this TV, however it is a bit slow turning into different channels.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"sound is TERRIBLE","reviewDescription":"Picture is great and size is perfect for my bedroom. I am handicapped or I would figure out a way to return this. My kids came from out of town to set it up for me. I read the reviews about the sound but my grown children have several Vizio and assured me they were reliable and great quality. BUT, BEWARE the sound has some real problems. The register is too low for me to hear clearly. Others had same problem on this particular problem but still continue to sell this defective model. I have an LG in the living room and it is great but it was a gift.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Vizio 40 inch smart TV","reviewDescription":"It does not come with a voice remote. It’s very difficult to search for APPS. It did not come with some of the free APPs. It was next to impossible to load new Apps on to the TV. The picture is clear. The sound is excellent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Just Don't. If you do, I warned you, and it's your own fault.","reviewDescription":"This was by far the worst television experience I have ever purchased, but as they say, you get what you pay for. I bought two, and within two hours of delivery they were both back in the box, and were prommptly returned to the UPS store the very next morning. (Tracking shows both were returned to Amazon on 1\/3\/24, but only 1 of 2 has been \"received\" as of 1\/25\/24. Update: the 2of 2 was finally \"received on  1\/26\/24. I've \"chatted\" five times with Amazon assuring me credit will be applied. Still waiting for Amazon to \"receive\" something that per UPS tracking they have had for 23 days. Then I get to wait another 5-7 days for the credit to be applied. Amazon customer service basically told me to eff off, dictated their super lame Amazon centric return policy, and to just wait out the 30 days. If I'm lucky I may get my refund sooner, but thus far nothing despite their repeated assurances.) Back to the TV, the Visio processor is painfully slow.  How slow?  Slower than molasses going uphill in the dead of winter in a bucket with a lid on it.  That's how slow.  Worse, the Visio simply won't stay on the settings you select. It turns itself off after set up forcing you to reinitiate every setting again and again. What about the picture? I really couldn't tell you. I spent all of my time repeatedly working through the menu. What about the remote?  Who cares at this point?  I couldn't get it back in the box fast enough.  I'm pleanty tech savvy, and I can easily manage all of the computers, routers, and other smart devices around my home. This Visio purchase was a complete waste of my time and money. Buyers remorse? You bet. 100% pure regret.  I don't see how anyone could possibly be expected to give this experience a positive review. Did I mention I'm still waiting for Amazon to refund my money?","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Updated: 3 stars to 1 star","reviewDescription":"I had recently moved my belongings from long-term storage and my old TV screen unfortunately cracked in the moving process. I needed to buy a new one, but was unable to spring for something super-expensive. I was drawn to this for the size and price point, and I was happy with my old VZIO model. I liked how I had the option to pay for the TV in installments, which increased the affordability for me.Setting it up was typical for new electronics — rather tedious — but once I got it set up, it was easy to log into my streaming apps. I do not have cable or play video games so I can’t speak to that, but it does seem capable.I use the TV in my bedroom and don’t need to keep the volume loud, but the sound does distort a little if I put it over 25. External speakers might fix the issue, but I don’t have any. Since I bought it in January, there have been two times in which the sound cuts off completely out of nowhere. This was annoying, but the old trick of turning it off, unplugging the power cord from the outlet, waiting a few mins, plugging the cord back in and turning the TV on worked each time. Just an inconvenience to consider.Sometimes I do have issues with the HBO app specifically, even after making sure everything is updated. I’m unsure as to why that happens.Overall, I wouldn’t use this TV in the living or family room, somewhere where it’d get a lot of constant use. But as an extra TV for the bedroom or office, it’s a good size. You get what you pay for.UPDATE 9\/2022: Please don’t buy this TV! Don’t be roped in by the low price because you’ll end up paying more in the end by buying this. The return window is a joke (less than 1 month) and I can’t in good conscience try to sell this to some sorry soul on FB Marketplace or Craigslist.ALL streaming apps are super laggy, despite a strong connection to the fastest WiFi. The SmartCast Home Screen consistently has issues loading which, you know, is kind of important if you wish to use this TV for streaming (as most customers do). The remote has buttons for Disney Plus, Netflix, Amazon Prime, Pluto TV, iHeart Radio, Tubi, and Vizio’s WatchFree Plus app, which is convenient — but only when they work! Even when the Home Screen is down, those controls only decide to function 25% of the time.Don’t settle like I did - use your money elsewhere and invest in a TV that is reliable and that will work as advertised for longer than a few months. I now realize that TVs are a major investment. LEARN FROM MY MISTAKE - I implore you!","isVerified":true,"ratingScore":1,"reviewReaction":"63 people found this helpful","country":"United States","date":1646870400000}
{"reviewTitle":"Useless and Amazon customer service is terrible","reviewDescription":"I bought this TV for my daughter's birthday on May 2. Her birthday wasn't until June 1st, so yea, my fault for buying so early. However, we were going on a couple vacations and I was trying to be ahead of the game. Anyway, we didn't actually use the TV until June 23 and I registered it with Vizio. Upon the 2nd day if using it, it disconnected from the network. I tried for an hour to get it back up and running. It wouldn't even recognize the wifi. I factory reset it, powered it down, messed with settings. Etc...  nothing. I reset the router and nothing. A few days later, reset it again and it worked.  Then 2 days after that, it disconnected again and I went through the same routine. I see that Amazon gives you a 90 day warranty. So I chatted and was told to contact the manufacturer.. seriously!? What kind of 90 day support is that? So I tried the TV again. Nothing works to get this TV to go on the network. $165 wasted. So I contact Amazon again.  I'm told that the 90 days is support.. ok I said, so if I still get support and it doesn't work, I should be able to return it. Right? Nope!! Call Vizio, I'm told again. Vizio put a ticket to help but I've heard nothing again about it. I just want to return the TV and buy my daughter a different brand TV that will cost more.. Amazon would make out on this deal, but they want to be difficult and not help a customer out. I understand the 30 day return policy but this TV is faulty and I should at least be able to return or replace.. Amazon is going down the tube and as much money as I spend .. an exception wouldn't hurt them, but it would mean a whole lot to me and a little girl who just wants to use her birthday present. Shame on Amazon for selling a faulty tv and not standing behind the product or having good customer service... I read in a lot of forums, that this TV has this known issue.. wish I knew before purchasing. So buyer beware!","isVerified":true,"ratingScore":1,"reviewReaction":"50 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Very disappointed with this tv","reviewDescription":"I recently purchased a Vizio TV and have been thoroughly disappointed with my experience. First and foremost, the picture quality is subpar. Despite claims of high definition, the images are often fuzzy and lack clarity, making it difficult to enjoy my favorite shows and movies.Additionally, the sound quality leaves much to be desired. Even with the volume turned up, the sound is muffled and lacks depth, resulting in a less immersive viewing experience.Furthermore, the build quality of the TV is questionable. It feels flimsy and cheaply made, and I worry about its durability over time. The remote control is also poorly designed and often unresponsive, making navigation a frustrating ordeal.On top of the numerous disappointments with my Vizio TV, one of the most frustrating aspects is its inability to properly run streaming apps. Despite having a strong internet connection, none of the apps I wanted to use for watching movies and videos would load reliably. Whether it's Netflix, Hulu, or any other streaming service, I constantly encountered buffering issues and error messages, rendering the TV virtually useless for its primary purpose. It's incredibly frustrating to invest in a television only to be met with constant frustration and disappointment when trying to access basic entertainment services.Overall, I regret purchasing this Vizio TV and would not recommend it to others. Save yourself the disappointment and invest in a higher-quality television from a more reputable brand.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"UHF, Tin Foil & Rabbit Ears Works Better","reviewDescription":"I expected better from Vizio. Older Vizio models on the same WiFi network have worked well for me, but model d24f-j09 is slow, and there’s a few bugs in the software.It takes on average 5 seconds for the channel guide to display, another 1.5 seconds for each channel to be highlighted as you channel surf. Up to 9 seconds before the channel selected displays.Apple AirPlay will work, but… Vizio will freeze and display a black screen if you select a different iPhone video to stream via airplay. The tv is non responsive and requires the power to be momentarily disconnected. There’s other software quirks I’ve noticed but didn’t write them down.Sound quality isn’t the best, it’s mostly fine but not for movies. I thought the Vizio soundbar SB2020n-j6 would improve sound but is all base, you’ll have to tweak the tv sound settings as there’s no presets I can find for vocal, music, or movies.The remote that comes with the tv is like most other remotes and poorly thought out with the button layout. Most people use tv remotes with one hand, this is awkward to do with the curved bottom and the numbers at the bottom of the remote. For single handed use you can’t easily press numbers with your thumb without dropping the remote. It’s a two handed remote for most people.This tv might be perfect for anyone wanting a small inexpensive tv that’s not too concerned with the issues I listed. The picture quality ain’t bad, the tv is just kinda of meh 🫤.Update: Sept 2023This Visio TV sucks. On a daily basis it locks up and stops working. It must be physically unplugged to reset it. It looses all the input options, network settings, everything…. Would rather go old school and use an analog tv.Update: March 2024Dark colors are heavily pixelated… Any movie scenes where the background is black or dark, the tv displays a heavily pixelated background.If a movie scene is filmed where the audience should see something emerging from the dark, you won’t see it on this tv. When the dragons eyes are seeing you from within the cave, you won’t know it until it breathes fire and illuminates a heavenly pixelated screen.🫤FYI - Walmart now owns Vizio. Expect more personalized ads and commercials via automatic content recognition (ACR), a kind of ad surveillance technology that is watching what you watch. 🤨","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Set up?  Impossible!","reviewDescription":"I chose this TV for it's price and the manufacturer's reputation, albeit some years back.  Received it in what looked like good condition, no beat up packaging.  All was fine until I began attempting to do the initial set up.  All it wanted was to do was get connected to my house wi-fi requiring passwords and other information.  I have never had to feed a new TV that kind of information before.  All I want to do is WATCH TV!  After a couple of days of trying to figure out how get through all this set up crap I was finally able to get on the right track of actually setting up the TV it kept asking the same questions and going in circles.  This thing is certainly NOT USER FRIENDLY.  After all this other crap now it's telling me that it can't find an HDMI-1 connection......which IS connected.  So now I have to go and buy another HDMI cable and see if that works.  Way too much trouble to go though just to be able to watch an endless stream of commercials.  PEssexA","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Maybe I got a bad one\/ BUT VIZEO MADE IT RIGHT!","reviewDescription":"I'm 67 and although not computer illiterate some of the new technology can be a challenge for me however this was incredibly easy to set up. But then I could not figure out how to get the sound on.. I watched every single video that there was about getting your sound to work troubleshooting what you could have done wrong what you need to change. Nothing worked. So I rarely ever do this but I took a chance and called them. Someone actually answered the phone and I actually had a decent conversation with this person who told me I needed to send my purchase information to a certain email which I did. I think that was 2 days ago and this afternoon I received a call from vizio. Unfortunately I was not able to take the call at the time but I will call back on friday. I'm just saying that this customer service is great and nothing like I have had  in years. I still don't know whether  they are going to help me fix his TV Thst I have only had. for about 40 days or provide ma  with a replacement or neither.But at least I've had positive experience so far.They did! Initially, they wanted me to give credit card information. Just in case I was scamming them. And I couldn't figure out how to get it in, so actually they sent me a replacement t. V trusting me to return the non-functional TV which I did. And I'm so grateful!And the reason why I couldn't return It through Amazon. Was because I had been in the hospital and By the time I got out of the hospital. I was past the 30 day return window and this is how I wound up getting the assistance.And the replacement from vizio!!","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Very Glitchy and comically slow, when it works at all","reviewDescription":"I’ve had to factory reset this tv multiple times. It’s glitchy and very slow. It has jammed up several times, during its first week with me it kept resetting itself so i had to sign into my accounts again and again. It will tell me it can’t find the network even though it shows that it’s connected. I periodically have to turn it off and then back on to restart it when it jams. It’s iffy about casting, sometimes it works, sometimes it jams up. I told customer service about this, it was a refurbished Amazon deal, and though I told them I’d already factory reset it several times. So they told me to factory reset it, so very helpful. I just gave up. I’d already thrown out the packaging by the time it started glitching so shipping it back was going to be hard anyway. At least it’s cheap, but it’s definitely cheap for a reason. The picture is good from the front but dims from slightly to the side. If you’re very patient with this special needs tv, its fine but I don’t recommend it. You can’t switch between screens very quickly, the processor is obviously junk. I checked online and these issues are common with this tv. I’ve had 2 other Vizio tvs, my oldest one is the best by far, it’s 10 years old and even now it’s far better than this one. Not going to buy a refurbished item againUpdate: when I turn the volume up or down it usually doesn’t register right away but like 3-10 seconds later the volume will start changing. If someone who doesn’t know this tries to change the volume, they’ll over press the button trying to get it to work and in 5-10 seconds it’ll get going and go way loud or way quiet.Final update: after almost three months this tv is still acting up. Some days it just won’t work and I have to unplug it for ten minutes. Then it works. I really got a bad tv. But looks like tons of people got good ones so I guess just hope you’re luckier than me :)","isVerified":true,"ratingScore":1,"reviewReaction":"29 people found this helpful","country":"United States","date":1681776000000}
{"reviewTitle":"Don't buy update","reviewDescription":"What I previously wrote about the Vizio TV (Below), I'd add that we have figured it out a bit better, and have found the setting that will take the TV to the previously used app or funsction each time it is powered up.  That helps...Previous post: This TV is too complicated for normal people who just want to watch tv.  We want a TV that allows for watching broadcast TV using an antenna, but every time you go to the input for \"Antenna\", your antenna channels are sort of available  but nearly impossible to directly access chanels, and there's all this \"watch free\" stuff mixed in.  Tons of other channels from the internet mixed in with the antenna channels making simple viewing of standard broadcast channels a difficult task.  Why (WHY!) can't the input source labled ANTENNA just have the antenna stations!?We also watch YouTubeTV, another pain in the butt with this Vizio.  The platform they give for the YTTV App is also a total pain to navigate.  You are better off with a normal TV, and just use a Chromecast.I wish I sent it back right away, but we just got the big, new antenna hooked up today and discovered these other issues out too lateEverything about setting this tv up was a pain, and trying to learn how to use it is challenging to say the least.  My partner Phyllis has even greater difficulities with it.  We will be dumping this Vizio and will likely buy another Insignia.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Absolutely HATE vizio.  garbage","reviewDescription":"Most remotes have a TV button......not Vizio.  Who needs a TV button when you can torment the customer by not being able to turn on your TV without going thru a menu every time you want to watch TV?  Press a button and wait 30 seconds for the TV to respond.  I swore I would never buy another vizio before I purchased this one.  But I thought....maybe they changed their evil ways.Out of the box, it was manageable.  TV on power up was a General Setting.  But then came the \"update\".  And everything changed.  Now instead of the TV turning on, you get a Watchfree menu that takes 30 seconds to appear.  Then you have to go through the tv guide to pick a channel.  INSANITY.  STAY AWAY FROM VIZIO.  NEVER NEVER NEVER NEVER EVER BUY A VIZIO PRODUCT UNLESS YOU DON'T MIND TYING YOUR NEW TV TO THE REAR BUMPER OF YOUR CAR AND DRIVING it TO THE OCEAN TO THROW IT IN.  NO TV BUTTON ON A TV REMOTE... HOW CAN A COMPANY BE SO STUPID?Oh by the way, you know how the white channel number shows up in the corner of the screen when you change the channels so you can know what channel you are watching?  On this piece of garbage, the channel numbers are only .25 inch tall.  Not even readable when sitting in your chair.Update may 31 2031.  Now there is no way to know what channel you are watching because they took the .25\" channel numbers off the screen.  Insanity.Update 9\/18\/2023.  5 inch black stripe in the middle of the screen.  Vizio is complete GARBAGE.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Love","reviewDescription":"It looks s exactly what I ordered and it came quickly. Once I figured out how to really work it it is truly a bang for my buck.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Very nice product for the price!","reviewDescription":"Easy to assemble the legs. Setup went smooth. Very nice picture. For the price you can’t beat it. Would buy it again!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"It works fine.","reviewDescription":"It was a gift to a senior.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Great value","reviewDescription":"Great tv for the money, don’t even hesitate for a bedroom tv","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Great little tv","reviewDescription":"24\" great little smart tv for kids rooms. I ended up buying another for the other kid. Connects to all our streaming services and they can easily search for something without having to go into each app. It connected to the Xbox easily. Lots of flexibility on personalizing it, so the kids love them. We ended up buying a larger one for the living room since these little guys were so awesome and you can't beat the price.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Beautiful screen","reviewDescription":"Easy to use, vibrant, great value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Excellent","reviewDescription":"Very happy with product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Works well","reviewDescription":"Easy to operate","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Excellent for price.","reviewDescription":"Easy to use.  Set up was also very easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Great","reviewDescription":"Bought this for our daughter and grandson they love it. The picture is fantastic  highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Happily surprised!","reviewDescription":"The picture is really good and the size was spot on.  We have only streaming channels and it can be a tiny bit slower than with cable but it's soo worth it!  The only problem is the legs are kinda flimsy so think about a wall mount for safety reasons.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Excellent picture quality but...","reviewDescription":"Bought this tv some months back and was impressed with the picture quality.  The tuner seems sensitive enough to bring in OTA signals well enough for stable picture.The only issues I have with this television is sometimes it tends to freeze.  When this happens the remote becomes inoperative and the only way to recover operation is to unplug the set for a few minutes.  Otherwise it does just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"22 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Nice TV for the money","reviewDescription":"Nice picture, works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"TV","reviewDescription":"Great picture on TV, however, the sound or volume was very low.  Looks like it needs a sound bar to improve the volume.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Very good value.","reviewDescription":"Very good picture for the price. It is Easy to set up, even with just one person. TV start up was easy to navigate through. It comes with preloaded programs to chose from, with some variety. It's readily adaptable to individual preferences. The remote is straightforward, and not overly complicated.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Cool! (Waited 2 months to review)","reviewDescription":"Like the title says, I waited about 2 months to leave a review. The TV is good for the low price. My remote works fine, I know some people have said theirs lost power after a week. I wish the settings were better, though.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Good for the price","reviewDescription":"It is very good for the price I paid but if you're used to watching oled tv it might take some getting used to to truly appreciate it.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Good tv","reviewDescription":"I really liked this tv .I didn't like the picture on it to good seemed a little blurry to me and a few others .overall though really good TV and good price .came delivered with care from mailman .was in perfect condition not a scratch on it ,nice looking tv too perfect for my bedroom ,not to big amd bulky bit ay the same  time not to small ,easy to operate ,i eas happy with this purchase","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Ordered wrong size","reviewDescription":"Tv is fine; waaay too small for room I had intended it for","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"Good Quality","reviewDescription":"Perfectly shipped and easy to set up. This is my 4th Vizio and happy with the purchase. The only feature they could have added to get a 5 would be the voice option on the remote. I have seen that on the LG brand. Considering the price, that is a reasonable expectation.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"TV seems possessed","reviewDescription":"Vizio tv repeatedly reverts to Vizio as cable provider. Only purchase this TV if you enjoy continually going to back of TV to change input plug. Vizio designed their TV’s this way!!! Very difficult to override the system but there are video’s to help😫","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Died 6 months after i purchase","reviewDescription":"We had a surge protector for our tv, and my daughter turned it on and a big spark came from the tv and stopped working. Very disappointed in the quality of the tv and how i was ignored when I tried resolving the issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"WORST TV EVER!!!  Read the other reviews.","reviewDescription":"WORST TV EVER!!!  Read the other reviews.First problem, no channels found when doing a channel scan. Tried 6 cable outlets in our house and wit didn't work. I contacted customer support and, after troubleshooting, was sent another TV. Same problem.Months later the TV got an update. No channels found on initial search. But \"find additional channels\" did find channels. Worked for one day, now it says No Video on the cable channels. But WatchFree works.When turning on the TV, it goes straight to WatchFree. You cannot use the channel up\/down button to change cable\/antenna channels.  To change cable channels you need to enter the number on the remote, which opens a keypad on the screen. You must arrow up\/down to select enter, to get to the channel.Just awful!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"NO REMOTE OR SCREWS!!","reviewDescription":"The TV might be smart, but not the folks who boxed it up. Before something is shipped, can y'all at least look to see if it's complete??? A checklist might have been useful. Item might actually work, but who knows without a remote?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"DO NOT BUY Vizio","reviewDescription":"It broke within 10 days. Initially ViZIO was wonderful to work with ( and US based CSR). Since that first call, I’ve gotten nothing but big fibs. Just told that replacement won’t get here for another 5 days. Can’t get money back unless I buy a box to mail it back ( threw out the box when we set it up, didn’t anticipate having to return it). Didn’t cost much so I got what I paid for .. crap.. Never again will I buy a TV from Vizio . Should have gone to brick and mortar… lesson learned. Replacement arrived 1\/19 and set up easily.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Stay away","reviewDescription":"Got the 24” for my daughters bedroom. From day one there was problems but they were at random times. First the remote wouldn’t work, tried 3 different brands of brand new batteries- same effect, still didn’t work. Then, couldn’t turn the tv off, every few days had to  unplug it in order to get it to power off. Then it would boot on as soon as it was plugged back in, without hitting the power button. I contemplated sending it back but since it was a holiday gift by the time she opened it, we were already past the return window. Still have problems more often than I would like to admit, had to plug it into a surge protector with a longer cord so I don’t have to keep moving the dresser it sits on just to unplug it and plug it back in. It constantly freezes up in apps. Most of the time hitting the home button seems to reset the functionality, at least for the moment. Have also ran into setting it up from scratch a few time when turning it on, not sure how it wiped out the Wi-Fi network. Not a good experience. First and last time I buy this brand!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Very light weight","reviewDescription":"If I had a do over I NEVER WOULD HAVE BOUGHT THIS TV.  I SHOULD NOT HAVE TO AGREE TO ANY TERMS OF SERVICE TO USE MY TV.  I WILL NEVER BUY ANOTHWR VISIO AGAIN. I WANT MY MONEY BACK COME AND GET THIS POS.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"It’s not worth it","reviewDescription":"I bought this tv 4 months ago and I’m already having trouble with it. There’s time when the control will stop working and it won’t work on mobile app so i have  to unplug tv because the power button won’t respond in order to get it working again.  Volume is way too low so we have to have it on 30s so it’ll be decent enough to hear.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"WEAK WI-FI CAPABILITIES, DROPS WI-FI CONSTANTLY","reviewDescription":"Don’t buy this TV - it constantly drops the wifi and then it just becomes useless. I do have reliable Wi-Fi (AT&T) that works well will all my devises: laptops, phones, IPads, two other smart TVs and others. When it connects is a good TV though, just needs to connect !  Unfortunately I waited to long to returns so more likely it will end up in the trash :-(","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"All around sucks.","reviewDescription":"So glitchy, doesn’t respond to remote commands on the app or the physical remote. Can’t watch anything on it really without it stopping 50 times throughout. Biggest regret was this purchase. Don’t waste your money or time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"system updates ruined it. in trash after 14 months or so.","reviewDescription":"System updated changed the functionality of the screen from a very simple layout to a very busy layout, and when it did so the tv became painfully slow to even change channels (like 3-5 seconds).  Second Vizio we've had go out after a comparably short time compared to TV's we've owned over 50 years. Done with the brand, never again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Glitchy","reviewDescription":"Got this because it was cheap- not worth it. Always glitches, freezes, will randomly turn off, the user experience isn’t great either on their home page. Do not recommend and want my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Horrible & Unprofessional Vizio Support Staff!","reviewDescription":"I followed the Quick Connect Set Up and received an Error Code \"unable to connect to Vizio SmartCast\" a SmartTV. I reset and tried again same error code. I contacted the online support listed on the Quick Connect Guide \"Support.vizio.com\" a chat line. The 3rd questioned wanted my credit card number. The chatline stopped and would not proceed with credit card number. I called the 1-877 listed #. Another mistake}  It took a painful hour to communicate with broken english and download updates required updates that did not load. A very unprofessional help center with loud background noise that interfered with solving my connection issue.So frustrated with Vizio Support Staff I'm ready to return product","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Keep dropping WIFI signal","reviewDescription":"Had too reconnect to WIFI  almost every time I turned set on. Would pause and freeze during streaming for up to 3 minutes, spinning circle in center of screen. May be isolated to this 1 set but replacement, Hi Sense has no problem with WIFI. Shows signal is  strong and has never paused or frozen.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Ease of use\/lack thereof","reviewDescription":"Not as good as advertised. Remote and functions are confusing, and more complex than a previous Vizio tv I had to replace. Just another reason to NOT shop on line. Pig in a poke syndrome, had I had the chance to examine this tv before I bought it I would not have done so.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Garbage","reviewDescription":"I owned this TV just over 30 days and now it does not turn on all it does is the power light just blinks. This TV went out just after the 30 return policy so this company ripped me off and now I can't return the TV. Complete garbage. Buyer beware. Vizio is 100% garbage. This TV barely lasted just over a month this TV is 100 percent garbage. This TV deserves zero stars and beware vizio will not help with the garbage they and amazon sells. This TV as absolute garbage. Absolutely trash TV and garbage vizio customer service. Should have the option to rate zero stars for this company and their product. Vizio product and customer service are garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"No Xfinity App.  One star.","reviewDescription":"Seems like a great TV at a size that's not very common. But they really should be doing everything they can to get Xfinity, the country's largest internet and cable TV provider (and owner of Peacock, NBC, Universal, etc.) to make an app on their platform. I guess it's Xfinity's choice to make the app, but it's Vizio's failure. The Xfinity Stream app is available on South Korea's LG and Samsung TVs, why not America's Vizio?That they actually tell you to cast the Xfinity app from another device or use a Roku is a little sad. \"With our TV, you have to start up an extra device to watch cable TV—you can even give Xfinity more money by renting another box!\"I did try plugging the TV directly into the wall, but it only picked up 2 digital channels and one analog channel out of the 185+ we get from Xfinity. None of them worked.Finally, the remote has six streaming-service-specific buttons Disney+, Netflix, Amazon Prime (fine) and Pluto, iHeart Radio, and Tubi (wha—?)I will be returning this for an LG or Samsung smart TV.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1670112000000}
{"reviewTitle":"Was sent a broken or defective tv","reviewDescription":"I like that my previous review was removed, vizio is garbage and so is the support. Amazon support doesn't get much better. Crazy how a rich company can be so cheap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"The fing screwwwssss","reviewDescription":"I hate the stands I am returning because the stand and screws won't screw in correctly and the TV is wobbly...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"bad quality","reviewDescription":"NEED TO RETURN THIS VIZO TV DARK LINES IN THE BOTTOM OF THE SCREEN SUDDENLY SHOWED UP SHOULD NOT BE THERE","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Stopped Working","reviewDescription":"Worked fine for a couple of weeks then would not power up.  I tried all the system resets offered by you tube and customer support.  Nothing worked and I threw away the original packaging, even though I’m still within the 69 day return period, so too bad for me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"So disappointing...","reviewDescription":"Was excited to get this based on reviews. However the TV is constantly stopping and crashing from apps to the home screen.  Shows lag for no real reason. We check the internet connecting everything else is running fine just this TV doesn't.  Regret this purchase so so much!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"DO NOT BUY THIS PRODUCT","reviewDescription":"The smart features did not work on the TV. I spent hours with their technical support to no avail. I would normally NOT purchase such an off market product but did so bc i was told the live TV feature would play my \"local\" news. DO NOT BUY THIS PRODUCT","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Worst TV ever","reviewDescription":"Do not buy this TV. Spend a couple extra dollars and get one that works. I got this for my daughters dorm and it will not connect to Wi-Fi. We have tried EVERYTHING!  Amazon replaced the TV…. Not the problem. Tried to get an Ethernet….no port. Tried to get a usb to Ethernet adapter… doesn’t work.  All of her other roommates have tvs and theirs work, a couple are Vizio too. Bottom line, this is a cheap tv that may work in perfect conditions. I have spent way too much time messing with this and sincerely wish I had researched better and not bought the lowest end tv made.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"POS.. you get what you pay for","reviewDescription":"Temperamental, forces you to use features that you do not want to use, and if you do not use them, the TV is very difficult to enjoy. Wi-Fi network is connected but the TV tells you it is not, local channels selected, but you cannot watch them unless you sign onto Watch For Free, and even then the direct to channels tNew York stations even though you enter your local ZIP Code. When you do get local TV channels to work, the TV will not allow sound to come through. Although a quality name, this particular TV is a total, POS, frustrating, and unfortunately where we have installed, we did not use it until way past the 30 days so now we are stuck with it. Free TV call me and it’s yours.!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Never again","reviewDescription":"I've bought this same model twice, and both have not worked properly.  The first would not fire up the screen after a couple of days.  The replacement (no problem with return) degraded over time, with a slow boil of troublesome issue.  It started by losing connections, then took repeated attempts to start, then required multiple \"tricks\" to get it going such as start, unplug, wait, restart, and repeat if necessary, and finally no sound.  It also always had a lot of difficulty connecting to Apple airpods.  And now it's out of warranty. Along the way the picture was fine and the sound tinny (it's a small TV; my expectations were low anyway). Should have returned before warranty expired; will never buy a Vizio again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"TV no longer turns on after barely a month","reviewDescription":"I’ve had this tv since the beginning of December, and now it won’t turn on. I’ve unplugged it, plugged it back in, used different outlets, etc. It won’t turn on. Very disappointing because I thought Vizio was a decent brand when I purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Cheap","reviewDescription":"This TV is slow and often loses the wifi. It also only plays espn in Spanish even though everything else is in English. Sorry I bought it. It's only a couple of months old and I'm probably going to throw it out.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Air play doesn’t work on cirri. Channels.","reviewDescription":"I use the spectrum app to cast tv shows, movies, etc… to my tv. Certain channels will not cast to the TV but they all work on other TV. I had the same problem with an 40 inch Vizio I bought.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Will not connect to a WPA3","reviewDescription":"This tv is not set up for a WPA3 connection in my garage. 👎🏼 Sending back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"using apps only then tv is ok — if you want to use Internet TV (IPTV) this has horrible usability","reviewDescription":"· horrible UI and Usability for IPTV or Antenna TV — it takes several clicks to get to a one click function, even when you have a \"one-click\" button like the \"watch free+\" — you can't set defaults like favorite(s) channels and have it start a your favorite channels, the IPTV Guide takes about 4 different forms and they are not easily accessible and and not at all user friendly. If you just want to use the OTA channels it is just as unfriendly and difficult. this device is not for anyone who is not well experienced with bad UI and Usability.· If you are just using it for the ports, or apps, or as a monitor then you may find it serves you just fine.· would return it if it wasn't so much trouble to do so.— UPDATE: did return tv after 3 weeks — usability\/UI is intolerable.TV was returned and replaced.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Disappointed","reviewDescription":"I’ve had a Vizio in the past that I really liked. It was a 30” smart tv and never had any problems. I tried cancelling this purchase right away but since it came anyways I thought I’d at least try it out. The system would not connect to my building WIFI right away and took multiple tries. And the WiFi in my building had just been updated so I know that wasn’t the problem. After finally connecting to my WiFi a couple hours later, the system took a half a day to update itself in order for me to be able to use it. Not worth the frustration. Remote doesn’t connect as well as it should when using the tv, some buttons need to be pressed multiple times. Definitely returning or selling.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Do NOT buy this!!!**update 8\/4** tv just completing quit working","reviewDescription":"Updating my review because I think people should know. TV barely over 1yr old. Has completely quit working!! All I have is a black screen. Contacted Vizio. They said “they know about the problem and are working to solve the issue” I said “ So this TV is useless until you fix the problem?!” She said “No worries, we’ll notify you when it’s been fixed” So all I can say is, buy ANY other TV other than this one. It’s complete junk!! Had problems at the start. Then intermittently over the year. Now it doesn’t work at all!!!!!! Bought a new TV and this one will be going to the garbage and will never buy another Vizio again. I always try to have something positive to say. So I thought really hard and came up with nothing. It was difficult\/time consuming to set up. Took almost hour to update everything. Keep doing it over and over again. Hulu doesn’t work! Hour long chat with hulu to find out there’s a “known issue with Vizio tvs “ and they’re working on it. So if want to be able to stream Hulu-this is NOT the TV for you. Also. If you lose wifi, the tv won’t do anything. You won’t even be able to switch it over to watch tv. Just has a blank grey screen saying “searching for network”. Really trying to decide if I even want to keep it. I hooked up a Roku so I could watch all my subscriptions I pay for but there’s only 2 hdmi ports so had to unplug dvd for that to work. I bought a TV that had all these apps so I could eliminate the roku and sadly, I still have to use it to watch what I want. Overpriced for what it is!!!! **4\/4\/22 update. I contacted Vizio and they sent out a “patch” and had me change the language back n forth and restart tv and now Hulu works!!! Frustrating to have to mess with all the phone calls etc and that it took them so long to fix it. But the TV works perfect now so I’m updating my review**","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1647648000000}
{"reviewTitle":"This TV is trash","reviewDescription":"DO NOT BUY!  DO NOT BUY!It's nice and cheap but NOT worth the headache.  Once it's connected to a network it will not work after being disconnected.  It will not reconnect automatically and just constantly searches for a network and does not allow you to change settings while it searches.  It took me an hour to try and put in a password to a new network just so I could access the settings to do a factory reset.  There is absolutely NO service help available.  Thank God I bought it on Amazon and can return it for free.  DO NOT BUT THIS TV!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Quality Control Seems to Have Plummeted","reviewDescription":"When I broke my original Vizio by accident, it seemed a no-brainer to replace it with a newer one. I had no idea how wrong that was going to be. The screen has a band of dark, muddled color running down the middle third of the screen. It affects everything. Highlighted text isn't consistent the way it is on other TVs. The flat gray of the photo screen is a jumbled mess of splotchy grays. Don't buy this TV. It might be fine, or you might find a few months down the line you regret the purchase when you can't return it. Whatever Vizio is doing for quality control, it isn't working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Have to have Internet to set up this tv","reviewDescription":"If you want a TV for over the air antenna tv ? This is NOT the TV for you. This TV needs an Internet connection to get past the setup menu. I had to hotspot my phone. It took about an hour to get the tv \"setup\". The TV SPIES on you and says so, it collects anything you type, search, watch, etc. Several screens pop up you have to agree to it spying on you. Every time I turn ON this TV, it takes a long time because it only cares about being hooked to the Internet and spying. I have to make it show antenna tv. Like all electronics these days, the 1st priority is to keep up with YOU and what you do with it, 2nd is actually being a TV to watch. I HATE this TV","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"This Is Not A Technologically Intelligent TV","reviewDescription":"I'm not sure what to say other than the overall experience with this TV is terrible.  It does not connect to 5G networks, it does not provide software\/apps for you to be able to connect to your own NAS. The remote has no play, fast forward, or rewind buttons so whatever app you're in either can pick up where you're attempting to navigate to or it flat out doesn't. I don't like it at all, for a smart TV - it has set me back years.  I have Non\/Smart TV's that use a firestick or Roke and work better.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"White flashing light","reviewDescription":"I wanted so much to like this TV which replaced my 28 inch RCA in my bedroom. The first one arrived and it was set up by the Comcast agent in my community. After it was off during the night and I turned it on the next morning there was a white flash of light which covered the entire screen. I thought it was a fluke until it happened every night. I planned to return it to Amazon. I ordered the exact same one again and the same thing happened.Today I returned both TVs to the local UPS store, and the agent there said that she and her husband had bought a Vizio TV and the same white flash happened. I was so happy to see my RCA pal again who is now at home. I hope people who purchase this have a better experience. I have another Vizio in my den that is about 8-years- old and not one issue. Good luck","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"I Regret Buying This TV","reviewDescription":"It's been YEARS since I've had a new TV and needed one badly. I purchased this VIZIO TV on October 11, 2023. When it arrived on October 21, 2023, I had no issues with it. I was pleased with my purchase. The picture quality was decent, the TV remote and remote app worked, and I had no issues with the installed apps. (I was disappointed that Spotify isn't included, but that's not a major deal-breaker.)However, 3 months later all of that changed. My TV remote responds slower whenever I press the buttons, the remote app doesn't work at all anymore, and after my TV automatically updated, I no longer have access to certain apps, like Movies Anywhere.It's too late for me to return this TV, so I'm heavily considering trading this TV for a better one. I'm displeased with ordering this VIZIO TV. This was my first purchase from this company. And it will be my LAST!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Internet Stability was bad but only on this device.","reviewDescription":"Internet Stability was bad but only on this device. My wifi worked well with every other device phone computer etc but the tv was having connection issues regularly. It also has a bunch of unwanted ads. I'd sometimes be startled by the sounds of the home page if i slept with the tv still on mind you im a deep sleeper who sleeps with the tv on or music playing so its pretty loud. It will also automatically bring you to the home screen if youre on hdmi trying to avoid those ads.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"poor sound quality but overall fine","reviewDescription":"The sound vibrates and hums as if the bass is too high but adjusting the bass does not help. There are no sound setting adjustments I can make that will fix it.  It happens during certain noise\/sound levels like music or sound effects.  Very annoying to me.  So far have not been able to set up a bluetooth speaker instead-don't think its bluetooth capable.  Otherwise the TV works well, good picture, no other complaints.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Long setup; Not all apps available","reviewDescription":"TV itself came in perfect condition and with everything needed. Good audio and picture quality. I found the setup process very long but not difficult. My fault for not researching, but I was surprised to find that some apps are not available and cannot be added. It is fairly inexpensive to get a Roku or Fire Stick etc. to get access, but might have changed my decision to purchase if I knew.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Vizio watch free+ and over the air channels is a “bust”!","reviewDescription":"Overall I thought this tv was going to be a good tv.  I wanted to watch over the air free tv channels and one of the latest updates now merges over the air channels in with Vizio Watchfree+ app and makes it difficult to watch JUST the over the air channels, because they are part of the WatchFree+, so when you choose the input of antenna it defaults to the Vizio WatchFree+ which means if you have internet connection it is using data for this app.  According to what other people said, this is not how it used to be, as you used to be able to choose Input of antenna and watch JUST over the air channels without having the Zivio WatchFree+ load as well.  This is cumbersome and not user friendly and freezes at times, especially if you are in an area of poor or no internet because then it just spins onscreen trying to connect.  If Vizio doesn’t address this, it makes this tv kind of useless for over the air, which is one main reason I bought it to use while camping in areas where there is little to no internet but access to over the air channels.  I do like the built in Air Play and have added a Roku stick to it which seems to work.  Picture quality is just ok unless it is a good HD channel.  Sound is tinny at best when you go higher in volume.  If it wasn’t for this debacle watching local channels I would be somewhat satisfied, but right now I wish I spent the extra money and bought a Samsung or other brand without this app issue.  Vizio - PLEASE CHANGE THIS!","isVerified":true,"ratingScore":3,"reviewReaction":"27 people found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Get what you pay for","reviewDescription":"So this TV overall it’s pretty good TV but thing is with the auto receiver and stuff like that with the remote it has a slow reaction it’s delayed when you click the button on the remote when you try to turn the volume you have to hold it down for like five seconds, and then the volume will pop up on the screen But I like the fact that when I turn on my PlayStation five, it automatically switches HDMI to the PlayStation but other than that if you want a fast TV this wouldn’t be the choice if you want TV that’s just reliable and good enough maybe something to put your kids room  or guestroom. Perfect TV.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"A mix of good and bad","reviewDescription":"We’ve had the tv for several months now.  The overall value is good and at a fair price. The picture is very good…clean, sharp, good color. The WiFi connection gets lost often and we have to unplug and replug to get it to reconnect. The Home Screen interface is slow to respond as is the volume adjustment. Also, the Home Screen is not customizable. The sound quality is shallow.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"OK for the price","reviewDescription":"I didn't expect much from this TV because of the low price and my expectations were accurate.The picture quality is fine enough but the sound quality is truly horrible, as is the remote for controlling the sound.This was supposed to be a master bedroom TV but will now go into one of the guest bedrooms while I search for a better replacement.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Not easy to switch between streaming apps and local TV stations","reviewDescription":"My main TV is a Sony OLED Bravia TV. I LOVE it. It is easy to use. There is a TV a button on the remote. If I want to watch a local TV station I select TV on remote and the stations show on the bottom of the screen. The last channel I was on immediately comes up. I can arrow left or right to change channels. This Vizio TV does not have a TV button on remote. It isn’t easy to go to TV. It’s a multi step process and is a lot of work and the last channel viewed does not come up. I will probably be returning it because of this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Problems connecting to internet","reviewDescription":"We have two fire tv's, an LG, and this vizio; as well as a full smathome setup and numerous other devices. This tv is the only device that has issues connecting to the internet. I have to make numerous attempts to get it to connect every time I turn it on. Once it's connected it works okay. It's slow, but it's also not a high end tv. I like the ease of use if you aren't struggling to connect.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Decent TV","reviewDescription":"The TV is quite nice. It has a great picture for its size, but it is a little delayed with remote commands from both the physical remote and the phone app. Screen mirroring is only available for Apple products. There are not many apps available in the Vizio app store, but there are some good ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"This is what Hitler would have sold if he had won the war.","reviewDescription":"Difficult to set up and presents a multitude of privacy waivers. If you don't agree you lose most functionality.  I have 50 years of experience as a digital computer technician and I haven't figured the setup out yet, especially after being bombarded with signing away my 4th Amendment right to privacy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"5 out of 10 times when turned on no picture or sound.","reviewDescription":"WORSE TV I'VE EVER PURCHASED.  From day one I've had nothing but problems with this tv.  When I turn it on there's often no picture.  It has to be turned off and back on around 3 to 5 times.  Around every other day it goes through a Vizio update so if you're hoping to catch something on tv like a football game, you'll have to wait until it goes through the update.  Once the update is done and it turns itself off even though it's supposed to restart and stay on, there's no sound.  I have to unplug the tv for about 30 seconds and switch the HDMI port to get it to work.  Keep in mind I've had this tv for around 2 weeks.  DO NOT BUY THIS TV.  Great price but you're buying a tv that will fail in my opinion.  JUNK!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705190400000}
{"reviewTitle":"DO NOT BUY THIS","reviewDescription":"Tested the TV before mounting it to ensure it turned on, no damage, etc.Once mounted, followed the prompts and it began updating. Walked away for a moment and BOOM. It turned off and no matter what troubleshooting I do, the SOB won’t turn on again. Vizio customer support is not available when you need them, which is endlessly frustrating. Do not buy this TV.I will now have to unmount this TV, box it up, return it, and purchase a new one. NOT a fun task.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Should have bought something else, knew it was too good to be true for the price","reviewDescription":"Took but about 3 days for the TV to start freezing, not turning on, and having other issues.For example what inspired me to write this review tonight was that the TV had 0 inputs listed when I had attempted to swap inputs. It showed the input selection box but it was completely empty this time (while normally even with nothing plugged in, there were a few inputs listed even if nothing was plugged into them.)After trying to turn the TV off, that's where it all went wrong. The tv became complete unresponsive and refused to turn back on. It took 5 to 6 times of unplugging power to finally have a successful boot but I have no idea how long this successful boot will last.My main tv is a 65\" visio that has very little to no issues, however this tv at a bargain rate of $170 for a 40\" just doesn't seem worth it for the issues it already... definitely have trusted visio in the past but I've been quite let down by this model so far....Would rather not have to return this tv but one more night of me taking 20 minutes of trying to figure out why it won't do a basic thing like swap inputs, and it's getting a full return.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Do not buy","reviewDescription":"I am disabled and bought this tv 2.5 months ago.  It was nice but as you can see the pictures now bad.  Nothing has occurred it was delivered to my home.  Everything was fine until yesterday.  I’m trying to get the seller but of course I can’t.  I spent a third of my disability check on this tv because I’m home a lot.  I don’t have the money to repair it so i have no tv now.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Has a mind of its own","reviewDescription":"This Vizio 40-inch tv is unpredictable.  I bought it to fit inside a bedroom armoire so I didn't have to look at a black hollow on my wall.  It fits exactly as I wanted.  HOWEVER, I only want to use a Firestick or over-the-air antenna for viewing.  I set it to power up to the last Input used but it only does that about 20% of the time.  It defaults to  SMARTCAST or Watchfree when powered up, both of which require wi-fi.  I don't have it connected to my wi-fi, so I get an error screen.  I don't even have the Firestick connected, yet it often defauts to HDMI-1 input.  It took about 3 weeks to just get this far.  Do not buy this if you don't want to use smart-tv functions.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"UNRELIABLE!","reviewDescription":"For the love of god buy anything else but this piece of garbage. Every 4hth time I turn this thing on it can't  detect my connected blu ray player.  I have to spend 20 minutes forcing the tv to reset multiple times before it can detect the blu ray player again. The player and cable it uses works flawlessly on my other TV so they aren't the problem.  I watch all my programs through the blu ray player so this is a major inconvenience.  It's also an ordeal to get it to connect to anything online. BUY SOMETHING ELSE! SAVE YOURSELF SOME AGGRAVATION.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Problems from the start","reviewDescription":"This TV has all the components of a great tv. It has a great picture, good sound quality, and SmartTV abilities. However, to be a great tv all of those things need to function. We’ve had issues since the second day we received this tv. The Vizio SmartTV platform is absolutely terrible. Certain applications (HBO Max for one) would cause the TV to freeze, volume couldn’t be adjusted, and we’d have to restart the tv by unplugging it. We decided, because the picture quality was so good, to opt to purchase an Amazon Firestick instead of using the Smartcast feature that comes on the TV. This seemed like a viable solution but unfortunately did not solve the issues. Because the tv defaults to Smartcast when you turn it on (despite the menu allowing you to select a different turn on input - it never saves, always reverts back to Smartcast) we still experience freezing. This happens just about every time the tv is turned off or if you try to change the input. Because we wanted to try the Firestick we missed the return window and when I spoke with Vizio’s customer service\/tech support they simply couldn’t help me. They went through the same “resolution” steps over and over and over despite me telling them I was getting the same result each time. I’m not sure if we just got a lemon or if this is is a problem that others have experienced, but I would NOT recommend or repurchase this tv. We have to unplug it multiple times per day for it to function.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1665705600000}
{"reviewTitle":"Purchased Nov 30, Failed Feb 5, 2023","reviewDescription":"Failed after 30 day return period.  Won't turn on with remote after several attempts.  When finally turns on, setting defaults to first input selection, requiring to change input back to original source.  Fails consistently over and over suddenly.  New batteries in Cox remote did not matter.Same thing happened to another Vizio 32\" TV in other room of the house purchased from Costco.  Too late to return to Costco also.  That TV would not turn on either, and only after several attempts, finally did turn on, but required reset of input to desired viewing source.  Changing batteries in Cox remote did not matter.  This TV is the third one and it is still not working properly.BOTH of these TVs are quirky at best, and so prevalent in their misbehavior that there are numerous postings on these issues on the web.  Seems to me that Vizio could have fixed these issues instead of populating the web with fix issues, that seem to me to recurring, not permanent, such as resetting the TV back to factory defaults.  This requires all your settings to be redone each time the TV is reset.  This has never happened to the many Samsung TVs we've owned over the years.UPDATE ~ March 7, 2023:Both TVs suddenly work now as they should.  No idea what happened.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Worse TV I have ever Owned","reviewDescription":"I don't normally do reviews but I have had this TV for almost a year now, and hands down it is one of the worse TV's I have ever owned.The response time the controller gives out to the tv is absolutely horrible. New batteries in the remote after taking the old batteries out, made it not even respond. The picture quality feels like something from the year 2000. My computer monitor looks and feels better than the tv itself.... Price wise both about the same.Would not recommend and will not buy another Vizio TV again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Impossible to link to Alexa Dot Speakers!","reviewDescription":"UPDATE - YES THE TV HAS BEEN RETURNED:  I bought this TV and the Echo Dot which was recommended so that I can control the TV.  Well, VIZIO TV does allow me to turn the TV on and off, but does not allow me to use the dot as a speaker!!  I've spent all evening trying to get it to use the dot as a speaker, and if I can't get it done easily tomorrow it's going back, this is ridiculous.  I went on UT for answers and everyone says that Vizio is very difficult to connect your external devices, and nowhere is there a Bluetooth setting on the VIZIO that would make it extremely simple.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"TV damaged but box wasn’t","reviewDescription":"The delivery box was  just fine, but when we took it out to install, the TV is severely damaged. No idea how that can happen.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"not usable out of box","reviewDescription":"The unit came without any instructions except putting tje legs on which I did. When powered, only wierd colors  showed up. When I entered the unit code on the side into the vizio website, it did mot recognize the code. This TV was bought to replace an identical sized 4 year old vizio which had  starting blinking but worked without problems out of the box. .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Awful Sound Quality","reviewDescription":"When using the antenna, the picture will just freeze but the sound will continue to play normally.  If you change the channel it will unfreeze the picture BUT good luck knowing what channel you are even on because they took that feature away and it no longer displays on the screen!Two months into using this tv the speakers started to buzz intermittently so I called customer service.  Did all the steps, etc. hung up and it immediately started buzzing again.  Called again the following week, did all the steps, factory reset, had to re login to all my apps etc.  Still. Buzzing.Called back to customer service, they now want to send a repair guy to my home to fix the TV.  At this point all the time I've spent dealing with this and will have to spend more time dealing with a repair guy far outweighs what I paid for this TV.  Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Lag would not recommend","reviewDescription":"This TV is less than 60 months old and there is always one sort of lag between the remote & the t.v. would not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Stopped working after 3 months!!!!","reviewDescription":"Purchased in December - stopped working in March ! 3 months lifespan, don’t waste your money. I will be disputing this and getting a refund","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Hate this TV!","reviewDescription":"Absolutely frustrating!  It can't hold onto the wifi connection and all I wanted was a TV for off-the-air monitoring of one channel!  The issue is that you can't just turn it on to watch TV.  Every single time you turn it on if makes you go through these varying screens of trying to setup wifi and accept terms of use.  I just want a TV that plays the same off-the-air channel when I turn it on!  And Vizio's online support is useless with no contact information.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"TV constantly freezes","reviewDescription":"DO NOT BUY THIS TV. YOU WILL REGRET IT. this TV constantly freezes and you and Sutton there waiting for sound and moving picture to resume. I missed the return window. This TV is awful","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Horrible user experience","reviewDescription":"You can’t download apps unless you use a firestick or something similar. I use Philo and have to spend more on another gadget to use it. Airplay constantly drops. The remote has no mic. The back button is down towards the lower portion of the remote so I’m constantly hitting the settings button that’s where most remotes put their back button. If it wasn’t mounted to my wall I would probably throw it out the window. This thing won’t last long with me. It’s a garbage user experience.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Poor quality","reviewDescription":"Sound randomly stops working.  When we use the TV for cable and shut the TV off and turn it back on later, it goes back to the TV main menu for streaming instead of taking us back to cable.  I bought this for my elderly mother and it's just too complicated for her to be changing settings etc.  Overall bad purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Go with something else. Wish I could return it still.","reviewDescription":"It is a tv and the smart function is there but is so clunky it’s aggravating to use. It randomly turns itself on from five minutes to an hour after I turn it off. I mostly use it as a monitor for my computer. I wish I’d gone with a different tv.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"This Is THE \"Smart\" TV to Get If You Want to Get Angry - a LOT!","reviewDescription":"Never have I ever regretted the purchase of any appliance in my life as I immediately regretted this Vizio \"Smart\" TV!!! It turned itself on and off. That it would turn off in the middle of programs was bad enough, but when it turned itself on after midnight and in the early morning hours, then it had to be sent back! Even before that \"Stupid\" TV unpredictability, the remote could not be muted when surfing channels, and the muting would only last for 30 seconds at most when you purposefully chose to do it. No way to see what channel you were on, or what the channel numbers were when you were surfing them. Etc., etc., etc., AD NAUSEAM! And that's just a fraction of the many \"user-unfriendly\" features of this misbegotten junk! Now that I've bought an Insignia Smart TV that works well, I'm glad I did. And I wholeheartedly suggest that you do, too!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Not User Friendly","reviewDescription":"The tv itself is lightweight and has nice picture quality however that is the extent of the positives. Setting up the tv was a nightmare. It took ages for it to find the wifi network (keep in mind that it can only connect to a 2G network and not a 5G one). Once connected, there was an error code that persisted for a while and required me to do an extensive amount of troubleshooting. One of the most disappointing features is the lack of Bluetooth, so now I’ll need to order another piece to connect my headphones. All in all, I would NOT recommend purchasing this tv.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Very limited App selection","reviewDescription":"This is a nice TV, but it fails in many ways.  The most important is that it only comes with a very limited number of Apps available.  Hence most of my streaming apps, like Spectrum TV app or Hotwire TV are not loaded and can not be added.The second biggest issue, the shear lack of any information, like a manual.  Yes, there are directions for putting on the feet and signing up for your vizio account, but thats it.  The interface is very complicated and there is nothing to assist you.Third, when signing up for the Vizio app they ask permission to monitor and save all of your tv watching history.  REALLY!  The TV does not work if you decline, just shuts down.Called customer service and they blamed the app developers.  The developers probably just refused to pay a fee to be included on the TV.  This one is going back.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"No good","reviewDescription":"It came perfectly fine in the box with no damages. However when I opened it up and proceeded to do all the settings on it, the tv started to shut off on its own. When it finely stood on it wouldn’t let me download any tv apps","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Line on screen that won’t go away","reviewDescription":"Have had this TV for less than a month and now there is this constant line going down the tv.. it does not go away. It is constant. The apps work but are slow to start. Spend a bit more and get something better","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"No way to set it up!","reviewDescription":"I turn it on, it tells me to push the menu button to start set up. THERES NO MENU BUTTON ON THE REMOTE AND NO BUTTONS ON THE TV EITHER!!!!!!! So how the frig am I supposed to connect to wifi? And try to talk to a human, good luck!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Don’t, Just Don’t","reviewDescription":"I bought this tv to use with an antenna.  When I turn it on, it looks for a wifi network. I gave to run setup to find the channels.  It SUCKS!  There is absolutely zero support from Amazon and Vizon.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Great picture, everything else leaves much to be desired.","reviewDescription":"- Picture quality: excellent- Sound: average to poor- Connectivity:  WIFI only (no wired ethernet)  -  connection is slow and fickle, requires frequent rebooting.- Apps: tons of useless junk apps.  the good ones you have to subscribe to and you don't get Spotify (only amazon music), no browser either.- Free Content: Lots of junk apps and channel. you better pay for streaming or cast shows from your smartphone- Performance: SLOW to start and requires frequent reboots (daily) as it gets stuck easily.  I have an 80 Mbps internet connection speed, which is fine for my other TV (Samsung) but barely enough for this Vizio.- Remote:  very cheaply built.  Often freezes- Casting: This is OK. it seems this TV was meant for Google casting, screen sharing or Apple AirplayOverall, this should be considered a CHEAP TV with everything that it implies...UPDATE after 6-month usage:TV still working but needs a cold reboot at least once a day.  I now see the dreaded \"500 error\", pretty much every day!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Don’t buy this","reviewDescription":"Takes forever to load and come on.Hard to navigate. I am tech savvy and experienced cord cutter and this is the worst tv I’ve ever had","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"No good!","reviewDescription":"This tv seemed ok at first, but after owning it for 2 months, I regret the purchase. It is slow, the picture is so-so, but that wouldn't bother me if it stayed on or was more user friendly.  I thought the price was nice, and plan to use it as a spare TV in my guest room. However my TV conked out so I have it my living room for now. It refuses to accept my passwords, so I'm only watching free TV with it. It shuts itself off randomly and you have to unplug it and plug it back in.Also the antenna TV part is very frustrating to use. It's so hard to change the channels or to even figure out the guide.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Bye bye Vizio","reviewDescription":"Believe the comment and do not buy. You might be like me and had a Vizio TV decade ago and this TV had the best picture quality and sound quality that was on the market but it's no longer a reality. VIZIO Is absolute \"trash\" now, the sound is terrible, it can't stay connected to the wifi for more than 20 minutes. You have to constantly reset it to factory setting. Don't buy, do yourself a favor and avoid all the troubles having to repackaged it and send it back .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Broken straight out of the Box","reviewDescription":"Cracked screen right out of the box I suggest buying your TV on the spot new in box by the time these tvs are shipped God only knows how many times it's dropped or tossed around so again my best advice is do what I did go buy one in person then check it out before you leave to make sure it's in New condition","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"It's a tv but a slow one.","reviewDescription":"I have the highest internet speed available. Watch free still buffers, all features are laggy  and slowly responding. Click an app it's gonna be awhile before it loads. Not seamless. At all graphics are okay color isn't all that great. Gaming mode works but that comes a with its own issues. Watch free basically requires you give all your data to vizio.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Can't get Firestick into the HDMI ports, other ports too close","reviewDescription":"I love vizio TV's but this one doesn't allow enough room around the two HDMI ports to get a Firestick in. It wouldn't be bad except I bought it as a gift to a person who needs to use the firestick to get a couple of apps that she watches all of the time. Unfortunately, I'll need to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Keeps making static noise and turning off","reviewDescription":"I’m extremely disappointed in this purchase… Been needing a new tv for a bit now.. Finally took the leap and bought this one and have only had it 5.5 wks and and it keeps making a static noise and shuts off.. very frustrating and can’t return or replace through Amazon since I’m past 30 day return window.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Won't connect to internet","reviewDescription":"I have only been able to use this TV about 5 times in 3 months because it is of such poor quality. The connectivity is extremely slow and movies constantly buffer. It will not connect to our 5G network or accept our Wi-Fi password. Very disappointed in how cheap it is.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Do not buy - cheap for a reason","reviewDescription":"This thing is awful. It’s cheap for a reason. The software sucks and always freezes up. The Atv forgets my WiFi name and password every time it’s turned on, requiring us to re-enter the details every time. I’d much rather spend a little more on a Samsung or Sony.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Constant problems connecting to the internet.","reviewDescription":"The TV is always loading, always failing to connect to wifi while streaming.  It is a huge headache and I would like a refund from Vizio. This tv is no good. The other Samsung TV in the same room is fine and has no problem connecting.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Is not compatible","reviewDescription":"The tv is a perfect nightmare, is not compatible’s with any system and it doesn’t have any information about it. If you want to watch the cable channel you’ll spend easy an hour trying to set up the cable and the system asking you to restart the receiver 400 times until you just give up and leave the tv on for an hour and then pop!!!you can watch cable tv and after everything you went through all of the sudden you lost the cable connection, again no cable tv. Idk how I hold myself to not making the remote control part of the screen","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Does not work","reviewDescription":"Bought two Vizio TVs, both don’t load streaming applications. After 25 minutes of a support call, they told me there was nothing I could do to fix it. Wish I had done my research, seems like a lot of other people have had this issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Inaccurately described Smart TV","reviewDescription":"Bought this Smart TV to use off of wifi. The very least I can do is hook up a DVD player with it! Will not connect to hotspots, wifi, nothing! Already burned the box so I can't return the POS","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Difficult tv if you don’t live in the USA or Canada","reviewDescription":"RF cable\/ coaxial cable placed under the the tv makes it difficult to screw the cable cord in especially being female with nails. Putting the input on tv\/ antenna it wouldn’t work. You shouldn’t have to go through all kinds of settings and loading to watch live cable. I bought this for my mom and I wish I didn’t this tv is too difficult. We finally got it worked and her not being knowledgeable pressed something now I gotta figure it out again and not realizing what I did to get it on the first time because we was trying everything. Like I said not recommend. So frustrating I just hooked he old tv back up now it on the floor in the corner","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"SCREWS DO NOT FIT","reviewDescription":"The screws provided to attach the feet to the TV do not fit in the holes.  I used lighted magnifiers and after not having success, I tried just putting the screw in the hole without the foot and it does not fit.  It’s too late to return this piece of junk so we’ll have to jury rig something.  I am SO SICK of cheap junk.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Terrible product","reviewDescription":"This tv worked 1 week shy of 3 months. The return window was only 1 month. It should be longer for electronics. I had am electrician out and he determined the tv was my problem. The voltage of the tv knocked out all TVs in my house as well as my internet and we have done without our services for 2 days. And who helps me at Amazon? No one. The return window is closed. A tv one week shy of 3 months should not go bad and knock everything out in my house. Imagine my bill for an electrician who worked here for 5 hours only to find out the tv was the problem. DO NOT BUY THIS PRODUCT!!!!!! TOTAL WASTE OF MONEY!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"The worst tv I’ve ever bought","reviewDescription":"I’ve never had a Vizio tv. First, it doesn’t offer Spotify, second it constantly drops connection, freezes, doesn’t work half the time. My onn roku tv never had these issues In the same room. Very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Very invasive setup","reviewDescription":"They basically force you to sign up for BOTH vizio and google access.  SO that they can track your useage and make sure that \"you are getting the best service\".  A rediculous invasion!!!  And I tried to opt out but you basically cannot use this TV unless you sign up to have both VIzio and Google track your useage.  After 3 times through the setup.....I give up.  Cant opt out so Im sending it back.  No more VIzios in my house!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Broken","reviewDescription":"Honestly I’ve had this Tv for a month. It would never connect to the WIFI on its own. I’d have to forget network and type my password in every time I wanted to use it.Now the screen is going out of it. Haven’t moved it, haven’t touched it. Just turned it on, and the screen is going out.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Lousy.... cheap looking product.  Horrible customerservivdd","reviewDescription":"Cheep looking product, it doesn't work ...horrible, horrible customer service.  Tried contacting customer service sent two emails and they both bounced of course after I spent an hour trying to communicate with them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Lasted 90 days, Vizio failed to provide warranty, terrible service DO NOT BUY","reviewDescription":"Support person not at all helpful, don't buy this product.  Terrible quality, broke in roughly 90 days.I will never buy another Vizio product with offshore warranty and support.Absolutely terrible.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"It's Junk","reviewDescription":"Often when I try to turn on the TV, I get a blank screen.  I have to turn it off and on several times to get the home screen.  I tried using the Prime Video button to get somewhere; I got an error notice - first in German, then in Chinese or Japanese, then in English.  The message said there was an internet connectivity issue.  I am running another TV, a cell phone, and a laptop - no connectivity issues.The response from the remote is very slow.  When I try to lower the volume I press and hold, but nothing happens.  So I press it multiple times, nothing.  Suddenly the volume drops to zero because it finally got the hint, except I don't want zero.Don't buy this television.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"The sound is really problematic","reviewDescription":"The sound is tinny.It’s inconsistent and we have to turn it up very high.Everything else is ok.Easy to set up.We have only had it for a day.We will probably keep it.Customer service seems ok.I had a couple questions and they answered quickly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Buena peroooo","reviewDescription":"Es un buen smart tv pero la compre para llevarla a rep. dom. Y resulta que fuera de usa o Canadá no tiene soporte para smartcast así que no se puede usar normalmente , si es para sacarla de eeuu mejor ni lo haga , lo peor es que en ningún lado habla de ello . Por eso le doy 3 estrella 😫","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Somewhat unhappy…","reviewDescription":"This afternoon I attempted to install this product, replacing my old TV mounted on the wall. After taking the old one down, it seems that the screws on the plate that attach to the TV, do not work in the new TV. This is ridiculous! The size of screws should be a standardized feature. Customers are inconvenienced by this type of proprietary engineering. Now, I need to find different screws or purchase a new mount system for the wall.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Decent for the money, but somewhat grainy and buggy","reviewDescription":"This was my first ever TV, and it gets the job done, but there's some notable areas where it could use improvement.pros: I love the built in chromecast, the sound is strong, and the picture is good enough.cons: After a few months of use, it sometimes freezes and doesn't respond to the remote. It also has limits on the apps you can install, meaning that I have to rely on the Chromecast to stream certain content, and the user interface is a mess - it's constantly advertising and autoplaying trailers for movies and TV shows that are on streaming platforms I don't have, but won't even let me add all of MY streaming services to the tiny ribbon of apps at the bottom of the home screen.I would probably get a Roku or something if I had it to do over again, but it's not so bad that I'm looking to get rid of it and buy something else. Still, it's worth spending a little extra money for something with a better picture, performance, and interface.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Good price but ours were defective","reviewDescription":"Size great but the sound goes in and out. Same show we have to adjust the sound every 10 minutes. First too loud, then too quiet, then too loud ect ect. If it was a once in a while defect we may let it slide but watching shows and movies are not enjoyable because we have to keep adjusting sound.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Just average","reviewDescription":"This TV was just a basic flat screen TV and I ended up returning it. And that meant weeks waiting for a refund! The crispness wasn't great and accessing common features such as bluetooth to airpods was either a pain or non-existent. It's pretty basic for the price. I upgraded to the next level and size up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Horrible parental controls","reviewDescription":"My only issue is the parental controls. I don't know how a password is ever supposed to be effective when the kids can see the numbers you type on the screen. It's a really terrible design flaw for parental controls.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Great TV for a great price, but weird sound quality.","reviewDescription":"Really great TV deal for the price. The quality is amazing and the remote work well, but the sound can get wonky and feel distorted to a point of degraded quality if the volume and bass are too loud.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Is not compatible with direct tv","reviewDescription":"I bought this because I wanted a smart tv so I wouldn't have to link a computer or firestick. But Vizio does not have access to ATT. So do not buy if you want to use direct tv","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Remote is no good","reviewDescription":"Have the new Vizio Tv only 6 months, then the remote controll just stopped working all together. Tried everything to get it going, nothing worked. Now I have to buy a new one","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Tv and sound","reviewDescription":"When I set up the TV the picture was great. But the sound was a little good until I went to set up and raise the bass and other once after that I went back to the volume and put it on 10 it sound real loud. I like it and it's Value for the money.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Had to unplug a few times","reviewDescription":"Well worth the money great buy less expensive than Walmart and Vizio is excellent. However it kept loading again and again and again and I kept unplugging it and it finally set and rebooted and worked (would say this will take about 10 minutes) and once set up did it all over again 2-3 times","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"Great Cost","reviewDescription":"I think we now have four Vizio's around the house. I love that I can screencast. I mounted this one to a wall on our outside, covered patio. I don't use it much, but when I run out of things to watch on streaming services, I got to the Watchfree option on our Vizios to find plenty more free content. They by far have the best bang for your buck.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"Good TV, but must have internet to set time","reviewDescription":"We bought a \"smart TV\" to replace our old regular TV because the best deals are on smart TVs.  This TV looks and sounds good...  Unfortunately, Vizio did not make a way to set the time on this TV unless internet is connected.  Therefore, we are stuck with the wrong time which is ridiculous.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Difficult to get TV to connect to WiFi","reviewDescription":"I bought this TV looking something that would allow me to watch TV and play my switch, nothing fancy. The only issue I've had with this TV was getting it to work with the internet in my complex. Every day for about 3 weeks it would not connect to the internet automatically and I would have to connect it manually 3-4 times before it would connect to the network. After deciding whether to return or keep, it started working properly. Just be patient with it and it should work.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1686528000000}
{"reviewTitle":"I like it so far","reviewDescription":"This is a good TV. I like the price for the size and the features that it has. The sound is good and so is the picture.  The only thing that I was disappointed by is that our cable app is not included on Vizio TVs. We've seen it drop from the Internet a few times, but I think that's more our Internet than the TV.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"40 inch tv","reviewDescription":"Love the quality","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Good smart TV","reviewDescription":"The TV is good but the processer is very slow !!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Good picture","reviewDescription":"Has great picture quality. The price for a smart tv is fantastic. It isn’t super fancy. But so far quality is good. Be aware you don’t have Alexa voice option and I know philo app isn’t compatible yet. There might be others. Definitely recommend for the price though.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Nice picture (coming from a 720p resolution 20 year old Sony).","reviewDescription":"I bought this TV to replace a smaller 20 year old Sony.  It is used in the kitchen.Nice picture (coming from a 720p resolution 20 year old Sony).  Nice feature set in terms of being 'smart'.  I was able to modify an adjustable height monitor stand that I already had so I could mount the new set.  As you can see, my kitchen cabinets limited my overall height.  I was able to mount the new sound bar underneath the tv and made a nice compact package.  Make sure you buy a set with the inputs and outputs you need.  There are many choices and the more features there are, the higher the price.  This was fine for what I needed.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1674604800000}
{"reviewTitle":"Good price and great value.","reviewDescription":"Good price point.  Decent pic and sounds ok. Fits on my cabinet in my bedroom.  Light weight and east set up.  I’m not picky but like it a lot especially for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Ok","reviewDescription":"Ok","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Me encanta","reviewDescription":"La calidad es buena y fácil de instalar","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Connects to WiFi easily","reviewDescription":"Lots of videos available","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"About the tv","reviewDescription":"It’s a good tv","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Good little TV!","reviewDescription":"My bedroom tv which was old broke right before the holidays this year, and I did not want to spend alot on a tv for our room as it is not watched that often in that room.  Got this little Vizio smart tv on a Black Friday great deal.  It came the next day and works just perfect!  Great picture, smart features are very user friendly with quick speed.  Size is perfect for the bedroom.Love Vizio tvs anyway!  Definitely a good purchase and a great deal at the time!","isVerified":true,"ratingScore":5,"reviewReaction":"22 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Vizio 32” HD TV","reviewDescription":"Picture crisp and clear. Sound good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"TV is great","reviewDescription":"The “feet” were difficult to put on and be stable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Good value","reviewDescription":"TV arrived quickly and no issues with setup. One of the better smart TV deals that you’ll find on Amazon or anywhere. Both my TVs are Vizio and I’ve been generally happy with them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Vizio Smartv","reviewDescription":"I was searching for a TV for my bedroom, and after comparing price vs benefits, I ended up getting the Vizio TV, which is the same brand we have for the sound bar in the living room.I am very satisfied with the image quality and system sound of this model.I really recommend buying this TV.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1703376000000}
