{"reviewTitle":"Won't charge apple products","reviewDescription":"Doesn't charge apple products with apple port. I can charge androids with the type c port but it doesn't work on any Apple products no matter how many wires you try. I do not recommend buying it because what's the point of having a portable charger that doesn't charge what you need it to","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Works well","reviewDescription":"It holds a charger fairly long, however I wish I knew how heavy it is. It’s portable and about the size of my iPhone. Just has weight to it. And other negative is that you have to bring the charger wires. Kind of a pain. Not being cordless. But it does work good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"It's heavy!","reviewDescription":"It works fine, but must weigh a pound. It is not something I would want to carry in my purse. I would not have bought it if I knew it was so heavy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Stopped Charging","reviewDescription":"After using it on the first day, It stopped charging, and it won't turn on even if you plug it","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Dies very quick","reviewDescription":"No good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Worked until it didnt","reviewDescription":"I got this for my trip to London. I was gone two weeks. I used it every day and re charged it twice. Since then it won’t hold a charge. I charge the battery fully and as soon as I go to charge my phone within a few minutes it’s flashing zero power. Maybe I got a faulty one. Maybe I didn’t. I won’t be buying the same one again. Maybe you won’t have the same issue as me however. Roll the dice.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1717027200000}
{"reviewTitle":"Not sure it's 30,000 mAh","reviewDescription":"I bought 3 of these to add to my collection. The chargers are fine, but I'm disappointed they don't last as long as my 26,800 mAh chargers.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Not 30,000 MAh","reviewDescription":"More like 10,000 MAh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Heavy","reviewDescription":"I like the number and combination of ports and the power. It's just heavier than I wanted.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Could be defective item.","reviewDescription":"Might've received a defective one, but it dies faster than my old 20k mah battery. Charges faster though.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"I think my battery is defective","reviewDescription":"I think mine is defective. My phone battery size is 4300. This device is a 30,000 mah. I can only charge my phone maybe twice and I'm not on my phone that much. After 1-2 charges of my phone. The portable battery is dead. It won't charge my phone anymore. It just shows flashing lights and that is it. Even after charging the device all night. I can only charge my phone a few times before the portable battery won't charge anymore. So I don't think the device is bad, but i think that i might just have a defective one. I should be able to charge my phone more than one or two times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Worked well until it overheated and melted","reviewDescription":"The product itself is great. However, there is no way to turn it on or off. If there is a cord in the port, it stays on until it drains so if you want to charge it on the go, you have to keep the cord separate which is kind of annoying seeing as though I need it on the go for baseball tournaments where we already have a lot of stuff to keep track of.The only real complaint I have is that it melted. I’m not sure what happened but I woke up and picked it up out of my nightstand and it was melted. Very scary. There’s no way to contact the company to remedy this since I purchased it a few months ago.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1723593600000}
{"reviewTitle":"Not sure if it is really 30000 mah","reviewDescription":"I bought this to help keep the phones charged during a camping trip.This thing lost power midway, after just 3 charges.Returned home and redid the experiment. Charged it full, and set the phones to charge from it.Sure enough, the charger cut out when it still had 3 (of 5) power indicator bars lit. Its lights started flashing, and the device said it was empty.Empty after charging 3 4000maH phones!I don't know if I got a dud. But this is not what I was expecting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Misleading labels.  It's not 30,000 mah","reviewDescription":"I have the previous model of these power banks and they worked flawlessly.  The new model has far less amperage than the old one and is not outputting enough power to run my camping lights.  It has about 20,000mah not 30,000 as advertised.  Overall I'm not impressed with how they made this with less outlets and far less capacity.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Capacity Not 30k, More like 15k","reviewDescription":"I have several charging bricks. Bought this one to try since it sounded like a good deal for 30k mah. It would have been, if the capacity were truly 30k mah. It's more like 15k maybe?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Not 30 000 Mah","reviewDescription":"Do not buy. This doesn't even charge my samsung galaxy s24 ultra 3 times. It will have 3 lights on but still won't get a full charge out of it and will die in no time.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Came used...","reviewDescription":"I ordered this with a lot of excitement because of good reviews. Unfortunately, the inside packaging came opened and there were signs of previous usage upon arrival. Ordered a replacement, but very disappointing first experience.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"It's no very good","reviewDescription":"I have a Samsung Galaxy S23 and in the description it says that it charges 5 times, but in reality I have only been able to charge it 2.5 times, something not so good, it does not promise what it says.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Misleading mAh or Poor Quality Control","reviewDescription":"The first unit I received was charged fully before use and was able to charge my 4500mAh phone battery twice along with a partial charge of my earbuds before being empty. That equates to about 10k mAh worth of charge. I requested a replacement that I received this week and it provided even less than that. So if you are looking for an inexpensive 10k mAh charger then this fits the bill but if you need one that can truly charge your device 6+ times this does not seem to have the advertised capacity; a trend that seems to be all to common as a I search for a quality power bank.Edit: The replacement I received did not charge my phone two full times so it was less effective than the first one.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Works very little.","reviewDescription":"Works half the time. Charges for about 10 minutes then stops. Used different cords and all ports on the device but still does not continue to charge after 10 mins. I have used a new cord even.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Doesn't  stay turned on","reviewDescription":"Wont stay on to charge","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626566400000}
{"reviewTitle":"Fast charge , not so fast","reviewDescription":"GREAT BATTERY LIFE\/ SLOOOOOOW CHARGING RATE THOUGH","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"Huge","reviewDescription":"Works well, just too bulky","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622678400000}
{"reviewTitle":"Excelente","reviewDescription":"Muy bueno!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Slow charge!","reviewDescription":"Slow charge","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609027200000}
{"reviewTitle":"Charges only one device at a time after a week of use.","reviewDescription":"The first problem was that the light stop working. Next, I noticed that my phone would tell me that it was slow charging. I thought it was my cable because it would only do it sometimes. I got a new cable and the same thing kept on happening. It turns out only one charging port works. They others don't give out enough power to charge.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"Lacking information","reviewDescription":"I received this item as a gift from my dad.  Here are my first impressions:There are no ports on the device labeled \"input\", even though the \"instructions\" claim there are 3.  The cord that comes with it fits into one of the ports, so we can surmise that is an input.  Great, now it is plugged in.  How do we know it is charging?  There is no blinky light or other such indication.  The \"instructions\" say there is a product diagram and that \"2\" is battery indicators.  Well, there is no product diagram, no photo to label where \"2\" is.I'm going to say that this is a knock off product straight from China and not from any reputable company that develops this sort of thing.  It is going back.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625961600000}
{"reviewTitle":"Worked great for a while","reviewDescription":"Absolutely loved it… for 5 months the it stopped charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1636243200000}
{"reviewTitle":"Long lasting good charger","reviewDescription":"C-port does not work !","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"Recharge","reviewDescription":"Pratique mais sent le chaud quand il recharge donc à surveiller au chargement.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Belgium","date":1703808000000}
{"reviewTitle":"Ugh","reviewDescription":"Super heavy, gets too hot and takes forever to charge. Not worth the $$.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"It's heavy","reviewDescription":"I don't care for it it takes a long time to charge and needs to be charged often.  I don't recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Powerbank","reviewDescription":"Very heavy powerbank","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Poca duración","reviewDescription":"La batería no cumple con el tiempo ni las cargas qué ofrecían en la descripción","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Useless gimmicks abound","reviewDescription":"There are 3 ways to \"input\" or charge, and one way to charge your items, all slow usb-AThe instructions claim the battery can tell what your device needs and adjusts the charge accordingly but my phone that can be turbocharged charges as slow as my kindle.The led battery status lights are very bright, you can double click the button to turn it off but that also turns the battery off. It lights up my whole bedroom trying to change my kindle.It would have been more useful to be able to use the C-usb to charge a device instead of or in addition to \"input\".  Instead you have the choice of 3 usb-A slots to charge your devices.I used a meter to see how many watts was being used to charge the battery, the micro usb-A charged at 1 watt, the usc-C charged at 5 watts. I didn't try the fire slot.The instructions have a \"product diagram\" with names and numbers but no diagram.  I don't think the manufacturer knows the names of the different usb types, they all say \"input\" or \"output\".I got this one because it seemed like a good price for a large capacity but the design doesn't make sense and it seems to be false advertising. I'm sending it back and getting a different power bank from a reputable manufacturer.","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1616112000000}
{"reviewTitle":"Sigh","reviewDescription":"I wanted to love this, but it doesn’t hold charge much. After less than an hour of having my tablet connected, it dies. This after charging the power bank fully! Kind of late to return it, but lesson learned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Usb ports are cheap","reviewDescription":"The usb ports are low quality and will stop working after a couple of months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Cable-bad quality","reviewDescription":"I bought it 2 weeks ago. I haven't used it often and the cable is already damaged. The only problem is the cable. It is bad quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Kind of disappointed","reviewDescription":"I test it on a pixel 8 pro with 5000mah on usb-c, charging from 1-100% it managed to complete 2-3\/4 charges.  The 4 indicators of charge are not right. With 2 phone charges it marked 75%, then it died trying to complete the 3rd charge with the 75% remaining.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Broke in my phone","reviewDescription":"Charging plug broke off in my phone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Es braucht ewig zum Laden.","reviewDescription":"Gut aber es benötig einen vollen Tag zum laden! Was bei aller Liebe, ja wohl nicht normal ist! Meine anderen waren immer nach ein paar Stunden komplett geladen! Diese braucht wirklich eine Ewigkeit!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1723075200000}
{"reviewTitle":"Très bien au debut","reviewDescription":"Très bien au début même si on détecte moins le niveau de charge par rapport a d autre batterie.Au bout de quelques semaines, en charge il crépite et charge moins d appareil.Par crainte de souci électrique je le retourne.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1723939200000}
{"reviewTitle":"Love it","reviewDescription":"I love this charger only down fall is my kids and husband can only use it. I have iPhone 14 plus and this powerbank doesn’t charge it through the c port I would need a converter to usb or a usb cord was hoping it charge through c port but it don’t. Works great on other devices love the battery life definitely worth the buy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1669680000000}
{"reviewTitle":"Boton hundido.","reviewDescription":"Me gusta este producto por su durabilidad hemos estado 4 dias en el monte y hemos podido cargar 3 móviles sin ningún problema y aún así no se descargó, cuando llegó a casa teníamos muy buenas expectativas de estar ante una gran compra, la pena fue que al tercer uso el botón se hundió, creo que fue mala suerte ya que sigo pensando que es un bien producto; Amazon nos ha solucionado el problema de una manera muy satisfactoria, han sido muy atentos me han reembolsado el dinero y pienso volver a comprar la misma batería es muy buena, eso sí, tiene un peso  importante comparado con las baterías tradicionales, y es algo voluminosa.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Spain","date":1659916800000}
{"reviewTitle":"Not 27000mah","reviewDescription":"I'm running 2 sets of the same USB  led grow lights for my plants, at exactly the same power off of 2 X power banks; One iniu 20,000mah and this 27000mah one....surprise surprise, this one dies before the other even though it supposedly has a higher capacity? It works and it does the job but it's not the capacity stated. I got this one because I wanted to get an extra day out of it so in that respect it's not up to scratch.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United Kingdom","date":1725062400000}
{"reviewTitle":"Un peu lourde","reviewDescription":"Lourde et grande","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Belgium","date":1701302400000}
{"reviewTitle":"Moins fiable que l'ancien modèle","reviewDescription":"Un peu déçueCharge trop lentement et se décharge viteJ'avais acheté le modèle précédent beaucoup plus fiable et encore opérationnel","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"France","date":1725062400000}
{"reviewTitle":"Trop lourde","reviewDescription":"Fait le job, mais trop massive pour être transportée avec soi je trouve. Dommages.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1725062400000}
{"reviewTitle":"Lourde, Imposante","reviewDescription":"Bonjour, je suis Copilot, un assistant virtuel. Je peux vous aider à améliorer votre avis de batterie. Voici une version plus concise et plus claire de votre avis, avec un titre:Batterie pratique pour le voyage, mais pas très performante ni solideCette batterie peut recharger quatre fois votre téléphone, mais elle a aussi des défauts. L’usb c n’est pas une sortie, donc elle ne peut pas recharger un Mac, contrairement à ce que certains avis disent. La sortie électrique est lente, la batterie est lourde et imposante. Elle est aussi fragile, le bouton ne marche plus et elle ne fonctionne plus chez moi.Pour le prix, c’est correct, mais pas exceptionnel. Par contre, elle est pratique pour le voyage, mais ne passe pas dans une sacoche, ni un sac à main, encore moins dans votre poche. Vous aurez le choix entre la porter, (cela ressemble à une brique pour être honnête, et elle glisse) ou bien dans votre sac à dos.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"France","date":1706745600000}
{"reviewTitle":"Pas terrible","reviewDescription":"Produit efficace les 3 premiers mois mais la batterie ce dégrade très vite","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1722643200000}
{"reviewTitle":"Tested capacity 12569mAh at 5 volts and 2 amps.","reviewDescription":"Weird that one USB-A port is upside-down.Two units charged full, discharged at 5 volts and 2 amps to empty, total output 12523 and 12616mAh respectively.  Average 12569, which is 63 watt-hours.  Figuring losses to make 3.7 volts from battery into 5 volts, this is actually a 20,000mAh power bank and the manufacturer lies.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Great charge capacity , but a bit heavy and needs a high capacity USB charger","reviewDescription":"Wanted this for my charge bank in my onboard roller bag , which it does well , just is a bit bigger \/ heavier than I really imagined and in order to get the unit charged rapidly I also had to but a high capacity USB charger...... That said it holds charge for a long time if it's not used ...","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Flashlight doesn't work","reviewDescription":"Flashlight does not work at all.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Died right outside of the warranty window","reviewDescription":"I purchased this in July 2021. Has been great up until a month (maybe 2) ago. I was hoping to find warranty information to get it possibly replaced because 1 of the usb ports popped out into the charger and i can hear it moving around inside the charger and then it stopped working all together. The lights turn on like it’s going to work but I can’t plug anything into the usb ports as all of them stopped working now so I decided to try a type C cable to charge my phone and that one doesn’t work either. I just found out that I am a month or 2 outside of the 18 month warranty which stinks but then I saw others saying they had a 3 year warranty. Not sure how others get 3 years but it says 18 months on the listing. If I was able to use the warranty, I’d give it more stars but it doesn’t seem very clear on how long the actual warranty is, plus, I’m not even finding a way to contact the seller either","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"Mine lasted 3 three years.  It has a nice variety of charging options & a light.","reviewDescription":"Mine lasted 3 three years.  It has a nice variety of charging options & a light.  Read the size specs better than I did - It is kinda chunky.  I thought with the light amount of use I gave it, it should have lasted longer.  It has an 18 month warranty.  I will look around for a better product on my next purchase.  Probably gave me my money's worth.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Too heavy for me","reviewDescription":"Nice features but heavier for daily usage","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Turns off on its own.","reviewDescription":"For some reason when I’m using it to charge my phone it just turns off on its own and won’t continue charging my phone. It’s almost like it just doesn’t want to charge. And it’s got almost a full battery. This is maybe the third time I’ve used it and it does this every time.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Like good amount of battery","reviewDescription":"Only problem it wont charge my phone in 15min like my fastcharger does it takes 2 hours to fully charge it will not charge my flashlight at all but it takes over a day to regularly charge my flashlight I upgraded the battery in The Flashlight","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Doesn’t hold a charge that long","reviewDescription":"It works, but I have one that 30000 and it lasts for weeks, this needs to be charged every other day on just an iPhone","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Takes to long to charge","reviewDescription":"Great device when fully charged. I little heavy so not the most portage power bank but charges quickly. The main issue is when it comes time to charge the power bank. It can take 8 hrs to charge","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"nice power bank if you use it correctly","reviewDescription":"It’s a really great power bank that lasts you many many charges, if you use it right. In order to get the best charge you have to charge it using USB-c because that’s what charges it the fastest. It charged my phone up multiple times and really quickly as well. If you’re looking for a portable charger for a trip or a whole day out this is the one. It is a bit heavy but it’s worth it.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Great charger","reviewDescription":"Charges up fast and lasts!  The only reason I deducted a star is it’s really heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Carga rápida, cable usb no tan bueno","reviewDescription":"El cargador es super rápido y bueno desafortunadamente el cable es obsoleto no es bueno para ese tipo de velocodades","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"POWER WHEN I NEED IT MOST","reviewDescription":"Enough backup power when I'm away from my regular power supply. With 30000mAh I csan't complain","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Power packs","reviewDescription":"I like the power packs. They are doing good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Seems ok, but arrived almost fully discharged","reviewDescription":"This product has a great feature set at a great price, and so far seems to work well. But it arrived almost completely discharged, somewhat concerning since every other power bank I've bought has arrived fully-charged. It quickly charged up to 100% and all the outputs seem to work fine, so I decided to keep it. Nevertheless, for awhile I'll be worrying about whether or not it has a self-discharge problem. It's a bit of stress that I don't need, but life can be like that. If the product works as advertised,  it's one of the better deals I've gotten on Amazon.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Heavy to carry but good overall","reviewDescription":"Looks good but I didn't check the weight and it's too heavy. Will save for emergencies at home when power is needed. I haven't tried but for the size and weight it probably does its job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Life saver when you on the low","reviewDescription":"I already got 3 full charge to my phone without recharging the pack.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Heavy","reviewDescription":"All fretures are as described, but it is heavy.  I didn't realize it would be this heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Useful for power outages","reviewDescription":"It’s not lightweight because it needs to store lots of energy but it has a higher mAh it will last longer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Achtung!!!!Hat nicht die Leistung, die einem versprochen wird.","reviewDescription":"Die Powerbank hat keineswegs, die angegebenen 27000 mAh,sondern max. die Hälfte davon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1716336000000}
{"reviewTitle":"To heavy and hard to return","reviewDescription":"Ordered yesterday morning and it arrived by the evening so great fast delivery, unfortunately it's way to heavy and bulky for my needs, so I need to return it.....I've returned via Amazon several times, never had an issue, but apparently to return this item I need and printer ( which I don't have) then I need to sit in and wait for a collection, which I can't really do as I work.I've done an online Amazon chat and found them extremely unhelpful.If I'd had known this was only option for return I wouldn't have purchased thos product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1701734400000}
{"reviewTitle":"Fell apart after 11 months","reviewDescription":"Very disappointing. Does a reasonable but not spectacular job - but then fell apart after around 11 months. Certainly can't recommend this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1714089600000}
{"reviewTitle":"Une prise usb ne fonctionne plus","reviewDescription":"Très bien au départ mais au bout de 4 mois une des 2 prises USB ne fonctionne plus .Je me retrouve donc à pouvoir me servir que de 1 prise .Pas cool vu le prix .D’ou les 2 étoiles .Mais sinon fait le job","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1708473600000}
{"reviewTitle":"Doesn't work properly","reviewDescription":"It's definitely not 30k MAH","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1716854400000}
{"reviewTitle":"Hat einen starken elektro\/chemischen Geruch, nach Wochen nicht nachgelassen","reviewDescription":"Hat einen starken elektro\/chemischen Geruch, nach Wochen immer noch nicht nachgelassen, habe versucht das zu reinigen.Es ist sehr ausgeprägt, selbst auf den Händen kann man nach anfassen das riechen. Gesund riecht es nicht. Das kann ich leider nicht empfehlen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1710633600000}
{"reviewTitle":"1 usb Buchse defekt","reviewDescription":"Nach nicht allzu häufiger Benutzung(Urlaub,Freizeit) ist eine USB Buchse defekt und man kann damit nicht mehr laden bedeutet im Prinzip 50% Ausfall","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1712188800000}
{"reviewTitle":"Geruch nicht auszuhalten!","reviewDescription":"Keine Ahnung wie gut oder schlecht diese Powerbank ist aber der Geruch bereitet mir Kopfschmerzen!! Stinkt super chemisch! Geht sofort zurück!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1712707200000}
{"reviewTitle":"solo me ha servido un año ,","reviewDescription":"En un principio estaba contenta ,aun que es un armatoste pero carga rápido y varias veces mi movil,ha pasado un año y ya no se carga... he probado con varios cargadores y no funciona, una pena","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Spain","date":1716595200000}
{"reviewTitle":"Keine automatische Erkennung von Angeschlossenen Geräten","reviewDescription":"Leider erkennt diese Powerbar nicht das ein angeschlossenes Gerät aktiv ist und läd es dann nach. Oder bei Anschluss einer LED Lichtleiste muss erst die Powerbar manuell eingeschaltet werden um die Leiste einzuschalten. Schade. Die Powerbar mit der Induktiven Ladung hat einen Port der solche Funktion bietet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1709424000000}
{"reviewTitle":"Dud","reviewDescription":"Stopped recharging after 2 months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"VERY SLOW","reviewDescription":"Very slow to charge. Also pretty heavy. You can find faster, lighter hi-cap batteries.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Usages","reviewDescription":"So far so good","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"agiles","reviewDescription":"muy rapido","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Great for 60 days then...","reviewDescription":"Awesome, then one of the ports breaks and falls inside. I've had 2 of these bothe the same. Then 6 months in flashlight dies. Seller not responding and too late to return.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Didnt Fast Charge","reviewDescription":"It definitely worked if you didnt need to use your phone. However, it didnt fast charge my phone, and didnt even keep up with my phone usage while it was plugged in. You have to not use your phone if you plug in to it for a recharge.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Charges slow.","reviewDescription":"I had big hopes for this 30,000mA gadget.  My 20KmA charger broke so I \"upgraded\" to this 30K device since it includes a USB-C port and claims it can charge my MacBook.  I have not tried that yet, however this Jiga 30KmA device charges terribly slow.  I've had it plugged in to a nice, large Anker charging box for almost 24 hours and it is still not fully charged.  Last week when this Jiga was at about 60%, I charged my son's iPad overnight and it went from 6% battery to 47% battery, while draining the Jiga 30KmA charger.So far everything about this Jiga 30KmA charger is underwhelming \/ underperforming.  I'm going to let it fully charge and see what it can do and will update this review accordingly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631059200000}
{"reviewTitle":"Great for power outages, but not fast charging","reviewDescription":"I have two snakes that require a stable temperature in their enclosures.  After the last power outage at my house I needed to find a away to heat their enclosures when the power goes off.  I purchased 2 of these backup power banks and 2 heating pads that work off of a USB plug...I tested both the power banks and heating pads and they worked perfectly to heat my snakes enclosures for hours.**UPDATE**:  Although the power banks last between 7-8 hours powering the portable heating pads I bought to keep my snakes warm during a power outage...once depleted the power bank takes 48 hours of continuous charging by my computer to get back up to peak power.  NOT fast charging!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1621987200000}
{"reviewTitle":"Not a fast charger","reviewDescription":"Good price point but slow  to accept a charge and slow to charge your stuff.  Even charging via usb C is slow. Also never would accept a charge via lightning like it’s supposed to. Never bothered to return. Still, if you have a few hours to spend plugged in it is a value.Update: now accepts a charge via lightning input, so that’s good.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1666396800000}
{"reviewTitle":"High capacity, slow to charge.","reviewDescription":"I genuinely like the build quality. It feels like it's well-made and not some fragile piece of junk. I charged it up completely after it arrived and then decided to test it out. My Galaxy S9 was at 33% when I plugged it in - an hour later it was only at 51%. I'm certainly not expecting it to charge in the blink of an eye, but I certainly expected it to be a little faster than this. It charges about as fast as my previous power bank charges AFTER it was damaged from the unusually cold winter we had recently(Texas).","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1634688000000}
{"reviewTitle":"Heavy to travel with","reviewDescription":"Very good , except it is heavy to travel with","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620604800000}
{"reviewTitle":"Great for travel and emergencies.","reviewDescription":"Travel and backup emergencies.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629676800000}
{"reviewTitle":"I like it","reviewDescription":"I like that I am able to charge multiple things. The only problem is the micro doesn’t work.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610064000000}
{"reviewTitle":"multiple charging mobile devices","reviewDescription":"satisfed with charging and it being mobile to charge other devices.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618444800000}
{"reviewTitle":"Good product","reviewDescription":"Well built product that charges as advertised. The flashlight is a nice touch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614729600000}
{"reviewTitle":"good charger","reviewDescription":"very pleased with this charger, ample power and good for multiple devices.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616025600000}
{"reviewTitle":"Good charger. Takes long to recharge.","reviewDescription":"Good charger! I love it. Only downside is that it takes forever to recharge","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1612224000000}
{"reviewTitle":"Muy bueno","reviewDescription":"Muy bueno pero es pesado","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1621296000000}
{"reviewTitle":"It holds power you may need in a emergency","reviewDescription":"Every needs one for the end of days","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616457600000}
{"reviewTitle":"Good","reviewDescription":"A little heavier than expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620432000000}
{"reviewTitle":"Super convenient","reviewDescription":"The battery pack is heavy BUT I charged my phone 4 times since receiving it and haven't had to charge the battery pack!So convenient to take with me in the car, to work, or wherever I am that I need a charged!Great product!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610150400000}
{"reviewTitle":"Better than expected","reviewDescription":"Product worked better than stated. Charged my Samsung 7 at least 9 times. Only wish product came with a charger cord and carry case. Would definitely recommend.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1629504000000}
{"reviewTitle":"Great charger","reviewDescription":"We used these while traveling and visiting universal studios. Always felt secure know we had a way to charge our phones.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Could use another C type port to charge 2 phones at once.","reviewDescription":"What I dislike is that I cannot charge both of my Samsung Galaxy A71 5G phones there is only 1 port to charge this model.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626480000000}
{"reviewTitle":"Emergency","reviewDescription":"We live close to a fire hazard area in SoCal. During high winds, utility company turns off power. These brownouts are unpredictable. I feel secure when I have a good backup with JIGA for our phones.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607558400000}
{"reviewTitle":"This battery charger is really outstanding for re-charging your phones.","reviewDescription":"The size and weight is something to get use too. But the charger is really outstanding.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1627344000000}
{"reviewTitle":"Item was good. But a bit heavy to carry on long walks","reviewDescription":"Is a nice product. But heavy to carry in long walks as I was planning a to use it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"well featured power bank","reviewDescription":"well featured power bankminus 1 star for no instruction manual in the box and micro usb charger cable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"🥰","reviewDescription":"Works great for camping trips when I have no where to plug in my phone","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623801600000}
{"reviewTitle":"good charger","reviewDescription":"seems to not charge with USB-C but other than that it’s amazing and practically lasts forever","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1621555200000}
{"reviewTitle":"Just WOW!","reviewDescription":"I have had several portable chargers that all eventually just wouldn’t do a full charge. This thing is awesome. Charges fast and holds its own charge a long time. It’s a gotta have!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1724457600000}
{"reviewTitle":"Robust and Reliable – JIGA 30000mAh Power Bank Exceeds Expectations","reviewDescription":"I recently purchased the JIGA 30000mAh Power Bank, which has quickly become crucial to my tech arsenal. Its massive capacity and fast charging capabilities have changed the way I manage my devices daily.One of the standout features of this power bank is its Fast Charging technology. With a 22.5W output, I've boosted my phone's battery from 15% to 60% in just 30 minutes, significantly faster than other chargers I've used. This speed is perfect for quick top-ups during busy days.The high-density polymer battery offers a high capacity and is compact, making the power bank easy to carry despite its power. I've kept my phone and other devices fully charged all day, which is essential for my work and travel..Another great feature is the versatility of having multiple ports. With three outputs and two inputs, I can charge multiple devices simultaneously. The built-in LED lights are helpful for monitoring the charge level, and the green light indicator for fast charging is a nice touch, confirming that my devices are charging quickly.Moreover, the built-in flashlight has been surprisingly helpful during my outdoor adventures and power outages, providing sufficient light when needed.Safety is also a priority with this power bank. It comes equipped with several protection features to ensure safe charging, which gives me peace of mind, especially when charging overnight.In conclusion, the JIGA 30000mAh Power Bank is an excellent choice for anyone looking for a reliable and fast charging solution. It's powerful, versatile, and safe, making it a valuable gadget for anyone’s tech collection. Plus, the customer support is responsive and helpful, adding to the overall positive experience with this product.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Well worth the purchase","reviewDescription":"We order this right after having a storm that took out our electric and ended up with dead phones. and then got it in just in time before a hurricane hit. We had our electric down for almost a week. First before the storm hit we charged it up. I actually charged up quickly. we were able to keep our phones working for days and then charged with in our car. I charged just as quickly in our car. The other two we had didn't charge as quickly and they only charged a phone once. I love that it holds enough to charge a phone several times. It does have a light which also helped during the storm. oh I also used it to be on my laptop. We are planning on getting a several more since there are 6 of us in the house.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Best thing ever!","reviewDescription":"I love this thing! It’s a brick but it holds a charge for so long and just comes in such handy. I took this with me on vacay and was able to have it out at the beach all day","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Ideal for a quick charge and more","reviewDescription":"I'm constantly on my phone doing online listings. The battery takes a hit halfway through the day, so I need to keep working and this power bank lets me do just that. I took it camping this last weekend and it was used a ton by the people in my group. The fast charge is an awesome feature.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Beautiful charger","reviewDescription":"I like the charger because it charges very fast. I wish it was a lttle lighter, because I hate to travel with heavy things, but overall, I am satisfied with my purchase. I also like that I can charge more than one phone at a time. Thank you.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"Holy molly","reviewDescription":"After a quick charge I was able to quickly charge up my tablet faster than the plug-in. I used the USB to type c and was very surprised.  Wait until I do type c to type c, my mind will be amazed. And I didn't even go below a dot mark.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Supercharger","reviewDescription":"It’s powerful!  That’s what I need. It charges up quickly and then powers up your cellphone fast, fast. !!!  It’s great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Ufffff","reviewDescription":"wow it's a super charger, it charges fast and to the maximum. It can charge phones with a C port and old ones. What I don't like is that it weighs a lot, when I bought it I thought it would be lighter. It is very big. The flashlight is good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Great when power is out","reviewDescription":"Was able to keep my phone charged after hurricane. Had no power for a week and a half. Was also able to recharge it while driving my car. It’s great for when power is out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Longevity leaves a lot to desired","reviewDescription":"Bought two of these in Jan 24. Initially very good, however, within two months one of the output ports seized to function. Time between charging as slowly decreased over time and having to put them on charge too frequently. Pity as it started off so promisingly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1720828800000}
{"reviewTitle":"Aurait pu être bien si…","reviewDescription":"Je suis informaticien et teste régulièrement tout type de produit de manière impartiale, afin de proposer le meilleur rapport qualité prix à mes clients .A savoir que tout appareil avec une batterie litium nécessite 2 a 3 charge minimum pour que toute la chimie de la batterie se fasse et qu on obtienne l autonomie annoncée , qu il faut éviter de decharger  la batterie en dessous de 30% et il faudrait dans la théorie ne pas la charger au delà de 80%.Résultat du test :Tromperie ou erreur sur la capacité énergétique déjà , 30 000mah, c’est faux, sur la batterie , il est indiqué 99.9Wh soit 20 000mah. Et après plusieurs charges, on obtiens 19 000mah.La dernier voyant ne s allume pas comme si la batterie ne pouvait recharger jusqu’à ses 100%.Coté charge, elle charge bien et la fonction PD ou CHARGE RAPIDE est bien fonctionnelle.Les connectiques ne sont pas tous présent (Apple manquant ) mais peu d importance vu que l usb-c va devenir la norme universelle.En résumé , si elle avait réellement ses 30 000mah,et qu elle pouvait charger à bloc, ça aurait été un bon produitMerci de m avoir lu","isVerified":true,"ratingScore":2,"reviewReaction":"16 people found this helpful","country":"France","date":1691539200000}
{"reviewTitle":"Bon","reviewDescription":"Tester pour un festival de 4 jours là batterie à tenue 2 jours pour une charge complète à chaque fois la batterie ne tient pas t'en que ça voir plus puissant pour un festival ou pour être sur d'avoir suffisamment de charge pour un voyage de quelques heures ne pas prendre celle ci","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1721260800000}
{"reviewTitle":"Does not maintain charge","reviewDescription":"The item is not keeping charge for long time, after two months usage. The return window is closed and I can’t return it or contact the seller, therefore, I’m giving it two stars review.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1723334400000}
{"reviewTitle":"Même pas 1 an","reviewDescription":"Acheté en juillet 2023, un port usb ne fonctionnait déjà pas . Bref je laisse passer, mais la la batterie ne charge plus alors qu’elle est pleine et que si je débranche et rebranche l’iPhone charge et 2 sec après plus rien. Ça charge plus. Franchement j’ai pas eu de bol à voir les commentaire …","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1716681600000}
{"reviewTitle":"Was working great","reviewDescription":"Worked fine for a couple chargers (3) and then just stopped charging altogether still has more than 50% charge but just doesn't seem to want to charge anything else Not sure if I recieved a dodgy one or if this is how it is for everyone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1718236800000}
{"reviewTitle":"Bereits nach 3 Wochen nicht mehr funktionsfähig","reviewDescription":"Die Powerbank hat sehr schnell geladen und es waren mehrere Vollladungen möglich. Leider hat sie aber nach 3 Wochen bereits schon nicht mehr funktioniert und war defekt.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1723075200000}
{"reviewTitle":"Chargers","reviewDescription":"We always seem to need one more charger for our devices, after purchasing this one, when I received it, I thought it was heavy and very bulky, consequently I returned it to Amazon. I’m waiting for something else that’s lighter and has more power.Gordon Quinn, Montreal","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1721001600000}
{"reviewTitle":"Hällt nicht lange, keine Füllstand-Anzeige","reviewDescription":"Keine richtige Anleitung zur Nutzung des USB C Ports, keine Entlade Anzeige, gefühlt nicht die Kapazität die es haben sollte, beim Aufladen wird oft nicht die ganze Leistung gezogen (USB Ladekabel mit Watt Anzeige und PD Support zeigt zwischendurch geringe 2-5 watt an)Würde es zurück geben falls möglich, bin aber zu spät :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1720656000000}
{"reviewTitle":"Einmal IPad aufladen und schon ist das Ding leer! Da wurde mehr versprochen als gehalten!","reviewDescription":"Nach einmal IPad aufladen sollte eine solche Powerbank nicht schon leer sein! Leider ein absoluter Fehlkauf!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1722556800000}
{"reviewTitle":"Fell apart after a few days using it away","reviewDescription":"Fell apart and couldn't use","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United Kingdom","date":1720051200000}
{"reviewTitle":"Ist okay.","reviewDescription":"Ich habe die Powerbank im Mai 2023 gekauft und seitdem viel genutzt. Also sprich: mehrfach in der Woche habe ich damit meine Geräte aufgeladen. Das war auch immer alles super. Es ging schnell und war zuverlässig. Man muss aber auch sagen, dass die Powerbank recht groß und schwer ist. In kleinen Taschen wurde es dann immer recht eng und generell dass Gewicht hat man schon deutlich gemerkt.Nicht ganz ein Jahr später ist die Powerbank jetzt auch schon a ihre Grenzen gekommen. Die Powerbank geht manchmal einfach aus und läd nicht weiter, obwohl noch 3 Punkte leuchten, also da noch ca. 50% drin sein soll. Ich wollte dann jetzt die Powerbank wieder aufladen und das hat natürlich immer seine Zeit gedauert, aber diesmal hatte ich die Powerbank 2 Tage lang angeschlossen und sie war niemals voll.Ich werde diese Powerbank nicht mehr weiter benutzen, da ich bedenken wegen der Lithium Batterie darin habe und habe mir eine andere gekauft, die sowohl dünner, als auch leichter ist.","isVerified":true,"ratingScore":3,"reviewReaction":"16 people found this helpful","country":"Germany","date":1712707200000}
{"reviewTitle":"not overly impressed","reviewDescription":"charges my Samsung  S23 3 times but so does my partners power bank which he paid 10 quid for. also his tells ya what percentage power you have left . this one doesn't.  so feel at £24 its extremely overpriced","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United Kingdom","date":1715212800000}
{"reviewTitle":"Ne tiens pas dans la durée","reviewDescription":"Hors service même pas 1 an après achat ...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1720569600000}
{"reviewTitle":"Fonctionnent encore bien après 1 an mais fausse capacité","reviewDescription":"Juste déçu, j'ai recalculé les Wh en mAh et cela ne correspond pas à l'annonce (99,16Wh diviser par 5V en sortie puis multiplier par 1000), ce qui donne 19 832 mAH et non 27 000mAH comme annoncé maintenant et 30 000 mAH il y a un an quand j'en ai acheté 2, une différence de 10 168 mAH, ce qui est énorme comme différence entre la vraie capacité et celle dans l'annonce que je trouve mensongère.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"France","date":1712707200000}
{"reviewTitle":"Good but not for a lonf time","reviewDescription":"I would say it worked always fine and the ited arrived 23.06.2023 and today is 17.08.2024. I used it every day and charged (ofc) and it worked for a year and 2 months. I guess its a good powerbank but unfortunately only for a year","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Germany","date":1723852800000}
{"reviewTitle":"Current limited.","reviewDescription":"I bought this to run a heated jacket for a long period of time. It does not do what I wanted to to do because the current output seems to be limited. Plug it in and press the on button on the jacket and it flashes then nothing.  I know the jacket works because it runs ok from a different power bank. It works ok on a heated scarf {less current needed}  Having said that it's  fine on phones and charging other power banks.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United Kingdom","date":1707091200000}
{"reviewTitle":"Läd ewig","reviewDescription":"Ich hab das Teil seid April und jetzt ist schon das laden eine Katastrophe. Hängt ewig an der  Steckdose und wird nicht voll","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Germany","date":1723593600000}
{"reviewTitle":"It feels cheap","reviewDescription":"From the day I got it, it smelled burnt, I thought it smelled like that because it was new but after 2-3 weeks it smells the same. I don't think the battery has that many mph. I'm a little worried about using the battery so it doesn't explode because of the smell","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1719446400000}
{"reviewTitle":"naja...so und so","reviewDescription":"Ich kann nicht sagen, dass es eine schlechte Powerbank ist, aber das Aufladen dauert ewig, wenn sie fast leer ist, dauert es mehr als 24 Stunden und das ist einfach nur nervig.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1720742400000}
{"reviewTitle":"TEXAS SIZE POWER BANK!!! Best one I've owned so far.","reviewDescription":"I ordered this one for two reason,1. 30000mAh is plenty for a few big smart phones and tablets. 2. Caught it during a flash sale for a VERY GOOD DEAL!! so duh...had to buy it. 3. We are planning a few camping trips so doesn't hurt to have a nice potent portable Juice pack. It's pretty bulky and has quite the mass to it so if you are planning on carrying it in the pocket make sure you have some deep ones and you wear a good belt!. But should be fine in any back pack pocket. Real estate is about the same as any Plus size smart phone out there and as thick as about 2.5 phones stacked on top of each other.I tested it with my s10+ at about 10% battery left and took about 1hr20min to fully charged and battery indicator light was still with all 5 lights on. As soon as I plug in my other phone it went to 4 lights but fully charged that one also and still had four lights. So...it's fair to say that it could handle at least up to 5 charges on one phone. I've yet to try multiples at the same time. The light is farely bright for what it is, I'd say abou 200-300 lumens...??(he'll do I know, right) enoughy to find loose change under the couch! lol. I also liked the fact that it has a lightning port as a power input to charge the device additional to the usual micro USB. One draw back and is the only thing wrong with mine and the reason for the over all 4 stars....the lightning port on mine is sitting either in too deep or has some play, I have to wiggle the cable in order for it to start charging and if the cable moves it stops. It will not hook up just by simple pluging it in, the Micro USB on the other hand...worked like a charm all the time (shown in pictures). If not it would be a SOLID 5 STARS; but hey..nothing is perfect. Other than that, this thing is awesome. I definitely recommend this JIGA power bank, and even more so if you can buy it for under $30 like I did!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1615852800000}
{"reviewTitle":"This power bank deserves 10 stars! Best price point and product, Perfect for emergencies!","reviewDescription":"I wish I could rate this higher than 5 stars!  With the full price of only $26.95, and ability to use coupons to get an even better deal, this portable USB C charger is the best deal and value among all power banks. My partner and I are Portable Charger Power Bank Connoisseurs, we have a total of about 10 power banks of various types, sizes and power output.  This is by far the biggest mAh output that we have so far, and for such a reasonable price.This Power bank is perfect for every day use, business and leisure travel, camping and emergencies.  We can charge up all of our devices quickly with the fast charging function, and still have enough battery to charge them up again once it they die, as well as still use the flashlight for hours.  You can charge multiple items simultaneously,  and use the flashlight function as well.  This is essential for a bug out bag, ruck sack, emergency kit, keep one for each vehicle and back pack.  With 2 original USB outputs to charge any type of device, as well as a USB C Input and Output to be able to quickly charge your devices or recharge your battery pack, as well as a micro USB input to be able to recharge your power bank.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Exactly What I Needed!","reviewDescription":"I use my smart devices for work and business,and sometimes I'm not near electrical outlets, so this item is extremely useful!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"Love","reviewDescription":"Heavy but works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"It stays charged soooo long!","reviewDescription":"This thing is amazing! First off I got it for less then 20 bucks it has a flashlight on it and it’s amazing I took it camping on Friday and it was still charged on Sunday I charged my phone a million times on this I haven’t had it run dead yet and I’ve had it over two weeks if your thinking of getting one of these go got it this is the best one I’ve ever had","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"5.0 out of 5 stars Value priced, meets or exceeds description, works as advertised and is a value.","reviewDescription":"I purchase several things on Amazon and was giving pretty in-depth reviews. From this point on, here's the new agenda…. if it works as advertised, is well made, meets or exceeds the description, is a value, and arrives in a fair amount of time, it will get a \"star rating\" equal to what my expectations were\/are. If it doesn't meet these criteria, then I will most definitely and descriptively tell the short comings of the products and you as a consumer will not have to go through the trouble of buying the product without some background knowledge. If the sell pulls that item and relists under another description, I will put the exact same review on the seller's feedback page. Sellers have done this a couple of times in the past, and I was true to my word then as well as now. DR","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"so far so good","reviewDescription":"Haven't had to use it yet but it charged up quickly. I live in Fl & Hurricane season is upon us.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Reliable and powerful","reviewDescription":"My favorite power bank. Powerful and versatile it charge my electronic accessories fast. Tried and true this power bank has recharged my MacBook Pro 16 and all of my drone accessories all at once. My Laptop was die. To 58 percent while I charged my drone and two high capacity batteries along with the RC2 flight controller all simultaneously. Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Great upgrade","reviewDescription":"My last generation was ok; but this is better and more useful","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"With purchasing","reviewDescription":"Great power bank and power lasts a long time. My husband I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"not bad but not perfect","reviewDescription":"a bit bulky and heavy but thats to be expected. what i didn't like was the charging lights, it's EXTREMELY hard to tell how many lights are on therefore cant tell how much battery life is left. the photo i attatched looks much better than it is in real life and still is kinda iffy. irl it looks like 4lights are on trust me.not a bad product but...i wish theyd do a better job on that part, it has a flashlight attatched to it but i honestly dont care\/need that...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Seeme like its a good one","reviewDescription":"It seems to charge efficiently","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Very good product","reviewDescription":"Like the reliability and longevity of the battery time. Charges fast also!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Love, but a little heavy","reviewDescription":"I really like this battery, it's perfect for my phone (fold 4) I've successfully used it to almost completely recharge my phone 2 times with more than 50% left. Haven't used for my kids' iPad yet but will update when I do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Hefty","reviewDescription":"Arrived partially charged. It requires half a day to fully charge. It is much bigger and heavier than the one it replaced. Have yet to use it; will update after I do.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Gran calidad precio","reviewDescription":"Con una sola carga logra cargar 5-6 veces un celular de 0-100% de batería.Lo único que no gust es que no tenga una pantalla que diga el porcentaje exacto que le queda.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Nice but heavy","reviewDescription":"Like the 2 posted….it seems heavy in weight","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"A little heavy","reviewDescription":"But it is fast. Samsung user.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Sturdy, but heavy","reviewDescription":"Love it, but heavier than other battery banks I have had.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Nice gift","reviewDescription":"Brought this for grandkids, they loved it. Use it alot already","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Good battery for a reasonable price","reviewDescription":"I wanted a portable battery to charge my phone whenever I have to take my daughter to her long appointments or whenever our family goes on long walks or travel. This battery charged my S9 5 times so what I paid for the battery is a reasonable price for the amount of charge I get. What I didn't like about this battery was that it was still flashing two dots when the battery ran out of juice to charge my phone, but I think I'll get use to it after I continue to use it. Another thing I didn't like was that it took over 9 hours to charge the battery and I wish it would take less time. The battery is pretty heavy, but it was expected.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1611446400000}
{"reviewTitle":"A lot heavier than I expected","reviewDescription":"I haven't  used it yet but my only complaint so far is how heavy it is.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630800000000}
{"reviewTitle":"Good portable power for the price","reviewDescription":"For the price, this unit functions well. It’s not 5 stars, but for the price, it’s a buy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636156800000}
{"reviewTitle":"Well constructed and holds a charge well","reviewDescription":"This is a heavy charger and flashlight that is ruggedly made and holds its charge quite well. It might be a bit heavy to lug around in a pocket.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1625529600000}
{"reviewTitle":"Great for camping","reviewDescription":"Took this camping this weekend and was a great option and charges 3 phones over two nights and was perfect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632096000000}
{"reviewTitle":"Customer support not good","reviewDescription":"The unit is good but customer support is terrible. I emailed their customer support and still hasn't gotten an answer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628035200000}
{"reviewTitle":"Good charging, size is an issue","reviewDescription":"It is a bit bulkier and heavier than expected, but it works very well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631404800000}
{"reviewTitle":"Good battery power bank","reviewDescription":"Got this for my daughter cause her phone goes dead when she has long day and school and sports. So so far so good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"Can charge 3 items","reviewDescription":"Ability to charge 3 devices at once","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1611100800000}
{"reviewTitle":"Good!","reviewDescription":"Handy and compact","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609718400000}
{"reviewTitle":"No tiene los Mah que Dice","reviewDescription":"Lo más importante para mí es un cargador móvil es que pueda cargar varias veces mi teléfono, y mi teléfono tiene una batería de 5000 mah la cual solamente llegó a cargar una vez al 100%, y dos veces 20% y luego indico que se descargó. Teniendo en cuenta el uso que le di, posiblemente tal vez tenga 10,000 o 15,000 Mah pero está cosa tiene publicidad falsa 🫠","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Misleading","reviewDescription":"I don't know if it's a dud or just my luck. I purchased this for a cross country trip, based on reviews, it should have lasted more than half a day!!! That's right, it only lasted half a day. I was able to charge (2) 5000mah devices once, plus another half way before it completely died. It had 2 lights left yet it's depleted.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Gave out without ever being used","reviewDescription":"I purchased this product not too long ago in preparation for a road trip. I charged the device at intervals over several days and monitored it closely while charging, and everything seemed fine. However, when I went to use it on my road trip, it was completely dead and never worked again. I am so disappointed. I genuinely believed the product was superior to others with all its cool features, but now I can’t even return it. Word of advice: do your research!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Bigger doesn’t mean better","reviewDescription":"I bought this May 29th I started using it around June 5th. It worked fine but stop working. I used it maybe 3 times. It doesn’t charge well, it only goes to three dots when charging. My phone was at 3% it charged to 31% then the battery died. When the other few times, it would charge my phone all the way to 100%","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Either malfunctioning or not properly built and doesn't charge enough","reviewDescription":"Upon delivery this product seemed like it was due to be a beast at keeping a few of my devices charged up when I'm on the go. But suddenly after about a week or so it seemed to slowly die down at charging so well, then within a few days it even seemed to not even completely charge up fully itself despite having all lights lit promoting that it was fully charged. Anytime I'm out and about and the time arrives that i need to use it to charge my phone, I've yet to even charge my phone by half of its battery before this thing dies. I've had faulty chargers in the past, but this one seemed like a total setup destined for doom no matter what i tried. So i guess on to the next hopefully more reliable brand...","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Does not charge","reviewDescription":"I was excited when I got it. It charged right out of the box. The second time around it charged then stopped. Let's give another chance. Let's fully charge it. Nope it does not work. I guess I will have buy something better. Now it's an expensive paper weight. I don't recommend buying this!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"DOES NOT EVEN CHARGE iPHONE ONE FULL CHARGE!","reviewDescription":"The description says 5 full charges...no way. I don't even get ONE full charge.THIS batter WILL charge your phone five full times! and then some!https:\/\/www.amazon.com\/gp\/product\/B0824RPLDR\/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Its less than 30000mAh stated capacity!","reviewDescription":"I bought this power-bank specially for a long road trip for my 5,000 mAh battery phone. My hope was at least this power-bank will charge my phone 5times or 6times... but it could barely charge my phone full twice. It battery runs down quick. Also it had a particular smell of wire burning, so be careful.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Slow charge, dies fast","reviewDescription":"I charge the battery pack for four hours (up to three LED light indicator) and was only able to charge my iPhone 14 from 13% to 70% before it ran out of charge. iPhone charger adapter gets hot trying to charge the power bank. It is not a reliable product and is a waste of power.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"One time use only","reviewDescription":"This product is not reusable. It arrived with 3 out of 5 bars. I charged it overnight, and it’s still 3 out of 5. I left it charged 1 whole day, it’s still 3 out of 5. Ripped off and fault advertisement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Too big for pockets","reviewDescription":"Too big for pockets.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632528000000}
{"reviewTitle":"long lasting battery but chargers a bit slower then I expected","reviewDescription":"long lasting battery but chargers a bit slower then I expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629072000000}
{"reviewTitle":"Good for travel","reviewDescription":"Great size for traveling on our upcoming hiking trip.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Though I have not used it but I think it will be good for my daughter","reviewDescription":"I bought for my daughter","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1630800000000}
{"reviewTitle":"Flashlight","reviewDescription":"It’s cool. Takes a while it charge. Handles multiple items. It has a flashlight!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616284800000}
{"reviewTitle":"Charges slow.","reviewDescription":"Charge slow","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1634601600000}
{"reviewTitle":"Awesome","reviewDescription":"It works amazingly. A little heavier than I was expecting but overall amazing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622937600000}
{"reviewTitle":"Does not fast charge","reviewDescription":"Beware, does NOT fast charge even though fast charging is in the product title.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"Pesa bastante","reviewDescription":"Esta buen solo que pesa bastante","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633046400000}
{"reviewTitle":"Decent","reviewDescription":"So far so good","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1630368000000}
{"reviewTitle":"Great for charging","reviewDescription":"I liked how much it could charge my phone but I have since returned it once and the flashlight just wouldn’t work on the two I’ve received. I have settled on the flashlight not working because it is still a bulky beast and can charge my phone multiple times to full without having to charge it. It is a bit inconvenient because it is like holding a brick in your hand  from the sheer size of it. I have shook it just to make sure everything was in place and heard a rattling noise but it has since gone away. Kind of concerning. There are multiple charging ports, which makes it very convenient to charge multiple devices at once.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625356800000}
{"reviewTitle":"Takes a long time to charge devices.","reviewDescription":"Power bank is heavy in comparison to others I’ve used in the past. Does NOT, DOES NOT charge iPad 8th Gen. I bought this power bank with hopes of using it especially during travel, it became more of an inconvenience than anything else because its performance was below what the manufacturers touted. Decent to recharge my old iPhone 6 several times but not the newer one 11. I really like the flashlight feature and found it useful for rummaging around in the dark in  an unfamiliar environment. Outside of that I was not “wowed” by such a high Amp equipment. Will be returning.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633305600000}
{"reviewTitle":"Works!","reviewDescription":"The product charges my iPad & Samsung tablet great. I just found that I need to purchase another USB cable that will also charge my Samsung phone. So just disappointed that it was described as Samsung compatible, which it is but doesn't mention that I need a new cable with a C end and USB on the other end.Love the flashlight feature. I purchased to take on trips with me where I might not have access to power for long periods of time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1627084800000}
{"reviewTitle":"For those looking to power a ripi","reviewDescription":"Heres my results on running a ripi with an uptime script on a 3b+Just plugged in: 1D 5MPlugged in with an External Antenna: 19H","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Works well but one charging port broke","reviewDescription":"Charging power and battery life are amazing. It charged my iPad faster than it charges plugged into the wall. However, I’ve had it for only about two months and just recently one of the charging ports broke just by trying to plug in a cord. So, works well except for that. I couldn’t return it because it had been more than 30 days.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1621555200000}
{"reviewTitle":"Very heavy for purse travel","reviewDescription":"I like that you could attach several phones and it has a flashlight","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Another travel Buddy","reviewDescription":"It charged my phone quickly and still has so much juice left. Therefore have no doubt that this could have enough power to charge other phone which could be really good for family and travel purposes.  Although the only set back is it is kind of heavy than what i have expected but still happy about this product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617580800000}
{"reviewTitle":"Muy buena la calidad del banco de carga","reviewDescription":"Carga varios veces l cell y aún continúa con vida y para ir de campamento muy bien ya q usamos una pompa  d entrada usb de aire para inflar colchones fue d mucha utilidad para 3 días  del paseo","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631318400000}
{"reviewTitle":"good charger","reviewDescription":"it had a long battery life, i wish it charged my phone faster, i haven’t had a chance to see if it can actually charge my phone as many times as it says it can but so far so good, it is a little bulky.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Above avg, lacks in #charges advertised","reviewDescription":"Other than not getting as many charges as advertised from this unit, I like it ok. I just have to be a bit more strategic in the way I use. It is probably an above average performing power bank all things considered.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Waste of money,","reviewDescription":"After having this product for approximately a month, it stop functioning. The flashlight stop working first then it refused to take charge. I used the same USB cord that was sent with it . Over a short amount of time I was no longer able to charge it or use it. It is also giving off a burnt rubber smell. I would not recommend this product. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1621555200000}
{"reviewTitle":"USB C port does not work","reviewDescription":"I bought this battery pack for a very specific reason: to charge my iPhone while I’m training out in the field for 2 weeks every other month. But the one port (USB-C) that I need to charge has not worked since I first received it. I bought and tried different USB-C to iPhone cables and none of them have worked. I’m very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1635724800000}
{"reviewTitle":"Does not charge with Type C cables","reviewDescription":"Bought it thinking it will charger my IPhone 12 Pro Max Pro with the Type C cable, but it didn’t work.  I tried 3 different cables made by Ankers and the ones that came with the iPhone and the AirPods Pro all of them with the Type C cables. Only works with USB cables. False advertising for informing that charges with Type C cables it only charges with USB.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"No sirve","reviewDescription":"Solo llegue a cargar un celular y después no funciona para nada. No prende ni la linterna. Muy malo el producto.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Too bulky and slow.","reviewDescription":"This was not the right device for me. I could live with the bulk if it were a fast charging device, but it took forever to charge my Samsung phone AND it was super heavy and just felt overall HUGE! This charger is hard to fit in a streamlined bag. Honestly, it felt like holding a squished soda can. Definitely not the right device for me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1610928000000}
{"reviewTitle":"Stop working after four months same thing happened to the first one I got","reviewDescription":"It’s terrible this is the second one and the first one stopped working after three months this one stopped working after four months I really hope that Amazon will send me another one I just stuff for Goodwill since we in my want me and my wife by a tremendous amount of things through Amazon","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1637712000000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"This charger won’t hold a charge. The photo is the amount it’s charged after 8 hours.I also realize I wasn’t paying attention but I don’t understand why the USB-C port is for charging only. I don’t want to buy USB cables anymore. It would have been fine if it actually charged but I feel scammed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1633392000000}
{"reviewTitle":"Did not charge my phone","reviewDescription":"I have a Galaxy S10. I've had my phone plugged into this charger for approx 13 hours.  I've used my phone while attempting to charge it as well.  My phone is only at 70% using this charger.  I would never recommend this to anyone. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1639440000000}
{"reviewTitle":"Poor product","reviewDescription":"I haven't tried charging anything off device yet as I am using it as a backup and not a daily charging device. I used the flashlight on it while repairing my computer for 10 minutes and the flashlight stopped working and doesn't work anymore which is honestly a minor reason I bought it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1626912000000}
{"reviewTitle":"Bulky and heavy","reviewDescription":"Unfortunately I didn't bother to charge or travel with battery. I couldn't get over the size. It weights a whopping 16oz and was bigger than my cell phone. If you are looking for a small and portable charger this isn't for you. But for those who believe bigger is better than this is right up your alley.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1617840000000}
{"reviewTitle":"Waste","reviewDescription":"This charger bank takes 15 hours to fully charge and only charges my phone one time to 80% when charged. It is bulky and heavy. Poor quality product in every way. I am returning. Disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"1.5 years and it's swollen.","reviewDescription":"A year and a half and it has to go to hazardous waste after light use and no drops.Ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"Waste of money. It stopped working in 2 days.","reviewDescription":"The worst product. It stopped working after 2 days. It is not getting charged or neither charging any devices. None of the LEDs are working currently and the flashlight is also not starting. I just used it for 2 days. Don't ever buy this product and it is a waste of your money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Do not buy!","reviewDescription":"It will only charge your phone twice before it's dead! A cheaper 10,000 mah will do the same thing and it's 5 times lighter and probably better quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Doesn’t stay on","reviewDescription":"This portable charger does not stay on. I took it on a recent trip with me, and it did not work at all to charge anything. Even after I charge the portable charger itself to separate times. I did not save the box unfortunately so it was a big waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Stopped working","reviewDescription":"It was great for maybe the first two or three months and all of a sudden it just stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Broke after one use","reviewDescription":"After one use, it stopped working. I didn’t even use it up the first full charge before the lights started flashing and would no longer charge anything or take a charge. I am disappointed in it because it came so highly recommended.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Product is the inferior\/mini version of the one advertised.","reviewDescription":"I had once bought this battery back up about a year ago, and is was pretty good. It had a total of 6 ports for connecting devices and charging. But, the NEW version which is being sold now, only has 4 ports, 2 USB and 2 Micro\/Mini.Normally this wouldnt be a big deal, but I dislike how they do not accurately state this change or have the images to show it. I returned this backup once, and I will be returning it again.The 2nd image in my review is the old product that they used to sell.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"Waste of Money","reviewDescription":"It never charged and it never charged my phone. I have a iphone x,and it never charged it. I returned it the next day","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Dañado","reviewDescription":"Me vino un puerto USB dañado. No vale. No carga. Y ya no lo puedo devolver porque estoy en otro país.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Scam","reviewDescription":"This product is nowhere close to being as advertised. It's tiny and only about a third of the size of a real 25800mAh power bank. My guess is this power bank is somewhere between 5000 and 10000 mAh. DON'T WASTE YOUR MONEY!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"Very, very, very slow charging don't waste money on this product.","reviewDescription":"Takes forever to charge an Android phone. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Not 30,000mAh","reviewDescription":"Dies super quick . Barely got my iPhone 15 charged to 80% from 0 % when battery pack was fully charged","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Do not buy","reviewDescription":"After charging 3 times, it stopped charging and stopped working.. Don't waste your money and time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"It stopped working after 4 months.","reviewDescription":"I made the final purchase last year, now at the beginning of April 2024 the product stopped working, it doesn't charge in any way, it simply stopped working, I was only using it to charge cell phones, it simply stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Does not hold a charge","reviewDescription":"After 2 months this portable charger does not hold a charge. It does not even charge a phone to 100% one time before it's own battery is dead. Don't waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Went to use the first time and the power block will not charge","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Loved at first but after 4 months doesn't work anymore","reviewDescription":"I loved this. It was great at all day sitting events for the kids but after 4 months it will no longer hold a charge. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Heavy and Lousy Battery","reviewDescription":"It’s really sad such a heavy battery has such a poor life.0 stars","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Doesn’t charge","reviewDescription":"It can hold a charge of 30% of an iPhone after charging the powerbank for a full day.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"A Dud","reviewDescription":"Full capacity shows 5 dots lite up, after 2 lites are used, with 3 lites still showing.... It stops charging.  So the actual capacity is no more than 10000.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"I paid for 4 power banks but only received 3","reviewDescription":"Since I am not getting a response to the complaint about a missing power bank I am returning all 3 and requesting a full refund for all 4 items.  Package weight was 4.3 pounds - the equivalent of 3 power packs.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Stopped working after a few months","reviewDescription":"Purchased it in February 2024 I’ve used a total of 5 times and it stopped working the light will not turn off, the unit is very hot and will not charge any devices. Would not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Quit working after 2 uses","reviewDescription":"Bought it a month ago. 1 charging slot stopped working after a week, now it never works at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Stopped working","reviewDescription":"Bought this for my husband in March. Worked great for 4 months. Now the unit itself doesn't charge so he can no longer use it to charge his phone. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Doesn't Hold Charge","reviewDescription":"After a month or so I'm now confident that this doesn't live up to its promises or it's description. Mine does not hold its charge. After a full charge I have had the power bank be depleted in under 15 minutes just charging an iPhone. I did the full charge out of the box like the instructions said and I've noticed it has been happening. At first I thought it might just need time but nope. It still happens.I do not recommend this product as it has false advertising.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Stops charging after 1 hour of use","reviewDescription":"Stops charging after 1 hour of being used even when the portable charger says it's fully charged.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Used","reviewDescription":"So far it works. However, it looks used and wasn’t properly packed up!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"This battery is CRAP","reviewDescription":"Fully charged after receiving this supposed 30 mah batteryI'm really pissed ,it only charged my phone 37% ,I could of bought one for $8. To that instead of $25. On sale.Why does Amazon keep recommending these crappy products","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"This was a waste of money","reviewDescription":"I ordered this product back in February 2024 I paid $20 for it because of the good reviews and comments maybe I received a defective one because this does not hold a charge and I’ve had it on the charger for a day. Since it wasn’t working I completely forgot to send it back this is yet another useless power bank so be careful when ordering this charger","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Type C port does not work","reviewDescription":"Type c does not works if not plugged if power not plugged into charger. This is the 2nd charger I receive and Type C port does not work properly !!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620604800000}
{"reviewTitle":"Buy the cords that you will need separately","reviewDescription":"I do not like the fact that the description reads that this product can be used for several different types of phones, iPad, iphone, etc but only comes with one cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618531200000}
{"reviewTitle":"Takes all day to recharge and does not charge fast","reviewDescription":"It takes about 8 to 10 hours to recharge this product and it Does Not charge things quickly! It's thick, big, bulky and heavy for it's size.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"Only the USB ports work, the USB-C port does not work using an Apple lightning cable.","reviewDescription":"The USB-C port does not charge or power my iPhone 12ProMax using an Apple lighting cable. Only the USB ports work for charging or powering devices.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"Like a brick!","reviewDescription":"Soooo heavy! Not for traveling! Wish I had gotten something lighter.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634256000000}
{"reviewTitle":"TSA","reviewDescription":"Issue is that not compliant for flight although claims as muchNow it’s great for charging IPad and phone on couch","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618185600000}
{"reviewTitle":"USB-C DOES NOT WORK!!!","reviewDescription":"Cannot charge my iPhone 12 Pro Max because the USB-C port does NOT work. USB works fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"Really heavy, returned.","reviewDescription":"We returned the product, it is really heavy for us.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632787200000}
{"reviewTitle":"Type-c no worky","reviewDescription":"Battery last forever 5\/5 flashlight is nice 5\/5 type c charger doesn’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627171200000}
{"reviewTitle":"Would not buy again","reviewDescription":"Was doing fine then it wouldn't hold a charge.  Stopped charging after a while. Holds battery life good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615680000000}
{"reviewTitle":"Ports de charges HS après quelques mois d'utilisations","reviewDescription":"La batterie externe fonctionné très bien au départ mais je ne sais pas pourquoi l'un des ports ne marcher plus et ensuite le deuxième port USB est HS donc impossible de recharger mes appareils.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1717718400000}
{"reviewTitle":"Geht","reviewDescription":"Also die powerbank funktioniert super nur verstehe ich nicht wie man sagen kann das Sie 10 iPhone Ladungen schaffen würde. Mit Glück 1.5 aber dann ist die Bank aber richtig leer und geht nicht mal mehr an. Finde ich schade für so viel Geld. Hätte ich mir eine billige kaufen können.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1714608000000}
{"reviewTitle":"It's doesn't work as well as expected","reviewDescription":"Looks good but doesn't work as well as expected not too impressed. Nor is my teenage son!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1717718400000}
{"reviewTitle":"Der größte schrott","reviewDescription":"Wir haben die Powerbank bekommen haben sie voll geladen und heute ruft mein Sohn an und sagt mir das die Powerbank nicht mehr geht sie kann nur noch geladen werden aber man kann keine Geräte mehr laden verkäufer kontaktiert keine Reaktion.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1717632000000}
{"reviewTitle":"Elle s’est gonflée et défaite","reviewDescription":"Après un an elle s’est gonflée et défaite, donc inutilisable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1720569600000}
{"reviewTitle":"Très lourd","reviewDescription":"J'ai retourné cet article parce que le câble n'était pas compatible avec mon portable et il est beaucoup trop lourd pour l'avoir dans un sac à main","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"France","date":1719705600000}
{"reviewTitle":"Geht besser :(","reviewDescription":"Anfangs super Prudukt. Hatte die Powerbank mehrmals beim camping dabei. Nun hat sich der Akku aufgeblasen und die sogar die Hülle ist aufgerissen. Dies kann unter Umständen Lebensgefährlich werden !!!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Germany","date":1715040000000}
{"reviewTitle":"Déçue","reviewDescription":"Très déçue !Ne recharge qu’une fois complètement et une deuxième fois à 75 % mon iPhone 14 + et, plus de batterieTrès lourde et imposante","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1717977600000}
{"reviewTitle":"Mensonge sur capacité","reviewDescription":"La capacité n'est pas de 27000mAh comme annoncée mais de 20000mAh puisqu'elle vaut 100Wh et prévu pour servir en 5V (USB) soit 100\/5=20Ah=20000mAh","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"France","date":1719792000000}
{"reviewTitle":"Leider nicht optimal","reviewDescription":"für ein Camping Urlaub bestellt, nur eine Ladung möglich . Artikel wurde leider zurückgeschickt","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1716163200000}
{"reviewTitle":"Only 3 ports available to charge devices (all usb)","reviewDescription":"I thought I would be able to use my usb-c charger but I can only charger the power bank with the other ports.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617753600000}
{"reviewTitle":"Not quite as advertised.","reviewDescription":"Great charger with good capacity but lightning charger doesn’t work. Only micro USB.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"Fast charging but low battery life.","reviewDescription":"It charges good but it doesnt but the life expectancy is not that great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Works but slow","reviewDescription":"It charges slow... and works in an annoying way you gotta press the button and sometimes gotta reconnect the cable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616025600000}
{"reviewTitle":"Don’t change fast","reviewDescription":"Has good battery life but it don’t change fast","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632268800000}
{"reviewTitle":"Too heavy for so little power","reviewDescription":"Extremely heavy for carrying every day. Would be worth it if it had power to match its size.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618272000000}
{"reviewTitle":"Good, but...","reviewDescription":"It's a good powerful charger, but very bulky and heavy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625443200000}
{"reviewTitle":"solar or just 110 volt","reviewDescription":"i thought it was solar charchingdisappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616371200000}
{"reviewTitle":"Item is ok it gets the job done","reviewDescription":"Only charge my device to 80%","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617667200000}
{"reviewTitle":"Jigs battery brick","reviewDescription":"no diagram was included in the instructions","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615593600000}
{"reviewTitle":"Awesome battery charger","reviewDescription":"Took a full day to fully charge up for the first time but I did take it with me to Disneyland and it recharged 4 phones and a tablet for the day we were there and it didn’t even kill half of the battery life !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Works great","reviewDescription":"A bit heavy but works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Great charger","reviewDescription":"Works great. A bit heavy but easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"excellent phone charging","reviewDescription":"I've never had a charger before now so I can't compare to other chargers.  This one foes everything expected. it charges our phones both Android and iphone easily and quickly.  it charges up fairly wuickly and the 4 indicator likes gives good feedback. The flashlight is just a nice extra. very pleased with this item.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Great","reviewDescription":"Need one when on the go it’s the right size color great quality battery capacity is great appearance is great display is amazing  great will have for an long time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Charged quickly.","reviewDescription":"Battery pa k charged quickly Have not determined how long charge will last yet. So 24 hours running a small water pump.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"This thing is no joke!","reviewDescription":"I have had this for 3 years and it's still like new. Takes a bit to charge but once fully charged, this baby lasts like 2 weeks charging my phone every night...it's perfect for vacations. It's heavy but solid, sturdy, and durable. You can plug anything in this thing and even multiple things at once. Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"It has a flash light and came with a charge already.","reviewDescription":"I like that I’ll be able to charge multiple times on this one device before it has to be recharged.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Large capacity and charges really fast!","reviewDescription":"I love how portable it is despite its large capacity. It's compact and easy to carry. It charges my devices quickly and efficiently, saving me a lot of time. With a massive 30000mAh capacity, this power bank stands out compared to other power banks in the same price range. It provides multiple charges for my smartphone and can even power my tablet and other gadgets.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Very good","reviewDescription":"This charger is awesome. You definitely is a good value for your money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Good value","reviewDescription":"It does what it's supposed to, not much else to say. Comes fully charged as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Useful","reviewDescription":"Has multiple spots to charge multiple things at once and charge last for a couple days.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"It holds a charge for a very long time!!","reviewDescription":"It is a little heavy, but it holds a charge for a really long time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good for the price","reviewDescription":"I get about 3 to 4 full phone recharge sessions out of a fully charged pack. Not the lightest battery pack, but it does the job and full recharge time isn't more than about 45 minutes for the pack itself. Seems durable enough to last longer than my previous one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"So Far, So Good","reviewDescription":"I've only used the battery for 5 days so far and it's running a small pump every day.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"A bit heavy but it is worth my money would totally buy again","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Good battery","reviewDescription":"Does the job. Charges my phone fully and recharges fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"It's so heavy 😭","reviewDescription":"Charges super well!! The battery lasts a long time & I love the flashlight too. People weren't lying when they said this was heavy omg it's like a small paper weight 😭😭😭","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Heavy","reviewDescription":"this is heavy and good. I love that it has a flashlight on it stays charged for a long time recommended","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Holds charge for a long time!","reviewDescription":"I love that I don't have to charge this box for many many days....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Worked once. Never charged again.","reviewDescription":"I only got to use it one time. It never would charge up to be used again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Does not fast charge!","reviewDescription":"I had spent a couple of days going through the reviews and settled on this one.MOST important to me, was the advertised ability to fast charge. This one had the least negative reviews regarding this aspect, so i bought it.Piece of junk! The box had been obviously opened previously, and repackaged quite poorly.The internal assembly does not align properly with the external case, and therefore is tough to get the usb cable inserted.Poor Quality, AND Amazon is reselling defective, and previously opened products to customers who are expecting new and functioning products. It is a shame that a company gets away with it repeatedly.....","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Too heavy","reviewDescription":"This charger weights 16 oz.  So heavy. I just could not put the n my purse.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Waste of money","reviewDescription":"Doesn't last more than 2 hours as a charger. And takes all night to re chargeDon't bother","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Que me sirva cuando lo necesito","reviewDescription":"No carga el telefono. Se me descarga mas bien","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Been on charger overnight and still not charged","reviewDescription":"Will not charge just had it alittle over a month. only used 2 times.Been on charger overnight and still not charged","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"WOULD NOT STAY ON.","reviewDescription":"WOULD NOT STAY ON. RETURNED.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712361600000}
{"reviewTitle":"Worst product","reviewDescription":"Stop working after a month","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Purchased two. Both had the same problem. Had to return within about a month.","reviewDescription":"The description says it charges within 10 hours, which is a lot, especially if you have children, and doubly so if you're on the go a lot. We found that after purchasing two of these units, they would need to charge in the neighborhood of up to three days straight plugged into the computer or into a USB wall charger directly. That's bad enough, but then the juice would drain within an hour on an iPad mini that wasn't even fully drained, on both units. No excuse for that. Support says plug directly into an AC charger, which it did not come with. Bulky, heavy, and didn't work. Both units returned.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1615852800000}
{"reviewTitle":"Will not Fully Charge","reviewDescription":"Had it a few days now and I used it till its battery was drained and wanted to charge it to full, After 2 days it never got passed 80%.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Must have of you are traveling","reviewDescription":"Love this power bank when I used it for my recent trip. I charged it every night and it never ran out of charge while charging 3 phones during our long day trips. Only concern is it’s little heavy then regular power banks, but that’s natural seeing its charging capacity. A must have for travelling.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"It works really well added light switch","reviewDescription":"Improve portable phone chargerCharge phone 3xtra fasts","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Holds a charge","reviewDescription":"I love this I keep it in my bag. I use it at work and for traveling. I have only had to charge it twice since I purchased. It holds a charge for a while.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Excellent product","reviewDescription":"This has a strong\/long lasting power supply. I like that it has a flashlight.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Power Bank","reviewDescription":"I have not used it as of this review, I liked it because it could change two devices at once but it is a little heavy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Great!","reviewDescription":"Great, got it right before a vacation an didn't need to charge it yet. And all my gadgets are charged and ready to go!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"It works","reviewDescription":"A little heavy!  But excellent product.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"LIFESAVER","reviewDescription":"This has been a lifesaver, we just had a storm and the power bank last up to 8hrs. It’s very weighty and it seems durable","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"11\/10","reviewDescription":"It lasts forever, you'll get a few charges out of it. I use it for a rear dash cam. And has an emergency flashlight on it. A must have for any go bag or emergency kit.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"fast charging, huge capacity","reviewDescription":"charges devices really fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Best Long Flight Companion","reviewDescription":"This one is a no-name high capacity supply. It cannot be fast charged. It doesn’t fast charge my devices.But it keeps them going for the whole flight. Phone, tablet, notebook all have plenty of juice on long hauls. It is huge.Too heavy for pocket or even purse carry but essential as a carryon companion. I’m a 2-battery guy. A 10k small and light fast charger for daily carry and this monster for long trips when the pocket rocket isn’t enough and weight is not an issue.TSA has never had an issue with this supply. It’s physically smaller than many with less juice. Got it for under $30.Main drawback: bank itself takes a very long time to saturate all that power density. If I have a trip coming up, I set a calendar note to self to plug it in to charge 2 days before leaving. It doesn’t take 2 days but better safe than sorry.Not a whole lot of features, but will charge using any phone cable. So I can leave it charging in a hotel room on my phone charger while I’m out with my phone and pocket power bank. It is fully charged in time for the return trip.Has not failed me yet, has more juice than any other bank I’ve used.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1634342400000}
{"reviewTitle":"Great Choice!","reviewDescription":"This battery pack is one of the most incredible ones I've ever owned. I haven't owned it for long at all, yet I feel I can say that it will last for quite some time.The flashlight is far brighter than I thought it would be. It isn't the brightest but it is brighter than the cheap flashlights you can grab out of a store. I haven't seen how long the battery pack lasts while the battery is on but I imagine it would last a decent while.The storage of the battery is pretty nice. I can charge my phone multiple times before it dies but I feel it may not be as large of a battery as it claims, but only off a little. The many options for charging ports, (micro-usb, lighting cable, type-c), is great and very convenient for my friends and family as I use a Samsung and they use Apple.One of the only cons is the weight of it. As it is pretty heavy, however it is very much still worth it as it has the bright flashlight and the large storage.Overall, I highly recommend this battery pack over many others.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1653609600000}
{"reviewTitle":"The battery holds well","reviewDescription":"Let me tell you, this Portable Charger Power Bank 30000mAh is a game-changer! With USB C 22.5W fast charging and multiple outputs, it's got everything you need to keep your devices juiced up on the go and you can charge multiple items. And check this out – it even has a flashlight for those late-night adventures! Whether you're team iPhone or team Samsung Galaxy, this charger has got your back. Trust me, I don't  leave home without it!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Long life power bank","reviewDescription":"With a massive capacity of 30,000mAh, it can keep my devices charged for days on end. It easily charged my smartphone multiple times, and there was still juice left in the tank.The build quality is excellent, and the sleek, compact design makes it highly portable. It's easy to slip into a bag or pocket. The LED power indicator is a handy feature, providing a quick snapshot of the power bank's remaining charge.Another noteworthy aspect of this power bank is its versatility. It offers multiple output ports, including USB-A and USB-C, catering to a wide range of devices. I appreciated the inclusion of the USB-C port for fast charging my newer gadgets.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Perfectly fine. Heavy.","reviewDescription":"this power bank is so good. it charges my phone fast and lasts long. i can use it for days without plugging it in. it's like magic. 🔋✨it's also very sleek and stylish. it fits in my pocket and doesn't weigh me down. it's like a fashion accessory. 💎👌it has a LED display that shows the battery level and the charging speed. it's like a mini computer. 🖥️👀it also has a flashlight that can light up the dark. it's like a superhero gadget. 🦸‍♂️🔦this power bank is the best thing ever. i love it so much. i would marry it if i could. 💍💘10\/10 would recommend to everyone. buy it now or regret later. 💯👍","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Best portable charger I've owned","reviewDescription":"This charger is awesome! I used to only buy a specific brand but this one is way better than my old brand!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Super Bueno, super recomendado","reviewDescription":"Ame demasiado este cargador. Dura bastante. Fui a un concierto ayer y cargo varias veces mi celular y el de mi amiga y hoy sigue aun con carga. Pesa, pero es demasiado bueno y útil. Si pudiera darle mas estrellas, lo haría.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Cargador recargables","reviewDescription":"Ufff excelente me carga mi teléfono rapidísimo de hecho compraré 2 más para Cuba lo recomiendo 100%","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"I bought two (2)","reviewDescription":"This really has a huge capacity. Five LEDs tell status.  If fast charging, a green LED indicates that, too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Great portable charger.","reviewDescription":"Couldn't ask for more for 20$, 30,000 mAh, charges fast, connections for all USB types (no lightning), and it charges pretty fast. Very good portable charger with a hand flashlight built-in.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712707200000}
{"reviewTitle":"Works well","reviewDescription":"I just got it but it works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Power Bank","reviewDescription":"I love  my power  bank its  made  life easy for me.  Easy to  carry","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Excellent product","reviewDescription":"Holds the charge well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Heavy and a lot of power.","reviewDescription":"A LOT heavier then I thought but also has a lot of power.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"High quality and powerful","reviewDescription":"I had other power bank but seems like doesn’t last.  This power bank is good quality.  After a full charge, I recharged my phone already three times and it still holds about 2 dots of fuel.  So. I am expecting it would charge 4 times in total at least.  So you will have a reliable source when you are in trip  The input charge is kind of fast I think.  A few hours to get it full charged.  Then take about a a little above an hour to get your phone full charged  Which is normal because it is a portable not a wall outlet.  I also use it while charging occasionally for a call or text.  I am very satisfied with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Great mobile charger","reviewDescription":"This thing has been charging my phone for 4 days, and it still more than 50% charged.  Love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Great build quality, lasts forever, good form factor","reviewDescription":"I have been using this product since November and honestly I'm seriously impressed by how long it lasts. I like how it has multiple ports, including USB which you can use both for charging and using it as a charger. Overall build quality is very nice, sturdy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713484800000}
{"reviewTitle":"Woah!","reviewDescription":"Charge COMPLETELY before using.I charged my galaxy 23 from 5% to 100 in 30 mins (c to c) and didn't lose a dot of power.Flashlight trash but there is probably one on your phone so just charge that.I did get confused that the last light is symbol not power dot...I think?Not light but worth it. For sure. Grab one.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"More Capacity Than You Want!","reviewDescription":"I purchased this battery to charge both my wife and I devices while we are on the road.The battery life on this is awesome, we were able to charge both of our devices 3 times before even thinking of charging the battery.And with USB power delivery were were able to charge our devices fast, and it's easy to use because of its multiple ports.There are some downsides it's a $25, 30000mah battery after all. This is a heavy and big size battery making it a bit cumbersome to move around with. The built in flash light is not very bright, but it's useful when trying to find stuff in your bag.Great product over all.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"Powerful","reviewDescription":"The power bank is powerful. It charges my phone very quickly . It also stay charged for a very long time before I charge it again. I’m glad with my purchase and would recommend anyone to purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Completely disappointed","reviewDescription":"This battery has half the life I expected. This was replacing a similar product with the same capacity, yet lasted less than half the powering time for the same device it was charging. Completely disappointed. No wonder why it was on sale at a cheap price. Get something else: although it looks right, it’s a loser!","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Just twice for my galaxy 20","reviewDescription":"Good price but very low capacity.  I have charged twice my galaxy 20 and PowerBank got exhausted. 30 000 mA - not exist!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"USB port stinks","reviewDescription":"Will only charge my phone with usb-c port. That part works really well but out of the box, it would charge using the usb port now it will not.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"HEAVYYYYY","reviewDescription":"Too heavy to carry around. This thing weighs a ton. It works great but is tooooo heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Good for 3 weeks","reviewDescription":"After 3 weeks, it can't hold a charge. Drops to 1-2 dots just sitting.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Weird results","reviewDescription":"It will charge my phone but then my phone dies faster after using it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Disappointed","reviewDescription":"I hit the \"buy again\" button on this item I bought last year only to find out that this new one has half the charging power of the one I initially bought. The former one has the JIGA brand on it and is much more powerful than this one and discharges at a slower rate. The new one is completely discharged after 1.5 charge of any device. I have serious doubt it's the same product. Very disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"This worked great when I first got it...5 months later, not so much","reviewDescription":"I really liked this charger.  It was a little more bulky than I thought it would be but I really loved the charging copacity and the multiple input\/outputs.  This made life sooo much easier.  I bought this 5 months ago.  Now, it doesn't matter which cord I use my phone says it is slow charging and it even died on me when connected to charger and charger was fully charged.  There is one USB port that won't work.  If I had all day to charge my phone, I wouldn't have needed this battery block.  Looking for a replacement as this no longer charges my phone.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1628294400000}
{"reviewTitle":"This Charger Sucks!","reviewDescription":"This gadget Sucks!  When charging it BEEPS. I looked at it while it beeped&saw what it charges on\/off that's why it beeps. It's VERY ANNOYING if you hv it plugged up near you enjoyed it withe watching TV or sleeping. It charges slow. I've even tried to plug other things into it to see if it charges any better..... the same thing. I have my father my other charger that lasted 6hrs of charging.....I will b buying THAT ONE again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615680000000}
{"reviewTitle":"Defective or just bad quality????","reviewDescription":"It’s not long  ago since I bought this charger and it just start lagging. My phone doesn’t charge as fast as when It was brand new but less than four months it’s definitely a disappointment for this item that has mostly good reviews. I don’t know if it’ll be possible to return it since it’s been almost four months but I’m definitely not buying from this vendor again.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1626652800000}
{"reviewTitle":"Fully functional for 10 days","reviewDescription":"It only took 10 days for this battery bank to hold charge. I leave it charging now and within an hour it's gone.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"It works for a while","reviewDescription":"It works for a couple times but stops working now","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Waste of $","reviewDescription":"I've had to return this battery pack twice now. I used it to TRY to charge my S20 5G. First the USBC to USBC port BOTH malfunctioned. It worked for one day and never again. It doesn't support fast charge AT all. It tells my phone it'll take 2 hours to charge from 15% when it should only take an hour max if the charge is supposed to be similar to fast. Straight waste of $.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1644364800000}
{"reviewTitle":"Slow charge","reviewDescription":"I want to love this battery but it’s the slowest charging battery I’ve ever used. I would rather carry around two lower capacity but rapid charging batteries which is likely what I will end up doing. My phone is used extensively in my job in the field which is why my battery is constantly draining.CONS: Slow sloth like charge. Heavy which I can’t complain about since I wanted a large capacity.PROS: multiple types of ports including Type C. High capacity.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626134400000}
{"reviewTitle":"Not as expected","reviewDescription":"This product does not hold charge. I had a similar model that would last days. This one did not even last a full 24 hours.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Keep searching, this will not charge anything!","reviewDescription":"If I could give this no stars I would!  The first one that I had took forever to charge any thing so they sent me a replacement and this one will charge but I have to keep hitting the on button. I thought that for the price I would receive a quality item but I received the opposite not once but twice. If you see this i would highly recommend you keep looking because this thing is hot garbage!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1622678400000}
{"reviewTitle":"Cannot get it to charge anything.","reviewDescription":"I plug in myiPad, using the usb port. My ipad shows the charging lightning thing, but the battery just depletes.  Same with my android phone.  Useless.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1681516800000}
{"reviewTitle":"No Battery life","reviewDescription":"I have buy this a couple months ago for a trip to Las Vegas I have use it for a for like a week or so after that did not use, few weeks ago was trying to use it for a upcoming trip what a wast off time it was full off charge I plugged my iPhone it not even 5min than it was all out off charge, waste off money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1625702400000}
{"reviewTitle":"Brought 2, usb-c doesn’t work in either of them.","reviewDescription":"All other poets work but the usb-c doesn’t. Which makes it useless since I have an iPhone. It specifically says that it charges iPhones and had great reviews. First one I received the usb-c didn’t work, figured is was just a one off. Just received the second one and it’s the exact same problem. I don’t recommend this at all. Why buy a charger if you can’t utilize all the ports on it?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1618099200000}
{"reviewTitle":"NEVER DROP IT","reviewDescription":"Holds tons of charge. Not too bulky to carry around.But... NEVER EVER DROP IT.If you're charging a device and drop the brick, the port you're using stops working properly. A huge drop isn't needed, from a chair to the floor is enough.Edit:Downgraded to one star. Got a replacement and it stopped reliably charging my phone after only a month of use.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1632787200000}
{"reviewTitle":"Days to charge?","reviewDescription":"I thought this would be a super cool charger by reading the reviews. I got one of the defective ones unfortunately & have been sent another one. Waiting on that one to charge. I don’t know understand why this takes hours & hours & days\/overnight to charge. It’s very odd","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1629417600000}
{"reviewTitle":"WONDERFUL UNTIL...","reviewDescription":"This was a wonderful,  powerful product.  Purchased in Feb 2022, charging port busted inside ( can hear it rattling loose on the case) in June 2022.  Sooooo.. not real durable.  Worked lovely daily for 3 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"Faulty C port.","reviewDescription":"I was so excited to receive this portable charger prior to my family vacation to Walt Disney World. When I received the charger, the c-port didn’t work, so I had to charge everything using the USB ports. Everything else seemed to work properly. Have not contacted the vendor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"Owned the Jiga Powerbank only 2 months. It stopped working.Don’t waste your money.$30 down the drain","reviewDescription":"I use this Jiga Powerbank to charge my cellphone only and it only worked 2 months. It will not charge or take a charge. It charges really slow too.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1672358400000}
{"reviewTitle":"Baja Calidad","reviewDescription":"La batería es robusta y parece de buena calidad, pero no fue esta mi experiencia, se daño de la nada, sin sufrir caídas, golpes, sólo me funciona de linterna y no fue para nada la razón de mi compra.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"Only charges for about 2 min. Even when showing full charge","reviewDescription":"Is mine defective? Fully charged. Turned on. Showing level 5 (of 5). Cannot get it to remain charging. It’s also quite heavy for a portable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657411200000}
{"reviewTitle":"Will not be buying any electronic product from Amazon anymore foresure.","reviewDescription":"Do not buy this item it does not hold it charge and Amazon says it has a 90 day return policy and it’s only been one mi th and they will not accept my return or provide a refund! Should have bought it at Best Buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1619481600000}
{"reviewTitle":"Shame on manufacturer for false advertisement","reviewDescription":"Reviews say it will charge a cell phone 6.5 times. It wont even charge my phone 100%. Thought I was doing somthing wrong. I can't even charge the battery 100%. Horrible and now it's past the cut off date on return. SMH.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Didn't work straight out of the  box","reviewDescription":"I have tried multiple cords.  The only thing that works on  this is the flashlight.  VERY disappointed.  Will be returning soon.  Will update  my review when I see how they handle customer service.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1634601600000}
{"reviewTitle":"Stopped working after a year","reviewDescription":"Worked fine for a bit them just stopped working for no reason less than a year after purchase. Wasnt physically damaged im anyway, just wouldn't charge and would charge anything anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"Great bargain","reviewDescription":"Bought this for my daughter for her middle school Washington DC trip. She was gone for 6 days and only had to recharge it once.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Seems legit.","reviewDescription":"I bought this to charge my Quest and charged it up the first night. So far I’ve charged the quest probably 3 times over and it’s still showing mostly fully charged. It’s heavy, so be prepared for that…it IS 30k.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"VERY GOOD POWER BANK","reviewDescription":"GOOD QUALITY AND PRODUCT","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"This thing is hefty","reviewDescription":"Huge portable charger tons of power better than I expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Fast charging and many options!","reviewDescription":"I am a real estate agent who spends a lot of time out and about, often in homes that don't have wifi or electricity in some cases. This means I have to use my phone's wifi hotspot which drains my battery pretty quickly. Having a power bank with such a huge capacity is very helpful! I used it non-stop for two days straight and still had 60-80% left so I’ll be able to use it for weeks at a time without worrying about having to recharge it, which only takes a few hours anyway. There are ports to plug in my android tablet, my iPhone, my laptop if I need to, and pretty much any device I have with me. There is a simple set of 5 lights to tell you the battery level in 20% increments, which is precise enough in my opinion. The flashlight feature is excellent too! It is actually a very bright light that I can use, instead of my phone, when inspecting properties during showings with my clients. This does barely fit in my pocket but it is not necessarily \"pocket friendly,\" as it is pretty heavy, a bit longer and wider than my iPhone 11, and about three times as thick. For how much energy it holds though, with all the options for charging, I imagine it couldn't be much smaller.  I would recommend this one to anyone who regularly needs the extra juice and uses electronics a lot. Great product!","isVerified":true,"ratingScore":5,"reviewReaction":"49 people found this helpful","country":"United States","date":1607299200000}
{"reviewTitle":"Good product","reviewDescription":"This is a very good power bank at this price point. If you're looking for value and efficiency this is it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"The strength of it!","reviewDescription":"I have used it to charge my IPhone 13 Pro Max three times and the led lights are on 4 which means it is still fully charged! It takes about an hour to charge my phone from 20% to 100%. Very quick. I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Great power bank for the price.","reviewDescription":"Goes for days as I use it to charge my cell phone at work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Great output power for a small battery","reviewDescription":"Running 5 volt DC @3 amp Raspberry Pi  great operating time, battery is a good investment for charging off site.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"It’s a good charger","reviewDescription":"It gave my phone 6 full charges and it still has one light to go. There is a little flickering noise but you can hardly hear it.The only thing if your phone is 100% charged it doesn’t turn off like the other charging banks you have to unplug your phone for it to stop waiting battery.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Convenient battery pack","reviewDescription":"For Phone, I keep it in my purse and ticket everywhere I go is very convenient","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Changer with a light.","reviewDescription":"It charges phones and etc fast and with power left over. The light is a plus. I like it a lot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Awesome battery pack","reviewDescription":"Will charge my from from 20% to 100% less than an hour only using one bar on the charging block","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712880000000}
{"reviewTitle":"Power bank","reviewDescription":"I have used the power bank when I ran low on battery power on my iPad and iPhone. It works great and will definitely be used by my family members.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"This is the most versatile back up power unit for my devices.","reviewDescription":"This back up power supply was a little larger than I imagined, but It’s a good trade off to have more power than imagined, even @ the expense of it’s larger size.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Charge your phone all day","reviewDescription":"This large battery provides a lot of charge to keep all your devices charged when out and about. The extra light is cool to have when you're in a pinch, but I don't find myself using it to much.With such a big battery knowing how much charge you left is made easy by the indicator. It is heavy but for such a large battery, it's a small trade-off.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Powerfull Travel UPS","reviewDescription":"It has the power to charge more than 10 mobil phonesIt is heavier than I expected. Not appropriate to be carried in your pocket","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Good buy for the price","reviewDescription":"Bought this for my daughter for her upcoming trip to Disneyland.  It worked great all day and made sure her phone was charged all day. It charged multiple devices before it needed to be charged again. It also worked great as a flashlight. It also very helpful when she has classes and can't easily find an outlet to plug in her phone or other devices. Perfect travel charger","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Great product","reviewDescription":"Great product Quick charging component.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Heavy duty charger","reviewDescription":"This charger was very much needed on my latest international trip.It would keep my and my spouse's phone fully charged all day without even draining to half. It also charged the phones faster than when using the wall outlets.It does take some time to charge itself so I did it at night every 2-3 days. It's bulky enough so not very easy to lose or break.  I recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Takes forever to charge the phone","reviewDescription":"Takes forever to charge the phone from this. It’s not quick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625875200000}
{"reviewTitle":"No funciona.  La entrada tipo c al iPhone","reviewDescription":"No está capacitado para el iPhone 11 y no tiene. Carga rápida","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1621123200000}
{"reviewTitle":"Very heavy.","reviewDescription":"Too heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625356800000}
{"reviewTitle":"LOOK ELSEWHERE","reviewDescription":"I had high hopes for this charger because of the overwhelming positive reviews but it didn’t meet all my expectations.I bought it specifically to use the usb-c but it wasn’t  working so I reached out to Amazon’s technical support,i was told that the usb-c port is for INPUT only. also,this portable charger takes FOREVER to charge. Don’t get fooled by the reviews some are in exchange for free item.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614556800000}
{"reviewTitle":"It's okay","reviewDescription":"Dropped it a couple times and now only one port for charging other devices works. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620691200000}
{"reviewTitle":"Lots of charge!","reviewDescription":"EDIT:The one of the USB outlets has quit working, and the button literally just caved in when I pressed the button today. I haven’t even had this for 6 months and take good care of it! Very disappointed! :( This power bank works very well initially, but it doesn’t have the longevity or durability that justifies the cost.ORIGINAL:This power bank is powerful! I am able to recharge my iPhone 11 Pro 5x before it runs out of battery power. However, from empty, it takes about 12 hours to fully charge the bank, and I am not able to use the USB-C to charge anything, which is a shame. Still, it suits my needs wonderfully, as I only have one device that uses USB-C.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Netherlands","date":1646352000000}
{"reviewTitle":"Une odeur très désagréable","reviewDescription":"Ca fait maintenant 1 mois que j ai ce produit et l odeur de chimique très prononcée ne s en va pas. C est impossible à utiliser près de soi. Il faut l emballer pour que ça soit supportable","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Belgium","date":1687219200000}
{"reviewTitle":"Fonctionne à court terme","reviewDescription":"Points positifs : Produit convenable, ports et finitions qualitatifs, compatible charge rapide.Inconvénients : N'a pas d'indicateur de batterie restante précis.Ps : le mien semble défectueux, il s'est retrouvé complètement déchargé sans utilisation 1 à 2 jours après une charge complète.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1724889600000}
{"reviewTitle":"Not much use to me, and will be returned.","reviewDescription":"Well, I tried...  I tried to find out what the actual maximum output current was, but failed.  I asked the question here on the Amazon product page but no one answered.  I also read a professional review that said one could charge the battery pack faster by charging it via its multiple inputs.I just tested it though and found rather disappointing current levels.  It is described as having 3x 2.1A USB outputs.  But what does 3x 2.1A equal?  In this case it equals about 2.1A.  2.1A is the maximum TOTAL output across all three USB sockets.  So if you are charging three devices, they will all charge rather slowly, especially as the voltage drops well below 5v as the current rises.  If you wanted to charge three low power devices, like a  couple of older phones and a bluetooth speaker, you might be alright.But worse than that, the maximum input current is very low.  I didn't try via the USB-C port as I did not have a USB-C cable, but via either the Apple Lightning input or the Micro USB input (you can't use both together as the sockets are too close to each other) the absolute maximum current the battery bank will accept is 1.8A.  That is with the supplied short (30cm?) Micro USB cable.  With longer cables I tried the current was below 1.0A.  The charger I used was a very good quality USB charger well capable of producing about 3.5A without the voltage dropping below about 5.1v, so it is definitely the battery bank itself which is limiting the current flow.The other thing is that it doesn't look like pass-through charging is possible.  At least, it didn't work for me.  An iphone charged fine from the battery bank when it was not plugged into the wall charger, but as soon as the wall charger was connected to the battery bank the iphone said something about \"accessory not supported,\" and the charging symbol disappeared from the iphone's screen.So, a bit disappointing, but this power bank is clearly not going to do what I need it to do, so I shall be returning it.  I've given it one star (on top of the one compulsory star) because it does seem to work.  It's just very slow, and I'm not sure why anyone would buy such a large battery bank if they only needed to charge low power devices.  A large bank should also be reasonably powerful, and this one just isn't.","isVerified":true,"ratingScore":2,"reviewReaction":"37 people found this helpful","country":"United Kingdom","date":1610150400000}
{"reviewTitle":"Kaputt nach 2 Monate","reviewDescription":"Diese JIGA Power Bank 27000 hat fast genau 2 Monate funktioniert. Dann auf einmal war sie ohne Funktion. Montagsprodukt? Kann ich nicht sagen.Vorher hat sie unregelmäßig geladen - mal schneller, mal langsamer.Ich war nicht besonders zufrieden und natürlich habe ich sie zurückgegeben.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1723852800000}
{"reviewTitle":"Solid, but not as great as advertised","reviewDescription":"The unit is big, which isn’t too bothersome - but it is heavy. That said, my main issue is that it definitely is not capable of charging an iPhone nearly as many times as the graphics advertise. No way I’m getting that many charges out of it; maybe 60% that many.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619568000000}
{"reviewTitle":"Very heavy but doesn't charge fast enough to use your device while charging.","reviewDescription":"It's super heavy and would be fine for over nights. If however your phone is at 1-5% you cannot use your device while it's charging because it will die faster than it can charge. I was pretty disappointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630281600000}
{"reviewTitle":"Very Heavy!!","reviewDescription":"I would not take this camping or traveling because it is twice as heavy as other power banks.  It might be ok as a home power bank for power outages, but it is just too bulky and heavy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613433600000}
{"reviewTitle":"USB-C port does not work","reviewDescription":"cant charge with usbc","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667174400000}
{"reviewTitle":"This product is supposed to be compatible with Samsung","reviewDescription":"This product is supposed to be compatible with Samsung, however the C port does not charge the Samsung 21 which is the main reason for me purchasing this battery pack charger. It is also heavier than I expected.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622764800000}
{"reviewTitle":"it is what it is","reviewDescription":"its huge and its very slow at charging the ipad. its nice for charging the iphone. it takes a while to charge itself but it gets the job done","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627257600000}
{"reviewTitle":"Too heavy and the shape is not attractive","reviewDescription":"I don’t like it because it can’t charge my laptop.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"This does not charge as fast as i thought it would","reviewDescription":"I like to take with to charge phone and kindle...also in a pinch i could use for chromebook i think..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Bulky bank","reviewDescription":"Its big and bulky.  I have fast charging cables, but this device does not fast charge at all.  At least it charges my phone I supposed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617667200000}
{"reviewTitle":"Charges slowly","reviewDescription":"Charges very slowly for my iPad at school, even with the brightness lowered and only running 1 app","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612137600000}
{"reviewTitle":"Good product over all but a little defective","reviewDescription":"When I first received it it was working great. Now the type-C part is not working. Not sure why it just stopped working. Not sure if anyone else is having this same issue.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1648598400000}
{"reviewTitle":"Large battery bank","reviewDescription":"This is a large and weighty battery bank. I'm using it as a backup power supply to charge my video and camera gear. It is working well and i will update this post if I run into any issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634342400000}
{"reviewTitle":"Für mich super","reviewDescription":"Hält super lang, ohne dass man sie wieder laden muss. Habe schon alles mögliche damit geladen und sie auch als Taschenlampe mehrfach benutzt. Der einzig negative Punkt ist, dass sie recht schwer ist. Aber das wusste ich vorher und es ist für mich tatsächlich nicht kriegsentscheidend. Die Leistung war mir wichtiger.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Germany","date":1717286400000}
{"reviewTitle":"No USB csble","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United Kingdom","date":1722384000000}
{"reviewTitle":"Works perfect","reviewDescription":"This is a very powerful charger, it takes time to get charged itself because it holds a lot of mAh.What I like, is I can use it a lot, I don't have to recharge it every day, I don't use it every day, but 4 o 5 times a week, and it works with only 1 charge.What I don't like, is that I had to buy a USB to USB-C cable because the micro-USB, USB-C, and Lighting ports in the charger are just used to charge the charger, to charge your phone or devices, you need to use the 3 standard USB ports. The product description is fine, I just didn't read it.I also don't like that the ports, all of them, look cheap and fragile, so if you want to keep using them for a long time, I recommend you to plug and unplug very carefully, and the less the better. Thanks, it has 3.The USB to USB-C cable I bought is a short cable and is permanently plugged in just in case.I rated it 4 stars because of the cheap ports.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"Canada","date":1662336000000}
{"reviewTitle":"Incroyablement efficace","reviewDescription":"Batterie de secours vraiment incroyable. Je l'utilise à fonds depuis maintenant plusieurs années et elle est toujours aussi efficace. Je la prends toujours avec moi pour les petits voyages ou long trajet en vélo et c'est devenu indispensable. Je lai utilisé par exemple plusieurs fois à très haute intensité de 9h du matin jusqu'à 23h non stop en recharge de téléphone en mode gps + data (video) + Bluetooth, et après tout ce temps elle fonctionne encore parfaitement et tient très bien le coup. J'ai du la faire tomber au moins 50 x. Toujours aussi robuste. Depuis le temps, seulement 1 port usb fonctionne sur tous les autres, les autres sont défectueux mais honnêtement vu comment je l'ai rentabilisé, ce n'est vraiment rien. La batterien est par contre ultra lourde et encombrante, mais il faut savoir ce que l'on veut. Je ne peux que recommander ce produit. Disons que son seul défaut c'est son temps de charge ultra long mais une fois que c'est chargé on est parti pour des heures d'utilisation.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"France","date":1712188800000}
{"reviewTitle":"Alta capacidad, pero pesada","reviewDescription":"Esta batería tiene una alta capacidad de carga, me sirve tanto para cargar móviles, baterías de gopro, baterías de dron, ipad, etc .Los dos únicos \"inconvenientes\" a tener en cuenta es su peso, es bastante pesada y llevarla en la mano si estás en ruta es un poco incómodo. Para mochila aún aún.El otro inconveniente es que tarda bastante en cargar, aunque esto se suple con la gran cantidad de capacidad que tienes después para utilizar en los dispositivos.La he tenido todo un fin de semana alimentando 2 móviles y baterías de Gopro y no me ha hecho falta recargarla todavía.Relación calidad-precio más que aceptable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"Spain","date":1649030400000}
{"reviewTitle":"BATTERIA INFINITA ma qualche difetto c'è","reviewDescription":"probabilmente uno dei power-bank più potenti e con una capacità di batteria più alta che c'è sul mercato.Ovviamente la batteria cosi grande (da 30.000 mah) giustifica il suo peso, che secondo me si aggira intorno al kg e sempre data la grande capacità, il tempo di ricarica da 0 a 100% risulta essere bella lunga.Si presenta perfetto se magari dovete viaggiare molto e non avete possibilità di attaccarvi ad una presa, mentre nell'utilizzo quotidiano (da mettersi in tasca) risulta abbastanza scomodo dato il peso.E' dotato pure di una torcia con una notevole luminosità e data la grande batteria è un comodo plus in più.NOTA NEGATIVA: la presa USB-C (presente nel power-bank) può essere usata SOLO per ricaricare il powerbank stesso. SOLO LE PRESE USB NORMALI CARICANO gli altri dispositivi come cellulare, ipad ecc.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"Italy","date":1651622400000}
{"reviewTitle":"Batterie qui recharge très vite","reviewDescription":"Super batterie qui recharge assez rapidement les nouveaux téléphones.Habitués au fast-charge iPhone, j'ai été surpris par la rapidité de chargement de celle-ci.Petit défaut c'est qu'elle est un peu lourde et épaisse, je vous conseille une sacoche pour la transporter.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"France","date":1719878400000}
{"reviewTitle":"Love it","reviewDescription":"I travel a lot for work on the train, which can drain your phone usage a great deal when looking at social media\/music. It also can be a great drain on your headphones if they’re wireless. And this brilliant device charges quickly and frequently. You can charge multiple appliances at once. It even has a decent torch built in. Not sure when if I’ll ever use that feature but it’s nice to have it.On the downside I will say it’s very heavy however, I assumed it would be given the size\/power it has.Overall, I’d say I’m very with my purchase and highly recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United Kingdom","date":1724544000000}
{"reviewTitle":"Does not work","reviewDescription":"Just got this yesterday. I charged it completely, which took several hours. Then I tried charging my iPad and iPhone using USB-C and the older USB-A. Neither worked. I will be returning this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1642896000000}
{"reviewTitle":"Slow charge","reviewDescription":"This is not a fast charger. I have a Samsung galaxy note 10 and it can't even charge super fast nor can it charge fast. Super slow charger that'll take about 10 hours to fully charge.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1636243200000}
{"reviewTitle":"Type-C port does not work.","reviewDescription":"Only reason I bought this portable charger is because it has a “Type-C” port. Unfortunately this port does not work. I’ve tried charging my phone with multiple different Type-C cables, however none of them will work with this charger.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"HORRIBLE!!!!","reviewDescription":"This is a piece of crap!!!  It shuts off and gets extremely HOT!  It’s a Fire waitron start","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1651449600000}
{"reviewTitle":"Pissed off buyer","reviewDescription":"Bought this product for the type c port for my devices and it didn’t work…was happy when I got it but it didn’t work.: now I gotta wait for my refund","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"Type C port doesn’t work.","reviewDescription":"I am using this for my car because my outlets don’t work. The Type C charging port doesn’t work on it sadly.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1647734400000}
{"reviewTitle":"Horrible product don’t buy!!!!!!!","reviewDescription":"Didn’t work, turned on for 5 mins most and then turned off couldn’t get it to stay on for longer than that, sent back after a day and got a better one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1624060800000}
{"reviewTitle":"Wouldn't chargd","reviewDescription":"Bought to charge phones while working long days however it will not charge my galaxy note 20ultra.  Tried 3 different cords with no luck. Wish I could give zero stars.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"IPhone 12 will not charge off it.","reviewDescription":"I can not get the iPhone 12 to charge off this battery no matter what cords I use. Ive tried 3 different cords and I still can not get the phone to charge.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1612569600000}
{"reviewTitle":"charges slow af","reviewDescription":"it takes so long to charge everything compared to other portable chargers. even my apple watch charges extremely slow. the port that is for the ipad cord doesnt even work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1620950400000}
{"reviewTitle":"Hält nicht was es verspricht.","reviewDescription":"Habe die Powerbank nun einige Male genutzt und musste leider feststellen das die angegebene Kapazität nicht erreicht wird. Im Gegenteil, ich habe nebenbei eine Uralte Anker Powerbank mit 20000mah in Nutzung die mehr Ladevorgänge schafft als dieses mit 27000mah ausgewiesen Produkt.Immerhin funktioniert Sie, aber ein Gewinn ist Sie nicht.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1720224000000}
{"reviewTitle":"Fake, and only 20000mAh","reviewDescription":"It's fake without logo, also has only 99wh which is 19800mAh on 5V output...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1721520000000}
{"reviewTitle":"Sehr kurze Lebensdauer","reviewDescription":"Hab sie gekauft und nur wenig benützt jetzt funktioniert ein usb Stecker nicht","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1722556800000}
{"reviewTitle":"Hält nicht lange","reviewDescription":"Das Produkt ist ziemlich gut verarbeitet. Aber die Laufleistung lässt ziemlich schnell nach.Die PowerBank zeigt volle Ladung auf, lädt aber nur noch 2, max 3 mal mein Hand auf - Und das nach nicht mal einem Jahr. Ich würde es nicht weiterempfehlen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719792000000}
{"reviewTitle":"Waste of money","reviewDescription":"Fully charged it before travelling on a camping trip and it didn't work totally flat so I am left with an unusable brick","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1720396800000}
{"reviewTitle":"Batterie très polyvalente mais à durée de vie courte","reviewDescription":"Cette batterie est très fonctionnelle grâce a ces multiples ports.Après un an d’utilisation, la batterie a gonflé sans raison. Je comprends mieux pourquoi la garantie ne dure qu’un an.Du coup, je ne recommande pas trop le produit s’il n’est pas fiable dans le temps!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1718236800000}
{"reviewTitle":"Nicht zu empfehlen !","reviewDescription":"Powerbank war nach nichtmal einer Handyladung leer, also nicht wirklich zu gebrauchen. Habe mehr von einem Topseller erwartet. Auch das Licht ist im Dunkeln nicht wirklich hilfreich da es echt dunkel ist.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719792000000}
{"reviewTitle":"Ein Jahr später","reviewDescription":"Also nach einem Jahr reichts noch für eine Ladung. Reicht für Notfälle aber mehr nicht. Weiß nicht wie die allgemeine Lebenserwartung ist aber bin enttäuscht","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719705600000}
{"reviewTitle":"Ne charge pas","reviewDescription":"Je l’ai acheter au mois de juin et ne veut pas charger c’est deja la 3 eme que j’achete","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"France","date":1722729600000}
{"reviewTitle":"Cheep plasticy battery with high capacity.","reviewDescription":"Main reason I bought it, is the enormous capacity.  In general it feels placticy and cheaply build. It is not water proof or shock resistant. I'm afraid that if I accidentally drop it, it will fall a part. If you are care for your stuff, sturdiness should not be a problem.  Too bad the outputs are only USB-A type, but the high variety of inputs is great. Definitely make this battery super universal.  Yes, it's heavy, but that's understandable for 30 000 mAh and if you like camping in the woods this one should be enough to feed you phone for days.  I don't have it from a long time, so cannot say about the self-discharging.  For me the biggest disappointment is from Amazon. My battery seems to be used or at least sold and probably return. The box was definitely opened before. It is even damaged on both sides. Anyway, I decides to keep it since no severe marks of usage are present.Update after 6 months: I bought this battery in July with an intend to use it during my summer holiday, and I did so. For two weeks I charger my phone couple of times out of it and recharge the battery itself two times. After that I barely used it. It was mainly sitting in my desk with out 75% charge in it. Until December I used it probably two or three times. For your information I have an iPhone with a 2200mAh battery.  Currently in the last 10 days I had to use it and from a full power bank I barely recharged my phone six times, starting from 20% to 100%, and the power bank was empty. If I do the math seems that the power bank has more or less half of the capacity it's rated for. Even if we consider some percentage of energy loss due to the transfer, this is still a significant deviation.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"Germany","date":1659052800000}
{"reviewTitle":"Solala","reviewDescription":"Die Powerbank ist recht schwer.Nach ca 50 Ladungen läßt bei mir auch der Akku nach, sie lädt nicht mehr komplett auf. Anfangs waren 4 handyladungen möglich.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1721347200000}
{"reviewTitle":"Super Powerbank","reviewDescription":"Wir nutzen Sie regelmäßig, da wir viel unterwegs sind für Handy, Lampen usw.Leider Anzeige über Ladestand sehr ungenau!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1721779200000}
{"reviewTitle":"Es steht absolut kein info in packung das das 30000mAhist","reviewDescription":"Ich habe noch nicht benutzt aber ich bin mich nicht sicher ob ich den behalte. Ist nicht beschriftet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1720483200000}
{"reviewTitle":"Très lourde et capacité moyenne","reviewDescription":"Batterie très lourde et inadaptée pour un voyage... tout au plus un week-end de 2 jours pas plus... recharge très longue (+de 12h )... Je dirais qu'elle dépanne sans plus... un peu décevant au vu des autres commentaires (ils n'ont pas dû acheter la même )","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1708041600000}
{"reviewTitle":"Hat nicht lange gehalten","reviewDescription":"Hat ein Jahr lang hervorragend funktioniert war zufrieden nur leider ist sie jetzt defekt nach einem guten Jahr )-:","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1718496000000}
{"reviewTitle":"Stinkt richtig nach elektro","reviewDescription":"Als ich die Verpackung auf gemacht hatte kam mir richtig elektro Geruch sehr stark entgegen. Danach roch es auch immer noch nach elektro.wenn ich ein Gerät da anschließe stinkt es immer noch stark nach elektro habe es jetzt 3 Wochen aber stinkt wenn icj näher dranne immer so danach ich frage mich warum.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1715299200000}
{"reviewTitle":"Batterie externe","reviewDescription":"Je pensais que c’était la marque JIGA mais c’est une imitation dommage, je pense que ça fera l’affaire mais déçu de se servir de la marque pour vendre de la copie made in china. Vaut mieux enlever l’intitulé JIGA et dire que c’est un équivalent de la marque comme ça c’est clair pour tout le monde. Pèse son poids malgré tout.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1702166400000}
{"reviewTitle":"Soweit","reviewDescription":"Alles gut bis auf die Tatsache dass sich das Teil nicht komplett laden lässt.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1717545600000}
{"reviewTitle":"Macht was es soll, leider mut Geräuschen","reviewDescription":"Tja keine Ahnung aber mein Powerbank macht beim Entladen immer wieder summende\/Kanrrende Geräusche!? Ansonsten tut sie was sie soll.. Laden\/Entladen😉Schwer ist sie auch…","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Germany","date":1716076800000}
{"reviewTitle":"Dépanne parfaitement","reviewDescription":"Mais :Lampe torche hs au bout de 6 mois .Au bout d'un an décharge beaucoup plus rapidement.Poids ..  lourd , très lourd en poche","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"France","date":1708300800000}
{"reviewTitle":"Great when the cord works","reviewDescription":"I bought this portable battery pack because of the high mAh. For the most part, it works great, the only problem is that not every non-Apple lightning cable works for charging. The cables work when using them from other portable batteries and when plugged into the wall but for some reason not with this battery.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657584000000}
{"reviewTitle":"Not what I was looking for","reviewDescription":"Not what I was looking for. This charger did not have a USB – C out port which I didn’t know until I got it. It was also huge and heavy, not portable at all.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"USB-C Port was broken, package looked used","reviewDescription":"Opened up the Amazon box and it looks like it was a used product that was a bit ripped already, and then repackaged and taped.Not a big deal, except the USB-C port was broken — I assume it was returned for this reason by someone else.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"Not that great!!","reviewDescription":"I have 3 battery banks and picked this one up because I wanted faster charging and more charges. Not really impressed with how quick it doesn’t charge and irritated that one of the USB ports doesn’t work well at all. I wouldn’t suggest purchasing and if it wasn’t a pain in the a$$ id return it.  ..... After a few more weeks of use it’s worse. LoL waste of money. The USB ports work intermittently like right now as I type. Trying to charge my iPhone the battery works for a few minutes, says it’s charging then check again shortly and not charging at all.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612569600000}
{"reviewTitle":"Lied in description","reviewDescription":"It charges way to slow and takes years for it to charge itself it say super fast charging when in reality it's less then normal ,sleek design is what got me and the flashlight with all the usb's and it has 1 usb-c plug in which is nice the flashlight is really strong but as far as what i got it for ,it didn't meet my expectations, charges slower then the average charger, and super fast chargers, and the device itself takes forever to charge","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625011200000}
{"reviewTitle":"IT IS NOT A FAST CHARGER","reviewDescription":"Well made... good design but NOT  a fast charger....there are 4 ports all 5 V at 2.1 Amps....when connected to my Samsung phone, it says \"Charging\"  NOT fast charging.The manufacturer believes that because each port is 11 watts, it's a fast charger... IT IS NOT.  Typically fast charging is doe with a controlled 9 Volt port.All this aside, it has an ame battery, is well designed, but NOT a fast charger as described.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628467200000}
{"reviewTitle":"Won’t charge MacAir","reviewDescription":"Looks like a good product for charging phones, but it won’t charge my MacAir.In fairness, they don’t claim that it will charge a computer, but it would have been helpful if they had specifically pointed out that it won’t.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658793600000}
{"reviewTitle":"The Type C input does not work with my usb-c charging cord","reviewDescription":"Very disappointed to find out that this only works for my iPhone 12 Pro when used with a lightning-to-USB cable. It does not work with the iPhone’s provided lighting-to-Type C cable. Otherwise love that it holds its charge for a long time.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1652745600000}
{"reviewTitle":"Meh","reviewDescription":"Very thick and heavy. Would get a smaller unit next time even if they are more expensive.  This is not practical to travel with.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1650931200000}
{"reviewTitle":"HEAVY","reviewDescription":"Much heavier than listed weight. Too heavy to carry around for air travel in my opinion. I travel alone. Charges my Galaxy S9 about 5 times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Does what it says","reviewDescription":"It’s a little more compact than the Anker one my daughter and I have.  Probably prefer that one because you don’t need extra cords and a brick* to refill the power in it like you do with this one.  But these are handy to have if you are ever in power outage or away from plug (airport, out of town, on road) and need yo charge your phone.*Square USB wall brick is not included but needed.  Cord to charge is included though.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Larry P power bank charger review","reviewDescription":"I am pleased with this product and I hope to use it more and more in the future.c","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Very bright.","reviewDescription":"A little heavier than I thought it would be. Does work well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Works well.","reviewDescription":"Works as described","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"It works but is heavy.","reviewDescription":"It's heavy but I knew it was going to be when I bought it. Just wasn't sure how heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Working great","reviewDescription":"Portable and lightweight","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Perfect option for a Battery that my headset needed!","reviewDescription":"So, the Oculus Battery Elite Strap was overpriced, uneccessarily bundled with a case (when I just wanted the headstrap) and was sold out everywhere with no secondary option in sight!But thank’s to this battery, I can begin to make my home made extended battery life project!I made some extra products that I’m going to build togeather to be a headstrap that is just as comfy, and last’s 3x longer than the official battery they provided!This battery length is insane and for the price given? It’s no joke. Thickness can be an offput thing for some people, but you’re getting a compact battery for tripple the life. So expect it to be a bit thick compared to others. The battery life itself and it’s existance for traveling make it perfect for you needing that extra juice to last long and secure for that worry if you’re battery in your phone is worn out, can have this safely within your backpack to plug and relax with no worry.The oculus official battery strap is 10,000 Mha, while this alone is 30,000 mha it’ll last 3x longer than the strap the oculus provided alone!This battery is one powerful beast with a good price that other’s will take more money out of you, this is the way to go, at half the price!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609286400000}
{"reviewTitle":"Big, great charging, Love the flashlight.","reviewDescription":"Big, great charging, Love the flashlight. A bit heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Powerful!","reviewDescription":"Purchase for travel and power outages. Used it several times, very powerful for a super fast charge. Only downside it’s a little heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Very good","reviewDescription":"It is I bit heavier than I expected but other than that I am completely satisfied.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Solid product","reviewDescription":"Great to have a flashlight on a battery pack,it's very useful!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608163200000}
{"reviewTitle":"Best service","reviewDescription":"Best power","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620000000000}
{"reviewTitle":"Charges fast!","reviewDescription":"Charges quick over and over!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613865600000}
{"reviewTitle":"Item is heavy!","reviewDescription":"It is heavy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616457600000}
{"reviewTitle":"Works good","reviewDescription":"I have used it a couple of times and it charges my devices pretty quick. I think it should stay charged up a little longer though.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Pretty good price for 30,000mAh","reviewDescription":"Pretty solid construction, easy to operate. The 5 light battery indicator is not great. Either it isn't very accurate, or the first 20% of this battery drains after 5 minutes. I make sure to charge fully, but after 5 or 6 minutes of charging an external device, it drops to 4 lights.Otherwise pretty great._________________________UPDATE 6-ish months later: This thing smells. Really. When I first received it, I figured that was just the smell of a newly painted device. About 6 months later, this thing still reeks. Chemical or metal, I can't tell...but its bad. I can smell it from 2 feet away on the side table.","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1617667200000}
{"reviewTitle":"Better than my previous one","reviewDescription":"It's a nice portable charger to have. I've had a 22000mAh portable charger and this one has more juice in it which lasts me about 2 more full nights of charge than my previous one. Overall very nice","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Multiple inputs no flaws","reviewDescription":"Useful","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609372800000}
{"reviewTitle":"Gets the job done, mostly.","reviewDescription":"You have to accept the fact that while technically accurate, the mAh ratings on all power packs, with a few exceptions, are NOT accurate regarding what people expect. On the back of this unit it clearly says \"30000 mAh \/ 3.7V\". Well, you divide 3.7 volts by 5 volts and you get 0.74. Now, multiply 30,000 * 0.74 and you get 22,200, which is about the mAh I've gotten out of this. This math works for most all of them too. Also, they used to rate these things in Amp\/hours too but figured out most people think 30,000 mAh is so much more so they all started doing it. This same unit is actually 30,000,000 microamp \/ hours.Overall it seems to be a good unit. It's large and heavy but you have to expect that for the capacity. It takes quite a while to charge because of the capacity but should last quite a few phone charges. I like it and I'm happy with my purchase, at this point. We'll see what the future holds.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"At first I was impressed","reviewDescription":"At first I was impressed. I used it for my trip and it fid great job beaides that is inconvenient, thick and heavy for traveling. But after few months it wqs holding charge.less and less. I bought one more for my niece. She took it to her trip and immediately returned said it did noy work at all how sge excpected it. Overal I still like it and I am using it at home. But it is heavy to take it anywhere.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644105600000}
{"reviewTitle":"Poor documentation, inaccurate info on weight","reviewDescription":"This is a solid power source for a good price, but it is sold as weighing 358 grams and actually weighs 488 grams on my kitchen scale, and has more or less useless documentation that you have to figure out by experimentation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660608000000}
{"reviewTitle":"Heavy","reviewDescription":"This is much heavier than I expected. Purchased it for travel and will not be using it for travel at all. A bit bigger than I expected as well. Would definitely go with a smaller more lightweight portable charger for travel.  Is very torn in deciding if I should just return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639008000000}
{"reviewTitle":"Not what I expected","reviewDescription":"Although this backup battery lasts me a few days for my phone, it is not quite what I want it to be for power. It is only provides 2.1A output so my phone still drains if I use it normally while charging!  I would rather have a charger that gives more power output.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620345600000}
{"reviewTitle":"6 months later it will drain my phone looking for a charge","reviewDescription":"6 months later it will drain my phone looking for a charge. It does not hold a charge for more than 48 hours without needing a full recharge.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"1 of the port not working","reviewDescription":"I bought this mainly to charge my samsung galaxy S1 ulta. Does NOT work. I thought it must be the cable but nothing was charging. All other ports work ok. I'm not going to buy another one as I am really sadden with the result but overall, the other ports work so I'm not giving it a 1 star.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625875200000}
{"reviewTitle":"Lasted for 17 months of light use","reviewDescription":"Worked fine the few times we used it. Completely stopped charging (output) after 17 months, without warning.  I'd expect it under heavy use, but not once every few weeks. I've got smaller chargers that are 3 years old with no issues.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"Good battery but misleading title (e.g. fast charge)","reviewDescription":"Long battery life and solid battery. But I selected this as I needed a fast charger and this is not that. Misleading","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660089600000}
{"reviewTitle":"USB c did not work","reviewDescription":"My problem was the USB c did not work. I have multiple  cords Samsung Google and Amazon, so it was not a cord issue. The  other features all worked as advertised .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623110400000}
{"reviewTitle":"Doesn’t work at all","reviewDescription":"I forgot to return this item I was traveling with my boss for 3 weeks so I couldn’t return it but I try to used it it didn’t work at all it was not super cheap for it to not work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629158400000}
{"reviewTitle":"Not worth the purchase","reviewDescription":"I ordered 1 the first time it did not work at all, the second time i got one again only one cable would work out of all the cables that could be connect to charge devices.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629936000000}
{"reviewTitle":"Stopped working entirely after 4 months","reviewDescription":"This charger worked well for four months. Then one of the two USB charging ports stopped working, and one week later the other one stopped working. So it is fully charged but has no ability to charge any other device at all","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Avid battery enthusiast, very disappointing battery bank.","reviewDescription":"Pretty disappointed with these batteries. I purchased 2 for a upcoming international flight. I was going to use them to charge my oculus quest 2 and phone for a flight that was 24-30 hours, while testing at home the battery won't even stay on while charging my phone, the battery just turns off after charging for less than 2 or 3 minutes.  At first I thought it was a isolated problem with one of the batteries so I tried the second.  NOPE!! Both batteries will not stay on. I really wanted to love this product, I love portable battery banks and the fact that they enable electronics to be used while on the move. These however,  miss's the mark... by a lot.  I can not in good faith recommend this product for any type of use.","isVerified":true,"ratingScore":1,"reviewReaction":"52 people found this helpful","country":"United States","date":1620950400000}
{"reviewTitle":"Did not charge","reviewDescription":"Did not fast charge as product claims. Product was heavy making it a nuisance to travel with.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"The worst I ever got I bought 2 month ago I used it 3 times now I can’t use it anymore","reviewDescription":"The worst I ever got I bought 2 month ago I used it 3 times now I can’t use it anymore Because isn’t working don’t be scammed","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Defective","reviewDescription":"Only charges my phone twice then doesn't charge anymore. I hook it up to charge the battery and it says there's still 3 lights.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Expanded and broke instantly","reviewDescription":"Something expanded like a balloon inside it and broke within a week, never even used it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Fantastic powerbank","reviewDescription":"Had to get a new powerbank after my previous one broke down after lasting for 3 years. Such an amazing powerbank. I was able to charge 4 times my iphone 12 pro max. It’s very sleek and not that heavy. Perfect travel companion.Update: The power bank died. returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"These are 33.334percent junk","reviewDescription":"I bought 3 of these and one of the battery packs micro usb port is screwed up so it won't take a charge with the micro usb port so buy something else .","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Do not purchase.  The unit will stop working and customer service is horrible.","reviewDescription":"I used this device one time while traveling.  Everything worked fine.  I go to use it again and it won't charge my cell phone.  It also shuts off before charging a tablet and a small speaker.  Customer service is horrible.  They told me that tablets are usually 20v and it won't charge that.  This is false.  Most tablets are 5v.  Mine is a 3.85v and it still can't charge it.  This device can't fast charge let alone slow charge small devices.  Do yourself a favor and find something else.  A faulty unit is one thing but when a seller attempts to give you false information because their product doesn't work and they don't want to be accountable...  That's a HUGE problem.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1632700800000}
{"reviewTitle":"No me funcionó","reviewDescription":"Conectado una hora sin tocar el celular y solo cargo un 30%  tengo un poco X3 pro que carga con QC 3.0 y la descripción de la batería dice que es QC 4.0 pero ni reconoce carga rápida mi celular","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Works great","reviewDescription":"Works great and keeps phone and electronics charged All day.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Good quality","reviewDescription":"Great quality and size and easy use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Great!","reviewDescription":"I never go to a theme park without this bad boy! Definitely worth the money. Charges my phone super fast!Has a flashlight","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Meta Quest 3 VR headset needs it the most!!!","reviewDescription":"This charger is perfect for charging your quest 3 VR headset, you can use the charging cable that comes with the quest 3, then plug it in, and put your charger in your pocket, and then you can use your quest 3 for up to 12 hours, depending on the power consumption of the VR software, and during the charging and use period, the quest 3's battery will always stay around 90% up and down. It can be said that it is very good, but note that this is a 30000mAh battery, so it is on the heavy side, twice the weight of the average mobile phone.  If you have a Quest3 and are looking for a high-capacity and cost-effective power bank, I highly recommend it, and you can even use the Quest3's own charging head to charge this power bank.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"LOVE IT!  I camped for the weekend and it almost powered multiple things the whole time!","reviewDescription":"It's been less than two months and stopped charging.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Great size! Powerful! Great Price","reviewDescription":"Just buy it! You won’t regret it. I’ve had Anker Power Banks. Definitely would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Good buy","reviewDescription":"Definitely last long, don't need to charge often , I don't leave home with out it. It is a pretty heavy device.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715212800000}
{"reviewTitle":"Get it","reviewDescription":"This thing is a beast. I can charge my phone 2 to 3 times with it..  Holds a charge for a long time as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Excellent performance and quick delivery","reviewDescription":"Ordering was easy, delivery was quick and on time, works beyond ecpectations.  Recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Power it up! This is the best!","reviewDescription":"Love this power fast charger! It's a little big, but worth it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
