{"reviewTitle":"Great usb-c cables, excellent value!","reviewDescription":"What's more to say, they work, they're reliable, they're durable, they support all the necessary fast charging standards, they're 100w, they have a nice green light on the one end, and you can't beat the price for a pair of high quality usb-c to usb-c cables. This is my 2nd set now, I was that impressed with the first set. Can't beat them, especially for the price. Thanks INIU for making quality cables at a great price point.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"My favorite charging cords","reviewDescription":"I've been using these cords for years and through multiple phones now. They work great with the power block that comes with Samsung galaxys. I'm rough on my main charger. I travel a good bit with it, and even worse, I use it while it's charging a LOT. As most of you know, that leads to the inevitable fraying near the end. These cords handle it super well and typically last me about a year each, even with me having absolutely no regard for the poor thing's well-being.When used with the stock usb-c samsung power block that came with my galaxy s20 ultra, they charge faster than any other charger, hands down (including the cords that come with the phones)....and I'm talking 1% to 100 in less than an hour if you're not using it, and probably less than an hour and a half, even if you're on it the whole time, scrolling through videos and such. I can't speak on other power blocks because my old Samsung one is the only usb-c to usb-c I've ever owned, but I can assure you that any slower charging certainly wouldn't be the fault of the cord. I just reordered a new set last month due to my last cord from a previous order getting the fray of doom, and they are definitely still being made just as well as they were when I got my first round. 10\/10 recommend these over any other cord.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"It’s great","reviewDescription":"I recently purchased the INIU USB C to USB C Cable, and I have been thoroughly impressed with its performance and quality. This cable offers fast charging capabilities and a reliable connection for my devices.The 100W power delivery (PD) feature of this cable is a standout attribute. It allows for high-speed charging, ensuring that my devices are quickly and efficiently powered up. Whether I’m charging my Samsung S22, Note 20, iPad Pro, MacBook, or other compatible devices, this cable delivers the charging speed I need.The 6.6ft length of the cable provides ample reach and flexibility. It gives me the freedom to comfortably use my devices while they’re connected to a power source without feeling restricted. The extra length is especially convenient when I’m charging my device from a wall outlet that may not be in close proximity.The nylon braided construction of the cable enhances its durability and longevity. It feels sturdy and well-made, capable of withstanding daily use and potential tangles. The braided design also adds a touch of style to the cable, making it visually appealing.The USB C to USB C connection ensures a secure and reliable transfer of power and data. The cable fits snugly into the ports of my devices, and I haven’t experienced any connectivity issues. I appreciate that I can confidently rely on this cable for a stable and uninterrupted charging experience.Another feature that I find useful is the inclusion of two cables in the pack. This provides a backup option or allows me to have one cable in multiple locations, such as home and office. It’s a convenient bonus that adds value to the purchase.Overall, the INIU USB C to USB C Cable is a high-quality charging cable that delivers on its promises. Its fast charging capabilities, sturdy construction, and convenient length make it a reliable companion for my devices. Whether I’m using it with my smartphone, tablet, or laptop, this cable consistently provides a dependable and efficient charging experience. I highly recommend the INIU USB C to USB C Cable to anyone in need of a versatile and reliable charging solution.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Best cable used till date and high build quality","reviewDescription":"This cable build is excellent and also great value for money. The best mobile charging cable till date! The samsung cables fade in front of this.  The packaging too was very professional!The led indicator is a great add-on since it indicates if electricity is flowing thru your device. This indicator helped me find chargers with auto stop feature when device is not consuming electricity. Most chargers continue to keep indicated voltage which is not good for the cable and device.  This cable helped me find this drawback in chargers! Only good quality chargers will auto stop voltage availability if no consumption is being made at destination!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Good charging rate","reviewDescription":"I was surprised it actually allowed higher charging rate. Using the same charger brick and the same device, the charging power improved. The cable allowed higher current through it. So far, it is looking promising. Nice, and sturdy. The length is also good.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Great cables!","reviewDescription":"Perfect cable to charge any of your USB-C charging devices! They last a good while, I had purchased 2 before and just purchased two more. These cables are very durable and the green light lets you know the cable or the charging adaptor are properly working","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Wire snob likes this cable","reviewDescription":"I'm a wire snob and I care about getting quality wires for my electronics. I look for good charging speed, wire durability and something that's not gonna screw up my laptop, phones and other devices. I'm not using these cables for data at the moment so I don't know how they perform with that.Overall, these are great cables and I'll probably continue buying from this brand. Quality is always a concern when buying from brand I've never heard of but these are clearly well made and seem durable. I like how it's braided on the outside and the part that connects the braided cable to the connector is often a weak point in cables that I've purchased in the past, but this one looks like it won't fall apart. The green LED on the USB-C connector is a little gimmicky and I don't really care for it, but at least it's dim enough that it doesn't bother me at night. I also like the rubbery tie to keep the cable organized when I don't need the full length.Overall, great quality cable, highly recommended and easily on par with brands like Anker","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Toughest cable out there..","reviewDescription":"I bought several inui USB A to C 10' cables a few years ago, and the quality was phenomenal. The only reason they failed is our puppy chewed them one by one, each time my kids left the chargers plugged in and cords on the ground.This time around, I purchased several new Samsung super fast chargers and ordered inui fast charge 100W USB C to USB C cables to match... They have a tough nylon braid, yet are still flexible and come with a silicone organizing strap (that is securely anchored to the cable, so they won't fall off or get lost) and have the green led charge indicator. The cable ends are a permanent molded one piece design with a firm yet flexible strain relief. (They don't have a 2 piece flimsy cover like most of the cables out there do)If they last as long as my old ones did, I'll be happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Durable from a reliable company, Iniu","reviewDescription":"HOW I SELECTED THIS POWER CABLE AMONGST A BILLION OUT THEREThere are so many cables out there, it's hard to know who to trust. Because I bought half a dozen Iniu battery banks over the past few years for myself and as gifts, I was confident in their product. Quality materials, well built and when my battery bank did have a glitch, INIU took care of me with a replacement very quickly. INIU isn't a company you buy from and never hear from again. They'll take care of you.WHICH INIU CABLE THOUGH?INIU does make a few cables so it may be hard to pick. I knew I wanted a 100w one for charging my Macbook Pro M3 base and to be able to use it to charge my wife's Air M2 as well. I purchased two pairs of these exact cables for trips out of the house and to also connect my computer to a docking station I have in my home office.FEATURESThe braided cord makes it so that the cord moves where you want it rather than all crumpled up like those vinyl ones. Black offers a clean look too. Any cord 100w or higher needs to have a special chip in it to make it work and this one has a lit up LED so you know it's working. I also like that the cord has a rubber structured piece between the actual USBC and the cord itself to keep its longevity. The weak point was addressed. Despite the affordable price, INIU did include a quality rubber wrap to keep the cord tucked away when not in use or when traveling.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Still working","reviewDescription":"Been a few months now and this still works great.  Personally I love the little LED light on the chord as it helps me to know it's plugged in.  I could see it being a bit annoying at night if it's next to your bed, but the LED is only on one plug, so you can plug that into the wall and not worry about the light by your face.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Amazon’s newest problem child…..it tanks in every respect.","reviewDescription":"I am writing this review as a personal, honest account of the company Iniu and what has been a nightmare of an experience which will never happen again. Cause I will never ever purchase another Iniu product as long as I am alive. This is what I wrote the company and my personal account of what transpired. Amazon was contacted and issued a refund as the norm. That was perfectly fine, but I wanted the company itself to know what I thought of them and below is what happened.More specifically the company customer service itself, the website and the primarily the product under the description of “USB C Cable, INIU 100W [2-Pack 6.6ft] PD 5A QC Fast Charging USB C to USB C Cable, Nylon Braided Type C Data Cord.” only sold on Amazon, and their customer service, and horrible experience I had with them. They don’t care what you the consumer thinks or says. So be forewarned.First off, I purchased this item on May 4, 2022 and the cables are as described. That isn’t the issue. It goes down from there. They have a non-functioning website. I couldn’t even ask for help or submit my request for help on their website and “contact us.” I had to send it via email which I found on their website. The support site is non- working.Yes, great hi-definition pictures all over your website are awesome. But if you don’t have an excellent the working\/functioning website, great customer support, and a product that actually does what you say\/works; what do you really have? The answer is nothing. They will continue to upset more and more customers\/consumers as time goes on.What they do indeed have is a non-functioning website. They do have a horrible product (2 different cables that both died within 3 weeks of one another) They do have the worst customer service I’ve ever experienced anywhere, (from all 52 countries, 157 websites, 26 magazines and counting) and last of all items on the checklist being they do have the inability of the customer to ever speak with anyone other then one employee named Lina. Even after requesting it 3 different times. Read below for more. Yes, it gets worse.So I had to copy and paste the email I wrote for support and send it to them manually where I got a auto-reply response from the beginning. I specifically stated to them in my initial email “I suggest you contact me ASAP and do a little more then state “we will send you 2 replacements at no charge.”I told them from the start “If your email just says that then you can disregard this email completely and see what happens.” That’s exactly what their auto-reply stated. And unfortunately for them I review electronics for a living and freelance writing goes in magazines\/websites all over the world. Not just Amazon. To prevent anyone from having the same experience I had. Keep reading.Secondly, after I looked up the company they only are logistically partnered on Amazon. The distribution company isn’t Iniu. Second red flag. If I had to guess, these are primarily made in a Chinese sweat shop somewhere and cost is low which should be another flag. Never, ever purchase a deeply discounted product for your expensive electronic items. Especially iPhones and iPads.Yes, they have 11k reviews on Amazon. Don’t be fooled. The company\/customer service is as bad as the product turned out to be. A product that will break in less then 3 weeks. Soon to be a company known for their broken products and terrible customer service.Yes they have this so-called 3 year warranty. But do you really want to keep contacting them 10 times in a year to keep getting replacements? Or spend an extra $10 once and be completely satisfied for 5 years or more.They were not getting the reason why I wanted to speak with a manager. I tried and tried again to get them to understand. He\/she\/ the bot refused to let me speak with anyone (all by email of course) above them.BOTH OF MY CABLES DIED WITHIN 3 WEEKS OF ONE ANOTHER!!! I NOTICED SOME CHARGING VARIATIONS FROM CABLES I SINCERELY TRUST LIKE uGREEN AND MOPHIE, AND EVEN AMAZON BRANDED ELECTRONICS COMING INTO THE GAME.WITH THESE CABLES SOMETIMES MY IPAD CHARGED IN 45 MINUTES, OTHER TIMES IT TOOK 3 HOURS ON BOTH CABLES. BOTH AT THE SAME BATTERY LIFE. THIS IS A DO-NOT-EVEN LOOK-AT-PRODUCT AND COMPANY. THEY HAVE THE WORST CUSTOMER SERVICE BOT\/LINA\/YOU MAY NOT SPEAK WITH ANYONE ELSE BUT LINA. WHO RESPONDS FROM SOMEONE WHO DOESN’T WRITE FROM THE ENGLISH LANGUAGE.THEY REFUSE TO LET YOU SPEAK WITH A MANAGER AFTER YOU REQUEST TO OVER AND OVER, AND ALL THEY CAN SAY FOR THEMSELVES AFTER A HORRIBLE EXPERIENCE, IS “LINA A CUSTOMER SERVICE MANAGER,” WE WILL ARRANGE TO SEND OUT 2 NEW CABLES IMMEDIATELY.”No we will not. I would not trust another item from this company Iniu as long as I am alive and beyond editorial reviews. Simply stated if you want a product you can trust with your $1300 iPhone and $1400 iPad DO NOT USE THIS COMPANY. Go spend the extra $10 and get a cable(s) from a trusted, reputable company where you can count on the product support as much as the product itself. Thank you.","isVerified":true,"ratingScore":1,"reviewReaction":"38 people found this helpful","country":"United States","date":1653955200000}
{"reviewTitle":"Chord Not Working","reviewDescription":"First, the chords seem well built and should hold up well.  However, one of the two chords I received does not work.  The light on the chord flashes and the phone cycles between charging and not charging.  The second chord works well.  I am using these chords with the INIU 30w charger for a Samsung S22. I will upgrade the rating if INIU customer service honors their warranty.Edit:  Now second chord stopped within a day and a half of starting to use.  These chords are just shiny junk.  I'm returning to Amazon.  Why would I want to deal with INIU's warranty?  Besides, they'll be gone in a month or be operating under a different name.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Avoid these cables - Poor Support Process","reviewDescription":"Purchased these cables twice, when they work, they work well. Expect about 2 months of use before they stop working. I tried contacting their support and they feel the need to do a \"browser check\" first. The first thing they check for is that you are using Chrome, the second step is they REQUIRE YOU to install a third party browser extension called \"Voice Search\" that is completely irrelevant to the matter.  Unless you install the third party browser extension, you will not be able to contact support [could be malicious\/spyware, idk I didnt install it]. Total nonsense, I'd advise you to not install any forced third party software in exchange for their BS warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Already quit working after a week","reviewDescription":"Both of the chargers already quit working after a week of use. One of them now only flashes when it's plugged in and the other doesn't fast charge anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Misleading marketing","reviewDescription":"Simply put, this cable does not do what it promises. 0\/10. I will be returning these cables. Fix your advertising.The cable is marketed as having 100w charging speeds. These charging speeds are pictured on the box, and the Amazon page specifically mentions being compatible with the MacBook Pro. I bought this cable for use with a MacBook ProPro for work, and it does not deliver the advertised charging speeds. Rather than the 100w charging speeds, these cables were only able to reach 60w (See picture of Apple Charger Information). This is the explicit reason I bought these cables over other ones. This is worthy of a 1 star review.I tested the Apple cables and I was able to reach the full 100 watts of charging speed. Meanwhile, these cables only hit 60w, regardless of the battery level of my MacBook Pro. I tested both cables, and both cables in the box capped out at 60w. I am forced to believe that these cables are lying about what they are.Otherwise, these are good cables. The ends are a bit long and rigid, so they wouldn't bend into tight spaces, but that's the only complaint I can think of. I did not have a chance to test the durability of these cables, because I will be returning them.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1642550400000}
{"reviewTitle":"They both broke In a week I wouldn't buy again","reviewDescription":"They fell like a really good cord but both stopped working in about a week I thought it was the power block but no I'm bummed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Both didn't last 6 months","reviewDescription":"Both chargers shorted out within 6 months. The cord feels sturdy but it definitely isn't. I don't recommend unless you like replacing chargers.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Messed up my charging port","reviewDescription":"These chargers kept saying I had water detected in my charging port, it also did it to my boyfriend's phone too.  When I tried using my other chargers to charge my phone, it would take me 30 minutes just to get my phone to start charging.  A week after I tried using these chargers, my phone can finally charge without hassle, but its slow to charge my phone compared to before.  DO NOT BUY!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"These Cables do not have 100 watt throughput","reviewDescription":"I bout this two back because it was more affordable then other options for my laptop that needs 65 watts.  I have a 150 watt power supply that can put out 100 watts out of one USB C port or 80 watt and 60 watts if you use the two USB C ports.  There is no configuration using these cables that puts out over 60 watts.  I get a bios warning that the power supply is underpowered when using the 150w power supply with only this laptop plugged in with one of these cables.  I tried all ports.  I plugged in a USB C hub that has PD Pass through.  That reduced the power to the laptop to 52 watts.I remembered I have a Anker USB C to USB C 100 watt cable.  The Anker cable works and doesn't give the under powered warning with and with out the USB C Hub.If you are trying to power a 65 watt laptop DO NOT buy this cable.  Instead spend a little more and purchase Anker or another reputable brand.  I can't comment on using this cable with other devices or data delivery.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1642896000000}
{"reviewTitle":"Moisture Sensor Errors","reviewDescription":"These cords are garbage! They work fine until the cord tells your phone there is moisture in the connection. It happens when it disconnected unexpectedly or I turn off my car and hesitate to remove the phone. Sometimes trying to make cords smart is stupid. Regular USB c cords are what I'm going back to.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"One was physically broken, the other was apparently spiritually broken…","reviewDescription":"one star ratings are just too eye-catching and difficult to trust. Sometimes they are written in anger by someone who got burned. Sometimes they are written by a direct competitor trying to pad their own position. These are reasons why my experience with this product did not receive a one star rating.  My wife can be reckless with her things. Her Macbook Pro however has withstood years of abuse being on the road in suitcases and day-bags and just about any other parcel that you can imagine.  Recently she said to me that (after several years of use) her original white charging cord had finally given up and cashed it in. She asked if I would get her a replacement. Oh course I would, why wouldn’t I?  Off to Amazon I go. Do a quick search and a quick scroll and happen upon this set of cords. Reviews are good, price is right, they look nice, let’s effin goooo!!!  I buy the cords, they ship as expected and I receive them in a timely manner. Take them out of the package, they look nice, feel durable, appear to be well made. I give them to the wife, she thanks me, and everything is as it should be with the world.  Jump ahead a couple of days, wife says that the cord that I bought for her isn’t working and hasn’t worked at all since she initially tried it out. That’s odd, I think.  So I grab the cord in question and give it a quick once  over. Check out one end, seems fine. Examine the length of the braided jacketing, it checks out. But when I get to the other end to check the jack it seems a little bit wiggly.  well wouldn’t you know that the end just popped right out at the solder joints. This can happen. Rapid manufacturer et. al. mistakes can happen that are difficult to see in QC.  No big deal. I tell her to just grab the other cord and use it. She says that she already had taken it and it too does not work. I figure that is very unlikely and just anomalous. So i take the 2nd cord, inspect it to make sure that everything is intact (which is the case) and decide to try it out on my own Macbook Pro.  So I plug one end into my power supply and the other into the Macbook Pro aaaand it simply does not charge it.  I know that Macs can be picky, especially as it pertains to oem peripherals but honestly, current will flow when a proper connection is made and will not flow when a proper connection is not made. ezpz physics. For whatever reason, with these cords the proper connections were not made and in the end neither cord could be used to charge either Macbook Pro.  Was it just bad luck or did I buy and get sent garbage? I dunno. I do know that I can not recommend purchasing these cords unless you have a very very strong urge to throw something away and you hate your money so much that you will spend it on anything at all just to get rid of it. Though that seems pretty uncommon.At least it didn’t get a 1 star review, right? That would have been just terrible.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697155200000}
{"reviewTitle":"Not really fast charging (10 watts max)","reviewDescription":"I firsr used this cable to connect my Samsung phone to a 65 watt USB-C charger. Upon pluggibg in, I realized that the phone would only charge at 10 watt rate & not the 15 watt ultra-fast rate.  Despite the claims of the manufacturer this cable clearly does not meet expectations. I am sorely disappointed at both the manufacturer and for Amazon for advertising a product that is clearly defective or inferior. The only reasob for 2 stars that this cable will still work with traditional usb-c devices, however I still cannot count on it to work at charge rates above 10 watts ... very disappointing as most modern devices will support these hugher rates.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"It does NOT transfer video. Buy this only if you need charging cable","reviewDescription":"I was expecting this to do both charging and video\/audio transfers, so I could use it to connect my mac to my monitor which also provide power. It charges the pc, but does not transfer video or audio. Just FYI. It is great for charging. But, If you will use this to connect your pc to your monitor, it does NOT work!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Doesn't hold up long","reviewDescription":"I initially ordered 2 cords worked great so 2 weeks later ordered 2 more, after about 3 months both my bedside and car charger work intermittently the wires I assume are thin and bread inside the strong protective cord.... they charge \"super fast\" when they work but I'm constantly insuring the cord is in perfect spot and charging before I go to bed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Charging only, cannot connect to a USB-C monitor","reviewDescription":"Unfortunately the USB-C specification is confusing and unclear—but this cord is a charging cord, it won’t allow you to connect a USB-C port on a computer to a monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Trouble Charging","reviewDescription":"I had purchased these cables earlier in the year and they worked great. They charged my iPad quickly and I did like the led light which told me it was connected. I decided to buy a few more recently and these cables did not perform the same. On some of the charging blocks I used, the led light would stay on even when no device was connected. On other charging blocks , even a genuine Apple charging block, it would not charge my iPad at all. The new ones were a waste.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Didn't last long","reviewDescription":"I have nothing to say really , because the cable is already broken just like all the others every time to it always the same spot right where the kick plugs in that short area of the cable becomes weak then that don't work ANYMORE","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Lasted just over two years","reviewDescription":"Lasted just over two years before the wire shield started deteriorating. The cable still functions, but it is definitely pretty compromised at this point. There was no trauma on the cable, and it rarely left my house, just steady deterioration over time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"This cord stopped working after 2 weeks","reviewDescription":"I really liked this cord in the beginning,  but it just totally stopped working 2 weeks after my purchase was delivered.  So very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Charger","reviewDescription":"Didn’t last long in my house. I bought these thinking they would be tough and last maybe 3 to 6 months. My boys showed me, the cords and my money that they weren’t durable as I hoped. Lasted almost 4 weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Supports 100 watt.","reviewDescription":"Supports 100 watt.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Carga rápida","reviewDescription":"Muy bueno mi celular carga rápido lo que me ahorra tiempo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great Buy","reviewDescription":"Really great buy for the price. Great quality. Cool clean look. Most importantly, it works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Gets the job done. Quickly.","reviewDescription":"This cable was everything as advertised. I am fully satisfied with the look, the feel, and the functionality of these cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Great charger!","reviewDescription":"Love these!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great quality!","reviewDescription":"Very impressed with quality of these cables.  Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Love it","reviewDescription":"Love that it came with two. It works fast and works even if the USB is upside down or not.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Works","reviewDescription":"Solid product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Good","reviewDescription":"Looks good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"CARGA SUPER RÁPIDO, EXCELENTE!","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"100 watt fast Charger","reviewDescription":"This charging cord is great. Charges fast, especially with a fast charging C type charging block. It is also fast with a fast charging tower but not as fast as with the block. The cord is thick and durable. Good quality!Just be aware that it is a C to C type charger and if you have USB blocks or towers you will need a USB to C adapter. They are very inexpensive so not a big deal.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Excelente producto","reviewDescription":"Me encantó, fabricante muy serio en todo su papeleo, eso da mucha credibilidad. Muy feliz","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Nice gear","reviewDescription":"Works great seems to be of good quality material I have not got to really  put it through hard work yet i just got mine a couple days ago.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Sturdy","reviewDescription":"Very sturdy and the light is nice so that you know it's seated correctly and your device is being charged.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"High durability and reliability","reviewDescription":"I've had these cables for 2 years. One finally starting splitting from the insulating wrap. Daily use for 2 straight years across various devices at this price is pretty incredible. The damaged one is still charging although I'm at this listing now to replace it. Fast charging never failed, very reliable. Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Works great.","reviewDescription":"Wasn't certain if this item would work with my ipad and s23 ultra for fast charging, but I'm glad to report it works perfectly.  A perfect replacement for my other cables which were defective.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Great price with discount","reviewDescription":"Just received but like what I see and the price couldn’t be beat after discount!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Good cables at a good price","reviewDescription":"Cables are good. I would say about the same as any other though. I would say price was better though.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Durable cord","reviewDescription":"Cord and neck of the cord are built to last and has consistent charge","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Thick charger","reviewDescription":"Type c to type c this charger charges my phone FAST. I like that it lights up on the side you plug into your device too. Very thick cord I would definitely buy these again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Great product","reviewDescription":"Great product, as described.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Best cord ever!","reviewDescription":"This cord charges my phone in less then a hour ...so worth it !Seriously I bought one for me,every one in my family and my boyfriend...and I swear all we have to say is buy one and you'll have it forever!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Great Cords","reviewDescription":"I needed to pick these cords up because the usb-c to usb-c that came with my new phone isn't nearly long enough. These cords are 6.6ft and work perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Love these!","reviewDescription":"Super fast charging and data transfer. Great product for a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Great Quality","reviewDescription":"Ideal for fasta charging. I just bought a 45W charger but needed a good quality cable. This fills mi expectations at all.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Love theses","reviewDescription":"Great cables, fast charge and not expensive. So happy to have found these","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Great Cables","reviewDescription":"Bought these specifically for the braided material and the cable didn't disappoint","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Cable de iPhone 15","reviewDescription":"Muy buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"BEST CABLES MONEY CAN BUY","reviewDescription":"REALLY NICE CABLES","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Excelente Material y muy buena compra","reviewDescription":"Solo dire esto, Wau... sin palabras, una compra realmente recomendada.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Great Chargers","reviewDescription":"I've bought these like 4 times now because everyone in my house keeps stealing them from me. I also have one in all of the rooms of my house and in my car. They are super sturdy and last forever. Definitely the only chargers I'll be buying from here on out.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"they seem heavy duty","reviewDescription":"it works, it’s sturdy, lets see if it last longer than a month","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Fast Charging Cables Work Flawlessly","reviewDescription":"I absolutely love these cables and they have led indicators that there is power going through them on one USB C side only. They do support my 65w charger block and get the job done quickly. Best of all since they came in a bundle of 2, I saved money!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Good cable, great quality but E-Marker data is incorrect","reviewDescription":"I like these cables. The quality is good: The connectors are good, the length is good and the size of the connector works on every device I have tried them on so far - with and without cases. They put up with plenty of abuse from my daughter resting the full weight of her iPad on the cable for hours at a time. I like the LED indicating when the cable is providing power to a device. The only thing that I do NOT like is that the E-Marker (internal chip that is required for cables that support the 100W rating for these cables) report that these cables are USB 3.2 Gen 2 cables. Which they are not. They are missing the Rx and Tx pins that make these any type of USB 3 cable. So while they work great for charging, the E-Marker data should be corrected to properly reflect the cable specification. The cables are properly advertised on Amazon as having USB 2.0 data speeds, so I am still giving them a 5-star rating.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Just as advertised","reviewDescription":"Super fast charger! Some chargers that are long don't have much power, but this one is one that I'd choose every single time! Glad I took a chance!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Powerful","reviewDescription":"Great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"It give me super fast charging for my Zfold 4","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Quick Charger","reviewDescription":"It's durable and quickly charging our devices. Thank you so much!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Buena capacidad de carga genial","reviewDescription":"Bonito diseño","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Charges quickly","reviewDescription":"I have an S22 Ultra and this charges my phone quite fast and I love the green light indicator on the end if the cord ai tou know it is plugged on properly.  My phone is at 57% and it will take 38 minutes to charge. I also love you get two and not too expensive.  Definitely reccomend but you need a charging brick compatible with micro USB-C.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Fast Charging Cable","reviewDescription":"It's been a very nice cable & has held up great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Nice quality","reviewDescription":"Durable feel and quality to the cables and connections, even comes with a nice wire tie that I wasn’t expecting. Love that it states the speed for my own future reference! Between the price and quality this is a win. It was cheaper than the 30W wire I originally was planning to order from another manufacturer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Buena calidad","reviewDescription":"Excelente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Works!","reviewDescription":"Tested a OEM cable and this cable with an OEM block ans it gave the same estimated time to fully charge.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Charger wires","reviewDescription":"Very flexible use to use while plugged in dosnet brake","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Excelente","reviewDescription":"Cumple con lo que promete","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Very fast charging","reviewDescription":"This is worth the money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"So fast","reviewDescription":"My sister needed a new charger, for her phone. As soon as she plugged it in it started changing. Was fully charged in just over an hour.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Works as desired.","reviewDescription":"The packaging is smartly done with recycling in mund. The cable is robust with braided nylon sheathing and grommet that provided good bend and breakage support. The connector housing is firm and made to last, though makes the connector about 4mm wider in dimension than the \"C\" connector. I had no trouble with my phone case, yet with a case that uses a cut \"X\" cover over the USB-C input there might be an issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Very durable!","reviewDescription":"I ordered two 100w fast charger usbC cables. They appear very heavy duty! Plugged one in to super fast 65w charger and the other end into son's tablet. I really like the little light that comes on to let you know that it is being powered and functions. Pretty impressed so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Great cables! UPDATED Not so reliable","reviewDescription":"These work great for my Pixel 6 Pro. Charges rapidly which means it really is fast charging my phone. Plus I love the little green LED light that shows the cable is working. These are a good buy. They feel thick and premium.UPDATE: One cable stopped working after only one day. The green LED light flickers on and off constantly and won't charge any of my devices. So far the other cable is still working. But it's only been a few days.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650499200000}
{"reviewTitle":"Lasted 6 Months","reviewDescription":"I really loved these cables, but after 6 months of normal use, both of them had exposed wires.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651449600000}
{"reviewTitle":"Failed after a year, flashes the light and doesn't charge","reviewDescription":"As seen in the video after a year the light on it started flashing constantly and doesn't change tried multiple charging bricks no luck.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1707523200000}
{"reviewTitle":"Pls contact me-- I love these BUT","reviewDescription":"Half the ropes don't work after 1 weeks use. The other ropes & plugs are very fast for Samsung 21fe","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1708560000000}
{"reviewTitle":"Only works with High Powered Chargers","reviewDescription":"Works fine for power delivery. For example I have it connected to a 20w PD charger and it's fine. When I tried using the cable to connect to the USB-C port on my desktop, however, it keeps disconnecting and reconnecting. No other cable has this issue but when I plug it into a 20w or even 100w PD charger it's fine. Must have high resistance or something.Mediocre cable. Hopefully it lasts and doesn't burn out my charger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1692748800000}
{"reviewTitle":"Not a fast charge capable cable.","reviewDescription":"Plugged it into my pixel 7 and it says charging. If it were fast charging it let's me know and would say fast charging instead. I have fast charging cables these are garbage","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1701216000000}
{"reviewTitle":"Cables were great until charging became unstable","reviewDescription":"I like the product, but recently the connection is unstable. If I move the cable to a certain position I lose charging. If I move it again charging comes back.I originally purchased this on April 7, 2021 (2 years ago). Today's date is July 19, 2023.I'd really like a replacement since I'm still under the 3 year warranty and still liked the product when it was working well.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1689724800000}
{"reviewTitle":"Charging cable for Lenovo laptop","reviewDescription":"The charging cable felt really good quality on hand, braided, long and provides fast charging.But caution, one of the cable used only for a week suddenly stopped working all together.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1700438400000}
{"reviewTitle":"The cable is not secured enough to the connector.","reviewDescription":"I have a few of these wires.  They are good but I noticed this issue shortly after using 1.  Maybe it's just a defective product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1697414400000}
{"reviewTitle":"Doesn't fast charge","reviewDescription":"Quality cables, but they don't fast charge. Shouldnt take 1 1\/2 hrs to charge from 35% if it's labelled as a fast charger. Unfortunate.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1692835200000}
{"reviewTitle":"Fast charging, doesn't stay seated into device.","reviewDescription":"This product supports super fast charging but is difficult to keep plugged in securely.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Not fully compatible with dock","reviewDescription":"When used with Plugable UD-3900PDH, the dock's HDMI 1 port does not work. HDMI ports 2 and 3 do. Same problem with a USB-C cable that came with a refurbished 2021 iPad mini. It may be the dock however Levnovo and Fasgear USB-C cables work fully well with the dock.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Great for about a year or so","reviewDescription":"After about a year or so, The ends start disconnecting, exposing the wires. I don't disconnect or reconnect as they are in a fixed part of my office and only disconnect when traveling (a few times a year). So if your usage is more or less than that, you may have different lifespans for the item. Until it was unsafe (with the exposed wires), they worked great and was very fast.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"They work","reviewDescription":"Pretty much just that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Does what it's supposed to.","reviewDescription":"Charges my phone fast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Good charge pack cable replacement","reviewDescription":"Cables are good for replacing charging cables for simple battery charging. The cables do not work for charging an iPhone 15 pro.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Lasted about 8 months. Update: 3-year warranty fulfilled","reviewDescription":"I used this in my living room to charge my iPad Air and it worked great for awhile.  I liked how fast it charged and the LED let me know it was charging.  I mostly used it with an Apple USB-C 20W power adapter, but I also used it with a Hyphen-X 100W power adapter.I ordered this on November 29, 2021 and by July, 2022, it had stopped working.  The LED lights up for a bit, but then turns off.  Sometimes the LED would go on and off intermittently.  I tried cleaning each end a few times with an electronic duster or canned air.  This did not help.  The iPad, when it sees it as plugged in, says it is \"not charging\".  It goes from \"not charging\" to not even recognizing that it is plugged in.  When plugged into the Hyphen-X 100W power adapter, it disrupts power to other devices plugged into the other ports of the same adapter.  I have tried 2 Apple USB-C power adaptors and it does not work with either of them.  I have verified that each power adapter does work fine with another USB-C cable.Update:  3-Year warranty fulfilled!  After posting the above review in early August 2022, I was contacted by someone from INIU service via email (iniu.shop) with an offer to send me a replacement at no cost to me and with no requirement to return the faulty cord.  There is a 3-year warranty on these cables, as they mentioned.  I received a replacement in a few days after I provided my shipping address.  The box contained 2 cables like the original order.  I am now using the new cables and they are working fine.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1659052800000}
{"reviewTitle":"Great length & fast charge, but stop working after months","reviewDescription":"I received the two pack for a pretty great price and initially really liked the length, its quick charge of my MacBook Pro, & it’s outer appearance.The cords have a nice feel and I love the little rubber holder they come with for transport.Unfortunately, the cords’ durable appearance hasn’t translated into them lasting very long. Despite being fairly careful with the cords, they both have stopped working in about 4-6 months.The first cord started having issues (charging light wouldn’t light up, charging would go in and out while plugged in and not moving, only charging if cord was at a VERY specific angle, etc.) after about 4-5 months.I gave up trying to fix it\/get it to work, so I moved on to the 2nd cord. That one also worked for about 5 months as well, before having issues that were similar to the previous cord.Just as I was about to look into getting some replacement cords, I found one angle of the cord that would work, so I taped it in place to my desk and squeezed out another month or so of using it haha. I guess it finally gave out today though as no amount of my finagling with it gets it to work again :(Nothing appears to be wrong or broken looking from the outside, so I’m not sure what the problem is!I really want to be able to recommend these for the length and performance, but if the cords don’t last any longer than the apple brand ones, I’m not sure it’s worth it :\/","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655769600000}
{"reviewTitle":"Disappointed, the light only lights up when charging.","reviewDescription":"The only reason I chose this cord was because I thought the light would be constantly on.  When the cord falls off the table it sits on, it's a lot easier to see it on the floor when it's lit up.  That's how my old cords were, and I liked them so much I bought this one thinking it worked the same.  But it only turns the light on when you put it in to the phone.  Other than that, it's a charging cord.  Quality seems fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Didn't work in my computer","reviewDescription":"USB-C cables make me nervous because they all have a chip in them to negotiate power, and do who knows what else... This didn't work in my computer and I'm just going to buy a more reputable brand.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Slowest charger ever!!","reviewDescription":"It’s supposed to take 10 hours to charge my computer?? Slowest charger I’ve ever seen","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675209600000}
{"reviewTitle":"TERRIBLE QUALITY","reviewDescription":"I bought these a few months ago. They are terrible and wear out near the charging pod.These were replaced recently upon a complaint. Thanks","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1656028800000}
{"reviewTitle":"Uno de los cables vino dañado exteriormente","reviewDescription":"Al revisar el producto al abrir la caja, encontré uno de los cables con su recubrimiento dañado como se puede ver en las fotos.  Está deshilachado.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1650499200000}
{"reviewTitle":"Worked great for 3 weeks","reviewDescription":"Cheap cables are annoying when you come across them. These cables worked for 3 weeks before both crapping out. Save your money. I already have to attempt to return these for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1641859200000}
{"reviewTitle":"Looks nice, but doesn't last","reviewDescription":"I really like the indicator light, and feel of the cable.What I don't like is that it quit working after a month of usage.  Cheap junk, go with a known brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1639699200000}
{"reviewTitle":"Didn't work and returned","reviewDescription":"Needed this to work between my HP docking station and HP laptop.  Got one that was to have the power and data transfer level that I needed, but it didn't work.  Sent them back.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1627257600000}
{"reviewTitle":"Not fast data","reviewDescription":"I was looking for a fast charging cable that I could also use to connect the signal to my usb-c monitor. This cable does not provide a fast enough data rate for that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1637020800000}
{"reviewTitle":"Terrible…would not work","reviewDescription":"I tried these with multiple different power boxes and would not work. Would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1666569600000}
{"reviewTitle":"Works great when using it, but not durable","reviewDescription":"When working properly it works great. However, these are not durable. The ends are a weak point and the outer covering breaks easily. Both of these busted In less than 2 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638748800000}
{"reviewTitle":"Quit working in 2 months, buy a better brand.","reviewDescription":"These stop working after around 2 months. The company's \"3 year warranty\" requires that they be sent back in the original packaging, which is a plastic bag. So that's pretty ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1637625600000}
{"reviewTitle":"Very resilient and worth the price","reviewDescription":"This is my second set I’ve bought in 2.5 years!I still have the first two cables…..I’ve taken these on road trips. And use them in my work truck as well as my personal vehicles! They are made with a durable material and what I think is cool is the rubber strap to help keep it organized and neat. Definitely the Best Buy for any traveler or avid iPhone lover. It has never damaged my phones or iPad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Speed","reviewDescription":"Speed at its best","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Great","reviewDescription":"The light helps you know that it is charging. Great little gadget.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Just as advertised","reviewDescription":"Product came as advertised and had been wishing excellently","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Great charging cable, doesn't support some data","reviewDescription":"great charging cable, but it doesn't seem to support some data transfer. I can't use it for video for my monitor or for certain higher end data protocols. That said, I love the light on it indicating power and since it has the distinctive light I never get it confused with my data focused cables.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Looks durable","reviewDescription":"Will see how it works out. So far it looks promising.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Light only lights up when charging","reviewDescription":"I wanted this because I wanted to be able to find the end of the cord in the dark. And I didn't want one of those full cord light up ones. The light only lights up when it charging. Which I suppose is good if you need extra confirmation that your device is charging but I don't really need that since I can look at the screen and see that. I suppose it does what it says it does but it doesn't suit my purposes, will be returning. Just a heads up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Works quickly","reviewDescription":"Used for charging phone","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"It works","reviewDescription":"Does what if says.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Kinda love it","reviewDescription":"Love the length, but the littlest bump unplugs from your phone. I'm using it very carfully","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Dead less than 3 months later","reviewDescription":"One side of the cable has a green LED light on it whereas the other does not. If you have the green LED end on the end with your device, you can see whether or not it is charging. In the last week, the green LED end has stopped lighting. So basically I got a little less than 3 months use out of a $13.99 100w charging cable. You can bet I won't be purchasing another one of these. I don't think this cable should bear the sticker of \"Amazon's Choice.\". Interestingly, once you've crested 30 days after your delivery of the product, there doesn't appear to be a way to get in touch with the seller.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1641859200000}
{"reviewTitle":"Another failure for USB-C charging cables","reviewDescription":"This is the second pair of INIU 100W Fast Charging USB C to USB C Cables that I purchased to charge my IPad, unfortunately the 1st pair did not last 3 months before they stopped charging and the 2nd pair did not last even 1 week (I ordered the 2nd pair before the 1st pair quit working...).  At least I was able to return the 2nd pair to get a refund, but I missed the window for the 1st pair.  Fortunately the pair did not cost a lot so it was just a lesson learned.  I did like the light that indicates (in theory) that the cable was actively charging the device","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1636675200000}
{"reviewTitle":"Useless as a USB-C monitor cable","reviewDescription":"I wanted a longer USB-C to USB-C power and data cable between my MS Surface Pro7 and Samsung USB-C monitor.  The Surface Pro \/ Samsung monitor work fine with the short (~2ft) cable provided with the monitor, but not with other cables.  This new cable enabled the Surface to charge from either the monitor or my 35W Anker charger, but fails to provide data signal to the monitor.  I tried both cables and both directions.  The included instructions clearly say this cable provides data.  I re-installed my short OEM cable and all works fine, so I know nothing is wrong with my devices.  My search continues...","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1636761600000}
{"reviewTitle":"Doesn't work for data transfer","reviewDescription":"The design quality is great. But I bought this to use both for charging and data transfer. The data tranfer is not at all working. I have tried connecting to a laptop, phone and even Android auto is not working.Beware this cable doesn't do data transfer. Now I have to buy a different cable.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Will NOT deliver 100W! False advertisement!","reviewDescription":"Unfortunately, this cable does not deliver even 65·W (20·V @ 3.25·A) from a laptop charger. Nowhere near the 100·W power delivery capability as advertised. Do yourself a favor and go with another product.After writing the review initially, I was contacted by someone claiming to be with the seller's customer service department; however, after I answered their questions regarding the manner in which I was using the cables, they never responded to my follow-up email.If I could give this product zero stars, I would. Buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1649376000000}
{"reviewTitle":"Stopped working","reviewDescription":"It stopped working after a month","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Stopped working","reviewDescription":"Keeps blinking not working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"It suppose to be Data cable, it's NOT","reviewDescription":"Using Samsung s10e phone for USB tethering to XPS 13 with USB C. Regular stock cable is USB C to USB. So have to use USB C to USB adapter for Regular Samsung  cable. Got tired of using adapter after reviews chose this one.Regular cable = you plug phone, computer sees phone right away, window pops up.This cable = you plug and NOTHING, computer won't even see phone!!Tried both of their 2 pack cables!! Carbage cables with fancy lights on them!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643846400000}
{"reviewTitle":"Not compatible with Pixel","reviewDescription":"This is a terrible cord. My Google pixel 6 factory charger with the short factory cord charges at hyper speed. I swapped out the factory cord for this longer cord still using my factory Google charge and now it's adaptive charging then maybe regular charge speed.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Look nice but looks don't make them work properly","reviewDescription":"These look and feel like sturdy long lasting cords but within 1 week when after I plugged them in they caused my phone to give a charging error message and will not work with any charging block at all. Very disappointed.  Buyer  beware.Update - 10\/10\/22  Company sent me improved replacements and they both work as advertised! I changed my 1 star to 3 star . If these cords are like my improved replacements  I'd recommend purchasing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649116800000}
{"reviewTitle":"Charger does not charge my Galaxy S9","reviewDescription":"this product does not charge my phone. Any other 100-watt cord does. I am ashamed of wasting my money on this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649980800000}
{"reviewTitle":"this does not deliver 100w as advertised","reviewDescription":"Product does not deliver 100w as promised with significantly slower performance than a stock apple cable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663632000000}
{"reviewTitle":"Very Good. 5A measured. But, one worked the other did not.","reviewDescription":"Very Good. 5A measured on one. But one worked the other did not. The bad one would only let 1A though, Then complete Failure. Found out too late to return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1636156800000}
{"reviewTitle":"Only lasted 3 months","reviewDescription":"It was amazing the 3 months it worked. Doesn't charge no more the green light just blinks once something is plugged in.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647734400000}
{"reviewTitle":"Have to wiggle it to get it to work.","reviewDescription":"Brand new, but need to wiggle it to get it to work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658707200000}
{"reviewTitle":"Wasted money.","reviewDescription":"Tips broke off both cables in less than a month with normal, careful use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Lasted 2 months","reviewDescription":"Doesn't last. The light is a novelty and means nothing. Garbage cable","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1656115200000}
{"reviewTitle":"Doesn't charge anything","reviewDescription":"Tried to charge my phone, iPad, headphones and nothing worked","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660348800000}
{"reviewTitle":"Absolute garbage","reviewDescription":"The connection formed by the cable is loose, so that the charge keeps cutting out.  Worthless purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"Stoked working after 4 months.","reviewDescription":"It was great untill it wasn't. Stopped working after 4 months like every other cable. Is there any quality control with this garbage?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1635292800000}
{"reviewTitle":"Only lasted 6 months","reviewDescription":"While I appreciate the charging indicator light, after 6 months the cable has stopped charging my iPad or iPhone no matter what charger I use. The green light still lights up when connected, but the device never charges even when left overnight.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Damages connection","reviewDescription":"Damages cell phone connection","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1628035200000}
{"reviewTitle":"Junk","reviewDescription":"Don't always work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1650153600000}
{"reviewTitle":"bad quality","reviewDescription":"not recommended. stop charging within the first week on multiple cables.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1634774400000}
{"reviewTitle":"Defective!!","reviewDescription":"Horrible product! buy a different brand. Just don’t buy this!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1634083200000}
{"reviewTitle":"Not well made","reviewDescription":"Failed in less than a month","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1639958400000}
{"reviewTitle":"Dead on arrival","reviewDescription":"Came dead... not worth returning","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1635724800000}
{"reviewTitle":"Great, while it lasted","reviewDescription":"Bought two on May, one of the cab!es  is already kaput, not used to often, and always by my bed. This morning it decided to call it quits. Will see how long the second one lasts.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"One cable is not working","reviewDescription":"One of the cables is not charging, it is connecting and disconnecting.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Wire isn't working","reviewDescription":"The wire I purchased didn't work. Not charging fast and  heat up phone","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Maybe no","reviewDescription":"I got these cables for my new iPhone 15. Yes, it charges fine but somehow it's difficult to plug in.  I'm not sure because the size of the cable is a little bit bigger than the charging hole or whatever but I would not buy it again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"Worked properly for exactly 12 days beyond my return window. Absolute fail. Received replacement.","reviewDescription":"Update: 5\/14\/2022Seller reached out to offer a replacement which I've just received. Adding a star for that, but will not update further unless it works reliably for a year or more. If it fails sooner than that I'll be back to deduct another star. Kudos for the proactive customer service at the least however.Original Review: March 2022I've used these with two different USB-C 65watt power blocks for my Thinkpad. Both have been moved perhaps twice - other than that they have not moved. One is at my bedside, the other at my desk.The one at my desk got flaky two days ago, became intermittent after, and now only works reliably when inserted in a one particular orientation (LED light facing down). It will not work the other way around, regardless of which end is at the power supply. This tells me the connector internally is cheap and compromised such that the weight of the cable itself allows it to make contact\/connection when used the opposite way that it HAD been used for a month.These look nice. The braid is stiff and seems durable. The LED light is an excellent little plus.But if they're cheap, they're cheap. Will not re-purchase from this brand ever.... And there are so many copycats and rebranding for this sort of electronics equipment these days it's hard to tell what's what. Frustrating when even the garbage looks like good equipement.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649030400000}
{"reviewTitle":"Good cable but not 4 wireless charging stands.","reviewDescription":"About a month ago recieved a set of cables in the mail.  Ones that actually work.Data transfer rate is definitely much better.  And I can now charge my phone if I directly plug it into the USB C port.But the circuitry inside the connector of the cable will not recognize my cordless charging stand and will not power it.  Car charging was why I originally bought the cable.Good cable but not for use with wireless charging stands.**** Original review ****I bought this cable to charge my smartphone while driving to and from work.  I was all excited because of the capacity of the cable but both cables were dead (not working) out of the box. Received replacements and they also did not work.I bought a car charger of the same brand so the USB C should fit with no problem.Even flipped the cord and no luck.Attached photos showing no damage, dust or debris.Took a USB C cable I know that was good and the output was just fine from the DC charger.Amazon sent me replacement set and they are also defective.  They must have received the batch of bad cables.  But the DC USB charger seems to be working fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649808000000}
{"reviewTitle":"The connected device is not supported","reviewDescription":"When I connected my Galaxy S20 FE 5G this morning the green light went off.  Was working yesterday and one month prior in multiple places.  Anybody can hep please 🙏","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Handles fast high power charging","reviewDescription":"These cables carry high power and fast charging requirements without issue. I have a couple of PD bricks for laptops and these work great with them. They are really well constructed and feel good in the hand, a reasonably thick and stiff cable that still coils well but resists bending.Well, I am on my third (last one) of a three pack and it has developed the same issue as the other two (see photo). Just below the reinforcement at the bottom of the plug, the cover separates and the wires come through. (Photo shows the white lining; eventually green and red wires will work their way through that.)No wires are broken, and the cables still work fine... for a time.  The little wires do break eventually. I have not bent or twisted these in any way and I have been gentle plugging and unplugging from devices, straight in and straight out.Bottom line, they work very well for everthing I've used them for. They just have a shorter lifespan than I would have liked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659052800000}
{"reviewTitle":"In the beginning things were great, but then everything fell apart!","reviewDescription":"After about 3 months of daily use. Everything starts to separate. Yes, they charge extremely quickly. They are great for charging. I actually love these until this started. I actually bought 4 of them, and I use 3 on a daily basis. The fourth one I have as a backup. The 3 that I use on a daily basis all look like this. I would show all 3, but in all honestly, the first one I threw away when it happened. I didn't think about saving it or even doing a review until the other 2 did the same.Edit\/update 11-07-2022The manufacturer contacted me about my post, they refunded me. Money, said it was a manufactured defect. And sent me more cables. So far the cables seem to be working fine, and a manufacturer stands behind their warranty","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Terribly slow data transfer; have not yet tested charging","reviewDescription":"I advise buying different data cables if the purpose is data transfer. I very rarely submit product reviews on Amazon but I felt that a caution note is relevant here.The claimed transfer rate specification in the accompanying product information sheet isn't impressive: 480 Mbps, as in 480 million bits per second. It therefore won't be faster than 60 million Bytes per second. And indeed it did not go faster than 40 MBps (Bytes\/second) in my test (see the image).That result was obtained when transferring digital images from a Delkin CF Express Type B Power 128 GB card, in a Sony MRW-G1 reader, with a destination in an NVMe fast SSD mounted directly to the motherboard of my PC. Other cables will give me a transfer rate of 730 MBps (18.25X faster).I have not yet tested charging rates to see if it can live up to the 100W claimed specification. I am giving this product the benefit of the doubt for charging by rating it at 3 stars, having knocked off 2 for the abysmal data rate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639094400000}
{"reviewTitle":"Restricted charge flow ...","reviewDescription":"These are ok, but there's better out there. I found these to restrict the charge flow to about 2.0 amps, versus the full QC3 flow rate. The LED is nice I guess. The SooPii brand shows you the actual wattage being flowed to the device though, and passes a full QC3 flow rate to the device. So, I would pass on this brand. Amazon link to the SooPii cables is below.https:\/\/www.amazon.com\/SOOPII-Braided-Display-MacBook-Samsung\/dp\/B0BN86PWWY?pd_rd_w=GFqud&content-id=amzn1.sym.deffa092-2e99-4e9f-b814-0d71c40b24af&pf_rd_p=deffa092-2e99-4e9f-b814-0d71c40b24af&pf_rd_r=782C7Z90M95RDEME8D1S&pd_rd_wg=htbri&pd_rd_r=c918daf7-cb26-4140-aa70-cd474d3289b4&pd_rd_i=B0BN8542KH&ref_=pd_bap_d_grid_rp_0_1_t&th=1","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"when it works, it really works well!","reviewDescription":"Unfortunately of the two that came in the pack, one works brilliantly and the other is intermittent.  The iPad it's failing on has worked well with other chords.  We will be asking for a replacement for the defective unit.  That said, the little green \"connect\" light is really a nice feature.  You can always tell if your iPad is connected or not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"It’s pretty good","reviewDescription":"I love the quality to these","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"Disappointed","reviewDescription":"Only \"fast charged\" for 1 day. Now it's taking forever ... total waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"I don't recommend","reviewDescription":"Only one of the cables work","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"It does not work for Dell laptop and Dell monitor","reviewDescription":"I tried to use this cable to connect my Dell laptop and Dell monitor(s). Dell monitor cannot detect the laptop. I tried with another dell monitor and different dell laptop, it does not work either. I thought Dell monitor were defected etc.. After I tried with different USB C to C cable, they are perfectly fine. So, definitely this cable does not work for Dell laptop to Dell monitor.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1651363200000}
{"reviewTitle":"Does not charge 100w, is only one sided","reviewDescription":"Flip the charger over and it doesn't work at all","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Stopped working after 8 months, starting to fail around 6 months","reviewDescription":"The lighted end stopped making a connection after 5 or 6 months.  I started using the opposite end which bought me a few months.  After 8 months they stopped working completely.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1681257600000}
{"reviewTitle":"Work great, when they want to","reviewDescription":"I have no idea how these wires have such good reviews. They are absolutely terrible. Right out of the box, the first was tempermental. Only worked when it want to and if you move it around too much, the stop charging but remain plugged in. Frustrated, i tried the second one and i am getting similar results. The second one is a little better but not by much. When they do work, they charge extremely fast.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1635897600000}
{"reviewTitle":"They break within a couple months!!!","reviewDescription":"Buyers beware, while these cables may seem to be a great product and deal, they do not last nearly as long as you would expect. I have gone through both cables within a few months! To put that into context, the apple usb c cable lasted me close to 5 years! Even though that product and other high quality products may be more expensive, in the long run you will end up saving money (and have a much more reliable product).","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1629331200000}
{"reviewTitle":"Fried a $2800 MacBook Pro","reviewDescription":"Plugged this cable into the charger that came with my MacBook Pro.  At first it didn't show as charging at all, so I moved the cable slightly.  The laptop charged for a second and then powered off, and now it won't turn on.  Likely fried the entire logic board which is a very pricy repair.  Do not buy these cables!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646524800000}
{"reviewTitle":"These cables are garbage","reviewDescription":"The tips of these cables easily bend and come loose. Then, they intermittently charge. My MacBook “blings” over and over again as if it’s connecting to power but the battery never gets charged. Runs down to 0 and shuts off.  Plus, no clear way to file a warranty claim. I’m STILL digging around to find out how to replace them.  Pure crap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1645747200000}
{"reviewTitle":"How do you contact customer service??","reviewDescription":"Usually don't write reviews but i bought these charging cables hoping i would have some chords that lasted me a wail!  I'm trying to contact customer service cause of the 3 year warranty they \"Claim\" but dont know how to if anyone does please lmk !! They Didn't even last maybe a couple of months!!! 🤷‍♂️","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1660003200000}
{"reviewTitle":"Cable robustness.","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"Super fast capable","reviewDescription":"Decent quality, super fast charging capabilities...the cloth braiding probably won't last super long but I'll buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"updated review from negative to positive due to excellent INIU after sale service\/support!","reviewDescription":"Updated review:Due to my initial negative review and probably my fault but INIU after sale department has reached out to me and offered me a portable charger for the inconvenience. The customer service from INIU is top notch and backing their products, great job and I would recommend and will do business with them in the future for outstanding customer service\/support! Just a note: when ordering usb-c cables, need to really know what you are using it for! For charging devices, most of the cables including INIU should be fine but if you need it to connect usb-c docking station to laptop or other external devices where video\/audio pass through is needed then you will need cables with much higher data throughput much like 5gbps rated or higher as usb-c specs varies and not all are made for all purpose!Original review:I read the reviews and it is good for the price and it's braided for more flexibility so I order it to be used to connect between my usb-c docking station and my new Dell G15 laptop. After connecting this cable, there is notable lag of the mouse and external monitor so I switched to the second cable and still produced the same behavior. I switched back to the original cable that came with the docking station and no lag at all. I did the elimination process making sure it's not a defective cable but both failed to perform so I return it without requesting for replacement. I can't comment on the data transfer rate or charging rate cause if these cables can't pass the basic connection standard then it does not matter.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1649462400000}
{"reviewTitle":"Got shocked while holding my phone","reviewDescription":"I use this to charge at night and haven't had a problem with it except the green 100W light.  I eventually got around to plugging that side into the wall and the other side into my phone.  When I held my phone, I received a couple shocks similar to that of static electricity and dropped it.I unplugged the power block from source.  My block has an LED light to confirm power.  Even though it was disconnected, it and the green light were flashing.  I turned the cord around and plugged it into the phone, no lights.  I put it back, lights flashed and block still was not plugged in.  The annoying light will stay at my phone reluctantly.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1672272000000}
{"reviewTitle":"Great for fast charging but NOT for Display use","reviewDescription":"Great product and really aids when fast charging, but look elsewhere if you plan on using this to drive a display from your smartphone or laptop to a monitor. Slightly disappointed.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Data stopped work but charging is best","reviewDescription":"I’m fed up with this cable. It work last night, but today not working. Power charging is fine but data isn’t work. It on and off, fed up with this. I had to use other cable (apple original cable), work perfectly.Updated: they sent me new cable, and still unable to detect any data. I tested other computer, sometime it work, sometime it not working. I think this cable didn’t went too well with data with my MacBook with iPad. However, good news that power charging is very powerfully and work very well. My iPad and MacBook battery went 80% pretty quick. I made decision that I’ll use cable to charging my iPad and MacBook only, I’ll use other cable when I need use the data.Updated #2: People have reported that it does not have a power rating of 100 watts. Please disregard them; they are incorrect. I have evidence from my MacBook's system information, which shows a result of 100W. People said 40-60 watts because their charger (not cable) does not have a 100 watt rating. If you buy a 100 watt charger, you will notice the 100 watts.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"LED turns OFF when Disconnected from Phone","reviewDescription":"Updated 13 May 2022.I purchased this cable to quickly charge a Samsung S22 Ultra while traveling.  The LED lets me know at a glance that power is actually flowing through the cable which is important in a hotel room as most outlets are worn out and you sometimes need to prop the charger to make a good contact.I took off 1 star because the description doesn't explicitly state that the LED turns off once the phone is disconnected so I still use an older INIU USB A-C LED cable to \"slow\" charge the phone at night and the LED stays on as a nightlight (so I can find the cable) when I disconnect the phone and don't want to turn on the lights.After scouring the reviews and Q&A, I did find a comment regarding the LED but this is the type of information that should have been included in the product description.I have not found any USB C-C cable where the LED stays on when the phone is disconnected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1646870400000}
{"reviewTitle":"The replacement cables work great! WAS: This cable DOES NOT support 100W charging","reviewDescription":"I was contacted by their customer representative after I posted the original review (below), and was told that the cables I received might be defective. They kindly sent me a couple of new cables and both of them work great as expected (100W charging).Therefore, I change the rating from 1 star to 4. In fact, I really love the quality of the cables. Would give them 5 stars if I hadn't received the defective ones for the first time.ORIGINAL POST:This cable does not support 100W charging although it claims to do so. I tried it on my macbook pro 16inch with a usb-c tester. With the original apple cable, I was able to get ~100W charging speed, which are confirmed by both the usb-c tester and \"System Report\" tool in MacOS. However, with this cable, it would only reach to 60W, and my 100W charger was recognized as a 60W charger in MacOS too.Regret that I bought this one and missed the return window.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1661644800000}
{"reviewTitle":"Super fast charging (updated)","reviewDescription":"I just got this not even a week ago. It came with 2 chargers. The first one is already not charging properly. Keeps going off and on and instead of charging my phone, it's killing the charge. It did its jobs the first 3 day but not durable at all! I can see why it came with 2 chargers..Updated: I received 2 chargers and they have been working wonderfully. Everyone that uses them complementos how fast they charge their devices. I have one in my car and one in my house. Super fast!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Worked great for 4 months","reviewDescription":"This brand has impressed me over the years. Everyone in my family has their power bank because we trust them. Unfortunately these cables aren't as trustworthy. After a few months, they just stopped charging continuously, as if they can't stay connected. But the light would still be on so I thought it was my phone. So I bought a new phone and now it just won't work at all. The other one will stop charging my iPad randomly. I can't replace that, too, so I have to find better options.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679961600000}
{"reviewTitle":"Works great","reviewDescription":"No complaints","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Flexibility","reviewDescription":"Well it feel like a good product let's see how long it lasts","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"C Cable","reviewDescription":"ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Shielding comes off but they work well","reviewDescription":"These cables are great for \"super fast charging\" for my Samsung s21 plus. They last for 3 to 6 months before they start falling apart. I have purchased these 3 times in the past year (December 2022, March 2023 and November 2023). I wish they held up better. I keep them in the same locations and am careful when I plug in and unplug my device but the shielding always comes off at the ends, usually on the end that goes to the power supply. They work great, especially for the price but once the wires are exposed I replace them.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"This is likely a 5A\/100W charging cable. Voltage drop and cable resistance are plausibly in spec.","reviewDescription":"Section 4.4.1 of the USB-C Cable and Connector Specification states that the maximum permissible IR voltage drop on Vbus and GND shall not exceed 500 mV and 250 mV, respectively. Therefore, at 5A drawn on Vbus, its resistance must not exceed 100 milliohms, and GND must not exceed 50 milliohms.The measured (4-wire Kelvin) resistance values for Vbus and GND are approximately 85 milliohms and 65 milliohms, which are both plausibly compliant with the specification given connector mating variability, and in any case do not exceed a total of 150 milliohms.One star deducted for some specimens measuring over 150 milliohms.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Nice","reviewDescription":"I like Iniu cables.  Wish they lit up better like the older models.  Very sturdy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Cargan bien, pero para los whats que dice que tiene, creo que se queda algo corto,","reviewDescription":"No siento que carga tan rápido los equipos, pero fuera de eso, funcionan más o menos bien.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Great has a 3 year warranty","reviewDescription":"I love them","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Good cables","reviewDescription":"Pretty good cables.  Out of the many I bought, did have an issue with the end molding separating from a couple, exposing the wires.  Support was quick and easy to get them replaced though.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Buen producto","reviewDescription":"Excelente recomendado","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"New out of the box didn’t work! Check update below","reviewDescription":"Update on 4\/16 The sellers of this item sent me a new pack to replace the one that did not work out of the box. They replied quickly to me after seeing my review.We just opened the second box up and it didn’t work. Brand new out of the box and didn’t work. Unfortunately we have already passed our return window. Now I know to check every cable when received in the mail!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648339200000}
{"reviewTitle":"Good quality","reviewDescription":"Recommended","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"Loved it while it lasted","reviewDescription":"Bought two of these in April and they are now broken. Basically lasted 6 months. The length of the cord is great and it seemed sturdy. Just completely stopped working out of the blue with no visible damage. I'm very gentle on the cords as well. I really expected them to last a lot longer.UPDATE: The seller stood by their 3 year warranty and sent me a new cable. Upping my review because of this, but is still unfortunate that it broke in the first place.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1632614400000}
{"reviewTitle":"Replacement good","reviewDescription":"Update of Below:  Manufacturer reached out, replaced free of charge, seems to work fine so far. Nice quality cable, I appreciate the light showing activity.Light stays on mostly, but flickers off, and only maintains or DRAWS power (for LED?) such that have sucked power from 50% down to dead for phone overnight.  Looks great, doesn’t work.  Multiple outlets\/chargers have this issue, not other cables. It’s the cable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639440000000}
{"reviewTitle":"This item is great","reviewDescription":"The only this that i don’t like about this charging cable is that the green light doesn’t shot off. Charges great and  and it is long enough and sturdy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"After initial disappointment--the vendor honored warranty perfectly and made it right!","reviewDescription":"My original two cables failed early.  However, following my disappointing review, the vendor reached out to me directly and very quickly provided a full replacement of the cables, reminding me that they fully stand behind their 3 year (3 year!!) warranty.  The new one works and I am confident that, if there are any problems in the future, they will make it right.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"Great construction - but the power light is annoying","reviewDescription":"The build quality is great. The braided cables feel very sturdy, the length is convenient - they are exactly what they claim to be. The ONE THING that I would change is the horrendously bright power light that turns on whenever the cable is plugged in - it doesn't need to light up the room!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"fast charging but broke after a month and a half","reviewDescription":"the charger was great  for the first month or so. then a couple of weeks ago i notced it started to tear. it was still working but now i need to place it at a certain angle for it to charge. other charges i have had lasted me at least a year.EDIT:After posting this review I got contacted by customer service and received a replacement quickly. I have to say I am very impressed with them. They were nice and available.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638316800000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working after 31 days. It also seemed like the cable didn't charge as fast as it should. The cables are also too stiff for my liking. Thirty-day return is also small, but I didn't notice it at the time of purchase...Update.. the seller reached out to me and offered to replace my defective cable. My new cable works well, and they should be commended for making things right.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632787200000}
{"reviewTitle":"Does NOT work for devices other than phones!","reviewDescription":"This charger was perfect for charging my phone: the cable was high-quality, it charged fast, and the light indicator was a nice touch. However, when I tried to charge my earbud case which also uses type C, it refused to charge! I have to use a separate type C charger for it, which is pretty annoying. If it could charge other devices, this cable would have been absolutely perfect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633132800000}
{"reviewTitle":"Open Boxes","reviewDescription":"So I ordered a set and somehow Amazon sent me an open box.  Not just open, the seal had been half ripped off of the box.  The seller was great and sent me a replacement....and then Amazon sent me ANOTHER open box?!  I don't really understand how Amazon allows open products to be sent, let alone twice in a row.  The seller did their best to make it right and it's not their fault, but that's incredibly frustrating and that's why I've giving a rating of 3.  On the plus side, I've tested one of the cables so far and it works great.  I'm pretty sure it charges faster than the cable that actually came with the phone somehow.  Hopefully the rest of them work just as well and maybe I'll come back and update my rating if they do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1684886400000}
{"reviewTitle":"ok","reviewDescription":"it transmit","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1708646400000}
{"reviewTitle":"Cable failed on a few months after purchasing","reviewDescription":"Cable failed to charge or provide power after only a few months.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Australia","date":1702857600000}
{"reviewTitle":"Company stands behind their Warranty!","reviewDescription":"Update:  06\/08\/2023…..seller reached out on their own to rectify the issue with cables. They sent replacements of the cables, no questions asked. The customer service is above average compared to others. I will bump up the ratings based on the company, it’s still to early to speak of the cables themselves. Purchased these March 13. One of the cables went around end of April. Started using 2nd cable at that time and it stopped workinh roughly two weeks later. Trying to reach out to seller has no luck. Purchase .ore expensive cables, it will be cheaper in the long run.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1684022400000}
{"reviewTitle":"Doesn't activate turbo charge on xiaomi phones.","reviewDescription":"Didn't do what I was hoping so kinda a waste. I wanted it to activate my turbo charging on my xiaomi phone which it did not.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1695686400000}
{"reviewTitle":"Doesn't work on my S20 Ultra (UPDATED)","reviewDescription":"I've only tried one cord so far, but it didn't work on my phone (S20 Ultra), but works on my wife's phone (S20 Plus). My phone charges fine with other cords, so I'm not sure what the issue was. I didn't have a case on my phone at the time and tried using both ends.UPDATE: Now both cables don't work at all (I just got them this afternoon). They don't light up anymore or anything. Don't waste your money or time with these and just get the real ones from Samsung.UPDATE 2: After writing this review I was contacted by the manufacturer through email and they sent out a replacement free of charge. I received the replacement the next day and they cables seem to be working fine.It's nice they they stand behind their products like this. I've updated my rating from 1 star to 3 due to the hassle; if the original items worked, I would've given 5 stars, but I've only had one day with the working cables, so I'm not sure if they'll last or not.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"Canada","date":1632268800000}
{"reviewTitle":"Dead after 6 months and no reply for warranty","reviewDescription":"Was working great. One I used daily, and one I used on my travel. After 6 months, both are dead and dying. First one go was the one for travel. Took it with me on my ocassional trips to the office and then three plane rides; barely really even used it... it just sat in my backpack and rolled up even the same way it had arrived in packaging. The other one is connected to my nightstand. It will work sometimes. Have to get it just at the right angle with the USB-C terminal of my phone. Definitely not my phone, it takes my Anker wire just fine.All-in-all I definitely would not recommend for travel.I've reached to the company through their website and their email to honor their warranty. Been some and haven't heard back. A tad bit disappointed I have to say.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1660953600000}
{"reviewTitle":"Little thicker for S22 Ultra phone and 25W wall charger USB-C port","reviewDescription":"It arrived on time. It looks good. But it is hard to insert into my Samsung S22 ultra USB-C charge port and Samsung 25W wall charger USB-C port. The short USB-C cable comes with the phone package and my other USB-c cable fits into both ports well.Update: the seller contacted me quickly after I posted my experience. They sent a new cable package for free. But the new one has the same result as the last one. very Good customer service at least.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Canada","date":1659052800000}
{"reviewTitle":"One cable didn't work as intended","reviewDescription":"The package includes two cables, One cable didn't work as intended, but the other one is really good, it really fast charge my phone and also fast data transfer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1686182400000}
{"reviewTitle":"Mixed results","reviewDescription":"This cable will not connect my drawing tablet to my laptop where another one does. I also have mixed results with plugging in to charge and get a blinking light, unplug, and plug in again with success. Are these one way directional?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1677283200000}
{"reviewTitle":"Ok while it worked","reviewDescription":"Cord worked ok for 8 months then just stopped working altogether. Charging was fairly slow but steady until it died.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"Cable stopped working","reviewDescription":"I was happy with the cables for the first couple months (bought in December) and they kept up a powerful charge until March when they just randomly stopped working. Personally it was an issue for me as I use USB-C as a universal charger for everything, from my laptop to my phone and all accessories. Bit of a bummer really, and an inconvenience at work when it happened.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646784000000}
{"reviewTitle":"Ordered a charge cable not a tow strap","reviewDescription":"Nice looking well built cable but will return. After opening box these cables would be better suited to use as tow straps for pulling a pickup out of the ditch or a cranes winch line vs a cable to charge my phone. Would love to find a flexible, low profile cable that won't wear out the phones charge port anytime it's picked up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643846400000}
{"reviewTitle":"Doesn't always work","reviewDescription":"This wire is great and does fast charging,  half of the time. The other half my Samsung S21 acknowledges that it's plugged in but doesn't charge. I fixed the issue by restarting the phone everytime thus happens, but it really shouldn't occur in the first place. My phone also overheats when this happens","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639008000000}
{"reviewTitle":"Does not work with Docking Station","reviewDescription":"Reason I bought these to work with my Lenovo docking station.  It doesn't not pass enough power to make the docking station work with monitors, etc.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655078400000}
{"reviewTitle":"It's works good but","reviewDescription":"It's a really fast charger with the right box. But with my daughter her green light stays on at all times. Even when it's not plugged in. But other than that no major problems","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652313600000}
{"reviewTitle":"Both cables died within a month.","reviewDescription":"Both of the cables died within a month.Edit:Seller contacted me and replaced both cables. Haven't test them out yet but I will update review when I do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658188800000}
{"reviewTitle":"Great cable - stopped working","reviewDescription":"I love these cables and I've had them for nearly 1 year now. As of this month, they've finally both stopped working. It says there is a 3 year warranty but I have no way to contact the seller now to replace them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644537600000}
{"reviewTitle":"Cable didn't even last a year.","reviewDescription":"Unfortunately, one of the cables in the 2 pack I purchased went bad in less than a year. I purchased these back in October 2021.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654732800000}
{"reviewTitle":"Slow charging-** updated","reviewDescription":"Description says that this will super fast charge however it does not. It is very slow i would not recommend.UPDATE: 3 weeks laterCustomer service reached out to me and replaced the original faulty wires. The new product now works much better than before. seems like a common issue of faulty wires being sent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Works well, nice LED feature","reviewDescription":"Works well and then one day, it stopped working after a year.  LED went out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687132800000}
{"reviewTitle":"Not Durable at all- Updated","reviewDescription":"Update: The company reached out to me and replaced the cables, no questions asked. They were very kind and helpful. I'm going to tentatively increase my review and continue to update it based on how these new cables perform. Good customer service is definitely worth something.After I bought these, they spent about 90% of their life rolled up loosely, sitting in our backpacks. I noticed after using it for a few months that a short has developed in both cables, so that after you plug it in, if the cable moves at all, it will stop charging. There is no damage to the outside and they've spent most of their life safe and protected in my wife's and my backpacks. We liked the length of them, and they did charge our devices well, but this intermittent charging issue is getting worse and worse to the point of making them unusable.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1655856000000}
{"reviewTitle":"Great cable.  I got my Super fast charging 2.0 back on my Samsung tablet.","reviewDescription":"My Samsung Tab S7+ was no longer getting Super fast charging 2.0 (45W charging) message when I connected my charger.  Found out Samsung changed up their charging algos in one of their firmware updates.  Apparently, the 5A cable that came with my 3rd party 65W PD PPS charger wasn't good enough for Samsung.Swapped out my old 5A cable with this one.  I am getting my Super fast charging 2.0 messages again.  Measured the power input on my kill-a-watt meter with my Tab S7+ at 20% charge.  My tablet was pulling around 41 Watts.  Fantastic.Only negative I have for this cable is that the nylon sheath is a bit stiff and abrasive.  I guess it will be durable.  I do wish it was a bit more pliable and not as abrasive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656201600000}
{"reviewTitle":"Stopped Working","reviewDescription":"Bought this charger for my husband and I. 1 still works the other doesn't do anything anymore. Bought it Dec. 30 2022. Disappointed. It's only Feb 26 and only one working.Update: got a replacement and so far so good. They really honor their 3 year warranty and I appreciate that.Still very satisfied with the new charger.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677456000000}
{"reviewTitle":"Bought 2, neither worked.","reviewDescription":"Bought for Samsung S20+ and 2 out of 2 cables did not work.  If only one would work.... Change rating from 1 to 4 after cleaning port on S20+ cable starting working.  Still requires plugging the ends into phone and adapter with a particular side up.  So I could blame the port on the phone, but wife's OEM USB  C works every time on the S20+ no matter how it's plugged in and always did.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673395200000}
{"reviewTitle":"Good material","reviewDescription":"Good product. I will order another one","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685232000000}
{"reviewTitle":"Not enough data speed, but good customer support","reviewDescription":"I bought this to connect a laptop to a docking station, but it didn’t have enough bandwidth to run the additional video\/display output.  If you need your USB-C cable to attach another display, be sure to double-check that the cable had enough bandwidth to support that use\/feature.The seller was very responsive and reached out to remedy the situation.  I received a refund and they even sent me a free 10000mah USB battery bank for my troubles.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1666742400000}
{"reviewTitle":"Work in progress","reviewDescription":"Well they are really good cables, Their customer service is really excellent, My first pair last 30 days, which is the warranty time on them, or thats what I thought  until customer service told me that i was getting a new set of cables for free that they see the cables weakness have worked on it and that they were replacing those that didnt work with new, and they have worked on their product from presentation  to the quality of the materials is remarkable what they have done! I have had then for 2 days now… ill be back after 30!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659052800000}
{"reviewTitle":"Not made for travel","reviewDescription":"Wanted to try some different charge cables. These don't like to be coiled up like some other cables i have.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"I love the concept but it's shorted out.","reviewDescription":"So I use this item for about 2 weeks and it got a short in it. Very disappointing. I like the concept of being able to see that the phone is charging or the item but it just didn't work and if you have expensive phones or a MacBook pro you are not going to want something that's going to short out. Sadly This was not a great purchase. You in","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Broke after 2 weeks","reviewDescription":"This charger was fantastic, but it quit working. All I get is the green light flashing and no charging. What happened?Update... The company got a hold of me and refunded and replaced the defective cords. Outstanding customer service. These cords are  really fast charging. Would recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"Don't waste your money on this","reviewDescription":"These look good, in fact they really look good. Except they're junk. The ends destroy themselves the first time you plug them in. Either side. I couldn't get these to charge my wireless plate at all. After exchanging a plate I thought was bad, I finally narrowed it down to these cords and all of them were bad, or only worked once. Buy Anker and get it over with.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1630713600000}
{"reviewTitle":"False Advertisement. Cable not lit when not connected.","reviewDescription":"The only reason I bought these cables is that I wanted the connector to have an LED light to make it easy to find in the dark. The pictures show it lit when not connected, but that isn't the case. The LED only lights up when connected and charging.The images are false advertisement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646265600000}
{"reviewTitle":"Does not last long","reviewDescription":"Withing 3 months one cable stopped charging, the other cable lasted longer but it still went the way of the first one and stopped charging completely. The only reason I am writing this review is because I was shopping for new cables and saw this purchase in my history. Buy better cables, these are not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"Visibly well built but terrible in practice","reviewDescription":"I purchased these cables so I could have something more durable than the cable Apple send with their MacBook. It felt very well built but using it was terrible. It shorted one of my USB C ports temporarily and shorted my phones USB C port as well. There are plenty of good reviews so this hopefully isn't a wide spread issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1639180800000}
{"reviewTitle":"Failed in two months!!","reviewDescription":"I bought these cables thinking it was a great deal, especially the company giving a three year warranty. Both cables lasted about two months and now I have to purchase new ones until I receive warranty notice.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1660521600000}
{"reviewTitle":"Garbage","reviewDescription":"Defective the first time and the replacement was also defective","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"I bought 12 of these to charge my various devices. Within 3 months of using them, I've thrown over half of them away because they quit working. 10 out of 10, I do not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664841600000}
{"reviewTitle":"The first three months work well, but the connection is not stable after that.","reviewDescription":"this cable works very well for the first 3 months.but the connection is not stable after that.at some point after 3 months, it's connected and disconnected again and again.such thing suddenly occurs and cannot be fixed.i have to twist and bend my cable to get it work..","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"Stopped charging my cell phone","reviewDescription":"This cable worked ok at first, but within a month stopped being able to charge my cell phone. I got an error message when I try to use it and had to get rid of the cable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"Only one cable was a rapid charger...","reviewDescription":"Only one cable was a rapid charger... The second one was pretty much a dud. I really like the cable, just wish it worked.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1636329600000}
{"reviewTitle":"Broke after 2 months of use","reviewDescription":"It seemed to charge fast at first but now it charges slow and there is a loose wire. Very frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1644451200000}
{"reviewTitle":"Defective","reviewDescription":"Brought them a while ago used one then just took the other one out to use it and it defective","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638662400000}
{"reviewTitle":"Not Durable","reviewDescription":"Unfortunately, the first cable stopped working after a few months and the 2nd cable after 8 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646006400000}
{"reviewTitle":"Do not buy this cable!","reviewDescription":"Cable appear to be very sturdy however, after a couple of months the connection became unreliable and often did not work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1639440000000}
{"reviewTitle":"Stoped working within days.","reviewDescription":"Stoped working and the second cable never worked.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1659657600000}
{"reviewTitle":"Trash. Stopped working. Both of em","reviewDescription":"One stopped working after two months. The other stopped after one month. Very trashy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1645315200000}
{"reviewTitle":"Defective","reviewDescription":"Defective right out of the box and it's been returned before.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1628380800000}
{"reviewTitle":"Broke after a week and a half","reviewDescription":"Broke after less than 2 weeks. Minimal use. Cord split where the wire connects to the head.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1637539200000}
{"reviewTitle":"Cable stopped working!!!!!","reviewDescription":"Cable stopped working!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"Stopped working after 3 months","reviewDescription":"One of the cords stopped working after 3 months. We have tried it in multiple sockets and it won’t work in any of them. The other one purchased at the same time still works.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Does not work","reviewDescription":"I am so tired of AMAZON allowing unscrupulous companies to sell on there site. I cant get these C to C cords to work on any device. I have tried 5 different sources ( Ford f150 2021, VW 2020, 120V AC blocks, wall sockets) and 7 different devices needing a charge ( 3 cell phones 4 tablets etc). At rimes the phone will charge but not the tablet.  It is not the device or source because they all work when I use a A to C cord with an adaptor to plug the A into a C. The reason is that these cords only operate at the old USB criteria and Amazon does not require the seller to be honest. They want us to figure it all out. disgusting.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1674864000000}
{"reviewTitle":"broken after 1 charge","reviewDescription":"got these to charge my vr headset--first cable broke after a single charge.second one working OK, but i would get these only if youre in a pinch & not for longevity or reliability.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"C type to C type cable INIU100W  2pack","reviewDescription":"Been using it for two weeks now and I'm impressed it's fast charging and the indicator light makes it easier for me to find in the dark  I would recommend it 👍","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Good cord but frays","reviewDescription":"I love the look of these cords and the light is really cool but one of my cabels is already fraying by the end.  I just am really nervous sinc I just got these .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"DO NOT BUY! Nearly burnt the house down!","reviewDescription":"5 minutes into use and this thing nearly burnt the house down. Ruined my phone that's 6 months old. Melted the charging port, got so hot it turned the completely black.Cannot charge my phone now, I need a new phone.DO NOT BUY!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"Mine no longer charge at a decent speed.","reviewDescription":"I ourchesed these cables earlier this year and quit using them after about 6 months.  They worked well for a while, then stopped charging at a decent rate.  I thought it was my charger. So I bought a new charger and still, not very good charging.  I bought new cables and can now charge properly.  They were good for the short while they lasted though. And it is nice that there is a light indicating when it's charging.  But they just didn't last.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"Do not transfer power","reviewDescription":"it does not transfer the power, with other cables it will say turbo charge, with this cable all it says is charging.  will not recommend.  looks good, feel good don't work good. left me stranded. same charger different cable phone goes on turbo charge.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Great at charging.... The rest ain't great.","reviewDescription":"It's really good at charging, but In terms of durability and data transfer.... they just arn't worth anything.When it comes to data transfer, buth worked for about a month, until one after another, Data wsn't able to be transfered at all. The phone was detected, but data transfer was abruptly cut off from the cable after a few seconds of connectivity. Its durability is also questionable, after 3 months one of the cable's strain protector seperated from the cable shething, and exposed the bare wire. This alos happened to the second cable.Pros:It lives up to its promise of fast charging.Cons:Low durabilityUnstable Data transfer capability.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1658880000000}
{"reviewTitle":"Something is wrong with this cable.","reviewDescription":"I am not sure why, but this cable doesn't work to connect monitor. I read online and looks like any usb-c should work, but this one for whatever reason doesn't.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Received with seal broken","reviewDescription":"I'm not sure it's a right product or used product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1686009600000}
{"reviewTitle":"Dont use on super fast chargers","reviewDescription":"They work wonderfully on normal usb c chargers. Upon plugging the cgarger into super fast charger they dont work to well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1684281600000}
{"reviewTitle":"Article ouvert","reviewDescription":"L’emballage était ouvert quand je l’ai reçu. Ça ressemble à un produit reconditionné mais ce n’était pas signalé lors de la commande.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1683417600000}
{"reviewTitle":"Internal wiring separates over time","reviewDescription":"They worked great for over a year.Now one of the cables has stopped working, the light blinks when connected.  Moving the wire around will make it stay solid in some positions so it seems like the connection inside has become loose.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1675468800000}
{"reviewTitle":"Great when it works.","reviewDescription":"Ordered in Oct of 2021. Considering there is supposed to be a 3 yr warranty, one has stopped working completely 2 weeks ago, and the other cable has wire exposed on one end, both were going strong for almost 15 months... I've had better and I've had worse.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1674432000000}
{"reviewTitle":"Work well... when it work","reviewDescription":"I received my cable 7 days ago and one of them is already not working, when I plug it, it charge for 1 sec and goes on a loop of charging and not charging. I hope the second one will last more than 7 days.Edit : the company contacted me and send me a new box of cable and refund the order, they do take care of the customer satisfaction,  which i really appreciate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1645920000000}
{"reviewTitle":"Samsung Galaxy s21 Ultra doesn't work","reviewDescription":"Bought it for the flagship Samaung 2021 phone. But it doesn't charge that fast. The wall plug in is a 25w charger. This cord is 100w.I figured it'd be more than enough. My phone says Super Fast Charging. But it's charged maybe 10% in the 20 minutes it's been plugged in.Very disappointed. It's probably a great charger. But doesn't work with flagship phones? More of a laptop charger I imagine.The metal connector is flimsy. It's wobbling as I insert it. The cord is super sturdy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1626825600000}
{"reviewTitle":"Company responded. Don't buy! Not, sturdy or durable. ZERO stars!","reviewDescription":"How do I reach the company? This is the most I've ever spent on cords, fast charging but, ummm. I purchased these this past October, for, \"just in case\". Just in case, happened about 3 weeks ago and now, please, see pic. Company reached out and provided me with replacement cables. So, I'm changing to a 3star and I will let you know how long it lasts. I just starting using one of the new cables, yesterday.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1643932800000}
{"reviewTitle":"stoped working 2 weeks in to using them","reviewDescription":"received product worked grait then soon after all ot does is flash on the light indicator and that's all is does don't charge any more or any thing I bot a nother set amd thy have dun the same thing looks built good and looks quality but in my case that don't seem to be the case maybe a bad Batch may not be","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1643500800000}
{"reviewTitle":"Does the job just fine, but only had 1 working in the box","reviewDescription":"Not the biggest fan of nylon usually but if you move your charger around a lot then you probably won't have any issues. I was looking for a more permanent solution so having to unravel it after extended use once in a while wasn't ideal.Was supposed to be 2 cables but one of them didn't work at all. It does wrap around itself very nicely with the strap though.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Canada","date":1625702400000}
{"reviewTitle":"Quality cable","reviewDescription":"Well made and works great with my iPhone and MacBook.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Works great for charging in the automobile","reviewDescription":"Keeps the kids tablets charged in the car for the long road trips, works great,great price fast  delivery","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great 👍","reviewDescription":"Best wires I've had super fast 2.0 charge finally getting new ones after 4 years","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"FAST SAFE Charging cable","reviewDescription":"I like the overcharge protection and the 3 year warranty (although will i remember that in a couple of months).  The occulus used to say fast charging and now it says ultra fast charging. It was well packaged.  2 for 10 is not a bad price.  The braiding of the wire and the ends look great.  Only time will tell as to wear and tear of constant usage.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"They seem to hold up","reviewDescription":"I like that the device side lights up to show its charging if you configure it that way. They have held up so far, maybe near a yr in.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Super fast charger","reviewDescription":"I like that it charge my phone faster then my regular charger does","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Hands down best charging cables I've ever used.","reviewDescription":"They have an indicator to tell you it's plugged in and charging.They are well constructed and feel tough.  Work with Data and Power Transfer.You get 2 of them.  12 Feet of cable - 13 if you get a link cable to combine them.Work with direct to outlet usb c and also with power adaptors that plug into the wall.I love these cables.  I wish they made custom cables also but I'll use these anyway.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Sleek","reviewDescription":"Works as intended and looks great as far as cabling goes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Excelente","reviewDescription":"Buena calidad y muy eficientes, altamente recomendado","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Works good","reviewDescription":"I like the material it seem very sturdy and not easily broken","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"AMAZING CABLE","reviewDescription":"Best cable that I have ever owned and used. The quality is first class!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Durable cables","reviewDescription":"These cables are a bit rigid but well built. Replaced cables for kids’ devices with these so they are less likely to break them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Best charging cables.","reviewDescription":"These are the best, most reliable and longest lasting charing cables I've ever used. I am rough on charging cables and used to need to get a new on every month till I found these! These last me at least 6 months! They also  really do charge fast with my super fast 100w power block. I highly recommend them!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Power indicators","reviewDescription":"Really liked the LED indicator that power was coming into the cable :) No more wondering if the charger was not working or the cable was not working!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great ! No complaints so far","reviewDescription":"I like this charger it has charged my phone very fast paired with the Anker charging block","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Fast charging,","reviewDescription":"Strong, charges fast and the extra charging indicator is a bonus","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Wanted known high power usb c cable","reviewDescription":"So far so good. Just pulled out of the box. Two cables marked foe 100 W. Should be easy to ID in the future","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Works perfect","reviewDescription":"I did not know I needed the faster charger cable. I am so glad that it works perfectly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Product works as described","reviewDescription":"Good length fast charge and the indicator light is not too bright","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Charging","reviewDescription":"Fast charging","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Only slow charges my HP x360 Chromebook 14\"","reviewDescription":"Advice please. Ideally i want to have fast charging from power bank . Im using Charmast 25800 with USB C, and Samsung Fast Charger for cell phone. I have found the answer. The charger should be rated for at least 30 watrs to provide a normal rate of charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1648512000000}
{"reviewTitle":"lasted 1 year 5 months","reviewDescription":"lasted decently long? Thought it would last longer. stopped charging consistently and would go on and off by the end.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1663891200000}
{"reviewTitle":"Loose connection to phone after a few months","reviewDescription":"After using it for a few months, plug connection with my phone is loose and deteriorate over time. Now have to apply pressure for the connection to work. It is not durable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1656201600000}
{"reviewTitle":"Pretty slow charging","reviewDescription":"They look good, I like the light, but the charging is pretty slow.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1658102400000}
{"reviewTitle":"Scratches on the head, looks like used","reviewDescription":"I think I received a used one, gonna return itUpdate: got my replacement, haven't try it yet, as I bought a new set from somewhere else, I will give some update once I try them out","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Canada","date":1622592000000}
{"reviewTitle":"Good","reviewDescription":"Not bad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1630886400000}
{"reviewTitle":"Disappointed after less than 2 weeks.","reviewDescription":"I ordered these on July 27th and have been using one with my Note 20 Ultra. Super fast charging worked well.  Everything was good until I plugged it into my phone today. The LED light flickered and went out. Tried unplugging and plugging in again, and had the light come on although very dim. My phone said Super Fast Charging, and then it stopped charging. I've tried multiple times with the same result. To make sure it wasn't my phone, I plugged in the USB C that came with the phone, and it works just fine. It's a shame, as I really liked these cables. They feel quite sturdy and structurally well built. Evidently the connectors and other things that actually make it work are not. So, back to Amazon they go, and I will stick with Anker from now on, as I've always had great experiences with their products.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629417600000}
{"reviewTitle":"Not fast charging","reviewDescription":"Any fast or super fast charging port I plug into does not support this cable. Cable does feel durable though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"already falling apart","reviewDescription":"*UPDATE*3\/31\/22… customer service contacted me and sent me a replacement, but i haven't used it yet. i'm impressed with their follow-up and guarantee to stand by their warranty!no matter how many tries, i could not get the image to zoom in on the damaged area. the important thing to know is that this cord has NEVER been moved--it has been plugged into the charger which is plugged into the wall adjacent to my bed for the entire 4 months. so, no, it is NOT durable or sturdy or of high quality. it is fraying & has detached from the part that plugs into the phone. very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644969600000}
{"reviewTitle":"Loose connection","reviewDescription":"Negative:Connection to the phone is not secure when plugged in.  Any slight movement will stop the charging.  I have a Samsung galaxy 9+.  There a a significant gap between the phone and the cuff of the charging end, making you feel like you need to push it further in.Positive:The quality of the product seems to be pretty good, and these cables feel well made.  The cable is thick and sturdy and the ends seem quite durable.This item would have gotten 5 stars if the connection was firm between the phone and the cable.  But, since I can't even use my phone, while its charging, because of the constant charging\/not charging with every slight movement makes this product super annoying.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1630713600000}
{"reviewTitle":"They stop working after a while.","reviewDescription":"Stopped working today. Liked the cables for while they lasted but too bad they don’t last long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686960000000}
{"reviewTitle":"Not a fast-charging cable","reviewDescription":"This is NOT a fast-charging cable. I have a Samsung S20FE USB-C. Using my original fast charging cube with this cable only charged 5% in 7 mins. So to fully charge a phone from 0% would take over 2 hours. Using my original fast charging cable with the same cube...charged the same 5% but in only 3 mins. So I could do a full charge in just over an hour.Edit: Company did reach out to me and sent me 2 new cables but I had the same issue. I will raise a star in my review for that alone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635724800000}
{"reviewTitle":"Not a 100w cable","reviewDescription":"I hooked up these cables to a 100w charger and a lenovo laptop.  The power utility shows only 60w connection. Tried charge a macbook air, also only 60w.I used the original Apple cable with the same charger, both lenovo and MacBook air show a 100w connection.Thus the cable doesn't support 100w as indicated by its logo.I am thinking about returning it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1659398400000}
{"reviewTitle":"Disappointed with this wire","reviewDescription":"Don't leave in the car when its snowing or raining outside. Everytime I charge my phone it tells me theres moisture in the ports so my phone won't charge. Its the metal that its made out of doesn't fair well with the weather temps. I've never had this issue with other cables.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"great customer support but replacements don't work either","reviewDescription":"After hearing that mine broke, the company messaged me immediately to resolve the issue and shipped out two new ones in overnight delivery! Awesome customer service..Unfortunately upon using them, I've been able to fully charge my iPad 1 time. Every other time they just randomly stop working. At first I thought they were just really sensitive to being moved, but Now they stop working without even being touched. So stars are for the great customer service..just wish their products were better..","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1634256000000}
{"reviewTitle":"Cable seems ok but not the connectors","reviewDescription":"I have a difficult time getting my phone to charge with these, the connector is not keeping connection. I have one of the cables that came with my charger and it works fine, so I am sure the phone is not the problem.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667001600000}
{"reviewTitle":"Does its job and the length is great","reviewDescription":"I like the length of the cable amd does its job. Light is kinda bright if charging at night but I can live with that","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664928000000}
{"reviewTitle":"Kinda disappointed","reviewDescription":"I loved the tough build of the cord itself one thing I didn't like was that I purchased only because I needed the super fast charging and it didn't only gave me fast charging","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654560000000}
{"reviewTitle":"Cables work great though one has failed within two weeks.","reviewDescription":"4\/5 stars due to one cable already refusing to charge my phone (Razer Phone 2) even though it was working fine right out the box. Other then that the other cable seems to work just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"Nice cables","reviewDescription":"Caves are great for a laptop. Too heavy for a phone. I use them to recharge a phone while video recording sports on a tripod. The weight of the cable pulls the phone down on one end.  I ended up going back to a lighter cable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650240000000}
{"reviewTitle":"Works good","reviewDescription":"Charges fast seems durable and sturdy gets the job done wished the light on the cable indicated charged percentage instead of just being lit solid","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"Note USB C in both ends","reviewDescription":"I did not pay close enough attention when I ordered that both ends are USB C. But they look like really good cables and I like the green led to show there is power to the cable so I ordered cheap USB A male to USB C female adapters.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631404800000}
{"reviewTitle":"Great product for the price, strong, sturdy, not as fast charging as stated","reviewDescription":"Not as powerful as they advertise, however they are thick, strong and feel like they will last a lifetime, they are used daily to charge a ton of devices from my iPad, MacBook, chrome books, Medtronic implant, seems to handle all","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Loved them... until they stopped working","reviewDescription":"These wires worked great for charging my PS5 controllers.But it's now 1 month past the return period and already 1 is shot.not a good sign for the other one I have, or the 2 I got for our phones","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645747200000}
{"reviewTitle":"Does not pass video signal, although they seem decently made.","reviewDescription":"Updated to 4* for customer service : the company reached out and apologized.Org: Does not support video transfer. (Does not work with Lenovo T14 to pass video output to docking station or monitor)","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1649980800000}
{"reviewTitle":"I recommend this","reviewDescription":"These worked  well and are durable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662940800000}
{"reviewTitle":"Slow data transfer","reviewDescription":"Sad to see a 100 watt cable stuck at usb 2 speeds of 480mbps when thunderbolt is 10gb capable. Not sure I would trust this cable with 100 Watts of power dragging through it. Hopefully I am wrong and it will last without incidence.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"Decent Cables - A bit stiff","reviewDescription":"These are decent cables and are as described but I found the cord to be just a bit too stiff for my liking. Will keep but will order something different next time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Sturdy Fast Charging Cable","reviewDescription":"I haven't use them long enough to say how the longevity is but as of now, I feel like it's great quality cable for a great price and I definitely will recommend them to others!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Probably Good Quality, Definitely Too Stiff","reviewDescription":"Pros:- Excellent connectors- Green LED connection indicator is useful- Built like a tankCons:- Very stiff which makes them hard to coil and awkward to use unless you have a straight line into your device’s USB C port. If the cable isn't lined up straight, then there is no way that there won’t be excessive strain on the port. Having to replace a thinner, more flexible cable is a lot less expensive than having a damaged phone, tablet or laptop.Update:I’ve updated my review from three to four stars. While I still think the cable is a little too stiff to coil small enough for travel, it is working well as a “straight shot“ cable for my new laptop. Also, the company has provided outstanding customer service, which is very important to me. They reached out to me to help resolve my concerns, and seemed to actually care that I’d be satisfied with their products. They certainly succeeded, and I have now purchased from them various chargers and cables.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Long life with heavy use","reviewDescription":"I loved how fast these charges our devices and the LED coming up when it was plugged in, but after a almost a year one of them would only work if I bent the cable in a weird way. The other one had the same issue after about 18 months. They were heavily used by multiple devices and I have kids so those could be why, but I've had other cables for longer with the same usage and still working.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"Oneplus buyers be aware...  This cables are for PD charging, NOT WARP Charging","reviewDescription":"Warp charging protocols requires 6 Amps to work and this cable \"provided\" up to 5 Amps.My intention with this purchase was to provide my wife's Oneplus 8T with a sturdy and durable 6ft cable so that she keep her phone charged while streaming (she tent to do that when the phone almost out of power). When I tested this INIU cable with her Warp65 charger block and connected to her phone and my Oneplus 7T, two things I noticed: 1 - the phones charging indicator didn't turn on and detected as if I connected an usb-c  headphone device; 2 - The INIU cable led power indicator didn't turn on. So after this test I proceeded to test with a PD65 charger I have for a laptop dock station and the INIU cable worked there in the PD65 charger (it both charged and and turned on the led indicator). The ironical part the I found on this test and cable swapping is that the cable that came with the PD65 charger worked with the Warp65 charger with both Warp65 protocol on the 8T and Warp30 protocol on the 7T. So Oneplus user, if you are looking for a cable that does work with Warp charging protocol (65 and\/or 30) then keep looking elsewhere or buy the OG (read your Warp65 block output capabilities and you will be fine) .For other non-Oneplus users, at least it works as intended on a PD charger, will update later if I encounter any problems. I like the firmness and sturdiness of the cable and the led indicator. But for those who like to play landscape game, I would recommend that you get the ones with the 90 degree angle (INIU sells them too)","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1652832000000}
{"reviewTitle":"Potential 5 star?","reviewDescription":"Time will tell if it deserves a 5 star. So many cables are built for short lives. I hope this one isn't.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Heavy duty","reviewDescription":"Excellent cable. Just the right length, can handle moving around without coming apart.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Great every day cables","reviewDescription":"Great sturdy\/durable cable for the money. I use my cables every day and no major issues so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Awesome","reviewDescription":"Great cord and fast charging","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Looks good but is not durable","reviewDescription":"The product looks good and I was thinking that it was going to be better than the Apple cable.  Unfortunately, this is not the case.  The first cable broke with in 4 months.  Note: the cable was used only at home so it did not have the stresses of being coiled up for transport.  The second lasted longer..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1639612800000}
{"reviewTitle":"Average quality","reviewDescription":"Bought in January 2021 to charge my s21 plus specifically and they work well for awhile and then fall apart very fast. Not pleased at all! Really hoping I get a replacement as its been well under the 3 year replacement period and has obviously not lasted longer than my phone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1650326400000}
{"reviewTitle":"Not a secure fit, loose connection","reviewDescription":"Purchased the usbc 2 pack, as ive had success with previous iniu products, ( car charger & reg usb to usbc cables). Unfortunately this time it didn't work. Connection with the plug isnt firm and any slight movement stops the charge connection. Even laying it flat while driving and not touching it, ismt long lasting or secure. Will be sending it back and try another. Cable is well constructed, its the plug connection thats the issue","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Canada","date":1627516800000}
{"reviewTitle":"Durability Not Great","reviewDescription":"Cable has separated within 3 months of purchase. I can’t find the support address or a way to contact support on here, so here’s hoping they see this and can help.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1644710400000}
{"reviewTitle":"These cables are good while they work","reviewDescription":"Not sure if I got a bad pair but after a couple months the first one broke and the second one broke just now another 2 months later. Upset because I do like them, they just don't last long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1641254400000}
{"reviewTitle":"(Updated review) Not durable","reviewDescription":"Got 2 of them, they work fine for a little while but one after the other, started to malfunction. I don't normally make feedbacks this is my only one ever but I had to","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1649116800000}
{"reviewTitle":"Un des fils est déjà endommagé...","reviewDescription":"Pas très durable, après seulement 8 mois d'utilisation une des 2 extrémitées d'un des fils est endommagé.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1647388800000}
{"reviewTitle":"terrible connector","reviewDescription":"On any of my USB c devices from phones to a Nintendo switch it falls out or has to be pressed constantly on an angle to charge. And this is the same with both cables in the two pack. Would not recommend","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1630454400000}
{"reviewTitle":"Quality issues","reviewDescription":"One cable works and one doesn't without jiggling it around.Update: The seller shipped out replacement cables which both work so I have amended my review and rating.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1631664000000}
{"reviewTitle":"Junk products","reviewDescription":"Junk products","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1628985600000}
{"reviewTitle":"Item shipped was as described","reviewDescription":"So far so good.  Cord works as intended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650153600000}
{"reviewTitle":"Stopped working.( Review amended)","reviewDescription":"Stopped working under normal use. No return option offered by Amazon.Update. Contacted by seller INIU. They are making it right. Good people.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636416000000}
{"reviewTitle":"I use it on Galaxy s20 ultra","reviewDescription":"No probs using it on my s20 ultra","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"Good buy for the price","reviewDescription":"The durability could been a little better .. the tip loosens up and then the cable near the front starts to be d a little.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633651200000}
{"reviewTitle":"Delivers the Power","reviewDescription":"The cables deliver the power without much drop-off from the power source. Use it to power laptops, tablets and phones.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1637884800000}
{"reviewTitle":"Fast charger","reviewDescription":"Sturdy built, helps to fast charge devices","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643846400000}
{"reviewTitle":"Good charger!","reviewDescription":"I really liked the charger and it is super durable. Some how I end up breaking mine and this one is still holding up! The light is annoying in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626134400000}
{"reviewTitle":"Works good","reviewDescription":"Good product.  Charges great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1647561600000}
{"reviewTitle":"Stiff cable","reviewDescription":"They are a heavy stiff cable only reason not a 5 star.  This maybe a good thing, but not expecting that stiffness.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629331200000}
{"reviewTitle":"Good Charging Cables","reviewDescription":"Previously I had 1 star because both cords stopped working within 2 weeks.However, the company contacted me and has since sent a replacement that arrived very quickly!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1616457600000}
{"reviewTitle":"Arrived with mystery substance on the package of the product","reviewDescription":"Don’t know about the cables themselves but their product handling is…subpar.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658707200000}
{"reviewTitle":"Does not work for video connection on my computer","reviewDescription":"Nice cable but does not support a video screen","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"Supper stiff","reviewDescription":"It does what suppose to do, but you can literally use it as a stick or sink drain cleaner","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645920000000}
{"reviewTitle":"Cable gives out after 6 months. Update: Replacement issued by INIU","reviewDescription":"Update: INIU issued a replacement, will see how this replacement lastsOriginal:Unfortunately have a dead cable after 6 months. Worked well while it did...Really disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637280000000}
{"reviewTitle":"3 star","reviewDescription":"so so","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658016000000}
{"reviewTitle":"Not worth it","reviewDescription":"Not as great as they say both of mine are broken after 4 months so ugh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639872000000}
{"reviewTitle":"Didn't perform as expected.","reviewDescription":"The cables are made with quality materials, yet one cable has already failed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641168000000}
{"reviewTitle":"👍🏼","reviewDescription":"👍🏼","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660953600000}
{"reviewTitle":"Specs were not clear enough","reviewDescription":"I needed a usb c cable for connecting a second monitor to my laptop and found out these are ONLY for charging.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1629331200000}
{"reviewTitle":"Too bulky!","reviewDescription":"I bought it for traveling, and it takes up a lot of room in my backpack pocket. Haven’t used yet. Imagine it should be durable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625961600000}
{"reviewTitle":"Fast","reviewDescription":"Very fast charging, only issue is the cable keeps popping out of its connection. Unless I sit there and hold it, it’s worthless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Australia","date":1700006400000}
{"reviewTitle":"Plutot lent","reviewDescription":"Recharge tres lentement","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1689984000000}
{"reviewTitle":"Not Flexible, Picture Looks Better","reviewDescription":"The cable is quite stiff and inflexible. Makes it impossible to charge and put on high stand to face time.Picture looks much better than the actual product quality.Haven't tested with laptop charging yet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1677110400000}
{"reviewTitle":"Northern Lights","reviewDescription":"I wish I knew before buying these cords that they would light my room up like the northern lights everynight I plug my phone in.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1678406400000}
{"reviewTitle":"Rubbish cables that do not last!","reviewDescription":"I had high hopes for these cables upon arrival as they looked and felt sturdy and tight.  However, after 2-3 weeks of light use, the micro USB end connector could no longer keep an electrical connection to my device.  In comparison, the phone's original cable is still going strong after 8 years!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1666137600000}
{"reviewTitle":"Charges fine doesn’t support video","reviewDescription":"The cables charge fine, however the description states data support, but video does not transmit over these cables.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1674777600000}
{"reviewTitle":"Nice service, but Doesn’t work well when tuck it together","reviewDescription":"Used it on my car for a while now, and it gave me a lot trouble.  For a neat look i tied it with its own cable tie, and it fails frequently. When i straighten the cable it works again.The positive side is that the representative is diligent about the after sale service. They refunded the purchase when im not happy with the product","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1655510400000}
{"reviewTitle":"Not good.","reviewDescription":"Used the cables for 2 weeks now. One cable has already given up. Phone won't charge. Shows error message on phone asking to try a different cable. If you need something reliable- this is not it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1666310400000}
{"reviewTitle":"Only works with some USB-C devices, doesn't work at all with others.","reviewDescription":"These USB-C cables only work with some USB-C devices. I use them with my SanDisk Extreme USB hard drive and they work reliably, offer high-speed data transfers and the LED on one end is handy to see that everything is connected properly. But the cables don't work at all on some of my other USB-C devices: No data or power.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1643500800000}
{"reviewTitle":"Cables does not work","reviewDescription":"I received the cables today and tested them, but unfortunately none of them seem to work with my (S20 Ultra) phone. I attempted to charge my phone with the original charger that came with it, as well as with my laptop, but neither cable was successful in charging my device. I have tested other cords with my phone, and they work fine, so I am unsure what the issue is. I have attempted to use both ends of the cables, but with no success.My advice would be to avoid these cables and purchase the official ones from Samsung instead, in order to save yourself both time and money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Australia","date":1676419200000}
{"reviewTitle":"Excellent charging cable","reviewDescription":"This is a great cable for charging. I use it with a 100W GaN charger to work with my laptop and it is awesome for that. It is NOT for data though. Data rates with my external drive were abysmal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"Works as advertised","reviewDescription":"The product does deliver, charges properly.Main problem was the delivery…person didn’t put the package by my front door, they jus crammed it in the mailbox on top of my other mail!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641772800000}
{"reviewTitle":"C to C cable Use, may need adapter","reviewDescription":"I didn't realize this was C to C.  After working with customer support and having the correct adapter, this works great.  Customer Service is Superb.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648512000000}
{"reviewTitle":"Great but stiff","reviewDescription":"Works great!!! Fast charge, great length, sturdy material but not super flexible as described. Too stiff for a beaded type of charging cord","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648684800000}
{"reviewTitle":"Good Customer Service","reviewDescription":"These are terrible; the charging speed is slow. I use an s21 ultra,  when I plug it in it shows Super Fast Charging but charges slow. BUYERS BEWARE!!!Update: They reached out to me and sent out new cables, they work fine.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1626220800000}
{"reviewTitle":"Nice for the price","reviewDescription":"Nice for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659139200000}
{"reviewTitle":"Dbl End Mini USB","reviewDescription":"Nice set. I ordered wrong configuration. But I'll keep for future.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651881600000}
{"reviewTitle":"Good value","reviewDescription":"Good value","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659225600000}
{"reviewTitle":"Best C cord so far!","reviewDescription":"Love the LED light. It's like a night light. Not too bright, not too dim. Just right. Super fast charging and reliable. Great buy!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640390400000}
{"reviewTitle":"Nice cable","reviewDescription":"We’ll built, has LED light when plugged in. Seems pretty sturdy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642377600000}
{"reviewTitle":"One died after 3 months","reviewDescription":"They charged my phone just fine, but one of them died after only 3 months. Would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652745600000}
{"reviewTitle":"Not Fast Charging","reviewDescription":"They fast charge for about 10 seconds, then immediately switch to normal charge. I've treid different wall adapters and outlets. This is the only cable I've used that does this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634774400000}
{"reviewTitle":"Charges but data doesn’t work","reviewDescription":"Does not work as a connection between a Lenovo Thinkpad and its dock. It will charge but the data will not pass allowing video and other peripherals.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632268800000}
{"reviewTitle":"It won't allow it to charge on a square..","reviewDescription":"It says the phone has been in contact with fluids","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Crapped out on me in 2 weeks","reviewDescription":"I bought two of these and they BOTH died after 2 weeks of light usage.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"One cord works great the other is a dud, worried for 3 days then quit.","reviewDescription":"No","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Nope","reviewDescription":"Works when it wants to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1630800000000}
{"reviewTitle":"Good while it's lasts","reviewDescription":"I've had both charging cords less than 2 months.  When I first tried one it worked great. Was super fast to charge and had no issues. But the first one quit working a couple weeks ago thought maybe it could be just a bad one but nope!  Got the second one out and it didn't even last 2 weeks before it quit working","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662163200000}
{"reviewTitle":"There’s a catch","reviewDescription":"Everything advertised about this cable is true. So is everything not advertised. It will not transfer video signal. It CAN NOT Abe attached to a monitor or projector to send video or audio signal. It may transfer data, I haven’t tested that, but tested against a Dell Ultrasharp, and a BenQ projector with a M1 MacBook Pro, a Dell Precision laptop and a Microsoft Surface Pro 8 none of them could send a signal to either device.The cheap Amazon Basics USB C cable worked great, both the monitor and projector were able to connect on the first try with each device.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"Great Build, Bad Electronics","reviewDescription":"I was impressed with the build quality and features of these cables. Plugged one in to my phone and it was charging but sometime within an hour the cable stopped working. The green power light was off. I tried a different C port charger and different devices but it was dead. Too bad the chip or whatever in them does not hold up. Says it will last longer than my phone..but my phone will last longer than an hour!","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638316800000}
{"reviewTitle":"Great for charging but does not transfer data.","reviewDescription":"Well-built, but neither cable could transfer data for apple iPad or Lenovo laptop computer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Super fast charging, but device doesn't last charger","reviewDescription":"This cable is the best looking cable I've ever bought and one of the ones made with highest quality materials.  I do expect it to last a long time. The cable does charge super fast charging which is nice, I have a Samsung Galaxy but the battery drains quickly after a full charge. I have to recharge my phone after a few hours. Even with minimal use the battery is already at 50% before noon, which isn't the case with other chargers. This also does not actually charge my MacBook, I could have received a defective one, who knows? I kept it because it is high quality and looks cool, and it charges my phone pretty quick so as long I have access to power I can quickly recharge it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655424000000}
{"reviewTitle":"Charge","reviewDescription":"This isn't fast charging, at least my experience. Overall, it's ok.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"Great When It Works","reviewDescription":"I really liked the efficiency of this cable, except a month into using it, wires were exposed. I continued to use it because it worked, but finally switched over to the 2nd one. It lasted less than a week. Six days after taking it out of the packaging and I have to wiggle it all over and prop whatever device in weird ways to get a charge. Extremely frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658966400000}
{"reviewTitle":"Shortaged Quickly","reviewDescription":"Charger didn't last.  Had it by my bedside and really only used it at night, l.  Had it for 3 months before I noticed the inconsistent charged due to the shortage.  It eventually went out completely months later.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1668124800000}
{"reviewTitle":"Great while they last","reviewDescription":"Charged my Pixel 3xl incredibly fast for about 4-5 months. One I gave to a family member, not sure how there's is going. But the one I kept for myself no longer functions properly. Somehow the usb c prong got messed up and now it doesn't hold a charge on my phone unless i wiggle the wire in a particular way. I really liked the cable while it lasted, green charging indicator was cool, felt premium, but now i wake up in the morning to find my phone at <20%","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636761600000}
{"reviewTitle":"Will not work w Samsung Note ultra S-20","reviewDescription":"These were DOA and my phone didn't  recognize them , warning of \"These accesory is not compatible\" and did not light up and thats that. Do not waste your time with these, however I dont understand the hogh positive reviews it didnt work for my Samsung S 20 despite description stating that they do.UPDATE: upgraded to 3 Stars due to vendor sending me new cables which they worked w my other non-samsung devices Thanks","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642636800000}
{"reviewTitle":"I had issues they without me asking they replaced them","reviewDescription":"My first set stopped charging after a while, and they replaced them without me asking. I was shocked at the speed in which from the time they contacted me till the time I received them. I have used them a few days and they are working with my Note 10+ exactly how they are supposed to.Thank you for replacing them, I like the light that shows they are charging.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649548800000}
{"reviewTitle":"Not very durable","reviewDescription":"I've had these for less than one year placed around the house for convenience. The cable shield is already coming off.Update Nov 17, original review July. The company contacted me regarding the review and sent a new cable on the warranty. So there's a 3-year warranty on these issues.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658275200000}
{"reviewTitle":"The first one I purchased didn't work, but they replaced it right away.","reviewDescription":"The first one I purchased didn't work when I tried plugging it in to my MacBook Pro, no charge was detected. I swapped it out for another cable with the same charger and it worked fine. After returning the product, the company contacted me and quickly supplied a replacement at no cost to me. They were very helpful and persistent.Not sure why the first one didn't work. It seemed to be an issue with an old power adapter and perhaps a poor connection.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639958400000}
{"reviewTitle":"Do not buy for data transfer!","reviewDescription":"The specifications for the cable say 480 megaBYTES per second. which is a far far cry from the usb2.0 speeds I've been getting which is ~480megaBITS per second. Major difference and this is what their spec sheet says on their own page.Yes it charges fast and that seems to work just fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653609600000}
{"reviewTitle":"Short lived 😞","reviewDescription":"These worked great until now approximately 2 months out. 1 cable stopped working completely about 2 weeks after purchase and the 2nd one chooses when it wants to charge. I use these cables to charge my iPad Pro and Samsung ultra 8 pad. I’m disappointed because they seemed to be a great product initially","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"not durable","reviewDescription":"the cable isn't as flexible as the other usb cables i have owned. The durability of the cord doesn't last as it's already damaged where the connector is located. Only thing I like is the green light indicator, showing it is on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Waste of money","reviewDescription":"Waste of money. It's very selective of when\/if it wants to work. Sometimes I have to switch both ends just to get it to work; if it works at all. I've gotten better products from 5 and below.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"One cables stopped charging after 6 weeks.","reviewDescription":"After 6 weeks one of the cables won’t charge anymore!  I hope the second one lasts longer…","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"Great until they stopped working","reviewDescription":"These were great cables for charging my iPad Pro. Then they both stopped working after a couple of months  and are no longer useful.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657238400000}
{"reviewTitle":"Disappointed after 7 months","reviewDescription":"I am quite disappointed 7 months after purchasing these INIU 100 W cables, both have stopped working altogether, while my wife's identical-spec cables from another manufacturer, purchased on the same date, are still working without a hiccup.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1643673600000}
{"reviewTitle":"Stopped Working After a Week","reviewDescription":"After only a week I plugged one of the cords in to charge my MacBook and it no longer worked. Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659657600000}
{"reviewTitle":"Worked well while it lasted.","reviewDescription":"Looked tough and well built. Product stopped working after few months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Worked fine for a few months then just stopped working, don't waste your time.","reviewDescription":"Worked fine for a few months then just stopped working, don't waste your time. Very disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658361600000}
{"reviewTitle":"Nice cable, misleading info","reviewDescription":"The LED on the connector of this USB-C to USB-C model does NOT light unless BOTH ENDS are connected and stays lit after the device is fully charged. This is unlike INIU's USB-A to USB-C models where the LED on the USB-C connector is on and stays lit as long as the cable is connected to the power supply. Not sure why they designed it that way because the main benefit of the LED is making the connector easier to find in the dark when it's not connected to the device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Only useful for charging! Do not buy if you plan to connect, say, a display.","reviewDescription":"The cord is sturdy, looks good, feels OK. But, the high-speed USB communication will not go through. So if you plan to use this cable to tether a display or USB docking station, most likely it will not work for you.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"No sirve en muchos aparatos electronicos","reviewDescription":"Ojo mucho cuidado cuando compren este articulo, no es malo solo que para algunos aparatos electronicos literal no sirve, de hecho ni carga, ejemplo tengo unos audifonos logitech y compre el cable para no tener problemas a la hora de cargarlos mientras estoy en stream, pues da la casualidad que no me cargaron los audifonos si no q simplemente no hicieron nada, y fue el cable pq al usar otro rapido subio la carga","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"Poor design","reviewDescription":"I have to take just basic cases off, for these to fully plug in to the phone for use. Super annoying.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Questionable durability.","reviewDescription":"The cables work well initially, super fast charging capabilities however they do not seem to be very durable. After only a two months I've had one cable fail completely but show no outward signs of damage to it at all. Very minimal use, never really moved or coiled up, just no light, no charging or transferring no matter what it is connected to suddenly. Perhaps a more durable option is better.EDIT: Contacted customer service and was provided with a replacement cable free of charge, will update again if this one lasts longer.EDIT2: A few months later and the replacement is showing the same deformation and stretching of the upper corners of the case despite the temperatures being much more mild, seems to me the quality of this case leaves much to be desired if it only lasts a few months before no longer fitting your phone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659139200000}
{"reviewTitle":"Great until they break","reviewDescription":"I bought a few of these and they all eventually break. The wires become exposed then they stop working completely. If a rugged cable is what you seek look elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"DOES NOT WORK FOR I-PHONES","reviewDescription":"Works well for Android phones.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"1 cord stopped working after a month","reviewDescription":"I had really high hopes for this product. I loved the design and durability of the cord until last night when I went to charge my phone and the green light started to blink and not charge it. Unfortunately, I gave the 2nd cord to my mom last week, so this was my only cord. I liked that it came with the little rubber cable management wrap. I just wish this lasted longer as per advertised.Charged my phone well and other compatible devices.Study construction.Not so durable in the sense it stopped working after a month.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674950400000}
{"reviewTitle":"Not very good","reviewDescription":"Just plugged it in and it already is telling me to replace charger cord","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695254400000}
{"reviewTitle":"Not very durable","reviewDescription":"I bought this cable on 10\/22\/21. Initially it worked well and, to be fair, still charges as intended. However, the photo is what it has looked like for the past 2 months - after approximately 8 months of use. Very light use, doesn't get bundled up and moved around much. One side is connected to my laptop, the other side to a cell phone, that's it. Nylon outer shell has come apart from the rubber connectors on both ends and rubber connectors have worn exposing the wires within. Seals need to be improved dramatically. Buyer beware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659657600000}
{"reviewTitle":"Great Warranty ... Outstanding Customer Service!","reviewDescription":"I purchased this Fast Charging USB C to USB C Cable two and a half years ago. I am impressed by the quality of these 100W 5A QC 4.0 cables and at how quickly they charge my Samsung Galaxy. Recently, the outer nylon braid retracted exposing the insulated wiring within the cable. I contacted INIU Customer Service by email and received an immediate reply requesting more information. Two hours later, I was informed that they had arranged a free replacement to be shipped to me. I received the the replacement 3 days later. This has to be one of the best warranties (3 years) that I have seen for a cable and without a doubt the best customer service experience that I can remember. Do not hesitate to purchase this item or any item from this company","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Exactly as advertised & described, which is very nice.","reviewDescription":"I just received my cable, so I can only write what I see and feel, until I use it for a while.  The packaging is top notch and keeps the cables nicely protected.It's a nice cable and is exactly as advertised.  Although, it's a little lighter than my 4 foot SooPii cable, not that it means anything, it's just something I noticed, so I figured I'd mention it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Great price for a durable cord","reviewDescription":"Transfer speeds are good as well as the fast charge. It's also a very well made cord. It doesn't feel cheap or flimsy at all. I plan on ordering a few more and replacing all my USB C cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Very durable and I love that it's a two pack!","reviewDescription":"These charging cords are very durable! And I love that they came in a two pack because the one that I am using I don't think will ever break and when it does I will have the next one I expect them to last a long time!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Nice phone charger","reviewDescription":"These are awesome charging cords well made the durability is great and the material they are made of is good quality.  The charging port fits well and the light on it to let you know it is charging is brilliant!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Great.","reviewDescription":"The cable is a nice thick braided material. It charges incredibly fast. I like that it is longer. And I've not had a single issue with it since i bought, its been a couple months. Super glad i bought these.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"FASTEST CHARGING CORD I'VE USED THUS FAR","reviewDescription":"This charging cord does what it says it will: charge my laptop quickly finally a cord that works with my MacBook Pro.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"2nd pack of cables I've ordered in 2 years","reviewDescription":"This order came today after the original 2 pack I bought a few years back had reached the end of their life. If I am being honest, only one needed to be replaced, as it was worn down more buy my own doing. The two originals I bought both are still working perfectly fine. One was frayed buy a puppy, yet still carries a charge. The fact that the originals have lasted this long, despite occasional puppy teeth should speak volumes!Speaking directly about the cables and what I've found (or havent found, so to speak) I haven't found the common breakage or shorting near the cable heads where it meets the cable itself. I haven't found the USB-C tips to become loose or only charge if you position it a certain way. I'll even go as far to say I haven't found myself stumbling around in the dark looking for the end so I can plug my phone in without turning lights on, nor have I found myself grabbing handfuls of air when my alarm goes off at 4am for shift, thanks to the light the charging head of the cable emits, allowing me to reach for my phone. The light itself is not blinding, nor is it too dim to be seen. It is absolutely perfect as is and has not missed a day since I bought them.The cables are able to effectively handly my Samsung 65w charging block, as well as the 45w and lower. They have always been able to deliver safe and effective charging to my phone and Galaxy Book3 Pro 360, thanks to the long length of both cables. It is also because of their generous length that long road trips are that much less of a worry, when one cable plugged in beneath the radio has enough length to reach the back seat comfortably.Overall, 10\/10 product and can't think of any negatives. It will be a sad day if these aren't available 2-3 years down the road because finding a replacement will be next to impossible. Best charging cables I've ever owned and should be essential for anyone using Samsung devices or have the latest iPhone with the USB-C ports.","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"These are the cables to get!","reviewDescription":"No complaints about these cables. They feel great and charge super fast too. Will buy again if needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Great Quality","reviewDescription":"The cables were has described.  They are of very high quality and are very sturdy.  I am happy with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"They are fine but not amazing","reviewDescription":"They work fine but there is some finiky nature of the connection","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636243200000}
{"reviewTitle":"Won't charge a zerolemon external battery","reviewDescription":"Does not work for zerolemon product could not charge my external battery, on my note10.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618272000000}
{"reviewTitle":"Not charging fast","reviewDescription":"Will I plug it in a fast charging base and it still took an hour to fully charge my phone from 40% to 100%","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"Nice while it worked","reviewDescription":"Nice cable that did its job until the USB C end just stripped off and fell out in my bag.  I treat gear well and spent years on the road coiling cables of all sorts, so I know how to properly handle electric gear.Maybe I got a dud. But, again, more landfill  material that noone will  repair because replacements are cheap and plentiful.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"These are not the regular cords for charging this is for the bank chargers. Both ends are the same.","reviewDescription":"Not the regular charging cord. Both ends are the same my mistake.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Good until it breaks (1 month)","reviewDescription":"Metal tipped came off when unplugging from device.Updated review: company provided a replacement. I'm going to give it some time to see if the replacement holds up better.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1670630400000}
{"reviewTitle":"Good charging cable, but only USB 2.0 transfer speed","reviewDescription":"This appears to be a well made charging cable. However, usually the expectation is that a new USB-C cable will support at least USB 3.0 transfer speeds unless stated otherwise. Nowhere in the description on Amazon does it mention that this cable supports only the USB 2.0 speed (480 Mbps) rather than the USB 3.0 speed (5 Gbps). I would have given a better rating if the description had been more complete. This is a fine charging cable, but don’t get it if you also want to use it for data transfer.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Almost *too* well-made, strange LED behavior, and orientation issues.","reviewDescription":"These cables are very well-made and should be quite durable, but this positive brings a negative in that they are not very flexible.  Also, a point of note:  The green LED does not light until you plug in ad are charging a device.  Others I purchased are lit as soon as power is applied to the cable, making the other end easy to find in the dark.  Don't count on this feature if you're looking for this benefit.  (On the other hgand, the LED lighting in this way does give proof that it's connected and working.)Also, for whatever reason, this cable works fine in both orientations on my Motorola Edge+. but must be indexed to charge my Note 10.  (Other cables can be plugged into the Note flipped either way.)I'm keeping them, but will likely look elsewhere if I need 100W cables down the line.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667952000000}
{"reviewTitle":"Only lasted 2 days!","reviewDescription":"The charging power was actually pretty good. I had a pack of two. One of my cards just stopped working completely. Smh","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"I didnt know i would be getting used cables when I ordered.  They were \"renewed\"","reviewDescription":"I didn't know nor did I purchase previously sold \"used\" cables.  The box had a clearly printed sticker that stated that they were \"renewed\".They appear to work ok.  I think there is a law against selling used parts without telling the prospective customer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657152000000}
{"reviewTitle":"Work great but the light is crazy bright.","reviewDescription":"I don't advise these to use in the bedroom because the little green light is extremely bright.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681084800000}
{"reviewTitle":"Some devices won't charge","reviewDescription":"First off customer support is great. I got my cables replaced and they included a 30w power brick for free.So I'm using a phone case with a built in 8,000Mah battery. The cable will not charge this case at all. If I pull my phone out of the case it starts charging. So there is something up with that. I swapped to my OEM cable and it charges the case as you would expect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1663632000000}
{"reviewTitle":"Good customer service","reviewDescription":"I had an issue with the cables but I was sent new ones and so far they have worked well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Fast charger","reviewDescription":"Good quality as promoted.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"Buen productor","reviewDescription":"Buen producto, cable de buena calidad 👌","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679443200000}
{"reviewTitle":"Charges well decent length","reviewDescription":"Like the green light on one end","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679184000000}
{"reviewTitle":"Excellent cable, then they began to separate.","reviewDescription":"Purchased in May, 2022.  Excellent cables capable of 100w charging.  However after about 3 months both cables began to separate.Customer Support was excellent.  Quickly sent new replacement cables.  Great company.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1671840000000}
{"reviewTitle":"Ok","reviewDescription":"Ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679702400000}
{"reviewTitle":"So far so good","reviewDescription":"Cables seem to be pretty sturdy but time will tell. Using these to charge a 2017 MacBook Pro and to have an optional travel cable. Hope that they remain intact over prolonged use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667433600000}
{"reviewTitle":"Did not supercharge","reviewDescription":"It was promising but it did not supercharge my Mate 20 Pro. Mind you I'm pairing these type C cables on the Baseus 100w charger and tried it on both type C ports that can do 100w. Only fast-charging showed up on those ports, but super-charging shows when I used a different 5a\/20v cable on the type B ports. I'm left confused and disappointed since the results were the same on both cables.Update: Customer support was very responsive and helpful. They sent a full refund and stand by their warranty.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638144000000}
{"reviewTitle":"Great length cable but they could house more power","reviewDescription":"The only thing i have been able to efficiently use this cable for is charging.  Anything else is a complete let down","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658793600000}
{"reviewTitle":"Only used for 2 days and not working","reviewDescription":"Using my 2nd charger as I left my first one at a friend's. Started using it on Sunday and it's no longer working as of 15 minutes ago. Tested multiple devices and the green light just keeps blinking.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644364800000}
{"reviewTitle":"Not these cables","reviewDescription":"I find it harder and harder to find quality on this site and this is one more throw away piece of junk. Good for a month and then it bunches up at the end and that's the end. Look, I hate dollar stores and I prefer things to last, these are the latter.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627171200000}
{"reviewTitle":"Good, not the best.","reviewDescription":"It does the job, but my devices do not charge as quickly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661299200000}
{"reviewTitle":"Good for fast charging, terrible for data transfer","reviewDescription":"great for fast charging, transfer rate is abysmal though for ssd\/nvme enclosure.  As shown in picture A and B, cable is A is what came with nvme drive, read\/write is about 900MB\/900MB, on this cable its 40MB\/40MB on average.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1639699200000}
{"reviewTitle":"REGULAR  COMPRA","reviewDescription":"Solo ha pasado un mes y ya uno de los cables dejo de funcionar, leyendo las opiniones de los demas compradores veo que muchos dicen lo mismo , uno de los cables deja de funcionar, realmente entonces comprar dos no es buen negocio","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635897600000}
{"reviewTitle":"It just died","reviewDescription":"I had two in the pack both worked and the one I didn't use just stopped working when I needed it to charge something else","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1656288000000}
{"reviewTitle":"Bright light","reviewDescription":"Standard cable, but the light can be a bit annoying at night if you prefer a pitch black room when sleeping.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647648000000}
{"reviewTitle":"Doesn't always connect for files","reviewDescription":"Great for charging however I use this cable to edit things on my phone and it has a hard time showing up on my computer, I have to unplu and plug it back in several times","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639785600000}
{"reviewTitle":"slow charge on dell laptop","reviewDescription":"Bought three different brands of 100 watt usb-c charging cables. The others charge the 65 watt dell laptop without issues.  This cable says \"slow charge\".  It did provide 60 watts and works well for charging everything I have that needs up to 60 watts.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1628208000000}
{"reviewTitle":"Worst cords ever","reviewDescription":"Bought these as spares. Might've used them 15 times. Around 10, needed to giggle the cord to get it to work. Now does nothing. They look great and effort seems to have been put into the outer parts that you see, the plugs and outer shield, but pretty much worthless on the inside.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1635984000000}
{"reviewTitle":"Super super sturdy! No faster than OEM cable","reviewDescription":"I loved how sturdy the cables were however I saw no benefit or increase with charge rate or anything like that over the original OEM supplied cable","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674259200000}
{"reviewTitle":"SSSSLOWWW","reviewDescription":"After a FULL HOUR of charging my very new iPad Pro it only gained 20%. This “fast charging” cord is actually the SLOWEST cord I have ever used! It more likely sucks the life right out of your device. Don’t waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Not so durable","reviewDescription":"Ive had these charges for 2 monthes. They are now not charging or being functional. 1 is dead and the other i have to teist a certain way to get my phoje to charge. 8f you use your chargers heavy i dont recommend this product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1641168000000}
{"reviewTitle":"One stopped working, the other is starting to stop as well","reviewDescription":"The 1st one stopped working after a month, so switched to second one. now that one is showing signs of not working. Way too quick for them to stop working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1655337600000}
{"reviewTitle":"Defective","reviewDescription":"Got these yesterday and neither cable works with my Samsung 45w AC block. Tried both ends of each cable and no charging indicator light and my phone doesn't even recognize that it's plugged in.","isVerified":true,"ratingScore":1,"reviewReaction":"48 people found this helpful","country":"United States","date":1624838400000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped quick charging within 2 weeks.. stopped charging within 3 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682640000000}
{"reviewTitle":"This cable will not charge a monitor. I had to return it and get a different cable.","reviewDescription":"This cable will not charge a monitor. I had to return it and get a different cable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679011200000}
{"reviewTitle":"Don't work","reviewDescription":"The cables I received are not charging, the green light is flashing","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677801600000}
{"reviewTitle":"Stopped working without much usage. Could be electronics","reviewDescription":"I don't know if it's the electronics that shows the green light but the head does not look damaged yet it doesn't turn on","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1658620800000}
{"reviewTitle":"Great cables","reviewDescription":"Excelent cables, good packaging. Works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"AWESOME!!!!","reviewDescription":"I LOVE THESE. THE LIGHT SHOWS THAT THEY ARE POWERING UP DEVICES. A+ PRODUCT","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Great quality","reviewDescription":"Can't really complain too much","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"High quality USB C Cable","reviewDescription":"This cable is high quality. You'll know right away. Sturdy and love the little green light at the end of the cable helps you find it when the lights are out at home or in the car.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Great product","reviewDescription":"Love these charger cords","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Quality Cable for the Price","reviewDescription":"Although it is rate at USB 2.0 Speed, this cable works with all PD chargers and devices I tested.  A quality-built cable with nice strain reliefs and think flexible cable.  Not sure if the LED display displays a proportional charging speed as it stays on half lite for all devices.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Cable para carga","reviewDescription":"Buen producto, carga rápido.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Great Cable","reviewDescription":"These cables are well made. Thick but pliable with good insulation. The one end lights up only while inuse. A good cable for transferring data.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Works great","reviewDescription":"These work well, I like the light too. I'm super happy with the purchase. I've had a ton of others and this works better than all of them","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Funciona","reviewDescription":"A la perfección","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
