{"reviewTitle":"Xbox SeriesX =  amazing console, absolute BEAST and best value in gaming. Playstation convert.","reviewDescription":"I have been a gammer all my life, have owned almost every console since the Atari Pong all the way till the Ps4 and Switch, but I have skipped most Xbox' s except for the original that was given to me as a gift.This new console that Microsoft has made is in my opinion the absolute best in this generation. Spec-wise it cannot be beat and if superior to the PS5 I most respects. But when you use your series X and in conjunction with Game Pass Ultimate (GPU), it simply becomes the hands down, no questions asked, absolute BEST VALUE in gaming anywhere! Today Microsoft has also teamed up their GPU service with EA, and now we can get most sports games and most EA titles included in GPU. But you must also add the future inclusion of Bethesda and all their amazing titles from day one in GUP since MS has bought them out.So how can't  you go wrong with the MOST POWERFUL CONSOLE EVER MADE and the potential of including GPU to make it the best value in gaming PERIOD.Yes some will think that their are few titles specifically made for this new generation as of this writing, but the same goes for Playstation, and Sony changed their mind in the short term, as most titles that they have as great exclusives are also being released for the foreseeable future on PS4 as well as PS5.PROS:- Best Value in gaming when used with Game Pass Ultimate.- Most powerful console ever made (12TFLOPS - 52 CU's).- Intuitive and very functional OS.- Great games even for this generation like: Medium.- FPS Boos feature for older games.- Automatic HDR for older games.- Instant Resume feature is just awesome!- Great controls, I thought I would not like them, BUT THEY ARE GREAT!- Minimalistic design, that goes well with anything you have already.- QUIET there is no noticeable sound of fans even when gaming for hours.- More available space in internal drive then PS5.CONS:- Controllers use a AA Battery... WHY would you do this in 2021? Yes there are options, but I should not need to look for options, personally for now I went the rechargeable Energizer route, but it is a hassle that should not be present in a console this generation.- No gimmicks and straightforward pure power, no you don't get resistance in the adaptive triggers like a PS5, makes it feel a bit less futuristic.- Had a bug happen to me more then once while purchasing new games, got an error, so for workaround had to add to cart, go to billing address, put edit, select the same billing address and then it worked, very annoying.SPECS:- Processor: 8-core AMD Ryzen Zen 2-architecture CPU at 3.8GHz (3.6GHz with SMT)- Graphics: AMD Navi\/RDNA 2-family GPU with 52 CU at 1.825GHz (12TFLOPS FP32)- Video:16GB GDDR6 with 14Gbps 320-bit interface (10GB at 560GB\/s allocated to GPU, 6GB at 336GB\/s allocated to rest of system with 3.5GB for GPU)- Die Size: 360.45 mm2- Process: 7nm Enhanced- Memory: 16 GB GDDR6 w\/ 320mb bus- Memory Bandwidth: 10 GB @ 560 GB\/s, 6GB @ 336 GB\/s- Internal Storage: 1 TB Custom NVME SSD- I\/O Throughput: 2.4 GB\/s (Raw), 4.8 GB\/s (Compressed, with custom hardware decompression block)- Expandable Storage: 1 TB Expansion Card - Seagate ATM only avail.- External Storage: USB 3.2 External HDD - WB Black Gaming 5TB what I got for it.- Optical Drive: 4K UHD Blu-Ray Drive-- Performance: 4K @ 60 FPS, up to 4K @ 120 FPS, 8K @ 60 FPS- Size: 301mm x 151mm x 151mmFinally, I will recommend  this console over the the PS5, its simply a BEAST and a better value when teamed with GPU. I won't get a Ps5 for the foreseeable future at least not till late 2022, since by then they might really have PS5 exclusives that don't get. a PS4 version.The Xbox Series X is such a great console that you would be hard pressed to look it over over the hype that the Ps5 has generated because of its lack of availability. So if you like simply the best console this generation and wish to get the best bang for your buck, Xbox Series X simply rocks.PRO+ : The Xbox series X is also an amazing emulation system, it can run Retroarch with no hacks, with nothing weird, just look it up in YouTube and you will find tutorials. But it can do emulation like very few systems and it add to its tremendous lineup and value.Great job Microsoft, you not only added a customer, but a new fan.","isVerified":true,"ratingScore":5,"reviewReaction":"227 people found this helpful","country":"United States","date":1614988800000}
{"reviewTitle":"Great Console","reviewDescription":"Found the Xbox Series X at a great price. The setup was very easy and user friendly. The Xbox Series X is a stellar achievement in gaming hardware, delivering an exceptional experience for both casual and hardcore gamers. Its sleek design fits seamlessly into any setup, and the powerful hardware ensures fast load times, smooth gameplay, and stunning graphics.Backward compatibility is a game-changer, enhancing older games' performance and visuals. The Quick Resume function allows for almost instant switching between multiple games, enhancing the overall experience.Xbox Game Pass adds incredible value, offering access to a vast library of games for a reasonable fee. The Xbox Series X sets a new standard for gaming with its cutting-edge technology, user-friendly features, and extensive game library. It's a must-have for any gaming enthusiast.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"My boyfriend loves it","reviewDescription":"If your boyfriend is a gaming enthusiast, he'll absolutely love the Microsoft Xbox Series X 1TB Gaming Console. It's a powerhouse with lightning-fast load times, stunning 4K visuals, and seamless gameplay at 60fps. Whether he's into shooters, RPGs, or sports games, this console delivers an unmatched gaming experience. Plus, its sleek design will look awesome in any setup.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"Xbox","reviewDescription":"Wonderful as an xbox, had a bit of trouble with the wifi but otherwise great. I use it constantly","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Amazing Console! Go Microsoft!","reviewDescription":"Step into the realm of gaming greatness with the Xbox Series X, the Hercules of consoles – muscular, powerful, and ready to elevate your gaming experience to celestial heights! Assembling this gaming marvel was simpler than beating level one of a classic arcade game. Unbox, plug in, power up, and voila! I was transported into a world of immersive gaming splendor.Let's talk power, folks! With a whopping 1TB SSD, it's like having a storage vault for every gaming adventure imaginable. The 16GB RAM felt like having a brain that processes game data quicker than a cheetah chasing its prey. The console revved up like a finely tuned sports car, promising gaming speeds faster than my cat chasing a laser pointer.The promise of true 4K gaming sent shivers down my spine. The graphics were so sharp, I could almost see the pixels having a party! And with up to 120 frames per second, it's like watching a movie in fast-forward, only it's your gameplay and not a rom-com.The Wireless Controller is like an extension of your own hand – sleek, comfortable, and responsive. It's like having a magic wand (minus the spells, but hey, your gaming skills might feel magical).The Velocity Architecture? It's like having a gaming time machine, reducing loading times to mere blips on the screen. I blinked, and suddenly, I was in the midst of epic battles without the agony of waiting.However, even this gaming behemoth has its kryptonite. The only downside? The wallet might feel a bit lighter after acquiring this gaming beast. But fear not, for the hours of gaming joy it provides will make you forget about those dollar signs faster than a high-speed race in Forza Horizon.Now, maneuverability? Let's be real – this console isn't going anywhere. It's like a monolith, firmly rooted in your gaming universe. But who needs maneuverability when you're anchored in a realm of gaming nirvana?In conclusion, the Xbox Series X is a titan among gaming consoles, a symphony of power, graphics, and sheer gaming delight. It's a gaming paradise that turns button-mashing into a delightful symphony of pixels. So, grab this console, embrace your inner gaming legend, and embark on gaming adventures that'll leave you shouting \"Achievement Unlocked!\" like a boss!","isVerified":true,"ratingScore":5,"reviewReaction":"30 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Great Price, good quality.","reviewDescription":"Great Price, good quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"X-box","reviewDescription":"Performs advertised! No negative issues","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"From someone who owned a PS4 and Xbox One","reviewDescription":"I started out on the OG Xbox when I was 5 years old cause my dad bought it, he then bought the 360 and I loved that. When PS4 came out however I bought that cause the og Xbone was trash. After a 4 years or so however I had a spat with Sony customer support which if you have dealt with them ever it's awful. Pre-ordered a bunch of games, but then decided to stop gaming  in college (stupid decision), they wouldn't let me cancel despite then being pre-orders cause they're policy is trash. I disputed it, they banned account, I created a new one later on my roommate's PS5. Really liked horizon forbidden west not gonna lie. Nothing was actually seriously wrong with the PS4 itself, just Sony was. Xbox one x came out and I just had to buy it. My dad had the og Xbox one, and my word the continual updates to Xbox UI showed, it was fantastic. Then the game pass came out, if you are a playstation camper, let me just say this thing is actually amazing. I'd been falling out of love with gaming honestly, all the AAA games coming out had sucked recently. It felt that I couldn't have fun without spending a lot of money. One of the first games I played on the game pass was Control. Holy crap I missed out on this when it launched, and  I never would have discovered it if not for gamepass. I've discovered over 20+ games I never would have bought at full price and am loving it, it made me like gaming again truly.  When PS4 and XSX we're announced it felt like PS5 was the Xbox one at launch all over again. Trying take as much money as possible, and not being consumer friendly. Xbox smart delivery (no rebuying games) compared to Sony's pay $10-$20 for upgrade or buy the PS5 version for $60-70 all over again. Like come on, that's BS. All my saves are saved in cloud, I set up my XSX in 10 min, 7 of those was because it was updating. Only thing I had to do was download my games. Yeah launch titles sucked, but Xbox bought Bethesda so that doesnt matter anymore. All first party games are on the game pass day 1. I have not bought a single game since I bought control's XSX version (I could still play Xbox one version on game pass but I wanted to give Ray tracing a go, I had not purchased the Xbox one version though I should note, so this was my first time buying at a gp discount no less). It's fantastic, I'm getting equal or better value than PC (since new games are released on it as well). Everything is just so easy and simple on Xbox compared to PS5. It's like IOS vs the early days of Android (which I now own). Having experienced PS and Xbox, Xbox just has a much more stream lined experience. Also Xbox live crashes like maybe 1\/6th (honestly maybe less) of the amount of PSN, like good lord that was actually the most annoying thing ever. The PS5 itself just seems outdated, and Sony seems hostile to the consumer.  Honestly this is hands down the best console I have ever owned except maybe the 360 because that was gaming's last golden age imo with COD, halo, GOW, mass effect, too many to name. Overall a just superior product, I do hate Sony after my spat, I fully admit that, but objectively this console is just better. I see nothing but frustration on the PS5. I will miss Horizon, but that's it. So unless you absolutely need God of war or something, like what Halo is (was) to me, buy this. Hell buy this over a PC, I was debating it, but this year and probably next year as well is just bad for getting or building a gaming PC. Seriously buy this console if you are on the fence, if you are debating at all, buy this console. It's xbox's generation this time around, for value, ease of use, as a finished product, and #1...for games and gamers. I debated for weeks which console to buy last generation, but it was simple this time around and I have zero regrets. In the end for the same amount of money you will be able play 2-3x the game you would on PS5, you can play 360 and OG Xbox games as well, for free if you own them already. If you own a gaming PC though, you don't need it.","isVerified":true,"ratingScore":5,"reviewReaction":"149 people found this helpful","country":"United States","date":1632268800000}
{"reviewTitle":"Extremely Happy","reviewDescription":"Got an Xbox in “good condition” this is how it came. Was super stoked to see there was only a bit of wear on the box (wasn’t even expecting an OG box). Only to find an Xbox in MINT condition in the inside. It was brand new as much as I know.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Glad i got it on a good discount","reviewDescription":"Decided to get this on a discount and it was well worth it waited a while to make sure everything would work great and it does","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good Console, terrible controller.","reviewDescription":"Overall, the console itself is great, but the controller it came with just straight-up doesn't work. I plan on getting a replacement for it sometime, but I have no idea how to do that via Amazon. Sucks too, because this was a birthday gift that my mom helped me pay for. Plus, I'm not spending another $100+ just because something that came WITH the Xbox doesn't work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Marketing scheme...","reviewDescription":"I have a 15 year old computer that is running off a quad core 775 old motherboard that can literally outdownload and upload this console I know that consoles are different than computers and I understand that but what bugs me is that this system is literally junk and  for the CPU chip to the ram which is 3 times better than my computer should function and run smoothly which it does not and isn't that fast at all This was the whole reason why I was scared to move to console instead of sticking with PC all they do is make consoles left and right and they're all junk and that's what they want because they want to take your money and run with it when their are alot issues ....save yourself $500 pick yourself up an old xbox one and it runs about the same a little bit tiny bit slower and and way more cheaper oh wait no it's not it's pretty much the same price which is my issueBut you can save 300 bucks for the same crap The Microsoft server has been getting worse and worse and considering the fact that I've been paying for a membership 15 years you would think they would try to do the best they can to accommodit can to a comedy and be the best which they do not care nor will ever care about Whenever I reached out to them 1 or 2 things happened one they blamed my end or 2 they blame the game or 3 which is very rare they say the systems down blah blah blah blah blah blah But then when I say oh well if you're causing me issues I want a refund for the days then I got them marked on my calendar that are having issues for those days since I pay for it and they ignore me and they do not want to lose any money because that's what it's all about money and said a helping customers customers game and have fun Again save yourself the $300 get the low xbox one even the 360 seems to be better than this console for running smoothly anyways which which still works by the way but my xbox 1 didn't work After 2 years which is what they want and then I moved up to the other xbox and same issue and now waiting for this beautiful ex to do the same which will happen probably within a year or 2 because that's what they want they want to s**** y** and take your money very bad It's like the Call of Duty's producer in the call of duty every 4 to 6 months reminds me of the same thing with the xbox they make the game so fast there's issues and bugs and they don't care they just move on and it's the same thing with these xbox as it seems","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1658102400000}
{"reviewTitle":"Xbox Series X - great product if it works","reviewDescription":"I was super excited to finally plunk my $600 for the upgraded Xbox Series X bundle and enjoy Thanksgiving break doing a little gaming.  I managed to get all my games transferred off the old Xbox One except for Fallout 4 (my mods weren’t compatible and nuked my saved games 🤬).  I went to load Starfield and was TOTALLY UPSET when the Xbox made a loud grinding noise…once…then a loud snap…and the disc drive stopped working all together.  I could still play games that were transferred, but couldn’t load anything new from a disc.  I called Microsoft and the tech said “yes sir, you got one of the bad drives from a bad lot.”  Umm…why didn’t Microsoft reach out to me and send me a new unit if they knew it was a bad lot of drives?!?  Terrible quality assurance over at Microsoft and even worse customer service!  They offered to fix it at Best Buy, but my drive would have to be wiped.  Why?!?  I’m replacing the blu-ray drive…that’s it.  This whole ordeal has made me want to switch to Play Station.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Xbox it's time to step up compatibility and versatility.","reviewDescription":"I love Xbox X but the memory is totally disappointing. I don't want to spend $200 -$400 to install the games I frequently play on an expansion cards sold only by one supplier. You can only play XS games on internal or the Seagate card. As more of the games on my external hard drive update to XS they become useless as I have no room on the internal hard drive.  PS5 allows you to pick your own compatible ssd drive from various suppliers making them affordable. PS5 also allows you to pick ps5 or ps4 versions of the game allowing compatibility with what ever hard drive you have. Xbox forces you to update your game to XS if you are using the XS....thus making your game on external hard disk useless. Xbox please stop making dumb decisions and make the system as compatible and versatile as possible. With halo dead and gears of War dying Xbox needs to step things up. I left PS because the network WAS terrible always down, matchmaking at the time WAS none existent, then they got hacked, ruining all online play for half a year and my credit card info was sold on the black market. I remember when Xbox gold games was A list games not F or D list games, and you owned them.  I have not forgotten, but if you don't tighten up I'll leave you too. But other than my personal rant and no choice but to by high price memory, the system works. Pushes 120 frames and 4k with games that allows the settings. Hate that they removed the hdmi one guide input, like in the Xbox one cause I used that as my cable box and gaming all in one.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1672704000000}
{"reviewTitle":"Only purchase if you just want to Xbox stickers","reviewDescription":"The stickers for the Xbox itself looks great, the main reason I bought it anyway. But the controller stickers do not fit at all. They are too big and the don’t curve and warp with the controller at all so you will get wrinkles no matter what. I just threw the controller stickers away. But the Xbox stickers are great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Dustbox Series Zzzzzzz","reviewDescription":"I've had the Series X for about a year now and I can count the amount of time I've played it on one hand this past couple months. Gamepass was tempting for awhile, but ultimately not worth the monthly fee, as I barely turn this thing on. My PS5, which has similar titles, better exclusives, and is overall a better experience from the controller to the system menus, is the superior machine by far. I can't even remember the last game crash, but many \"next gen\" Xbox series X titles operate on medium preformance and crash routinely. This clunky, ugly (PS5 isn't anymore handsome mind you), dust trap spends more time playing 360 and Xbox One titles really, and even those have stability issues on this \"next gen\" hardware. Save your money for a mid range gaming PC (I just bought one for $600 and added another few hundred over the years and it plays all current titles fine), or buy a PS5. This streaming service platform comes in at to high a price, maybe worth $300.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Bad Controller","reviewDescription":"The Xbox Series X is great. Really fast games, Quick Resume is an amazing feature, but sadly I'll have to give this a 3 out of 5 stars. This is because of the controller. I've had my Xbox for less than 2 months and already the controller is experiencing drift. I think, \"fine, maybe I just got a lemon, I'm sure the warranty will help.\" Tried to place a service request and it kept giving me an error message. If you get this Xbox, use an Xbox 1 S controller with it, those don't break.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"Difficult to set up. No Bluetooth speaker option.","reviewDescription":"Honestly,  I expected better from a flagship Microsoft game console. First, you can't set up the console without first downloading an app to your phone and keying in an alphanumeric code. Then you have to pair your phone to your console. Then there is an update that takes an hour.The menu is difficult to use. Apps don't often launch on the first attempt.There is no Bluetooth options for external speakers. Seriously. It only supports HDMI audio. Unbelievable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Bought my first console to play games I own, only to find they want you to pay for them again!","reviewDescription":"Below is my angry rant about wanting to play games I already have. Overall, I'm very happy with the Xbox I received. It's got amazing graphics and some awesome processing powers. I'm still frustrated that I can't use it with the games I wanted to play, but that's something I'll have to live with. I like playing on this console, but if there could be a way to link my accounts and transfer games over, that'd be appreciated.(Previous review) I'm livid. Literally bought my first TV for my apartment, 4K, and this new Xbox Series X so that I could play my favorite games on a couch in my living room. This is my first console, first TV, etc. I already own several games that I've paid for. Guess what, YOU CAN'T INSTALL THEM EVEN AFTER LINKING ACCOUNTS. That should be enough to tell your systems that I OWN THOSE GAMES ALREADY. But no, you'd rather I still pay $70 each because of capitalism.The majority of the games I wanted to play aren't included with the Game Pass either, so I don't suggest that. If you wanted to play your games across multiple platforms, this is NOT FOR YOU.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"Misinformation.","reviewDescription":"The product is listed as new but you are shipped  used in good condition.  For the same price as the new ones.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"What a nightmare to setup","reviewDescription":"The console setup and management is THE WORST interface of anything I've ever seen.  You must enter your Xbox live password to perform most any setting change.  Further, pray you never need any documentation as it does not exist in any helpful form.The initial setup requires downloading an app to your cell, connecting to \"some\" wireless network the console creates then access your own network, then asks \"Allow Xbox to discover other devices on your network\".  That sure does make one nervous about what the darn thing is doing behind the scenes w\/ your network.  Then entering the PIN the Xbox presents into the app it count not find the \"Xbox\".  Fortunately, my being rather computer\/network savvy, I used the phone app to connect to the Xbox created network w\/ the PIN then could finish the connection and attach it to my network.  Now, somehow I apparently\/inadvertently changed some setting to disable \"Game Mode\" and cannot find anywhere obvious tho change it.  Admittedly this was my doing however not being able to find the setting not documentation to re-enable game play sure doesn't help.Perhaps I'll update this review in a few weeks of use, but as of now giving this 2 stars is generous.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Great console, waiting on great games","reviewDescription":"I have had the console since launch. It is an excellent console, very well built. I love the backgrounds as well, they look neat. The controller is nice and the Master Chief Elite controller is the best controller I have ever used.The dashboard for the console is awful. Navigating the console menus is terrible. The photo video editing software is awful as well.The first party games are lacking as well. I played Gears 5 on it. I loved Gears 1-3 but was immediately turned off by 5 as the first thing I saw when I launched the game were $20. The campaign was a good one time play through. I struggled to get through the open worlds a second time as they are empty, pointless and out right boring. I loved the linear chapters, I thought they were great. I quickly grew bored of the multiplayer as it hasn’t changed since Gears 2 (I can’t believe there is still sticky cover).I played Halo Infinite and the game is unfinished. They continue to add cosmetics instead of content like maps. I grew bored of the game after a month.I am looking forward to Fable and Hellblade 2, but remain skeptical because of Microsoft’s heavy monetization practices. The focus seems to be on heavily monetizing first party games since they are available on GamePass. That is a huge turn off for the console.I do love some of the backwards compatible games, tbough most of the games I want remain unavailable.At this point, I haven’t touched the console in a few months as the GamePass games have been uninteresting for me personally. I can’t believe Halo, the launch title for this console, was unfinished and a massive disappointment. I just can’t wait for some great first party games, hopefully sooner rather than later and with no heavy monetization. I am also extremely disappointed to hear that Microsoft is already giving up on future backwards compatible titles from the 360 era as that was the best part about the console.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1652227200000}
{"reviewTitle":"not so fast and friendly to play I prefer the other system","reviewDescription":"I used the Xbox series x The good thing about the Xbox is the image quality, which is clearer and better than the PlayStation 5. I played it several times with the same games and I don't feel as comfortable with the Xbox , I have more fps with the PS5, the game loads faster, the community of friends is much larger and the monthly free games are better, sorry","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Eats disc's for breakfast","reviewDescription":"Bought the X Box Series X and 3 games (disc versions) and my machine scratched 2 disc's so the games were unplayable. One deep scratch on each within 2 days of ownership. The disc's are either too prone to scratching, the machine is defective or Microsoft just wants you getting the download versions. The machine was set on its side, as I read it wss more prone to scratching disc's standing upright.Update: occasionally the machine just doesn't want to read discs. Microsoft has an issue with the disc player that could result in you having to send the unit back to MS for repair. System restarts seem to make the games playable again. I've noticed turning off the machine with disc inside increases likelihood of problems, as does inserting a disc while machine is booting up. Currently, I exit the game, remove disc, and do a full system shut down and I've not experienced a disc read error again.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"The system doesn't let me play games","reviewDescription":"My system constantly shuts down every time I try to play a game When I factory reset the system it worked for a while and then it started back doing the same thing now I have to either see why Microsoft says or get a refund","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Very disappointed","reviewDescription":"For the insane cost of the system I am very disappointed with the game availability and how they keep releasing new games that are no better than a new beta version yet charge $70+ dollars for it, I feel Microsoft has really dropped the ball recently and would REALLY appreciate a refund on this system or at the very least a store credit, but I won't hold my breath since I know their customer support does nothing besides make excuses and never try to help the customer out. Would be amazed if they prove me wrong and reach out to rectify the situation and would immediately change review to elaborate on what they did to fix it but again chances of that happening are slim to none so I wouldn't recommend anyone spend their hard earned money on this machine. To be continued..... Maybe?","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"Constant headaches, should have waited for a PS5.","reviewDescription":"This system has constant issues with not connecting to the internet, even though self test says the internet is available, difficulty logging on even though I am the sole user, It requires delving into the system to discover that updates are required to start up.Game specific issues with Destiny 2 are also constant, parental control warnings, inability to connect to the server (although my PS4 has no such issues) and the Xbox headset fails to connect which requires a system reboot which leads to failures to connect to the internet, parental control notices etc...I give it a two star rating because when it does run properly it is quite nice, which is only around 70-80% of the time.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"2 years later and HDMI output does not work","reviewDescription":"I've sent this in once for repair exactly 2 years after purchasing. They replaced the HDMI output port. I've had it for 3 months and it's gone out again. For 500+ dollars, this should last more than 2 years.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695686400000}
{"reviewTitle":"An expensive machine that was packed poorly.","reviewDescription":"I absolutely love the new XBox Series X. I was pretty disappointed on how the Xbox was packaged for shipment. It was put in a regular brown cardboard box, a bit bigger than the manufacturer’s package the Xbox was in. There was no packaging material to help keep the Xbox from moving around, and after opening the shipping box I double checked the gaming system to make sure nothing was damaged. Luckily nothing was. I believe items as expensive as this computer system should be handled with better care, especially the price I’m paying for it.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"$500 for wifi disconnection frustration","reviewDescription":"the console disconnects from wifi constantly - every 20-30 mins- end up having to reboot it all the time.Have tried various fixes from what i scoured on the googles (seperate 2.4 and 5ghz ssid's for example). What eventually worked to have stable wifi was disabling WPA2, which i didnt like.Ended up using an old router that was AC compatible and ethernet wired the X to the router, then bridged it to our wifi.disappointed in the $$$ paid for this issue, which has been ongoing since its launch. simple google search will show other users with same issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667174400000}
{"reviewTitle":"Awfully designed OS, bad optimization, no freedom, no games","reviewDescription":"So, I bought an Xbox Series X. I already owned a PS5 before this, but I was curious to see what was available on Xbox and wanted to check out Game Pass, so I was also able to get a Game Pass trial with my purchase.The first thing I noticed was that the Xbox controller looked pretty nice, but that feeling only lasted until I actually used it. I don’t think I’ve ever used another controller that was so loud in my life. That dpad is criminally loud, it sounds like an old typewriter, which poses a major problem if you play fighting games at all or mostly play at night. The noise is distractingly loud even during the day, but at night you can hear every button being pressed, especially the awful dpad. In comparison, the PS5 controller makes no sound, while also having buttons that are more responsive and sensitive to the touch. I need to press the Xbox controller buttons harder for the Xbox to read the input.Another thing I noticed is that the Xbox doesn’t even come with a USB cable for the controller, and instead brings batteries, which means that the Xbox controller does not have a rechargeable battery built into the controller the way PS5 does. Do they really expect everyone to be changing batteries over and over? The only other option is to buy a USB cable and play with the controller wired, which feels extremely outdated in the case of Xbox because anything that involves using a cable in 2024 should have a rechargeable battery like the PS5 does.Additionally, I noticed is that the Xbox Series X fans keep running if you turn off the console the “wrong” way. I kept wondering why these fans were still spinning long after I turned off the console, and I literally had to Google this problem and find that you actually need to go into system settings and select “shut off completely” to actually shut the Xbox off. Holding the Xbox button on the controller and selecting shut off from there actually just puts it into rest mode, so why isn’t that option called rest mode then? Really stupid of them, honestly. On PS5, shut off means shut off, and rest mode means rest mode, period.Also, I don’t like how exposed the top of the Xbox Series X is. All those holes spells disaster for the console unless you place some kind of cover on it when it’s not in use, otherwise anything can just fall in there by accident, whether it be dust buildup or any small object really such as a screw, and if the latter happens I feel sorry for you because that’s where the fan is, and now you have to open the console just because something fell in there. That’s a huge design flaw, in my opinion.Additionally, is it not possible to take screenshots on the OS? Pressing the share button to take a screenshot prompts a notice to pop up saying, “For this, start a game, then you can capture game clips and screenshots.” So, if I wanted to take a screenshot of something on the OS, such as something in the Microsoft Store, or literally anything other than a video game, I can’t do that?On PS5, you can take screenshots of anything on the OS, except for when you’re streaming a movie of course due to piracy concerns. You are far more limited on Xbox in this regard.Another big problem regarding screenshots on Xbox is that they automatically disappear from your capture gallery, which Microsoft doesn’t tell you this and you find out the hard way when you see that they randomly disappeared from your library.In settings, they give you the option to automatically share your screenshots to the Xbox Live Network, for others to see and engage with. If you shut this off, what’s left is that the screenshots are only saved to your internal storage, which knowing this, you would think they have no way of disappearing, right? They’re YOUR screenshots, so why would they, right? WRONG. They disappear because you are limited to store only a certain amount before the “older” ones begin to be replaced with the newer ones. This is unbelievably pathetic when you consider that on PS5 and even PS4, your capture gallery is infinite as long as you have the space for it, and they will never disappear until you CHOOSE to delete them. I have screenshots saved to my PS5 that I took years ago, meanwhile on Xbox they just disappear without warning. What the kind of garbage OS is this?Another really odd thing on Xbox Series X is that you can’t disable HDR from screenshots? It is automatically applied to them even if you literally shut off HDR from video settings. I don’t play any games in HDR because I honestly think most games look worse with it on, and it’s rare to see a game that actually implements it well. I also don’t really see the appeal when it just looks like you auto enhanced a picture with contrast to make the black colors look blacker, which makes the other colors “pop” and that’s it. I shut it off just like I do on PS5, and yet for some reason on Xbox, the screenshots look much darker and it’s because HDR is being applied to them. Why? To trick people into thinking Xbox games look better based on screenshots? That is hilariously pathetic on Microsoft’s part because I see no other reason why they did this and never fixed it and it doesn’t actually make them look good at all.I also noticed that even with the extremely limited gallery functionality on Xbox, it also lags like crazy and acts up when you’re viewing your captures. I think Xbox OS tries to do so much that I’m convinced Microsoft thinks an Xbox should function just like Windows, which is also why their games tend to run worse and so many devs find it easier to optimize a PS5 game. The OS on PS5 is far simpler and to the point, which helps devs focus on what actually matters, which is the games, not the endless ads and worthless ecosystem features that are hogging up all the memory, which for Xbox is a very bad thing because the ram on Xbox Series X is split between games and OS. Quick Resume being forced to always be running is a fine example of a feature that cannot be shut off and automatically enables itself the moment you start any game app, and Digital Foundry themselves proved it causes system stutter that affects game performance and often disables 120hz functionality.All in all, some rather perplexing issues on Xbox for me. Bad design choices and oversights that years later were never addressed. This console feels very outdated to me compared to the freedom I get on PS5. I honestly think Xbox Series X is the worst console I’ve ever used, and it barely has any games either, so I’m not sure what Xbox players are even playing these days. I literally have Game Pass and couldn’t find anything worthwhile that I hadn’t already played on PS5 and Switch.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Whatever happened to value for the money?  And no more nag upsell garbage?","reviewDescription":"Ok, so the first gaming system I ever bought new was an Atari 2600 - so I'm definitely dating myself.  Beyond that I didn't go in for the continual upgrades and updates and all the constant upsell.  I finally did break down and buy a Wii decades later and that was fun until they shut down the entire multiplayer network and basically bricked the things to sell new games.  Fast forward to 2022 and this fails at every level for delivering satisfaction and fun without the constant annoyance of money grubbing.  First of all, include 2 controllers.  It's multiplayer and you ought to make it so out of the box.  Having to go buy an additional controller just to play it new out of the box with the girlfriend was an absolute annoyance.  Second - RECHARGEABLE BATTERIES!!!!  OMF....F....G!!!!!  Include rechargeable batteries and stop destroying the environment.  This is a simple no brainer.  Include a charging pad of some sort or even USB cables and 2 rechargeable controllers.  2 days in and the batteries died.  I'm shocked in the quality and power management.  I can use my phone constantly for days on end now and a few hours play kills a set of new batteries at $3 per pair and instead I had to go spend extra on rechargeable.Biggest gripe - NONE OF THE FREE GAMES ARE FREE!!!!!  Most are demo, limited, locked down!  The advertising says hundreds of free games!  FALSE ADVERTISING!!!!!  YOU MUST PAY MORE TO UNLOCK THE REST OF THE GAME!!!!  What the heck kind of scam is this?  I'm seriously thinking about just returning the whole damn thing and saying screw it.  I mean there's 49 selections for Grand Theft Auto and you must constantly buy new feature packs and updates, or even worse you must subscribe?  Heck, when I was a kid, you bought an Atari console and it came with a couple games.  If you wanted an extra game, you went and bought it.  There were no maintenance fees, updates, add-on packs that you could buy to get an unfair advantage!!!  What has this crapola come to?The game play and controller is like every other latest tech.  Buzzwords and features galore, but it is all predicated on screwing you for more money at every step.  CONSTANT IN GAME UPSELL!!!  PLAY A NEW FEATURE!!!  BUT WAIT, IT'S $9.99 TO PLAY IT!!!!  At this point I am really disgusted and I'm not going to pay to make Microsoft richer.  I'm going to put this console where it belongs inside Gates.","isVerified":true,"ratingScore":1,"reviewReaction":"45 people found this helpful","country":"United States","date":1668124800000}
{"reviewTitle":"Just barely outlives the warranty","reviewDescription":"I really loved this Xbox.  I had very much fun with it until it died.  I'm not a true gamer, but there were a few that I would play almost every day.  I also used different apps to watch free TV, but really only used the Xbox about 3 hours a day.  Don't get me wrong, I really loved this device, UNTIL.  1 year and just under 1 month after buying this, it died.  Less than 1 month out of warranty...  NEVER AGAIN!  For the price that I paid for this, failure after a year is unacceptable.  Actually, I've already given up on new appliances, they're all junk, nothing built to last (or even work if you're talking new washers).  For some reason, I thought new electronics were still acceptable, but I was proven wrong again.  I won't be buying electronics from the 70s and refurbishing them like I do with my appliances.  70s electronics always worked well, just too primitive to men anything to me.  My video gaming days are over.  TOTAL JUNK!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"I wish I could give it 5 star but...","reviewDescription":"I wish I was able to give the Series X 5 stars but Microsoft customer service has killed it for me.A couple hours after receiving my Xbox it froze and after rebooting small pixel sized green squares littered the screen. I attempted swapping cables, changing TVs, and performing factory resets. In the end the issue would not go away.I decided to see if I could get a replacement through Amazon. Unfortunately they are currently out of stock. So the only option they provided was a refund or gift card.So I decided to give Microsoft support a shot, hoping that I could send it in for repair and get a replacement. This is where my journey of jumping hoops began.Microsoft only option for phone support is to fill out a form to have them call you, which is fine most of the time. After completing the form I was told I would receive a call in 90 minutes. 3 hours later I receive a call that the queue is full and my request was canceled. I would need to try again the next day.Next morning at 7am I refill out the form and receive a call from a human 2 minutes later. Woohoo! I explain my issues and the steps I took to trouble shoot. The service agent sets up a service request and says that I'll receive an email with what to do next.After hanging up and waiting a bit of time I receive the email and my shipping address is completely wrong from what I had told him on the phone....... So I hop online and resubmit the form to be called and I'm told it will be a 90 minute wait this time. 3 hours later I receive a call from a rep. I explain the mistake that was made on my address and he says that he needs to put me on hold so that he can escalate the issue. After being put on hold for 30 minutes  I abruptly get hung up on.After waiting to see if I would get a call back with no success I resubmit a request to be called online again. 4 hours later I get a call that the queue is full and my request has been canceled. I will need to try again tomorrow. I've owned every Xbox console that's been release and I would consider myself a bit of a fan boy. I shouldn't be required to jump through hoops like this when something doesn't work properly. This is EXTREMELY frustrating as a customer and has soured me a bit on the release of this console that I was super excited for a few months back.","isVerified":true,"ratingScore":1,"reviewReaction":"167 people found this helpful","country":"United States","date":1605744000000}
{"reviewTitle":"Worst company, I've ever dealt with.","reviewDescription":"So I ended up for the first time in a long time, wanting to get back into the Xbox experience. Well, didn't have a very good one, especially because of the situation that happened. First of all, I got this Xbox. Had issues with it right off the bat. Note, I've only had this Xbox for maybe 30 to 40 days. Used, it. Maybe 3 times and I kept getting notifications specifically saying you were accessing sensitive content. Please log in. And it wouldn't go away, tried logging in lost. All my progress in my games and everything then made a new account had a different message. Pop-up so it was the Xbox with the actual issue. The Xbox itself some sort of wiring issue. Then I tried contacting the cellar. They basically told me the warranty was up and they couldn't do anything about it. Told me to go to Microsoft and basically pay money to ship it to Microsoft to pay for it to get it fixed. I didn't want it fixed. I wanted A refund. Just a friendly reminder. If you're gonna get an Xbox x or a PlayStation, just go to a store directly locally.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"This is what the XB One should have been","reviewDescription":"Not impressed. This is what the XB One should have been. The dash is exactly as it is on the XB One so you immediately get the impression of no upgrade to \"Next gen\". Absolute failure on Micros part. Pure laziness. One star for better game load times but you can get that with \"upgrading\" your XB One and saving $$$$$. Games \"Enhanced for XB X\" show zero difference at all whatsoever so Micro must use a different dictionary defining \"enhanced\". I don't follow PS5 so I don't know or care what they have but the games on this X are pretty pathetic. The current gen of gamers must be so easily amused or enjoy the same games over and over  since they all look like repeats of last gen. Nothing new, nothing appealing. Gamepass is just as bad. Maybe nobody makes \"new\" games anymore. The games \"on sale\" on gamepass are ALWAYS the same garbage. The controller felt weird in my hands as I hated the texture they put on it. It felt like sand. Glad the original Xbox One S controller worked on it. Oh yeah, they added a new animation when you turn it on (woopty doo) then it takes you to the exact same dash. So nothing new. If Micro had actually put some time into overhauling the dash instead of being lazy and keeping the old one it may have been better but other wise it feels the same as XB One. Oh and all the marketing teraflops, wifi, blah blah blah......not even noticeable and not worth $500. Returned. Keep your XB Ones and upgrade it with ext SSD instead of forking out $500 for faster game load times.","isVerified":true,"ratingScore":1,"reviewReaction":"21 people found this helpful","country":"United States","date":1661126400000}
{"reviewTitle":"Not really worth it","reviewDescription":"I had to get three different xboxes before I got one that worked. The first one kept turning off my controller and turning off randomly. The second one had problems with the fan. It didn’t even matter if it was on or off the fan would speed up to ridiculous speeds, even when idling. And even though I got the third one that worked, I still fill it is not even worth it. I had an Xbox one the original one before this, thinking it would be so much better, but I was mostly disappointed. My games seem to crash more often, it seems slower sometimes taking more than five minutes to load my games and apps (if a game is on). I feel like I never had any of these problems that I have had on this Xbox compared to the first one. Also, as soon as I got it and tried to start playing Xbox again, Microsoft banned my main account, saying that I manipulated their services even though I don’t even know what they were talking about; The customer service sucks not being able to get any help with anything. The only upside to this product, making me think he deserves a star is that it has 4K and HDR capabilities. But instead of spending $500 on this console and countless dollars on their subscriptions just get a computer and steam it will complicate your life much less.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1678492800000}
{"reviewTitle":"controller was bad from start. microsoft will not replace it wants me to pay for it","reviewDescription":"console has also developed power cycling issues after 3 months. unit has barely been used, played rocket league on it for 10-20 hours. unit is sitting out in an open area with airflow and just powers off with no warning at times. not even after an hour of gameplay. microsoft has been a nightmare to deal with on the issues. for first time in 2 decades, my next console will be a playstation. this xbox x has been a lemon from day 1 and i should not have to pay to fix a console that is supposedly under warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Defective Console that broke within 5 weeks of arriving","reviewDescription":"My 12 year son used all of his Christmas money to purchase an XBox.  After using it for only 5 weeks the HDMI plug broke off when it was unplugged to be moved.  Amazon and the vendor both refused to help putting the responsibility onto Microsoft.  Since we didn't purchase it from Microsoft directly they will only provide a refurbished replacement.  IF we would have bought it from Microsoft initially they would replace it with a new console at no cost.  My son paid full price for a NEW console that only worked for a few weeks.  Huge lesson learned to never purchase anything expensive, always buy directly through the manufacturer so that you can get support.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Useless, SO complicated, could not get to work","reviewDescription":"I wish I could rate zero stars. I tried for 4 hours to get console to work. Couldn't get past some stupid security info. screen no matter what I did. Called Xbox customer support. Could barely understand them with their broken English. This is not a negative racial comment, just a fact. One disconnected me after 40 minutes and didn't call back. I called back, on hold twice more for another hour before they came back, said they couldn't help but several customers were having the same problem. Said someone from another department would call me to resolve problem, they never called. Only then after no help or solution, did I return the console. What an incredibly complicated and frustrating waste of time!!! Beware Xbox, get a Playstation!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Does not last long","reviewDescription":"My xbox isn’t heavily played, and is well taken care of. Is only two years old and won’t turn on. This isn’t acceptable at all. We owned most of his other game systems for at least 5-10 years, and even them just upgraded them in most cases. If you want to shell out a crap ton of money for it only to work for a few years this is the game system for you.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Not worth it right now...","reviewDescription":"Xboxseries-x is a good system but it isn't mind blowing yet..Microsoft hasn't really released any good exclusive's except the same one's halo, forza, gear's, it took them. Over a year and a half to release something from launch date..Yes game pass is cool but honestly you ether own thoe's game's or you have already played them. Best thing about game pass is day one releases...But other then that keep your Xboxone-x cause this system isn't worth it yet Xboxseries-x and ps5 are only a 1.72 difference in computational power that's not much of a difference..ps5 has released over 10 or more exclusive's since launch..And only thing different between the two is quick resume, and Dolby vision, ..So no this system isn't a power house at all...once they use the xdk2 and make only xsx native apps. Then you will see the true power it can do. But today isn't that day","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662508800000}
{"reviewTitle":"Don’t buy physical copies of games.","reviewDescription":"If you’re wondering why it doesn’t say I purchased this item while writing my review, I bought this console off of a seller on eBay in 2021 because I was impatient to get a fairly priced Xbox, since this would have been my first one. Little did I know this would be one of the purchases in my list of \"I wish I had done more research\". To start off, I live in a semi-rural area, where I don’t have the best internet. Why am I saying that I live in a rural area? Because every time I buy a physical copy of a game and put a disk in, I have to most of the time wait a whole day (or longer) to play the game I just bought because the Xbox, before you are able to play the game, requires a download to “optimize” the game for series X. I know the gimmick of this console is quick resume and some optimization for older games, but until after I bought it I had no knowledge whatsoever that I had to do this stupid download even for new titles. The most infuriating part is if a new game is available for Xbox Series X, the marketing team will most of the time still cater toward Series S\/the Xbox one, and even if it says Xbox Series X on the game case, I still have to do a long download. I can sympathize an optimization of a newer game that wasn’t originally made for the Xbox Series X, solely to allow the game to access quick resume, but for psychical games that literally have “Made for Xbox Series X” on the game case, it makes absolute no sense I still have to do a long download to be able to play. I personally like collecting digital copies since there’s a charm to it, but for the Xbox Series X, it’s 100% better just to buy from the Microsoft store on the console. Regardless of the downloads there’s still a lot of good to come out of this console. The Xbox controller for the Series X is the perfect size, and is very responsive to imputs. Even though I hate doing the optimization downloads, I still enjoy the small graphical upgrades the Xbox Series X does to enhance the visuals of old games, and especially the relatively new ones too. While playing games on the console, the games ( at least to my eyes ) consistently run 60 fps and paired with my 4K HD TV, the games look stunning. In the end, there is some gripes I have with the console, since no console is perfect, but to be able to play some of my older games with more stable fps, a good controller, and new, visually stunning games, I am quite satisfied with the console.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650240000000}
{"reviewTitle":"Buying a new xbox series x.  Starfield.","reviewDescription":"My 2nd Xbox purchase, wireless and ethernet both went out on my 2 year old console.  Microsoft fix is $300.00. Hoping they tightened the manufacturing process since the initial release.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"DO NOT TOUCH THIS CONSOLE FOR A YEAR OR TWO!","reviewDescription":"Okay ive been team xbox almost my whole life and i saw this console and was like oooo with all these fancy features and fast ssd. BUT PLEASE FOR THE LOVE OF GOD WAIT! i regret purchasing this thing so damn soon. the thing that i realized very fast is that none of these features work for external hard drives like 0. and like what there is maybe...20 games that are good that you would want to play well guess what. thats the whole hard drive filled. oh but they got this sweet expansion card, oh wait.... its $200 for 1 TB you see where this is all starting to go down hill right? even EVEN if they made a like...i dunno a expansion card dock or something. THAT WOULD COST LIKE MAYBE DOUBLE OR TRIPLE THE AMOUNT YOU SPENT ON THE CONSOLE. so please for all my xbox gamers that have a ample amount of games on their downloads looking to switch over to the series x, DONT please wait for prices to go down, or for them to make new expansion cards. your gonna be stock with a glorified xbox one x at MOST and on very rare occasions a series x for 2 or 3 games. im sorry microsoft but you REALLY need to do something about this.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1618876800000}
{"reviewTitle":"Service Problems don't waste your money","reviewDescription":"I was very excited to get the series x as a Christmas gift but less than 30 days old and my unit wouldn't turn on. Contacted support and finally was advised to send it in for repair. If you don't pay Microsoft an extra $10 for fast shipping you wait another 2 weeks for your unit to come back to you. After all that time the new unit will not switch out of power saving mode. Spent 3 hours on the phone with tech support only to end up having to send it back again. Complained I should be given free fast shipping support agent agreed and had to contact another department to make this happen. Can't get any label fast or slow at this point because I requested the fast shipping, it has been a week. Called support back got no where. The support people are nice but English is their second language so communication has been an issue. This unit costs $500 and does not work correctly, service is lacking. Wait till the problems have been worked out with this unit before you buy!!","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1613260800000}
{"reviewTitle":"Disappointed so far","reviewDescription":"I was really looking forward to the series X, and was excited when I managed to get one in a Wal-Mart drop.  So far it has been nothing but frustration.  There is no optical port, which is bad since my receiver doesn't take HDMI.  The worst part is it won't connect wired.  My Xbox One and TV are the only things in my house I don't do wireless, and I would strongly prefer the series X be wired as well.  Support has been absolutely no help whatsoever.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1609113600000}
{"reviewTitle":"Available by invitation","reviewDescription":"This is only available by invitation, I applied and even didn’t get a reply ,though Amazon and Microsoft don’t specify what criteria to qualify for it.I don’t think this is a fair system","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670889600000}
{"reviewTitle":"Gets way too hot","reviewDescription":"The system gets way too hot during game play and needs a cooling fan. The older Xbox is by far better.  Had nothing but issues with the two we have….","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"Mostly great, but such a pain to log into accounts","reviewDescription":"Don't think you can just play split screen w friends.  20-30 minutes to get accounts logged in EVERY TIME.  INEXPLICABLY INFURRIATING!!  The opposite of fun.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644624000000}
{"reviewTitle":"Waited too long for this!","reviewDescription":"Just got the Series X today less than 24 hours of placing my order. I’ve been on Xbox One since 2014 so I figured with all of the amazing new games coming out now would be the time to finally upgrade. Setup was seamless, game sharing wasn’t effected once I got my cousin’s account on as his home Xbox and I was worried that I wouldn’t be able to use my mixamp tr because there’s no optical audio output but thankfully it only needs to be set up through USB 😮‍💨 which I honestly think it sounds better than my Xbox One. I’ve been playing Hogwarts Legacy since it came out on Xbox one and I can’t believe how much smoother and faster the series S\/X version is. My cousin whom I file share with ended up going to target and buying one (he has a day 1 Xbox One) himself after hearing me talk about how great it actually is. I usually feel like I’m going to regret such large unnecessary purchases but not with this, I’ve already fallen in love with this console after 12 hours of use. Everyone I know has a PS5 now and I wanted to be different, plus I’ve been an Xbox gamer since I switched from the PS3 to the Xbox 360 (I despise PlayStation controllers, they cramp my hands 30 mins in). If you love Xbox and are still on the fence and have the disposable income, just pull the trigger already and I bet you won’t regret it 😜","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1685059200000}
{"reviewTitle":"Muy bien","reviewDescription":"Recibí todo a conformidad, excelente, el producto llegó perfecto, funciona muy bien, tiempo de entrega rápido.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"My Awesome Series ( X )","reviewDescription":"It's came well package the box wasn't damaged Not even a scratch on the box and works great and the Accessories That a Bought for it came a two day before the system that what I call good service both of the packages came fast as hell I ordered the system and the accessories on 3\/1 and the accessories came on 3\/3 and the system came on 3\/4 and that fast love the service thanks Amazon now next month it my 40\" smart tv I'm hoping for the same service from yall...HAVE A GOOD DAY 👍🏼","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"It was definitely worth upgrading to a Series X.","reviewDescription":"The menu system and load times in games function better. The graphics are better, the game play is better, everything is more fluid and it makes for a much more enjoyable gaming experience. I very highly recommend upgrading to an XBox Series X if you haven't already.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Get it!","reviewDescription":"I don't know why they say no controller included it absolutely has the controller included! Never before used and legit. I was skeptical to buy an Xbox from Amazon but it's exactly what my suns wanted! They are so excited and play it everyday. 1tb of hard drive shall have them occupied for quite a hefty bit of time the specs on this thing are magnificent. (I prefer Xbox over Playstation) I purchased this 2 weeks prior to Christmas still works turns on and you can't even hear the silent fan within the system","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Item arrived on time.","reviewDescription":"The item arrived on time and in great condition.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Gifted","reviewDescription":"I got this Xbox for my fiancé as a Christmas gift. He loves it so much and we use it a lot in our family room. The quality is amazing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"XBox X, a great gaming system","reviewDescription":"I upgraded from an Xbox One to an Xbox X.  the X is awesome, great speed and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Great console","reviewDescription":"Plays everything flawlessly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Heavy use gamer approved","reviewDescription":"COD time played on series X: 11day 3 hourFortnite time played on series X: 45d 7 hourThere are many other games! Bottom line through hours upon hours of gaming this unit has performed awesome and I haven’t had a single issue. Add in the value of gamepass where you pay one monthly fee and have access to hundreds of games including day 1 releases and you simply have a combination that can’t be beat. A beast of a console specs wise and unbelievable value for games. My fps are always steady and I never have an issue with wifi connectivity. If anyone asks me I highly recommend buying Xbox!! You just can’t do better.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Plutôt satisfaite","reviewDescription":"Livraison rapide et efficace, je n'ai pas eu besoin du code lors de la livraison. Une chance, je ne l'ai jamais reçu.Poir ce qui est de l'emballage, là boite externe était belle, mais celle du xbox a plusieurs imperfections (voir photos, elles ne sont pas toutes là)... en voyant la boîte je me doutais que le xbox n'était pas \"comme neuf\". Après ouverture, il y a des marques de \"gras de doigts\/main\" partout sur le xbox. Aucune égratignure. Tout est en place dans la boîte. Lorsque j'arrive à la manette, les 2 joysticks contiennent une matière blanche dessus et en-dessous. Jai dût les nettoyer.....Le xbox fonctionne bien pour le moment!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1715472000000}
{"reviewTitle":"Lots of potential but poorly executed","reviewDescription":"Just the console, not a 100 other items you do not want and need to pay up for.My console came slightly damaged  - I did not want to return it because well it was hard enough to get, and amazon failed to offer me any form of discount or compensation for the damage. Customer service let me down.It is a series x...so yeah if you want one and can get this in stock it will save you a lot of $. Overall the console is very clunky and runs awful compared to my PS5 but hopefully they'll remedy it with some UI and software updates. Disappointing when you pay so much for something which lags opening up its side menu and is plagued by awful software and UI. The potential is there but it is not well executed. A $700 console should not freeze and crash opening the side menu...or randomly boot you from games. Sheer laziness on Microsoft for using the same exact UI as the Xbox one. Controller sucks compared to the PS5s dualsense but has been slightly revamped over last gen, but nothing to celebrate really still feels cheap and they ask a premium price for it .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1647129600000}
{"reviewTitle":"Bien","reviewDescription":"Marche super bien exceptée une fois elle a éteint sans aucune raison pendant que je jouais","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1712534400000}
{"reviewTitle":"Por qué no viene con el HDMI?","reviewDescription":"Todo bien, está la consola, el mando pilas y eso, pero donde está el HDMI?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1713744000000}
{"reviewTitle":"La caja llego super golpeada","reviewDescription":"Funcionó perfectamente pero la caja estaba super golpeada de todas las esquinas","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Mexico","date":1712620800000}
{"reviewTitle":"does not include Skype but a fast machine","reviewDescription":"We tried to load Skype onto this machine, but failed. Even trying to use Skype on the Microsoft Edge browser did not meet our expectations.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1701907200000}
{"reviewTitle":"Se lagea","reviewDescription":"Tengo la series s y está series x se lagea en GTA online da muchos bajones de FPS no sé si así sea el series x o si mi Xbox salió defectuosa pero corren mejor los juegos en Xbox series s sin bajones de FPS y ya tengo un año con el series s .Compré la versión internacional me mandaron una Japonesa ,no sé si sea ese el problema","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Mexico","date":1703030400000}
{"reviewTitle":"Strong hardware not being used to its potential yet","reviewDescription":"The SSD is the biggest improvement in the new Xbox. It's unbelievably fast at loading apps and games compared to the Xbox One and the Xbox One X as well.But unfortunately there's not a whole lot more to look forward to with this XSX just yet. No new exclusive titles that really challenge the hardware and the home screen UI is unchanged from the old gen and still 1080p. There are new bugs to contend with like the controller just disconnecting itself completely from the Xbox, and some apps no longer work well. There are some screen popping and HDR issues on certain TVs as well. And they've killed the Kinect entirely. Even though the UI is the EXACT same on this new XSX, it doesn't support the Kinect even if you have all of the connectors needed to hook it up.All of the great things about Xbox are still there on the older consoles too...","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1612396800000}
{"reviewTitle":"por el precio  es lo que esperaba","reviewDescription":"tardo algo en llegar por DHL,la caja  venia demasiado  maltratada pero la consola  para estar en buen  estado,viene con enchufe  europeo  tomarlo en cuenta","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1706832000000}
{"reviewTitle":"No funciona el WiFi","reviewDescription":"No le funciona el WiFi, solo ppr cable la puedo conectar a Internet.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"Mexico","date":1704672000000}
{"reviewTitle":"Xbox controller has issues","reviewDescription":"Xbox is great however it has a big issue currently where when you replace the controller batteries the controller won’t reconnect to the Xbox unless you hard reset the Xbox.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1615248000000}
{"reviewTitle":"Solid console","reviewDescription":"The console is worth more to me because it has halo on it. Otherwise, I think I am a playstation gamer","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640217600000}
{"reviewTitle":"Product opened previously.","reviewDescription":"Product was branded as \"brand new\" but when box was received the origional seals had been cut and were simply taped over with packing tape. Luckily it wasnt a scam.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625875200000}
{"reviewTitle":"Great performance, poor game selection","reviewDescription":"Best console in regards to hardware, but doesn't have the game selection that the PS5 does.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639958400000}
{"reviewTitle":"Still Glitchy","reviewDescription":"This is a great product, but needs to get the kinks out of the system. I have been an xbox person since the original box.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1610236800000}
{"reviewTitle":"Mad","reviewDescription":"I fw Xbox but my system crashes a lot","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1637107200000}
{"reviewTitle":"Too hard to get","reviewDescription":"Arrived safely, works great. Giving 3 stars because of the difficulty in finding one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628812800000}
{"reviewTitle":"PS5 is Better","reviewDescription":"The PS5 is 10X the machine. DO not waste your time and money","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1625616000000}
{"reviewTitle":"Its ok","reviewDescription":"Price sucked but it came a day early","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1615939200000}
{"reviewTitle":"Great Product","reviewDescription":"The product was great, smaller than I expected","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611014400000}
{"reviewTitle":"Broken console","reviewDescription":"Xbox came quickly but not as advertised. Console had scuff marks all ofer it looked like someone tried to peal off the serial sticker. And did not send a signal to the tv im guessing the HDMI port is busted as it was loose.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Xbox so bad that games are unplayable","reviewDescription":"Console consistently crashes, can barely play a game without being sent back to dashboard. Tried everything the internet suggests but it’s still unplayable. Missed my return date, sending back to Microsoft for warranty repairs. Should have gotten a PS5. This is ridiculous","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Unplayable, turns itself off when playing any game","reviewDescription":"I got sold a damaged Xbox that was supposed to be like new. I have tried everything from uninstalling games to factory resetting the Xbox itself and still the same issue is occurring. I spent a large amount of money on this and I expect every cent back","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1677196800000}
{"reviewTitle":"Can't swap lt and rt with lb and rb. Ps5 can","reviewDescription":"Why leave this out? It's most important feature when it comes to your competitor, playstationHalf of the games don't have the option for this feature in their settings. Which makes ps5 way better if you don't want to aim and shoot with the triggers(lt\/rt), and instead with the bumpers","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1663027200000}
{"reviewTitle":"Controller Drifts and can't be replaced","reviewDescription":"The controller drifts and xbox says is out of warranty already - Bought it 2 months ago.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Crashes!","reviewDescription":"My series X keeps crashing after a few mins of being turned on. I can just power it up and let it sit and it will power off completely without notice. Basically I have a very expensive paper weight! Smh!","isVerified":true,"ratingScore":1,"reviewReaction":"45 people found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"Device would not turn on","reviewDescription":"Right out of the box, the device would not turn on. Merry Christmas to my kids.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Stopped working after while - DO NOT BUY","reviewDescription":"Bought this and was super excited about the new Xbox. It worked ok for a couple of months and then problems began.Hard drive experienced issues, the unit experienced intermediate power loss and it would reset all by itself.Finally stopped working.Piece of junk!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Died after 2.5 years","reviewDescription":"Thanks to HotStock which let me have this chance!Big F to the scalpers!—Update 12\/20\/2023The console cannot connect to the controllers despite trying various approaches (tried different good controllers, wired or wireless, console reset, controller firmware update, offline update). The console is dead basically. My last gen Xbox bought in 2017 stills until today. Seems quality dropped a lot for this gen.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626393600000}
{"reviewTitle":"Sucks","reviewDescription":"The system keeps cutting off mid game play and now the hmdi cord slot is loose.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Fun upgrade","reviewDescription":"My friends wanted to play BG3 and of course my  Xbox one X was not supported (annoying). So I sold my old on to a friend and bought this on a cyber monday Deal I think. It was a crazy deal.The first thing I have to state is that just the internet speed\/wifi was crazy different.  Games that took me 4 hrs to d\/l on xbox one x series took me less than 30 min on this one.The transfer over of my profile and game was way smoother than I thought it would be and all my save files.No issues with system yet (only had it for a bit over 2 months I think)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Xbox One Series X","reviewDescription":"I’m so happy for Xbox One Series X 😊","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Great quality!!","reviewDescription":"This Xbox is worth it. It is great quality and packaged exactly safe to have no damages.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Fast, quiet, powerful! What more can you ask for? Better design maybe. Best console ever made?","reviewDescription":"Excellent is the best word to describe this xbox series x. I been a gamer since the 1980s and this is by far the best console ever created. Lets take a look at some pros and cons and also why I think its better then ps5.ProsIts fast! When I say fast I really mean FAST. Loads games in 5 seconds flat, menu system is snappy etc.It's powerful! The few games available to try right now that are optimized for the series x look very good and you can tell the future will bring alot of good high end graphics to consoles finally!Great selection of games thru game pass. And its backwards compatible with all Xbox games from previous consoles.ConsSo far there's only 2.1. I think they could of did better with the controller.  Although I still believe xbox controller is better then the competition in layout and thumb sticks etc. the plastic just feels cheap. The better grip and dpad is nice but the overall feel is cheap. Theres a small lip at the top that gives it a unfinished feeling. Also no rechargeable battery is a bummer as well.. Ps5 controller just looks way better and more of a future look to it.2. The system is bulky and looks like a fridge or just a big black box. The insides alot of work went into to develop a closed system with good cooling and a monster fan which is quiet and I appreciate that but the design is not good.Ps5 design is definitely better.Now why do I feel the series x is better then ps5. It all comes down to a few things.1. It's a bit more powerful2. Better online game library with gamepass.3. Better mobile play options with being able to play straight on your mobile phone or laptop or pc gives the xbox an advantage.If you always been a Playstation guy and all your friends are on there I can see sticking with ps5. But if you don't care about friends and want a bit better experience with ability to play your games even on the go then xbox is the moveI know this is a long review but I feel microsoft deserved it since they did a hell of a job with this system and I highly recommend it to anyone.If your a gamer and thinking of switching from pc to a new console then this would be the one I recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Get your game on","reviewDescription":"Picked this up over the holidays when it was on sale. Upgraded from my original Xbox One to this. Loads faster at start up as well as graphics in game. No more missing graphics in COD online or Zombies.Shame people are still asking such high prices for used ones when you could have snagged one of these for cheaper AND brand new for two months last year.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"I Love the XBOX system, its the best in every way!","reviewDescription":"Much, much easier to use and set up than the Playstation 5, I have both consoles. A very friendly system and a pleasure to use. Everything about it works perfectly! I own 4 Xbox Series X and they all work excellent, I could not be happier. Buy this system, you will not be sorry.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Xbox Series X","reviewDescription":"It's great 😃👍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Definitely Better than the PS5","reviewDescription":"I love it way better than my PS5","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Too much fun!","reviewDescription":"Upgraded to the newer console and love it. I play daily and for hours. No more overheating or glitching. I love my Xbox!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"FAST, QUIET, COOL, 4K CAPABLE & RELIABLE !","reviewDescription":"7 Apr 2022.(Product arrived 6 days after Prime purchase.)First, thank you Amazon for offering this to Prime members first in a effort to bypass bots that pluck these from real people and real gamers. I am a real human and gamer and actually play this console for it's intended purpose.Second, as a near daily gamer with over 400,000 gamerscore, who has been playing Xbox since 2007, this console definitely is the culminating event... thus far. Games are played smoothly with the best 4K graphics.This replaces my Xbox One X.Improvements:-The console is more quiet than my ceiling fan, so I can't even hear it.-It's cool. It vents heat well to maintain CPU peak efficiency. (Update 1 Jul 2023, the console does kick out quite a bit of heat.)-Load screen time was cut by more than half. I usually load into a game before all my Co-op partners, even the host.-Lag is no longer a problem, unless it's internet related.-Set-up is extremely easy as the contents are only the console, 2 cords & a controller.The full price tag ($499.99) was currently well worth it for anyone who games regularly on Xbox. I considered the Xbox Series S, but that idea was quickly shot down because the hardware is much less powerful and it doesn't play a physical disc. I like my physical copies still (even though discs are nothing but verification of permission to play the current version of the game, the actual games isn't on the discs anymore).I checked online for a new Xbox Series X from several retailers 5x a week for a year and a half before Amazon came through. I simply ordered it and it arrived on my doorstep. Never left the house to claim a ticket or stand in line.Lastly, thank you Amazon for selling the stand-alone console and avoiding the greed of making it an $800 bundle of other junk we don't need.Gamertag: E vee dub","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1650240000000}
{"reviewTitle":"Won’t play 4k ultra hd Disc","reviewDescription":"If your buying this for dvds don’t. It won’t play 4k ultra hd discs. Just error codes and Microsoft is ignoring the issue… game pass is a joke and ea relationship with Microsoft is a concern at this point…","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Didn’t work after 1st start up","reviewDescription":"Very disappointed As I’m a very big Xbox gamer I have over $10k in games in my collection and that’s just Xbox games. I low key feel like this is a scam you log into your Xbox and go to play the next time and it does work. Then you send it back now your still logged in and they can “fix” and have access to your account. I’m very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1633305600000}
{"reviewTitle":"Power supply issues - Xbox dead out of the box","reviewDescription":"Got the Xbox the other day and lo and behold the power supply issues that were reported on LAST YEAR are still happening. My Xbox is dead out of the box and Microsoft wants me to send it in for repair.At this point in time I can not give a good review because of this reason.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1624924800000}
{"reviewTitle":"product was DOA","reviewDescription":"Every game crashed within 2 minutes of launching. Rebooted, reinitialized, nothing helped. Returned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Remember why I switched to sony","reviewDescription":"4 hours into setting it up and now I remember why I switched to PlayStation years ago.Xbox is trash.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Pair button to connect controller doesn’t work","reviewDescription":"Broken out of the box and no way to talk to anyone to troubleshoot it. This world is a mess if you need customer service these days. There’s no one there to help. Will be returning. Pretty worthless if you can’t connect a controller.","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"The interface is nothing like the Ps5.","reviewDescription":"The Ps5 controllers are way better and larger than the Xbox controllers.  The Ps5 looks and feels more like a next gen console compared to the Xbox Series X.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Not worth it!!","reviewDescription":"Ewww i cant believe i acctually got this , its heavy and slow and is not worth it!! I honestly just threw it away could not handle this","isVerified":true,"ratingScore":1,"reviewReaction":"45 people found this helpful","country":"United States","date":1604966400000}
{"reviewTitle":"What's going on here?","reviewDescription":"Seems to only be on installed games. Playing over the cloud alleviates the \"sparkle\". Also happens on It Take Two also downloaded. Thoughts?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"After 7 months of owning Xbox series X","reviewDescription":"Not that great thought I would be more powerful and the graphics would be better I thought I’d work better on shooter games by call of duty and battlefield get crushed by PC hackers cross play trash if I was you I’d spend a little bit more and just get a good PC with a good graphics card","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1641168000000}
{"reviewTitle":"Save your Money!","reviewDescription":"This product isn’t that great. The hype is too much for this. It’s the same as basically all of the other ones Microsoft has made. Save your money!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1608076800000}
{"reviewTitle":"Great powerful system","reviewDescription":"The product was way overpriced.  The product itself is rated 5 stars but the price is why I gave it 2 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1636243200000}
{"reviewTitle":"started having overheating issues and would shut down not worth the price","reviewDescription":"high price for bad quaility","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"Factory seal was broken.","reviewDescription":"Seems fishy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672531200000}
{"reviewTitle":"Ok product","reviewDescription":"Series S is a much better buy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"Not new","reviewDescription":"This item was labeled as new and it was not new.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1630800000000}
{"reviewTitle":"Updates updates updates","reviewDescription":"$500 for a system that constantly shuts off and has frequent bugs. Yay!  Microsoft sold us a product that was clearly not ready for prime time.  Games and features are often buggy, and many games won't work at all.  Want constant ads on your main page?  Cool, because Microsoft WILL NOT allow you to remove ads from your console's main page.The system requires you to be online for just about everything, which means you're out of luck when their system is down. This happens at least once per week.I loved my Xbox 360, had mixed feelings about my Xbox one.  I'd hoped this would be the system to bring Microsoft back.  If anything, Xbox Series S and X have convinced me I should have just held out for a PS5.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Got the product but.......","reviewDescription":"Other","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649289600000}
{"reviewTitle":"Remotes bad that come with product.","reviewDescription":"Remote quit working after warranty was over.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629763200000}
{"reviewTitle":"Storage fail","reviewDescription":"I cannot even begin to tell you how ridiculous it is that optimized games have to be played from internal storage but it only comes with 1tb. Should be a minimum of 4 with expansion possible","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Absolutely worthy!","reviewDescription":"I bought xbox 2 months ago. For the whole 2 months, I've been using Xbox Golden Pass to have fun on this console. To be brief, it's far more exciting that I expected. I used to be a PlayStation player. But I'm disappointed about Sony and decide to try Microsoft's Xbox. It's absoluted fantastic. I can find any popular games with XGP memebership. Every weekend I play games with my family. It greatly contributes to our joy. Xbox Series X's design is bold and monolithic. It perfectly fit my decoration. Splendid. To be brief, it worths the money. Thanks microsoft for such a powerful console.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"awesome","reviewDescription":"Bought this for my daughter.  She LOVES it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Took a week to arrive","reviewDescription":"Other than taking a week to arrive I'm happy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Was given as a gift.","reviewDescription":"Very well received.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"As described","reviewDescription":"Bought this as an upgrade for my Xbox one.  I just love it and the price was right.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Great game console","reviewDescription":"I bought this to replace my 10 year old first generation Xbox One, and the difference in speed and frame rate are immediately noticeable. Loading times from my T7 SSD take seconds to finish versus the old console.Plus, there’s no bizarre loading latency during gameplay:For example, freezing cutscenes with out of sync audio, & occasional pauses for the old console to load more of the game off the SSD.The Series X with newer hardware & USB Super Speed 3.1 fixed these problems.My one issue with this new Xbox is that they did away with the HDMI-in port that allowed me to watch cable\/satellite TV through the console. Not a problem with the console in regards to what it has to offer, but more of a loss of convenience.Some final notes I feel worth mentioning:•When it came to connecting up the console, it’s a breeze.• There are fewer USB ports versus the old console.•When you power up the console for the first time, you are required to get the Xbox App for IOS\/Android and have an internet connection to start the process of getting the console running.•Games made specifically for the Series X\/S must be installed in the internal storage to run. Xbox One games run fine on a decent SSD, like my T7.•On a final note, despite the rectangular box shape, it’s surprisingly small, quite light in weight, and very quiet.Overall it is a great game console and it delivers exactly what it promises.","isVerified":true,"ratingScore":5,"reviewReaction":"23 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Update finally let me connect 🙌🏾","reviewDescription":"If you get this xbox I would suggest doing every thing through remote control make sure you wifi connection is strong 💪. If it is weak it will not let you connect and you will be very upset like I was... but now it's working perfectly this will be my second day using it if anything goes wrong I will give another update ...ps the graphics are phenomenal 😍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"This thing is bonkers fast","reviewDescription":"I gotta say, when I received the invite to purchase one of these, I was seriously on the fence about just how much better it could really be. Well, initial reaction was ho hum, just another xbox, but then i fired up a game and immediately noticed how fast it was in loading and the frame rates for optimized games are insane. I really enjoy how smooth everything is even in older unoptimized games. The amount of time i save not sitting waiting for a game to load is just crazy. Performance is fantastic, no lag to speak of, games load fast, graphic detail is awesome, love love love this xbox.One downside though is I play with friends that don’t have an X and if I want to play with them on the same game, some of the games, require you to play the non-optimized version. This makes me sad. I dont know that this is an xbox problem or just that of certain publishers.Only glitch Ive had is the xbox “forgetting” how to sign in. A reboot fixes that so far. That said, im really happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1684108800000}
{"reviewTitle":"Very easy upgrade from Xbox One. Same cables and old external drive just plugs in.","reviewDescription":"I like that it wasn't a jarring change to my Xbox experience. The new games, like Star field, are amazing in their detail and smoothness of motion.What I really like is that it recognized all of my old games from my Xbox One hard drive, and they can play right from it.I don't hate that new Xbox X games have to play from the internal drive or a new (expensive) external drive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Una muy buena compra","reviewDescription":"Recién la he probado un día e hice algunas pruebas de rendimiento y la verdad es que la consola sí cumple. Al menos en mi caso, considero que vale completamente la pena por el precio que tiene.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Underwhelming","reviewDescription":"‘Quick Resume’ does not reliably work, and games like Assassin’s Creed: Valhalla make you CHOOSE between higher quality or 60FPS.I have not seen a significant difference in graphics quality between the One X and the Series X.  If I were to recommend a consult to someone at this point, I would say save your money and just buy the XBOX One X.The one saving grace of this console that I HAVE noticed is slightly faster load times for games.  That’s about it.EDIT:Less than one week in, and I now seem to be getting black and pink “artifacts“ on the screen.  I have reached out to GameStop for a return\/exchange.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614988800000}
{"reviewTitle":"Supply and demand at its best","reviewDescription":"I know this is an amazing console, but, this jacked up price seems a bit greedy wouldn’t you agree? Oh well, I guess karma will control this one. Best of luck to the seller.. I would not  mind paying 100 extra dollars but this is absurd lol.  There aren’t really any good games out for it yet anyway it takes about a year or so for something decent to come out so I will wait.Thank you for making the price is way too high so I’m not even attempted to purchase one of these","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1615939200000}
{"reviewTitle":"Not a full generational leap","reviewDescription":"Its alright, could have been more powerful imo. Games look a little better but not a generation leap like other consoles have neen imo.Not to many games for it and its been nearly a year.Imo they are slowing the stock on purpose. No excuse for it anymore. Youve had time to find alternatives. Ps5 releasing a new model for more supply....you better step up your game.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1632355200000}
{"reviewTitle":"Will cost for new upgrades","reviewDescription":"I’m a fan of Xbox but not impressed they took out the Kinect factor so I can’t monitor what is being said while my grandson is playing also storage cost is unreal this little box can turn into a money pit if not careful love my old Xbox x","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607817600000}
{"reviewTitle":"\"see all purchase options\"","reviewDescription":"when i click see all buying options it is blank, ive tried everything...this has been happening for over 2 days.","isVerified":false,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1626998400000}
{"reviewTitle":"Got tired of waiting","reviewDescription":"Got tired of waiting for an invite..... ordered fromMicrosoft no issues.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674345600000}
{"reviewTitle":"Wait till next year, cause you ain’t getting one","reviewDescription":"Haven’t got one because of scalpers but I know it’s great, it would be great if companies like this one would actually do something about them.Great console, horrible distribution and execution.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607472000000}
{"reviewTitle":"price","reviewDescription":"i did the math 87 for 6 months thats $517","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658620800000}
{"reviewTitle":"Awkward (strange)","reviewDescription":"The controller design is hard to reach certain directional and analog sticks and buttons. But xbox is a good system. Playstation is easier on its controllers.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641859200000}
{"reviewTitle":"Just ok","reviewDescription":"It's not bad but I guess I was expecting more. Like faster dl times. In a side by side test with my xbox one cutscene and game load time where pretty close with the series x. The x being just a little faster. Like maybe a second.The controller is a joke the layout is fine but the response is ludicrous having to jam buttons just to get it to respond unfortunately that is no where good enough for any online play.Not sure if it is just the one I received or this is a known issue. My 1x controller is fantastic with one of the best response times I have ever had.My 1x cost about the same as the series x so it is a small upgrade VERY SMALL.Do I recommend it sure if u have the money and u like xbox why not.But if u have a 1x and are looking to \"upgrade\" I'm not sure this is for u. I despise sony but the ps5 is faster I think it does not seem as if it's quite as bogged down with down load issues.I have a gigabit fiber internet. The fastest I have ever gotten on my 1x is about 230mbps and dl a new game was well a joke. With the series x dl will start at around 500mbps and then I can watch as it counts down to about 120mbps if I run an internet speed test through the series x it says my speed is around 920 to 940 then I can go back to dl screen and see the speed bumps back up around 500mbps only to watch it drop back to about 150mbps or so. This is a known issue with Microsoft xbox and has been for years and years. It's been documented all over the internet just look it up.So again it's not bad if u have the money and in need of an xbox then get it. The graphics are nice but it feels like there are few games actually made for series x just a lot of upgraded one x games.Not sure what happened of the last 5 or 6 years but Microsoft has definitely dropped the ball on that one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662681600000}
{"reviewTitle":"Didn't even last a year","reviewDescription":"Well just 11 months after purchase and 6 months after setting it up, a moderately used XBox Series X is experiencing a \"Black Screen of Death\" with zero troubleshooting options.  My only options are to see if a local repair shop has a donor board for a chip swap or I shill out another $500 for a new XBox.  The XBox was actually performing perfectly but after running an update and rebooting, it seemed a little off, so I rebooted it again and it never came back online.  Very disappointing...","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Xbox did not work since the 1st day I received it","reviewDescription":"Xbox did not work since the 1st day I received It the Xbox was sent out of the country by the time we figured out that It did not work the Xbox could not be sent back on time before the return window was closed now seller nor Amazon are willing to do anything about it and I'm stuck with a console that does not operate at all","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Broken sold as brand new.","reviewDescription":"This product was sold as “new” I paid 600+ for it and the retail price is 500. The console came and only worked a few days before numerous games wouldn’t load or work with error codes. I ran thru an entire tutorial given by Microsoft to fix potential problems and Microsoft opened a case file for me and told me to return the product as a new Xbox shouldn’t be giving me these sort of problems. I’m out of 600+ dollars for a console sold as new now having to return it and then having to wait the time it can get to Amazon and then finally wait to see if I can even get my refund for what I paid for. This was a massive waste of time, effort and money. 0\/Five don’t recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"Not Amazon's fault, 5 stars on their part.","reviewDescription":"Got the unit and powered it up. The screen flashes and the audio cuts out. Troubleshoot it with Microsoft and found the xbox was broken. After being pushed away and ignored they finally decided to fix it. Got it back a week later. I power it up and same issue. I talk to Microsoft and they told me they repaired it but couldn't tell me what they repaired. I asked for a replacement. Complete radio silence from Microsoft. Sent three more emails to the same employee in the course of a week and not a single work from Microsoft. Amazon accepted the return immediately. Using the refund I bought a ps5.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1674172800000}
{"reviewTitle":"XBOX 10","reviewDescription":"This didn't work from day 1 returned 14 days later.  I paid $484. This company only gave me a refund of $399. They charged me $85. For restocking fee. They said nothing was defective, so they can resale why charge me so much to restock?This company is a rip off.Go to Best Buy!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Great product, horrible delivery service","reviewDescription":"Amazon delayed my package multiple times not agreeing to the delivery window THEY set at the beginning. At one point they couldn’t even say where the package may be at. It eventually went through UPS and even after a day of being with UPS, there was no tracking information. I finally received the item late one evening. I will never ever purchase an item this expensive through Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Defective Blu-Ray Player.  Audio and Video Loss.","reviewDescription":"Was looking forward to the XBox Series X system.However, the Blu-ray player skipped audio on the first day.Disc was brand new....(Yakuza Princess  Blu-ray  4K Ultra HD).The second day, trying a different brand new Blu-ray 4K UHD disk (No Time to Die).The player skipped audio multiple times and then the video went competely black.I believe my Xbox Series X was made May 2022.OS Build 10.0.22000.4975There are numerous internet reports of defective Blu-rayer players in the XBox Series X.Also, good to note is that the Blu-ray app on the XBox Series X is outdated and in desperate need of an update.I returned the XBox Series X the same day.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1658361600000}
{"reviewTitle":"Stopped working within a few days","reviewDescription":"I bought this new and the console worked perfectly for a couple of days, but then stopped turning on suddenly. I have trouble shooted it every way possible, but it simply won't turn on again. It starts to for a few seconds and then immediately turns off.This was bought as a Christmas present so it is very disappointing to not have it work properly so quickly, especially on Christmas day.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"Xbox Series X not worth $550 ..it has no games..","reviewDescription":"After Microsoft epic first party exclusive game,Redfall became the #memes,the company lied about performance,an it recieved bad reviews,from Earth all the way to Mars...Microsoft send their Acting CEO guy Phil Spencer,to announced to the entire world,that At Xbox,it is not his Job to make great exclusives games,making exclusive games will not sell Xbox Series Hardware's..he Only want whoever's buy an Xbox Series Consoles to just play the Xbox 360 games over an over...in 2023..when Playstation is about to have Final Fantasy 16,SPIDERMAN 2,an more.....Don't mind those Xbox Phil Spencer step brothers like MrMattyPlay,CrapGamer,an Colt Eastwood,those dudes loyalty to Phil Spencer,will soon find out that it really hard to create Xbox contents on their YouTube channel really soon....#playstation4 #playstation5","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1654473600000}
{"reviewTitle":"5stars","reviewDescription":"Playing games this was supposed to have a one year warranty on it. My son sent it in and you told him you couldn’t fix it. I’m calling a lawyer if you don’t fix the box for him you need to contact me at 860-68965336 or this I would like a new one sent out please if that’s possible","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Xbox","reviewDescription":"At first I thought my controller was damaged but it was not I got it resolved I give it a 10 out of 10 and would recommend buying it. 🤙","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Fantastic Evolution of the Xbox Ecosystem","reviewDescription":"This is a fantastic console, runs great and is whisper quiet. I wouldn't be the first to admit there aren't a ton of games that fully leverage the Series X's horsepower at launch, but I'm sure that'll improve over time, just as it will for the PS5.Availability is a serious problem, and Amazon is not helping by selling to scalpers and allowing scalpers to resell consoles on their platform at insane markups.Pros-- 4K120 support. Not many games leverage this yet, but games that do look outstanding.- SSD - Any games placed on the internal SSD load at PC (or very close to PC) speeds, which is incredible. Once the SSD is full, games can be stored (but not ran) from external storage. Transfers usually don't take long between external drives and the SSD, but your mileage may vary depending on the kind of external drive you have.- Compatibility - The Series X is fully backwards compatible with any Xbox one game (besides Kinect), and works with a pretty large selection of Xbox 360 and original Xbox games. Just about any accessory that worked with Xbox One will also work with Series X, no need to buy all new headsets, controllers, or much of anything.- Looks\/Aesthetic - The Series X blends in super well into an entertainment center. Mine sits right at the center of the entertainment center and doesn't look all too different from something like a home theater receiver- Temps\/Noise - The series X runs super quiet and has no issues with thermals. The only suggestion that I would have is don't put it in an enclosed cabinet. It intakes through the bottom of the backside of the console and outputs heat through the top, so that needs to have at least a few inches of clearance and space to intake ambient air. My entertainment center has an open front and back, and the Series X has no issues in there.Cons-- Availability - this is a little bit Microsoft, a little bit Amazon and a lot of bit scalpers (\"resellers\"). Please don't buy this console for more than the $499 MSRP, it encourages scalpers to snap up more supply just so they can make a buck. Supply will catch up, but it's going to take time especially given the state of the supply chain right now.- Wireless Headsets\/Accessories - I'm absolutely flabbergasted that Microsoft STILL hasn't figured out how to enable any USB\/wireless headset to just WORK when plugged into the series X, or allow for bluetooth pairing with the console. Instead, Xbox still relies on a proprietary wireless standard or the ridiculous port on their controller for the use of any headset that isn't a generic 3.5mm one. PlayStation and PC BOTH support this easily, plug-and-play and have for years. There's no excuse at this point.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1614729600000}
{"reviewTitle":"Great device","reviewDescription":"Easy to use, fantastic graphics, my grandsons very happy with it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Great console","reviewDescription":"One of my favorite modern consoles it's surprisingly small I expected it to be bigger which was a pleasant surprise","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Not for me ipc","reviewDescription":"Xbox Series X does what is claimed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"This review isn't going to help you off a fence.","reviewDescription":"Look, you are either going to buy an Xbox or not. It isn't a random feeling someone gets like when walking down the candy section. It's and upgraded xbox one, just like that was an upgraded Xbox 360, just like that was an upgraded Xbox. No difference than how Sony made the playstation, PS2, PS3, PS4, and PS5.Now I will say, opening this up and turning it on WILL NOT feel like it did when you opened any of the following: NES, SNES, N64, GAMECUBE (defiantly won't feel like that), OG Xbox, or the PS2. They hit different but equally, except the GameCube that thing was just a touch better. If you were lucky enough to turn these on back in the day then this Xbox will be like turning the microwave on to heat up pizza rolls. The sound of it starting and humming doesn't fill you with the antici............................pation like other systems have.Now I'm not saying that the Xbox is dull or not worth it, the ps3-5 are just as blah. None of the systems lately have had that startup experience like the ones I mentioned. Yeah for me the NES was something new to the world and it was because I was so young that it impacted me like it did but the SNES was pretty special. the N64 held its head above water just, but the GameCube was something entirely different with the PS2 right there on its heels. The og Xbox was about like the N64, it wasn't bad but it didn't get to you like other systems did.Yes I'm old, my nes has been with me since I was 5 and I didn't limit myself to a brand. I still have my Sega master system and other Nintendo\/Sega systems along with every Xbox and PS system. I've even got a Panasonic 3do..... but anyway.Like I said, this review won't get you down off the fence. Only advice I have is if you want it and have the money then get it but don't be one of these fanboys that is diehard Xbox cause one day you'll hate yourself for it.","isVerified":true,"ratingScore":5,"reviewReaction":"55 people found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"As described","reviewDescription":"Everything was in the box and works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Todd Howard did it again!","reviewDescription":"My old XBone was starting to show it's age and my wife was getting fed up with Skyrim's loading times so for Valentine's Day, I got her the XBoneX. Turns out we had to buy the Xbox One version of the game. So that's the 5th copy of Skyrim my family owns. The tower is like that monolith from 2001, sitting there ominously, waiting to display power. The new controller feels great and it's neat how quickly you can switch from app to app or game to game.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Series X","reviewDescription":"Very pleased with purchase. Xbox series X brand new came on time and was as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Awesome machine","reviewDescription":"Great at what it does","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"I'm back!","reviewDescription":"I had an old xbox system that prevented me from playing the new games but now I am back and loving this new world of gaming. I hope to stick with this for a long while.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720828800000}
{"reviewTitle":"Love it What do you expect","reviewDescription":"It's an freakin XBOX what do you expect it's wonderful.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Awesome","reviewDescription":"Bought this for my kids because our older model was broken.  Works great and the kids are loving it.  Fan is a little loud but not a deal breaker by any means.  Love this Xbox!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"visibly faster all around than my XOX","reviewDescription":"I bought this new console specifically for starfield. pretty sure my XOX was not going to run it. but I play a ton of Xbox games anyway so I didn't mind. it was well worth the cost. The NVMe SSD is phenomenally fast. I want to get another for the external expansion plug. I have a 500 GB SSD and a 5TB game drive plugged into the USB 3s. but the quick start is really awesome so I would like to have another stick for increased room there. some games need to be restarted every so often. Cyberpunk crashes if you use quick start too many times on it. it's an unstable game after running for 20 to 30 hours without a restart. That's fair. I'm not super picky about that because I get a lot of enjoyment out of the game.what I don't understand, Microsoft, is why Seagate is the only supplier of the NVMe expansion cards, and why they are all out of stock!and another thing, an NVMe for my PC is about $50. why are the expansions for this console $150? why don't you have one yourself, instead of only supplied by Seagate?but that complaint belongs on that other product, not the XSX. although this is a good place to bring it up as well.this console is noticeably faster than my XOX. you might say that's obvious but the OS \/ dashboard is remarkably faster. I had to run something on the XOX to transfer games over and was surprised at how sluggish it is. I had just gotten used to that and didn't know that it could be so much faster. and it is on the XSX! it is so much faster!I was happy to see when this popped up in stock for the first time in years, literally. I grabbed it immediately because starfield was coming out and I was going to do my best to get it to run on the XOX but was skeptical. so, grabbing this was a no-brainer. I'm happy that I got it for $500 and that I waited for supplies to resume.it's a surprisingly heavy black box! noticeably heavier than an Xbox One or XOS or XOX, and I owned all of them. what in the world is in that little box that makes it so heavy? it feels like there's a pound of gold inside. it must be a very heavy dense heat sink because I can't imagine silicone and plastic weighing so much. motherboards definitely don't weigh very much. The 4K Blu-ray doesn't wait that much. The power supply? yeah, probably, that might be integrated with the heat sink. not a complaint but just interesting.","isVerified":true,"ratingScore":5,"reviewReaction":"44 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Starfield Awaits","reviewDescription":"First, I'll start with my cons: Amazon's waitlist. I've been holding out to purchase an Xbox Series console until I weighed out what works best for me. When I finally decided on the Series X, I knew it might be difficult to get. I clicked the waitlist or whatever button to be deemed worthy of purchasing a Series X and waited. And waited. 4 weeks went by, nothing. 6 weeks went by, nothing. I randomly checked one evening to see if anything had changed and what do you know? Amazon showed it as In Stock! No text, no email, no notification from Amazon. I hurried home to check from a computer in case my eyes\/phone had been deceiving me and they did not. So I ordered it right then and there.With that out of the way... The XSX really is just an upgrade in almost every way possible. Love that backwards compatibility is always on the checklist for Xbox. Love that the UI is the same no matter what platform I access it from (Xbox One, Android App, XSX, PC app). Love that once I power it on, sign in, I am ready to go.While I don't have any true \"next gen\" games (ahem, Starfield...), the games I do play were met with improved fidelity and 60 fps. That alone was a game changer for Fallout 76... and the 1-2 second load times... I can no longer set my fast travel, go grab a beer, a snack, pet the dog, and come back and grab the controller. I literally stood up from the couch the first time and I was at my destination... took some getting used to, but in a totally good way.Now that I've got a XSX, I'm waiting on Starfield. I don't expect instant load times\/fast travels, or steady 60 fps, but I do expect a fantastic experience from this console and games. Even though Playstation came before Xbox, the Xbox controllers just feel 'right' in my hands. The Xbox Live\/Service is faster and more stable in my experience than Playstations (Sony has made huge strides, don't get me wrong). While Xbox doesn't quite have the exclusives some of the competition does, their platform for me has always worked better for me and my needs. So that's where I play mostly. And before you start thinking we got an Xbox fanboy here... again, I've owned every Xbox generation to date, every Playstation generation to date, PC, Android, and Steam Deck. The only platform I've not used in recent generations is Nintendo (last I owned was the NES)... they're just not for me.If you are on the fence about the Series... get off and pick one! But if you do pick the Series X and it's out of stock, be aware of the waiting through Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"69 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"An idiot’s review","reviewDescription":"Got it for Starfield, despite owning a PC more than capable of playing it (the launch version, anyway; not sure about the remasters that will come out later), because I am stupid.  Also because I use my PC for work, got excited for Starfield (because I am an idiot), and wanted to play on my TV, where I play my PS5 mostly.  I always wanted to be one of those snobby ones who owned both, and now that I do, well, now I am.It was nice to see my windows games like microsoft flight sim (which i bought on PC) work for free.And the limited selection of “classic” games like GTA IV, Rainbow Six Vegas, Bully Scholarship Edition, Saints Row 2, Crackdown 2, and some others i already forgot about, even if I require an internet connection to play them (hold on, I think I am drooling again) make me feel like a nostalgic moron.I even bought xbox live for microsoft flight simulator, then forgot it was on for the last two months while I switched back to PlayStation to try raising my IQ.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"worth it","reviewDescription":"i love that this product is as was described i had been waiting for this product to drop in a price a little so it wouldnt be to expensive to buy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Came quickly and great price.","reviewDescription":"Bought this on a promotion. If your looking for the series x it's the way to go.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Good Xbox","reviewDescription":"Too Xbox, make good power and good gaming experienceI hate siege though, it like not even a fun game, it’s just an addiction at this point, I can’t stop playing it even though it makes me wanna make a cartoon shaped hole in my wall by running though it, the game makes me hate everything and it just makes me see colors not even imaginable to man, that game is easily explained not as a fun game, but as an addiction and I hate it so much. I would say just delete siege, but it’s not that easy because there is just that urge to push higher in rank, but when your teammates blow and you go 15 and 5 just to loose, it’s like “why do I even try anymore, I’m just gonna delete the game” but then guess what, you back at it again tomorrow because you played it once and Tom Clancy grabbed ahold of you and is practically forcing you to play, it’s mind games that this game has and it just never stops. Easily one of the worst games in history, but you just can’t stop playing it.Anyways, get the Xbox, it is 100% worth it, but NEVER get Tom Clancys Rainbow Six Siege because it’s is a terribly addicting game and it will make you either tear all your hair out or punch a hole in your monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1710547200000}
{"reviewTitle":"it works","reviewDescription":"it works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Xbox works","reviewDescription":"The xbox seems fine and running smoothly my only complaint is that I was sent a very dirty controller..","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Fast load times","reviewDescription":"It runs hot so you will need to buy a cooling fan. The controller is junk. I got about 3 months of play out of it before the left stick drift got to the point that it is unusable. So I need to buy a new controller 4 times a year?! I expect better.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1675814400000}
{"reviewTitle":"Broken","reviewDescription":"I received the console with no visible defects or any real indication that it's vene been used minus the batteries that come with the controller we're missing one but that's not the important issue.. the disk drive is completely broken and when there is a disk inserted it doesn't read and when the eject button is hit it sounds like crackling plastic gears and makes a horrible popping\/ grinding noise..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676332800000}
{"reviewTitle":"No Exclusives, mediocre 4k experience","reviewDescription":"I have the PS5 as well and both consoles are terrible at 4k gaming, but I would still rate the PS5 higher than the Series X because there are barely and exclusive title that have released to take advantage of the improved hardware… This pains me because I was basically raised on the OG Xbox and Xbox 360 and genuinely love the exclusives of the past.Here’s to hoping that Microsoft puts all those new IPs they bought to good use in the near future!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1650067200000}
{"reviewTitle":"Confused","reviewDescription":"I purchased the Xbox very excited and I had received it and the console looked brand new I was disappointed when I had received a very used controller with dirt still in the crevices and the power cord sent with it did not work I had to use the cord out of my series s XD most confusing purchase I ever made","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1659744000000}
{"reviewTitle":"Was great until it wasn't. Purchased Sept. 9.2022, died Sept. 29,2023.","reviewDescription":"Suggest getting the protection plan with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Very hard to get one","reviewDescription":"Although I received this one, a lot of other people are having trouble getting one. One of those people being multiple people in my family. I’m sure they have a ton stocked up at the factory for the holidays. This breaks my heart that I can not get one for any family members. Other than that this console is amazing. Microsoft does not fail to exceed their expectations every new console release. If you think you could keep your Xbox one because this is not worth it you’re wrong. This price point is perfect for the ingenuity you receive in this product!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Cool, 3 stars because recieved a refurbished one.","reviewDescription":"Recieved a refurbished xbox x seems that the packaging was taped with some regular 3m tape and the batteries were just thrown in the box, overall performance is OK but gave it a 3 star because it was used not new, as advertised.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Amazon sent me a used Xbox...","reviewDescription":"Product works just fine with no damage other than the box itself, which wasn't in an Amazon box. When I plugged it in, it didn't need setting up and already had an account, not mine, on it. I suggest you skip Amazon and buy somewhere in store. Not like I can return this one when there isn't a supply yo replace it with.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1648857600000}
{"reviewTitle":"Box arrived damaged","reviewDescription":"Happy that I was finally able to get the series x.  However the box was all banged up and there were shipping stickers all over it.  I like to keep my boxes for moving or storage.  It works fine just not happy with the state in which the box arrived..","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1660608000000}
{"reviewTitle":"Big Disappointment","reviewDescription":"Was very excited to finally be getting a Series X. Did not notice anything to begin with. The when I began to play a game for the first time it almost immediately shutdown, claiming it was due to poor ventilation. Upon closer inspection the top fan does not spin at all. Very disappointed. This seller has a lot of positive reviews and that was the only reason I bought \"Used-Like New\". Very conflicted if I want to try again or not.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"Very disappointed. Major issues causing some games to be unplayable. Stutters and shuts down","reviewDescription":"Have had major problems with this console. The disc drive doesn’t read discs after u turn the console off unless u eject and reinsert. Games like COD MW and Cold War lag incredibly bad to the point it’s unplayable due to the stuttering, yet when I try my Xbox one on the same tittles there is no lag at all. Lastly, my Xbox series x shuts completely down randomly in the middle of games - it’s done it 5 times sometimes back to back.Would not recommend buying until they patch all these problems (hopefully they can be patched","isVerified":true,"ratingScore":1,"reviewReaction":"44 people found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"12 month installment option doesn’t work","reviewDescription":"When ordering with 12 month equal pay option, it charged me full amount. When i called Amazon, i was told that i ordered it wrong. I am not sure what that means because in my order detail screen, it clearly says i ordered with 12 month equal pay option. To add salt to the injury, no 5% reward for using Amazon Prime visa card. Fix this Amazon instead of telling your customers that they ordered it wrong.The product itself is fine. Really underestimated how hot it gets.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1650067200000}
{"reviewTitle":"Product was advertised as new, it was not.","reviewDescription":"After waiting in the pool of being able to purchase the Xbox, I finally got the notification and immediately purchased the item.  The item arrived with the Xbox box crudely taped, one side was open, and the item was clearly used, returned, defective or refurbished.  I was not willing to find out and returned it the next day.  Please do not advertise an item as new if it is not.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"DOA, terrible customer service. I should have bought a PS5","reviewDescription":"When I got it games would shut off either immediately or within the hour. I don't know what was wrong, I think it had a faulty power supply. I sent it back; took more than two weeks to get it back with expedited service that I paid an extra $10 for. I received the HDMI and AC power cord a week later in a different box, and I've yet to get the controller back; it's been 4 weeks.I could have purchased a PS5 and I wouldn't have had any of these problems. Stupid mistake.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1607385600000}
{"reviewTitle":"Most expensive brick","reviewDescription":"I got my Xbox series x and it never turned on. I was unable to exchange it on Amazon because they did not have any Instock. I sent it to Microsoft to get the faulty power supply fixed and it will take over a month because of covid. On top of that I had to pay 10$ For shipping. Also a warning for those buying on Amazon, the one year limited warranty on my system was activated in January even though I bought it in February. I would love to give it a better review but all I got was a massive brick.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1614211200000}
{"reviewTitle":"Lied to and lost money","reviewDescription":"The item was listed as new, when it was delivered it was wrapped as a gift. When opened I realized it was not new, but used. This was out of the 30 day replacement period so now I have to pay a $60 restocking fee because I was screwed. Never again.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Flight Sim? STAY AWAY!","reviewDescription":"MS Flight Simulator on Xbox is way too buggy! I have to reset the console frequently. It hangs and glitches every week.If I had known, I would have used the PC version, but I have invested too much in Xbox peripherals.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Dead after 6 hours of use","reviewDescription":"Was working fine on the 1st day I got it. Used it for about 6 hours and I’ll say this console is a beast. Woke up the next day the console wouldn’t turn on at all tried all the troubleshooting steps and nothing. Decided to return it for my money back. Will wait until all the bugs are fixed with future series x consoles.","isVerified":true,"ratingScore":1,"reviewReaction":"59 people found this helpful","country":"United States","date":1605744000000}
{"reviewTitle":"Boat Anchor","reviewDescription":"So, I got this last night.  Managed to get it setup and even got Game Pass Ultimate.  Upon downloading the first game its freezes the download and says my hard drive may be corrupt.  I then factory reset it and re-setup eveything again.  I finally get the game loaded and begin playing and it suddenly shuts off in the middle of gameplay and I cannot get it to boot now.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1661990400000}
{"reviewTitle":"Best console out there.","reviewDescription":"Well worth the money if you (don't want to or can't) afford to buy a pc.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"It's the fastest Xbox on the market","reviewDescription":"I can't complain. It runs Avatar: Frontiers of Pandora, EA CFB 25, and Warzone just fine. That's all I need it for.FYI in EA CFB 25 unranked WSU just beat #4 Oregon on a back corner touchdown pass with 7 seconds left during week one of my dynasty. Next game I walk into #7 Penn State for a night game. John Mateer for the Heisman.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Next-Gen Done and Begun Right","reviewDescription":"Back in 2013, both Microsoft and Sony launched the Xbox One and PlayStation 4 (respectively). Compared to the generation prior (Xbox 360 and PS3) and how those compared to current PC's of the day, the seventh console generation did not start well. From false promises from Mark Cerny about the PS4 hitting 1080p and 60FPS for every game, to Microsoft's loss of focus on gaming... couple that with the less than impressive comparison to PC's, and you would find the apology for sale a few years later with the PS4 Pro and Xbox One X. Those were what we should have gotten to kick of a generation.Now here we are in 2020. The only downside has been acquiring one of the consoles and the lack of supply due to COVID-19. The Xbox Series X (seriously, Microsoft needs to do something about the naming) is a great offering with great value tucked away inside of the Xbox service.Without getting deep into the technical specs, I will highlight some key differences between the Series X and the One X. The SSD is first. Fast load times across the board for games and the system itself. The 1TB is not what you get in full, but it is not an issue if you keep a small catalogue of installed games. Currently with 6 games installed (AC: Valhalla, Destiny 2 ((all expansions)), GTA V, Red Dead Redemption 2 and Watch Dogs Legion), i am sitting at 357.5GB of free space. The frame rates are great with the ability to keep a steady 60FPS and achieve up to 120FPS. 4K is glorious with HDR. The Ray Tracing that some games have is a really nice touch, but unless you stop to smell the roses (or in this case the, wander up and stare at them), it doesn't jump out at you.Otherwise the console is impressive. Not a single sound has come from the machine in my few hours (extended this evening) of play time. The start up speed is incredibly fast and this is both from a fresh boot, to the low-power mode, to the unplugging method. Quick Resume is something to appreciate as well. Being able to have a handful of games running at once is a nice feature especially if you are one who has game ADD, or want to hop back into a single-player game after having a multiplayer session with friends.The new controller is built on the old saying, \"If it ain't broke, don't fix it.\" While Sony went with a new design and functionality for the PS5 with the DuelSense controller (seriously the haptic feedback is a cool addition, but I have a weird feeling it will fade out at some point), I can't help but feel Microsoft kinda missed a chance with the Series X controller, by not adding a similar feature. However, the controller feels lighter than the last, that could be due to the fact I am using batteries instead of a play and charge kit. It feels also, slightly slimmer all around, but the shape is still ergonomically pleasing for any hand to hold. I don't mind the absence of an internal battery pack. I find that the play and charge is a nice option, and that with batteries you never have to worry about being plugged in. The jump to USB type C is nice as well, as most of the devices I own use that port exclusively. Added on to the controller's body is a texture around the back of the hand grips and the tops of the triggers. My grip feels more stable and connected. Also, the addition of a share button is nice for two reasons. First it is a great way to capture what you want without sacrificing gameplay or being vulnerable in a multiplayer title. And 2, it allows for screenshots to now be captured that when being taken by hitting the Guide button, would sometimes cause elements to disappear.As for the value tucked away that I mentioned, that comes thanks to Game Pass. A service I was not fully sold on when it was announced, but as time went on, I became interested and am now a member. And now with them (Microsoft) partnering with EA to bring EA Access to game pass, it makes me wonder what the future holds.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1606521600000}
{"reviewTitle":"Own all systems now","reviewDescription":"Ah great to own all systems til more come at least great timing on the delivery","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Dope","reviewDescription":"100","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Exelente","reviewDescription":"Muy recomendable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Top of the line","reviewDescription":"I love modern consoles and this one is no slouch when it comes to playing modern games.The only area I wish they would improve is the way you add extra storage space. I am not a fan of the slot and would rather see an M.2 like on the PS5.Graphics are great and the controller is a nice feel.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Xbox","reviewDescription":"I love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Awsome","reviewDescription":"Much faster than my x box one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Awesome","reviewDescription":"Thanks to this beautiful piece of equipment I’m able to play Microsoft flight simulator.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Please Check Your SN Before Using","reviewDescription":"I ordered a used (very good condition) Series X and it worked well until a couple months after using it. Any game I would try to play, the console will shut off after 5 minutes. It wasn't a ventilation or power cord issue. I performed a factory reset on the console and the issue remained. I called a couple places to see if they could repair it since I don't have a warranty, and the places I called said that they couldn't repair it due to Microsoft having a 'special key' for that issue, but to them it sounds like an SD issue. I took it to Game Stop to see if I could trade it in with the original box that it came in, and the employees pointed out that the SN on the console is different than the SN on the box it came in. Please don't make the same mistake I did, and if you already ordered, check the Console SN and the SN on the box and return it immediately if you can. I'm currently waiting for Microsoft to see what they do for mine.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Xbox doesn't turn on after less than a week of use","reviewDescription":"The Xbox seemed like a nice upgrade while it worked for less than a week of total use.  Then the Xbox X and\/or its power supply died.  It just turned off and won't turn back on after many resets and etc.  That is terrible product life and I probably should have done PS5 instead.  We are now in product support mode and all my kids are very unhappy which makes me very unhappy.  Microsoft, I really expected better from a product that should have been through many cycles of product improvement by now.  We will likely return thanks to Amazon's policies although we are maybe just lucky it died quickly.  Ugh.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Beware!!!! you need the internet to play your games","reviewDescription":"UPDATE 2: Alright so I found a way around having the internet to play the games. However, when you buy a disc for the first time and pop it in, you have to be online to register the game license. Then and only then can you play it offline.Listen, this is a great system. This console IMO is made for online gaming as Xbox Gamepass gives you the best bang for your buck. The Home Screen when you turn this console on is all about online playing, discounts for pass, etc....For an old gamer like myself, this is not for me. For the new generation, I will concede this is a must have. I will return to my PS3-PS4. When I am done, I will probably gravitate towards PC.Thankfully, Amazon allows me to return this. Happy gaming to everyone, and if you are not an old fart like me, you can disregard this review.UPDATE 1: I received my Xbox series X last 1 week, played for two days (made the jump from Playstation).Beware, if you purchased any digital copy games or have a disc games, you HAVE TO HAVE INTERNET CONNECTION in order to play the games offline.This system is unplayable without internet.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1658880000000}
{"reviewTitle":"Problems started after my return window closed.","reviewDescription":"Worked okay for the first month. Problems started after my return window closed. First it would freeze up and need to be restarted. Then it would lag out during game play. There have been times the sound would stop working when watching shows. And now the graphics are completely messed up on it. I've attached a photo for reference. The words on the home screen have turned pixelated and boxy looking. Shows and games are red or dark now. (See photos)This is ridiculous for the price we paid. I have no clue what we're supposed to do now besides be out all of this money for this piece of crap. My husband's has tried to troubleshoot with Xbox and has received no help. I have no one through here to reach out to since our return window is closed. This is a stressful headache and it's sad because we don't have money to throw around on electronics. We saved a long while to make this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1681603200000}
{"reviewTitle":"Typical Microsoft Product...","reviewDescription":"As always, the setup is made ridiculously difficult. For exemple, if you enter the wrong password, the system freezes. No explanation.I downloaded MS Flight Simulator which is supposed to be 100% compatible and useable with the provided controller.Nope... Didn't work. I was unable to operate anything at all.Return to sender... another bad Microsoft experience...Oh, incidentally, you are required to enter your password every time you use the system. Seriously ?","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"DO NOT BUY USED","reviewDescription":"The console constantly crashes no matter what game your playing, I’ve reseted it countless times to the same issue and all Microsoft support tells me is to do the exact same thing to reset to defrag files. I’ve done this who knows how many times and the problem persist I do not recommend buying this console used and I spend over 500 just before they dropped 100 dollars off the tag. To be honest just buy a PlayStation 5 because game pass is not what it’s advertised either.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Xbox hasn’t worked correctly since the day I bought it","reviewDescription":"This Xbox constantly shuts off randomly. I can only play 25% of games because this Xbox can not run the other 75% of games. I even bought an extra cooling fan and it barely helps. Would not recommend buying from here","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721433600000}
{"reviewTitle":"Just Junk","reviewDescription":"This thing is total junk.Missing the usb cable so there is no way to charge the controller. Can't do anything with a controller that has no power.The game that comes with the system, where you just repeatedly tell it to try the wired Ethernet connection again and again is just dumb and boring. After two hours of playing that, it was ready to ask for my email address, but then told me that I am already using my email address so I must make a new one. Then it tells me that it will sell all of my information to everyone. Two days in and it tells me that it wants me to pick a color that will make this unique and mine, but then limits me to only a few colors. Then, no mater what color I pick, the thing just stays the same black cheap plastic color. it's going in the fire.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1668124800000}
{"reviewTitle":"CAME WITH AN EXPIRED WARRANTY","reviewDescription":"None of the games I've downloaded off of Gamepass have worked and it's been incredibly difficult trying to get it replaced through both Amazon and Microsoft. I purchased this new on October 17th, received it on October 24th and my warranty shows it expired May 9th and absolutely nobody I've spoken to through Microsoft support (who I was sent to by Amazon support) have been helpful. I just want it replaced with one that works. I feel more burned by this purchase than any other I've ever made.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Never again","reviewDescription":"I should have known when I opened the box that this was going to be defective. Shipping box was fine so this did not happen in transit. The xbox x box was trashed and I wondered if it was used but the listing was for new so I set it up anyway. I had to waitlist for it and I just wanted to play my games! Well, for two weeks I did. But then it stopped recognizing my controllers (both the one it came with and another I had bought from Best Buy) and then it stopped turning on at all. This is the last time I will ever purchase electronics from Amazon unless it’s something they make like kindle. Otherwise steer clear. The stuff they sell is damaged, defective and most likely already used.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"A+ box presentation!","reviewDescription":"So, yeah, new generation of hardware from Microsoft but can I talk about that box?  Because that was a spectacular way to jump into the next Xbox.You open the box up and there is the Series X all wrapped up like it's in a treasure chest.  It was great!  I actually had to take some video of it because it was above and beyond what I expected from unboxing a new console.  So good job on that!I'm upgrading from an Xbox One S and from that perspective, it was definitely time to upgrade.  I've got this 4K TV without a system that properly utilizes it!  I held off on getting a One X because I knew the next Xbox system would be coming out soon enough.And here it is.Visually speaking, I'm not really noticing TOO much difference from games on the One S.  There are some added details on some of my old games to upgrade them to 4K and I notice some effects that weren't there before.  Everything is less fuzzy.  So that's good.  It's just not the same as the visual jump from the NES to the SNES.  Or the Playstation to the Playstation 2.  But it IS close to the leap from the Xbox 360 to the Xbox One.  The difference there was only noticeable a few years after the fact for me.  I imagine the same will be true here, especially since most of the games I'm playing right not are Xbox One games upgraded to 4K and not native Series X games, beyond Yakuza: Like a Dragon.And that details the biggest drawback to getting a Series X at launch: lack of a strong exclusive library of games.  While the Playstation 5 has Spider-Man: Miles Morales, Godfall, and Sackboy, there isn't anything on the Xbox that can't be played on the PS5 except Yakuza: Like a Dragon (and that can probably be played as a PlayStation 4 game through backwards compatibility).  With Halo Infinite being delayed, there's no massive reason to upgrade your hardware.Well... I SAY that but I also don't regret doing so.  I'm disappointed in the lack of exclusives but the 4K is still very nice.  And it isn't even the best part of the Series X.  That would be the load times.  With the new hardware and the new memory storage system, games load incredibly fast.  I used to start a game up and then head into the kitchen to grab a drink or whatever while the console booted things up but those days are done.  This thing zips along.  That also applies while you're in the game.  Reloads and fast travels, even cut-scenes, happen swiftly.  There's a lot of power in this rectangular box.  The Playstation 5 also has super fast load times so it's not a selling feature if you're comparing consoles but, on its own, it presents a compelling case.It's a lot of the \"under-the-hood\" features that build this system up as a good replacement for your Xbox One.  The fact that it is capable of playing a large number of Xbox's back catalog going all the way back to the original Xbox means you'll have a huge library of games to play even if they aren't brand new exclusives.  I've got a serious backlog of titles so playing them in 4K and getting into my games faster is fine for me right now.  If you are a Gamepass subscriber, you have a large library of games to choose from right out of the gate, including a lot of EA games added from their EA Play subscription service.  I spent my first day just downloading everything I'm going to be wasting my time on over the next few months.And, let me be clear: if you play on Xbox, do yourself a favor and subscribe to Gamepass.  You get some great games and many of them are upgraded to take advantage of the Series X.  It's a good deal.I'm happy with my purchase.  I wish Halo would have made launch.  I'm also happy they held it back so that when it releases, it's worth playing.  But, man, launch would have made this purchase a lot more palatable.  In the end, it comes down to where your friends are.  Mine are on Xbox so here I am.  This thing is a powerhouse and I doubt I'm going to regret having it a year or so down the line.But if you have to make a choice between this and the Playstation 5 and you don't really do online gaming with your friends, the Playstation 5 makes a more compelling case this holiday season.  Miles Morales looks really good.But if Sony's exclusives don't move you, the third party games are all multiplatform.  You can enjoy your Call of Dutys and your Assassin's Creeds on whatever console you manage to get.  In 2020, I think we could all use a win and I think there's enough to keep you busy on both consoles to check that win box.Oh! This thing also has a controller!  It is pretty much exactly like the Xbox One controller which was a slight upgrade from the 360 controller... which was an upgrade from the Xbox S controller.  This is my favorite controller layout and it feels as comfortable in my hands as the XB1 version.  There's a capture button now to take pictures and video which is something Sony added with the PlayStation 4 and Nintendo added on the Switch.  So Microsoft is a little behind but it's here now!  I have not used it yet but I'm sure I'll get around to it.Anyway, welcome to the next generation of video game hardware.  This thing is a beast of tech and should prove a worthwhile purchase. In time.  Day one, you know what you're getting: an I.O.U. note promising better things to come.But, man, that treasure box opening is pretty great. ;)","isVerified":true,"ratingScore":4,"reviewReaction":"132 people found this helpful","country":"United States","date":1605225600000}
{"reviewTitle":"Next-Level Gaming Experience with Xbox Series X!","reviewDescription":"The Xbox Series X is an absolute game-changer! As a devoted gamer, I can confidently say that this console has exceeded all my expectations. Here's why it's my new favorite gaming device:Firstly, the performance is outstanding. With up to 120 frames per second, the gameplay is incredibly smooth and immersive. Whether I'm racing through the streets of Forza Horizon 5 or battling enemies in Halo Infinite, every movement feels fluid and responsive.The 1TB SSD storage ensures I have plenty of space for all my games, and the Velocity Architecture makes loading times practically non-existent. I no longer have to endure lengthy wait times to jump into my favorite titles—it's all about instant gratification with the Xbox Series X.The true 4K gaming experience is jaw-dropping. The graphics are stunningly detailed, with vibrant colors and lifelike textures that bring games to life like never before. From the breathtaking landscapes of Skyrim to the bustling streets of Cyberpunk 2077, every visual is a feast for the eyes.The included wireless controller is a joy to use. It's comfortable to hold, with responsive buttons and precise analog sticks that enhance gameplay. Plus, the built-in Share button makes it easy to capture and share epic gaming moments with friends and followers.The 16GB of RAM ensures seamless multitasking, allowing me to switch between games, apps, and streaming services without any lag or slowdown. It's the perfect balance of power and efficiency, making the Xbox Series X a true powerhouse of a console.Overall, if you're looking for the ultimate gaming experience, look no further than the Xbox Series X. With its unparalleled performance, stunning graphics, and innovative features, it's the perfect choice for gamers who demand the best.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"An upgrade in almost every category","reviewDescription":"I am not much of a console guy, preferring PCs. I bought an Xbox 360 several years ago for my wife as she had had a plain Xbox that she used before.I found consoles at least the way I prefer them allowed group play and comradery. They could bring a family together. All of the console games I have bought therefore allow for group play.I love this new console, I do not upgrade with every iteration and I felt it was time to do so. I wanted a console with a physical disc slot that allowed most of the previous games to work. I am a bit disappointed at some that unfortunately do not work. I honestly feel that even if they are newer versions you should get a significant discount if\/when you purchase the newer version.The Xbox series X is fast, it took ages for the 360 to load, this one does it very quickly and keeps your last save so you can jump right back in without a lengthy load screen.I do not mind the blocky appearance. I have had no real issues with overheating but I have not really played any cutting edge titles on it for long periods.I miss the Kinect though, my 360 still works and I will be keeping it to play (my wife and my daughter) some of the titles that didn't port over and the adventures that were very family friendly.Overall I am very satisfied with my purchase. I know most persons would have had a Xbox series X for a while. My only regret is no Kinect like service.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Excellent performance but the price doesn't hold up as well in 2024","reviewDescription":"The Xbox Series X has certainly made its mark as a powerhouse in the gaming world. With its impressive specs, it delivers a great experience that’s smooth, fast, and visually pleasing. The quick resume feature is a game-changer, allowing you to switch between games almost instantly, and the load times are so short they’re barely noticeable.However, it’s worth mentioning that the price tag, which seemed reasonable at launch given the technology packed inside, doesn’t have the same ‘wow’ factor a few years down the line. As tech advanced, what once felt like a steal now seems like standard pricing for a console. At this point, there are even some budget PCs which can perform similarly to this for about the same price.Despite this, the Xbox Series X remains a top-tier choice for gamers looking for quality, performance and a robust library of games, especially if you’re invested in the Xbox ecosystem. It’s a solid investment for serious gamers, and with Game Pass, the value does get a little better. Overall, it’s a console that still deserves a thumbs up, even if the price now feels more expected than extraordinary.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"1st & 2nd impressions","reviewDescription":"Delivery was fast, 2 days. Box was well packaged, sealed Xbox x.Set up was simple, even for me. You just use your phone to set it up. I had a quick issue where the code that was sent wasn’t working, so wasn’t sure if it was the code, or something incorrect with my email\/password. At that point, the Xbox wouldn’t let me power off using the controller, so I manually turned it off, waited a couple minutes, started again, restarted the “new console” set up, new code that worked, and before I knew it, I was at the Home Screen.No noticeable cosmetic or technical issues. This is definitely a nice upgrade from Xbox one.Love premium game pass, and the user interface is similar to Xbox one. Controller provided takes double A’s, so will buy another one with a bit more quality without dealing with batteries.I used the disc drive, it works which is great, my old Xbox one blue Ray drive stopped working a couple years ago.I will give an update after more use and game play, but initially, very happy to have this. I’ve held out a long time for one of these! Worth the wait!UPDATE: Xbox X is great. Blu-ray drive works, love the quick resume option for games. Format is familiar like Xbox One, so not a lot of changes on the Home Screen and such. No issues playing games, watching movies, etc. very much like having this. Fun for everyone! Graphic updates are nice, however, if your using an older TV you prob won’t see too much difference. Highly recommend if your still on the fence about purchasing.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"The caveats aren't that big of a deal--it's a solid console","reviewDescription":"I bought this knowing I wouldn't be doing much with Xbox this generation, but I wanted to check out what they had on the menu. My complaints are few and minor.A lot of people call it ugly, but I think uninspired is a better word. It's like when the stylish cars they made through the 70s gave way to the boxiness of the 80s and transitioned into the scientific designs of the 90s and beyond. There's no style here, but it's well designed for distribution of cooling to the components. I can't be too upset at that, and honestly, little time passed before its appearance was forgettable. For my tastes, Xbox designs have always trended gaudy, so this was a step in the right direction.I like the texture on the new controller. It feels good in my hand just holding it, but also during the action.Connectivity is fantastic. I'm impatient, but the download\/installation of games and patches never leaves me fuming.It's a fast console. It suffers when running games that have no business being played anywhere but on PC, but that's to be expected, and it's nice to have the option if you don't have a PC. I was fairly impressed with the way the controller handled some PC games, offering a decent substitute to mouse and hotkeys.Graphics are pretty for sure. They look great on my 4K TV.I'm not crazy about how they handled extended storage this time around, but I haven't dabbled in it either, so that's more of a philosophical complaint at this point, rather than practical.I guess the biggest gripe would be that you need to partner with Microsoft if you choose this over the PS5 or Switch, and I don't like the way they do business, particularly their choices regarding console gaming.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Mostly great. Mostly.","reviewDescription":"Our old Xbox One was dying a few months back, so we bit the bullet and upgraded to this. We both play, so we also got an extra controller (the console comes with one). I took the extra one, and my husband took the one that came with the console. In case you're curious, my old controller's buttons were starting to give out as well right around the time the console was dying, and my husband wanted a backup controller, hence the need for two new controllers instead of just one. Anyway...I was using the \"extra\" one because it's purple (yay!). It works fabulously. The console itself is amazing because all the games we have played load ridiculously fast, and the graphics are amazing. Then the not great part: my husband's old controller (which we *just* bought last Christmas) died one week after getting the new console up and running. No biggie, we have the new controller to use, right? So he grabbed the one that came with the console and started using it. That was just a few months ago. The stick drift started a few weeks ago, and it got really bad really fast. That controller is straight up unusable now. Thank god for the black friday sales coming up this month. Given how new the console and controller are, I thought someone would help us, but no. Neither Amazon nor Microsoft\/Xbox care one bit. I guess less than 6 months is now the expected lifespan of a new controller? At least the console is nice.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1699833600000}
{"reviewTitle":"Not what I was thinking","reviewDescription":"Nothing wrong with product but the last system I bought was a ps2 so when this came out I was thinking why not had a lot of everything I was looking for plus get to play a lot of the older games as well even the ones I thought never get a chance to play. So yes very stoked about it. Then I find out it’s more of a pc then a game council so waiting for download and trying to play on line not so great with out downloading but blame the lies from my provider for thatAny way good graphics and pretty smooth. Do miss corded remotes but do enjoy this one just wish it come with rechargeable batteries and station also wish it would of come with Ethernet cable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Misleading information","reviewDescription":"Well I think this Xbox is really good game system among all the rest the only thing I don't like about it is the fact that I was told this game system would play all the games you go and stick a game in it and it won't play it I've got 31 games and it will not play none of them and I'm only able to play like 5 or 10 of my games that I've got unless I pay $19 to activate this develop mode and you got to established in an account and get a code and go from there and you got to pay $19 I think it's crap it's misleading information to people telling people that it'll play all the games all the way from the original all the way up but when you get it it won't do it unless you pay $19 that's what you call false information I think Xbox and Hoover selling these should be telling the people that is going to cost you $19 before they go buying this game system that cost between 4 to $800 which is outrageous when it comes to buying a game system other than that I think it's a great game system it's nice and I really love it but not happy with the fact that you got to pay $19 just to be able to play these games","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Overall good console","reviewDescription":"First Xbox console I've purchased.  Have all PS generation consoles.  Bought the Xbox to play Starfield since graphics cards are outrageously priced.  Don't feel like building a new PC.  Starfield runs overall well with some stuttering in graphic intensive areas.  Compared to PS5, the Xbox Series X is good but I have experienced several bugs.  Bugs include: static noise from menu sounds (ended up disabling the menu and notification sounds); HDMI signal was lost when starting a game leaving the TV with a black screen, had to unplug HDMI cable and plug back in to get a signal; Resolution defaulted to lowest resolution upon startup, had to reboot.  The Xbox is more like a PC in terms of dependability.  Reboots seem to be the fix.  PS5 is more polished and just works.  Also, Xbox Series X does not support WPA3 Wifi security (Wifi 6), has to be in WPA2\/WPA3 mode on Wifi router to use 5G.  Have to download an app for Dolby Atmos to work.  Need to set color depth to 10bit in settings to get full 4:4:4 chroma.  Seems like a lot of fiddling around to get things to work at best quality, which some people might not know how to do.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Works amazing!","reviewDescription":"It’s great if you don’t wanna wait till they come back in stock. A bit pricey, but this is actually the cheapest and most reliable seller to get a Series X from right now. I love my Series X and to me it was worth the money 100%.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629936000000}
{"reviewTitle":"Flawless transaction","reviewDescription":"Ordered, shipped, plug in, play. Arrived when it should & works perfect. No issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662163200000}
{"reviewTitle":"Could be a five but","reviewDescription":"Pairing wireless headphones are a pain, but otherwise it's great, and this is coming from a playstation girl","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1650412800000}
{"reviewTitle":"Be careful","reviewDescription":"The series x is a super fast machine however the thing didn’t power up two weeks after I got and had to send it in and be careful because Microsoft only gives a 30-45 day warranty on a 500$ item which is garbage that is why it doesn’t get 5 stars","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1619827200000}
{"reviewTitle":"Not enough release titles","reviewDescription":"I would honestly wait a little before rushing to get one. There aren't enough release titles, and isn't really worth the upgrade just yet since you'll be stuck playing last gen games on it for a while. If you had a choice, I'd go with a PS5 with the better controllers anyhow.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1617494400000}
{"reviewTitle":"Amazing","reviewDescription":"Absolutely amazing but a bit overpriced, but that's what you get when you have to get it early like I did. I got it earlier than most. There are some who might even still be waiting. I also got it a week before they said it would be delivered that's Amazon.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616803200000}
{"reviewTitle":"Muy buena pero...","reviewDescription":"Gráficos, velocidad muy buenos.No se que pasa pero los videojuegos en español de repente se pasan a ingles.Gears Of War 5 en ocasiones el sonido de entrecortaba. Solo se soluciona reiniciando la consola.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628899200000}
{"reviewTitle":"Some great next gen features","reviewDescription":"I pre-ordered the series x and it was delivered to me a few days after release. The delivery itself was good. No damage to box. Xbox is a great machine with specs that won't be truly harnessed for at least a year. So no hurry on this generation as it's mostly convenience upgrades.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1611705600000}
{"reviewTitle":"Great upgrade from one x","reviewDescription":"The speed from one x to series x is at least double. Load times are halved at worst for most games. The price may not be worth it unless you want faster load times and true 4k gaming.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1625788800000}
{"reviewTitle":"Very good, one problem.","reviewDescription":"Works very good, over priced but worth it. Only issue I have with it is that it gets hot very fast. I put a fan right next to it so it’s not as bad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"New look, New hardware, same old feel","reviewDescription":"I must say I'm always questioning my purchase of this console. The hardware is different but the software and UI make me feel like I got a reskinned Xbox One. Performance... well, I can't really see much difference. It seems perhaps mere seconds faster than the last generation. I'm still on 1080p at 60hz though so I guess I won't be seeing much graphical change. But all the hype about terraflops and this and that, I expected much much more as a casual gamer. For the most part I feel like I took my car to the detailer and drove away in a 'new car.'There's not many X\/S games out right now that scale up to what this device was built for either ... so I'd encourage people to save their money and wait until that time comes (but I totally get it, since the shortages).One major issue I'm already coming across is storage. Some of my favorite games are 100+GB (Ark was 151+Dlc)... so my 1TB (800GB drive) can't really store that much. And since your X\/S game has to be native to play ... I'm really concerned....especially seeing how MS wants to charge half a console for its upgraded solution.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1674777600000}
{"reviewTitle":"👍","reviewDescription":"Great product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"7 hours of pure Joy.. Until it wasn't. c'est la vie","reviewDescription":"I will start by stating I know the risks of being one of the first to get new tech.  So take my review with a grain of salt.  If you are reading this 6 months from now you probably are fine.  I am giving 4 stars because I feel the early release pains are more on the company and not the product.My review is that the Xbox delivers on what it said it would.  It is crazy powerful and just runs games beautifully.... For the short amount of time it did that.  There I was, in the middle of a 10 kill Warzone Trios making sick comms, about to secure another W all while saying \"If they only knew it was on the new Xbox\" then all of a sudden... bewp... Series X Series-ly shut down out of no where.  Not just a casual bye, no, like an angry significant other coming in and saying \"You're still playing that game?!?\" and slamming the door in your face.  I tried a number of things to get the Xbox to come back to me.  I sang it a song, tucked it in, promised I would buy every Microsoft exclusive game.  But alas nothing worked.  I now have a very, plain looking, desk weight.  Now I get to go through the fun and lengthy warranty return process with good ol big brother Microsoft.  I will take solace in the few short hours I got to brag and make fun of the \"one'ers\" who couldn't get their hands on one, but will likely have a working console before I get my replacement.  C'EST LA VIE","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"Power cord plugs flimsy at the back of xbox","reviewDescription":"You don’t have a feeling that power cord is properly connected at the back of xbox","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"I bought this for Starfield","reviewDescription":"I’ve always been a PS owner.  I really wanted to play Starfield and it wasn’t available on PlayStation.  Long term I think it will be a good investment, considering Bethesda will not be returning to PS.Starfield is a huge, immersive and fun RPG.  If you liked Bethesda’s other games, there is a pretty good chance you will like this game.  It’s the only game I’ve played on Xbox, so I can’t comment on any other games.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Works good","reviewDescription":"It works good and it’s easy to sync","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"love!","reviewDescription":"everything is great! xbox box was a little bit damaged but not terrible. nothing seems to be an issue! now time to wrap it soon🤩","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"4k games","reviewDescription":"Fast loading but always have problems in Ubisoft or season pass? Always have error code","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Controller broke 1 month in","reviewDescription":"Controller already has problems with the trigger. The Xbox is great. Controller, not so great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Mando","reviewDescription":"Un consulta los mando de xbox serie x viene con batería !","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Missing items","reviewDescription":"There is no power cord or humi cord with the console","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Not really impressed.","reviewDescription":"Takes forever to download unless you have super fast internet.  Waited 2 days for a game to download then it stopped and did not save any of the download.  Returned gaming system.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679702400000}
{"reviewTitle":"Not worth it.","reviewDescription":"Tested and used fir a while now. I now get why the limited availability. This is to make it desirable while games are not that innovated.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1683158400000}
{"reviewTitle":"Xbox did not work properly","reviewDescription":"Once we powered up the Xbox and started up a game the Xbox and would shut off. We tried troubleshoot this problem, but nothing worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Xbox series X experience could’ve been better","reviewDescription":"I love the Xbox, it runs smooth and looks so amazing. But there are certain games that won’t work. It’ll load for 30 seconds but then force close the game. I’ve done everything I can but nothing has worked. Kinda upset Bc this is happened with 25% of the games I own.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629849600000}
{"reviewTitle":"Not complete and box was tore the \"f\" up.","reviewDescription":"I didn't receive a booklet with this and the packaging was tore to pieces. Seems to be working fine tho!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672185600000}
{"reviewTitle":"Not much to do","reviewDescription":"The menu on this new Xbox is atrocious and annoying to navigate. Take me back to when the Xbox 360 menu was out before it also got ruined. The controller is the same as always and there’s not many exclusive games out there. I would recommend waiting to buy this or get a ps5","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1609113600000}
{"reviewTitle":"Only do this if you're desperate","reviewDescription":"Its an Xbox series X, but at almost double the price. I was desperate because my xbox broke. I highly recommend going anywhere else and just ordering one at MSRP not this mark up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Controller broken","reviewDescription":"Controller came with a broken stick. Xbox is nice though","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678320000000}
{"reviewTitle":"From Xbox One to next gen?","reviewDescription":"Loads faster and looks a tiny bit better. Next Gen? Not at this point. My review remains the same almost 2 months later. You're buying an upgraded Xbox One! Thanks for the \"Next Generation Console\".","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1605571200000}
{"reviewTitle":"Definitely a Box","reviewDescription":"As a long time PlayStation customer, this is my first ever Xbox. I have to say that I am pleased with the shape of this console. It is as advertised—it is, indeed, a box with an X on it, although the X could be a little more prominent. It is difficult to see when the console is off, but luckily, the X lights up when the console is actually turned on. So it could be better, but this is acceptable.The Xbox also plays games. I don't really have much to add about that. It is a game console, it plays games. I do wish the Xbox had a better selection of games though. As is, I play my PS5 a lot more than the Xbox simply because it has more exclusive games. Here's hoping Starfield and Avowed will eventually make the Xbox more appealing, but as of now, Xbox doesn't have much going for it.Lastly, the console's UI is very cluttered and unappealing to me, especially compared to the PS5. However, unlike the PS5, the Xbox lets you group games and other apps into folders, allowing you some measure of organization. This cannot be done on the PS5 for some reason. Xbox also has themes, though there is a limited selection.So overall, the Xbox Series X is a fine console. I don't think it's going to make me want to switch over from PlayStation, especially with its lack of interesting exclusives (as of the writing of this review). But as far as consoles go, this one is okay. I like playing Alan Wake and Cyberpunk on it.","isVerified":true,"ratingScore":4,"reviewReaction":"22 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"So far, so good","reviewDescription":"I have always been a Xbox fan. I really like playing my X series. But I wouldn't recommend downloading games. With a 433 mbs internet speed and 100% signal, it took 49-50 hrs to dl Modern Warfare III. BS IMHO. But after I finished the dl, I love the game. Now, MWIII is over 200gb but still bs download speeds. I almost 100% believe Microsuck throttles the servers so more ppl can dl the game. I would recommend the Xbox, not the downloads.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Great but controller has issues.","reviewDescription":"Bought this about a month ago and the console itself is amazing!! The only issue I have with this product is the controller. It tends to slide while playing games and turn off randomly without giving a heads up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Packing could use work","reviewDescription":"Arrived in a timely fashion, no damage, works just fine so far. Only complaint is that it was shipped in a box with no packing material Just sliding around inside the box. The xbox itself was in its box of course which is well packaged by xbox but the shipping was just a box around the xbox. For the cost of a xbox I would have hoped it would have been packaged better.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Impressive","reviewDescription":"Bought this to use flight simulator...no latency, vivid colors...the ability to play older 360 games is a big plus...recommend highly","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"best one yet","reviewDescription":"really like x-box best one yet","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Disk","reviewDescription":"Disk drive are already broke","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Product works like new, no problems.","reviewDescription":"Very Happy with system. I didnt know it waa getting shipped not in its original box. Only a very small bend in one of the wrappings (paper) on the system. Other wise everything looked undisturbed from factory seal. Have played it about a half dozen times now, no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Upgrded to new one, great product, does get a little hot","reviewDescription":"Have been an Xbox user for many years.  Was time to get the new one and enjoy the upgraded visuals etc.  One issue, is in a cabinet with doors.  When playing, if door not open, does get warm in the space to the point the Xbox fan kicks on to cool it, a little loud.  Only issue.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Good condition","reviewDescription":"This xbox came in good condition and the graphics were great. We have been having issues where the controller disconnects every couple minutes which can get frustrating. We're not sure if it's the console or the remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Low quality controller...6months and drifting...","reviewDescription":"6months using the controller and already drifting...","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"Canada","date":1636675200000}
{"reviewTitle":"Its ok.","reviewDescription":"Lack of game option right now. The control is kinda basic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1608595200000}
{"reviewTitle":"Bon achat","reviewDescription":"La livraison était impeccable, mais mon produit bug...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Canada","date":1607126400000}
{"reviewTitle":"Excellent Console","reviewDescription":"I liked everything about the Xbox Series X except for 2 small things. The User Interface requires getting used to because it is unlike the previous versions of the console, and also the device has no inherent Bluetooth capability, meaning you will need an adapter to be able to connect your favorite headset if it is not specifically designed for the Xbox. In my case I wanted to connect my Sony WH-1000XM3 headset and couldn’t because Bluetooth is not on this console. Surprisingly my PS4 has this feature and I’m slightly disappointed that this console doesn’t have it.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1686700800000}
{"reviewTitle":"Not worth the wait","reviewDescription":"I waited a long time to get this systems only to end up using it once in a while. With the new Xbox Live there is not point to buy games anymore however the constant need to update the firmware to play games is very very very bothersome. Long story short this is a great system however not worth the wait if you already have an Xbox One. There are not enough exclusive games to warrant the price years later.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Simple design and powerful performance","reviewDescription":"Both of the new console are powerful and cheaper then any good gaming PC. Takes little space and has little round pegs on it's right side if you want to lay it sideways. Honestly no real exclusive still but if that isn't the issue then it's just a matter of preference and friends on the consoles.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Be aware of this if you order this item...","reviewDescription":"The Xbox Series X is phenomenal. The display is beautiful and it has a terabyte of storage. That being said, know that if you plan to use this for VR purposes, it is NOT capable of doing so. The PS5 is definitely able to handle VR, and renders an on par quality as the XBox Series X. To be honest, the PS5 operates much quieter as well with the fan being almost indiscernible while playing games or streaming. If you are looking for a machine that will handle VR, (Virtual Reality), the Xbox Series X is not an option. I sent mine back in favor of a PS5.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"I am happy with it.","reviewDescription":"I have had several Xbox's over the years, going back to the 360 era. I managed to get this day one and have been very happy to have it. I replaced my Xbox One X with this, as my One X was struggling to play games like Red Dead Redemption 2 without sounding like it was going to take off. With the Series X, I can play RDR2 without any noise from the console. Everything looks better too on this compare to the One X. Now there have been some hiccups here or there since launch but Microsoft have done a good job so for with trying to fix things. My major issue are the controller not syncing when the batteries die and having the restart the console to get it to sync, some games won't quick resume and that causes all the other game and apps not to launch, and games like Call of Duty Black Ops: Cold War crashing all the time. The first two are Microsoft's problems, while the last one is the devs. Overall, it's a good console and for most will be worth the upgrade.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1613692800000}
{"reviewTitle":"Well its another Xbox, I guess.","reviewDescription":"I honestly wish Microsoft did something more. Not with the physical Xbox that is. I like the design and it is definitely packing a good amount of power for what you pay.However, I honestly did not feel like I was jumping into a new console generation as I had with previous generations.The UI is the same as it is on the Xbox One and One X, the controller is virtually the same (they added a share button to the new one, WOO-HO!) and there hasn't been a lot of new first-party Xbox games since the launch in November.I wish they would've given us a new UI, new controller, and some more games. Coming from an Xbox One X, I really haven't felt that feeling of excitement as I have with new console generations in the past.I do not think I am the only one that feels this way either, as I have read all over people feeling the same way. I know Microsoft is banking big on Game Pass and cloud gaming, but eh. Still miss that feeling of excitement.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1613433600000}
{"reviewTitle":"A day late and a screw loose","reviewDescription":"I was supposed to get this on launch day but for some reason it stayed around in Georgia for 24 hours. I got it on the 11 and I noticed that a screw was loose. Not a little screw either but a big one. Doesn't even seem like the kind of screw that would even be used in the console. I wedged it into a corner because I didn't have any tools on me that could pull it out and then I tried the system out to see if it would run. I had it running for over 7 hours with no issues.  I have something that can pull the screw out at work and I will bring that to home with me to remove the screw. I saw a few reports of the screws falling out of other people's series x but the screws I've seen don't look like the one I have. Just wanted to mention this incase Microsoft, Amazon, or a potential customer is looking at reviews. I'm going to keep the system but if it dies on me after the return window closes I will forever curse the name Microsoft and the year 2020.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605139200000}
{"reviewTitle":"Picture quality and memory\/storage space","reviewDescription":"I just got the Xbox Series X. I gave it 4 stars because I really liked my xbox one kinect. It came with voice command and of course the camera you could use to interact with games. I didn't grow up playing video games, I got hooked in my early 20s. I am an old lady of 61 so I've played on a lot of platforms\/systems. So the new games are moving on and to keep up I have to buy the newer game systems. And I have to say on this xbox series x I LOVE THE PICTURE\/GRAPHICS QUALITY, LOVE THE MEMORY\/STORAGE SPACE. It deserves 5 stars but change is hard and money's tight.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1666656000000}
{"reviewTitle":"It needs an way to save offline playing","reviewDescription":"The console works great. The only thing I didn’t like about it was that the only way to save your game progress is if your online. Otherwise it’s a great console.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"It isn't no PS5","reviewDescription":"What can I say, it took me a year or so to land one of these babies from Amazon, but it arrived in 2 days after I ordered so there's that.It's an Xbox Series X, better a little bit that Xbox One X, not quite as amazing as one would hope.I purchased this for Developer mode and emulation, but I am enjoying GamePass on here so I can pickup a game where I left off on the PC.The added benefit is if you have multiple users (kids) in the same house and mark this as your home Xbox, everyone gets the benefit of Xbox Live Gold so that's nice.I really wish that the machines were just a bit more powerful, 4k 30fps isn't exactly groundbreaking.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1654819200000}
{"reviewTitle":"Controllers are absolutely awful","reviewDescription":"I would like to play and enjoy this console but I cannot because of the controller build quality. Stick drift is present brand new out of the box. Buttons stick. Other game companies can make a functioning controller I don't know why Microsoft still struggles with it to this day.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Bad xbox","reviewDescription":"Sound card went out.  I've not had it a year yet. Hopefully the new one I'm purchasing doesn't have any issues cause I'm not made of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Garbage","reviewDescription":"Amazon and Asurion are scammed when there is an issue with an Xbox and they won't cover it and only refund because the price difference. Asurion wouldn't cover the defective gaming console. Don't buy these items from amazon!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Disappointed","reviewDescription":"Not even a week of having it- barely played 4 hours and its starting to have issues, failing to connect to internet, not displaying on the tv","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Didn’t work and have not been refunded","reviewDescription":"After everything was done updating and downloading I was only able to use it for 20 minutes before it shut off and was unable to turn back on, it’s now approaching two weeks since I sent it back and I have yet to receive my refund or a reason why it’s taking this amount of time. Disappointed in Amazon and Microsoft, one for sending a faulty product at full price, and two, not getting refunded at all (at this current point).","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1650844800000}
{"reviewTitle":"Sent used","reviewDescription":"Waited a long time for the invite to order a new Xbox just to be sent someone’s used one. If I wanted a used Xbox I would bought it someplace else knowing the condition beforehand. To top it off this  was missing accessories. Very angry because I was excited to be finally be getting the Xbox X","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Launch day console = expensive brick","reviewDescription":"I was very excited to receive my console on launch day after waiting 2 months from the pre-order. I was able to setup the console but it quickly died. The screen started flashing green then it shut off. After that it would either boot and then shut off after a minute or not boot at all. Lesson learned, don't buy the first generation of Microsoft's products!","isVerified":true,"ratingScore":1,"reviewReaction":"78 people found this helpful","country":"United States","date":1605052800000}
{"reviewTitle":"Buyer Beware","reviewDescription":"I bought this Xbox on Nov 6th, 2022, received it on Nov 10th, 2022, and it died on Dec 5th, 2022, didn't even last a month, and I didn't even use it that much, probably played a few games, and it literally died in the middle of a game... I would not recommend this purchase. I'd give this Zero stars if it would allow me...","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"It exploded","reviewDescription":"We received it on the first and, on the fifth, it made a horrible noise, the lights flickered like we were in a horror movie, and it never whirred again. Still in the return process, which is nerve-wracking, given the price. Fingers crossed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Stopped showing up in any input","reviewDescription":"It’s not showing up on my tv and I bought it early for my kids tv so I can’t return it. I’ve tried every input and checked all the cables and tried it on a different tv. Hope I can return to Xbox","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"New! But memory is bad.","reviewDescription":"Been 15 years since a new system, so I am enjoying this. Games are expensive, but wait for sales.  System works great and only negative so far is the memory gets full very quickly. Going to have to buy an external memory which is expensive.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Works as expected","reviewDescription":"Was packaged well and shipped quickly but didn't arrive in time for Christmas due to fedex & their lousy service. Purchased for my son and he would recommend the Xbox X. He says graphics are great and the switch from his Xbox one to X was easy. Instead of my son getting to set up and use it on his school break he was handed an IOU for Christmas & had to wait. Devastated mom - sad kiddo - won't use vendors again who ship via fedex because this is how it always goes with them & deliveries to our home.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673654400000}
{"reviewTitle":"Great Graphics, Blazing Fast, & Halo (duh)","reviewDescription":"This system was very easy to setup and looks amazing on my LG CX. With VRR and 120hz games look amazing such as halo. Amazon made it fairly simple to secure one with a little persistence.The only flaw I’m seeing is it does get quite hot, so ensure it has room to breathe. Also the VRR seems to have a slight flickering issue with my specific model of TV which is fixable and never present in my actual games.Highly recommended. If you looking for speed and high quality graphics for your 120hz 4K Dolby Vision OLED, go Xbox. If you want to exclusive games with slightly less power, go PS5. Both are great options this holiday.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1638057600000}
{"reviewTitle":"Important","reviewDescription":"The product is good but it keeps crashing the games I'm trying to play and that's annoying plus the delivery guy almost left when I was heading to the door","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684281600000}
{"reviewTitle":"Forgot the batteries","reviewDescription":"The box was intact and everything was inside except the batteries fresh controller no batteries hopefully the next one the do they add the batteries like its supposed to other than that im very happy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678320000000}
{"reviewTitle":"Works quite well but...","reviewDescription":"The console works quite well, but it does not state that you must install games on the internal storage in order to play the Series X compatible games. If installed on an external hard drive or the new storage devices only for Series X, they are specifically for storage only.  In order to play an installed game, you must move it into the internal hard drive. Another thing is you must give the console physical space, otherwise, it will overheat quite easily.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Not as backwards compatible as you think!","reviewDescription":"This is a good product. Runs great, no lag , downloads fast. But the thing that got me was the \"thousands of old games from four generations\" is simply not true. If it isn't in the Microsoft store you can not play it. There are some games I have that are in the store and still they say they can't play that game. Batman and Dead Rising 2 to name a couple. So if you thought you'd play \"all\" your old titles think again","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1658361600000}
{"reviewTitle":"Amazing for an Xbox but has some minor kinks to fix","reviewDescription":"I liked that this came on time, unlike another order I had from Amazon. It was an early Christmas gift for a friend and he honestly loved it, the resolution is really high and you can tell there was a nice amount of work done and considering I have the Xbox one s, I can especially tell the difference. However, I do not like the shape nor the price, for a 560 price tag you would expect something extra like a second controller or, who knows a headset or something, but nothing. The packaging was kinda nifty tho where it wasn’t a traditional Xbox box. I also did not like the way it was super vertical so I can’t really find a good spot to fit it now without blocking the screen or put it on the floor and hope no one topples it’s over :\/","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605312000000}
{"reviewTitle":"I love it but still a lil disappointment.","reviewDescription":"I am mainly p!$$Ed because they succeeded in bambozing me into buying the Xbox one x as if it was gonna be the series x only to come out with the series x so fast. I would of just waited. But that's on me. I love the series x though. The graphics are awesome and the game pass is the icing on the cake.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667433600000}
{"reviewTitle":"Next gen gaming","reviewDescription":"Have had it for 2 weeks now. Gotta say that it's a pretty cool console. If you have an XONE or OneX you'll feel familiar with the ui since it's basically the same. Now there aren't that many games that scream Next gen yet. Though the upgrades for series x\/s optimized games are very cool with more incoming. As it stands, besides things like quick resume(which has it's few issues like not working 100% of the time), faster loading times, this gen is barely starting. So don't fret if you haven't been able to get one yet. Another point with these new consoles (ps5 included) is that in order to play at 4k 120 frames per second you need a tv that has hdmi 2.1. I went with an LG un 65nano85una. Awesome tv and not as pricey as oleds.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1606867200000}
{"reviewTitle":"go to Best Buy","reviewDescription":"We've had technical issues with this just after the return date expired, won't download games, locks up with discs, good luck with technical support. Taking it to Best Buy today to see what can be done.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Stopped working less than 4hrs after got it.","reviewDescription":"Everything was great then it just turned off and now it will not come back on. Called Microsoft and they were no help at all. I have always had Xbox and have not had any real issues until now.Now when looking online you can find all kinds of people with the same issue.","isVerified":true,"ratingScore":1,"reviewReaction":"92 people found this helpful","country":"United States","date":1605052800000}
{"reviewTitle":"After waiting months for the game, it didn't work. Now I can' otrder a second game","reviewDescription":"My grandson applied for permission to order this game several times. After waiting several months we got permission and ordered the game. When it arrived it would not power on. Microsoft said the power supply is bad and has to be replaced. Amazon has no provision for a replacement when a faulty game is shipped.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"Product is okay.","reviewDescription":"Product is great the return process is horrible. It's been over 30 days since the return was received.  Still no ability to get my refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"$600 paper weight","reviewDescription":"The product claims it consists of 5 components: console, wireless controller, hdmi cable, power cord, and 2 AA batteries.My order was missing everything but the console; in other words I received a $600 paper weight.How on Earth do you send a console out missing 80% of the package?! What a joke!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Xbox sucks","reviewDescription":"Nothing but problems… causes more stress than anything. Wish I never wasted money on this. Should’ve went with PlayStation","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Junk","reviewDescription":"This is a glitchy P.O.S.  Today its telling me \"the active controller has been disconnected. Press A on any controller to continue with that controller\"  You mean the same controller I had to use to get to the error message to begin with?  Can I get my money back?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Worked alright","reviewDescription":"Then all of the sudden wouldn't connect to wifi or Hotspot, and I had to send it in to Microsoft for repairs.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Xbox","reviewDescription":"Not mad just disappointed. Seller sent a defective product and when I brought it to attention they offered no help claiming it’s no longer under warranty. Please don’t sell junk","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Terrible Support","reviewDescription":"Pray you never need service.  Xbox a customer service is hands down the absolute worst!!!  Every attempt ended in failure.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Works great with my 4K TV and smooth","reviewDescription":"I was one of the few lucky buyers who got this Xbox and I do enjoy playing console games a lot.  This Xbox was short in stock and I've waited so long to get one.  The gaming experience is smooth and fast.  The graphics look smooth and sharp on my 4K TV. I do find the games somewhat expensive.  I've noticed it will crash sometimes for no reason. So far, it has been a great console and my friends love coming over for games.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1640476800000}
{"reviewTitle":"Comparable to the PS5 but not much better than xbox s","reviewDescription":"Xbox X is great as a new gen console, but unless you are an avid gamer that is in need of more memory, a nice display, and a disk drive, save 200 and opt in for the Xbox S. I've played a friend of mines xbox s and we have the same exact experience so could only recommend the X if you are interested in playing games on the disc. However, for a casual gamer that has an xbox to play with guest in the living room, the X is overkill for me","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1639958400000}
{"reviewTitle":"Best Xbox console to date however...","reviewDescription":"This is above and beyond the best Xbox console to date, however there are system updates still needed to improve the overall performance in games. Due to the fact that Microsoft waited for AMD to finalize the RDNA 2 feature set so the Series consoles could have the entire feature set, the system is behind in terms of max performance capabilities. Once these system updates roll out and the system fully utilizes the full RDNA 2 feature set and games are taking full advantage of them, we should see the full potential of the console. Early on there seems to be some slight performance issues with the cross gen titles at least. Still very happy with Xbox and the direction it's going as a gaming platform.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607731200000}
{"reviewTitle":"Sticky buttons","reviewDescription":"I have played a lot on my friend’s xbox series s and have also played on the PS5. After playing both, I decided I really liked game pass and the general operating system of the XBOX. I decided to splurge and get the series X because of the consoles power which has lived up to the hype. My only complaint is that my controller has very sticky buttons right out of the box.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1663027200000}
{"reviewTitle":"2 invitations and finally got the Xbox X!!","reviewDescription":"Who knew it would be a game just to order this box! After 2 invitations I finally got to order and it came!! For my son, so I don’t really care about how it plays!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677283200000}
{"reviewTitle":"Impressive","reviewDescription":"Nineteen years since my first Amazon order and this is the first review I've written. I submitted my invite request never expecting to get an actual invite. Thought it was a sales gimmick, a useful ploy to somehow drum up sales. The new Xbox was delivered today. Still a satisfied customer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660435200000}
{"reviewTitle":"Great Console.","reviewDescription":"I own both the PS5 and The series X. TBH I like the PS5 more. The controller is just top notch. But I keep the series X in order to play with non-cross platform games with friends. The actual size of the console is better\/smaller than the PS5. To get the most out of this though… you need a newer 4K UHD TV.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1655424000000}
{"reviewTitle":"Finally got mine","reviewDescription":"It took a while, but it was worth the wait.  Other places made you purchase additional items to get this console in a reasonable amount of time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676764800000}
{"reviewTitle":"Kinda buggy","reviewDescription":"It works great most of the time and is a huge upgrade from the original Xbox one but sometimes you can’t access Microsoft store and games have refused to finish downloading even months after getting it. Definitely has room for improvement in the future.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669680000000}
{"reviewTitle":"What are they thinking","reviewDescription":"First let me say everything came in on time as stated and undamaged. WTH it was shipped in the factory box for every porch pirate to see a Xbox X sitting on the front porch.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"It's great, with one major exception","reviewDescription":"This thing does what it's supposed to. However, this one (and many others that ive heard) has a hard time with headset connection. It randomly disconnects and reconnects every 2 minutes. I haven't been able to figure it out","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"Caveat emptor","reviewDescription":"Right out of the box, brand new console, and all games have no sound. Series X games, X-Box One games, 360 games, downloaded, and disc, NO SOUND AT ALL. Power-cycling and resetting the console do not solve the issue.  After hours of researching online it was discovered that this is a known issue with Samsung smart TVs that Amazon does not disclose.I found only one suggestion that actually worked for my Samsung QLED 60 series: while a game is running, unplug the TV, wait a short while, and plug it back in, and that worked.  However, this issue causes there to be either no console sounds in the Guide\/Dashboard, or no sounds in games. I can live with no sounds on the Guide, but not if I have to constantly unplug and plug back in my TV","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1682208000000}
{"reviewTitle":"Remote doesn’t work properly","reviewDescription":"The Xbox works fine and so did the remote for a couple days…. Then the left stick randomly stopped working. Had to send it in and now it will take 2 weeks to get a new one. other then that no issues so far with the product","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"The console is just OK","reviewDescription":"I have had my Series X for a year now and feel I can give a full review finally. The console is just mediocre, the graphics are fine the games are awesome in fact I think Gamepass Ultimate is the best value in gaming right now, I just wish Microsoft had a console that matched it.The audio from the console itself is just silly, unless your TV\/Monitor has built in speakers or audio out then you will need to use a HDMI audio extractor, an official wireless headset, or wired headphones connected to the controller, also no bluetooth connections so most modern headsets, and sound systems are useless with this console.The wifi can be very finicky and drops a lot, no other wifi device I have loses connection as much as this console so I have started to use a wired connection.Only 1 USB port in the front is lackluster.This feels like a $300 console not a $500 one.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1634774400000}
{"reviewTitle":"Learning Will Happen","reviewDescription":"I bought this XBOX Series X specifically because GTA Online was heavily promoting a major upgrade and bonus materials only on the XBOX Series X and PS5 platforms. I figured i needed a upgrade anyway. HOWEVER, what no one is saying is that my current GTA account will not cross over to XBOX, so I would have to start over with a whole new GTA online account. Disappointment.Also, make sure when purchasing controllers you review the list of games your new controller will work with. The G920 from Logitech for example does not work with every game and does not show up in the XBOX APP's.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Did I really need to upgrade?","reviewDescription":"So I decided to upgrade from the One X to the series X. Other than faster loading times there is no real difference. In fact my One X seemed to download games faster from Game pass and its stock controller feels higher quality. The Series X controller feels cheaper somehow. The buttons are loud and clicky. So I like it but it doesn't feel like a huge upgrade. Games play and look the same on the One X. So I can't give it 5 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Came Scratched Almost If Used?","reviewDescription":"Just got the console, it works and was packaged like a new console but it has a tiny scratch on the top. The amazon packaging box was undamaged and the xbox box itself didn't show any damage? Has me thinking if these are used consoles? Very disappointed because it took me over a year to get one.. i will keep it since everything else is working great. Just wish it didn't come with that scratch.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1670112000000}
{"reviewTitle":"Overheats","reviewDescription":"The fan seems to not push much air at all.  The system is fast, however it overheats fast when playing any game.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688256000000}
{"reviewTitle":"Meh","reviewDescription":"Bought this to replace my week one series S. I haven’t noticed a huge difference in performance. Forza horizon 5 still has frame rate issues in quality graphics mode. Nothing loads faster, nothing plays better. At least I can play dvds lol.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1682294400000}
{"reviewTitle":"Funciona correctamente, bajo puntos por mal estado físico","reviewDescription":"El equipo funciona correctamente, pero me decepciono encontrar golpes tan evidentes que me hicieron desconfiar de su buen funcionamiento, por esto mi calificación (anexo fotografías).","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Taped up box","reviewDescription":"Box was trashed but console wasnt damaged would have been 5 star","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"...","reviewDescription":"Super excited after waiting, I finally got it today! Maybe 2 to 3 hours of play it shut off on me completely with no warning! I was in the middle of a call of duty game and it just gave out! I turn it on again and sure enough it shut off on me an hour into my game play!","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1605916800000}
{"reviewTitle":"As expected","reviewDescription":"This product works as expected.  The box was damaged slightly when I received it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"Solo me duró 2 meses","reviewDescription":"Tan solo duró 2 meses bn y después fallo,póngale garantía cuando la compren","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666915200000}
{"reviewTitle":"Why","reviewDescription":"Consol works nice controller that came with it is giving a whole lot of feedback everyone sounds like poop and I sound like poop and I'm using an expensive headset that works fine on everything else including the Xbox one but for some reason it makes me sound like a robot on the series x","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1605139200000}
{"reviewTitle":"La entrega no se realizó en el tiempo propuesto","reviewDescription":"No me gusto que el producto no llego en la fecha que debió llegar pero después de eso todo bien","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656892800000}
{"reviewTitle":"Same as the Xbox one","reviewDescription":"Honestly the same as the Xbox one just the speed is a little faster, the gaming menu and everything is the exact same games look the exact same but just a little faster... prob gonna return","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1605052800000}
{"reviewTitle":"Okay gaming console","reviewDescription":"Sometimes I feel like this console lags a little when turning on compared to my other console. Game selection is great. Hardware quality is also great but does not offer a lot of accessories.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1624924800000}
{"reviewTitle":"Not bad!","reviewDescription":"My gaming PC works better than this does!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667260800000}
{"reviewTitle":"But this as a birthday gift","reviewDescription":"The item was advertised as new but the seals on the side of the box where are broken and all the paperwork warranty or whatever is missing","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1629849600000}
{"reviewTitle":"Xbox Series X Review","reviewDescription":"To start off I would consider myself not a pro gamer, but definitely not a casual. I’m some where in between hardcore & Pro gamer. I got some insight on specs etc. This review will not be about the specs because we already know it’s damn better than last gen console Xbox One X.After a terrible, terrible, terrible...... the worst preorder experience of my life. I’m not joking. This generation of consoles preorders will go down in gaming history infamy because how bad it was, especially during our pandemic. I was as excited as I ever could be to receive this item as if I was a child all over again. And to top it all off it came 9 hours earlier on release day! I call that a significant win for preorder delivery, since this is my first time preordering a console online.Now for what your really here for, the console review. Personally, I love it. Load times are significantly faster! Games look so damn good! And total backwards compatibility with this console made me cry tears of joy. A true 4k experience. Something last generation promised us that didn’t happen.Now not anything is perfect. The one huge downside is there are no new games for this system yet. Usually there will be about 5 to 10 day one (some exclusive only to console) games. This year there’s basically 0. Yes, the positive spin on this is you have a while back catalog of older games you can play on this newer system and see the graphics ramped up. But as an avid gamer I am a Little disappointed that Microsoft the back big time even during pandemic that they couldn’t even offer at least 3 day one games. Sony is the same. These consoles will not have new games coming out day 1 unfortunately. We’ll have to wait till a little more in 2021 to expect the games we really want.If you want a more in-depth review you can head right on over to my YouTube channel where you can see an extensive review on the console today at 8pm central standard time. My dad and puppy will be on. It’l is going to be hilarious and cute. My channels name is Clive Childress. Come check it out of your interested to know more.All in all though this console is stellar. And I can’t fault the company for the pandemic situations. So with all that said this is a pretty great console.","isVerified":true,"ratingScore":5,"reviewReaction":"106 people found this helpful","country":"United States","date":1604966400000}
{"reviewTitle":"Perfect","reviewDescription":"We’ve had it for months. It came perfect and is exactly what we expected it to be.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Pretty good","reviewDescription":"Console came in perfect condition","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Two words..","reviewDescription":"Game Pass!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"No issues","reviewDescription":"No dings, smudges or scratches. Brand new, booted up fine, connected to wifi fine, games have been downloaded and is running good. Double check the box im dumb sometimes and didnt see the controller box for a moment","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Non- stop usage","reviewDescription":"My son had the Xbox S game console prior to this and I went through a rough time Constantly played all weekend as well as everyday after school it traveled to friends houses and grandparents house. The connection plug was broken and over heated. This new game is amazing and the graphics are spectacular. He loves the fact of being able to play with friends that have other gaming consoles. This game has been living up to all the hype and has been my son’s favorite game thus far. Just hope this will not start to overheat from the constant playtime.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Perfect alternative to PC gaming for casual gamers","reviewDescription":"After purchasing a xbox series s for my young children, we quickly learned of the storage problems that the Series S has. On average we were only able to download 5-6 games at one time, and with multiple people using the console, it filled up right away. While cloud gaming is a cool solution to the storage problem, it causing some issues with reliability and uses a lot of data, so if your ISP has a cap on your data, it is very possible that you will exceed this cap within a few days.In researching the external expansion drives available for the Xbox Series S or the new 1TB Xbox Series S, we found that it would have been cheaper to simply buy the Series X as a replacement. Within a few days of owning this console, it became apparent that it is 3 to 4 times faster than the Series S and found a use for the disk drive as we are able to purchase used games or find a lot of discounts for older games. Using the Xbox to watch Bluray movies and DVDs is also a great value to the system.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Amazing! Love it!","reviewDescription":"I bought this for Christmas for my son and we love it. It’s very user friendly and the graphics are wonderful. The package it came in was fun and very professional! Downloading disc games can take a while sometimes, but the system is fantastic! I absolutely adore the backwards compatibility!!! Absolute favorite feature for sure! This was the main selling point for me when I was looking into a new console to buy. I didn’t see the point in buying a PS5 if I couldn’t play the PS3 games that I currently have from my older system. At least with the Xbox series X I can still play the 360 games that I have and even buy more 360 games if I want! The memory is outstanding as well! Xbox also has a family settings app so I can keep up with the games my son is playing and how much time he logs on his system, as well as any messages from “friends.” Definitely worth the money in my opinion. Family friendly. User friendly. Just amazing. Keep up the good work Xbox!","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Worth the money","reviewDescription":"I was stuck deciding on this or the series s and glad I chose this it’s worlds faster then my Xbox one definitely worth the money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"The best yet!","reviewDescription":"So quiet, you can't hear the built-in cooling fan until you put your ear almost on top of the case. The graphics are outstanding, the storage size is greatly improved, and the speed easily doubled from my Xbox One. Add it all up, and you have an outstanding gaming platform.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"I think I got a refurbished one","reviewDescription":"I have had issues with this Xbox from day one I have to go in and out of apps due to them crashing constantly. When I play online games, it gives me issues as well where I have to go in and out and close the app and return when I contacted Xbox they want me to send it in and I can’t do without my Xbox for a month so I just deal with it. I will never purchase another one off Amazon again though and will always go through the Microsoft store.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1679443200000}
{"reviewTitle":"This is not a review on the product itself","reviewDescription":"I ordered this product on May 16th 2024, and it has been delayed 3 times now, with an estimated arrival of Mat 29th? For an expensive product that I've already paid for, its quite disconcerting.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"Stuck at 640x480 resolution, tried everything - no solutions work","reviewDescription":"This console obviously needed further bug testing. After FINALLY getting my day 1 preorder, I was ecstatic. My mood quickly sullied when about a week after purchasing, for some reason the console would be set at 640x480 resolution, with no fix available. The \"solutions\" online do not work, and there's no official word from Microsoft. This is NOT a TV issue. My Xbox One, PS4 and Switch all work perfectly fine. It's just the Series X. It apparently doesn't matter what kind of TV you have, it affects a whole bunch of them. A total headache. You should wait for the Xbox Series XYZ to come out in a year - maybe that one will actually work as advertised. I'm going to try to go about getting a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1607731200000}
{"reviewTitle":"Cannot Connect to WiFi and Controller Search Cannot Qork","reviewDescription":"I set up my Xbox X and tried to connect my controller to the Xbox and cannot activate through search button. And cannot find my internet which was close to my Xbox. I reset the Xbox and still nothing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Microsoft sucks","reviewDescription":"No longer a Microsoft customer. 1. Brand new controller has insane stick drift practically out of the box. 2. Microsoft will suspend\/ban you for saying something they deem wrong. NO RESPECT FOR THE 1ST AMENDMENT!! Absolutely disgusting.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Xbox continues to crash","reviewDescription":"Amazon's customer service wouldn't let me return the product because I was out of the country and missed their return window.I am now battling with Microsoft to have them fix the console. The console simply does not work. You turn it on to run a Series X game, and it freezes and crashes.The controller also has issues. Making weird noises while vibrating. I feel like it was dropped somewhere in a warehouse or something. Makes ZERO sense.The only thing that runs on it - are YouTube, Netflix, Prime Video.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Crashed and died on the first day----JUNK","reviewDescription":"After waiting months to find at the $499.99 MSRP through Amazon, and waiting a couple of weeks for the order to arrive, I get a POS that died the first day of gaming.  After wasting time to set it up, I purchased and downloaded a couple of new X series enhanced games. I then was played Gears 5 X\/S for about 25 minutes and it the XBox X screeched, my LG OLED screen went blank and the system died and will not restart.  I see now that this is beginning to be a common issue due to a bunch of bad chips as of late.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1649635200000}
{"reviewTitle":"Crappy product and service","reviewDescription":"The product kept turning off and on while my son tried to play.  Returned and received on January 3.  I am still waiting for my money back, I have reached out multiple times will ONLY a credit back hopefully on January 27th… Still waiting! I am very unhappy.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Power Issues","reviewDescription":"I just got my X today and it won’t start up, it is getting power to it as shown in the video but it will turn off after a second or two. It won’t even load up. I tried switching the power cable to the one with my one s and it still has the same issue. I contacted Microsoft and the X has been put of warranty for a year. Until this issue is solved my review will unfortunately be a one star. I am usually not the type of person to complain but in troubling times I saved up enough money and paid a hefty amount.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1655337600000}
{"reviewTitle":"A breathtaking combination of arrogance and corporate evil","reviewDescription":"Wow, the arrogance of this console’s specs are simply breathtaking. Still no bluetooth headphones - gotta use theirs! No optical audio unline every other console they made. Data harvesting around every corner. Doesn’t even play Blu-Rays or CDs out of the box - you have to download Blu-Ray and even CD player apps (that suck). 4K\/120 only works for a tiny sliver of the market, for everyone else with a 4K TV or lower, get a OneX. Barely worth the price for the 4K\/120 crowd, for everyone else, seriously not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1649808000000}
{"reviewTitle":"Beautiful Console","reviewDescription":"The thing I love most about it is the design. It did an amazing job compared to the PS5. Not to mention it's better sized. It is so architectural and minimalist. Mad brutalism\/Kaaba vibes. The controller could have been designed better tho. Still has the primary colored buttons which takes away from the black-on-black aesthetic.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1607472000000}
{"reviewTitle":"The box came a little damage, it was ripped on one of the sides but still good","reviewDescription":"I purchased this item as a gift for my brother and I was a little disappointed when it arrived because one of the sides of the box was ripped but overall the box was still sealed so he still opened it and everything worked perfectly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614384000000}
{"reviewTitle":"Can't fully handle massive games","reviewDescription":"Does almost everything I expect of it. Except ARk crashes it consistently, sad for a 6 yr old game. Microsoft could have given us 2tb. 1tb fills up way too quickly with the mass of most games worth playing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"Works great, just has a few bugs","reviewDescription":"The xbox series x works great, but has a few bugs. For example, sometimes the xbox simply refuse to turn off unless you take out the batteries from the controller, because it keep turning the console back on automatically. I might have a ghost or something though so that might be it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605744000000}
{"reviewTitle":"On-time. As described.","reviewDescription":"More care could have went to packaging (i.e. taping OEM box close after inspection) as shipments are usually tossed around from agents. Otherwise, arrived as described.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630713600000}
{"reviewTitle":"Really happy so far","reviewDescription":"So I have been waiting to get one but it was hard to catch one and I mean literally, all the consoles just vanishes within minutes. But finally got one and I am happy so far no problems whatsoever 😁👍 cheers","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1613779200000}
{"reviewTitle":"Hardware Upgrade! Worth the $$","reviewDescription":"Thrilled to own the Series X. Despite the lack of a diverse set of launch titles, I truly appreciate the time Microsoft took on this console. Feels like a PC due to being paired with a new LG OLED TV. High frames @ 120Hz without sacrificing picture quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1606176000000}
{"reviewTitle":"Disappointed","reviewDescription":"I do not like that it would not connect at First to our wifi. It still has some glitches display through my HDMI switch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629158400000}
{"reviewTitle":"No box","reviewDescription":"I got the console, cords and controller but it wasn’t in a actual Xbox box but the other pictures I saw they did","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628640000000}
{"reviewTitle":"Faster downloading","reviewDescription":"Alot better than the rest","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662163200000}
{"reviewTitle":"Perfect gift","reviewDescription":"Perfect gift","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great Birthday","reviewDescription":"I bought this as a birthday gift for my husband, said it would arrive the day after his birthday. It actually came 2 days Before! He's wanted one for a while and I'm so happy it was discounted at the right time for me to get it. He absolutely loves it. No issues!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Bad a$$","reviewDescription":"I'm late to the game I really like the X series","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Best Christmas gift ever","reviewDescription":"I'm very happy with it","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Good","reviewDescription":"Given as a gift.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Grandson loves it","reviewDescription":"Bought this for our grandson and he loves it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Like brand new!!","reviewDescription":"The Series is better for on the go and traveling but this X is just a powerhouse with graphics and performance. Both are good in their own way but The Series S is nice on a budget but at the price I paid for this X I really can't really see a downside. Quick resume is the real deal,Just a absolute gift for those with long workdays and short gaming time frames. This thing is a beast. This thing is so quiet that I can't even hear the fan running and that's with it set for 4k on Forza horizon 5 and downloading another game just as a little benchmark test. The graphics are unbelievably crisp and clean. Smooth performance with easy and simple setup. I was blown away with the condition in was shipped, if I didn't know This was refurbished when I ordered it I'd thought it was brand new. Awesome job. So lucky to get this thing basically brand new but with $150 off just because of ordering it refurbished. It was delivered with amazing care so I'm grateful for that. Just an awesome buying experience altogether. Worth the money. 5 stars!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Great deal on a great console","reviewDescription":"Console arrived and was left outside my apartment no signature required or even a knock on the door to let me know it was there. This is not on Amazon but the delivery service so I’m still leaving 5*. Console itself arrived brand new, works perfectly, and have used it excessively ever since with no issues. Got a nice deal in the middle of the night when I just happen to be on Amazon browsing bc I can’t sleep. Still haven’t seen a price as low since. Love that it is all made by a U.S. company too. Game pass is a genius service to offer too and is great for both consumer and Microsoft.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"Love it","reviewDescription":"What can I can say beside Xbox rules and Amazon is the GOAT","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"The ultimate Fortnite machine","reviewDescription":"My son loves his Xbox. The graphics are not quite PC but they are absolutely amazing when you compare to other consoles.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Is it really yours?","reviewDescription":"I figured worst case scenario, the Xbox series X would be an expensive Blu-ray player. And that's about what it's been. But still, I don't like the OS for that. I wanted to simplify the interface to have just my games and apps that I purchase or use. But I can't do that with this system at all! The home screen has a bunch of crap that I don't want to see, that is clearly all about selling me Gamepass or getting me to go to the store to buy more games. Unacceptable! Look at the Nintendo Switch if you want to see a good console OS.It's the last Microsoft console I'll buy. I won't help my son buy one either.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"Most of the problems of a PC, none of the upgradability; Less consistent than the Xbox One","reviewDescription":"I have owned an Xbox Series X since they came out years ago, and I have bought Xbox consoles for console generations previously. I have had gaming PCs, Playstations, and Nintendo consoles, but my Xbox is my default gaming home. That is basically changing, because over the course of its lifespan, for the first time for any Xbox console, I am having all sorts of problems that I used to only have with my Gaming PC. Things like random components of the Xbox breaking until I hard reset the console, issues with downloads from GamePass processing incorrectly (matched with an inability to fix the problem because, unlike a PC, Xbox is a closed system), issues with saves, issues with bluetooth connectivity; essentially, everything under the sun that I deal with as an owner of a gaming PC, also haunts my Xbox experience, all the more so because you are limited in what you can do with your Xbox.The reason the Xbox is my home is so that I don't have to deal with these things when I play games. More than ever, I spend a lot of time diagnosing and fixing problems with my Xbox so that I can just play my game. This has gotten significantly worse over the console's life cycle, and it appears to be almost all software issues, or issues with the Xbox store, or issues with the way my Xbox chooses (without any capacity to really change it) to download things. I find myself hating that I bought this box instead of a PC where I could actually attempt to address or avoid problems.I can tell you this: this is my last Xbox console. I will not be buying another one, because I don't see what I would be getting out of it. It's clear that this is a trend, and that Xbox\/Microsoft has no intention of addressing most of the problems people have, many of which have been known about for years, but I suppose are rare enough that Microsoft doesn't actually fix anything (I guess I'm super unlucky?). I don't know if this is a trend with Playstation because I only have a PS4, but I know my Switch works by default when I turn it on, and I spend almost no time Googling how to fix problems with it.I am really genuinely disappointed in Microsoft, in a way that deeply impacts how I perceive decisions are made at that company. I really liked Phil Spencer, I really liked the plan for GamePass, because it is exactly what I wanted; but I guess I wanted it on the Xbox One, which never game me ANY of these problems, despite the fact that I owned the same console since buying it at release, and the fact that it survived my entire college experience and kept rolling like a trooper. I could still probably unpack the ol' girl, and I would be willing to bet it would run better than my Series X. Last generation, I went through about PS4s (all of them were bought pre owned instead of new, to Sony's credit), but my store bought Xbone never died on me until I respectfully laid it to rest in its box once I got the Series X.Yeah, so I'm done, Microsoft. I'll probably keep GamePass on the PC, and just abandon console gaming altogether, because I'm really only interested in playing the games I want to play, I don't care about hardware or live services or microtransactions or any of that. The Series X, to me, is unambiguously worse than the Xbox One","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Had to send it to Microsoft TWICE before it worked like it should","reviewDescription":"The Xbox worked normally for a couple of weeks and then it started to shut down completely at random times, while being used and while 'off'. Each time this happened I had to unplug the Xbox from its power source, wait about 10 seconds and reconnect the power. Then it would work for a while until it again shut off randomly.Even worse than that, I had to send the Xbox to Microsoft two times before they actually got off their a$$ and fixed the unit. Pathetic.Now that it is working, it is an amazing console.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Very limited Audio Output options, No TOSLink, S\/PDIF, or Optical Out!","reviewDescription":"I just received my second Xbox Series X and all I can say is that you don't know what you don't know. The first one connected directly to my 4K TV and was able to pass the audio across HDMI to the TV and then use ARC to my old receiver. Everything just worked. However, I've been using my Xbox One X in my bedroom with an old 27\" 1080P monitor and an Energy Soundbar that only has optical and RCA inputs. Today I took my new Xbox Series X out of the box and noticed right away it didn't have an optical (S\/PDIF) port. As a matter of fact, it only has 1 HDMI port now as well. Boy, this really stinks!So, I spent the past several hours trying to do research on how I was going to navigate around this issue and pretty much came up empty handed. Apparently you can get an 'audio extractor' and hope it works well enough and sounds decent too, but from the reviews I've been reading it is really hit or miss. I've also read those things mess with your VRR and other video signals and some of them barely do 4K at 60 Hertz. Then I read a lot of reviews from headset users who were completely left out in the cold because a lot of the best headsets used optical in the past and now that they've updated them to use USB the audio stream isn't great anymore.Microsoft's justification was that not that many people were using the optical port and so they decided to omit it for some cost savings. At this point, after reading hundreds of posts about this issue, I think Microsoft either didn't know how many people were actually using it or chose to turn a blind eye and figured we would just work around it.I am writing this review in the hope that others will see it and learn about the lack of audio format support before they make their purchase. If I had known (paid attention with my first Series X) I would not have purchased a second one. TOSLink, S\/PDIF, or Optical should still be considered quite necessary considering the lack of other options available for getting audio out of your Xbox Series X. Especially considering Microsoft doesn't even seem to support USB drivers very well for 3rd party products. Also consider that having to convert digital audio to USB and then back to another format isn't a great design either.This review wouldn't be so negative if Microsoft actually sold a product for this purpose, but I was unable to locate one and I'm feeling quite disappointed right now.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Not sure it's worth the upgrade.","reviewDescription":"Basically an Xbox one, in a more awkward shape, with slightly better graphics. It's great if you don't already have an Xbone but right now, the technology isn't being pushed to its limits. My biggest problem isn't with the hardware itself though, it's with the bad selection of Game Pass games, compared to the Playstation alternatives. All in all, as someone that's upgraded months ago, I don't see any real incentive to upgrade, aside from petty bragging rights.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"I want to buy some","reviewDescription":"I need the invitation to buy one I don't know how to get it","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666224000000}
{"reviewTitle":"Blu Ray Player","reviewDescription":"The game system has amazing features but…the Blu Ray Player is NOT up to par with the Xbox One S.  It will recognize a 3D TV and will play DVDs, Blu Rays, UHD discs, and 3D discs.  As a system, the One S will play 3D games with no issues.  I didn’t know any of these differences until I almost purchased the X and I’m glad I found them out in time.  The 3D thing is important to me so it became a deal breaker for me.  Most others won’t mine but if 3D is important to you, the One S is the way to go.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672790400000}
{"reviewTitle":"Great Tech With Some Issues","reviewDescription":"I bought my xbox is 2022.  I mention this because it's definitely not one of the early ones out the door while they were still figuring things out...Pros:* I think they have\/will have better exclusive games than PS5 (I've been mostly a playstation guy for a lot of  years...)* Beautiful graphics in 4k* Great Sound* Fast Ethernet Port for faster downloads & online playCons:* The small amount of built in storage, games that require huge amounts of disk space, and very high cost of internal storage that can be used for those games* Some reliability issues (I've had a lot of issues with the ethernet card and the initial xbox x that I purchased had a severe manufacturing default)* At this point in time (Jan 2023) almost all the available games are ports from prior generations of xbox system games.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Quality Hardware, Firmware needs some help","reviewDescription":"The difference in game quality both graphically and responsiveness was night and day from my Xbox One. The console powers on and delivers me to the hone screen in less than 2 seconds, and boots games in a similar timeframe.One major issue Microsoft needs to address, but probably won't, is the fact that many gaming monitors aren't compatible with the xbox at 1440p 120hz. These monitors can run these specs over hdmi 2.0, but don't conform to the standard VESA timings, which is all Microsoft uses. This limits many high end gaming monitors to 1080p 120hz, or 1440p 60hz, which is unfortunate. If you plan to upgrade your tv or monitor, make sure you do considerable research into which model will actually work like it should with the Series X.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1607558400000}
{"reviewTitle":"Not much difference","reviewDescription":"Not much difference between this and the  Xbox one x.  Load times are a bit faster but I cannot tell any difference between the two when actually playing a game.  Main screen and interface is almost unchanged.  So if $500 is worth having your games load a bit faster, go for it.  FYI, I don't own the new PS5 and don't intend on buying it so this is an honest review.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1627344000000}
{"reviewTitle":"Genial","reviewDescription":"El xbox llego justo a tiempo","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"please read if you don't want it to be broken","reviewDescription":"If you buy a refurbished one it's noting going work like a new one! it's going still freeze and everything so please buy a new one if anyone birthday is coming up i promise it will be with it na si know this because my buddy bought a  refurbished and i bought a new one mine still works perfectly fine and is awesome but his broke down in like 1 week.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"A lot of space","reviewDescription":"Bought for my grandson and he loves it! Has so much space to download games. Way better than digital Xbox","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Legit","reviewDescription":"The product arrived very well packaged. Works brilliantly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Good","reviewDescription":"No issues","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Super Great quality","reviewDescription":"It’s so good and strong and controllers are powerfully and I love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Llego en perfecto estado","reviewDescription":"Excelente todo ninguna queja","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"best consol","reviewDescription":"It was a great choice for game lovers","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"The Beast","reviewDescription":"Series X, um yeah.....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Excelent videoconsole","reviewDescription":"It is an excellent video game console, you can play all generations of Microsoft XBOX. Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Came broken!","reviewDescription":"This product cane broken and didn’t function properly, I sent it back but never received a refund, honestly just not worth the money and hassle.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"I'm really disappointed with this.","reviewDescription":"I just want to start by saying I do not own a 4k TV, and I would not buy this console unless you own a 4k TV.  I dont know how much better the picture quality will be on a 4k TV, I would hope much much better but I think its garbage and a waste of money.  With that said I do have a really nice flat screen TV, and the picture quality absolutely sucks.  I mean complete garbage.  Specially for paying $499.99.  Theres not many games for the series X either.  I have the game pass and its mostly xbox 360 games.  Its like i bought the series x just to play 360 games.  Anyways I'm Returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1667001600000}
{"reviewTitle":"Don't buy digital games. Not possible for kids to play while I am.","reviewDescription":"Over the years, I've invested in digital licenses for games.  felt like the future.  When the series x came out, I decided to give my xbox one S to my kids so they could play their games.  If we try to play at the same time, even though it is not the same game, we aren't allowed.  Okay... surely it will work if I sign in with my Kid's xbox live account that is connected to mine through family controls right?  Nope.  Maybe there is a way to loan the game or transfer the license?  Nope.  Basically I'm SOL, and will be looking for physical used games this holiday season for my kids.  The technology is ready for digital licensing, but MS is not.  I suggest buying physical (preferably used so it hurts their bottom line) until they empower digital owners.The series x itself has been fine.  Crashing a fair amount, but for now I blame that on COD:Cold War","isVerified":true,"ratingScore":1,"reviewReaction":"63 people found this helpful","country":"United States","date":1606089600000}
{"reviewTitle":"Won’t turn on","reviewDescription":"Purchased the console at launch. It’s been hooked up and sitting on the entertainment stand under my TV ever since. I don’t have a ton of time to play as much as I’d like so maybe a few hours a week. Many weeks where I don’t play at all. Went to turn it on a couple days ago and it won’t turn on. Switched power cords. Tried blowing the dust out. Switched to multiple different outlets. No luck.Very light use over three years broke it.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Constantly breaking by forced updates","reviewDescription":"You should be able to sue these companies when one day your game is working fine and the next day it doesn't work. If it takes longer than using a game on a CD you should be entitled to compensation.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"DOES NOT WORK","reviewDescription":"I would give this 0 stars if I could but since that is not possible I give it a 1. Hello I ordered this Xbox for my son and when it came in, it did not work AT ALL I tried plugging it in to different outlets, tried and Ethernet cable, tried different cords, unplugged the whole thing for periods of time and NOTHING WORKED. And to top it of the return time is UNBELIEVABLY LONG, saying that it will take up to 30 DAYS to refund my order. I am not PLEASED and will not buy this product from this seller again.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"System is not worth the money","reviewDescription":"Had the for a little over a month now and it's starting to glitch out. My son is very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Noticable performance decrease","reviewDescription":"Previously had an Xbox one x and this piece of crap is a step down. There is negligible performance increases that nowhere near justify the price, every game that came out before the new generation that has a special series edition has crashed on me every time I quick resume, and on top of all that the network setting make it horrible to connect to the internet which is a necessity in these times. I'm constantly dealing with disconnections because the Xbox stores and alternate MAC address that needs to be manually cleared. The same problem occurs on wifi or Ethernet connection.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"New or not new with bad packaging","reviewDescription":"This item was supposed to be new, but after I opened the shipping box the xbox x package itself;  seemed to have been opened and also very wet(the shipping box was dry).  I have not tried to connect and see if it works or not, but the package was in terrible shape.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Came in the mail the 22nd of December","reviewDescription":"Hooked the console up and tried to load a game, wouldn't go past the title screen in game. Tried to download a different game and same result. Borrowed a couple games from a friend and none of them would go past the title screen. So basically, it would download\/save games but wouldn't play them. Glad I tested before I gave as a gift. Had to return since it wouldnt play games.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Great system","reviewDescription":"Great console design, fantastic graphics, game pass is a great deal,  had to buy rechargeable batteries,wish they were like Sony and had it built in the controller. Overall I can’t say it’s much better than the ps5 nor can I say ps5 is better then the series x both consoles are excellent","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Good console system for every day use","reviewDescription":"I'm more familiar with the XBox controller so transitioning from an XBox 360 wasn't too bad at all.Good for sports games. Even for my little tiny monitor. I don't really take advantage of 4K, but this system should last a long while.Now time to get a PS5 :)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644969600000}
{"reviewTitle":"Wanted a 10 but took too long to find","reviewDescription":"The best console Iv ever seen, massive library, backwards compatibility, amazing graphics, suspension play is insane, couldn’t be happier just a damn shame it’s so hard to find one at the 500$ price it’s supposed to have.Please don’t support the gougers.I hope the gougers go to hell when they die.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649808000000}
{"reviewTitle":"Xbox","reviewDescription":"Happy i finally got invited to purchase my Xboxs, only downfall is they don't offer insurance\/warranty like you would if purchased at a store.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670976000000}
{"reviewTitle":"Awesome new gen console!","reviewDescription":"Amazing buy, couldn’t resist! A bit overpriced. Only wish it was a little smaller in size. Great game selection. Not bad for its value!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"If you can only get one, get a ps5","reviewDescription":"If you do manage to get your hands on one of these next gen consoles i would honestly recommend a ps5 over this, a decent system but to me falls short of the ps5 in exclusives so far and just feeling like pushing the pace of next gen consoles","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1636329600000}
{"reviewTitle":"Such an Amazing Console, but....","reviewDescription":"First off I just want to say that I love everything about this console. The controller, the load times, the graphics, the UI, everything. My main issue is that, Microsoft offers a lot of games in Games with Gold and Game Pass and the issue im having is that I dont have enough storage for the games that I want. I wish there were 2T versions, but I will deal with it until I can scrap together another $100 for a 4T Seagate.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1605052800000}
{"reviewTitle":"Great console (if you can get one at MSRP)","reviewDescription":"Xbox One titles run buttery smooth and hopefully Microsoft will be adding FPS Boost to a LOT more titles that run at 30 fps. If you need to wait out the GPU shortage, then the Series X + Game Pass is the way to go!Also, do NOT buy from scalpers! Let their inventory rot!","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1623888000000}
{"reviewTitle":"product came quick and nicely packaged","reviewDescription":"product came with wrong power cord but it was a quick fix with a razor blade to round to edges of the rubber to fit","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Not much of a upgrade","reviewDescription":"For me It’s the same gaming experience as the xbox one from 2013 with barely noticeable graphic improvements. But load times are sweet and no more lag spikes. Frame rate not much of a difference for now.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"It gets hot.","reviewDescription":"I love the xbox series x.  Games are plenty, and capabilities are endless.  But the machine tends to run hot.  Only negative I can think of.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664323200000}
{"reviewTitle":"Works great no dings or dents","reviewDescription":"Not much to say waited 10 days for an email then it arrived promptly in one piece","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Great so far","reviewDescription":"Exclusives aren’t there yet but the game pass ultimate subscription is a great value as had different games to try out.  Loading is a lot quicker too.My only complaint would be the guide is exactly the same and the controller feels identical which sucks as it doesn’t feel like a next gen but a refresh.  Wish they would have revamped both like sony did","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1607299200000}
{"reviewTitle":"space...","reviewDescription":"its great just like its predecessor but i bought the 1tb version and with only the games in my library most of it is used up already","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652140800000}
{"reviewTitle":"Box not in very good condition","reviewDescription":"The box was pretty beat up, definitely saw some wear and tear but other than that I'm starting it up now and will definitely see the results","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1657497600000}
{"reviewTitle":"Fast shipping but chipped corner","reviewDescription":"Great product and fast shipping but when I opened the box I found that one of the corners on the Xbox was slightly chipped. No significant damage though. Xbox works great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654732800000}
{"reviewTitle":"Team Xbox!!!","reviewDescription":"You can’t go wrong with this Xbox series X!!! I’ve had every Xbox that has come out. This system is so fast and quiet!!! Team Xbox for life.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648857600000}
{"reviewTitle":"Box was damaged","reviewDescription":"The box the product came in was damaged but other than that the product was in great condition","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662681600000}
{"reviewTitle":"little over priced but better than others","reviewDescription":"the price was higher than regular but cheaper than others I have seen. the shipping was super fast and everything was packaged very well and in working condition.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642550400000}
{"reviewTitle":"It’s real.","reviewDescription":"It’s legit. The system is great definitely get one. It’s a night and day difference from my old Xbox one s. Load times are so fast that it’s honestly ridiculous.I gave 4\/5 stars because I disagree in the extra $365 that got from me but whatever","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1630368000000}
{"reviewTitle":"Simple…..Save money….build gaming pc","reviewDescription":"Save your money….build a gaming PC. This is just another console that will last a few years then become slow and unable to be upgraded once again.Move along, nothing to see here.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1626652800000}
{"reviewTitle":"Doesn't play at all","reviewDescription":"Microsoft missed the ball and rushed to beat PS5, Sony delivered today, MS did not show up.","isVerified":false,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1604966400000}
{"reviewTitle":"Why overpriced by $200","reviewDescription":"The product is great but it is over prized by $200 I payed $500 for mine straight out of fredmeyers","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1625961600000}
{"reviewTitle":"XBox Series X - ALREADY SENT FOR REPAIR","reviewDescription":"I decided to “bite the bullet” and pay double for the XBox Series X compared to the retail price in stores. I was a little wary of paying this much (close to $900) and doing so from a third-party, but I just really wanted to experience the next generation of gaming.Everything seemed to be alright when I opened the box. I followed all instructions to set up my XBox and soon enough I was ready to play. I began playing an online game and a couple of minutes into the match my XBox began lagging. Then, my XBox started making a loud rattling type noise and abruptly shut all the way off (perhaps to protect itself?). The controller light was left blinking and not responding. I had a terrible, sick feeling, but I decided to try again. Maybe my internet connection was bad or something? Soon after restarting the system, I began playing again. I checked the connection first and had full signal strength, so it couldn’t be that. I started the same game over again and the same exact thing happened again. I tried a game on a disc next and the same problem occurred. Desperate to play some games, I put up with this nonsense for a couple of days. There were some times where I got in some solid gaming, but the system would always eventually lag, rattle, and shut off. Finally, I reached my mental limit and decided to call XBox. I sent my Series X in to be repaired because thankfully it was still under warranty.I am not going to get on here and berate anyone. I am just extremely disappointed in the whole situation occurring in gaming today: scarcity of consoles, outrageous pricing, etc.My goal I’m writing this is to hopefully make others think twice before giving in and paying way too much for a potentially faulty product.If I could go back and do it over again, I would not make this purchase. I would wait patiently to find a console in the stores for retail price. I cannot help but feel cheated.","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"United States","date":1632614400000}
{"reviewTitle":"Kept turning off","reviewDescription":"The console itself looked to be in great shape. Then I turned it on, the previous owners profile still logged in games still on it (again not a big deal) after a few minutes of it being on the console shut itself off. I updated the console hoping that would remedy the issue and still shuts off after a few minutes.After about the 4th or 5th time of turning the console back on it stayed on for around 20 minutes and then went back to shutting off. Fan was running, and the console didn’t seem to be too hot.It went on to shut off around 8 more times within an hour span. So needless to say within an hour of opening it I packed it back up.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"it is Japanese version","reviewDescription":"I think it's a good product but it is not UAE version so I'll need adapter to connect it and I am not sure if it's going to be under manufacturer's warranty. I gave 2 stars because it was waste of time and effort.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Arab Emirates","date":1721779200000}
{"reviewTitle":"controller?","reviewDescription":"its okay.... it gets super hot and the controller failed after a day...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1718496000000}
{"reviewTitle":"La consola bien el control no sirve","reviewDescription":"La consola funciona perfecto pero el control dejó de funcionar a la hora de estar jugando, no se hace válida la garantía en méxico, efectivamente tienen garantía, pero solo en US, en méxico no aplica","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1716336000000}
{"reviewTitle":"This thing is worth even less than a PS5. Unfortunate","reviewDescription":"This console release is even worse than the PS5 in the sense that it has even less future exclusives. They are trying to price this at a lower rate to compete, but the reality is that after 2 months, you can see that the PS5 is in much higher demand than the XSX. They are smarter about the material since they use matte black, which is way better than some cheap gloss black on the PS5. The issue is the design of this, it is literally a rectangular box. If there's somewhere that you can put it without needing to look at it on a daily basis, that is fine. Otherwise, it's a box sitting around.The performance of this is also not as great as the PS5, but it seems like every generation Microsoft is just a touch behind. Without a current list of exclusive released yet, you are better off staying with the older generation machines until more games come out or stick with a PC.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"Canada","date":1612051200000}
{"reviewTitle":"Not working","reviewDescription":"Console stayed on for 15 minutes and shut down won't turn back on at all fan turns for 30 second and stops","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1705276800000}
{"reviewTitle":"trop cher","reviewDescription":"vraiment trop cher pour la qualité","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1678320000000}
{"reviewTitle":"Maybe box it up?","reviewDescription":"The Xbox is fine, so 2 stars. But I'm deducting 3 stars because it arrived on my doorstep unwrapped! Thankfully it wasn't stolen but the Xmas morning surprise is blown. Oh well","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1667347200000}
{"reviewTitle":"Something blew up inside the moment I turned it on. Now it’s not working","reviewDescription":"I turned on the console and something blew up inside and I could smell something burning. Now it won’t turn on at all","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1666569600000}
{"reviewTitle":"Garbage compare to the PS5","reviewDescription":"Its a decent and powerfull console but cannot compete with the PS5. This one is just taking dust now.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1653523200000}
{"reviewTitle":"DEFECTUOSO","reviewDescription":"El xbox salio defectuoso, se encendia y se apagaba además de que el ventilador no funcionaba bien","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Mexico","date":1704412800000}
{"reviewTitle":"El Xbox no carga correctamente los juegos ni en linea ni los adquiridos con discos.","reviewDescription":"Necesito un apoyo del producto para la garantía.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1700179200000}
{"reviewTitle":"Triste","reviewDescription":"No me gustó que la consola es asiática, todo viene impreso en idioma asiatico y la caja venia demasiado golpeada","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1696204800000}
{"reviewTitle":"Problème avec la console","reviewDescription":"La console s'éteint régulièrement sans raison avec plusieurs jeux différents. Très décevant pour une console de ce prix.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1607817600000}
{"reviewTitle":"needs games","reviewDescription":"Has potential but is not a buy now console","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1609459200000}
