{"reviewTitle":"Lights wake you up at night, software is annoying for neurodivergent people.","reviewDescription":"Honestly the functionality is fine. The speaker works, basic questions can get answered, alarm function is good, connection to Spotify is pretty good, etc. The clock works just fine, but even though it dims at night, it's still way too bright.The review below this paragraph was written for the Echo Pop, but as the software is the same, it 100% applies to this device as well. I dislike the software of the Pop, but the Dot I truly hate as a whole package. Don't put it in a bedroom if you value your sleep at all. We've been awakened several times by lights. Once a bright yellow light came on and we had no idea why. All of our notifications are turned off. When we tried to ask why it glowed yellow, it said it had no answer for that. Apparently updates can make it go bright blue, and it has a few times. The most annoying is when the power goes out. The light can light up several times as it powers back up, then attempts to reconnect, and attempts to reconnect, and attempts to reconnect... (the WiFi gets knocked out, too, so sometimes it can take a while for everything to get moving again). I finally unplugged the thing one night last week when we were having intermittent power outages and the next day I ordered a new clock for the bedroom. (We've had the Dot since April and it is now December, so we've put up with a lot hoping it would get better.) The voice has only come on once in the night, but the lights seem to have a mind of their own. 100% CANNOT recommend for a bedroom.Our issue is the constant tweaking and changing that occurs in the software itself. It really does appear that Alexa is programmed to constantly figure out new ways to bother you. It reminds me of a loud kid's toy that sounds like it's off and then suddenly yells out, \"DON'T YOU WANT TO PLAY WITH ME?!\" Amazon doesn't seem content with allowing Alexa to be something that sits on your desk and functions the way you want it to function, without bothering you in any way. They haven't made something that can just sit on your desk and function the way you ask it to function.We have every single notification turned off, we've turned on \"brief mode\" which is supposed to make Alexa speak as little as possible. Still, no matter what we do, Amazon seems determined to program Alexa to ask us questions for every question we ask, sometimes completely out of left field. It's like the thing gets more and more desperate to be useful beyond the functions we've designated. At first, when asking for the weather today, it would constantly ask if we wanted the weather for the whole week. No. I said today because I want today's weather. Eventually that stopped, but then it started asking completely random stuff. The most recent one was, after asking the weather, it asked if I want to be updated on new movies as they come out. What? It's ridiculous. If I want the weather, now I just Google it.Setting timers, same thing. You'd think set a timer, how easy it is. No, it asks questions about entertaining you while you wait. Or other random things that have nothing to do with what you just asked. No, please just set a timer. If I don't have one handy and I need a timer now, I just have Google do it.My daughter was really enjoying asking how many days until Christmas and her birthday, and for a long time, Alexa would give the number of days. Now it has switched to months and weeks. I didn't ask how long until this event. We specify \"how many days\" and now no matter how I ask the question, some programming change has made it impossible to get the number of days. My daughter's little morning ritual is gone. She loved asking and hearing the reply, but now I just Google it and she's learning to read the numbers instead. Even with those very simple questions, though, it would ask things like \"would you like to hear a Christmas joke?\" No. I just want to be told the number of days and then have the device go quiet.There are many other little issues here and there. For a while, brief mode seemed to stop all of that, but it's back full force and I can't figure out how to shut it off. Probably many neurotypical people won't understand how stressful it feels, but not knowing if the device will just be silent after I ask my question, and never knowing what it will say or ask makes me never want to use it. My autistic son unplugged his because he couldn't stand it, either. I thought it would be so helpful, and I bought multiples for our house, but honestly there are plenty of other options out there for all of the functionality of this thing when I need it. I was hoping it could be centralized in one thing, but in their desperation to make the Alexa devices oh-so-useful and indispensable, Amazon has made them annoying, especially for anyone with any kind of neurodivergence.","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Tried two of these, both are Echo Duds!","reviewDescription":"Updated: Shortly after writing my review, Amazon reached out to me to better understand what was going on with my Echo. They were very nice, but didn’t have any suggestions on how to fix my issue. Since I had them on the phone, I asked to do another exchange, which they agreed to. I am now on my third one and I still have the exact same issues. I have, however, learned how to get my Echo to play music. I ask as though I’m asking another device to play music on this one. So instead of just asking it to play, I tell it to play (Beethoven) on my Kitchen Echo Dud. As long as I request it by device name then it will play on that device. If I forget then I get the same message that that device is offline.Original: I love my Echo products and have a house full of them - with and without screens. However, this generation of Echo Dot with clock seems to be buggy.I bought this one during the holiday season. Right out of the box, I had problems. Set up went without a hitch, and everything seemed to be working other than using it to play music. No matter what streaming service I used, I'd ask it to play something and it would respond appropriately (ie playing Beethoven on Apple Music.) Then there would be a pause, nothing would happen, and then it would say \"Sorry, that device is offline.\" I could then ask it for my news or anything else that would require an internet connection, and it worked just fine.  I could also go to another Echo device and ask it to play music everywhere or on the Echo Dud, and it would play. I assumed there would be a software update that would fix everything so I didn't worry about it right away, and frankly, I almost completely forgot about that device. Luckily, I remembered that I should follow up on it before my extended holiday return window closed. It still wasn't playing music but everything else worked. I rebooted, I did a factory reset - all with the same results, so I called customer service for answers on how to fix this. He had me do all the same steps, again with the same results, then had me box it up to return and they sent me a replacement.I was disappointed to learn that Amazon didn't send me a brand new Echo, but a refurbished one. I regretted involving customer service then, because I could have just initiated my own exchange and gotten a new one since I was still within the return window. However, the replacement did work as expected, so I swallowed my disappointment.I have now been using this Echo Dud with clock for about four months. I primarily use this one for adding items to my shopping list or setting timers.  Perhaps a couple times a month I ask it to play music too. I'm not sure exactly when that feature stopped working, but once again it says it will play and then says the device is offline. Everything else that requires internet continues to function, and I can initiate music playback by asking another device to play on that one. I've tried to reboot and factory reset with no changes in the results.I don't know what is wrong with this device, but I'd steer clear of this generation!","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"Cannot turn off \"Connected to . . .\" announcement.  Detailed user manual costs extra.","reviewDescription":"Like so much technology, in order to make life \"easier,\" the Amazon Echo Dot with Clock (Fifth Generation) makes things much more complicated . . . and expensive.The instructions provided with the Echo Dot are very basic.A user manual that apparently gives a full overview of how to use the device costs an additional $11.99 - $15.20--through Amazon.When the device connects to my computer, tablet, or mobile telephone (which is often several times an hour), it makes an announcement \"Now connected to . . .\"--that cannot be disabled.  (Over time, I have come to find this feature incredibly annoying.)I have read several other Echo Dot owners complain about this issue and say it would be quite simple for Amazon to make it possible to disable this feature.However, the only answer I have received from Amazon Staff through its \"Digital and Device Forum\" for the Echo Dot with Clock is:  \"currently this feature can not be disabled.\"For the price, the speaker's sound quality is quite good--but not great.I spend far more time dealing with problems the Echo Dot creates than it ever saves me.If I could make the decision over again, I would not buy this device.  It creates more problems than it solves.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Mixed bag, pros and cons, heavy on the cons","reviewDescription":"We wanted to love these and we ordered six during prime day, as part of an effort to ramp up smart home automation. We replaced several older dots.The good: they look nice, they sound good, the visual display is a nice touch.The bad:- the listening ability is wonky on all of them. Sometimes they hear commands, often not. We end up shouting and\/or repeating.- they’re supposed to be able to detect occupancy. This was clutch for us for automations and a big part of why we upgraded. It works well on exactly ONE of the dots we bought. Four are intermittent, and one just didn’t work at all (after all the troubleshooting, sensitivity settings, etc). Which brings me to—- poor customer service. To return the one non-functional one (overlooking the frustration at the intermittent ones), we had to follow a unique process, pack up part of the kit, and the rep I spoke with on the phone sounded exhausted and angry. It was time consuming and confusing, but eventually we got a return authorization. We waited to send back until we got a replacement. Replacement took forever; received yesterday and, surprise!, its occupancy detection is not fully functional (it’s intermittent). I think we are going to give up, keep it, and spend additional money to get motion sensors (requiring another hub).We’re super disappointed in not only these devices but in Amazon. We are also bummed out that we’ve now made a big investment in these and other smart devices based on using Alexa as the backbone for smart home, and that seems like it was a mistake. We were hoping for dots that did what they said they’d do, good support, and easy integrations. The first two are a “no” and the third one is also hit or miss, but in many cases that is down to third party devs and the confusing ecosystem of smart home infrastructures.Giving two stars instead of one because the good characteristics are good.===Updated: changed from a two-star review to a one-star review. More of these did not work as expected (occupancy sensing), and the return experience with Amazon has gone from \"pretty good\" to \"OMG this is insanely bad\". We buy a lot from Amazon and rarely return things, so maybe this has been an issue for a while, and I'm just finding out about it.In any case: if you're planning to use these as speakers, great. If you want to use them to interact with Alexa, they are less-good than the old Gen3 dots. If you want to use them for smart home automation based on sensing, they are absolutely worthless: save your upgrade money and get some standalone motion or occupancy sensors instead.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"Jeff Bezos, your customers deserve better!","reviewDescription":"As far as Alexa devices go, this thing is more Fred flintstone than it is George Jetson. Seriously, how is this an improvement?? I've owned several iterations of Alexa, and this one is by far the worst. It really feels like a huge step backwards. I rarely write bad reviews, but this thing is a heaping pile of trash, so it is well deserved. And now I hear that Amazon is planning to bill us monthly for using Alexa?? Consider me gone if that happens, but I digress…I have several complaints, but the biggest is that it only works about half the time. The rest of the time, when I give it commands, I am met with an extremely annoying response saying, “I'm sorry I didn't get that, the internet isn't reachable”. This is completely false, since all the other devices in my house are working perfectly, including my other, older versions, of Alexa! This is the only version to ever do this to me (along with the countless other poor souls that have also experienced it), and even resetting it and my router (unplugging and plugging back in), doesn’t fix it. It eventually fixes itself after about ten minutes, but not before peak irritation level is achieved.As if this weren’t bad enough, the thing is just ugly. It looks like it should have been the very first demo version of Alexa, the one that existed in the olden times, long before LCD screens existed. And what’s with the big ugly block font it uses? Is it made for a child? Very bizarre design choices.In truth, I'm actually a big supporter of Amazon, and I even admire Mr. Bezos and what he has built, but feelings can change. I am probably going to switch to a different brand as soon as I have some time to shop better options.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Echo Dot 5th generation","reviewDescription":"just bought the alexa eco dot 5TH Genetation,got the device was so excited but when i whent to set it up, it paired with my bluetooth, but would not connect to my wifi, called customer service, the lady barely could speak english good an spoke really fast, finally got her slow down an speak planer,, followed her adivce to set up my alexa, nothing was working,i was talking to her with my bluetooth earbuds on , which i'm able to connect with two divices, so i thought it was because i was on my earbuds that nothing was working, so i disconnected my earbuds an now the alexa disconnets from bluetooth  also an now will not reconnect to my bluetooth meanwhilethe lady i'm talking begins to ignor me when i'm trying to talk to her, very disrespectful, i'm returing this because it wont even connect to my bluetooth now or wifi. i wish i could 0, stars so i guess you get 1 star, but i'm giving customer service a big fat 0 stars.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Always plays on wrong floors","reviewDescription":"When I ask Alexa to play on the second floor, it responds that it will be playing XXX and starts playing on the wrong floor. That is infuriating because I do have Echos in my kids rooms and they can be sleeping.Called some service guys who replied instead of calling my husband. It just tries to autocorrect the name if it doesn’t know the name. My husband had a pretty common Eastern European name WTF, why do I need to rename it in my contacts as husbandRefuses to play * do you know the ice cream man * but plays Die Antwoord because of kids settings. lol Die Antwoord is super explicit.Doesn’t sync up process for Audiable, often when I play my book later in a car it’s just playing whatever missing my progress from Alexa and it’s super hard to find where are you at.When you ask to play XXX podcast normally you want the most recent and not a half played podcast from a year ago.Playing bands with wrong spelling is a nightmare. Does not allow me to dictate the spelling.When you change your phone you need to sync your device again even if you have Alexa pp one there, I kinda assumed that if your account is open you can still play music from your phone anyways.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Defective item, less that 3 weeks of use.","reviewDescription":"My Echo Dot  arrived on July 17. It was on sale and I was super excited about it. It worked perfectly until August 10 when the connecting blue light started spinning. I disconnected the equipment, waited a couple of seconds ( and minutes) and tried to connect it again, this did not work. I pressed the action button as instructed, this did not work. I tried reseting it, again……. It did not work. I read if non of that worked, to deregister Echo and start registration again. Nope……. Did not work.  I tried to start a replacement claim and it instructed me to contact  costumer services. I disconnected my Echo all night, hopping that it was going to reset by morning. Guess what? IT DID NOT WORK. I contacted costumer services and to my surprise, they said I had to start a trade in process as as i had deregisterd the echo from my alexa app. I was frustrated and told the agent that this was a NEW item, that had  3 weeks of use.  I do not want a refund, i dont want. Trade in, i just want my item replaced. She said that because Echo was deregistered, my only choice was to buy another one and wait for the refund. I told her that i was going to retun the defective item and get my refund to buy another one at a retail store where it would have been easier to get it replaces if defective. She stated that the only way my money would be refunded was if I buy a new one with them.I am very disappointed  and upset. Of corse i will get back what i paid as it was on sale, but i had to buy new one  at full price. If i wanted to pay full price, why would I wait for a sale. It would have been fair to just REPLACE my defective item!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"Bought it to get rid of the glitches of the old one. This one glitches just as bad","reviewDescription":"This very well may be the last alexa I’ll ever purchase, in a bad way. They are so ridiculously glitchy that I end up having to restart them daily. I have to repeat commands a minimum of 3 times, alarms going off is unreliable, and you know the spinny wheel of death on a computer? Well, beware of the spinny light of death from Alexa where she lights up, thinks for about a minute, then just ignores you. Bonus! She’s terrible at recognizing commands. No, I don’t want to add “lights condo” to my shopping list when I slowly tell you to turn my lights on and to daylight.But hey, if you like being woken up in the middle of the night with a random ad for Amazon music, go for it I guess.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Waste of money, for me anyway.","reviewDescription":"I was only using this as a night light, for the clock and occasional music from my iphone but I keep having to pull the plug because this thing just starts to play random music and tonight it was some horrible rap music which was very intrusive and scary. It was originally connected to my iphone but when I bought an S24 Ultra I did not bother connecting it to the Echo. I just can't trust this thing to behave. It will go weeks without any trouble and then it goes off on it's own. I tried all the fixes but it is just defective. We have the original Amazon Echo downstairs which never gives us a problem. $40 down the drain.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"3rd one that has failed","reviewDescription":"I have many Echo devices (10), but the Echo Dot with clock is the only one that has failed over and over.  Each time has been a failure in the same way.  It listens to a command but doesn't execute the command.  The blue ring keeps circling and then it goes off after a few more seconds and does nothing.  If I repeat the command, it may do the same thing again.  Sometimes it takes 4 or 5 attempts before it will execute the command, when I have the patience for it.The first one I thought it was locking up so I would unplug it, wait for it to boot up and then it would work...that time.  But the alarm the next morning may exhibit the same behavior of not responding.  After a couple months, I replaced it and threw out the defective one.  The next one worked fine for several months but then started doing the same thing.  This time I thought maybe it was my wireless connection that wasn't strong enough in my bedroom, even though this didn't make sense since I had a router just 25 feet away.  But it was an extender and I thought it sometimes disconnected from the main router.  But again, everytime I unplugged the echo, it would work again right after it booted up.  I threw it out and bought another as a black friday deal.This third one I felt good about.  I had just upgraded the house wifi to about the best money can buy.  Netgear Orbi WiFi 7 with wired satellite mesh extender.  No chance of bad wifi signal now.  But the echo started malfunctioning almost right away.It's extremely irritating when you try to snooze the morning alarm and it just keeps going off with a blue ring and doing nothing.  Ok....so no more snoozing with this echo.Final test to confirm this echo is absolute garbage....I put another echo right next to it.  This was an echo 4th gen with premium sound I moved from the bonus room.  The wake word for it was changed to ziggy.  So now when I get the malfunction on the echo dot, I use the ziggy wake word and repeat the command.  I have never had an issue with the command on the bigger echo sitting right next to it.Amazon, you need to fix this device.  It is garbage.  I love the other 9 different model echo devices I have but this one is pure crap.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Good but flawed","reviewDescription":"I purchased this in hopes to use it bedside as an alarm clock and bluetooth speaker primarily and as an Alexa assistant secondary.  Unfortunately this has failed for both my primary needs.  With respect to an alarm clock, the display at it's lowest setting is just too bright.  I have a tough time understanding why the user cannot dial down the brightness a few more levels.  Worse yet, the bluetooth design of this device is the worst I've experienced simply because it feels the need to announce the device it's playing from each time.  I have my phone connected to this every night to play white noise while I sleep.  My partner sleeps in later than I do and if I'm awake in another part of the house and open an app (tumblr, google, etc) that could utilize this speaker it announces in a loud voice \"Now playing from iPhone....\"  Even if I'm in an article that has an ad (with my phone sound off) that COULD play sound but does not it makes this announcement and wakes up my partner.  Worse yet, if I realize that I need to disconnect the phone from the dot before it makes the announcement, the dot plays a noise when I disconnect.  I have stopped using this device due to these reasons.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"I hate this thing.","reviewDescription":"I bought this in lieu of a wake up light alarm clock because I couldn't find one that was also a Bluetooth speaker for less than $100. But I hate it. I've had it several months and find it to be just as inconvenient and as much a hassle as any of the cheap wake up light clocks I ever tried.No matter how many settings I adjust and play with, the light just turns on to a set brightness, there is no gradual increase. I've tried on both the Alexa app and the Hue app.I do NOT want Alexa to tell me she is connected to my phone. I don't want her to tell me when I initially connect, nor do I want her to SCREAM it at 2 am because I rolled over and checked my phone. Because yes, if you wake your phone up she will again tell you she is connected. She also WILL NOT execute play, skip, pause, resume commands if you're using Spotify. She will instead open Amazon Music. Even though I have Spotify set as my default.I have tried seven hundred ways to tell her to stop my alarm, but every single time, she then asks me if I'd like to cancel ALLL my alarms. No. No I do not. And why would I want to? I have even asked her directly how to make her stop asking me.I also tried to get my alarm to stop going off at a certain time and switch to playing NPR Radio to no avail.I have scoured the internet for solutions to these problems and I am not alone in my irritation, there is apparently no way to make her stop doing these things. I have turned off hunches, I have brief mode on, and whisper mode. My husband is a programmer and even he can't figure this thing out. I wish I had stuck to my cheap (but clunky) wake up light alarm and separate Bluetooth speaker. I didn't want to have to open an app every morning to turn my alarm off and disconnect my Bluetooth. But that's what I ended up with.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Still not great","reviewDescription":"I had the 1st generation Echo Clock and I decided to trade it for this newest generation because of f long-term connectivity issues.  All my Echo Dots will come back online when the internet drops for updates overnight. It approved a lot over time with the 1st generation,  but it wasn't 100%. The description for the latest generation even alluded to improved connectivity,  so I decided to upgrade. That was a huge mistake. While this new clock was perfect with perfect connectivity when I received it in November  2023, its connectivity has somehow degraded over the past month or so. Did Amazon update the software that supports it? I don't have insight to that. But I wasted $ upgrading my Echo Clock. This is simply frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Worst Echo in our home and we have a lot.","reviewDescription":"First, the only good thing I can say for this echo is that it is aesthetically pleasing. BUT, it has a very hard time hearing. I have to yell at it several times to get a response. I've only owned it 6 months and I'm so tired of having to scream at it like it needs hearing aids. Secondly, I bought this to go beside the bed since it has a clock and doesn't take up too much space on the nightstand.  But, that doesn't work because the clock is so bright it lights up the whole room and makes a bright light in your face if you turn toward it's face. I have asked it to dim it's light but it says \"Sorry, I can't do that.\"  I have turned the clock feature off for this reason, so that those two issues pretty much takes away the main purposes for buying this particular Echo.  I much prefer the Echo spot that I had before. Unfortunatly, I gave it away thinking I was upgrading. So, I definitely do not recommend this newest echo version. Definitely not worth $59.99.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Not the same Alexa that once was","reviewDescription":"A real good way to get me to pull the power plug or contemplate chunking all of my Alexa devices into the trash is to give me bullish ads after my commands that won't even respond to input until after the marketing ploy is done.  That is bad enough but to also give me the ads at max volume level is just a new low, don't you think?  Enough is enough!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Inconsistent responses to voice commands","reviewDescription":"I was expecting a lot from Alexa devices. But she doesn’t respond well to anything but the most basic commands. And sometimes not even those. Like “ Alexa STOP”. It doesn’t do Internet searches. If you have other devices, like a door lock. Sometimes it will open other times it won’t. Talking with the door lock company they say it is a Amazon problem. And I would agree because the door locks own app works EVERY TIME! Even from miles away. Sometimes Alexa says “Sorry the light isn’t responding “ when it does!Very frustrating and most printed documentation is out of date. Even  Amazon’s own in app instructions.Do yourself a favor and wait for a new generation software. Probably one that is a major rework. One after 2024.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Everything is great except brightness and Alexa can’t hear me","reviewDescription":"I work at night and sleep during the day. I have blocked all light from my room, except the Echo Dot.I have to completely turn off the LED display to not be disturbed by the irritating white light while I sleep, even on its lowest setting. There isn’t even an option to change the color of the LED to something less intense, like an orange or a red.Please Amazon, either expand the spectrum of brightness to include even dimmer options, or introduce a different color for use at night. I want to be able to check the time at any time of the day, including if I wake up in the middle on my sleeping time. Anything except that LED bright white light. Please.Another slight complaint is that I have to practically yell across my bedroom to get Alexa to pick up my voice.Once she actually hears me, it works amazing. Please fix those two things. I really want to change my review since everything else works so well.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1701475200000}
{"reviewTitle":"Not hearing commands","reviewDescription":"Plays well but I dislike that I have to shout Alexa louder than my older version for it to actually hear what I'm saying. This version is like a deaf version to me. I'm not sure if it's my specific device since I don't see anyone complaining about there Alexa not hearing commands","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Came one broken","reviewDescription":"I've bought several versions of Amazon Echo Dot and usually, it comes unbroken, but one of these that I've got was broken :(. Alex sometimes picks up when I'm not calling her and it's kind of annoying. It's kind of sensitive, but nonetheless it does the job when I need it to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Difficult to set up harder to make it work  Liked the original Alexa better","reviewDescription":"Not using for much of anything..  The old triangular show has been the best.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Looks nice but worse quality than older gens","reviewDescription":"Microphone is clearly cheaper than previous versions; my 3rd Gen can pickup my voice when this one you can't. It's frustrating as I wanted something exactly like this.  Wish it worked","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Doesn't ring for doorbell (ring)","reviewDescription":"It works like a speaker, and does connect to our ring doorbell, but it doesn't ring when we press the doorbell. It does notify us when it detects motion, but doesn't ring consistently. It rang a few times here and here, but not all the time. We ended up having to buy a chime so that we can hear the ring.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"So many problems","reviewDescription":"This rarely works for me. Have issues where it says it’s playing but no sound comes on, alarms won’t turn off. One time it started playing brockhampton and kids bob at the same time and wouldn’t stop or turn down the volume. Had to pull the plug. In fact I have to pull the plug on this almost weekly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Horrible display features and lack of settings","reviewDescription":"This is not an improvement over the Dot 4. The display style is terrible for those with visual or sensory processing issues. Also it scrolls the title of every song, audiblebook, etc. And I mean the whole title, chapter, etc. If you want to see the clock, too bad. Worse, it does this every time you do anything. So, if, for example, you back your audiobook up a minute or two, which I do all the time, it starts over again with the long scrolling display. They have got to give people more display setting options to let you turn the stuff off and let people adjust the display more for accessibility issues. Shame on you, Amazon, for making a less accessible device. The sound is better, but the display oddities and lack of settings to make choices about what scrolls makes this \"upgrade\" a poor one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"Apple Music","reviewDescription":"First, the speaker itself looks nice, and the setup was pretty easy. The sound quality is good also. However, if you’re buying this speaker solely for the music playing part, it works good with Amazon music, but with Apple music it’s definitely a pain. Its “relationship” with Apple music isn’t great at all. I’ve had many problems. Also, sometimes Alexa isn’t cooperative! I’ve been noticing that she’s been going blank after I task or say something. This literally defeats the purpose of “Alexa”. Honestly, the speaker was a disappointment. I would really like to return it. I could’ve bought a different speaker and been a lot more satisfied.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Speakers fail","reviewDescription":"Bought this in May of 2023. Loved it and used it almost everyday. Now the speaker in it sounds like everything is in a bath tub. It's unfortunate","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Faulty after a year.","reviewDescription":"Great product but visuals stopped working after a year.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Disappointed","reviewDescription":"We just unpacked our new blue Dot.......We are very disappointed that the 5th generation does not have an audio out plug.  We wanted to be able to plug it into our stereo system which has incredible speakers.Unfortunately we didn't unpack it until today and now it's too late to return.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Stopped connecting to internet","reviewDescription":"Bought for Christmas present, started issues within a month. Factory reset, \"regular reset\", every trouble shooting I could find and won't stay connected to internet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Impressive All-in-One Smart Assistant","reviewDescription":"I recently purchased the Amazon Echo Dot (5th Gen) with clock in Glacier White, and it has exceeded my expectations. The standout feature is undoubtedly the enhanced LED display, which adapts seamlessly to ambient lighting – a sleek touch that adds both functionality and aesthetic appeal.The sound quality of this compact smart speaker is remarkable, especially considering its affordable price. Alexa's voice comes through crisp and clear, making it a fantastic addition to any room without compromising on audio performance.Whether I need to check the time at a glance, set timers, or get real-time weather updates, the LED display proves to be a handy feature. The device seamlessly integrates into my daily routine, and the Glacier White finish adds a touch of elegance to its design.The Amazon Echo Dot (5th Gen) with clock is a stellar choice for those seeking a budget-friendly, feature-rich smart speaker. Its adaptive LED display and impressive sound quality make it a standout device in its category. Highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"I am continually amazed","reviewDescription":"The only assistant that I’ve ever had as a separate device was a Google assistant, and a store brand at that. I never used it for much, and it didn’t seem very capable of anything. Over the holidays I ordered an Alexa Dot with the added smart bulb. Wow! Pairing everything took a little work, but once that was done I was off and running. The different routines you can create are wonderful! I liked them so much I ordered 2 more. 2 of them are in rooms with smart bulbs. One is programmed to turn on at a certain time on these dark mornings. Both are programmed to turn off at night and to be turned on by sound and turned off if no one is in the room.There is surely a ton more these things are capable of. They’ll tell you your inside temperature, and you can name each room any silly thing you want. I’ve used the announcements, broadcast, and a few other features. It’s also remarkably helpful when answering questions. That’s been a big plus as well. The sound quality is nice, and they are pleasant to look at. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Works as expected plus great sound!","reviewDescription":"Use this in the bathroom, I like how it shows the time and plays great sounding music.  It’s much smaller than the 4th generation premium audio echo so its not the best sounding but the low price and small size makes it worth the sacrifice in sound!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Great echo dot!!","reviewDescription":"Our daily house helper, is this great echo dot device. We order several chores to the dot daily, reminders, pay bills, play songs, say jokes, help with weather, and what no. It has clear sound, loud enough for the living room, easy to use. It’s a helpful device for a minimal price. Worth buying, highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Great help and fun to use","reviewDescription":"The product is great when you come in the front door and it's dark in the house, just yell \"Alexa lights on\" and all the lights are on.  It's great as an intercom system and you can play music throughout the house with multiple dots.  At first I wasn't sure I wanted Alexa listening, there is a button to turn off the listening capability if you desire.  Pairs easily with Amazon smart plug, and Blink cameras.  All in all a great item!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"A perfect blend of form and function","reviewDescription":"The Cloud Blue Echo Dot (5th Gen, 2022 release) has completely changed my daily routine by integrating cutting-edge technology into an elegant form factor. This smart speaker has been an invaluable addition to my home, providing me with the services of Alexa as well as serving as a stylish and practical clock.I was immediately drawn to the Cloud Blue hue of my new Echo Dot with clock because of how softly it injects a burst of energy into any room. The device's compact size makes it suitable for use in any room of the house, from the bedroom to the kitchen. Amazon's commitment to offering products that complement a wide range of aesthetic preferences is reflected in the subtlety of this one.This smart speaker stands out from the crowd because to its built-in LED clock display. This seemingly minor modification has transformed my Echo Dot from a simple alarm clock into a multifunctional wristwatch. The LED display is easy to read from across the room, and its brightness can be adjusted so that it doesn't keep me up at night. Having the ability to switch between a 12-hour and 24-hour clock face as well as adjusting the clock's brightness is a nice touch.The Echo Dot's brilliance lies in its voice-activated functions, which are made possible by Alexa. Setting alarms, checking the weather, listening to music, and controlling smart home equipment may all be done with just a few phrases. The sound from the 5th generation Echo Dot is superior to those of its predecessors, filling the room with music that is both crisp and balanced. Whether I'm listening to my go-to podcast or a constantly evolving playlist, the Echo Dot always delivers excellent sound quality.Voice control is surprisingly reliable because to the system's several microphones, which allow Alexa to hear my commands even in noisy environments. I was blown away by how well the voice recognition worked. It almost never fails to comply with my demands and provides instant feedback. The Echo Dot has become an indispensable device, allowing me to effortlessly access information, schedule updates, and entertainment.Since privacy and security are so important in today's interconnected world, I am overjoyed by the privacy safeguards Amazon has implemented in the Echo Dot. The ability to switch off the microphones is a convenient feature that allows me to enjoy some peace and quiet whenever I need it. Amazon's openness about data usage and the ability to review and delete voice recordings via the Alexa app are further indications of the company's commitment to user control and data protection.Setting up the Echo Dot was a breeze with the help of the intuitive Alexa app, which took me through the process. The process of linking the device to my Wi-Fi network and making my desired adjustments was quick and painless. The Echo Dot is a good long-term investment because Amazon regularly updates its software to include the most recent features and enhancements.The Echo Dot (5th Gen, 2022) with clock is a great example of smart technology that has been simplified to perform a single, specific task in a time when smart technology may sometimes seem overwhelming. The combination of a high-tech watch and Alexa's brainpower has made my regular tasks much more manageable and enjoyable. The Echo Dot adapts easily to my needs, whether I'm setting an alarm to gently wake me up in the morning or just listening to my favorite music. This smart speaker has seamlessly integrated into my life at home and become an essential tool. The Echo Dot with clock has undeniably merited its five-star rating for its top-notch functionality, sleek design, and helpful contribution to today's simplified lifestyle.","isVerified":true,"ratingScore":5,"reviewReaction":"163 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Great Surprise","reviewDescription":"I wasn't sure about this as I have never had Echo Dot before. I ordered the one with a clock. I have only had it  a few days but I love it The sound is GREAT and she answers everything. I have just been having fun with her. I use it in my bedroom as I needed a clock and alarm plus she plays music anytime I want it. It's just FUN and helpful","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Replaced my 20 year old alarm clock","reviewDescription":"Ok it actually replaces the alarm clock my husband already owned 21 years ago, which was a gift to himself - a bose with a cd player.  Over the years we gave up on choosing cds so its been teh same cd for the alarm for a decade, which he complained about but was not willing to choose a cd.  Meanwhile it got harder and harder to see the time - not sure if my eyes got older or if the leds started to die.  but it got to the point where this thing takes up SO much space on my bedside table and is regularly annoying me.I dont have any other amazon alexa items.  I just was getting used to google assistant on my pixel.  But this little speaker was super easy to set up.  I only have the free amazon prime music with my prime account, but I was able to tell the dot to set an alarm for 7 am and play a song by (one of my husband's favorite artists), and then go into my phone and make it repeat for weekdays.  So, i wont have to remember to turn it on and off every friday\/sunday.  Woot!He didnt seem to appreciate it (grumpy old man) tho he did admit it was easier to wake up to a song he actually likes.  and i realized I can listen to NPR while i do any cleaning in my room.We all dont really like noise - we rarely watch a show together and all of us use headphones in public spaces.  So i cant imagine getting more of these.  But as a replacement for a 21 year old Bose CD alarm clock? I think its a HUGE upgrade!  Easier to read by a huge margin, too.Oh and it glowed yellow and i was panicking - that was too bright for sleeping - but all good, it was just telling me my amazon packages were delivered.Now I need to go check out some sleep activities!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Would purchase again","reviewDescription":"Update 3\/10\/2024 - Item is being returned even after doing a factory reset it would not continue to play Amazon Music without constant interruptions.  However, I do want to call out the Tech Support person Vijay who spent quite a bit of time assisting via a chat.  Very patient and helpful.  Thank you!Update 3\/8\/2024 - I would not purchase this item again nor any of the Amazon devices based on the issues with this item and the poor technical support I've received thus far.  I've moved it to 4 different places in my home, rebooted it & my home network.  It continues to randomly turn off when playing Amazon Music.  I'm not having issues with any other device and do not have many devices running.  I've asked for it to turn off after a certain number of hours and also, as tech support suggested, even asked to play in an endless loop (which as I told them made no sense).  Also ensured my Alexa software is updated.  Seems this is a known issue with this item. I'm going to do a factory reset which is all that's left other than returning it.....which will be the first time I've had to return anything I've ordered.  I hope the return process is easier than this has been.Update 2\/11 - This Echo still does not continue playing music as expected.  I can give a turn off command of a XX hours and it will turn off way before then.  I've restarted it, moved it, etc and still continues to be problematic.  It can not be my network as this is the only device I have an issue with.This is the first Echo product I've purchased. and I must admit the sound from this is very nice.  My primary use of it is to play music and it sounds excellent.  I am having a problem with the music shutting off.  No rhyme nor reason nor specific amount of time.  I've just tested it to see if i can give a turn off time \"Alexa turn music off at XXXX time\" so see if that helps.  I have no issues with my WiFi and have very few devices running so can't be the issue.  Lastly and most importantly, my dog is afraid of the Alexa voice coming from the Echo.  I've tried to acclimate her slowly and introduce her to the sound of it (with the music) without her hearing Alexa voice.  She does ok until she hears Alexa voice and she's still afraid of it.  I have to be cognizant of her whereabouts when using it.  I've read about other dogs being afraid - not sure if it's frequency or Alexa voice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Quality sound for small size","reviewDescription":"Purchased as an aid to senior parent living on their own and the options to add 10 contacts to call cell#s is great. The ability to have voice recognition, for daily reminders, questions on where a movie is streaming, who was in this movie? Weather information live time, news updates, Alexa is my backup companion for mom. She is getting used to all the things capable as we just set it up 3\/10\/24 and the Prime music sounds fantastic. She already has a Bose sound system for her TV so she was pleased with the clarity and pure sound of the tiny speaker.  She said Alexa, I love you...and a heart lit up and Alexa sang a super cute song back. She laughed at the AI abilities and is glad for the addition to help add items to a grocery list etc. Great little DOT.  We have the original Alexa Echo taller round tower and now being on same account I can send an announcement to that one if necessary. really nice for $59.00 too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Greatly disappointed","reviewDescription":"My engagement with the product under consideration has been marked by profound disappointment. Having purchased said product (two to be exact) in March 2023, my initial enthusiasm stemmed from a prior positive encounter with an earlier iteration that had been gifted to me by a relative. However, the two products I purchased failed to measure up to my expectations.Foremost among the setbacks was the product's persistent inability to establish a connection with my WiFi network. This led me to engage my service provider, whose extensive troubleshooting endeavors unequivocally attributed the issue to the product itself. Regrettably, despite their conscientious efforts, a resolution remained elusive. Subsequent recourse to the product's customer service department yielded a similar outcome: both products I had acquired were indeed flawed per the customer representative's attempt to rectify the issue.Of equal perturbation is not solely the inherent flaw of the products in question, but also the circuitous and convoluted refund process. What was once a straightforward refund procedure has now transformed into a profoundly arduous ordeal to receive my money. This unfortunate state of affairs stands in stark contrast to my years of being an Amazon customer. Regrettably, this situation has left an indelible negative impression, compounded by recent reviews highlighting the persistence of similar concerns\/dissatisfaction among other customers.In conclusion, this sequence of events has engendered a discernible disaffection and disillusionment that contradicts the previously solid foundation of trust and satisfaction I had cultivated as an Amazon Prime subscriber.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Loses Volume - Amazon FIX the Problem!","reviewDescription":"Clock Keep Losing Volume. Took a loss on 4th Gen clock to buy the 5th Gen Echo Dot Clock and it has the same problem. No one wants an Alarm clock they can’t Hear! I set it at a level 6 before going to sleep. The base level is a level 3 which it always reverts back to. That level is too soft for an alarm. I’ve slept through several alarms making me late.Amazon, if you are going to sell a product, make sure it works as advertised or FIX THE PROBLEM!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Would have been nice to know that this was only Wi-Fi connectivity to my sound system","reviewDescription":"At what point are you going to update the databanks for this unit it's by far the most favorite it interacts with a lot of products now get it to be able to answer a simple question. JHC I'm not kidding you this thing is going to get thrown into the next snow plow the rating rates the product not the seller he's shifted nicely it was quickly received I have no problem with that it's just a piece of crap and it should have noted that no audio jacks are available","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Avoid at All Costs - Terrible Device","reviewDescription":"Update: The item gets worse day by day, and Amazon is absolutely useless.  I have been going back and forth for almost a year and they constantly want to blame my Wi-Fi, which is not the issue, as this is the only device I seem to have trouble with.  I tested 3 different devices in the same location and only this one either does not connect to the group, or at all.  Continues to cut in and out, and I never know if I am going to make it through a playlist or even a song.Purchased from Best Buy in December and have had constant problems with this device.  It constantly loses the connection to the Wi-Fi.  Having spent hours of written communication with Amazon Tech support, all they could say is it has a weak Wi-Fi signal from my router, however, this is the only device I own that consistently loses communication with the Wi-Fi, my computer, my smart televisions, and my phone never lose the connection, and I am running a Linksys Mesh  System with the router and two extenders, so for the life of me I cannot understand the issue.  I constantly check my Wi-Fi signal and it is strong in all rooms, so my only conclusion is that the device is just no good. I also do not run more than 3 devices at one time.I have decided to add to this that, while a tech support person called me and we discussed the issues, they also told me they would call me back on a certain date and time, and guess what?  Never heard a thing, I'm also concerned about why the review says it is \"Hidden by sensitivity filters\" Does that mean that Amazon is trying to cover up bad reviews?  Hmm, something to think about.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Took advantage of aka baited and caught","reviewDescription":"My wife bought this *and the extended warranty), and she could not set it up as per instructed so, she spent time on hold before the customer service decided to help her (albeit they were probably busy with other buyers of this).After a long talk with the customer service, they finally blamed my internet service (big surprise, and for the record it's Xfinity).So, they told her to call Geekz online which the promptly charged us $175 to connect this thing to our internet.  So, whatever this Dot thing cost, it wound up costing us an extra $175.My advice, DO NOT buy this, as, from what I can tell that all the customer service people will do is send you to another vendor and it will cost you more money than this thing is worth...One other mention, we're seniors on a limited income...  Oh well, I needed to go on a diet anyways.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Can’t find Wi-Fi Network","reviewDescription":"I want to preface this review by saying my Wi-Fi works great and I have many devices connected to my Wi-Fi at all time that work just fine.I ordered this generation 5 Amazon Echo Dot for my wife. We’ve had a generation 3 for years, and thought it could be useful to buy another for our home. After unwrapping it we tried to set it up. We got through most of the set up steps just fine, but once we got to the step to connect it to Wi-Fi, it just sat and searched for well-over the recommended 5 minutes. After this happened, we tried unplugging it and trying again. We got the same result. I then took it into another room, right next to the Wi-Fi router and tried again. No change in the outcome. On the Amazon app, I started going trough their trouble shooting steps. It walked me through factory resetting the device which still didn’t solve the issue. After trying a little longer (this whole process took about 45 minutes up to this point) I gave up and called their help line. The agent was super kind and proceeded to walk me through the same exact steps that I tried before calling. After 30 minutes on the phone the agent couldn’t help me get any results either. They are sending me a replacement and no additional cost. Hopefully the next one works.Update - I received a new one after the exchange and after working with customer care for two hours trying to troubleshoot the problem they still were unable to help. I am returning this item and getting my money back. I would suggest you keep your money and not waste your time with this item.","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"Connecting is impossible!","reviewDescription":"It worked for one day! I got it to replace my years old echo that I love.. for the day this played it does not compare to the sound of my old one. It worked right up until this one came out mmmmm…So disappointed! Even my old tiny dot is better than this! The pop is pretty good but this is horrid! Don’t buy unless you are in the market for days of frustration … not even for good sound.forget connection","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Know the limitations!!","reviewDescription":"I was looking to upgrade my working digital clock\/alarm from the 90's and separate noise machine in favor of one device. My other Echo seemed user friendly and convenient so I chose this. Pro's: cute, clock numbers auto adjust to the light\/dark. That is where it ends. Unfortunately Amazon Prime no longer allows green, white, etc. noise to play for hours or loop. Alexa kindly reminds me of the need to upgrade to the Unlimited plan for that access. Seriously? $40+ for a cute clock plus a monthly fee is not in the budget for those of us on a fixed income. I'll be looking for some type of replacement or wait until Nest Audio comes out with a speaker with integrated clock. BTW, Alexa now shuffles \"and similar music\" into my playlists and\/or stops for no apparent reason. So irritating that I rarely use them any more and miss the enjoyment of listening to the music of my choice. Please check to see what options will be available when considering this item.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Duuuuuhhhhhh","reviewDescription":"I am about tired of this stupid stupid product! Every time I ask her a question she goes I don't know that. And it's ridiculous. What do you mean you don't know that? You are connected to the internet! You absolutely do know that! Search and find the answer! You're just honestly it's just this thing serves no stinking purpose! It's really upsetting me and I'm tired of it it honestly it was cool at first you know I could turn my lights off and on with a schedule or you know whatever but you know all those lights come with a downloadable app that you can do that with this device is absolutely unnecessary seeing as how I can't even search the internet to find the answer that to the question you ask.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705622400000}
{"reviewTitle":"The features I bought it for don't work. Broken app, waste of money.","reviewDescription":"I hoped to use the echo dot to play podcasts and as a clock while I sleep so that I wouldn't have to use my phone. The Alexa app was extremely clunky and unintuitive and while it says you can link with Apple podcasts, in reality it doesn't work. Also doesn't have a native podcast player, so podcasts with this speaker are off the table. There were tons of unnecessary annoying features that I couldn't figure out how to turn off like constant notifications. I won't be using it. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Bought for bedroom because it did not have a screen, but has its own issues","reviewDescription":"Bought for the bedroom to replace an Echo Show.  The Show screen seemed a little too bright at night, so was hoping this would solve the problem.  It didn't.The clock letters are much brighter, even at night.  I tried adjusting the slider under LED Display in the hope that it would solve the problem, but it was not a dimmer; just something referred to as \"will help adaptive brightness learn your preferences.\" Still not sure what that is supposed to mean.Even though the slider has a scale from 0 to10 it does not seem to do anything at all.  I tried 1 for a time and then 10, but neither made any detectable difference in the light levels for light or dark.  I finally had to take a lens from a set of sunglasses and tacked them over the numbers.  That works, but not an elegant fix, so, 3 stars.  As for other features, I would have given it a 5.  If you don't need it for the bedroom I would recommend it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Works great but one real problem.","reviewDescription":"I bought this for my visually impaired father. He loves it. Sounds great. Works easily. But it has one massive problem that really ruin it for visually impaired people. They have a limitation on the number of phone numbers you can call. I’m sure that because it defaults to calling through the internet. But I have it bluetoothed to my dads phone as well and it won’t call through the phone, only through the internet. I don’t understand why they put a cap on the number of phone numbers it can call from. Obviously Alexa to Alexa is free.  But that requires the other person to have one which many will not. It is so simple. “Alexa call”. But he’s blind and cannot see and I had to have him choose 10 phone numbers to use. For any others he has to call a nurse at the assisted living to dial for him. I called their tech support hoping maybe we could pay $5 a month or whatever. Also asked if prime members have this same limitation. And they do. This is a serious hindrance to an early perfect decide for visually impaired people. I guess that’s why the association for the blind in his town recommended the iPhone and apple home pod. But his jitterbug phone bill is $25 a month and his phone was $100. And the echo dot was $60. I love apple ecosystem. But it’s way expensive for a blind man of 93 on a fixed income. We are using the echo dot and it is working for him. But he’s limited to being able to call only 10 of his friends through the device.Second challenge is there is no way for the incoming calls to his cell phone to route through to the echo dot so he can answer the incoming calls to his phone. Even collected through Bluetooth he needs to manipulate the phone which he cannot. On the apple devices this is not a problem. It’s all seamless.It’s too bad. They had a near perfect affordable device. But for whatever reason they decided to impose the 10 number stored limit. Does not seem to be a reason for it. But they did it. Seriously limits and almost perfect affordable device for the blind. Hopefully they will come up with either removing this limitation for print customers or at least a paid service option that would expand this saved number limit.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"echo dot 5th gen","reviewDescription":"My old dot was giving me trouble so I ordered this. Sorry I did. It's in the bedroom. If you wear glasses the time is too small to read without them. And for some weird reason when I try to cancel alarm early it tells me alarm was not set. So I took a piece of paper and wrote \"alarm Set\" on one side and Set Alarm\" on the other. I flip it over so I know if alarm is set or not. It still malfunctions. All my old dots worked fine. This one needs a redo.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Excelente producto, si tienes suscripción y todos los juguetes.","reviewDescription":"Positivo*Configuración intuitiva*Si pagas suscripción tienes una gran librería musical casi sin molesta publicidad.*Si integras otros dispositivos inteligentes en tu hogar, puedes controlarlos por voz.*La intercomunicación con otros dispositivos sirve incluso para llamadas hasta entre países diferentes, como si se tratara de un WhatsApp pero desde la comodidad de tu casa y controlado por voz.* Se integra con tu móvil y sirve como parlante Bluetooth.Negativo:*Sin suscripción a Amazon music es imposible escuchar dos canciones sin publicidad.*La inteligencia artificial de Alexa es muy limitada si se compara con las existentes en el mercado como Chat GPT u Google Bard, entre otras.*La integración con el móvil se limita a funcionar como parlante Bluetooth y no permite controlar otras funciones.*Sin otros dispositivos inteligentes y sin suscripción, el dispositivo se limita a búsquedas por Internet (siempre y cuando entienda lo que buscas) o contar chistes porque incluso la traducción falla bastante y es limitada a palabras sueltas pero con bastante fallo.Le doy tres estrellas por el tema de que sin suscripción es básicamente una molestia usarlo y su inteligencia artificial dista de otros competidores líderes, pero aún tiene valor si tienes los dispositivos inteligentes adecuados.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Works as expected but terrible readout (font)","reviewDescription":"I have multiples of many different Echo products so I am a fan. However, I do not like the fifth generation version. The clock numbers (etc.) are created using a series of dots (asterisks) rather than the smooth, more readable lines in the classier fourth gen. The weird creation of the numbers makes the echo dot look cheap, more like a toy, and more difficult to read. This appears to be a case of \"improving\" something until you finally ruin it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Muffled sound.  Smaller than implied on pics.","reviewDescription":"OK this thing is easy to install and setup, they got that right.However it's the size of a large baseball, or small softball.So don't expect a large digital clock either.As to the muffled sound, it makes the computer woman's voice hard to understand at times.Edit:  I found Bass, Mid, Treble controls on the app.  Will play with those to see if it helps.A new user, so all for now.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"It's OK, kind of a pain to use","reviewDescription":"While I do like the device, the software is atrocious. No offline features whatsoever (not even alarm cancellation so you need to unplug it to stop, so stupid). Settings never stick and I'm constantly reverting them.  Tap gesture is spotty when you need it and never works when you want it. Also hates enabled devices for whatever reason as it has a heck of a time pairing. It's nice but for those issues it's acceptable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"I wanted this for the fan\/ white noise","reviewDescription":"I purchased this really for the box fan\/ white noise. It won’t play the box fan it always wants me to buy something and it will play this ungodly loud noise in the white noise mix that wakes you up. It woke up my grandsons and scared them to boot! Not a fan (pun intended)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Some cons","reviewDescription":"The volume up and down buttons are very hard to press. Also need to tap very hard to pause or resume a song played on the device.Bluetooth pairing is not that great and songs played through YouTube on mobile doesn't have good sound on this device","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Needs upgrade","reviewDescription":"I love the look of it and the time display is perfect but it’s hard to get Alexa’s attention even after the app training and increasing the volume.  Increasing the volume only makes her talk louder, it doesn’t affect the listening for commend function.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"First time buyer and I'm in love","reviewDescription":"First time I ever purchased these and I absolutely love them! Very easy to hook up very easy to use I highly recommend them for anybody especially first time Smart Home integrators.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Increased from 2 GB to 20 GB wifi on phone","reviewDescription":"I had trouble setting up my DOT ECHO and my call to AMAZON was forwarded to a help line. I was told that I had downloads that shouldn't have been done. They explained that for $100 they could clean out the things that were causing the issues and would be able to set up my DOT ECHO with a clean slate, not having to worry about anyone getting my passwords and info. I guess I was dupped, but thinking amazon support forwarded my call to them I thought it would be legit. My wifi usage went from using average 2 GB to 24 GB per month since they \"supposedly\" cleaned out my internet. Can someone help?","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Love these!","reviewDescription":"I have already purchased 4 of these amazing little \"dots\" whenever they went on sale. 2 with the clock display and 2 without. The sound is amazing, which is the main use for me, to listen to my music around the house. I don't have a \"smart home\" or anything like that to connect to it, but the music alone, plus getting the \"daily brief\" in the morning with the weather forecast, news and notifications about any amazon packages that were delivered is worth it for me.I'd like to add that one of the most useful things for me is to ask Alexa to play \"my music\", which was easily set to be my apple music library.  I have also set Alexa to announce tomorrow's weather every evening at 6:30pm and through the app, modified the \"Good morning Alexa\" prompt to remove the \"fun fact\" (which started repeating itself after a while), and to keep the weather for today, added the air quality today and the the daily brief, with the current news updates.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Fun gift for parent who has everything","reviewDescription":"Bought as a gift for elderly parents. Dad loves being able ask Alexia to play music. They also work a jumbo puzzle everyday and now they can just ask Alexa to spell a word without looking it up in a dictionary. It was easy to setup and now information is at their fingertips.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"works great and extends my eero wifi","reviewDescription":"No complaints and works great. Extends my eero wifi as a bonus. Note that at each reboot, the thermometer feature needs to calibrate and might not be available for a few minutes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Works great","reviewDescription":"Got this to replace my old MacBook on my nightstand for white noise & podcasts to fall asleep to.Works great and lots of volume stops so it's not too loud.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Great little device","reviewDescription":"Great for setting reminders, finding out the weather, getting the answer to things like “how many cups in a quart?” Or “what date is Easter this year?”  Or “when is Taylor Swift’s birthday?”Simple to play music too.It understands my voice and my kids very accurately.Now we have 2!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Great","reviewDescription":"I love my echo dot. The clock lets me see at night the time very well. It is program to answer, play music, weather etc that I need for the day","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Love this","reviewDescription":"Easy to set up. Connects easily to my phone and I use it as an alarm as well as speaker. The light makes for an awesome night light as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Nice version for the money","reviewDescription":"For $29 this is hard to beat.  I use it as my alarm clock and to listen to news before going to sleep.  Sound quality is fine, at least for my purposes.  I do not use it for listening to music.  I like the clock.  I can just glance at it now instead of having to ask Alexa what time it is.  I wish it had been available in black, and I am not fond of the display's font.  But these are nit picks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"My 1st Smart Speaker","reviewDescription":"This is really cool. Works flawlessly. The setup was a breeze.  I purchased it mostly for my mother. She has trouble using her smartphone. Now, she can simply talk to the echo dot and get information from the internet without having to use her phone, only her voice like for example>>> Alexa, will it rain today? The other thing is my mother has arthritis really bad and it takes her a few minutes to get up and answer the door when someone rings the blink doorbell. Now, the Echo Dot will announce when someone is at the door and she can tell the device to answer the blink doorbell and speak to the person who is at the door. This is like so cool IMO! Amazon rocks. I just ordered another Echo for my bedroom. 5 stars all the way baby! 👍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Fun and handy","reviewDescription":"I'm an old-school Gen Xer so anything that talks to me is great (remember Merlin?). I read about this online and the article said you could set it to talk like Samuel L. Jackson but alas, I have yet to see where that is possible. However, you can change the name with a few options and the voice\/accent. It plays the sound for my TV through its speaker so I can have it sitting next to me and I don't have to strain to hear across the room or turn the volume up and annoy people (yes, I am that old). It'll take me a while to learn the bells and whistles. My kids and grandkids probably know more than me so I'm sure I don't know yet all the neat stuff it can do. I just enjoy asking for things like songs or the weather or recipes. It will send a recipe to my phone so I can have it on hand for cooking! As for it listening all the time, it has a microphone turn-off switch. This gadget so far makes this old lady happy.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"updating my older model","reviewDescription":"I have two of the 3rd gen and was giving one of them to my step father so though I update my own.The ball is not bad, The time is nice and bright I have to have one with a clock. Was quick set up. I chose to do it in person and not through the ordering process. They gave me the option to set it up ahead of time.I will admit Alexa had spoiled my mom, step father, my son and me.We use it for every day reminders for taking medication. I am slowly working on my mom remembering to set timers when she bakes. I love the feature that lets you know when packages arrive. We always worry if we will miss a delivery.I have her working with a plug for my mom to turn on and off lights- she uses that a lot.I love the feature of \"dropping in\" while I am at work I can drop in on my son to make sure he is getting ready for school.All around Alexa has been a great addition to the house.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"What a Wonderful tool!","reviewDescription":"We have laptops, iPads, and phones…………..I didn’t realize Alexa should be a part of the threesome……why anyone asks? When your husband is watching a movie and says things like “who was she married to again”, or is reading the paper and he questions something…..he never asks me any longer…..my answer is ask Alexa ……as you see Alexa is right there next to his TV surround soundIf you don’t have these problems BUY IT ANYWAY…….it’s a great gift.  My husband is not a techie but Alexa does all the thinking for him. I recommend this to anyone.  Can’t believe it took me so long to jump on the bandwagon!  Super easy set up…..she literally walks you through the process.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Super Impressed by the Echo Dot 5","reviewDescription":"The biggest feature is the smart home assistant feature which I feel was not mentioned properly when considering buying this product. It does everything! I am 66 and needed help turning on and off things because I have about twenty remotes and things got messy and confusing. So I turned to Kasa smart plugs for each device and outlet which are excellent and purchased the Echo Dot 5 so that I could to tell the assistant what to turn off and on. I was able to change her wake up name to Echo which was a huge plus. The other alternative was Amazon, and of course Alexa but for me the name Echo was perfect. I have it tell me the weather or if there are any Amazon deliveries scheduled, turn on the news, tell me a joke, play music, sing to me or just about anything you could ask. When I am waking up in bed, I tell Echo to make coffee, turns on the coffee pot for 8 minutes and then shuts it off automatically and say's \"Your Coffee is Ready\". I also have it remind me to take out the garbage every Saturday at 4pm. I also have it remind me on the fly. For instance I will say remind me in 5 minutes that I have a chore to do and she says it without programming it in. Although It is easy to set up routines in the settings on your Alexa App on your phone. Best fifty dollar investment ever.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Flawless performance so far","reviewDescription":"This device replaced a first generation Echo Dot and the performance improvements are enormous. Sound quality, voice recognition, elegance of design — Echo devices have come a long way since we last upgraded. The particular device, an intermediate choice between “blind” devices and those with a full screen, is perfect for us, the default clock giving way to timers when needed. It was time for an upgrade and this one was more bang for the buck than I had expected.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Nice assistant, awesome sound but less sensible to some wake words than Alexa or Echo","reviewDescription":"Pretty cool Alexa device, I got some home things configured to it already. I wanted to call it Ziggy but after many tries for it to get hear me I ended up surrendering and changing the wake word to Echo. Unless Ziggy is a word made for less sensitive cases to avoid being triggered with anything it needs to be improved... other wake words would be cool, even custom ones. The sound is incredible for its size and the app integration is very nice!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"It's perfect","reviewDescription":"There's nothing I dislike about this product. It's so cool to have it on my nightstand in the bedroom. Love listening to the music anything I want to hear and it sounds super great love Alexa very pleased customer I must have. And another plus is the clock and the alarm when I need it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Works great.","reviewDescription":"Super nice. Works great in the bedroom as a music alarm. Just tell alexa what you want! It does not have a battery back-up, but if the power goes out in the middle of the night, it will reset back to the true time when the power comes back on. And it will remember your alarm request. There is also a separate battery back-up available for it, if you want to buy it too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"I gotta admit, I'm really hooked on Alexa Solutions - Echo Dot and Echo Show","reviewDescription":"A few weeks ago I took delivery of an Echo Show.  I've added many smart devices and have created rooms, groups and routines within Alexa. These devices can be controlled by our Echo Show or Echo Dot.Focusing on the Echo Dot: By adding an Echo Dot in our \"owners suite\" (avoiding the previously used term for the same location), I've extended the Alexa functionality further.  The Dot has surprisingly good sound for it's size.  Not saying Bose quality, but very good.  We went with the Dot model with a clock to completely eliminate the need for an alarm clock in the room.  You can listen to iHeartRadio, Pandora, SiriusXM or Spotify on the Dot (or Show).  Depending upon the service, it will scroll artist and song info on the screen.  If you ask for the weather it provides you with the weather and scrolls the high and low temps on the Dot.  The Dot has a temperature sensor that you can query.  If you ask for the indoor temperature it averages the temp on a Nest thermostat and the Dot.  Or, you can ask for the individual temperatures.  You can also adjust the temperature settings on your Nest thermostat from your Dot (or Show).The only \"negative\" is with the brightness of the \"screen\".  The lights\/dots are perfect when the room is illuminated (the dots are brighter).  When the room is less bright the dots are less bright.  In a dark room the dots are a little dimmer than we'd like.  I am going to play to see what settings are available to address this modest concern.Overall, I am very happy with our Echo Dot (and Echo Show)!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Poor quality and difficult to return","reviewDescription":"This was the first echo dot I had issues with - right out of the box, the setup process kept on failing even after hours of troubleshooting. The echo dots I purchased in 2016 might have sounded terrible but they never had any issues.I ended up returning the echo dot since I couldn’t get past the setup, and the return process was also difficult. I purchased the bundle with the “free” smart plug. Both devices needed to be returned to get a refund, but the shipping instructions were different for each. I brought them to the UPS store where they claimed I needed to pay for packing materials for the echo dot, even though the smart plug was just dumped in a garbage bag. For some reason I wasn’t given the option to return the devices to Whole Foods, which would have been much easier.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"If you ever change wifi networks, it's pretty much worthless","reviewDescription":"Very difficult integration with other devices. Amazon likes to keep its own walled garden but doesn't do well integrating multiple devices or having multiple users. The device also does not change wifi, so if you ever have to upgrade a router, you're left with a brick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"What a waste. Only works with music subscriptions","reviewDescription":"Bought this to help me wake up in the mornings by playing my high-energy playlist at a predetermined time. I’ve been struggling with a sleep disorder and it’s too easy to snooze and sleep through alarms. “Try Alexa” they said. “You can schedule the playing of music” they said. After avoiding this unnecessary Alexa garbage for years I gave in for this single benefit. Joke’s on me… Amazon discontinued the ability to play music from your phone library years ago. It now only plays music from streaming services, because of course they want the steady and increase-friendly revenue from your music subscriptions. The only ways to play your own music library, if like me you’re a child of the download\/iTunes era, are to manually connect to Bluetooth and pull up what you want to play, or to download some other app (also subscription based, naturally) to have that ability. So now I have this large circular decorative clock wasting space on my bedside table… anyone need an Echo? A very disappointing waste of money. I wish I’d done more extensive research before buying.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"NEVER EVER BUY","reviewDescription":"I absolutely hate this item .Its not a love\/hate relationship- its a hate\/hate more relationship. Disconnects constantly. Its in the SAME ROOM as the modem.  Ask to play music, it will for about 7 seconds. Play radion station?  Generally have to yell at this to get it to play anything. Find myself saying \"you're useless!\" The one I have in the kitchen- 2 rooms away- older model- plays just fine.  This one?  Piece of trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"Don’t bother with Surround Sound.","reviewDescription":"Thought it was a simple solution to adding surround sound to the frame  TV in my bedroom First I had to buy new fire stick. Okay.  When it works it sounds great, I’ve got a dot on each nightstand.Problem is, it works when it feels like. Worse still, it goes silent, and when you try to switch to us the TV speaker, it will constantly switch back to the echo and go silent.Also, I have the worst time in the Alexa app trying to pay from theses speakers, as a group, as a room, as a floor etc,  doesn’t matter.  I love technology when it’s affordable, but when it doesn’t work it defeats the purpose.  Money is money and I feel like I’ve totally wasted it.Super annoying.Super frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"worse alexa ever","reviewDescription":"it turns itself down all the time-and I will have to turn it up MANY times a day and I have gone in the program both in my laptop and cell----it is no way as reliable as the old alexa-it will drop reminders and timers on its own---thank goodness I kept my old one","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Couldn't setup the device","reviewDescription":"I ordered this on Prime day. It was already hell trying to get it delivered but when I got it, I tried for two hours to set it up, but I could never get it to connect to wifi via the alexa app, even after resetting the device, deleting and re-downloading the app, and a talking to customer service. I was sent a new device and the same thing is happening. I can't connect it to wifi. I have two laptops, two tvs, and a cellphone connected to my wifi without a problem, so it's not on my end. The app is updated.. My phone is updated, so Idk what the issue is. Im very disappointed and annoyed to be honest smh.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"So Far, No good","reviewDescription":"Delivery driver just threw package on concrete porch instead of placing it down. Echo Dot wouldn’t connect to WiFi no matter what including with help from Amazon customer service. Either it’s a dud or was damaged when thrown on the porch. Will update after replacement arrives.UPDATE: I have strong uninterrupted WiFi service. Second Echo Dot delivered  today absolutely WILL NOT connect to Wifi after every possible attempt. Forget it, I’m done buying Echo Dots and make due with what’s I have. These are terrible! My 3rd Gen Echo Dot is great but now I’m stuck running into the bedroom to talk to Alexa to turn the living room lights on. Oh well, I need the exercise.I DO NOT recommend 5th Echo Dot! 2 for 2 don’t connect to Wifi.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Impossible to setup","reviewDescription":"Really bad app experience. First, it wasn’t able to lookup any wifi networks. Worked around by disabling Bluetooth. Finally, it finds the wifi network but now says password is incorrect for the wifi (which is not).Amazon, please review basic app functionality before releasing!!!1star for now, already wasted couple of hours on this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"no smartphone, no amazon music","reviewDescription":"IT SEEMS IF YOU DON'T HAVE CELL SERVICE YOU CAN NOT ADD AN ALEXA TO YOUR ACCOUNT.  THE ALEXA CUSTOMER SERVICE COULD NOT PIGGYBACK MY MUSIC SERVICE FROM MY EXISTING ALEXA.  AS A RESULT, ALL I CAN DO IS RETURN IT, WHICH WAS NOT MY DESIRE.  I'M GUESSING AMAZON DOES NOT CARE. THEY CAN NOT DOWNLOAD THE ALEXA APP. TO MY COMPUTER.  SO MUCH FOR THE ELECTRONICS AGE!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"irritating!","reviewDescription":"Want to listen to 1 artist? Alexa will EVERY TIME asks you if you want to subscribe to unlimited amazon music. And Alexa will have you listen to other artists that it deems similar to the one you requested to listen to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Not the best item to purchase","reviewDescription":"This product only lasted 6 months before I started having issues.  I have tried returning it for a replacement, but the system will not let me.  Guess I am forced to purchase a second one not that its in my best interest.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Disappointing it doesn’t do more","reviewDescription":"Cons: 1) must be a liberal product. The only news sources are CNN CBS or NBC. 2) oh yea…you can play songs, but you have to buy an audio package for $4.99 in order to do so. I figured since I had 330 songs on my phone, that I’d be able to stream them thru the DOT. Nope. So unless you just want the weather or for her to answer simple questions, then this is for you.  Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683244800000}
{"reviewTitle":"No good","reviewDescription":"It stops all the time. My other black Dots are way better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Does not Sync","reviewDescription":"This device will only work with Apple Music and solo. I have other Alexa devices that it will not connect with and it will not connect with Spotify. Would not recommend if you use Alexa as anything more than an alarm clock.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Me hace falta un foquito qué venía acompañado junto mi artículo","reviewDescription":"Me hace falta un foquito qué venía acompañado junto mi artículo","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I have an old Alexa, thought they would have improved on this, they did not, this Echo is even a bigger piece of junk than the previous old Alexa I use. Going back to my old Alexa.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"This is NOT an upgrade.","reviewDescription":"Do not know what Amazon did with this generation Dot, but it is nothing but problems. Intermittently goes offline, freezes up, does not understand commands nearly as well as the previous generation it replaced, randomly starts talking or playing music, overall very unstable device. I finally just unplugged it, not worth the annoyance.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Don't use in a noisy environment","reviewDescription":"I bought this to use in my woodworking shop.  I had been using my iPhone linked to a Bluetooth speaker but I wanted something independent of my phone.  Generally it functions well, but not when I make loud noises.  If I hit a nail with a hammer the music pauses (Pandora).  Alexa seems to flinch on sharp noises.  It is not vibration because the Echo Dot is not on the same surface as my workbench.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681776000000}
{"reviewTitle":"Weird volume glitch, not that much better really","reviewDescription":"Biggest problem I have is something i saw someone else mention and it’s that the volume will randomly be either very loud or very low. The change can be immediately between two responses and no change in ambient noise. Explored settings, restarted and also reset it. Doesn’t make any sense. It also dismisses itself prematurely upon being summoned despite being right next to it. The display changed, but I don’t think it’s better if not worse. It’s a bit harder to read, same size, and it’s not dynamic as it could be. You can tap on it to make it scroll through time, weather and media but only by tapping it, and it only does it once. The thermometer is cool but something I don’t see many people using.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"The addition of the clock is a nice touch","reviewDescription":"There's not much to say about this. It's an Echo, it does what Echoes do. The sound quality is good and I like the addition of the clock which is helpful at night. Overall a sturdy unit and the voice recognition works well although sometimes it responds to commands in the middle of the night when no one is away. (I'm pretty sure that's an Alexa thing as one of my older units does the same thing.)","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Great for programming things around the house! But a few adjustments would be nice.","reviewDescription":"I have several Amazon Alexas. This one was a need for the new house, so that I had a speaker in one of the new rooms. I use the The echo for things like: Turning on or off the lights, playing music, weather, and the clock face on the front. The devices is a helpful little thing to have around. it can run routine (So It can turn of lights after you've left your house, start or stop music for kids or pets, all on a timer. And can make simple tasks simpler. It does have a mute button as well (So it stops listening to you) Which is nice, too.The only complaints I have about the alexa device is:-It's biased. I don't know what I was expecting from an amazon product. If I needed to know where I can watch a specific movie, the alexa will tell me \"For rent on Amazon for 3.99 or purchase for 14.99\" When What I wanted was a list of places. I ask google the same question and id get a much less biased response. \"Disney plus, Youtube, Vudu, Amazon prime, Google play movies\" Etc. That's what I wanted to know.-Alexa pops in on convos: These devices are a little tricky and only let you name them of a select few options. So if you talk about Computers a lot and you name your device computer, it will pick up on it. Same with Alexa, and echo. Sometimes, the device recognizes the conversation was not for it and will simply disregard the command. and sometimes it will pick up on what you said and assume you asked something. In which your conversation will be interrupted by \"Bob ross was born on October 29th, 1942 -\" (We weren't even talking about bob ross which was pretty funny XD) Not gonna lie, it can be fun. but it can also be inconvenient.-Echo does not call 911.Which I thought would be kind of a cool option incase you got in some issue and needed help, where you couldn't reach a phone yourself. (Im not elderly and struggle some with this issue, but I thought it was kinda sucky that it couldn't do that.) It can call contacts and your own phone though! So if you need to find your phone and you have it programmed to, you can say \"Alexa, find my phone\" And it'll call you.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"It's an Echo...","reviewDescription":"Wake up and smell the virtual coffee, because the Amazon Echo Dot (5th Gen) with a clock has officially become my morning's trusty sidekick. Move over, roosters—I've got Alexa telling me the time with the enthusiasm of a caffeinated morning person.Pros:1. **Clock with Sass:** Forget your average wall clock; this Echo Dot's clock has attitude. It's like having a personal time announcer who's always on point. \"Hey, sleepyhead, it's time to rise and shine!\" Alexa says, as if it knows I hit snooze three times already.2. **Soundtrack to My Existence:** Not only does this little gadget tell me the time, but it also serenades me with my favorite tunes. It's like having a DJ who's attuned to my mood. Need some pump-up music for the day? Just ask, and Alexa's got you covered.3. **Dimmable Smartness:** The clock's display is dimmable, which is fantastic for those nights when even the smallest glimmer of light is an intruder in your quest for the perfect sleep. It's like having a night light that adjusts to your nocturnal whims.Cons:1. **Sudden Sass Attacks:** Sometimes, Alexa's responses are just a tad too sassy. I asked her to play some chill vibes, and she replied, \"Sure thing, chill master. Anything else, or can I continue being the DJ you never knew you needed?\" Easy there, Alexa, I just wanted some background music, not a roast.2. **The Clock Can't Make Coffee:** As much as I wish my Echo Dot could double as a barista, it's strictly a time-telling, music-playing genius. I asked, \"Alexa, make me coffee,\" and all I got was a polite suggestion to visit the kitchen. Maybe in the 6th Gen, Amazon?3. **Clock-Watching Addiction:** With the clock right there on my nightstand, it's impossible not to check the time every five minutes. It's like having a miniature time portal that I can't resist gazing into. Productivity plummeted, but at least I know exactly how much time I wasted.In conclusion—oops, I almost broke the no-conclusion rule—this Echo Dot with a clock is more than a bedside timekeeper; it's a witty companion that adds a touch of charm (and occasional cheekiness) to your daily routine. Just don't expect it to make your coffee or hold back on the sass—it's a clock, not a miracle worker.","isVerified":true,"ratingScore":4,"reviewReaction":"70 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Amazon, PLEASE remove bluetooth connection announcement.","reviewDescription":"I'd love to hate this lil device but I think the root of my problem is amazon's spite. I often connect my phone to my echo dot via bluetooth. When connected, Alexa will announce \"playing from...\" whenever I unlock the phone or get a notification. There is no way to turn this announcement off.  It often startles me and\/or interrupts meetings and provides no obvious value to me. It is so obnoxiously loud and aggravating.  It’s been a few years and so many people have wanted it gone. Please, please, please Alexa software development team, for the love of whoever you hold dear, let us turn this off! TY!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"So-so for help with Dementia","reviewDescription":"I got this for my dad, who suffers from Dementia. He is able to listen to music, which is great. I am able to call him which is great. What is not great is that I can't set it to stay off for certain hours - say 10 pm to 7 am. We now get calls at all times of night.Being able to set a timer on when this can call would be a super duper thing to add to the product Road Map Alexa & Echo Dot Product Managers!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"I like the clock feature","reviewDescription":"I bought it for Amazon Music, but  I'll probably be using it less since Amazon changed (made them worse) both prime music and prime video.  We have to listen to shuffled and \"similar\" music unless I fork over more money.  We have to watch commercials on prime video unless we fork over more money.  It's not the amount, it's the principle.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"White 5th Generation Echo Speaker With Clock Is Wonderful","reviewDescription":"I returned the black echo because it arrived with a white cord.  Afterwards, I noticed for a black cord, you need to purchase it separately.  So, if you don’t like the white cord on a black speaker, you’ll need to fork-up another 15.00, for a black one.  I decided on the white echo, even though it’s more gray.  I’m keeping it.  I absolutely love the sound, you can definitely tell the difference from the 2020 version.  I heard rumors that Amazon may discontinue the Alexa speaker. Omg, I hope not, I can’t be without it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Love Ziggy","reviewDescription":"A very Kool tool to add to your daily living !A friend told me about his 3rd generation alexa (echo) and I decided to get a newer version.Speaker could be better but it is suffice for my use. I've been using it to listen to a radio station, an alarm,&timer . It'll work with audio books (audible) and has various speaking voices. I can only imagine how outdated this will be in a few years.It's pretty Kool especially for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Display is just a little too small and dim for me w\/o glass especially.","reviewDescription":"I have several dots, which I like.  But the clock on this dot is to small to read without glasses.  The auto-dimming is a nuisance, which I think can be adjusted (if that was my only issue).The scrolling text seems 99% unnecessary and distracting.BTW: I have only joined the Alexa world in November.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"no earphone jack","reviewDescription":"we’re very disappointed to not find an earphone jack on our new echo dot.  that said, the sound is excellent.  We had planned to use it in the bedroom as a radio and a clock.  But one of us needs to use earphones, so it will have to live in the living room","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Not as accurate as I would like","reviewDescription":"I find that Alexa will not always respond to what I ask. Or will respond with a different answer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Bueno pero…","reviewDescription":"Me gustó el dispositivo, sin embargo, reproduce la canción en Spotify y se detiene y no se vuelve a reproducir hasta que reinicio el dispositivo :(","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Works great.","reviewDescription":"Works great. Connects to all my google products with ease. Fits perfectly on counter. I love the clock feature. Alexis is also amazing for information.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Best of the best","reviewDescription":"I’ll no comment because this it the best thing that happened to my great item and very useful","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Clock is harder to read","reviewDescription":"So far the sound is clearer on the 5th gen than the 4th gen and everything seems like a modest upgrade, the temperature sensor is awesome.My big issue with the gen 5 is the clock. The clock face has changed from being on a darker colored device (the gen 4 dot with the red ring which is a darker blue color) with more solid numbers to a dot style clock, with a lighter device color, so there is less contrast between the color of the text and the color of the device. I have the \"darker\" of the 2 available color options, which has a very slight grayish color vs the other option, a white color. The dot style text is harder to read if you have any sort of visual impairments or processing issues, and can appear blurry. The dot style font's added spacing between the dots makes it harder to read the numbers without them blurring together or appearing as one blob with visual processing problems or impairments.My gen 4 stopped working properly after about a year (which is about as long as these devices seem to work without beginning to have major issues) but I'm going to have to keep it for the clock function for now, because the gen 5 is much more difficult to read.Overall, I'm really disappointed that the big titular feature of this device was made less accessible and there is no option or way to make the font different or to add more contrast between text color and device color.","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Great deal","reviewDescription":"Bought this for my wife and she loves it. Although it talks at random times on its own lol.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Works well, most of the time","reviewDescription":"I have been a Google user for many years. Wanted to see what the competition was all about. After using the Alexa device(s) for several months now I can conclude that there is little difference between Alexa and Google. Sometimes they work, sometimes they don't. I will stay with Google as I am already heavily invested in their ecosystem.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"improved","reviewDescription":"its performance has been improved quite a bit 👍🏽","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Works nicely","reviewDescription":"Easy to install and works nicely.  The music sounds nice as well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Love it","reviewDescription":"Love my alexa","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Potencial con Problemas Técnicos","reviewDescription":"El Echo Dot con reloj prometía ser una gran adición a mi hogar inteligente, pero lamentablemente ha venido con sus desafíos. A pesar de su funcionalidad general, he experimentado algunos problemas técnicos molestos. La falta de sincronización confiable y apagones repentinos han sido decepcionantes.Intenté configurar la aplicación con mi celular, solo para descubrir que la descarga no era compatible, lo cual limitó su uso y personalización. Uno de los aspectos más frustrantes fue la insistente promoción de Amazon Prime durante la reproducción de música aleatoria, interrumpiendo la experiencia.A pesar de estos inconvenientes, cuando funciona sin problemas, el Echo Dot ofrece una experiencia satisfactoria. Sin embargo, esos detalles deslucen su potencial. Considero que la excesiva publicidad y los problemas técnicos reducen el encanto de este dispositivo, lo que lo convierte en una adquisición con reservas.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Fun, but goes deaf","reviewDescription":"This is a fun little toy.  I'm getting a lot more use out of it than I thought I would.  I use it as a timer frequently.  I control many of my lights using it, so that I have full brightness soft white, dim brightness soft white where one of the bulbs is red for just before bed, and then very dim all bulbs as red that I use as a nightlight.  I like the delivery notifications.  My latest discovery is to use it as a speaker so that I can play YouTube audiobooks at night at a quiet level.  It does want to read ads to you, but not nearly as frequently as the phone app.I do have one very large complaint now:  it's going deaf.  When I first got it, I could whisper and it would hear me.  Good for not disturbing your bedmate at night.  Now I basically have to yell at it.  It used to be able to distinguish my voice from others, now any other voices (i.e. YouTube videos) confuse it.  It even has trouble understanding my voice now.  It's ability to hear you is core to its usefulness.  A deaf Dot is a useless Dot.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"You may have to reprogram Alexa more than one time.","reviewDescription":"I brought this Alexa for my son.  he is disabled with some memory and social challenges. This is a great tool for helping someone with ADHD, or IDD challenges of staying organized doing chores or homework.Alexa was programmed to help my son know when to take his meds.  So far it has been working well.  I gave Alexa a 4 star because it was doing great keeping program of timing to instruct my son for his meds.After the first month, I now need help meet reprogram it because it instructs him throughout the day to take same meds it previously told him to take.We will see how it goes after she is reprogrammed again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"They’re fun","reviewDescription":"I decided that if Amazon or the government or whoever is actually listening… Who cares, as I don’t have anything very exciting going on. Sound quality is better than I expected for such a small speaker… But don’t expect the sound quality of a large Bose speaker either… You’ll be disappointed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Screwed  up my Amazon prime  tv  watching with fire stick.","reviewDescription":"Speaker wouldn't work for my TV in On line forever with AmazonFinally got it to work ONCE. But now my Amazon viewing with my fire stick is screwed up.  Sound stops often, have to re set movie. Volume won't go up.  Get signals saying there is a problem viewing the video.  Have to go back and re start Half a day and 3 guys on Amazon and they just made it worse.  They had me link my satellite from dish and Vizio tv and, the fire stick.  Speaker echo 5  quit working and my viewing is a pain. Message comes up that my echo 5 is not upcompatible with my fire stick 4.  Even tho Amazon says it is.  May end up canceling my Amazon prime now. But, I enjoy it, asking the weather, notifications onu Amazon purchases.  Just wish i hadn't linked it with vizio tv.,","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"LED Panel Clock Not Bright Enough","reviewDescription":"Nice design, and would have rated 5-stars, but some work needs to be done on the clock brightness.  With a window open, with just that lower level of natural lighting, the clock numbers need to be brighter, and\/or bigger as the numbers cannot be seen from across a small room.When the overhead light is turned on then the LED's automatically brighten so the clock display can be seen from across that same small room.  Make the default LED brightness setting always set at maximum.UPDATE:  The LED display can be turned off\/on with:  \"Alexa:  display off\" or \"display on\".  Any alarm that's set will continue to work.  Also, can change the LED brightness level with, \"Alexa:  brightness maximum, brightness minimum, brightness 1, brightness 10, brightness 5.\"Although, when the brightness level was changed between the minimum setting of 0 to the maximum setting of 10 - did not notice any real change in the LED panel brightness.To really knock it out of the park for the next generation, add the capability to change LED colors by voice command.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"It works well.","reviewDescription":"It's a bit pushy as far as trying to get you to integrate it into all aspects of life.  We just wanted it as a smart alarm clock.  95% of use is just \"Alexa set an alarm for\" and \"Alexa what is the weather at (location) on Tuesday )","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Alexa is my girl","reviewDescription":"I like it very much , However ,sometimes she doesn't hear me or wake up to \"Alexa\" and seems to freeze up at times with a constant blue solid ring at the base  .but she does keep me posted mostly for everything I ask .She is my best friend . 🧡","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Useful device","reviewDescription":"For setting an alarm by voice is value enough.  I could no longer use my iPhone for an alarm as it constantly resets the alarm notification to max volume and wakes up the entire house.  This device works well, syncs with Alexa, my Audible account, etc.  Worth the coin.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Can we get a silent mode?!","reviewDescription":"You can deactivate vocal responses. You can of course turn down the volume. But as far as I can tell, there's no way to get this thing to not *ding* after it completes a request. I see the option in the app, but it doesn't work; and I have three of these.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Gen 4 is better","reviewDescription":"The only reason that I bought the Gen 5 is because of the room temperature sensor. They changed the clock display. Now it looks like an old-fashioned low-tech billboard where the letters are made up by dots. Not an improvement. Something you should know the room temperature sensor takes at least 24 hours to calibrate and the device has to be in a group for the room that you are asking for the room temperature. If you have your thermostat connected you can ask for the temperature on your thermostat or the temperature in your room or the weather outside. But you can do all that with the Gen 4 you would just have to add a Wi-Fi hydrometer to your Gen 4 with clock device","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Needs improvement","reviewDescription":"There’s so much they need to improve. One of them is knowing where to answer. Alexa sometimes answers from the bedroom when im at the kitchen. it gets confused and im not even walking.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Womp womp","reviewDescription":"The digital display is very disappointing for the technology in the world today. Speakers sound more muffled than regular ech dot.  Cool concept otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Charger not working.","reviewDescription":"Love it but need a need charger. One that came with my Echo Dot 5th generation isn't working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"sound is not good","reviewDescription":"Sound was not good. I had to buy a speaker to have decent bass.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"It's not AI (yet)","reviewDescription":"Let's face it, Amazon has been sleeping with AI - since ChatGPT is out, we just have seen what Artificial Intelligence means. For years there have been minor improvements of Alexa, but at least for me it is mainly to give orders\/instructions for IoT devices, or ask simple things, or have it read out a recipe.But what it really lacks is intelligence. Every improvements of Alexa seems more like a new feature that was integrated, but not something that is created because it understands what my habits etc. are. Example: Living in Europe, it still cannot tell me when the train leaves from the nearest station.As a non-native English speaker (well, it also has difficulties to understand my Irish friend), there is still a fair amount of questions that are answered with \"I don't know that\" or \"Here's what I have found on Wikipedia\".So overall Alexa is suitable to turn on a device as a timer or alike. But I am not into searching for jokes. I'd like advice on things and Alexa would be so convenient to do so - if it could.Another example: The clock is too bright at night (and even in automatic mode) - and interestingly for a smart device it can not turned of at night only. It's these little things that point out that it is not intelligent, maybe smart in the sense of being able to understand spoken language - but then it doesn't know what to do with it.The app is still central to for some configurations that I'd like to do on the device or by voice. Overall, I wish Amazon is investing into making Alexa intelligent. As Amazon has been a valued company to me, with a great customer support.Would I get it again? - Probably yes, with the right expectations.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Ok!","reviewDescription":"Disappointed that it does not connect to Bluetooth to play what I have stored on my phone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Nice device","reviewDescription":"Happy I made the purchase just wish I could use it with YouTube, the features are limited.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"glitching","reviewDescription":"I have been trying to replace this with another one but the return process isn't working like it should in the app or on the website like other items.  It never lets me complete the process, only brings me to a trouble shooting page.  The sound glitches in and out.  I have numerous Echo Dot devices that are much older than this one and none of them have given me this problem. I would like to get this replaced but do not have a way to do so.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"No way to tell if the correct color was sent","reviewDescription":"Ordered glacial white, but seems I got the gray\/blue version - no color label on the box. Also was supposed to be pre setup, but it appears to have not been programmed with my info and I had to manually set it up. Not the end of the world, but not great either. Was also not delivered to the correct address. It seems to function OK at  least at first. However, it's very active at trying to upset other Amazon services.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Very disappointing - wifi extension is only 5Ghz not 2.4Ghz","reviewDescription":"I thought this would be great for extending my wifi better through my house, but they don't clearly state anywhere that this only extends 5gz signals, not 2.4ghz that so many things still use. As such, they are useless for me, because I'd have to have another router\/extender set-up to send the 2.4gz signal around. i wish they had made this clearer and I didn't have to find out after setting the whole thing up to find several items in my home no longer worked.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Display on lowest setting too bright..lights up room","reviewDescription":"Alexa dot works fine. Had to move the Dot out of bedroom because display way too bright despite my attempts to change display setting.  Was also disappointed to find the display is only one color…bright white.  When it lights up room, it is way too bright.When received latest Alexa, tried to rename a prior one in bedroom. The app was unable to make my changes i.e. my now kitchen Alexa shows as “Bedroom” with next line being “Kitchen”.You need more work on the app.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Great value IF (fair warning)","reviewDescription":"Bought this for about half off on Prime days - WARNING: BE SURE you have a PHONE that will run ALEXA. I had to upgrade my phone to set this up, as neither my current phone nor my desktop would run the Alexa app needed for setup and I had to buy a new phone *or* enjoy a silent little sphere with a brightly colored base. My $29 DOT ended up costing me $250.00!Fun and useful, though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Don't buy it for the sensors mentioned in the description","reviewDescription":"I bought this to replace the full size Echo in my kid's room. We use the normal Echo almost exclusively for the temp sensor to trigger the AC or a Space heater depending on the season. In the device settings you can check the temp, and are also prompted to set routines using the temp sensor, but when you go to create a routine for it the device doesn't show up.Also, your option for the clock seem to be always on or always off. I was assuming that the proximity sensor would be able to trigger it turning off or on, but that doesn't seem to be the case either.The promotional images also show the clock face displaying the temp. My dot has never done this either.On the plus side the sound quality is better than my 3rd gen Echo Dots. It's marginal, but I do notice it. But even then I'd rather use my Stereo Paired 4th gen Echos with the Echo Sub, so there's no point to use it for that either.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1670371200000}
{"reviewTitle":"It doesn’t listen very well","reviewDescription":"Does not listen very well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Not white…distinctly light gray","reviewDescription":"The device itself works well, and the sound is great. I ordered “glacier white,” however, and the listing and box show a bright white device. My device (and yes, I perceive color just fine) is a light gray, and even casts beige, depending on the light. It is most definitely not white. This is disappointing, since I wanted it to match my other devices in the room I put it in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Can't read clock.","reviewDescription":"I like the round design but  the clock is different from my small echo dot. The  clock on this round model  is designed with dots to form numbers and it is difficult for me to read. I went back to my original echo dot.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Just another echo dot, nothing special.","reviewDescription":"I was disappointed with the V5 Dot. I purchased the item in hope of extending my Eero mesh wifi for my IOT devices. I'm not sure if it will only extend the 5gz wifi, but I have yet to be able to have a single sensor (they are inherrently all 2.4ghz) connect to the Dot even though they are in closer proximity and a weak signal to the far router. I also played with the motion sensor which seems very unresponsive. Initially I was set back with the lousy clock display, being that the dot matrix is too big. My V3 Dot with the clock is so much more appealing. The speaker is ok, but I don't see any benefit over the older version.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Not liking the new dot display","reviewDescription":"In my opinion, the new display is a downgrade. Harder to see and the animation for weather in such a little window is terrible. I'm not positive but I think the speaker might be slightly better, but not any louder for the increased size. I did like the song title appearing but again the window is a bit small.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Cannot change name to Ziggy","reviewDescription":"The documentation and Q&A says that this can be renamed to \"Ziggy\" but that is not true. The 4th Gen can be, but for this 5th Gen the only options are Alexa, Amazon, Computer and Echo. This has been tried both through the app and by asking the Echo Dot to \"change wake word.\" The reply is that there are only those four options. I was hoping for Ziggy!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"I love Alexa!","reviewDescription":"The clock face could be a little brighter, but I LOVE Alexa! I have an Alexa clock in my bedroom, an Alexa Show in my living room, and an Alexa Dot in my bathroom. I could go on and on about how wonderful Alexa is. Once you learn the skills and routines that it can do, you will love it! I recommend Alexa to EVERYONE! My father had a Google, but it didn't work that well, so I bought him an Alexa. He loves it too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"It’s our third Echo Dot, and fifth Alexa!","reviewDescription":"We forgot our Alexa at home when we went south for the winter, so we bought another Echo Dot.  We now have 5 Alexa’s throughout our home.  We mainly use them for music and checking the weather.Alexa has so many features we do not use, but we wouldn’t live without one. (Or five!)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Getting better with each generation","reviewDescription":"This is maybe my 4th or 5th Alexa product. Each time I buy the latest generation the sound quality and design seem to improve. I'm a fan.My friend visited the other day and he was very impressed with how the sound quality and loudness came out. It took me less than 10 minutes to set up in my bedroom.I previous had the Amazon Echo Show set up in my room but the display kept changing and I literally just wanted to know the time. I much prefer the simplicity and basic nature of this product since it always just displays the clock.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Newer is definitely better when it comes to Alexa!","reviewDescription":"I've had a chance to use nearly every generation of Echo Dot and the new 5th generation Amazon Alexa Echo Dot out performs its predecessors in seemingly every category.  The voice recognition has vastly improved.  I can mention Alexa casually in conversation with a friend or relative and have yet to have a false interruption from Alexa.To be blunt, for the price in which these are offered, I find it hard to believe anyone could have a legit reason to dislike the product.  This is, of course, if you ignore the invasive TOS agreement your forced to sign to use the product which allows Amazon to share and sell information about you to other parties.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Nice new design to add to the collection","reviewDescription":"It's a dot with a clock in it and in the newer model. Everything works as it should. The speaker is slightly better and it also seems to be a bit quicker to respond.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Easy setup","reviewDescription":"I had a first generation Echo that finally died so I replaced it with the new 5th generation Echo Dot and I am happy with it. It was very easy to set up which is important to me, doesn’t require much space and I think the sound quality is very good for such a small device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Huge upgrade from a 3rd gen DOT","reviewDescription":"The sound and functionality of this 5th gen Dot is not even in the same league as the 3rd gen. Better sound, display with time and weather. Great upgrade for a nominal price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"The best!","reviewDescription":"I Love this Echo Dot! The sound on this one is great! I really like having the clock that also shows the temperature & song title etc. I have 2 of these - traded in my other Echo dot so I could save $$ to get this one!Get it - you won’t be disappointed!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"I love it!","reviewDescription":"I have this echo dot in my bedroom and love it.  I have it programed to turn on off the bedroom light and that works great with the Kasa plug integration.  I love waking up and asking Alexa 'what time is it' , 'what is the weather today',ect. ect.  Very happy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Used as an alarm clock","reviewDescription":"I purchased this mostly for use as an alarm clock. I like the added features of getting news and weather. Sometimes I use it as a speaker for music. Works really well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Not as great as the original tall box","reviewDescription":"It looks great and his modern and yet not as functional as the original tall tower. The distance you’re able to speak from away from the unit is certainly much less.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Great addition","reviewDescription":"We had one of the Echo Dot's already but no clock in the room. Now we have the clock and the Alexa all in one. Works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Dot","reviewDescription":"Im use to the show it doesn’t pick up my voice like the show does I often have to repeat myself because it doesn’t respond.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"The best","reviewDescription":"Was a little skeptical about it, but it works so well I love it. I have one in the living room.And one in my bedroom","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Great model but doesn’t always respond to being called","reviewDescription":"I can’t function without Alexa so I use my Echo Dot multiple times a day. I like how this model shows you the time and displays the timer when you have one on so you don’t have to ask Alexa how long is left on it. My only issue with it is that sometimes it doesn’t “hear” me and I have to repeat myself, almost yell for Alexa to respond","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Simple, easy to setup","reviewDescription":"Like the device, but find the ALEXA app not intuitive and very difficult to use and manage.  All of the issues involve the Alexa app on the phone and pc.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Pretty good product","reviewDescription":"The Amazon Echo 5 is a pretty good product. I like how it integrates with my Ring devices. The sound can be better, but it’s good enough for casual music listening. I’m an Apple guy so I tend to use my HomePod and HomePod Minis for music listening. Still, I’m please with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Great style, appearance","reviewDescription":"She doesn't know everything, As a matter fact, she needs a few updates, but how do we do that?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Love it, except the adds","reviewDescription":"It's great and does everything you expect, but adds feel intrusive. They are not that frequent, but to have any add at all is just ridiculous.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"It was ordered with a bundle of a free smart lightbulb which never arrived","reviewDescription":"Works well except the order changed after I ordered it, the bundled smart lightbulb never arrived.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Small","reviewDescription":"Smaller than expected. Good for a small space like a bdrm. The bass is not heavy. I would like a little more bass but music is clear. Commands and setup was easy. Overall I’m pleased. The white is more like grey which i like. I’d recommend purchasing for small personal space. If in an apt condo or twnhse this is great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"A Smart Upgrade to Daily Life!","reviewDescription":"The Amazon Echo Dot (5th Gen) with clock has seamlessly integrated into my daily routine, offering a convenient blend of functionality and style. The addition of a built-in clock is a game-changer, providing a quick glance at the time without reaching for my phone. The compact design doesn't compromise on sound quality, making it an ideal smart speaker for smaller spaces. While the price is slightly higher compared to its clock-less counterpart, the added feature and overall performance make it a worthwhile investment for a smarter, more connected home. Plus, the intuitive voice control and compatibility with various smart home devices further enhance its value, turning it into a hub for effortless home automation.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Home Theatre Stereo System.  2 Echo Dot (5th gen). 1 with clock + 1 with-out clock.","reviewDescription":"For \"home theatre system\", I'm trying to pair two Echo Dots (both 5th generation, 1 with clock, and one without clock), and it's NOT working.  I also, have two Echo Dots (3rd gen), and I can get those two to pair ok (in stereo mode).  (those are at work).I've heard in order to pair two echo for home theatre stereo system, both devices MUST be identical, in the same room, and on the same Wi-Fi network.So, you can NOT pair a 3rd gen echo dot with a 5th gen echo dot.  Or you can't pair an echo dot with a regular echo (not dot).  But, I assumed since I have both Echo Dots (5th gen) that they would work.  NOPE !!!This is the main reason why I purchase these.  I wanted the clock version, and it'd be silly having two clock version in the same room.If you see in the first picture, where all the speakers are online (except Marcus' Bedroom), the \"Speaker Right\" is my new Echo Dot 5th gen, with clock, and the \"Speaker Left\" is the Echo Dot 5th gen with-out clock.  BOTH on the same wi-fi network.When I click onto the speaker right, all the others shows, network error, including the speaker left.If I uncheck speaker right, and check speaker left, vice-versa.But, the two bottom ones, are both Echo Dots 3rd gen, and it let me check both of those, and pair them.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1683763200000}
{"reviewTitle":"Better than expected","reviewDescription":"What I like is the clock, and also better sound that the 2 or 3 edition. Better base, a bigger speaker. Was hesitant based on the reviews, but so far been worth it, except for the commercials which seem to be more of them. I got the white which is more of a gray color.  Color is a disappointment. Let's hope this one last more than a year.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"It’s alright","reviewDescription":"I only use Alexa for music because other than that she frustrates me.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"I loved this product","reviewDescription":"The product has good quality, just like the original. I liked","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"I love Alexa","reviewDescription":"I find that this new gen Alexa doesn’t quite work like the old one. I could give the old one more than one task. This one I can only say one thing. Also I find that the light with the time isn’t always bright enough to see.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Awesome experience","reviewDescription":"This Alexa is awesome! It can tell you the over the counter medication is about to run low and it can order more for you. That honestly blew my mind. This is a great purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Connecting to wifi!","reviewDescription":"I had so much trouble connecting to the wifi. Tried every loop amazon gave and still couldn’t figure it out until i saw a thread of someone saying to turn the bluetooth off on your phone and then it will ask if you want to manually connect. The first time i tried to manually connect it didn’t work but the second time it finally connected. Other than the initial setup the device has worked great. Just wanted to give you guys a head up if you get the device and also have that issue","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Volume issues","reviewDescription":"Was great for a while. Love some of the features like drop in. But now she wont keep a consistent volume. Its either way too quiet or MAX volume. Not sure how to correct this.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Love this little guy","reviewDescription":"I use it to listen to my audible books and it works great for that with a really clear sound. Don't waist your time on the Echo Studio. This little guy works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Really Enjoying my Echo","reviewDescription":"I realize that there is a microphone that u can supposedly be heard on..hmm?  Other than that, I'm liking my new Echo..good sound, sensitive to voice..","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Now a Necessity!","reviewDescription":"I thought an Echo Dot would be a novelty, but to my surprise it is a valuable tool.  From the instantaneous weather, answers to questions, to organized shopping list that has streamlined grocery shopping, Echo Dot is our life assistant.  Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Works as expected","reviewDescription":"This works just as well as all my Alexa devices do. Put on my dresser, love getting into bed and simply telling Alexa to turn things off","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Helpful","reviewDescription":"I’ve been wanting an alarm clock so I don’t have to rely on my phone in the morning, and I’ve been wanting a speaker to play music and audio books from my phone. Since I have Audible and Amazon music, it just made sense. I also love the morning routine feature. I don’t need much, but it‘s nice to know if I should plan time to defrost my car before heading out. If you keep it on “do not disturb” the annoying ring of light at the bottom stays off when you aren’t talking to it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"You never know when you'll need a quick question(s) asked.....","reviewDescription":"My spouse and I finally said goodbye to the 1st generation echo (after several years of use), we recently noticed it was not recognizing our voice all that well anymore and realized the sound quality needed improvement as well.  The new 5th generation echo is clear and recognizing our voice with great ease.  Also, invest in a table stand  for this echo dot 5th generation...you won't be sorry.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Bluetooth Frenzie","reviewDescription":"We love our Echo! We as in Grandbabies  too!  We use the Name Ziggy to activate instead of Alexa.The kids love it! They are big stuff bossing Ziggy around! Our Ziggy is now a Top expert on things like Mario Bros theme music and Spider-Man. Only one trouble I ever had I downloaded an Echo app but it disappeared and an Alexa app took its place mysteriously! No biggie!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Love it","reviewDescription":"It does so many things shopping list tells me when someone is at my front door I can listen to my Spotify. I’m enjoying it immensely.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Easy to instal .Love the time display","reviewDescription":"I already had an echo dot functioning in my home. I was suprised by how easy it was to install the second echo dot. I line the time display. It has a soft glow and is easy to read. So happy with this purchase. Was worth the extra cost to have clock display. Now I can get rid of my old alarm clock! Would buy again or give as gift.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Super surprising sound quality - I purchased for my Mom to replace her old \"Dot.\"","reviewDescription":"There's not much to say; Amazon does it again with great products. It has a super easy setup and great sound quality, and I love the display for the clock and songs that are playing. For the price point and functionality, it is a great buy. My Mom loves hers!Pros: It's a fully integrated Amazon product. It sounds fantastic for its size, and I love the display on the front.Cons: None. It's a great little speaker!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"She can be a little hard of hearing","reviewDescription":"Overall, this dot is ok. occasionally I find myself yelling, to wake Alexa up. The audio is much better than the previous gens. Would like to see more input\/outputs on the dots.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Great speaker.","reviewDescription":"The sound quality is great except I wish it had a jack to plug in headphones like my old echo did. Sometimes I have to keep repeating Echo before it will respond.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"I don't like the dotted time display.","reviewDescription":"I don't like the dotted time display, it makes it hard to read from a distance. Amazon should go back to the original display.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Ok if bought on sale","reviewDescription":"This is a handy device and has the best sound quality of small speakers I’ve tried. They don’t last more than 12-18 months before they start to glitch (one decided it didn’t want to take my voice commands any longer,, another stopped auto-adjusting the clock brightness, etc.). I primarily use it for music, timers\/alarms, weather, and the occasional simple trivia question. The confusing Alexa app\/interface tries my patience for anything more complex (for example, despite my best efforts it refuses to play music from my MacBook). It’s still worth it if you buy on sale, but I notice the base price has increased so I don’t know how much longer I’ll be willing to continue replacing them.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"Music cuts in and out!","reviewDescription":"My 2nd edition dot was fine. I loved it so much, I ordered the 5th Gen, moved it to the living room and expected it to be as good or better.Well, nope!  My music cuts in and out often!  Driving me crazy!  I already moved my 2nd gen to the living room and set up gen 5 for my bedroom.  The 2nd gen controls the kitchen lights and the living room.  I bought new lights and plugs for the living room and kitchen, I also enjoy music while cooking and family time.But in my room with the music cutting in and out, I am frustrated.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Great sound.  Horrible sound.","reviewDescription":"For music I love the new sound of this echo snowball.  I bought it so I could play music, podcasts and audiobooks while I get ready in the morningIt makes Amazon music sound wonderfulUnfortunately, I can’t seem to tune it to sound good for vocal media.  Podcasts and audiobooks are bass heavy and lack clarity.  So much so that I can’t use this echo for anything vocal.  I have to strain too hard to make meaning out of wordsInstead I have to use my phone with an external Bluetooth speaker when I want the clarity to understand voice media.This is disappointing.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701302400000}
{"reviewTitle":"Alexis database is very limited, not even close to Google.","reviewDescription":"I like having my Alexa but I do believe that it is drops on you and the database is very limited, nowhere near Google's capacity.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Muffled voice","reviewDescription":"This still has a muffled voice like the smaller unit.  AND she is anti-Trump 100%.  Lol!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Sadly, the best part is the clock","reviewDescription":"Worked fine the first three weeks, then not. I bought two so I could fill my room with nature sounds for sleep. You can ask it to play on repeat for up to 8 hours (allegedly). Had no issues with it until the last week or so. It'll only play for under 5 minutes then shuts off. I have it programmed as a routine, but even renewed vocal commands don't last. Also, I find it incredibly annoying that it announces my phone is connected when I pick it up. Why does it do this? What's the need!??As for it's sound, it's mediocre. It's improved with some tweaks on the Alexa app, namely a full boost on the treble and halfway on the midrange. What it really needs is the ability to control the volume of Alexa separate from media being played. Alexa is always too loud when the media is at a normal level. (I know they're 'separate' on the phone and the unit, but you'll see what I mean. A low volume setting on the unit gives a small range for volume on your phone, so you it turn up on the dot and now Alexa is booming loud.) After five generations, you'd think they'd do better. But hey, I ❤️ the clock!","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"I've ordered this one under duress. My Echo 4th gen lasted exactly one year.","reviewDescription":"I love this little thing. It makes the best alarm clock in the world; you can verbally tell it to snooze and do all kinds of other stuff. It's perfect size for the nightstand, non-obtrusive, and does all the Alexa stuff that every other unit does without a screen. But I'm extremely disappointed that the 4th Gen version I bought in July, 2022 (exactly 1 year ago) intermittently doesn't recognize my voice, and I have to unplug it to reset it. I'm talking every day or two. So say, for example, on the second 'Alexa, snooze' command, she totally ignores me and I have to unplug her, plug her back in, and wait for her to boot up. Or when asking her to set a timer. She treats me like I don't exist. Unplug her, plug her back in, and she's just fine for a day or so. But it's not funny...$70 for an electronic item that lasts a year...I'm not impressed. So tonight I ordered the 5th Gen (and also sprung for the 3-year warranty for $10, which truly offends me). We have more Alexa devices in our home than anyone I know, but I have my limits. They need to make these things where they last.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1688169600000}
{"reviewTitle":"es alto e lvolumen","reviewDescription":"el volumen maximo es alto pero cuando estas emocionado y quierens una cancion al tope no alcanza para que no se escuhe otras cosas como gente hablando en la sala o el cuero depende de la habitacion donde este ubicada","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Complicated!!","reviewDescription":"Pretty nice but definitely not user friendly!! Almost does more stuff than necessary. Takes forever to figure stuff out that should be very simple. Sound pretty good for a small unit.I’d give it a 2 stars for difficulty in setting up. But overall I guess 4 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great but, small","reviewDescription":"This device has a lot of great features. I bought it for my son to have a clock in his room. The only thing I dislike is that it is small. I guess since it's a dot, that's normal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Echo dot right on the dot!","reviewDescription":"Its dimensions and form are ideal! It stands out and is easy to spot due to its round shape. Because of its compact design, it can be easily stored in tight spaces or transported to any location.  I can't believe such a little device can produce such incredible sound!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Love the time display","reviewDescription":"This Echo is a huge upgrade from my previous one. The speaker is very clear...great for listening to my books on Audible while I do chores. It was easy to connect and set up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Upgraded Echo","reviewDescription":"Needed an alarm clock and decided on this echo. Not quite sure on using all the features like the sunrise function. Like that the light doesn’t keep the whole room lit at night.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Don’t like the dots.","reviewDescription":"The sound is better than the 4th generation but they use dots instead of dashes for showing the time; the look isn’t as smooth and as easy to read as the dashes.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Ir replaced a much bigger clock radio in my bedroom and had better sound all for a good price","reviewDescription":"So far I've used it mainly as a clock radio and alarm clock in my bedroom. I have to learn what other functions it can serve, like today's local weather forecast.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Works as advertised but routines are too limiting","reviewDescription":"Would be nice if I could make a routine that would notify me if Ring contact sensor was open more than configured amount of time.  Nope. Programmability is too limited.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Husband hates it I LOVE IT!","reviewDescription":"I got this for my son for alarm, music, timers, information…my husband was worried it would be abused…You can decide how to manage the Echo, add restrictions, then you can add more options as your child ages!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Works well, wished #'s were slightly larger though","reviewDescription":"I'm pretty pleased with my echo dot clock! I like most of everything about it except I wish the #'s were slightly larger. I don't have the BEST vision in my old age, while I can see the #'s fairly quickly & clearly, I believe that I would be better to focus on the #'s & time if they were slightly larger, or somehow either brighter, clearer, bigger pixels? or perhaps not dotted as they are? Perhaps I am missing a setting on the echo to eliminate the dotted pixeled #'s? Still very happy with the deep, base sound for such a small bedside, nightstand device, maybe next generations of the echo clock will add a brighter, larger \"light\" atmosphere function to add more light to the device instead of needing a lamp on my beside nightstand. Just a \"hope\" for future versions. Thanks","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Wonderful product but night dimmer not bright enough","reviewDescription":"see above","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Excellent","reviewDescription":"excellent just as in the picture","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"👍","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Awesome, but needs to have the temp routines revised","reviewDescription":"Love this echo dot! With one exception. I was excited to find that it can tell the ambient temperature and that can be used to set routines. I had plans to set up a routine to turn on my air conditioner (via a smart plug) in my bedroom if the temperature registered above 80 degrees after 8pm, so that my bedroom would be cooled automatically before bedtime if I'm not home to turn it on. Woohoo! Nope.... apparently, the temperature has to rise through the specified threshold after the specified time for this routine to work. So if my bedroom is already 80 degrees or hotter at 8pm, it does nothing. I really hope the Amazon tech team fixes this issue soon!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"My friend","reviewDescription":"I love her.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Excelent","reviewDescription":"Easy to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Worked well, until that persistent yellow light","reviewDescription":"Lovely, sound quality fine, working well. Two days ago I have a solid yellow light ring. Hmm, asked Alexa who had no idea. Light doesn't blink like I have messages or notifications. Tried the App, unplugging for a few hours, and total reset. Nope. Light still there. It's really annoying, won't go away, lights up the whole room it's in, and no (to repeat) - it doesn't blink and it's yellow (not orange as when resetting). An older one I have, a hockey puck style with clock, is no longer made. Not happy with this. Okay, should have known: it's 4 hrs since full reset, had a actual blinking light for Notification and wouldn't you know it, once I listened to it the yellow light went out! (Got a 4th star for that guys!) Feel better and the duct tape is put away - for now.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Please fix bug so that NPR can be shut off like anything else","reviewDescription":"Most of the time, once this echo device begins playing NPR, which I like to use for news and as background noise for my pets while I'm away, you cannot get it to shut off again. \"Alexa, stop,\" \"Alexa, end playback,\" etc. results only in the echo lighting up to listen, but not turning off NPR. I have contacted customer support, but they don't seem to regard this as a known issue, merely user error. I even tried building s routine so Alexa would shut off NPR when I say \"Alexa, I'm home,\" but that workaround failed as well. I very often have to resort to unplugging the device. Very frustrating, especially since there are reddit posts for years now complaining about this particular issue with NPR. Amazon's Alexa\/Echo team should have fixed this known problem by now.Otherwise, as creepy as AI can be, it's been super convenient to have Alexa around, especially once I added a few smart bulbs and plugs.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"All in one package","reviewDescription":"Received both Echo Dot and Sengled Smart Light Bulb for $32 fantastic deal. The echo dot(5 Gen) has a great clock display in pairs fine with sync devices. I currently synced my blink mini camera to echo which alert me if movement is detected also alerts if Amazon package is dropped off at front door. Only issue I have a minor one at that is it only have 3 light colors blue, yellow and white just plain boring!","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Need to turn off red light on base of unit when muted!","reviewDescription":"The overly bright red light on the base of the unit when on mute is horrendous. There needs to be a way to turn it off to make this a good product. I don't mind the red light at the top of the device. Bought this to try as an alarm clock on my nightstand and need to keep it on mute. The light is just way too much. I would also light to dim the intensity of the clock display.As is, this cannot be recommended for use in a bedroom where darkness is desired. I see there are rings that can be purchased to block the light. Not a very good solution when it should be a devise option.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Don’t buy if you need a decent clock","reviewDescription":"We have an older version (on the right) and I bought this one thinking it’s an improved version planning to keep in our bedroom and moving older one to the guest room. Well, this is a great example how it’s possible to ruin a decent product. Clock is barely visible on the new one and this is on the highest brightness setting. Really Amazon??!! I just set it up so have no idea if we’ll be also dealing with connectivity issues. The new one will be going into guest room and we’ll keep using the old one. If I didn’t get it on sale I would have returned it. What a disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Kept disconnecting, did troubleshooting, still disconnects","reviewDescription":"New unit. Kept disconnecting. When I went to return it, Amazon suggested troubleshooting. Did that over time and sometimes it behaved and sometimes not, still disconnecting. Finally did a factory reset which worked for a while. Yesterday it failed again. Now, it seems the option to return it isn't available. It say's it's \"replaceable\" unti 2024, but, there is no obvious mechanism or link to do so. Total fail.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Electronics burned up","reviewDescription":"Ordered November 2023.  Feb 5 2024:  heard a weird noise while listening to Audible and then smelled something burning.  Now I have to figure out how to get a replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Good luck listening to music if you don’t buy Amazon music.","reviewDescription":"I actually like this product but I bought this so I can listen to Spotify and one for my son so he can listen to his pandora but linking them is so frustrating and doesn’t work will. It seems like If you aren’t willing to pay for Amazon music you’re going to have a difficult time using this product to listen to music from different apps.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Volume is terrible","reviewDescription":"Was excited to replace my old speaker. When set at a comfortable volume for its voice you can’t hear music or your show unless you crank it up to 9 at which time its voice is shouting. It just will not modulate its volume. Trash product so far.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Disappointed","reviewDescription":"I bought this alexa to my father just work for 6 months and that's it. I trying and trying to reconnect  but nothing happens,  I need some answers about that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Wouldn't create stereo pai","reviewDescription":"The Echo performed as expected for most functions.  However I was unable to create a stereo pair with another 5th generation Echo I purchased that didn't have a clock.  After 45 minutes on the phone with Amazon tech support we concluded the item should be replaced. I received the replacement Echo with clock this week and it was also unable to pair with my existing Echo without clock. Ironically the Echo without clock easily paired with a second generation Echo I had from several years ago!I've concluded that there is some bug with the 5th generation Echo with clock that prevents it from creating a stereo pair.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Don't buy this dot if you need an assisted!","reviewDescription":"The Amazon Echo Dots look and sound great, and the visual display is a nice touch. However, we’ve had some issues with the listening ability of all of them this eco is the worst. mostly they hear commands, but often they don’t. They’re supposed to be able to detect occupancy, which was a big part of why we upgraded. Unfortunately, I have to say at least 3 times so they can be made something. I don't know  what this dot has with music I just said \"Alexa tell me the weather\" and they put music always they put music Im tired of saying \"Alexa stop the music\"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Not easy set up","reviewDescription":"The set up was very difficult and not easy to understand at all and I’ve had it over a month still not set up. Using it for alarm clock and music","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Music","reviewDescription":"Definitely problems when playing music. Plays then stops and when it starts back different song. WiFi is strong. I play boom 3 through Amazon music and no issues. I hope the new one work’s correctly. I enjoy Alexa and also music","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Unreliable Poorly maintained system","reviewDescription":"The alarm frequently does not go off. There are adds now. Alexa is a terrible assistant.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Step up in sound quality and a major step down in voice recognition","reviewDescription":"I am upgrading from the echo dot 2nd gen, which I've had for years and is still working well. I figured I could use a better-sounding speaker. The setup was easy enough but I had to reset it multiple times in order to play Spotify correctly. I noticed the whisper recognition was far inferior to the 2nd gen echo dot. I used to be able to say commands and ask questions quietly but now, Alexa doesn't even recognize me. Sometimes I speak at my normal volume and I had to repeat myself 3-4 times and get really close just to get Alexa to respond. I don't know if I got a lemon but I am really disappointed with the product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"Echo works great but we didn’t get the entire bundle","reviewDescription":"Missing smart bulb which was part of the package. I’d like a partial credit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Tap snooze doesn't work 99% of the time","reviewDescription":"Just give us a snooze BUTTON, please! Tap snooze literally doesn't work (I am following the instructions but the thing never senses the tap). I cannot seem to find the spot Im supposed to tap becuase everywhere I have tapped isn't working. I bought this device for the clock+touch-snooze+alarm sounds; I don't want to use my voice to snooze the stupid thing. I'm sending this thing back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Was damage","reviewDescription":"Home","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Sounds great, works well enough BUT","reviewDescription":"It’s infuriating that it’s not compatible with virtually anything non-Amazon.  I also don’t find Amazon music better than a lot of competitors that I’d be pumped to switch from Apple Music or YouTube music to Amazon and I can’t play those through the dot. I’m not super into it. I don’t find it as useful as I really hoped it would be.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"Clock Unreadable","reviewDescription":"Look at the pic on this product, that's what the clock looks like.  It's barely visible and I have adjusted it to the brightest setting.  I could have just purchased the cheaper one without the clock because I have to ask Alexa what time it is because I can't see it on the display.  Disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"Echo talking when I didn't ask it anything","reviewDescription":"This echo that I have talks to me when I'm on the phone sometimes as if someone's listening. One day I was on the phone talking and Echo spoke and said, \"what did you say?\" I didn't ask echo anything I was talking on the phone. And, tonight I heard as if someone was snoring in the back ground while I had my bible reading to me on echo. I don't like what's going on with this echo and it has to go out of my house!!!! Just saying to you all.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1683763200000}
{"reviewTitle":"RETURNED","reviewDescription":"did not play for me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Very Hard to See the Time in Living Room","reviewDescription":"We ordered an Echo Dot globe in Deep Sea Blue several months ago and I regretted that I had not ordered one with the clock on it. When prime days rolled around, I ordered another globe with the time display. Only light blue and white colors were offered And we chose the light blue. We are very disappointed because it is so difficult to see the time even when we have it on the highest setting of 10 brightness. The numbers are small and difficult to see. At first, we thought it was the brightness, but even when we turned it up to 10, it was still very dim. The clock is in our living room and we sit about 9-10 ft from it in the evening in a relatively dim room. Maybe the time would’ve shown up better if it was on the deep sea blue color which is close to navy. . It seems it is made only for an alarm clock. It may work very nice on a nightstand right next to your bed, which would make the time very easy to see. After reading other reviews, it seems that this particular echo brightens its self during the day and dims itself at night, no matter what brightness setting you have it on. We are sending it back because we have enough echo dots around and only wanted this one because of the clock. But obviously, if we can’t see it very well, it is not serving its purpose for us.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"E","reviewDescription":"Mas o menos","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Getting set up","reviewDescription":"We couldn’t get it set up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"If you do not need a clock on your device, stick with the previous 'hockey puck' version","reviewDescription":"For some reason the technology, voice recognition and mic activation from a distance is way worse on this version than on the last version of the Alexa. I have this in my kitchen and use it for its visual clock and timer. otherwise I would have stuck with the hockey puck version as it was far superior.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Good but not great","reviewDescription":"I love the clock and the connection to my audible catalog.Hate how i have to yell at the device several times to get its attention most of the time.The volume levels suck for example volume 4 sounds like a whisper and volume 5 like sombody is yelling throughout the house.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"it glitches - a lot","reviewDescription":"okay so hear me out - I have Alexas all over the house and i have Alexa TV's - I had two tower Alexas that finally dies and i have replaced them with the Alexa dot and this Alexa with the clock.  The dot works without issue- but this one does the strangest things.  if you set an alarm while saying the alarm is set for such and such time the alarm starts.  it randomly stops playing music even when there is no internet connectivity issues - it randomly talks.  It randomly lights up.  it really does a lot of random things - like out of nowhere it will start talking to you and give random history facts...it's really bizarre - now i have ordered another to see if this acts the same or if this one is just possessed.regardless I cant live without my Alexas and i still recommend them...I will update once i setup the other one.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Improved over Gen 4 but still has lots of room for improvement","reviewDescription":"This Echo Dot (5th Generation) has improved sound quality but is still lacking. I don't expect world-class sound from a little speaker at this price but Amazon could certainly add the ability to customize various settings beyond what's available now.There is only 1 simple 3-band equalizer that applies to the entire system. They could make it a 5-band or 7-band EQ.  They could also let you set at least 2 different EQ settings, one for the voice and one for everything else.I find that the speaker has a general overall colored sound that's hard to get around with a simple 3-band EQ, and if you have a moderate hearing loss, the Alexa voice will still sound somewhat muffled at lower volumes.The addition of more displayed information is welcome but it would be great if this were customizable as well and open to 3rd party data.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"This is not the echo to buy if you really want a good experience with Alexa","reviewDescription":"I bought this to downsize and replace an Echo Show.  I liked the fact it had the time on it.  However, I am hard of hearing.  I turn the device to level 7 volume.  I have tried everything I know to make it stay there but it turns itself down to where I cannot hear alarms that I set, reminders I set or other uses I have for the device.  I am constantly having to tell the Echo to turn the volume up to 7.  I have told it to leave it there permanently, to never change it, to stop adjusting volume levels.  Nothing works.  I never had this problem with any other echo device, so this device is not broken but it has bugs in its design.  I would not ever buy it again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Using as a clock radio replacement","reviewDescription":"Works well as a clock radio replacement, but without a battery backup for any power outage. The automatic dimming of the clock led makes the clock too dim. The iPhone app is terrible, and only useful to set up the Echo Dot and enter routines.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Clock is hard to read","reviewDescription":"The clock is made of dots and the resolution is just a little rough to be clear sometimes.  It'd be helpful if they made the numbers bigger.  I have not been able to find a setting that allows it to dim appropriately at night but still be easy to see during the day.  I don't think it's possible to configure your own preferences for auto dimming but I could be wrong. I just haven't found anything that works.  The voice recognition doesn't seem to be any better than devices that are a couple generations older - also a disappointment because anybody who has these knows how often they mess up.  In short, I see no reason to get a new one if you already had one, and I wouldn't get it just for the clock.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"clock quit showing","reviewDescription":"After just 6 moths the clock no longer shows the time","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"If you’re not technical forget it","reviewDescription":"Charged w their special chargerNothing It im bad technicallyHaving  a friend try to figure outWouldn’t suggest if u just want to just plug in!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Couldn't Use","reviewDescription":"Was a gift for my mother-in-law...I didn't have room on my phone for the app....and didn't really want to connect to my phone if I had the room.  I was ok to connect to a computer but, it only uses Windows 11, we have Windows 10.  Writing this review, as I didn't notice this being stated anywhere at the time of purchase.  It was a let-down for my mother-in-law who is legally blind and looking forward to using it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"privacy right out the window, with ads","reviewDescription":"ill start with the good, the speaker sounds good, it answers questions i asked, but at what cost?i was using google for a long time and wanted to see what amazon was about since i enjoy there prime services. heres what i found,i logged it for 30 days and my server blocked 34,786 trackers.... IN ONE MONTH, thats over 1100 per day, what do you possibly need to know to that extent?! ive ran this same test on all the smart speaker brands and this is by FAR the worstthe echo show was good, then it over time became plastered with ads, i paid extra for a display to use, not for you to shove ads on it.to me, this device is a privacy concern above others and went back. after my testing ive decided echo is not for me, if this isnt a concern to you, it was a good device, and if the above wasnt true id have kept it. the clock was a nice addition","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1669593600000}
{"reviewTitle":"Needs to be reset constantly","reviewDescription":"We have to unplug it to reset because Alexa doesn't respond, sometimes the alarm doesn't actually work....super annoying. Had it less than a year.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Amazing device with fatal flaw as music controller.","reviewDescription":"Would love to give the dot 5 stars (fantastic speaker for its size, highly functional assistant) except... Bought the 2nd gen dot and two Bluetooth speakers as sound system for a room. Sadly, after much wasted time, angst, and futile customer support, Alexa still couldn't recognize either the MusiBaby or Anker speaker for the purpose of combining them, though it could play each individually. Sent it back and bought the 5th gen I have now. Alas. It seems engineers developed Alexa to recognize only certain Bluetooth speakers, connected or not, for reasons that may seem hard to $understand$","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Poor Quality","reviewDescription":"Horrible. I thought upgrading would be a better experience. NO! This version is slower, inaccurate and so much more limited with it's responses. The only positive is playing music (and showing title and the artist) -- but really no better. Wish I had returned it! Not worth the money!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"Not user friendly for audiobooks or Apple music","reviewDescription":"If you are getting this to use as a convenient speaker for an audiobook or to play Apple Music, think twice.  I am beyond frustrated trying to get this thing to work.  It doesn’t help that is a convenient ball shape…good for throwing out the window.  I’ve never returned a product to Amazon, but I would return this if I could.  Unfortunately, I didn’t keep any of the packaging.  Do yourself a favor and wait to make sure if works for you before you trash the box!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Está genial el producto 👌","reviewDescription":"El producto está bien ,pero supuesta mente venía  2 artículos un 🔊 y una 💡 smart ,y solo me llegó uno 🙄","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"2 stars","reviewDescription":"The new 5th gen displays song titles on playing new songs. Currently no way to disable it to see clock only. I am thinking to return if not resolved.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"This works as a clock as well as Alexa","reviewDescription":"I bought this for our bedroom to have the accurate time.  Our other clock radio was always 10 minutes fast.  Since I am an on time person, I don't need that and there was no way to change it.  It was easy to set up, recognizes my voice and my husbands voice.  Alexa gives helpful reminders about when it might be time to reorder a product.  She also gives good weather alerts.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Great Sound","reviewDescription":"Great deal & usually on sale (bought two).I have an older one, the sound on the new one is much better, & the old one is still very good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Alexa","reviewDescription":"I have not set it up to household items but it wirks wrll for music and adding to do lists. Maybe one day I will get techy enough to use all the other features","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Great for my sons room","reviewDescription":"This was a great addition to my son’s bedroom. He likes to ask “Alexa” what the weather is going to be or play music from my Amazon music account.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Somehow the clock makes it better","reviewDescription":"We got this one to be a dedicated alarm clock, and it’s great for that. Bits it’s also a proper echo, so we discovered in using it that the display does text too, and this has entertained us.It’s also much less expensive than most of the music alarm clocks we were looking for.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"great product!","reviewDescription":"Got this for our grandson.  He loves it and we love that he can go ask \"Alexa\" when we don't know the answer to his thousands of questions!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Love the new Alexa dot!","reviewDescription":"I got this Alexa dot for my bedroom to use the alarm feature and clock. I love the feature of the clock lights up and I can see it in the dark without having to turn on the light. It tells me the temperature and weather, and if my deliveries have come. Very convenient!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Typically responsive Alexa with surprisingly excellent sound.","reviewDescription":"Compact device that is capable of producing big sound if located near reflective surfaces. Very inexpensive compared to the first devices that were available years ago. Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"A terrific combination of Alexa and a clock in","reviewDescription":"I love that you can set the volume level and the brightness level through the app. It's the perfect companion to somebody that needs a dependable clock to wake up every day to go to work or plan to resolve issues that involve important tasks.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Good Alexa device, the LED scrolling display leaves a bit to be desired","reviewDescription":"Good as far as the appearance and Alexa part of things, but I think they could have done a lot more with the scrolling LED display. It scrolls very slow, there is no way to adjust it, you cant set it to flip between time and temperature if youd like, cant change the colors of the lights, cant adjust the scrolling speed.I still like it for a bedside clock, but I think it could do even a little bit more with the scrolling LED's.Wouldnt prevent me from buying it again (which I did for another room)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"several failed","reviewDescription":"usually great but if it it fails you simply trash it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Overall love it but…","reviewDescription":"I bought this during cyber Monday and it’s been great but I’ve noticed that when I’m trying to listen to music it randomly pauses or glitches. When asked to play next song it pauses. I’ve tried unplugging it and turning it back on and it still has issues. I search why it glitches and it told me to move it from walls which is odd because all outlets are on walls and\/or connectivity issues.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"Unfortunately, Could Not Get Past The Display","reviewDescription":"I have two 4th Generation Echo Dots with Clock Display, and I absolutely LOVE them!  I was excited to order the 5th generation...but my excitement quickly turned to frustration with the clock display.First, the display is too blocky.  Every number or letter is composed of large dots leading to squared corners. Although it is a bigger display, I think it is harder to read and not very attractive.  The previous version has rounded corners and is much easier to read.The worst issue for me is the brightness of the display.  The Echo Dot does not auto-adjust the brightness like my other two 4th generation Echo Dots.  I could turn on the room light, and the clock would get brighter to make it more visible.  Also, when I turned off the room light, the clock display would dim to a very appropriate level.  The 5th generation Echo Dot does not do this.  I have tried adjusting the brightness level so the Echo Dot can \"learn\" my preference, but the feature is a failure.  I have to manually go into the app to adjust the display at night because it brightens up the room regardless of the light adjusting around it.  I never had to use the app to adjust the display on my other two Dots.I have not tried the other new features with this 5th generation version.  I am sure they are great, but I will be returning this item.  Hopefully, the next Echo Dot release will fix the clock display.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Very clean design and nice LED and a couple of nice features, but horrible responses.","reviewDescription":"I got this Amazon Alexa Echo with clock after switching from a Google Nest Mini 2.Here are some positives and negatives:Positives:- Almost instant reply and response (Google Nest had a very slow response)- The clock feature- It can tell you your room temperature- You can whisper and it’ll whisper back which is especially useful during the nighttime.- You can change its wake phrase.- It has many different and unique “skills” available.- It has very nice LED lights on the bottom.Negatives:- Although it has almost instant response, it’s responses are not very helpful or accurate when compared to a Google assistant.- Sometimes it just completely ignores what you’re saying even when it activates, and other times when you tell it to turn on the light or turn it off or turn on a switch, it doesn’t work the first time and you have to try a second time.- The Alexa app on your phone is absolutely atrocious! This app is extremely buggy and it’s an absolute mess to find certain settings or features and very cluttered! The google home app on the other hand, had a very clean UI and interface and was easy to use and find settings.The reason I rated this a 3\/5, is because although it has a lot of very nice features, if it doesn’t do the most important things properly, it gets very frustrating and makes the other features somewhat overlooked.Overall, I’d still prefer a google nest mini over this, but if the negatives are fixed or improved, then I’d definitely recommend the Alexa.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Should have just bought a speaker","reviewDescription":"I bought this to link with my Sirius app and to use as a speaker for radio as well. No matter what I do, or what IT does the linking problem persists and whatever I'm listening to stops after a few seconds. It's been a complete waste of time and money. The only thing it's good for is asking random questions and as a timer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Randomly Unresponsive","reviewDescription":"We like the clock feature, the ability to read song names and volume as it illuminates on the front.But even when sitting near, it doesn't always pickup your questions\/commands. Also, the volume is terrible, I keeps resetting itself to a much louder volume than we like. Not to mention, you tell it to adjust the volume... 7\/10 times it doesn't. Again, unresponsive.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Surprisingly, These Aren’t Tuned Correctly For Music!","reviewDescription":"These work fine but the sound is a serious issue if you are picky about hearing a wide range of frequencies and detail in your music. No amount of adjustment in bass, middle, and treble can correct this deficiency. Absolutely useless in a stereo pair for music unless you don’t mind an old, cheap FM radio sound quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Great a first","reviewDescription":"I bought it in April, it’s now December and it will no longer respond to any voice commands unless I push the button on the top. Tried to reset, tried to changed Alexa name idk maybe it didn’t want to be called Alexa anymore… idk other than that it works great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"My device stopped working","reviewDescription":"It was good until my device just stopped working on 12\/19\/23.  No matter what I do it just doesn’t work anymore.  No lights.  Nothing.  Tried everything suggested by Amazon and it’s way too late for an exchange or return.  Gotta buy another.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Good product but needs to play nice with others as well","reviewDescription":"I like Alexa in general, except for the fact that it still cannot play my YouTube music or play or interact with other services I like. Would have bought so many other Alexa devices if it played nice with others and also learned another language to use with family in Europe.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Nice","reviewDescription":"Works great, but uses too much data","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"It's okay I'm not totally impressed with it like I thought I would be the clock","reviewDescription":"The clock is hard to see could be bigger numerals","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Echo dot short on sound","reviewDescription":"Expected a bit better sound","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Works well","reviewDescription":"As described, works well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"It works sometimes","reviewDescription":"This is small and easy to use but she doesn't listen well. I have to repeat myself sometimes which is annoying. It keeps turning down its volume and I don't know how to stop that. The lighting is good and is compatible with a lot of my things. Not worth the price though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"Built in Eero is limited - Not Recommended","reviewDescription":"If you’re located outside the US and purchasing for the built-in EERO, forget it! it will not work. Amazon and EERO doesn’t state this in their product pages, you will only  find this out through a product support page designed for troubleshooting or when it’s too late by contacting EERO support.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Device worls great but Amazon did not honor trade in $ promised","reviewDescription":"The echo device works fine. Very happy with it. However, I used the Trade In Program and was promised a discount off the new device (a refund to gift card) after the purchase (the discount was not instant due to a glitch in their system). I called several times and every Amazon rep did NOT understand the trade in program, and kept putting me on hold, transferred me many times, and finally told me they made mistakes by sending me emails promising the refund, and kept apologizing for their errors. But NOBODY had the authority to return a few dollars that was promised. Plus Amazon has my older Echo device that was traded in, which was like brand new. Be careful when they announce a \"Trade In Offer\".","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"i had a 3rd gen echo. this seems deaf-er. a LOT of repeating on our part","reviewDescription":"love the clock. it was $30 when my echo was $1. retired and end of money for the month i had to settle for $1. Finally could upgrade recently,kind of regretting it. glad i didnt pay $60 FOR SURE !I Didn't return it when i noticed it was failing miserably at hearing us because the clock display is WONDERFUL.we mostly just use ours as a timer and weather info. we did Originally use for verbal alexa light bulb controller  for my dad with parkinson's but when i unplugged the lightbulb controller the prongs were so HOT i feared fire so i haven't tried anymore lighting helpers tho i would love to","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Slow slow sliw","reviewDescription":"I bought this one for 2 rooms, the one without the clock for 1 room and the pops for 2 rooms. The ones with the clock are so flipping slow in command recognition. The others are perfectly fine. Also, this model in both the ones I bought, mess up frequently with music playback and sometimes go to loud static, quit suddenly, skip, you name it! I frequently have to restart these clock ones. Do yourself a favor and skip the clock version. Get the pops. They sound fine, are quicker with commands, and are cheaper.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"Missing part","reviewDescription":"It’s missing the free smart color bulb that supposed is included","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Alexa","reviewDescription":"I received my Alexa and I’m sooo in love with it . I love how the time displayed I dnt have to use my phone any more to see the time .The best decision in order it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Best alarm clock ever","reviewDescription":"I was looking for an \"Atomic\" alarm clock which automatically sets the current time and found this.It dropped in and linked with my other Echo Dot.It keeps the current time synched over the internet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"This Is Great In My Bathroom","reviewDescription":"I love this.  I have two regular sized Echos and wanted the Dot for my bathroom.  I also bought a shelf to attach to the wall to keep it off the counter.  I hadn't thought about getting one with a clock until I saw this, and I'm so glad I got it.  I like to listen to music when I'm getting ready, and also just ask Alexa general questions.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Great Gift","reviewDescription":"I got this as a gift to my boyfriend, and he loves it, it saves space because it has a clock on it which is very useful. He is known to sleep through his alarm but he hasn't slept through it yet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"I can talk to it. Do not need to get up to turn it on","reviewDescription":"I bought echo to replace the radio, that was my companion for many years, died. Felt lonely or alone! during the early hours of the day.  Echo is interactive. To a point. And I do not even have to get up to turn it on! I can just tell it to come on. NPR is my station early mornings.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Perfect companion","reviewDescription":"Clock sims at night unlike previous generations. Replaced a previous generation with this one because of that issue.  Like playing relaxing wave music on the timer to get to sleep- fits well with my needs","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"I love her! Alexa I took too long to get you.","reviewDescription":"I am enjoying my alexa experience, she had me at hello. My alexa came right out the box connected to my internet. I am not even sure if downloading the app on my phone prior to arrival allowed the seamless connectivity. In any case I love it! I purchased to enjoy music anytime and to use as an alarm clock and just to try out all the features and I love it. So does my 9 year old son who asks Alexa so many questions, and learning everything she does- it’s his little companion. I particularly wanted to purchase this echo dot to have it play calming sleep induced music throughout the night. This I do on volume 2, and it’s perfection. It is excellent on voice recognition and hears my voice from another room very well once I say Alexa and give a command. I am very happy with my purchase and will be gifting my friend one for his birthday soon. It is my best purchase for my Christmas.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"I love this Amazon Echo Dot smart speaker. It has a LED display in Glacier White","reviewDescription":"I bought this for my mom and she loves that it has the display clock. This speaker is great for people with dementia or Alzheimer’s because It’s user-friendly, and all she has to do is say Alexa.Amazon Echo Dot (5th Gen) with clock | Compact smart speaker with Alexa and enhanced LED display for at-a-glance clock, timers, weather, and more | Glacier White","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Exactly as described","reviewDescription":"Ordered on Friday eve and received on Monday late morning.  The setup was complete in  just a couple of minutes.  I'm very happy with our new Echodot. I recommend this product and seller.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"llegó sin detalles","reviewDescription":"la verdad, es la mejor compra que he hecho, siempre he querido tener este dispositivo, es idal para el dia a dia y un ambiente de musica que lo controla uno mismo, la reecomiendo","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"No Clock Display","reviewDescription":"I purchased this item in November specifically for the clock function!  Two weeks ago the clock display went out!  Although the commands still work I have no visual clock!  Any suggestions on what options I have to fix this problem?  Ugh!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Downgrade in sound quality. Stick with the previous generation.","reviewDescription":"I wanted to replace the previous generation dot in my master bathroom with one that has a clock. Trade-in program made that a reasonable option. Coincidentally, the day that I looked on Amazon is the day they released this new generation for pre-order.Form factor is almost identical to the previous. Features are good. Display is now a dot matrix, which is definitely more flexible in terms of what it can display. But two things keep me from recommending this speaker:1) Poor sound quality versus the previous dot (in the same exact location and environment as my old one). Fine for podcasts, but music sounds like the bit rate is heavily compressed. Highs are harsh and uneven, and they don't extend much. Mids are messy. Bass is decent enough for the size of the speaker, comparable to the last one. One of the biggest grievances is the compression (not only of bit rate, but also of tone and volume). Even with the EQ set totally flat and at low\/moderate volume, you can hear the speaker constantly adjusting to prevent overdriving the little speaker. I've dialed the bass on mine almost all the way down and it still has a boomy and compressy sound to it. Ultimately, it just sounds like a cheap speaker subject to way too much processing to make it sound almost adequate to most casual listeners. My old one sounded WAY cleaner.. Even enjoyable. I previously never felt compelled to bring another speaker into my bathroom, but now I want to. But....2) They got rid of the 3.5mm output. Now your only option for improving the mediocre sound quality is to pair to a Bluetooth speaker, which, in my experience, is wonky at best. If your device shows up at all (my Klipsch One II from my kitchen does not), you'll likely run into the issue of the speaker automatically shutting down after not receiving a signal for a while.So ultimately, I regret this purchase. Stick with the previous generation. If you can utilize the trade program more than once, I'll likely trade this one for the old one, despite still having a couple 1st and 2nd generation devices. This is the one that disappoints.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1668384000000}
{"reviewTitle":"Problem Integrating With Ring Cameras","reviewDescription":"The Echo Dot version 5 has a serious problem integrating with the Ring camera system.  When linking the doorbell and\/or stick up Ring cameras to Alexa the audible Ring notifications go to the Echo Dot and not to your IPhone.  This means that when you are away from home your Echo Dot will be announcing the notifications to an empty room while your IPhone is silent.  There is no provision in the Alexa software to send verbal notifications to both your IPhone and to the Echo Dot.  The only way to work around this is to unclick the notifications to the Echo Dot in the Alexa software. That way you continue to get verbal notifications on your IPhone but not on the Echo Dot.  This seems like a software problem that could be easily solved but it has not.  I contacted Amazon support and they confirmed that there is no fix except to turn off notifications from to the Echo Dot for each camera.  Otherwise the device seems to be working properly.Update:  I tried to continue using the Echo Dot with the Ring alarm system bypassing the cameras.  The Echo Dot makes itself part of the Ring alarm system by listening for loud noises and then sounding a separate alarm on the Echo Dot if it hears something. The Echo Dot is in my bedroom.  My Ring alarm system is in an adjacent guest house.  When I arm the Ring alarm system for \"Away\" the Echo Dot makes itself part of that system and alarms whenever I move around in the main house.  The only way to fix this problem, according to Ring and Alexa, is to disable the Ring alarm in the Echo Dot.  This defeats the purpose of using the Echo Dot to communicate with the Ring system so I am sending the Echo Dot back.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672185600000}
{"reviewTitle":"Alexa doesn't understand","reviewDescription":"Alexa would turn off my bedroom lights when I asked for it to turn off the bathroom. It did this so much I renamed the bedroom Den so it would stop shutting my lights off. I renamed the bathroom Restroom because any work with a B is just not Alexas thing and even with the bedroom gone it still tried to shut the bedroom lights off. Also, a very common thing with Alexa is I ask it to turn on the Kitchen lights it says ok and just doesn't do anything this happens with other rooms too. Maybe my Alexa is just lazy and is like a kid and says it's going to do something that it doesn't do or maybe mine is just a liar I would be embarrassed if I put something out that worked like this. I have had to use the Lightbulb app to control the lights because Alexa says the lights are unresponsive throughout the house no they are not, your app is just crap they work through the Gosund app and other Lightbulb app Shame on Amazon for putting out something that works like this thank god everything I bought will cross work with the Google home app because at this point I give up on Alexa its crap lets hope what I hear about Gooogle Home having a better understanding of English is true too bad i wasted the money on Alexa its junk","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"that they charge a fee for this","reviewDescription":"I never saw where they charge a monthly fee for this, Had I been made aware of the fee I would never have bought it, for all accounts this is a deceptive trade practice and should be known before your purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Ugh..I am back to my original Echo","reviewDescription":"I have used an an Echo or Dot as my bedside \"clock radio\" ever since these devices came out.  This one with the clock seemed perfect.  Not.First,, the clock.  It is very bright.  I was able to dim it using the app but it won't  stay dimmed from day to day.  I finally had to turn the \"clock face\" off because Echo seems to recognize either full bright or off only.Second: connectivity.  It skips or fades out all the time.  When I am using it as a \"radio\" or having it read Audible books or even using sleep sounds the sound is spotty or inconsistent.  My other devices that rely on wi-fi coverage don't  have this issue; my Amazon fire TV in the same room doesn't  have this problem.  I had this problem with my previous spherical Dot as well.  I don't  have this issue with my original Echo which I've now moved back to my nightstand.  Sound quality doesn't  matter all that much if the connectivity is so bad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Awful voice recognition after all these years","reviewDescription":"I have two of these almost 30 feet apart from each other, in different rooms. Almost always, the wrong one responds - every morning I lean over to the device a foot from my head and say “Alexa, snooze” and the one in the living room responds. Frequently doesn’t respond at all or misunderstands. It’s amazing that after all these years Amazon is still so deeply incapable of making a good device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Very Slow!!","reviewDescription":"I went back to my echo Dot. This fifth generation is so slow to respond. I have to repeat over and over again for it to follow a command with the Smart Switch. I plugged in my old Echo Dot and compare the two in response time, turning on and off lights, fans, smart plugs. My old Echo dot wins out every time. This is fifth generation needs some tweaks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Worked great until now...","reviewDescription":"I bought this over a year ago and it was working great up until a few days ago. It seems to like to talk back with a massive attitude when we ask it to do something or it tells us it can't do that. It won't even work with our wake word now. No response whatsoever unless we push a button on top of it. I have looked all over the internet, on Amazon, in the Amazon app, unplugged it, reset the internet, and checked all the settings, even made sure that the do not disturb is not on but have not found a solution. Rather disappointed with this product. We have some of the older generations from 2019 that work better and have had no problems with them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"Gen 5 Won’t Link Home Group","reviewDescription":"Like the dot and clock. This is our 4th Echo dot we have but the others are Gen 3 and 4. For some reason Gen 5 is not supported in a Smart Home Group with 1-4. It says it right in the app. Why have a new Gen that I cannot link with the rest of my speakers to get music playing all around our home. Poor!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"I might as well speak another language","reviewDescription":"Hate it.  This model doesn't understand well.  My other echo Dot works fine.  This one, I might as well be speaking a foreign language.  Not even close, does it get commands.  I've restarted, reprogrammed and nothing.  If I didn't throw away the box thinking it would be as great as the first one, I'd return it.  What a rip off!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Something seriously wrong with this","reviewDescription":"There is something seriously wrong with our Echo Alarm Clock. Most of the time, it never respond to any commands... even to snooze. At least half the time we have to reboot it before we can make it redone to command. We have tons of other Echo devices, so it isn't user error. But this one Echo device is just faulty.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Not reliable.","reviewDescription":"We always had a 2nd gen, and we figured it was time to expand and got this 5th gen. We were excited about the larger speaker. However this doesn’t answer as well and seems to have problems understanding and hearing. It also turns off sleep sounds on loop after a few minutes. All of these issues were never present in the 2nd gen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Not a good sound quality","reviewDescription":"Sound is muffled. The LCD display is hard to read from the distance. And it is too bright to have it on night stand even though the brightness is set to Zero still it disturbs me every time I turn to that side of my bed. It has an option to turn off lcd display but then u don’t know what time is it when u wake up in the middle of the night.Overall, I would not recommend it.Also the volume is weird it’s either too low or its too loud. It seems like u can never get the volume to be perfect especially when listening to an audio books.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"less than a year and the speaker failed","reviewDescription":"Guess they figure out these don't last and that is why they only have a 90 day warranty ,, If I could find the replacement speaker I would fix it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Worked pretty good until it died.","reviewDescription":"Worked fine until it just died. Before it died for several weeks odd things would happen like always disconnecting from internet, nothing else had this problem, loosing connections with smart lights, my other echo dot had no problems with this. Often had to reset the device as much as 5 times a day or disconnect the wifi again and again with devices only feet away in same room. Again this only happened with this device, never had an problems with the other echo dot. Now its dead, never dropped, plunged in water, thrown against a wall, crushed by a train etc...Its just dead for no reason.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"\"I’m having trouble hearing. Can you say that again?\"","reviewDescription":"That's what I get about half the time with this device, \"I’m having trouble hearing. Can you say that again?\"  None of the other 11 Echo devices in my household have this problem, just the one Echo Dot with Clock.I wish they made a regular Echo with a clock display.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"When it works, it's great. But requires constant resetting","reviewDescription":"I've had this for just over a year, and in the past few weeks it's been unresponsive at night- I have to unplug it and plug it back in.  Interestingly, the clock continues to work and the alarm will continue to work- but the device will not respond. Which means if the alarm is going off, you have to unplug the device to get it to stop.  It's super annoying. I haven't changed anything so I'm not sure why it's doing this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Junk","reviewDescription":"Has never worked properly. Ask it to play a song and it will say ok here's the song and then not play anything. Usually have to say Alexa 2 or three times before it responds. When playing a podcast it will play about 5 minutes and then stop. When you try to get it to explain what the problem is it just says go to the Alexa app which is of absoulutey no help. I regret buying this piece of junk.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Glacier White?","reviewDescription":"How is this glacier white? This is grey. Should be named dirty glacier white.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"WARNING!!! Limited compatibility with Bluetooth hearingbdevices","reviewDescription":"I have a cochlear implant it works with my iPhone to project sound from my iPhone to my cochlear audio output device.  Not so with echo dot!!!  At least echo dot support not able to help. I’m afraid this product definitely not for hearin impaired","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Just stops listening","reviewDescription":"I have 3 of these in my house and 2 of them just stop listening all the time. We set alarms daily and really that is the main thing we use them for and it either won’t set the alarm or won’t turn off. You literally have to unplug it constantly to reset it. It is not an internet issue because I was just in the other room setting another kid’s alarm. UGH! Am sooooo frustrated","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Doesn’t connect Apple Music","reviewDescription":"My old Amazon dots all let me connect both my Amazon music and Apple Music accounts, which was a big factor in deciding to purchase this product. After receiving it and programming it, I learned that it no longer has Apple Music capabilities. It works wonderfully and I love the clock, so I’m willing to sacrifice not having Apple Music, but I wouldn’t have purchased had Amazon made it clear it was no longer compatible","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"not good clock for the bedroom","reviewDescription":"Even thou this product works very well the problem is with the light below it-  It disrupts my sleep-  Why is that light needed?  The light is too bright for a bedroom alarm clock","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"Amazon's Recent Downgrade of Their Own Service","reviewDescription":"Amazon has recently released a new feature for their Amazon Echo; when you ask it to play a particular song, it will play that song and other music \"like it.\"  If you ask it to play a particular album or to play music from a particular artist, it won't do it; it will play one song from that album or that artist and will then begin playing music \"like it.\"  And Amazon is claiming that this is an \"improvement.\"Even if you own the music - you paid Amazon to have access to those particular songs - it won't just play the music you own; it will play music \"like it.\"  Even if you've made playlists of your own, whether it is a playlist of songs you've paid for or not, it will not play music from the playlist; it will play music \"like it.\"As I understand it, this is a feature that was released in November.  Initially, their customer service representatives referred to it as being a bug.  They eventually had to acknowledge that this was a new feature, and that the only way to disable it is to pay a subscription for \"upgraded\" service.  So now you have to pay to have the same features you used to have.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Not a fan","reviewDescription":"I’ve had Alexa\/echo devises since the beginning. The newer releases don’t seem to be as reliable. It’s disappointing. I probably won’t be ordering anymore until they can keep them from giving false notifications, listening (light spinning) when not asked and not understanding when I do ask it to tell me something. If I repeat the question she gets it, but has to be asked more than once.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"Nice features, but one deal-breaker","reviewDescription":"The blue Echo Dot with the clock display is very nice.The sound is great, the display is clear through the speaker grill, also displaying volume, temperature, headlines — whatever you ask for. In all, a sweet little speaker.But this particular device will not play Audible books reliably.It gets started, than announces “I am having trouble playing this title” and thenceforth does not respond to any command. The book still plays, but I can’t stop, pause, change volume, or give any command to Alexa; the Dot is simply locked up.  The only cure is to cycle power.I tried going to Amazon forums, searching the web generally, resetting the device — nothing works.I need to listen to audiobooks with this device. So, sorry — I am sending it back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Comentarios sobre dispositivo","reviewDescription":"Me agrada la calidad del sonido.Me agrada el diseño.Me desagrada que este dispositivo no se sincroniza bien.Me desagrada que el reconocimiento de voz ante los comandos no es muy eficiente.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Stopped working after 5 months","reviewDescription":"Everything was fine until it stopped connecting to the internet. now it tells me my wifi password is wrong, but my other alexa has no issue connecting. I tried unplugging and resetting it but now I can't even get it into setup mode. It just sits with a solid blue light. My alexa app doesn't even recognize it anymore either. Pretty disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"difficult to use.","reviewDescription":"Difficult to use. Wont accept voice commands directly. Must use my phone. Time face is dull. Hard to read at night. Instructions are sketchy. BUT the sound quality for radio is excellent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"I don't like it","reviewDescription":"I wear glasses, so at night when I take them off for bed, cannot see numbers, if I bring it closer to me, then the light is too bright from the clock, you can only dim them so much, I ended up turning off the display, so now it is just an echo dot, pretty useless as a clock....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"Faulty power cord","reviewDescription":"I just ordered my second echo dot with the clock because I love them so much! I just received it today and while trying to set it up the power cord would not work🤦🏼 they don’t make just the replacement cords so now I have to completely re order a new one ugh…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Very disappointed…","reviewDescription":"I have to reset it several times a day. Very disappointing! Sometimes it just shuts down when ever. Wish I hadn’t bought it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"For being a speaker does not sound that good","reviewDescription":"Connected to phone for Bluetooth and crap sound. So now it's just a clock. I thought amazon made better quality than that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Expensive. Have to replace in less than 1 year.","reviewDescription":"A few weeks my dot stop responding to voice commands. Had to unplug and sometimes factory reset to get it to work. Today it started to make a noise and would not reset. I have to buy another in less than one year.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"this one has a mind of it's owne","reviewDescription":"this echo dot just wants to do what it wants to do and not take orders all the time . we tell it to put it's volume to 6 and then it returns to 4 when you need a reply from it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"I was unpleased","reviewDescription":"I was well pleased the first 2 weeks after I I programed it,then when I asked if to play music or questions or alarms it mixed them up with one another,I just went back to using my old alarm clock music device","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701475200000}
{"reviewTitle":"Inaccurate information","reviewDescription":"Information is usually incorrect if asked a question seems to use old information from unreliable sources one of the reasons I purchased echo was to be able to get information about mountain pass road closures and other questions answered hands free","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Eero built in..... don't belive it.","reviewDescription":"Have this connected to my Eero router.  The echo dot is supposed to have eero built in to function as an extender.  This hasn't worked since I received it.  Always says out of range for eero built in.  The dot is only about 25 feet from the router!!  Worthless.  The clock is nice and the sound is better than my old dot.  Thank goodness I only paid $25 for it, however the eero extender was one of the reasons I got it in the first place!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Has to be plugged in to use","reviewDescription":"It’s disappointing because the photos make it as though it doesn’t have to constantly be plugged in to use but I’ve come to find out that it does. Not convenient like the photos show.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Internet Connection Issue","reviewDescription":"this was my first time purchasing an an alexa and i have to say i’m deeply disappointed. i have tried to trouble shoot so that it could connect to my wifi. i’ve plugged and unplugged it multiple times and i plugged it directly next to my wifi router and it still won’t connect. my sister and i even disconnected our phones from the wi-fi and it still won’t work. every other device in my house seems to be connected just fine to the wifi router so that’s the reason i haven’t restarted it and to be frank it would just be a hassle. this experience has been a deeply unpleasant and disappointing experience for me and i advice people who plan to purchase this product to please think twice.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Can't see at night.","reviewDescription":"Had the last gen and got this one. Big step backwards. impossible to see at night from 8 ft away.  LED's are ridiculously bad. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"horrible product","reviewDescription":"Doesn't connect to wifi out of the box?? Looked up this issue and it happens alot apparently (small indie company btw) now I have to go thru the hassle of returning it and buying something else L product don't buy unless you want your time and money waisted","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"If it stayed connected to the internet, it might not be so bad, going back to Google","reviewDescription":"Wow, love I can ask to play my music playlists, it would be nice if I could though.  Wow, stream a movie on my TV, work all day, no problems.  Stream music, ask for the weather.. \"sorry, I can't connect to the internet right now\" or.. just hear 14 seconds of a song, wait 5 minutes, then it plays again, for, 16 more seconds.  Shame.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Unreliable","reviewDescription":"I bought the 5th generation Echo Dot Clock after my 4th generation Echo Dot clock started randomly going unresponsive and spinning the blue ring for hours\/days at a time.Unfortunately, the new version has its own problems, where it'll play the first thirty seconds of a song and then simply stop. It doesn't seem aware of its own failing, and if you ask it why it stopped it'll say it has no idea what you're asking.The quality of the Echo devices' software seems to have declined dramatically in the last year. Perhaps cost-cutting, as Amazon realized this division was losing billions of dollars per year? :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"Just like 1st gen, will not connect","reviewDescription":"I don't know why I thought a new one would work any better than the 1st gen, but it just will not connect to the wifi. I've tried everything. Too much of a headache, it's just not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"If you’re using this with Spotify, avoid!","reviewDescription":"Had a 3rd gen echo dot and wanted to add an additional speaker. I use the echo as a timer, to play Spotify, and for weather. The addition of the new 5th gen echo dot has ruined the entire system. Not only does the new device not show up as an option to play, the old device is now “restricted” and unusable. Search this issue and you’ll find it’s not new - it’s been going on since 2020 with no solution. Whatever the issue is - Amazon not resolving because it’s Spotify and not their product, or Spotify not resolving because it’s Amazon, it’s beyond frustrating that users are caught in the middle. I have restarted, re-paired, uninstalled and reinstalled, allowed explicit content (as per the recommendations on the Internet) and I’m done. I will be returning and attempting to get the old speaker to work.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1671667200000}
{"reviewTitle":"Keeps pausing- Returning","reviewDescription":"Thought we would upgrade our old Dot to a newer one with a clock. Big mistake!!!! This one will play a few minutes then pause. I looked at the trouble shooting and it said it could be a poor Internet connection. But the old one doesn't have a problem. I did disconnect everything from the Internet and it continues to pause. Returning 😔","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Stopped working","reviewDescription":"UPDATE: My Echo Dot continues to be defective. An Amazon representative suggested trying a new power cord. The device is still shorting out and is not working. The website says eligible for return through December 15, 2023. I expect my device to be replaced at this point.The Echo Dot I just purchased 6 months ago completely stopped working. I went through every trouble shooting strategy possible. The device simply won’t respond at all to anything. Amazon will no longer accept a return and only offered trouble shooting options with no follow through. This is not acceptable for a device only 6 months old.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"They removed the 3.5mm output jack.","reviewDescription":"I use 3 Eco Dots for my stereo systems so it plays music through my killer speakers. I'm returning the new 5th generation one I bought. Guess I won't have the clock and just use the older style. Disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"What's the glitch?","reviewDescription":"When I first got it I absolutely loved it, worked for t weeks then started skipping, would not turn off unless I unplugged it, stayed in repeat mode for reminders would not shut down. Couldn't listen to my favorite stations without unplugging device. I was very disappointed. Returned device waiting for  replacement.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Almost what I want","reviewDescription":"I’d like to have fewer devices overall, and I thought this would replace a clock and older dot.  In theory, it should, but the adaptive brightness is an abject failure.  I gave it a few days, tried adjusting the brightness at night (dimmer) and in the morning (brighter) to see if it would learn my preferences.  It does not.  At the brightness I need for daytime, it’s much too bright for sleep.  The dimness needed for night makes it invisible in the day.  Alas, it could be great, but it does not work for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675728000000}
{"reviewTitle":"Not happy","reviewDescription":"I've had about three or four of these things, never had any problem with them. This one doesn't even know where it is and I can't seem to fix it! I have to tell it where it is so they can get me the weather. Help! I want to say something positive it does sound good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Not very useful, or smart.","reviewDescription":"I think they might have dumbed down this speaker, because it can't seem to do anything consistently. Doesn't have a lot of features. I can only use it for music, alarms, notifications, shopping list, and that's about it. voice control of the tv doesn't work half the time even though it says it recognizes it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685750400000}
{"reviewTitle":"Want to love it","reviewDescription":"Motion detection is useless for starters, temp sensor reads about 7 degrees cooler than actual temp, and theres no way to calibrate.  Whatever theyve done with the new microphones... they WORK! It will hear you through walls, across the house so take that for what its worth, but shes listing. Clock feature is nice","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Terrible display","reviewDescription":"Display is hard to read and distracting when the song titles constantly scroll across the screen and no way to stop it. The dots are too big and hard to read at night. Audio quality is good but they should have used the display on the 4th gen units. Wish I could find a 4th generation one with premium sound and clock. Old display was so much better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"Not as good as the original old Echo Dot","reviewDescription":"I do like the sound of this as far as music goes, however, my old original echo dot was more responsive than this one. We are constantly having to repeat ourselves to the point that my husband yells at this thing 🤣 \"She\" is always repeating herself even though we answer her during quizzes. Sometimes she just starts talking about something when we are having a conversation nearby. My husband always tells me to \"just unplug the damn thing\" 😵‍💫Maybe I just got a bad one. I don't know, but wish I never bought this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675814400000}
{"reviewTitle":"Doesn't always work","reviewDescription":"It just stops playing music and then restarts few minutes later. Sometimes it stops permanently. It may have been on for a very short time and just turns off. It also can rarely answer a question. Alexa is kinda stupid.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Did I get a dud?","reviewDescription":"I absolutely loathe this thing. It never responds to prompts, fails to detect devices, and generally sucks. The echo pop works perfectly. What gives?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694649600000}
{"reviewTitle":"This thing does what it is supposed to most of the time, but frequently glitches.","reviewDescription":"Bought this as a gift for one of my adult children, but he decided he didn’t want it. We kept it to use. It’s just ok-glitches out fairly frequently. Voice recognition is not too great-apparently it will answer to anyone in my household, not just me and my husband. I don’t find it all that useful, but we decided not to return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Great product!!","reviewDescription":"Love the clear voice.  Really love the clock especially at night, it has a soft glow. The dot is a good alarm  clock too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Echo Dot Gen5","reviewDescription":"This is my first Echo. I liked it so much I bought one more. Added outlet plug and lite bulb. No problems. Install was easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Huge Echo Fan!!","reviewDescription":"I have roughly 12 Echo devices all throughout my home and I love them!!! I use this one as an alarm clock and it works flawlessly. You won't be disappointed!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Happy!","reviewDescription":"I’ve been without an Alexa for almost 2 years… I’m so happy to have this back again, and the sound quality playing music is fantastic.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Love the clock feature!!","reviewDescription":"Our house hold has plenty of smart devices. I am so happy with this new echo dot with the alarm clock feature. It’s super convenient to have the time showing on the device. I enjoy having it on the night stand and be able to control or ask other devices to turn on or off.I highly recommend if you have smart devices with Alexa to upgrade your alarm clock with this echo dot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"I Was Worried About the Clock Light","reviewDescription":"I bought this product to replace my alarm clock.  When I read a review of the Echo Dot with Clock in the Wirecutter, I was a little worried that the light from the clock would be too bright and keep me awake at night.  Good news:  the clock light is not in the least bit obtrusive.  Everything about this product has been smooth from the get go.  Alexa can play my Apple Music or my Sirius XM radio.  She is a quick learner and setting her up was a breeze.  I don’t think I’ll ever get another clock radio.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Great information comes from this","reviewDescription":"Still can not connect my Amazon music, but it’s alright; I love my little box that odd packed with a huge punch. My grandson loves to ask her math questions.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great Gift for a Non-Tech Savvy Senior","reviewDescription":"This was a Christmas gift for my 88 year old Aunt. My initial concerns about her using it quickly vanished once I set it up for her. She jumped right in and is listening to the music she loves from the 30’s and 40’s. She’s already obtained phone numbers and other information that was difficult for her to get as she does not have a PC or Tablet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"I love having Alexa at my fingertips.","reviewDescription":"I love that she has the time displayed where I can view it easily. I love that she sets a timer when I'm cooking or gives me the outside temperature.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Great","reviewDescription":"Cute and sleek. Amazing quality clock and Alexa. The clock light self dims when I turn off the lights in the room. Better than expected.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Love it","reviewDescription":"Put off getting this since I had an alarm clock and figured that was good enough. Wrong. This is a really useful gadget. I use it to wake me, get myself out of bed, and get the day (and me) going (by playing rousing marching music). Also, I time my exercises and get the weather and stock prices with it. It really has been a boon. Now I can't live without it (well, I could I suppose, but I wouldn't want to).","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Love it!","reviewDescription":"Initially I was annoyed with my purchase as I wanted to pair it with my desktop computer however there was not an iTunes web app for it and I already have sooo many apps on my phone. Once I gave in and installed the app on my phone, I fell in love with it! So many things it can be used for - it reminds me to take my evening medicine, tells me the water in the morning, etc. I have not yet moved into the \"smart home\" arena yet as I don't want to buy new appliances but I really appreciate the applications it has for daily life.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"I love my new echo","reviewDescription":"I love the clock on the Alexa! I used to wake up in the middle of the night and have to ask Alexa what time it is! Now I just roll over and look! I really lole the shape of this echo too it looks nice in a room!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Great","reviewDescription":"I got this as a gift and was worried I would need a subscription or have Amazon Prime to be able to use it but all you’ll need is the Alexa app. I specifically was asking for a Bluetooth speaker and an alarm clock that I can dim the display on so it’s not so bright while I’m trying to sleep. I got this and it’s like two in one. I will end up getting a separate Bluetooth speaker since this has to stay plugged into the wall but I can connect my Spotify through the app and it will play my music that way. You can turn the ring light off through the app (I think it’s the “do not disturb” feature) and still ask Alexa for whatever you need. Before, I was flipping my old alarm clock on its face to keep the light from bothering me but now I can ask Alexa the time, turn the display on and off, and ask for the weather all from my bed and without getting on my phone. Alexa is shockingly good at hearing what I’m asking for even if I’m not talking loud or on the other side of the room which is nice so I can keep the noise down so as to not bother my roommate. I’m so happy with this and will be recommending it to anyone.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Fue un súper regalo que me hice.","reviewDescription":"Me encanta. Suena súper chévere, es bonita y tiene muchas cosas simpáticas.Ojo, al software le falta mucho, y la aplicación, al menos para android es lenta y medio enredada, pero la verdad, que esos puntos malos, no le quitan nada de todo lo bueno que tiene.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"This is the best thing since sliced bread!","reviewDescription":"So enjoyable I bought a second for upstairs bedroom.  I enjoy the  warm, rich, mellow tone and immediate response of Alexa to my request for music.  Everything about this device from its pleasing appearance and display is awesome and notifications from Amazon regarding orders and shipments is timely.  I also like the weather updates. Alexa is a very nice addition to my family. WAY TO GO AMAZON, YOU HIT ANOTHER GRANDE SLAM HOMER with this one!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Love my Echo Devices","reviewDescription":"The price is right.  I have an echo device in just about every room in my house.  I use this one to listen to music when I'm enjoying the day\/evening on my patio.  I'll probably use it for a travel device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Talkie thing","reviewDescription":"Works as intended.  Tells me the weather and an occasional joke.  Clock feature makes asking the time unnecessary and cuts down on useless conversation.  It has a lot of other features I don’t use but maybe useful to others.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Great companion and helpful in daily control of items and events","reviewDescription":"Purchased this echo from my wife for a Valentine’s Day present gives her somebody to talk to when I’m not home we have used it for finding items on the fire TV. We have also used it for setting timer for cooking asking about whether and especially severe weather and it even sings to us, the cat didn’t know what to think about that at first, but even she’s getting used to it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"VERY IMPORTANT READ BEFORE YOU BUY","reviewDescription":"If you have an android smart phone, the Alexa app will not run. I have a Samsung J7 which was not compatable witrh the APP. Noiw I already bought the Echo 5th Gen (3) and I am getting frustrated with the situation. The smartphone or android device HAS TO BE YOURS and has to be registered on AMAZON. So with no way to program these buggers I had a friend come over with his phone  which had the app and he got them programmed. Problem: tnhe 3 Eco Dots were registered to his AMAZON.  When I ashed ECHO where I was, it gave me the name opf his coty and not mine.So I had my buddy DEREGISTER the 3 echo dots and after speaking with support, I ordered a FIRE HD8 tablet, It came preloaded with the ALEXA app. So I got the battery charged and got connected to my wifi. From their I confirmed my Amazon credentials and I was able to pen the app and within 10 minutes, the echi dots were programmed.So if your sart phone is registered on Amazon, look up the Aexa app and if it lists your phone with red X on either side, you will have to buy the tabket,","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Perfect","reviewDescription":"I really like this echo dot. It is the perfect size for my bedside table, it does not have bright lights so it does not make it hard to sleep. But best of all it gives the bedroom temperature. Love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Convenient with the time showing.","reviewDescription":"I now have several of the Echo\/Dot units spread about the rooms. This one with the clock is nice for my husband to see what the time is. Having this unit has helped me in many ways. I can drop in to say reminders, be sure all is ok in another room. I use the shopping list and reminders. The sound quality is just fine for us, I found I can slow down the voice so I can better understand what it is saying. Plus it is just plain fun.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"A great clock for any room","reviewDescription":"I bought this clock for a guest room and ended up using it myself.  I'm very happy with all the features - amount of light, ease of reading the clock, and integrating with the rest of my Alexa items.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Better than my old clock radio","reviewDescription":"This has replaced my old clock radio.  I can ask Alexa , what time is it?  And Alexa, set an alarm for 7 am with many choices for alarm sound and volume using the app on my phone.Also it plays nature sounds like rain or surf for free.If you can wait until Black Friday in November you will get a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"How did I live without you, Alexa?","reviewDescription":"I never thought I'd get a smart speaker but this one was so inexpensive and so I fell for it.  So easy to set up and use, and great sound in the bathroom where I keep it.  But I used it to control other speakers in the house too.  Really happy to have tried it and maybe will get another 1 or 2.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Alexa...","reviewDescription":"Ya know what, sometimes when you're alone it's nice to have someone to talk to, this covers that. Games, music, weather, time, jokes, it does so much. I use it with smart devices like my lights and works good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Amazon Alexa","reviewDescription":"We have 4 Alexa's in the house and we use them for everything! Music, alarms, reminders, We even use them as intercoms to each other instead of yelling up the stairs to kids 🤣 love these so much!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"My 2nd one","reviewDescription":"Best feature is the clock but I love having an Alexa in two different rooms now and the fact that I bought smart bulbs and then they can both turn them on at different levels of the house","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Great sound for the size, love the clock feature","reviewDescription":"I gave this as a gift, they love it. Especially the size and sound quality. She put it in the kitchen so she can listen to NPR in the mornings when making her all-important coffee. I like the clock feature, and easy to use manual controls on top of the unit. Sound quality for music is better than my older Echo units.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Love the Echo Dots","reviewDescription":"I was originally hesitant to get a Dot in my home and decided to start out with a Gen 3 for my living room. Only after a month, I ordered a second one for my bedroom.After using those for about 3 years, I decided to upgrade to the Gen 5 and once again, haven't regretted having them.At times, as with my old dots, I have to repeat myself, but that may be due to placement, so I don't hold that against them.  My favorite part is the display. Being able to look over and see the time has let me remove multiple clocks from my home just for that reason. I also love that there is a feature to dim the display when the lights are out (especially in the bedroom when trying to go to sleep).Even though I've had these for 2 months, I just seen that some questions are also answered with text on the display, such as weather, measurement conversions, most math equations, spellings of words, and even what music is being played.If you want to get an Echo Dot or upgrade the one(s) you currently have, I highly recommend this generation, just for the endless options. And the round\/ball design add a little art influence in my home that was pretty lacking from before.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Newer doesn't always mean better","reviewDescription":"EDIT: After submitting my review, I received a phone call from Amazon customer service. She asked if she could try to help with the problem. We spent an hour on the phone trying to get the issue cleared up, which didn't happen, but she was very nice and apologetic. It doesn't make sense that Alexa cannot play music from Amazon Prime, but reading the Amazon Forum, it looks like similar issues started a couple of years ago and was never completely solved.I liked my older Alexa, but started having connection problems so I thought I'd spring for a newer model. This replacement is an absolute dud. The sound quality is poor; the voice goes loud and soft in the same sentence. Ask a question-bright light, no answer. The clock does work, but that's about all it's good for. I'm really disappointed in Amazon all around now.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Terrible","reviewDescription":"This product does not pair properly with the  iPhone. It will connect and disconnect randomly. It will suddenly connect and turn on at full volume. It makes weird beeping noises randomly. Even the clock doesn't really work properly! It will get stuck at a time for 2-3 minutes and then catch up to the proper time in a few seconds. How do you make a product with a clock that doesn't even work properly? That all said, the brightness of the clock is just fine. If only everything else worked properly.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Not a good wifi extender","reviewDescription":"I bought this for the purpose of extending my eero network as well as use it to see clock and other Alexa stuff.Pro - Looks nice on desk, I got light blue. Speaker seems ok.Con - It actually limited my wifi in the room I placed this. The reason is that I found there is some sort of limit on it. I was getting better wifi signal without it. It actually dropped my wifi from 200mbps to 35mbps which is significant. I returned it immediately. If you are buying it for the clock, display is small and not that bright. I would rather spend this money on echo show 5 which is of similar price and gives you much better value. For $50, this does not make sense at all. You would buy this only as a cheap alternative for wifi extender and that too place where you are getting no wifi and ok with at max bandwidth of 35mbps. I can tell, you will soon get very frustrated and turn off wifi extender and at that point it’s no better than the cheapest echo dot which comes for $5 in deals mostly.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"Worked well for about a week...","reviewDescription":"My new Echo Dot (5th Gen w Clock) worked perfectly for the first week, and suddenly and inexplicably now pauses every 20 seconds or so.  I ask it to resume, then it resumes for the next 20 seconds, then pauses.  Based on Amazon's Echo forum, this appears to be a common problem, but for some reason Amazon has yet to correct it.  Based on feedback from other users, i have restarted and reset the device, as well as my router.  Nothing worked.  Suggestions that it may be cause by \"poor wifi\" or proximity to the router make no sense, because my wife has a gen 3 device in next room, which is further away, and it continues to work without interruption.  Bottom line:  I don't recommend this device until Amazon resolves this problem.  This is very frustruating","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Junk","reviewDescription":"I saw this and said wow this will be a big help to me was I wrong nothing but a headache. Have tried to get this thing to work now for almost a month and it gets just about everything wrong in one week it starts repeating the reminders all day long to the point that I get upset with it. I thought this would be a great thing to help me remember appointments and help remember to take my meds on time every time it's not I bought the smart plugs to try and help keep the home at a current temp and Alexa could do all this this it can't. The only thing I found it can do is to tell time and temp outside and inside. This might be a good start on some kind of AI or ok the talk to kids but for older people just keep your blood pusher meds handy LOL.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Don't buy this echo dot.","reviewDescription":"Seriously if you looking for a long-term user this is not the product. I got mine on Oct 13-22. Two days before it stopped working and I contacted Amazon customer care. They told my warranty had expired so they couldn't help and offered me a discount to purchase another Echo. I used it for only one year. And it stopped working after my warranty ended. It's wasted my money. I don't know any other people who have the same problem as me. But now I'm not going to buy this trash again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"2 Echo dots with clocks-  Both ceased working after 10 months.  A rip off!!","reviewDescription":"I bought  2  Echo Dots with clocks.  Both have stopped responding to my voice after 10 months of working fine.  Very expensive for something that has such a sort life.  I am returning them as the warranty window 12 months it looks like.  Amazon customer service is really crappy and when you search for answers,  very little good information can be found.  I searched for 20 minutes and never did find an answer to what the warranty period actually was.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Stopped working after 3 months, 5th Gen w\/ clock","reviewDescription":"Absolutely loved it... while it worked (3 - 4 months). Performed all trouble shooting techniques recommended by Amazon and YouTube to no avail. The clock still works (nice clock on my desk for the price, lol.) Refuses to connect to wifi. It is Eero enabled. LOVE my other echo devices - best (and only) personal assistants I've ever had. Unfortunately, it's too late to return it. 😪","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Broken within a year","reviewDescription":"I bought this echo 5th generation with the clock and it just stopped working. It sits in my formal front room where it hardly gets used. I’ve tried unplugging it and doing all the reset steps and nothing works. No sounds no lights, just turns off and then it’s dead. I have no young children or anyone who even comes in this room so there’s no reason it should be broken. I have 7 of the older version echos the flat ones and I’ve had them for years. Never have I had an issue with one just stop working. This is a piece of junk and for the amount of money you pay you would think it would be better then the older versions but it’s not. DON’T WASTE YOUR MONEY ON THESE NEWER VERSIONS WITH THE CLOCK. Go for the older versions that are flat.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700524800000}
{"reviewTitle":"Difficult to use","reviewDescription":"I bought this product and thought it was going to be great to use.  I first bought a smart light bulb, and I couldn't get it to work.  It took a call to support to finally get the bulb to work and I do love that it works now.  So why the bad review.  Because I bought a Meross plug which states is compatible with Alexa.  I couldn't get it to work.  Call support and they tried to walk me through it, and it still did not work.  We couldn't get it to connect to Alexa.  It said it was connected, but it couldn't be found in the connected devices.  The tech refunded the price, and I must send it back.  My schedule is very busy and this extra chore is not appreciated.I have had a person computer since 1984.  I do not usually have issues, but working with Alexa is very difficult.  That is why it is getting a one star review.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1676419200000}
{"reviewTitle":"Color is different","reviewDescription":"The color is different than what the site describes and different than the site’s photos. It is NOT white, it is light blue. Don’t understand why Amazon would call the product glacier white as it obviously is not. Other than the color, it’s a decent device.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Little light won’t go out.","reviewDescription":"I have a hockey puck echo but I wanted this one because of the clock feature. I like it but it has this very bright light that won’t go out. Thinking about returning it. Otherwise it works great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"A Dot Not","reviewDescription":"I like that this dot is small & convenient unfortunately I don’t like the sound quality the highest it goes still sound low to my liking. I  like the first generation way better it was much louder.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Echo Dot","reviewDescription":"The novelty of asking it questions is fun but, you end up primarily using it to play music. It has decent sound quality for the price, easy set up. My only complaint is that it has to remain plugged in as it has no battery.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"I love these Dots, but a couple issues","reviewDescription":"I've been using Amazon Alexa Dots since quarantine. I love the sound quality, the size of the unit and the shade of white. This new generation has a couple issues, in my opinion. I don't like that I can't turn off the thing where it displays the name of a song that I'm playing - I already know what I'm playing and sometimes I want to see the time right after putting a song on and now I have to wait for the artist and title scroll to finish. Also, and maybe this is just me, but I have to repeat myself to Alexa a lot more with this one than with the previous generation. Finally, I liked the font on the display for the previous generation better. These are largely superficial issues individually but together make me a little less enthused than with my previous Dot.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"Random crackling sound is startling","reviewDescription":"This would be a great product if it didn't periodically make a startling crackling sound that scares my son out of sleep, homework, or whatever else he's doing. It's become an overpriced dust collector bc he doesn't like to have it turned on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Random light at night","reviewDescription":"Love it but I keep getting random bright blue light at night. Wake me up every-time with its bright LED. Might have to place this elsewhere instead of in the bedroom.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Echo no","reviewDescription":"I can’t get the sound to remain at a constant level.  I set it for level 6 and it keeps dropping down to 3.  I have not heard the alarm twice.  It’s very annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Amazon Echo Dot 5th Generation","reviewDescription":"I was hoping it would have been a little bit bigger and louder. I had to raise it up higher so I can hear it in the next room.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Limited compatibility","reviewDescription":"I got this mostly to use as a Bluetooth speaker but it seems like most of the apps I want to listen to things on won't connect to it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Overall a good product!","reviewDescription":"I love playing music on it, the only thing that irritates me is that it resorts to amazon music unless i say “on spotify” even though i set spotify as the primary music app. love all the features of it though!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Alexa is the best","reviewDescription":"I’ve had my Alexa for a while and I love it","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Easy set up","reviewDescription":"Had one of these devices that dropped and broke it. Got a new one for Christmas. Love this device for clock, but wish it was easier to change brightness. Easy set up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"Use it every day","reviewDescription":"It’s not quite the color thought it would be from the pictures I saw but the clock quite big and the things it can show you are a nice bonus","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Awesome!!😃❤️","reviewDescription":"I love it!! I replaced my old Echo Dot because it was acting up. This one is great! And I like that even if the power goes out during the night, this one is always right! ❤️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Good but not great.","reviewDescription":"I have to reset then a lot.Alexa Guard no longer works with and even if you set up Emergency Assist, Alexa Guard is supposed to work but doesn't.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Nice looking and more volume than the flex model","reviewDescription":"Like the looks and the ability to adjust the sound volume. Clock and visible countdown timer is wonderful addition. The one negative is the sound is a bit on the basie side, thus four stars instead of five.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Not as nice as previous generation","reviewDescription":"I highly prefer the display of the previous generation over the complete blocky style of the new generation. Other than that, I feel they are pretty much equivalent in sound and features.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Great product from Amazon","reviewDescription":"Purchase this for my grandson for Christmas so he could get up in the mornings on his own. It’s very easy to set up and it came with a lightbulb that you can change colors. Very nice gift very satisfied.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Great sound and convenience!","reviewDescription":"I bought one without the clock and regretted not having that easily read time of day. Love this one. Would've preferred a Green color to coordinate with my bedroom but ...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
