{"reviewTitle":"Last 15' one I ordered was 24AWG in 2023, now 26AWG, reduced quality at 4K on sensitive equipment","reviewDescription":"Last 15' one I ordered was 24AWG (9mm dia) in 2023 and could do 20' @ 4K (see picture black checks), now 26AWG (7.5mm dia), reduced quality at 4K on sensitive equipment 15' max at 4K (see picture, blue checks and x's), so subtracting two stars as Newer laptops use a lower power HDMI chipset and need thicker cables yet the cable sold is now thinner than in 2023.My older laptops from 10 years ago (2014) can go 30' @ 4K with 30AWG HDMI Cables!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Good enough for the price","reviewDescription":"Better than most","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"It’s ok","reviewDescription":"Ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Works fine for me","reviewDescription":"It works fines for me. Comparing to it’s price, the picture quality is good enough to work on. The wire length is fair enough too.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"HDMI Cable","reviewDescription":"Great connection, once HDMI is connected the picture is clear.Easy to assemble to your TV.Cost value is great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Cables","reviewDescription":"This went with the blue ray player gift so I would think they appreciated it. Thank you","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"stiff, but cheap for length","reviewDescription":"If this was a cord that I wanted to leave behind a TV or other out of the way area, this might've done the job really well. However I wanted flexibility to be able to use it with my projector. This didn't fit the bill with how stiff it was. I ended up finding something better that's braided so it could flex easier","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"It works, but is very bulky","reviewDescription":"I had to return this item.  It was very stiff and bulky.  That quality was good, and perhaps that amount of material was important to assure good picture quality.But the connectors them selves were also very bulky, and especially thick.  That thickness made it hard to insert into the socket in my TV, as the sockets we behind a cabinet ledge which interfered.Okay product if these qualities work for you.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Fanfucional","reviewDescription":"It's ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Wiring","reviewDescription":"It was ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Caution at 15 feet","reviewDescription":"A word of caution for these cables.When I need new HDMI cables I don't even blink - I just order them from Amazon. In a general upgrade, I got a new 4K UHD HDR television, Apple TV 4K, a UHD Blu-Ray player, a brand new Denon Receiver, and the new Comcast Xfinity XG1v4-a box that does 4k60.I ordered all new cables because I knew I needed the the 18Gbs speed and wasn't entirely sure some of the 6yo+ cables I had could do that so no big deal. I also need about a 12' run and so I just went with these 15' cables. My first reaction on opening is that they are huge. Massive cables and I figured this had to do with RF shielding. After running all the cables I sat down ready for some glorious HD.All sources were ran to my Denon AVR-S540BT and then my Samsung Q7.To my dismay, these 15' cables resulted in troubles including:-Apple TV running in 4k60 with Chroma 4:0:0 (screen went blank at 4:2:2); 4k60HDR flickered.-Xfinity Box at 4k60 and 4k30 resulted in no picture, needed to set it at 1080p-I didn't really mess with the blu-ray player because I knew I had a problem anyway.I did a shoddy run with a 6' cable and everything worked so I knew it was cable length. So long story short, these 15' cables may not work for your purposes.For those of you interested in what I did, I did research on AV forums and discovered things called Active Cables and I purchased 15' DynamicView from Monoprice. I was able to get 4k60HDR at 4:4:4 on the Apple TV immediately. Oddly enough it only allowed me to see 4k30 on the Xfinity box and I replaced that with a BestBuy Insignia 12' cable and got that up to 4k60.So just be aware that depending on the oomph of your source, these cables may not deliver as promised.","isVerified":true,"ratingScore":2,"reviewReaction":"7 people found this helpful","country":"United States","date":1528675200000}
{"reviewTitle":"Stop working after 1 month","reviewDescription":"After using the cable for 1 month, the display on TV started flickering. No fix after restarting both TV and laptop. This is very disappointing experience. I bought a same cable in different size years ago, it worked well. Not sure if it’s just individual case. Gonna get an exchange and give a second chance.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"A very fat cable.","reviewDescription":"I guess the price I paid for a cheaper product was that it used a very thick cable. It is like having three normal HDMI cables rolled into one thick one. I don't know why they did that. It works but leaves a rather big bump beneath the rug I ran it under.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Never got it to work","reviewDescription":"Tried to set up a capture card with these and troubleshooting found out they are not good enough quality for that. They should be fine for a computer monitor on the average desktop but for gaming save up for the best quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Lasted a year, maybe…","reviewDescription":"Cannot maintain connection with the TV repeatedly loses and then regains picture without me touching it. Purchased Feb 23,23","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"1\/2 of the 2 pack worked","reviewDescription":"Using this cord with HD document cameras. Bought a 2 pack. One cord worked with a clear picture. The other had moving green lines and snow.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"You get what you pay for","reviewDescription":"These never worked. I bought them in 2019 and never got to write a review. Now I find myself looking for HDMI cables again and these popped out so I decided to let people know my experience. They worked well enough at the beginning but then I started getting flickering on the screen and eventually no image at all. And it happened with all of them. I see they have great reviews but that was not my case","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Only 2 of 3 cables worked out of the box","reviewDescription":"That's all there is to it. The 2 cables that did work have a clear picture and don't seem to have any flaws, but one of them failed to work straight out of the packaging.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Not up to the task","reviewDescription":"I needed to buy a few new HDMI cables and figured I'd go with these.  I was setting up a new TV (Sony X900E) and Receiver (Yamaha A1070) and was using one of these cables to connect the receiver and television.  I used the 10 foot cable.  I got ARC working and could hear the TV audio through the receiver, also the receiver could show its OSD on the TV.  So both audio and video were working.Then I tried to hook up my PS4 Pro and my Chromecast Ultra (the TV has built-in chromecast but there are issues with Netflix) to the receiver.  The receiver detected them and I could hear audio (from the receiver) but the TV said \"no signal\".  After going through settings for over an hour with no luck I decided to try a different cable.  That was it, everything worked fine with the new cable and that's the first time I've ever had a bad HDMI cable.  What was the new cable?  The 15 foot version also sold on this page.  That's the only reason I'm giving these 2 stars -- one of them worked.Very frustrating to have it work for (some) audio\/video but not the higher resolution content (which is why I bought these \"high speed\" cables).  Mainly posting this in case someone else has a similar experience.  Don't pull your hair out like I did, try a different cable!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1512604800000}
{"reviewTitle":"It almost messed up my tv","reviewDescription":"I bought two of these cords one to plug in a Apple TV and one to plug in the roku. The roku one I haven't really tested out because it's in my step daughters room and she's only with us every other week but the one connecting my Apple TV is in my bedroom and I believe it almost  messed up my tv. The very first time I used it i was watching Hulu and the sound went out I thought it had something to do with my tv or the Apple TV, so I disconnected everything and once I plugged everything back on the sound worked. A couple of days later i was watching Netflix and the picture went out everything blurred. I turned off the Apple TV and it still did it. I turned off the tv and turned it back on and still did it. I unplugged the hdmi cable and it still did it. Finally I upplugged the tv and left it unplugged all day, when I finally plugged it back in it finally worked. My tv worked perfectly for a couple of days until I plugged the hdmi cable back in. I watched Netflix for 3 minutes and it started doing the same thing again! I haven't plugged in the hdmi cable again since that happened and the tv is working good. I'm never plugging it back in and never buying one of these hdmi cords again!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1499644800000}
{"reviewTitle":"Solid choice for everyday hdmi cable","reviewDescription":"I recently purchased the AmazonBasics HDMI cable for my home entertainment setup, and it has proven to be a reliable choice. The cable's build quality is impressive for its price point, providing a sense of durability that you wouldn't expect from a budget-friendly option.In terms of performance, the cable delivers clear, uninterrupted video and audio transmission. I've used it for both gaming and streaming, and it has handled high-definition content flawlessly. The connectivity is stable, and I haven't experienced any issues with signal loss or interference.The cable's length is adequate for most setups, offering enough flexibility for a comfortable arrangement of your devices. The connectors fit securely into HDMI ports, ensuring a stable connection without being overly tight.One minor drawback is the cable's rigidity. It's a bit stiffer than some higher-end cables, which can make it slightly challenging to maneuver in tight spaces. However, this is a small concern and doesn't significantly impact the overall functionality.Overall, the AmazonBasics HDMI cable is a great choice for anyone looking for a dependable, no-frills HDMI solution. It provides good quality at an affordable price, making it an excellent option for everyday use. Four stars for a solid, budget-friendly cable that reliably does its job.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Electronics","reviewDescription":"Good Usage for What it was needed for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Did the job as advertised?","reviewDescription":"Good quality, good price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Works as expected","reviewDescription":"I used this to replace what I thought was a faulty HDMI cable.  Once In installed this cable, the issues went away.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Reliable and Affordable","reviewDescription":"When it comes to HDMI cables, it's easy to get overwhelmed by the numerous options available on the market. However, the Amazon Basics HDMI Cable stands out as a reliable and affordable choice. With its high-speed performance and compatibility with 4K resolution and Ethernet capabilities, this cable delivers on its promises without breaking the bank.One of the key features of this HDMI cable is its high-speed performance. With a bandwidth of 18Gbps, it supports smooth and seamless transmission of high-quality audio and video signals. Whether you're streaming your favorite shows in 4K resolution or playing games with demanding graphics, this cable ensures a crisp and vibrant viewing experience. The 60Hz refresh rate adds to the fluidity of on-screen motion, providing a more immersive visual display.The cable's 6-foot length offers a decent amount of flexibility, allowing you to connect devices without any hassle. The connectors are well-built and snugly fit into HDMI ports, ensuring a secure and stable connection. I haven't experienced any signal loss or intermittent interruptions during my usage, which is a testament to the cable's quality.Another advantage of this HDMI cable is its compatibility with Ethernet. It's Ethernet-ready, meaning you can establish a network connection between devices without the need for an additional Ethernet cable. This is particularly useful for devices that support internet connectivity, such as smart TVs and gaming consoles, streamlining your setup and reducing cable clutter.The Amazon Basics HDMI Cable is designed with durability in mind. The cable itself feels sturdy and well-constructed, capable of withstanding regular handling and movement. The black color is sleek and blends well with most home entertainment setups. Additionally, the cable's affordability is a major selling point. It provides excellent value for money without compromising on performance.However, it's important to note that this HDMI cable does not come with any additional features like gold-plated connectors or braided shielding. While these features may enhance longevity and provide extra protection against electromagnetic interference, they are not essential for the majority of users. If you require those additional features, you may need to consider higher-end cables.In conclusion, the Amazon Basics HDMI Cable is a reliable and affordable option for connecting your audiovisual devices. It offers high-speed performance, supports 4K resolution at 60Hz, and is Ethernet-ready, providing a seamless and convenient experience. While it may lack some of the premium features found in higher-priced cables, it more than makes up for it with its affordability and dependable performance. If you're looking for a budget-friendly HDMI cable that gets the job done without compromising on quality, the Amazon Basics HDMI Cable is an excellent choice.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Good","reviewDescription":"Asmexpected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Nice","reviewDescription":"Happy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Functional but impractically thick","reviewDescription":"This value is nice and long, and works perfectly for 4k video. The issue is that it is, as the kids say, a Thicc Boi. I think I'm saying that correctly. If you just run it free across the room like some sort or lunatic, or hide it in a wall properly, it's not an issue. But if you wish to mount it to the baseboard, the thickness presents certain difficulty. You'll need extra large mounting clips which tend to be aesthetically unpleasant.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Like \"BlueRigger…\"; durable, superb picture quality and otherwise works as advertised.","reviewDescription":"Similar to \"BlueRigger Micro HDMI to HDMI Cable (15 FT, 4K 60Hz, HDR, High Speed, Ethernet) - Compatible with GoPro Hero 7\/6\/5\/4, Raspberry Pi 4, Sony A6000\/A6300 Camera, Nikon B500, Lenovo Yoga 3 Pro, Yoga 710\" cable I ran this 15-foot cable between my HP G71 Notebook and Protron PLTV-32 in order to watch films running on the Notebook, but from farther away on the big screen. The cable worked as intended; the connectors fit snugly and remained undamaged, the picture quality was excellent, and the cable had zero fraying. I first ordered it in October 2018 (for $11) and used it for about three years, and even six years later it still works and shows no signs of slowing down. Overall this is a great cable for the value, at least an easy 4\/5!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Gracias","reviewDescription":"Muy bueno","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Flaked out after 3 years","reviewDescription":"I got what I paid for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"... HDMI cables are clearly labelled High-Speed they should be good for 4K @ 60Hz","reviewDescription":"I work in the field of video entertainment and as long as the HDMI cables are clearly labelled High-Speed they should be good for 4K @ 60Hz. Should be. These were for about a month, then they stopped my 4K Blu-ray from linking up to my TV. The trouble shooting that followed drove me, Sony and I dare say TCL absolutely mad. It turned out to be the cable. So, while I still use one between my cable box and TV and that works fine, I cannot recommend them for a genuine 4K application. Buyer beware - you shouldn't pay the exorbitant prices of say a Best Buy HDMI cable, but you should be prepared to part with more than $10.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1531008000000}
{"reviewTitle":"Poor picture quality when mirroring to a TV","reviewDescription":"We travel a bit and rarely have wifi access. We use our phones to stream video to a TV through cable. We bought the 25' so we could have our phones closer than our 12' cable allows. First, it's about twice the dia as the 12' and very stiff. Not a deal breaker, but the dark picture is. The 25' has a noticeably darker pic than the 12' with either phone. We tried both ios and android phones with their respective adaptors. Both have the same pic quality. It's usable for shows shot on lighted sets, but for dimly lit night scenes it's pretty bad.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1577232000000}
{"reviewTitle":"Issue with Comcast HDMI dta","reviewDescription":"When using comcast dta cable boxSuddenly no signal switched to different hdmi input same problemTried another amazon basic cableSame problemTried this cable on apple tv and dvrHad signal okInstalled non amazon cable tv worked fineNot sure what xfinity did to causeThis problem not to work with boxWhen looking deeper this cableWas only able to have output of 480p when tv in setup modeIm not saying its a bad cable but iCan use them anymore wasted 3 to 4Hrs troublesooting and tearing cables out i had so tied down perfect","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1574208000000}
{"reviewTitle":"Ok for most applications—look elsewhere for 2.1","reviewDescription":"Generally speaking this cable is fine, though it occasionally experiences HDCP issues (I.e., black screen) when streaming 4K HDR content. Atmos “works” except when it doesn’t.I’ve also used this cable for eARC, but it struggles to keep up—as an example, there is significant audio latency over this cable when attempting to handle Dolby bitstream 7.1 out of PS5.The quality of the cable is fine, but if you’re hoping to use it for 4K HDR applications, spend the extra money and get something with higher bandwidth.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Not as durable as I’d hoped","reviewDescription":"You get what you pay for. This is fine if you just need it for a tv you don’t plan on moving, but I needed something I could keep in a different place to put a tv part-time. Taking it in and out a few times a month it didn’t last very long","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645142400000}
{"reviewTitle":"I had bought these to replace my older","reviewDescription":"however after purchasing a XBOX One X, those cables would not allow the XBOX to work in 4K. I had a similar issue with my Roku Ultra which would not work with the 4K 60fps setting. I decided to try these as they are rated at 18Gbps. While the first cable I tried worked flawlessly (no artifacts, flickering or other issues), the other two did not work as well. I tried Twisted Veins HDMI cables as well and had similar issues. I finally picked up Monoprice cables and haven't had any problems. Most people have good luck with these cables in shorter lengths (6ft or less)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1567555200000}
{"reviewTitle":"It works till it doesn't","reviewDescription":"It works great until it stops working because of poor connectors.  I found myself having to bend the cord in weird ways to get it to work after 6 months of use.  Then it finally seems to have given out.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652486400000}
{"reviewTitle":"Waaay fat and heavy, pulls on your HDMI ports.","reviewDescription":"Not sure what the reason for the super fat, heavy cable is, but it makes these awkward to use. I've had issues with it pulling weird on my HDMI ports causing issues with my TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659484800000}
{"reviewTitle":"however after purchasing a XBOX One X","reviewDescription":"those cables would not allow the XBOX to work in 4K. I had a similar issue with my Roku Ultra which would not work with the 4K 60fps setting. I decided to try these as they are rated at 18Gbps. While the first cable I tried worked flawlessly (no artifacts, flickering or other issues), the other two did not work as well. I tried Twisted Veins HDMI cables as well and had similar issues. I finally picked up Monoprice cables and haven't had any problems. Most people have good luck with these cables in shorter lengths (6ft or less), however at 10ft or longer I","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1567641600000}
{"reviewTitle":"Over Priced","reviewDescription":"Price is too high.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"they work well","reviewDescription":"good product.  heavy use and still working good.  as advertised but only used for 1080p.  so I don't know about 4k","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"These cables appear not to be certified","reviewDescription":"Good HDMI cables will show as being certified for the HDMI standard intended. I did not see that these were certified.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Temporary Advised","reviewDescription":"Cable sparked after 6 months use, Almost blew the fuse in my console.AffordableFast delivery","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Good Cable, But Amazon Basics has Joined the Mega Thick Jacket Wars","reviewDescription":"This is a fine cable along the lines of all the other mega thick cables out there.  The trouble is, thicker jackets do not equate to higher quality.  Thinner jackets work just as well and are much less aggravating to work with.  The thick jacket and heavy duty plug prevent this cable from fitting into the pocket in the back of my Vizio M Series TV or next to any other HDMI cable in an adjacent socket on my Sony ES receiver.Here is the naked truth about HDMI cables: they either work or they don't, and there is no such thing as a premium passive cable.  There are only 3 possible outcomes with any given HDMI cable:1. Does not work2. Works with artifacts (random white dots)3. WorksIf your outcome is 1 or 2, your equipment does not like the cable, or you need an active cable for a long run.  If your outcome is 3, you are good to go.  There is no higher quality level than \"works,\"  considering the error-corrected digital nature of how HDMI signals are transmitted.That is a long-winded explanation of why this cable is unnecessarily thick.  Thicker absolutely does not mean more \"premium\" -- just more difficult to use.  Or, in my case, impossible to use.The last 2 Amazon Basics HDMI cables I purchased were a normal thickness with a normal sized connector, and they worked great.  C'mon, Amazon!  Withdraw from the thick cable wars!","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1544486400000}
{"reviewTitle":"Fit great","reviewDescription":"Work grate just wat I need","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Great cables if you are buying the 6ft or less version or for non-4K","reviewDescription":"Updating my review, I bought this 3 pack and while the first cable worked fine on 4K 60fps signals, the second and third cables has major issues.I had bought these to replace my older AmazonBasics high speed cables (10.2Gbps), however after purchasing a XBOX One X, those cables would not allow the XBOX to work in 4K. I had a similar issue with my Roku Ultra which would not work with the 4K 60fps setting. I decided to try these as they are rated at 18Gbps. While the first cable I tried worked flawlessly (no artifacts, flickering or other issues), the other two did not work as well. I tried Twisted Veins HDMI cables as well and had similar issues. I finally picked up Monoprice cables and haven't had any problems. Most people have good luck with these cables in shorter lengths (6ft or less), however at 10ft or longer I recommend looking for something else if you are using these on a 4K display. The two issues I saw with these cables at 4K 60fps were sparkles or repeating signal loss.","isVerified":true,"ratingScore":3,"reviewReaction":"343 people found this helpful","country":"United States","date":1511395200000}
{"reviewTitle":"Careful if considering these for full 4k\/HDR","reviewDescription":"I have an 4k\/HDR Roku Ultra connected to a 2016 Marantz 4k\/HDR capable receiver which is connected to  a 4k\/HDR Vizio P65 TV. I ordered 4 of these cables (2 in 3 foot and 2 in 6 foot lengths). While all of them would handle plain 4k, none would pass the Roku Ultra 4k\/HDR test and if I forced the change, the screen would just go blank and stay like that until a reboot of the Roku. I have never been one to pay extra for \"certified' cables as I always thought all cables were the same when it came to digital connections, but with all other options off the table I took a chance and bought a set of Certified Premium Monoprice 18gb HDMI cables. I hooked those up and first try, the Roku test passed full 4k\/HDR capabilities, and the picture was fine. I saw some reviews for these cables that said it would pass full 4K\/HDR which is why I bought them, but my guess is that some do and some do not. If you want to make sure, spend the extra few bucks for the certified cables. You will need full guaranteed 18gb capability in the HDMI cable for a setup like mine to work. If you only want plain 4k or 1080p, these would work fine. The Monoprice were noticeably thicker and stiffer than the Amazon cables also which to me means a more robust build quality.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1501718400000}
{"reviewTitle":"Working cable but extremely heavy gauge wire putting strain on sensitive HDMI connections","reviewDescription":"No smell from the plastic which was nice but the wire is too heave gauge for HDMI it wanted to curl up after I uncoiled it and when plugging into a graphics card put a bunch of pressure on the port with plenty of slack. Wouldn't recommend get a lower gauge cable that actually is flexible. I purchased 25ft variant.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1686355200000}
{"reviewTitle":"These don't work on the HDMI port of a Apple Macbook Pro M1 Pro 14 inch","reviewDescription":"I bought this cable to use for an Apple Macbook Pro M1 Pro 14 inch and the first cable just cut out like every 5 minutes.  Thinking I had a bad cable I requested a replacement cable, which when I got the replacement it was even worse than the first one.  I was able to plug it into an HDMI port on USB-C hub and it works, but the HDMI port on the laptop it cuts out all the time.  I did find a cable that seems to work for the Macbook (hasn't cut out for more than 30 minutes), so if you plan on using this for a Macbook Pro, go with this one which does work https:\/\/www.amazon.com\/dp\/B07RKJKJGC?psc=1&ref=ppx_yo2ov_dt_b_product_details .","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"Qty of material","reviewDescription":"Dislike , used to connect with laptop to TVBut no option for that being both sides are same","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665792000000}
{"reviewTitle":"You get what you pay for.","reviewDescription":"Spend a bit more money for decent HDMI cords. These are trash. They're cheap but they have bad connections. They'll get the job done, but not particularly well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653004800000}
{"reviewTitle":"Doesn't Work right for me","reviewDescription":"I bought this cable to connect from my BenQ monitor to my laptop and my desktop. The hdmi end doesn't fit snugly into the hdmi ports on either of my computers. It's loose, so when i bump the wire or mildly brush up against it with my leg it shuts the connection off to the monitor. Gave it three stars cuz it does work but not in a place where the wires can be touched.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578096000000}
{"reviewTitle":"Gotta get connected!","reviewDescription":"I ordered this 3 pack of HDMI cables to connect Apple TV to my LG smart tv.  I also had to replace one of the cables to my dvd player.  I got these cables with no delivery or packaging issues.  It was pretty cut and dry as they were easy to plug in and I did not have any problems with the signal or quality from my components to the tv.  They are working well so far and would recommend them.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1555891200000}
{"reviewTitle":"long heavy duty hdmi cable, but may not work with all equipment","reviewDescription":"Would not function for all applications.  Specifically the one intended for, extend the security camera output to monitor in another room.  It did appear to provide output for a laptop to the monitor, but with a darker image.Another hdmi cable worked fine for the security camera output, albeit a shorter one.  To extend the video ended up downgrading to a vga run that is working fine to display the image.So this cable is a hit or miss depending on your application.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1540166400000}
{"reviewTitle":"1080 works, 4k is a no go.","reviewDescription":"I bought the 25 ft version of this cable, it works fine if you are not picky about picture quality. I tried using this for a security camera system that records in 4k and it would not output an image, brought it down to 1080p and it started working just fine. for the price its not a terrible deal, I just wish Amazon had not falsely advertised this product as 4k capable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1583884800000}
{"reviewTitle":"Decent Chord Once Setup","reviewDescription":"I ordered the 25-foot cable in order to run it behind our wall and through a two-by-four so I could hook our TV up to the DirecTV box while also hiding the chords. The 25-foot chord is heavy and really thick, almost twice as thick as a standard HDMI cable. The cable also had issues reading the satellite box to the TV, but after unplugging and re-plugging a few times it eventually worked. Now that everything is setup it is working just fine, but the size of the chord did present some problems.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1512864000000}
{"reviewTitle":"Very thick cable","reviewDescription":"The cable is very thick!! Witch makes if very stiff. Other then that it works fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Not compatible with HDR and\/or Dolby Vision","reviewDescription":"So essentially, these will give you a 4k video, but does not support HDR and Dolby Vision.  I have a 2018 LG OLED with a Yamaha RX-A780 receiver and 4K will not run HDR\/Dolby Vision with 4:4:4.  So, if you are using an AppleTV 4k or PS4 Pro or pretty much anything that will deliver HDR and\/or Dolby Vision.  These unfortunately will not work.  18Gbps does not matter if they do not support the rest.  Hope this helps some people!!!","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1533081600000}
{"reviewTitle":"Its a cable","reviewDescription":"This has an obvious function… so I cannot give it more than 3 stars or an average rating, it showed up roughly as and when expected and filled it’s expected function.Nothing about this interaction was wrong and thus needed less ‘stars’ and nothing was so superlative as to warrant additional stars.  It was just as expected… so three stars.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618012800000}
{"reviewTitle":"No sound, but picture works great. Not meant for gaming systems.","reviewDescription":"For the job needed, it didn't do what I expected. If you are buying this for multiple screens for your PC, this works great. I bought it for a multi media project where I was able to switch between my flat screen and my monitor on my Xbox One, so if need be I could put my security cameras on the big screen during business hours. Picture worked great, just no sound. To be honest, for a gaming system I should've spent the large amount of money for a proven one but hey, I tried. Admittedly, there was NO delay in picture.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1462838400000}
{"reviewTitle":"Buyer Beware for Cord Concealment","reviewDescription":"These are great HDMI cables. Strong, good picture, etc. However, they are HUGE. As in, thick. Very thick. Too thick. I bought four of these to replace shorter cables for our wall-mounted TV. But these cords are so thick, I can only fit two in our cord concealment system (that used to have four cables running through it). Because of this I can only truly recommend these for other uses besides home theater systems.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1591574400000}
{"reviewTitle":"What's Next? I've Exhausted All Options!","reviewDescription":"Yes, I still believe you can install a second display on an iMac. These didn't work so went with high priced option. And, they didn't work either! So, why did the setup work at the Apple Store and mine won't work?Last thing is to change to a higher quality is the MiniDisplay Port to HDMI Adapter. Definitely not in AmazonBasic products.That's my only option now. If it doesn't work, then everything goes back. This has gone on much too long!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1524960000000}
{"reviewTitle":"Failed after 18 months, got my money's worth?","reviewDescription":"Seems like it could've lasted a little longer. Wasted 20 minutes testing everything else but the cable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"Average cable for low price","reviewDescription":"It worked fine at first, but it does not work well at 4k 30hz. It will cause an issue at times and the cable connector seems to be getting loose.The cable is to thick and stiff. This makes it hard to position and turn around to plug in. I guess that would be a good thing to though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1599264000000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Picture quality is great. Construction, not so much. A sharp tug killed this guy and I had to buy another HDMI. The cable ripped right out of the socket. Do I have ogre-like strength or was this cheaply made? Probably the latter. Thankfully they’re not terribly expensive.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624838400000}
{"reviewTitle":"Cheap But Works","reviewDescription":"One of the plastic casings around the HDMI broke along the seam and now the plug is floating free with the wire connectors exposed.  I tried to put the casing back on, but the plug seemed bent.  I had another backup, a sturdier HDMI with the braided cable.  I put this one away as a spare but likely will throw out.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1575158400000}
{"reviewTitle":"broke after a few months","reviewDescription":"ive ordered multiple hdmi cords off of amazon and they all break within months, the same goes for this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645920000000}
{"reviewTitle":"good by itself maybe? (bundle option for amazon fire tv)","reviewDescription":"Thought we might be able to cut the cord from cable but this is not all that great. Its nice to be ableto watch movies but tv local channels with the antenna not so great. Did have to run out to get a splitter for the hdmi and another input output hdmi because it didnt come with enough for our set up. mind you that would totally depend on yours, we have cable, dvd player, and a bluray player hence we needed more cords","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1500249600000}
{"reviewTitle":"Absurdly thick (25' length)","reviewDescription":"Yes it works. I got a 25' cable for occasionally sitting on the couch with a laptop and putting content on the tv. The price and length were good. But the cable is absurdly thick, stiff and unwieldy. It's as thick as my outdoor heavy duty extension cords. I would rather pay more and get something thinner and more pliable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1577059200000}
{"reviewTitle":"Works great \/ great price","reviewDescription":"I just plugged into my tv and cable box, so far so good. Just bought another one. Hope they last for a long time. ( some other brands at the electronic stores cost $30)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"Thick cable,  but works fine.","reviewDescription":"It's a cable, it works.. but the cable itself is pretty thick and heavy. I wish it was a bit more flexible. Still a great value for the money if you don't need a thinner flexible cable. Picture shows the size of the cable next to standard pencil and sharpie. How this helps someone.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1683849600000}
{"reviewTitle":"Good quality product overall.","reviewDescription":"Good quality product overall.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"It works","reviewDescription":"There is just not much to say.  It works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Good cables","reviewDescription":"They work well without problems","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Good for the price","reviewDescription":"After Best Buy tried to sell me a cable at 3 times the price I bought this.  It does the job and I have no way of knowing whether a premium cable would be any better.  This was good enough.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Doesn't handle PS4 Pro with 4K HDR","reviewDescription":"Handles 4K HDR from Xbox One S perfectly. Continually flickers in\/out with PS4 Pro only when attempting to use the highest video output setting or the auto setting (since that recognizes my tv as capable of handling 4K HDR). Used the cable that came with PS4 Pro instead and it works perfectly. To be fair, it can just be a single defective amazon basics cable or it can be the total run (from PS4 to receiver and then receiver to TV (note: diff brand cable for the 2nd leg of the run that is 15ft and certified for 18gbps)) being shortened by using the shorter cable that came with the PS4 Pro that allows that combined run to be successful. The 4 star rating is because the cable works as advertised with Ultra Blu-ray movies with HDR being output from the Xbox One S at the same run length. It's also a great 4K cable in general as I use it with plenty other devices that don't require as much bandwidth. My current entertainment center setup doesn't lend itself to easy cable swapping and testing of various scenarios so I'm sorry I can't rule more out but I wanted to provide some level of warning for those of you have a similar setup: PS4 Pro to 4K HDR capable receiver to 4K HDR capable TV.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1478908800000}
{"reviewTitle":"Cable works fine, but the plastic grip at the ends of the cable is thicker than most","reviewDescription":"The cable itself seems to work fine. But the cable casing is thicker than I expected, and the plastic grip at the ends, from which the HDMI connectors protrude, is thicker than my other HDMI cables: this one is 1\/2\" from top to bottom instead of 3\/8\". I mention this because I'm using the cable to connect a laptop to a 5-year-old Samsung TV whose HDMI ports are flat against the rear of the TV, so that the cables lie flat against the TV where they plug into the HDMI ports. That is, the cables don't stick out perpendicular to the rear of the TV. In order for the TV to have that slim look that some people want, the manufacturer doesn't provide a lot of clearance between the TV's HDMI ports and the rear of the TV. There's plenty of room for my other HDMI cables (the ones whose plastic grips are 3\/8\" thick), but it's a very tight fit for the plastic grip at the end of this particular HDMI cable. I can imagine that TVs that are newer and more high-end than mine, and that are going for a thin, sleek look, might have even less clearance for the plastic grip of an HDMI cable, in which case you wouldn't be able to plug this cable in directly; you'd have to use an adapter.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1455753600000}
{"reviewTitle":"Beefy but flexible cable","reviewDescription":"This is the perfect quality cable I needed that has the right balance of thickness and flexibility.I needed a longer than standard 6-ft cable that could be easily transported for presentations made at multiple locations and this fit the need quite nicely. I had an older long cable that simply was too stiff and heavy to be portable. In fact, it was so heavy that it was unwieldy and often would not remain plugged in.This cable is surprisingly pliable and provides good shielding and high picture quality, but I have knocked my original five stars down a star because a second one of these cables I purchased broke at the connector within a few months of light use. Decent cable, but I'm hesitant to buy it again in the future.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622851200000}
{"reviewTitle":"Its a HDMI cord :D","reviewDescription":"They work like a HDMI cord and help with extenders, makes life simpler.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"This cable is THICK! (25ft)","reviewDescription":"Connections are of good quality and I have had no issues with picture or sound quality. The only issue I have with this cable is that it is ridiculously thick and heavy. In some regards that is a good thing, but when it comes to routing, it is not easy to tuck, bend or hide. The cable that this one is replacing (due to a pet chewing it) was much thinner and I had it tucked between the carpet and base board. Not this beast. It also puts a lot of stress on HDMI ports due to the weight. I had to route it differently and zip tie it because I was worried about damaging ports. I suspect this length is rated to be installed inside of building walls. That would explain the extra thickness and shielding but I do not see it in the listing anywhere. The cable lengths below 15 feet appear to be \"normal\" cable in the pictures.TL;DRIf you want a sturdy HDMI cable that a semi could run over and not interrupt your movie this is for you. If you want something out of sight out of mind without running it behind drywall, maybe look elsewhere.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1536883200000}
{"reviewTitle":"Good While it Lasted","reviewDescription":"4 year without any major issues until now, not bad especially at the price we got it for! Purchased this HDMI cable back in June 2016. As of last year, we noticed it started giving out, screen would go black. We would adjust and it would work for a good while until the next time. Now, we have to rig it by placing something to hold the end connection in place so our screen doesn’t go black again. Also, Roku is popping up notices to check the HDMI cable too.I can’t find where to contact Amazon Basics regarding the limited lifetime warranty. Usually there is a “Contact Seller” button but not here. I’m sure I can find a 1-800 number somewhere but it’s not worth the hassle. I didn’t pay a lot for this cable back in 2016 and it served its purpose well while we had it. Not too concerned about getting a replacement. This cable is probable out-dated for today’s standards anyways.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595980800000}
{"reviewTitle":"Gets the job done in a pinch","reviewDescription":"I tend to lose a lot my cables especially my HDMI ones so this product is a pretty replacement when you're ina pinch. Gets the job done and with great value. Some downside though is that it is pretty short and might not work with your setup as well as it can be destroyed quite easily. I was shifting my table to the right a little bit and one of the legs landed on the product which totally destoyed one of the end. Lasted a good 6 months though!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"It is an HDMI cable. And it works as intended","reviewDescription":"Like most electronics, it is a piece of conductive metal within a tube. Most HDMI cables should have reletively the same overall performance with picture quality. Amazon's provided cable works perfect as a cable to order quickly for anything that needs to be displayed on a monitor or tv screen.If you are looking for a cable, here's the one to pick. If you're looking for exceptional quality and durability in the cable, I recommend finding an alternative.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1668556800000}
{"reviewTitle":"Extra conductors\/shielding\/jacketing? It's like car battery jumper cable thickness.","reviewDescription":"I like heavy duty cables but these are over the top. The size and weight puts a lot of stress at the connection point. It requires looping the cable and then cable tie the loop to the monitor mount. But, at the CPU, there's nothing to cable tie a strain-relief loop to.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"👌","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Good","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Basic HDMI cables as ordered works as expected","reviewDescription":"The HDMI cables are as expected and perform as they are","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"2 out of 3 work fine.","reviewDescription":"I just replaced another brands (M.......e)  \"Premium Certified\" 6' HDMI cable with one of these.  It wasn't expensive but that cable failed after 6 months.  This Amazon cable has got things working perfectly again.  Already had one of these connecting another component to the same TV and it has worked fine.  I did, however, buy two of the 10' length cables for a second TV.  One did not work right out of the package.  The picture would drop out and TV would go to black screen.  The second one worked fine and is still in service.  One thing to nit-pick ... the cables appear to have gold plated connectors in the photo and the description seems to indicate the same.  Not that it matters, but the ones I received are just tin plated.  I just bought 2 more spares to have on hand.  Dismissing the one bad 10 footer I received, these cables handle all content that that we currently have available (up to 4K 24P) no problem.  Don't pay for the hype. They either work or they don't.  These work perfectly and are inexpensive.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1498521600000}
{"reviewTitle":"nice quality","reviewDescription":"nice heavy duty cable excellent buy for the money","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688515200000}
{"reviewTitle":"Uhh.. Only been using it for a few hours...","reviewDescription":"Already, the first cable is occasionally flickering to black with no apparent cause. I have the second one still if it becomes too troublesome, but I'm not very hopeful about that one either... You really get what you pay for. I wouldn't recommend it as a primary cable, but for a second monitor for casual web browsing or something not so important, I'd 100% recommend it if you can tolerate the occasional flickering.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1563667200000}
{"reviewTitle":"1 of 2 stopped working after about a month","reviewDescription":"Got 2 in late June of 2020 — should've tested them both more thoroughly while I was still within the return window. As of sometime in August the signal cuts out every few minutes with one of the cables. Other one seems to work fine as of now. I'd recommend paying a little more for your HDMI cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600041600000}
{"reviewTitle":"Not very reliable","reviewDescription":"I've been using this to connect my laptop to a dual monitor. It's worked fine for the first month or so, but it sometimes had difficulties connecting to the second display.This morning, it all but stopped showing anything on the second monitor. After I switched the HDMI cable to a different one, it went back to normal. It looks like the cable is not very reliable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582243200000}
{"reviewTitle":"Giving it a second shot.","reviewDescription":"I purchased the 10ft version of this cable, and it the picture would show lines\/turn black occasionally. At first, I decided to ignore the problems, but after a few days the screen was constantly flickering black. I've tested other HDMI cables and see no issues, so I've concluded that I just received a faulty cable.I've purchased a second cable in hopes that the issues are not present in it.Otherwise, I really like this cable, just wish it worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1537833600000}
{"reviewTitle":"Because the cable failed in less than 1 year,","reviewDescription":"ecause it worked fine after installation. However about 6 months, I started to observe issue that the video image blacked out intermittently. I was not able to find the root cause, because the issue was intermittent, but recently I completely lost the image, and I identified that root cause is this HDMI cable. After I replaced the cable with another one, the image was recovered and didn't show any intermittent issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1567555200000}
{"reviewTitle":"doesn't work sometime","reviewDescription":"Sometimes I have to unplug, replug and play with the wire for it to work. My cables are less than 4 months","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1664841600000}
{"reviewTitle":"one of the 2-pack was defective","reviewDescription":"I bought a 2-pack of the 3 foot cables because it was the same price for both as for one. One of the cables worked fine, but the other didn't work with my DVD player or with my Roku ultra. I got pretty random errors, such as flickering between static and video, or it would work for a while before saying No Video. So if you are getting weird errors, try a different cable!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1544313600000}
{"reviewTitle":"Not as described","reviewDescription":"Received the product but this are not gold plated on the ends as described and shown in the picture.  Therefore I am not sure if I received the wrong order or it is misrepresented as described.  Hopefully it was just a mistake but regardless I had to return the item.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615766400000}
{"reviewTitle":"Limited ARC Functionality","reviewDescription":"I thought this was an upgrade from Amazon's older HDMI cables but, I don't think so... This cable does not fully utilize the ARC (Audio Return Channel) capabilities; it will only transmit the power function and not any other control functions. Okay, this is only a basic cable but I have gotten other $5.00 cables which handle all ARC functions.Overall, this is a decent basic HDMI cable which delivers a clear HD picture. Plus, these cables appear well made.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1514505600000}
{"reviewTitle":"Grainy picture, not Dolby Vison compatable","reviewDescription":"Meh, it’s an “ok” HDMI cable. If all you need is an inexpensive way to connect your device to your TV or monitor, then this will work. However, the picture quality is garbage. I had this connect to my AppleTV and the picture was really grainy. I guess I should have known better. I ended up ordering a different brand that is capable of 48Gbps and is Dolby Vison compatable, where as, this AmazonBasics HDMI cable is not.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1525824000000}
{"reviewTitle":"4K60hz connection spotty at 25ft","reviewDescription":"Unfortunately I encountered a lot of issues with the 25ft 18Gbps cable. Sometimes it would work great, other times It wouldn't detect HDR compatibility, and often I would lose the signal completely. Don't buy the 25ft cable and expect reliable performance in 4K\/60Hz\/HDR.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663891200000}
{"reviewTitle":"NOT for 4K","reviewDescription":"This cable does its job, but barely.  Almost every time we turn on the TV, it pops up a message saying video quality has been changed for optimal viewing and we should replace cable with a better one for better quality.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656460800000}
{"reviewTitle":"****Is it really a 4K cable or rated at 4K","reviewDescription":"There are many people saying in there reviews and answering questions that this is a 4K cable and there all the same anyways.  But I’m not sure I got a good price for a good 4K cable because nowhere on the box or cable does it say that it’s 4K or rated for 4K .So what did I really buy?  Nothing special , just another  hdmi cable.Very disappointed with this !  **I will always wonder if I’m getting the 4K quality .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581552000000}
{"reviewTitle":"Beware if Using a Reciever and Dolby Vision with Apple TV","reviewDescription":"As several other reviewers have pointed out, these cables don't work with with the fourth generation Apple TV via a receiver and 4k TV with Dolby Vision\/HDR (LG OLED).  The sound is fine and they work well in other applications. However, after a few minutes of viewing, the picture usually would start to flash with a large block of white  pixels running across the bottom of the screen. We spent weeks of trying to solve the issue with tech support and various update and configuration changes, only to find that installing a Belkin cable solved the problem immediately.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1542412800000}
{"reviewTitle":"Seems to be a quality control issue with these cables. Very inconsistent in quality.","reviewDescription":"First cable I had with Amazon basics lasted a good 3 years or so before it stopped receiving signal to the amplifier. I then noticed today, only after about a month; audio was transmitting, arc would work intermittently but there would be no video. (TV would show no signal for my HTPC or any device connected to the amp-- I could hear audio, but no video, so there is definitely a signal loss somewhere) I'm starting to think there is a issue with quality control with Amazon cables. While I have a lot of devices working fine with them, this is going to be a return and I'm switching brands this time around.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1494633600000}
{"reviewTitle":"Disappointed","reviewDescription":"I thought these were ok, and then I compared their performance to another HDMI cord I had. When watching video, the picture is stilted and lags. The colors are over-saturated. I’m not typically picky about these things, but I bought these right before we moved and by the time I tried them, the return window had closed. Usually Amazon products don’t disappoint but these do. :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636675200000}
{"reviewTitle":"Doesn’t work with Apple TV","reviewDescription":"Bought a two pack to use with my latest version of Apple TV and they both worked for about two weeks each and then stopped working. Bought the one apple suggested on their website and have not had any issues. I chose this one initially bc I’ve always had good luck with amazon products and this one said it supported the version of Apple TV I have. It’s a bummer it wasn’t as advertised and now I can’t get my money back bc the return window is closed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"May not work on all TVs","reviewDescription":"I purchased this to connect a new, very basic 19\" Insignia TV to a cable box. Unbeknownst to me, some TVs require an HDMI\/ethernet cable, so this standard HDMI cable did not work. This was also a surprise to the Xfinity installer, who happened to have the right cable on hand. Lesson learned: A standard HDMI cable does not necessarily work for all TVs. Amazon gave me a refund, but it would be nice if the description of this product noted that it may not work for all TVs.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1567987200000}
{"reviewTitle":"Had a problem with audio dropouts","reviewDescription":"I had a problem with strange, random audio dropouts when using this HDMI with a Cisco CHS 435DHS Set Top Box \/ DVR (used with Verizon FIOS cable service) and an LG  Oled65b7a  65\" OLED TV.  After a long investigation, the problem was fixed by replacing this cable with an HDMI cable provided by Verizon. It took several service calls and a Verizon $99 charge because the fault was in my cable. I've used Amazon basic cable in other places with good results but not with this equipment.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1557964800000}
{"reviewTitle":"AmazonBasics High-Speed HDMI Cable, 3 Feet 3 Set - Not Happy - One of The Three is Bad","reviewDescription":"I have two issues with this Amazon Basics High-Speed HDMI Cable three pack.  One, I purchased under Amazon Prime, yet shipping was delayed.  Yeah, I know this is a minor issue but the second issue isn't.  One of the three cables is bad.  As soon as I plugged the cable in the display had pixelation.  I switched back to a known good cable and the issue was gone.  Tried a second time and the problem of pixelation returned.Normally I have good luck with Amazon Basic products, this is the first time exception. I'll contact Amazon, but I expect they will want me to return the all, two of the three are okay and being used.  Bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1510099200000}
{"reviewTitle":"Nice product!","reviewDescription":"Nice product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Verry good","reviewDescription":"I love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683676800000}
{"reviewTitle":"Almost Perfect","reviewDescription":"I bought this to hook a laptop up to the conference room TV at work.  The longer length allowed me to set the laptop on the conference room table even with the TV across the isle.  The picture quality was good and so was the sound.  Overall the cable appeared to be good quality upon visual inspection and I like the gold plated HDMI connectors on either end.The only reason I subtracted one star was because upon initially connecting the laptop to the TV there is a slight pop on the TV speakers and the picture shutters a bit.  Once it connects; however, everything is fine.  Not sure if it is the TV, the laptop or the cable, but the TV is a Samsung and the laptop a Dell, so I'm assuming it the cable.  However, for the price, I can't complain.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1548115200000}
{"reviewTitle":"Good cable with really thick insulation","reviewDescription":"I ordered a few of these for long runs in a conference room. For my purpose-the far end connected to visitor's mobile devices-the thick insulation is a notable detriment.Presumably, you can look on the bright side and go, \"Well, at least I won't bend it too tightly\". That is true. But the insulation inhibits running the cable around normal bends, IMO. It also requires larger raceways to accommodate the cable or dual cables.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652400000000}
{"reviewTitle":"Great Amazon Basics","reviewDescription":"It's a perfect product at Amazon's Basics price. Good value and good connection.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"Problem with remote control","reviewDescription":"The remote control cover does not snap in place so on my brand new Sony product I have to keep it in place with a rubber band, not a very good advertisement for a Sony product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670198400000}
{"reviewTitle":"Nice","reviewDescription":"Nice heavy duty cable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"not better or worse than any of them","reviewDescription":"Shouldn’t even cost this much, it should be free but if you are going to charge at least make the product cooler than the generics out there… it’s just a cord","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Does the job","reviewDescription":"The cable is well made, nice and thick, makes easy to connect my TV with laptop. Did the job in good price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"Seems well built, but is bulkier than expected.","reviewDescription":"This is a beefy cable!  I have only just recently hooked it up (I'm using it to connect a Mac Mini to a 40\" 4K tv as a second monitor) but so far it is working as expected.Note that this is NOT simply a \"standard\" HDMI cable which happens to be 25' long, but it is also thicker than what I consider to be \"normal\" cables.  That's probably a good thing - I expect it should last and hold up to being connected\/disconnected quite often - but the plug portion also seems to be larger than usual, meaning a bit of a tight fit next to other cables.  I'm also concerned about the weight of the cable itself putting stress on the outlet(s).It is also stiffer than \"regular\" cables, so if you need to wind\/wrap the cable in a tight space, you might have an issue.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1500768000000}
{"reviewTitle":"Excellent quality but very thick and therefore not flexible enough for my needs.","reviewDescription":"The cables are of very excellent quality; however, they are very \"thick\" and therefore are not flexible and are difficult if not impossible to uncoil.  I also had a problem with my laptop recognizing my monitor using them.  I cannot really explain why as when I used the previous shorter \"Twisted \" cable it recognized the monitor right away.  Perhaps they are made for a different reason.I want to make note here that I have never been disappointed in the Amazon Basics items I have purchased and they are much less costly.  I do not think that their line of products can be compared with generic items such as food products  No matter, you cannot go wrong.  I even purchase Amazon Basics batteries which last as long if not longer than any other brand, and are much more economical.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1515110400000}
{"reviewTitle":"--Works, but THICK","reviewDescription":"I'm sure it's here somewhere, just didn't look for this specific thing... Figured a cable is a cable... But this thing is thick!!  9.7mm according to my caliper... Too think for me to run under my carpet as planned... If that's not an issue, I'm sure it is a awesome cable with little signal loss, due to the gauge of the wires...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652054400000}
{"reviewTitle":"They do the thing they're supposed to do","reviewDescription":"no issues with the quality of the product or its output. i needed some of these for splitting a signal to multiple monitors and streaming, haven't had any issue with them at all.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673222400000}
{"reviewTitle":"These cables should work with almost any setup","reviewDescription":"I loved the fact that they are high speed cables for such a reasonable price.  Admittedly I have a more technical audio visual setup than most people.  My audio visual rack is about 70 feet away from the living room all run through HDMI baluns.  So this may be contributing to the sensitivity of my set up...I started getting sparkles and lines through the picture only when using the new Apple 4K TV not the cable box or blue ray player.  My old Apple TV didn't do this.  I tried several settings to get these picture defects to go away but the only thing that has worked is to reduce the output resolution down to 720p.  It looks as though the Amazon basic cables don't have the bandwidth for the new Apple 4K TV.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1536278400000}
{"reviewTitle":"works great","reviewDescription":"great for streaming","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681257600000}
{"reviewTitle":"Great, but definitely not 6ft","reviewDescription":"Seems like it works well enough, however I ordered the 6ft version and this is definitely not 6ft long. For reference, I’m 5’8” and this just barely reaches my head. Works fine though!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668384000000}
{"reviewTitle":"Good.","reviewDescription":"Good product alittle long.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680998400000}
{"reviewTitle":"Get’s the job done","reviewDescription":"It’s bit more expensive than the store brands like Best Buy, however only by a $1 or so. This gets the job done. Got the 3 ft one to connect my Apple TV to my mounted Samsung and so far so good.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1663891200000}
{"reviewTitle":"Working as expected","reviewDescription":"Working as expected. Bought item as a replacement cord for our sound bar.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"Satisfecho","reviewDescription":"Satisfecho","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685145600000}
{"reviewTitle":"You get what you pay for","reviewDescription":"It worked fine for about a year, but at this point it's unusable.  The cable now causes any output display to have a flicker\/distortion at the top and bottom of the screen. I've tried three different displays (2 TVs. 1 monitor)  and two different outputs (computer\/Switch), it's definitely the cable.  It's been sitting almost untouched for the entirety of its use, no bends or kinks in the cable.I have HDMI cables from ages ago that still hold up, I've never seen a cable fail like this without being abused in some way.  If you want something that's going to last, just pay a few bucks more for something you won't have to waste time testing and replacing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600732800000}
{"reviewTitle":"Constant Audio Drop Out!","reviewDescription":"I just bought a LG 65C8 OLED TV with a 10-bit Display, Model number: OLED65C8PUA...,  A week ago, And I have been on the hunt for a HDMI cable that will support, 4K Ultra HD, Dolby Vision®, Dolby Atmos, Advanced HDR, HDR10, HLG @ 18Gbps..After buying and trying a couple of different High Speed HDMI cable's here at Amazon, Including this one... Not one, Has worked without having Audio drop out's...My setup: LG 65C8 OLED connected to Denon X3200W via HDMI...Using the LG C8 in tv app's, Netflix, Amazon prime and VUDU....  All have the same Audio drop out's..I get perfect picture quality.... Just constant Audio drop out's....However, Watching my Time Warner Cable in DD 5.1 Audio, I have no issue's.... Strange, I know.....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1538611200000}
{"reviewTitle":"Poor quality leads to audio problems","reviewDescription":"Bought this so we could watch amazon prime video shows on the tv.  We were getting by with our old 6 ft hdmi cord,  but decided the longer cord would be more convenient. Since using this cord, all of our video selections have audio issues.  The audio gets completely out of sync with the video picture.  Since it didn't happen with our old cord, it must be the quality of this cord.  Too late to return it - very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644019200000}
{"reviewTitle":"Thick cable but delicate cables internally","reviewDescription":"This cable works for plugging in one time, but after a few times, I think the stress of the weight of the cable eventually made it stop working.  Doesn't matter which input or output device I'm plugging it to, it will not even detect a device was inserted.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672185600000}
{"reviewTitle":"My 4K HDR Home Theater components don't like them.","reviewDescription":"I'm usually a fan of most AmazonBasics items, but these cable are just junk. First bunch I ordered had several out of the box that didn't work at all, they replaced those and now most of all of them have quit working. I have a home theater setup, all 4K-HDR components..bluray, receiver, curved tv, and also xbox1 and ps4. When I upgraded the components in my system to 4K HDR capable, I bought these cables as an \"upgrade\". For some reason my Onkyo receiver and Samsung TV just don't like them. Samsung 4K bluray player doesn't either. They were intermittent at passing signal (for the ones that initially would work) until they failed. Drove me crazy trying to find the source of the problem since you never know upgrading all the components at once. Ended up putting my old HDMI cables back on and everything is working just fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1479254400000}
{"reviewTitle":"I just got it today bad news","reviewDescription":"I just got it today. Excited to hook it up but with two in the box only one worked how very sad. My tv gave me a message that it wasn't connected to try turning the unit off and try again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"MADE IN CHINA NOT VIETNAM","reviewDescription":"Product description states this cable is made in Vietnam. It is not. The packaging clearly states made in China. I specifically bought this cable over others because it was supposedly NOT made in China….we will see how long it lasts…","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"Low Quality","reviewDescription":"There is a noticeable degradation of image and audio quality when using this cable.  I switched back to an excessively long cable because of how poorly this worked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Pay a few dollars more for 4k@60hz 4:4:4 compatible cables","reviewDescription":"I originally really liked these cables but after more real world testing with 4K@60hz 4:4:4 they've come to disappoint. You might get away with using this if you have a single short run direct from device to TV. In my case, a PS4 Pro to LG OLED C8. It would give occasional partial snow on the screen that would flash. But, very occasional and worked most of the time. Once I ran through the receiver it became far less reliable and I had to switch cables entirely. My receiver does support pass-through for this format.Most people won't experience this unless you're using a PS4 Pro or PC that wants to send 4:4:4.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1558483200000}
{"reviewTitle":"Not fast enough for 4K +HDR +Atmos!!","reviewDescription":"This cable caused me so much grief!!! I got a new soundbar and had issues getting 4k + HDR + Atmos working from my Xbox one S to make it to my TV. Ended up upgrading to a Xbox one x for the holidays to fix my issues and they were even worse! I had been bugging Samsung (soundbar) along with Microsoft (Xbox) for months! Finally swapped out this cable to a monoprice 8k cable and everything works now!!!This cable cannot handle too much thrown it's way! I agree, you don't need to spend a ton on an HDMI cable BUT you need one that can handle enough bandwidth!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577145600000}
{"reviewTitle":"Good at first","reviewDescription":"This cable was great at first about a month maybe not that long then I had to jiggle it to make the connection I'd did that for a week then it took a dump. I would not buy again","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Unstable with Dolby Vision\/Dolby Atmos","reviewDescription":"If you want to use this on a A\/V setup that uses the latest tech, forget it. Tried using this on a setup with an Apple TV 4K, 4K OLED & Soundbar - Dolby Vision and Dolby Atmos enabled, and it was unstable. Image had static, the tv would switch from Dolby Vision to lower bandwidth HDR randomly. The sound would occasionally make a popping sound. The fix: getting the $30 Dolby Vision certified cable from Belkin (48 Gbps). Not to mention this Amazon cable is super thick, fatter than coaxial cable!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1542499200000}
{"reviewTitle":"Worked for a while then stopped","reviewDescription":"I bought this Amazon Basics HDMI cord about 5 months ago to connect monitor to my laptop for school work. Everything was going fine until a few days ago, when my monitor started having issues with connecting. I have determined my monitor is not the problem, but the cord. Now I'm stuck in COVID-19 quarantine without a working monitor to do work and school from home. My advice is to spend the extra and buy a nicer HDMI cord.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1585008000000}
{"reviewTitle":"Poor quality and one lasted only a week!!","reviewDescription":"Had one cable just stop working after a week!! Very disappointing especially after I had cables hidden and fed through track just to have to pull it out a week later to install another new cable! Not sure why amazon would put their stamp on these??Update: I purchased the 10’ ones but just read some reviews and they say the 6’ or less work but greater than 6’ cables others are seeing the same issues I had for what that is worth to ya.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1562457600000}
{"reviewTitle":"Functional but not reliable","reviewDescription":"Cable length and material is nice.  However, I may have received a faulty cable.  On all devices I've used it on, the picture disconnects and reconnects if the cable or device moves just slightly.  It connects securely, but it is very touchy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649635200000}
{"reviewTitle":"Do not use for XBOX One. Cable does not fully seat in XBOX HDMI port receptacle.","reviewDescription":"Not happy with these HDMI cables. The ends of the cables are SQUARED OFF right before the male HDMI connector. Many HDMI devices have their female HDMI ports recessed slightly. This squaring off of the cable ends blocks the cable from deeply seating in the HDMIi port of the device. An example of recessed HDMI ports is the XBOX One. I am constantly having to push the cable ends into the XBOX One HDMI ports to enable the video connection. The tips should be much flatter (tapered) as many other HDMI cables are. I cannot recommend due to this poor design flaw.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1500422400000}
{"reviewTitle":"Rolling line on the screen","reviewDescription":"Used this to connect my projector.  There is a singe line that rolls up and down the top half of the screen.  This doesn't happen with the Chromecast or when i had the cable box closer with a shorter cable connecting the 2.  It is also a thick stiff cable.  Not very forgiving to bend. Otherwise the picture itself isn't bad","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1630108800000}
{"reviewTitle":"Use with great care","reviewDescription":"I designed computer circuits involving interconnections all my professional life. One project involved the redesign of of a marginal connector. I reviewed the design and construction of many different connectors and eventually submitted a redesign to correct the problems. This cable is a terrible example of an incompetent design. The connector is too short to support a cable not clamped to the housing. The bonding is nothing but pressure fit of plastic over metal, both plastic and metal being inferior. The only safe way to use this is to have the whole cable clamped in  a way to prevent ANY!!!!!! stress on it from handling the cable or moving the connected equipment.","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1459296000000}
{"reviewTitle":"This cable is unnecessarily huge! it's so fat","reviewDescription":"This cable is unnecessarily huge! it's so fat.  Shielding is important for analog signals but come on man this is a pretty standard digital signal and I don't think 15ft is very far to worry too much. I guess you can almost see it from the picture, but it seems a heck of a lot bigger in person.  geesh.  The Amazon 6ft was really nice and I was hoping it would be the same but it's not. One nice thing is that it is a nice flexible material like the 6th one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1519862400000}
{"reviewTitle":"those cables would not allow the XBOX to work in 4K","reviewDescription":"ed flawlessly (no artifacts, flickering or other issues), the other two did not work as well. I tried Twisted Veins HDMI cables as well and had similar issues. I finally picked up Monoprice cables and haven't had any problems. Most people have good luck with these cables in shorter lengths (6ft or less), however at 10ft or longer I recommend looking for something else if you are using these on a 4K display. The two issues I saw with t","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1567641600000}
{"reviewTitle":"Does not work between Samsung Blu-Ray and Samsung Soundbar with Samsung TV (!)","reviewDescription":"I installed this cable -- well, a couple of them, in fact, between my Samsung Smart TV and several items back in 2017.  My Blu-Ray player and Soundbar are also Samsung devices.  Zero compatibility question between them.  Well, the Blu-Ray is connected to the Soundbar, and the Soundbar is connected to the TV.  Boring by-the-book setup.  Scads of problems with the TV deciding it couldn't figure out what the Soundbar was, intermittently, if you turned up the Blu-Ray player.  To get it all working again was a complex exercise in resetting the TV via unplug or sparsely-documented reset sequence, blah blah blah.I blamed the Blu-Ray.  Kind of an edge device in the age of streaming, whatever.  Until 2022.In 2022, things got weirder and wouldn't behave in bigger terms.  HDCP errors, sound but no video, plus the original set of issues if trying to use the Blu-Ray player.  On a hunch, I decided to swap out this Amazon cable, replacing it with a not-Amazon one that had been more recently produced (and, interestingly, thicker).All those problems that had been in and out starting with the original install went buh-bye.  Permanently.Note again that I have more than one of this Amazon cable.  There was one going from the Blu-Ray to the Soundbar, and one going from the Soundbar to the TV.  Apparently the one going to the Blu-Ray is incompatible with whatever is going on in all these communications, to the point of the Blu-Ray-Soundbar cable keeping the TV -- connected by ANOTHER of the same Amazon cable -- from figuring out how to talk to the Soundbar at all.  Loud, clear, comm issues, which suggests a standards compliance issue.Or at least a standards compliance issue that affects things that talk to Samsung Blu-Ray players and\/or Soundbars.  Beats me.I want to give this cable more stars but with that kind of history, I simply can't.  Unfortunate, because it seemed like a good buy.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"What good is great picture quality when the cable goes kaput?","reviewDescription":"Sure it's cheap. Sure we got over a year's worth of usage out of it. But the long and the short of it is that it FAILED COMPLETELY, right in the middle of an important work meeting. In the middle of a presentation. Black Screen of Death. A most inconvenient and embarrassing episode. Lots of yelling. A curse word or two...or a couple of dozen. Belatedly I had to scavenge the HDMI cable off of my Xbox in order to get my wife's work computer back to operational order. Good thing I happened to be home, else who knows what I might've come home to.I suppose it could happen to any cable. But it DIDN'T. It happened to THIS one. I guess this unit was one of the 2 percenters (represented by the \"one star\" crowd reviling this product here on Amazon). So much for glorification of the \"Basics\". 'Miffed' doesn't even begin to describe the feeling. 'Torqued' however begins to...That said, I recently bought a 6 foot Amazon Basics HDMI cable...for the second time. Originally I had intended on using this new 6 footer for another device that I've got coming. The first 6 foot cable was purchased around the SAME TIME as this 3 footer that failed. So here's hoping that it continues to run on my second Xbox One, as this new one returns my first Xbox One back into service. And I now must decide whether I want to chance going cheap again and using yet ANOTHER Amazon Basics HDMI cable for this new inbound computer, or just suck it up and buy a more expensive 'name brand' cable and hope that its quality is better. I mean only 2% of absolute negativity isn't a bad ratio. Better than even Pfizer's COVID vaccine's success rate. Odds are heavily in my favor that such a calamitous failure won't happen a second time, right?Except when and if it does. Which NOW I can't get out of my mind. It's just like all of those cheap, money-sucking USB cables that are endlessly sold here on the website and fail miserably months if not weeks on.Thanks Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1612915200000}
{"reviewTitle":"This cable is problematic.","reviewDescription":"I bought this cable about 18mo ago to work with my Channel Master DVR+. I cut the cord years ago and liked the CM7500+ OTA DVR so much I went back for a 2nd, but alas, they didn't make them anymore. Finally found a used one on eBay; bought it. Bought this new cable to interface it with my new Yamaha Receiver. Live TV was perfect, but DVR playback was plagued with intermittent drop-outs of AUDIO ONLY. I assumed it was the used eBay Channel Master CM7500+ OTA DVR for quite sometime since is was only audio and only playback; never live TV. . I recently had spare time on my hands recovering from surgery and started more in depth troubleshooting. Reseated the HDMI cable several times on BOTH ends (cause is was driving me crazy with all of the TV I had to watch during recovery); no change at all. Noticed the DVR+ had a mini optical audio out port. Bought a new fiber optic cable and replacement HDMI cable as well since I was jumping in. Verdict: NO MORE Audio dropouts regardless of whether I used the new fiber-optic OR the new HDMI cable. THIS cable was ONLY 3' long; what the hell? The new cable is 3x-4x the cost of THIS one and designed to work with 8k signals - which this is not. But the bottom line is that these audio drop-outs were driving me nuts, and I lived with it waaaaay waaaaay tooo long. I find it curious that the video was not an issue (Intermittent audio loss was regardless of dolby digital [any flavor] or two channel stereo). AMAZING how nice it is when things suddenly work the way they're supposed to.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1633996800000}
{"reviewTitle":"I'm not happy.","reviewDescription":"I'm big into the latest and greatest technology but I don't always understand it. I'll tell you in my laymen's terms that these are garbage. I researched and figured we were saving money and that these were the latest and greatest. We just bought a 4K OLED tv and realized our current cables weren't high speed so I needed new ones. I bought these and hooked them up. I think we've had them a month and we were playing with our son on the PS4 and accused him of sitting on the tv remote because in the middle of a game the screen just went blank and acted like nothing was hooked up to the HDMI. This happened 3 more times in the same day and finally my husband switched out the HDMI cable after we realized no one was sitting on the remote. Obviously these are basically worthless if they only work for month. Getting returned and not sure what to buy now because I hate having to research things. I was really hopeful with the great price and reviews though.Update: I completely forgot to return these hunks of trash and they got shoved into a box of cables. Totally forgot about them. Fast forward a few years and we got a new Apple TV 4K. Hooked it all up and it worked fine for one day. Second day the screen flickered once in a while. Then it got more and more steady. VERY annoying, thought maybe it was the Apple TV, troubleshooted, still had the issue. After about 20 minutes the screen started straight up flickering black and gray and there was no picture at all. Reset everything, unplugged and replugged in everything and it was fine. 20 minutes later same crap again. Figured maybe it was the HDMI cable and swapped it out for a different brand. NO issues. Came on here to review and saw that I already had. I’ve had these just sitting in a box for like 4 years. They are complete garbage. I deeply regret not returning them. No idea why I didn’t.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1466035200000}
{"reviewTitle":"vendor will not accept a return..","reviewDescription":"vendor bad policy, they will not accept a return. They only offer trouble shooting ttips. Thier tips are wrothless, I needed a display port to hdmi, there is no troubleshooting that will fix that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Broke within a few months of buying!","reviewDescription":"Broke within a few months and no longer works for my monitor computer connection. Very frustrated and would like a replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"10 Feet cable does not work with the PS4 Pro or the Xbox one S","reviewDescription":"I ordered the 10 Feet cable and was sorely disappointed with the quality of the cable, its not like the 3 and 6 feet Amazon Basic cables. Right off the bat the HDMI connectors are flimsy and very short so there is a lot of pressure of the connectors if you connect them at right angles. Second issue and a deal breaker for me is that although it says this is the latest standard which I assumed is HDMI 2.0a this cable does not work with the PS4 pro and the Xbox one S. Both my gaming systems would not display HDR, whenever I tried to view something with HDR my TV would lose signal(I have the LG Oled E6 65inch). My PS4 pro would not even display anything after powering up with this cable, my Xbox one S would display at 4K but when playing HDR my TV would lose signal.On a side note if you do have a PS4 pro and a LG Oled E6 65inch TV and you have problems getting HDR to work or you do not get a signal when you power on your PS4 pro system try this it worked for me:1. Connect the PS4 pro with the HDMI cable which came with it to HDMI 1 on your TV ( I have 4 HDMI inputs and for some reason PS4 Pro only worked on HDMI 1 for me.2. Make sure deep color is enabled for HDMI 1 ( I enabled it for all my HDMI inputs)For now avoid this cable and just use the cable that came with your gaming consoles, I will be returning this cable and trying out the media bridge cables. Will update my results.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1504828800000}
{"reviewTitle":"Cannot stream 4K video from Fubo or other DRM-protected sources. NOT compatabile with HDCP 2.2!!","reviewDescription":"There are 2 Q&A answers that say this cable is HDCP 2.2 Compatible. This is not true! Look for the tiny, obscure link to the product manual PDF. The cover page reveals this cable is built to the HDMI 1.4 standard, which does not support streaming 4K content from DRM-protected sources like FUBO sports broadcasts.Also, if you look closely at the product description, it shows this was originally manufactured in 2015. That means it's effectively obsolete, as many streaming services are increasingly mandating HDCP 2.2 functionality, and for that you need an updated cable, which this is NOT.Amazon Basics shouldn't really be selling this obsolete cable here in 2024.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"If you need a 10 ft cable for 4k, don't buy this one.","reviewDescription":"This is a review for the 10 ft cable.  Although they list this as the latest standard, let me save you the hassle.  This will not do 4k @ 60 Hz. I've seen the Amazon cheerleader with the screenshots saying this cable works with 4k and HDR. My cable did not.  I should've taken some screenshots with my Xbox one X error list (but I didn't).  I freaked out when I hooked this up to my Xbox one X and the system reported it would not do full 4k but only upscale to 4k for games. I added a compatibility option which then said it would do 4k and HDR for movies, but would still not do games in Native 4k with HDR. First problem was my Sony TV was not set to Enhanced HDMI mode.  When I corrected that, the screen had red snow all over the background.  I freaked out thinking my Xbox was broken or my TV was not working properly.  After a couple hours of troubleshooting, I traced it down to the new \"latest standard\" HDMI cable I bought from Amazon.  I also noticed that other people have run into the same issue specifically with the 10 ft cable (see the Q&A section). Amazon refunded my money without question and I was able to purchase a functional cable from another seller on Amazon.  It works great and my Xbox now has no issues with all of the 4k display options.  If you need a 10 ft cable, buy this https:\/\/www.amazon.com\/dp\/B01CRA11IU\/ref=cm_sw_r_em_apa_Q0LeAb0J3AYQWIt's a few bucks more, but it works.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1511136000000}
{"reviewTitle":"Don't Believe These Can Handle HDR","reviewDescription":"Purchased these in December of 2016. Wanted to like these cables. I don't think they can handle HDR. Just picked up a 75 inch Samsung UN75MU800DFXZA (one of the top rated 75 inch TV's according to CNET and Consumer Reports) from Costco and had this weird distorted high lighting \/ shine effect on faces in movie mode (see attached pictures) and in scenes where the background was blurry it would also create this same strange effect. I exchanged my TV for another one to make sure it wasn't the TV (TV also came with a blemish and the google play credit had already been redeemed which made me question whether or not my TV was new) and the same effect persisted in my replacement TV. It happened all throughout the 4K\/HDR hard disc version of Wonder Woman being played through an Xbox One S to where we had to change out of movie mode (which uses darker colors,etc). I decided to try some rocketfish cables from Best Buy since they were on sale and considered \"certified\". The issue went away immediately in Wonder Woman, color and contrast was vivid and normal.  I tried a Netflix show through a Roku Ultra and the effect was partially there but not as bad, it then went away and I could not replicate again which makes be think its a bandwidth issue. I changed my Netflix settings to display the highest resolution picture and haven't noticed the issue since with the new rocketfish cables from best buy.  The biggest difference was in Wonder Woman disk, playing through an Xbox One S, issue was completely gone and this movie was not being streamed.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1511654400000}
{"reviewTitle":"25' Cable Did Not Support ARC","reviewDescription":"I see some conflicting reviews on this topic as far as ARC working or not, but not everyone is identifying the length of the cable. For me, the 25' cable did not offer full ARC functionality. I was increasing the distance between a TCL Smart TV and a pretty high end Dolby decoder, which had no issues with a 15' Amazon Basics cable between the same 2 devices. With the 25' cable the TV did see the Dolby during CEC device search, but identified the Dolby's HDMI port as non-ARC, which I know is incorrect because it functions with the shorter cable. Is cable length a factor or is it simply a cable defect? I can't say. I also can't discount the possibility that the TCL is somehow contributing too - it's not a high ent unit.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1621123200000}
{"reviewTitle":"Disappointed DON'T PURCHASE!","reviewDescription":"Unfortunately HDMI cable continues to short upon first use. Monitor signal does not stay connected and continues to go in and out every few minutes. Would. It recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Long term buyer's remorse","reviewDescription":"These were purchased almost two years ago to make sure everything would be future proof.  I have a Samsung UN65JS8500 and Denon AVR-S900W which both support HDMI 2.0, HDCP 2.2, 4k 60Hz in 4:4:4.These are the only type of cables I use and so far:- My PS4 Pro can't detect HDR.- My Samsumg UBD-K8500 can't detect HDR and the picture flickers in and out while the sound keeps playing.- My Roku Ultra can't do 4k 60HZ 4:4:4 but will do 4k 30Hz 4:4:4.- My PC can only connect at 4k 60Hz 4:2:2.Every 4k device I have was purchased to use all the features of my tv and I'm pretty sure these cables are why they don't.I wish I had known this was one of Amazon's own product lines that doesn't live up to its claim.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1520553600000}
{"reviewTitle":"Bad Experience and Bad HDMI Cable","reviewDescription":"Literally the first day that I got it, it didn’t work. Mind you, I opened it right out of the bag and connected my ps4 to my t.v. Right away, the picture isn’t clear, there is static, and the sound isn’t working all the way. So, I went to get a replacement, but out of the blue, the HDMI Cable starts working perfectly, so I canceled the replacement. Now, it’s back to how it was, not working, and now I can’t get the replacement without returning the item. I have to return the item, with a refund. This whole HDMI Cable just caused such a hassle all night long. I have never had to experience this ever when ordering from Amazon, and I have ordered an HDMI Cable from here before. Just a bad experience overall.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578528000000}
{"reviewTitle":"Worked well - until they didn't.","reviewDescription":"I purchased this two-pack of HDMI cables to connect my laptop to my television.  One to use, and one as a spare.  After about 10 months of using the first cable, it suddenly stopped working.  Tested it across other devices and televisions - dead.  BUT - I had my spare, so no problem.  Until 3 months later, and now that one works 50% of the time.  Plugging and unplugging plays the \"will-it-work\" lottery, but I don't have high hopes for a long future.I don't know why they don't work, but also know that they haven't been asked to do much.  Disappointed, and would not purchase these again.  It makes me reconsider choosign Amazon brand electronics in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1607472000000}
{"reviewTitle":"Broke my PS4 HDMI port.","reviewDescription":"I bought this and it worked great on my tv and ps4 for a couple of days. Yesterday I was going to play ps4 and the signal wouldn’t show on my tv. I took the hdmi cable out of the ps4 and hooked it up with my laptop and tv and was not able to see anything either. I went and bought a new one at Walmart and it worked on my laptop, but not the ps4. I looked more closely with a flashlight and my ps4 HDMI port had a small thin stick stuck to it. I looked at the bad HDMI cable and it had a small piece break off, the one inside my ps4 HDMI port. So now, I can’t play my ps4 because of this cheap piece of garbage...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"2 cables failed within 1 year","reviewDescription":"After 10 months one screen started goring off (no signal) intermittently the after a week it went off permanently. One month later the second Display to HDMI cable started displaying the same symptoms. I tried them on different monitors and different computers but still receiving 'no signal'. Now, my computer can see there is a monitor connected (even the brand) but the monitors receives no image. The cables are..well were in a permanent position, never moved for the entire year. The issue seems to be in the circuitry in the cable rather than a loose connection. The cable started 'blacking out' then went dark eventually.So if you want a quick fix or for a one-off job buy them but if you want to plug-in and forget it look elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1588377600000}
{"reviewTitle":"Not Consistent 4K60 Dolby Output","reviewDescription":"This is probably the most disappointed I've been in an Amazon product.  I've bought 11 of these cables, and they were fine for 4K60 HDR 10.  But I've had trouble with dolby HDR, specifically with an Apple TV 4K.  I'd also been unable to enable HDR on a Windows 10 htpc.  I spent hours troubleshooting over the months, when the only problem was these cables.  With the Apple TV I'd get random black screens and a note once, stating that my cable or TV could not support the resolution.On an Audio Video forum, I read about other people's problems similar to mine, and ended up buying monoprice premium cables.  Problem solved.  I dont know if this is a quality control issue, because these cables per their specs, should have no problems with any 4K resolution.","isVerified":true,"ratingScore":1,"reviewReaction":"54 people found this helpful","country":"United States","date":1543795200000}
{"reviewTitle":"Horrible","reviewDescription":"This was much larger than was advertised. It is much to large for what I need it for. I guess that I'll give it away. I'm never ordering from these people again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Poor Quality","reviewDescription":"I bought this bag for volleyball weekends for my children. I really liked the size of the bag and the colore(grey\/aqua blue) I used it maybe 3 times and the front pocket seam started to fray and rip. I can no longer put important items in that compartment bc they will fall out. I was very disappointed by the quality.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"This cable will not support a 4K signal!  It didn't for me.","reviewDescription":"I am using this between a projector and a 4K Apple TV.  This cable worked okay when connected to a Nintendo Switch (720p) or to a BlueRay player (1080p); however when connected to the Apple TV, the projector displays \"No Signal\" or \"Not Supported.\"I spent 30-60 minutes trying to figure out why the Apple TV wouldn't come up.  I even tried reversing the cable as I remember some longer HDMI cables are unidirectional - same results.  You would think the Apple TV would fall back to 1080p if it couldn't negotiate a 4K signal (but it didn't, not with this cable anyways).  This was very frustrating.  If I use a different cable between my 4K Apple TV and projector, it works fine.Given others' reviews, where it seems to work for many but fail for a percentage of customers, it seems that they don't test these cables when they are manufactured.  I presume that they have a failure rate that simply gets passed on to the customers and we were one of the unlucky ones.  Thanks for ruining our much-anticipated family movie night.  We'll have to pay $$$'s to a local box store for a long cable or wait a couple of days on a new cable to arrive.My Experience:  This is a cheap cable.  It will not support a 4K signal.Lesson Learned:  If you want a quality signal, purchase a quality cable.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1577232000000}
{"reviewTitle":"SUCKS","reviewDescription":"I am not happy. I bought this for my xbox one s and the picture was shaky and looked like a computer screen when you film it with a phone (if you know what i mean). I hated it but I thought I could live with it. So I powered thru, until I had only been watching youtube the first 2 days and decided I wanted to play a game and I clicked on minecraft. Literally anytime I tried to watch something (netflix, disney +, etc) that wasnt a youtube video, the screen would go, picture, black, picture, black, picture, black. And it would not stop until I unplugged the power.I thought my xbox broke, this has never happened before I plugged this hdmi cord in.So I plugged in my hdmi cord I bought from walmart in the livingroom and boom it was fine. No flashing on and off, no shaky gross picture.I usually love every product from amazon but this one was worthless for me. Not worth the chance. Go to walmart.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"does NOT support HDCP - read on","reviewDescription":"Bottom Line,  These cables do not support HDCP so you will NOT get the dialogue track, only the sound track associated with the video stream, making for some very interesting streaming of movies... LOL.I recently ordered, installed new HDMI cables to support 4K in my home theater system.  The thing about 4K is that all the devices and cables from content provider to display must be 4K compatible or the digital content drops to the least common denominator in the path.My wife and I thought we were watching a very avant-garde episode of FOREVER (Amazon Prime) through our Roku, where we could hear the music soundtrack but the character's dialogue was silent (like a silent film).  We thought the producers wanted us to figure out we needed to watch this episode with sub-titles and CC to get the true expression of the characters and feeling of the episode and to watch it as someone who was hearing unsound would watch it.  I have to say, it was quite a pleasant  and awesome experience not to mention the episode fit right into watching it this way.  But when we watched a different series, the same technical flaw occurred, which led me to look at the cabling.  I had to swap out this new cable from my Roku to receiver to get back the dialogue. These cables do not support HDCP.","isVerified":true,"ratingScore":1,"reviewReaction":"74 people found this helpful","country":"United States","date":1541721600000}
{"reviewTitle":"It's not the monitor or the drivers on Windows 10....its the low quality cable","reviewDescription":"I really dont ever give one star feedback on an item and Amazon basics products have been really great for me in all other circumstances. This HDMI cable might work for some electronics that dont require superior quality cable for HD or 4K monitors and TVs. I bought this one because it was shown as \"frequently purchase with\" add on for an HD monitor I bought to use with my HP laptop as a second screen. It worked for two days and stopped after that. I wish I could have known it was the brand new cable right away...but I looked at reviews on the monitor and saw people blaming the problem on the cheap monitor from Acer....or people thought it wasnt compatible with windows 10. All you get is a message that your computer won't detect the monitor. I tried windows updates...rolling back display drivers, updating drivers, flushing bios,  HP tech help, Acer Tech help....in the end after trying everything else I was about to throw the monitor away and get an HP monitor...expecting that since all my other devices were HP...it would work. Then as I was about to order it I was also going to get the HP HDMI cable. I decided to try just the new cable first. Two days later I got the cable...plugged it in....Bob's your uncle...it worked just fine! In fact the picture quality was even better than before.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1569196800000}
{"reviewTitle":"Didn't Work On a Headless Client Windows 7 Box","reviewDescription":"I purchased this cable primarily to use during a Windows 10 pro upgrade on a Windows 7 Pro Box.  It's a headless client and in day to day ops, I just RDP to it.  RDP will present some issues during the upgrade if a monitor isn't directly attached and that was my goal in getting this cable.  I tried for an hour on a known good HDMI port on my 1080 TV.  Nada.  It wouldn't pick up that anything was connected.  Figuring it might be my Windows 7 box, I updated drivers, etc. to no avail.  I then figured let me use a known good HDMI cable from my Roku, ran that to another working TV and expected it not to work as I thought the problem was my Windows 7 box but bam, instant success.  I know a lot of people have had good luck with this cable but I got a lemon.  By the way, I have purchased many great HDMI Amazon Basic cables over the years with much luck but my hope here was to get the 25 footer and then leave it run in case I ever needed to boot off USB, etc. and use my primary monitor.  Oh well.  I'm skeptical to try another after this.  Very thick and heavy cable, too, by the way.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1577750400000}
{"reviewTitle":"I cannot figure out if this is HDCP compliant","reviewDescription":"I am now getting a HDCP error when using my phone and this cable. I reread the specs and can’t determine if this meets the HDCP standards which is frustrate I didn’t even know they existed before I received error. I hope Amazon would sell cables that don’t meet these requirements","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Electrocuted","reviewDescription":"I got mildly electrocuted by one of these coming out of my Onkyo. I’ve never ever had that happen with any other HDMI cable and earnestly was surprised by it. I learned my lesson though: don’t buy cheap HDMI cables. Unless you want to get electrocuted.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713484800000}
{"reviewTitle":"NOT 4K COMPATIBLE","reviewDescription":"This cable resulted in red dots all over my 4K display and had to be replaced. Worked well with 1080p. Don't know if I got unlucky or if other reviewers haven't used this for 4K signals, but I'd avoid this one going forward.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Failed after 5 months","reviewDescription":"Great in the beginning, but then my picture started breaking up as I was booting into Windows.  Replaced with a cable that has 2-year guarantee, and was $5 more.  Usually, Amazon Basics works out for me, but not this time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Do not buy this cable, only one year warranty not lifetime","reviewDescription":"I thought Amazon basics cables were good quality at a low price. Turns out it's poor quality at a low price. I also thought Amazon basics cables were under a limited lifetime warranty, but this product is only under a one year warranty. My cable ended up lasting less than 3 years, for a cable to fail in less than 3 years it has to be poorly made. And Amazon shows how little confidence they have in it with only a one year warranty.Like some of the other negative reviews mentioned here, my tv started flickering on and off. I went crazy trying to find out what the problem was with my receiver, my tv, and my pc. I was changing settings and plugging and unpugging a bunch of stuff, a lot of time was wasted. Then I thought unlikely as it is, maybe I can try changing the HDMI cable. And instantly the problem was fixed, it was this poorly made cable that was causing the problems. DO NOT BUY IT, there are many affordable options out there that are better and they don't screw you with a one year warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1620432000000}
{"reviewTitle":"Works, but absurdly thick","reviewDescription":"The HDMI cable works fine, but it's absurdly thick. I'd guess twice as thick as most regular HDMI cables. With all that girth it acts like a spring, so if you plug it into a small device (IoT\/Raspberry Pi), it wants to uncoil and flip the device. The plastic around the plug is also really thick, so it doesn't easily fit into screens with little clearance room. The video quality is good at 1920x1200. I haven't tested it at higher resolutions.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1600905600000}
{"reviewTitle":"Does not work for 1440p144hz - Cable might be too long","reviewDescription":"Warning: Does not work at 2560x1440p 144hz displays.I tried this 10ft HDMI cable with my GTX 1080 and the ASUS MG278Q 1440p144hz monitor that has a HDMI 2.0 input.When connected, the display would not turn on unless I set the resolution\/fps to 1440p 120hz. At 1440p120, the image came up on the display and there were no issues.Using the same cable, but 6ft version, I could run the display at 1440p144hz.This leads be to believe that the issue is with the cable length, even though 10ft is not very long. Maybe bad materials are used?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1508284800000}
{"reviewTitle":"Thicc cable but gets the job done","reviewDescription":"To start off, the cable works great. Got solid picture quality and was plenty long enough (25ft) but the cable is stupid thick. I have a shorter version of this cable and it’s much, much thinner. I expected the 25ft cable to be thicker but it is almost an inch thick. I had planned on tucking this cable away but since it’s so thick and stiff it’s hard to tuck it away or keep it from bundling back up.Tl;dr - Great cable if you don’t mind it being super thicc","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1555977600000}
{"reviewTitle":"Chrome OS Not Ready","reviewDescription":"The hardware itself is great. Chrome OS on the other hand is mostly terrible... My biggest complaint is the file system because it cannot handle more than 50 folders or 1000 files in a given directory before it crashes. It reminds me of how clunky drive.google.com is when dealing with a directory with 300+ folders. Try moving a file to your desired folder and you will know what I mean.This might be great for a casual user or as an HTPC but I did not spend enough time with it to test this.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1539043200000}
{"reviewTitle":"It works very well, but be prepared:  it's VERY thick and heavy duty.  Not quite what I expected with an HDMI cable.","reviewDescription":"Though it works as it should, it is VERY thick and heavy.  I didn't expect it to be so heavy duty.  My original plan was using this with my laptop to stream movies onto my TV, and though I can do this and it works well, the cable is very thick and heavy.  Much thicker than a standard HDMI cable.  About the same thickness as an orange extension cord.  Yes...that thick.  It's definitely made to last, that's for sure.As for its performance, it works as it should.  No artifacts.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1518739200000}
{"reviewTitle":"Very STIFF","reviewDescription":"Length and quality are PERFECTcord is VERY STIFF and difficult to bend at close to 90 degree angle....straight runs are fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665360000000}
{"reviewTitle":"Its a cable...works","reviewDescription":"seems to work on my older model tv so its ok","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673827200000}
{"reviewTitle":"Stopped working after 2 years","reviewDescription":"Worked well for a bit but after around 1.5 years of use the picture on my second monitor would start flashing while using the cable. The issue went away when using a different cable so I guess it just has a two year lifespan","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648425600000}
{"reviewTitle":"Quality cables but very thick","reviewDescription":"Purchased these hefty cables after being loaned another pair from my neighbor.  His cables were also excellent quality from Amazon's own brand.  When mine arrived, the first thing I noticed is the thickness of the cable.  His cables were half the diameter as the ones I ordered.  Not sure why so thick.  The quality is there and overall they are well made.I have decided to keep the cable as they work the same.  Recommended","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578268800000}
{"reviewTitle":"Very thick cord","reviewDescription":"Product was as described but the cords was very thick and hard to maneuver. Had to really bend the cord to get it to plug into the TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663286400000}
{"reviewTitle":"Decent HDMI cables but not premium certified","reviewDescription":"Not the best but not the worst.  It will work for most applications and some will work for 4K 60Hz but some won't (which is why some of the reviews here seem to contradict each other).  The problem is that HDMI standards are kind of sketchy these days.  The current \"high speed\" HDMI spec requires 10.2 Gbps testing but companies are allowed to sort of cheat and extrapolate to say it should work for 18 Gbps.  The only way to know if a cable has actually been tested for 18 Gbps is if the cable is premium certified, which these aren't.  Monoprice sells premium certified cables for about the same price as these and blue jeans cables sells higher quality premium certified cables at reasonable prices.  I'd recommend BJC if you want to make sure you don't have issues between your high end 4K equipment or Monoprice if you want the lowest cost premium certified cables.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1488240000000}
{"reviewTitle":"Should have bought it years ago","reviewDescription":"Dislikes: The Velcro securing straps fell apart from sun damage in a few months. A real dumb design.Not much to say outer than it does the job and even protects the wipers from sun damage. What I would like is the ability for the side pieces had screen panel over the widows in order to have more ventilation. I might try that myself. I would also like a small clear panel in the front so peek out to the front.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632441600000}
{"reviewTitle":"Cable is VERY thick.","reviewDescription":"The cable is very thick. It is difficult to bend and use in areas that have limited space for wires. It will also take up twice the space in grommets or pass throughs.With that said, the cable does work well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675641600000}
{"reviewTitle":"Not as advertised","reviewDescription":"Product is rated CL3, with 32AWG which is under the standard recommended gauge for wires of this length. The wire is noticeably thinner than my other HDMI cables rated 28\/30.Plugs in and works just fine, but will be returning as the wire is uncomfortably thin for my use. If you aren't going to be twisting the wire a lot you might be okay, but YMMV.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1642032000000}
{"reviewTitle":"Great... when they work","reviewDescription":"Three stars due purely to inconsistency in quality. Ordered one pair, and one of the cables works (and the other doesn’t) when hooked up to sources using HDR10. Both cables work fine if hooked up to sources not requiring this much bandwidth. Still super cheap if you don’t mind the potential waste of some being to full spec and some not. The cable that works looks and sounds great. No discernible video or audio issues, though it may take longer to complete initial HDCP handshake than my previous cables (I think... could be mis-remembering and I’m not going to check) even though it will complete the handshake.I will be trying a different brand for my next purchase as I am looking for cables that work with HDR10 sources and I do mind the waste.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1545264000000}
{"reviewTitle":"Recommend","reviewDescription":"Would buy again","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"Good Back Up Cord","reviewDescription":"Good backup, but found there is a quality loss from my regular HDMI cable","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Thick heavy and stiff. Only buy if you plan to plug this cord in and then never move it again.","reviewDescription":"I bought this cord to connect my computer to the TV . It is about as thick as my pinky finger and very stiff making it awkward to fit behind the tv when not in use and making it hard to position the computer without the cord pushing the computer around and sometimes putting tension on the hdmi port which causes connection issues as well as not being great for the port long term. the coiled up cord is also about as heavy as my laptop and takes up as much room in a bag, so not great for portability. it is long and seems to work fine other than the connection issues from it being so stiff and hard to position correctly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1591574400000}
{"reviewTitle":"Careful, doesn’t fit securely","reviewDescription":"I’ve never heard of one of these cords not fitting well but it just seems loose and it always needs to be adjusted. I don’t know if I got a bad one or if this model is not made right but I recommend trying something else","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1660780800000}
{"reviewTitle":"3x as thick as any HDMI cable I've used","reviewDescription":"Cable seems to work well and is well built. Two issues that bother me is 1) cable thickness and 2) connector she'll size.1) Could be good or bad depending on your needs, but I needed to run this through a narrow channel. The cable is 3x as thick as the one I'm replacing which made things much more difficult.2) I feel like the connector casing is bulkier also. Again, probably good for durability, but I could see it getting in the way of ports, as it is currently pressed up all the way against where I've plugged it it. Works fine so far, but I could see it possibly coming loose if disturbed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1572307200000}
{"reviewTitle":"Good for a year or so","reviewDescription":"Worked well for a short time but like most things made today is cheaply made inside and I find that it shorts occasionally causing me to mess with the plug-in part. Maybe I just got one that was made by a lazy worker? It happens... maybe a design flaw though. All in all I don't think that throwing more money at another one would necessarily mean that it is made any better as most companies today want to use the cheapest materials put together by the most inexpensive labor that they can possibly find and it shows.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1580083200000}
{"reviewTitle":"1.4 or 2.0 HDMI cables?","reviewDescription":"I bought a new 4K HDTV in November 2015 and bought new AmazonBasics High-Speed HDMI cables for it.  While buying another 4k TV this month  I noticed that a new 2.0 standard for HDMI cables was recommended.  I checked my 2015 cables and no where on the cable do they say 2.0. I also reviewed my order from Amazon and found the cables were the 1.4 version.  So I ordered the new 2.0 cables and when they arrived they also do not say anywhere on the cable that they are 2.0. While the package says 2.0, the cables do not.  They look exactly like my old 1.4 cables.  How do I know I now have 2.0 cables?","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1466467200000}
{"reviewTitle":"Didn't work for me","reviewDescription":"It's a very nice HDMI cable but it didn't work for my Acer Chromebook spin 713, I got sound but could only see my wallpaper. Maybe I need to do something else besides plug it in but it doesn't come with directions on how to use it so I have no idea.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644364800000}
{"reviewTitle":"Mixed results at 4K 60Hz","reviewDescription":"I've purchased 3 of these in the past couple of years,  Only 1 seems to be able to pass 4k 60Hz signal reliably.  The latest one I got absolutely would not provide my Samsung ku6300 tv with 4k 60Hz 4:4:4 signal from my GTX 1050 and appears to struggle doing this at 30Hz, another did but had artifacts on the screen, and the other (the oldest, incidentally) appears to work correctly.  All can do 4k 30Hz 4:2:0.  I got a refund for the latest one and Amazon didn't ask me to send it back, so props for that, but after this experience I'll try spending a little more next time.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1500508800000}
{"reviewTitle":"Don't buy","reviewDescription":"Caught fire while I was gone. Thank goodness my mother was at my house to put the fire out.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"Decent for the price, but didn’t last long","reviewDescription":"It was great while it still worked. However, it stopped working after about a year and a half. But I guess that’s to be expected at this price point.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"Functions okay, but not HDR or UHD capable","reviewDescription":"When I replaced a 6 foot Amazon Basics HDMI cable, with a 4K HDR HDMI cable, I saw a significant improvement in the picture quality.  I immediately ordered new 3 foot 4K HDR HDMI cables to replace the Amazon Basic cables that go between my UHD 4K devices (i.e., ROKU, Apple TV, & Blu-ray Player) and my UHD 4K Denon Receiver. (Note:  My TV is a 65\" Sony Bravia 4K UHD.)  Amazon Basics cables are a great value buy.  But, if you want maximum picture quality, buy cables that are HDR\/UHD capable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1593993600000}
{"reviewTitle":"Ok, but not for 4K","reviewDescription":"Does basic HDMI fine. With 4K it would cut our randomly for a few seconds about twice an hour. No a big deal until you are playing a game and the screen goes black for a few seconds RIGHT IN THE MIDDLE OF THAT GIANT ZERG!!!Will you have the same problem? Maybe, maybe not.  I have found at least 2 other people who report the same issue with this cable. So if you are planning to put a signal through it at full 4K resolution, do yourself a favor and spend the extra $6 for a Cable Matters cable right here on Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1524873600000}
{"reviewTitle":"Tested with 4K HDR and Dolby Vision","reviewDescription":"Works with Apple TV too. I have this HDMI cable going from my Denon AV receiver to my LG OLED TV and all my devices hooked to my AV receiver using this HDMI cable as well. Everything works great. Don't listen to the reviews that said Dolby Vision doesn't work on the Apple TV. They probably didn't set up their AV receiver and TV settings properly. The TV and the AV receiver has a setting that is listed as HDMI Deep Color or HDMI Enhanced that you will need to enable for HDR and Dolby Vision.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1567555200000}
{"reviewTitle":"to stop wasting their money","reviewDescription":"As a former sales person of stereo equipment we were always told to \"push new cables on new purchases\", and for good reason. I think the markup on cables and such might surpass jewelry!! It's just horrible. So stop buying those overpriced cables and buy them here on Amazon, or at a couple of other online retailers, for much, MUCH less. They work just as well as the name brand cables, just without the fancy colors, or the fancy labels. But hey, if you've got one of those unlimited budgets and money is no objec","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1567555200000}
{"reviewTitle":"Good Performance, Good Price.","reviewDescription":"The Amazon Basics High-Speed HDMI Cable has proven to be an excellent addition to my studio setup, with dual monitors. With a high bandwidth, it seamlessly transmits high-definition content, providing a smooth and uninterrupted connection between my devices. The sturdy construction and secure connectors add to its reliability.In terms of value for money, the Amazon HDMI Cable seem to be reasonably priced, and doesn't seem to sacrifice quality.Whether you're a casual viewer, a dedicated gamer, programmer or producer, film or music, this cable will serve you right.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Good","reviewDescription":"Simple HDMI, works good and lasted this long so far. Would get again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Working well","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"Works as designed","reviewDescription":"Work like a normal hdmi cable. Has clear picture","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Normal","reviewDescription":"I didn't use long found better ones","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"It’s regular","reviewDescription":"Nothing wrong with it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Great for length","reviewDescription":"The cable doesn't feel very high quality but the great thing it has the length. Works great for running my hdmi cord from my switch to my TV through the wall","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Muy buen articulo","reviewDescription":"El producto llego segun lo esperado, es buena compra por un comodo precio","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Good for basic computer use, not for gaming","reviewDescription":"I recently purchased the Amazon Basics High-Speed HDMI Cable for my basic computer needs and I'm satisfied with my purchase. The cable is 6 feet long, which is perfect for my setup, and supports 4K\/60Hz resolution. I've had no issues with connectivity or image quality, and the cable has been reliable so far.However, I should note that this cable may not be suitable for gaming or other high-performance needs. The quality is good enough for basic computer use, but I wouldn't recommend it for more demanding applications.Overall, I think the Amazon Basics High-Speed HDMI Cable is a great value for its price. It gets the job done for basic computer use and I'm happy with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"works well","reviewDescription":"used to connect an HDMI switch to TV set, worked fine","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Pleased with my purchase.","reviewDescription":"The Amazon Basics HDMI cable is working well so far. I purchased this cable for my laptop so that I may connect to a flat screen TV while on vacation. An extra cable is good to have on hand. I am satisfied with this  HDMI cable.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"Perfect for mirroring my laptop","reviewDescription":"Work with my laptop perfectly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685923200000}
{"reviewTitle":"Good product","reviewDescription":"I didn't quite check before ordering but I got 3 ft which is smaller. Otherwise very good and works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680134400000}
{"reviewTitle":"Great quality, thick cable...did not support HDR from PS4 Pro","reviewDescription":"This HDMI cable is like a garden hose. It’s seriously thick. Way bigger than I expected. But it works great for connecting my PS4 up to a monitor 25’ away. Great picture, no lag or signal disruption, and as thick as the cable is, I don’t have to worry about the cable weakening or breaking over time as I roll and unroll the cable often to use when gaming.UPDATE 01\/24\/2020 - I ultimately had to replace this cable with another brand. I recently purchased a brand new LG UltraGear 4K HDR gaming monitor, and for some reason this cable was not passing along an HDR signal. Switching to other cables I had worked fine, but switching back to this cable did not. My PS4 Pro would indicate that the connected display did not support HDR while this cable was in use. I ended up purchasing another 25' HDMI cable of a different brand, and that cable works without issue, fully supporting HDR.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1576540800000}
{"reviewTitle":"No problems...no complaints","reviewDescription":"This HDMI cable is not as well made as the Monoprice HDMI cables I usually gravitate towards, but it works, so I can't complain. For a cable that's supposed to be triple shielded, l was surprised at how thin it is... much thinner than the Monoprice HDMI cable that's comparable in price. I'll probably not purchase it again, but not because it's a bad cable, I just don't like the build quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1656115200000}
{"reviewTitle":"Worked as expected","reviewDescription":"Worked just fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687996800000}
{"reviewTitle":"Heavy","reviewDescription":"The cord looks heavy and strong.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684281600000}
{"reviewTitle":"Worth as price","reviewDescription":"The cable is working fine until now. Little short than expected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"It's average but most people buying Amazon Basic expect that...","reviewDescription":"It's average but most people buying Amazon Basic expect that but it still doesn't mean it deserves 5 stars. It's a 3 to 4 star quality item I would recommend it if that's what you're expecting. If you want premium, go pay for a premium item.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670198400000}
{"reviewTitle":"It's a good buy","reviewDescription":"It looks gold plated in the pictures, but in real life you will squint to see some yellow color on the tip. It does it's job in 90% of cases. May not be recommended for extreme users for video\/photo editing and competitive gaming. Other then that it's a solid buy.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669852800000}
{"reviewTitle":"Just get a better quality cable.","reviewDescription":"Not worth it. First of all it would keep losing the signal to my TV when my graphic drivers on my computer needed to be updated. Newsflash: I need to see my computer screen to update the drivers. Firstly I had to switch out my hdmi to update my drivers. Secondly I've had it for approx 3 months and now it has died. No signal at all. Again I thought my drivers needed updating (which they did) and proceeded to flip hdmi cables, after it updated the cable still didn't work and I tested it with my cable box still to a \"no signal\" message appearing on my TV screen. Do yourself the favor and just get a better quality cable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1552089600000}
{"reviewTitle":"WHAT A HASSLE! DO NOT BUY!","reviewDescription":"This cable, which is now ran behind drywall and a part of the house essentially, is DEFECTIVE!I ran another brand cable that is the exact same length OUTSIDE the wall, and it has NO ISSUES. Clearly quality control issues here. What a mistake I made buying this cable.Be smarter then me. Saving 10 bucks IS NOT WORTH IT!On top of that they want me to remove the cable top get a refund. I cant without major sheetrock rework so I guess I get to keep this junk cable in the wall as well. Horrible experience AMAZON! Shame.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1610841600000}
{"reviewTitle":"Not for 4K!","reviewDescription":"This is about the 10 feet cables; maybe the shorter cables are ok...Quality of cables is insufficiënt to carry 4K input over 10 feet; PlayStation 4 pro crackling sound, Sonos sound bar cuts out every 10 minutes and Verizon tv box cuts sound (although very rarely but it’s not a 4K device).When I put back the factory cables of the devices, everything ran smoothly again. The amazon cables are a lot thicker than the factory cables, assuming higher quality but this is not the case. All 3 cables presented problems straight away, so it’s not an accidental production fault. The cables are simply not fit for 4K over 10 feet.Low price but unfortunately it shows. Returned them. Throwing more bucks at other cables.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1545436800000}
{"reviewTitle":"Tv","reviewDescription":"It did not work for me","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Bad Cable","reviewDescription":"I went with the super high rating on this cable (I had a shorter one that didn't quite span the distance between the TV and the couch), but I was disappointed to find out that the connection was unstable. The image came up then went black. Strangely, the laptop I had it connected to still thought there was an external screen plugged in, although the screen was black. I understand that occasional manufacturing flaws happen, but I now feel hesitant about ordering a replacement from the same model...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638748800000}
{"reviewTitle":"Nothing is perfect","reviewDescription":"I have loved AmazonBasics products. Sadly, this one worked once. The second time I plugged it into a port while something was playing on a different port (nothing plugged in on the other end of the cable), the TV went black. Repeated with same results 3 times. When  I plugged it in my laptop, the laptop screen went to multi colored fuss. I need to turn it off and let it set for a while to reset the graphic card. I know nothing is perfect and I just received a defective one. I WILL still buy AmazonBasics products, they are usually good.The only other thing I noticed was how thick and stiff the wire was. If the cable had worked I would have rated it a 4.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1515628800000}
{"reviewTitle":"Terrible","reviewDescription":"Right out of the box this cable was not reliable. After a few minutes of watching a show it went to black, I lost audio, and the screen of the TV turned blue which I assume it meant to say, \"I'm not getting anything.\" I got the same results from the HBO, Netflix, and Hulu apps. When I switched back to my original cable everything was fine. Worst of all I don't feel comfortable  trying to return it as I was so confident an HDMI cable should just work I had already written \"TV\" in silver sharpie on both ends of the cable. Buy Monoprice cables instead.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1580601600000}
{"reviewTitle":"Only lasts for a year or so","reviewDescription":"Definitely no. After one year of using this HDMI cable, I noticed my monitor gets turned off several times a day. First it was more like some random lines on the monitor. Then it got worse and the monitor got shutting off every hour or so. I thought it was the monitor or my laptop problem. Got a new monitor, tried with a new laptop, but still the same problem. I purchased another HDMI cable for $20, the problem was solved. No wonder why  the other HDMI cables cost double or sometime triple. Because this doesn’t last....a lesson learned.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1609977600000}
{"reviewTitle":"Not as it claims, but fine if you're using it for 1080p","reviewDescription":"This cable claims to be the \"latest standard\" but it is not. I have it connected through my PC to a TV, the TV is capable of 4k at 60hz, and the graphics card it's connected to is capable of 4k at 60hz but the wire must not be. I'm only able to get 4k at 30hz refresh rate, meaning this cord (or at least the one I received) is HDMI pre-1.4 not 2.2 (or whatever the latest standard currently is while I write this) Big disappointment as I ran it through my wall and it will be a big pain to get it out and run another (more capable wire) This misinformation has cost me a considerable annoyance, and for that it gets a 1 star from me.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1507075200000}
{"reviewTitle":"Unreliable HDMI cable!","reviewDescription":"While I am somewhat of a happy camper with most Amazon Basics products, I can report back that this particular Amazon Basics HDMI (6 ft.) cable is unpredictable. I connected it from a new good working Sony DVD player to my Samsung HDMI tv and no response at all. I tried several manipulations and settings to get it to work and nothing! Unfortunately, my window of opportunity to return it to Amazon for exchange\/refund has closed.My advice would be to test this particular product with your home equipment (while the return window is open) as soon as possible.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1609718400000}
{"reviewTitle":"Unreliable cables.","reviewDescription":"I have bought several of these over the last couple of years.  I have had to replace 3 of them within a year.  They started to randomly disconnect my monitors.  In one case  the slightest touch of the connector would cause the monitor to go blank.  At first I thought it was the port on the laptop but after replacing the cables with higher quality ones the problems stopped. I still have a few of them in use but will be ordering replacements so that I am not blindsided by a failing cable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1624838400000}
{"reviewTitle":"Very good","reviewDescription":"ALL I CAN SAY RIGHT NOW IS, AMAZON TOOK CARE OF EVERYTHING.Andrew D. Brewer","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Cables","reviewDescription":"Don't Work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Breaks Just After One Year","reviewDescription":"For 12 months, the cords worked perfectly but 13 months in, the cords stopped working with our Roku and Blu-ray player. I paid more for the Amazon Basics for Prime delivery and because I thought I could trust the name. They just dropship these cords from the same low quality manufacturers as all the other resellers. BUYER BEWARE. Amazon Basics are just good enough to last through the warranty so they don't have to replace them and so you come back to Amazon to buy another cord. I will see if my credit card company will do anything for me (extended warranty benefits).","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1579996800000}
{"reviewTitle":"Does not transfer sound","reviewDescription":"Transfers video without sound. I tried troubleshooting and made sure the output was to my TV but no luck. Cannot return the item as well even though the policy says I can. The application page won’t let me pass the troubleshooting step, keeps throwing error","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Five Stars ---> changed to 1 star","reviewDescription":"2017 SepOriginally I put 5 stars, because it worked fine after installation. However about 6 months, I started to observe issue that the video image blacked out intermittently. I was not able to find the root cause, because the issue was intermittent, but recently I completely lost the image, and I identified that root cause is this HDMI cable. After I replaced the cable with another one, the image was recovered and didn't show any intermittent issue.Because the cable failed in less than 1 year, I changed the ration to 1 star.2016 NovWorking fine without any issue.","isVerified":true,"ratingScore":1,"reviewReaction":"643 people found this helpful","country":"United States","date":1483660800000}
{"reviewTitle":"Literally broke within 15 mins.","reviewDescription":"I plugged it in and was getting a flickering screen, it was 3 feet away from my PC, so did not eat up the full 10' cord I ordered. Pulled it out, put it on my counter to look at it, inspect it, and the case around the USB fell off it right then and there, either this item was broken and returned and given to me, or it fell apart after one very-gentle use. I do not recommend this item, spend $12 and get yourself a professional, Grade A HDMI cable from a reliable company.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1600905600000}
{"reviewTitle":"Not 10 feet","reviewDescription":"Idk why all cable manufacturers lie like this. I'm 5'5\". This cable should be almost 2x my height. It's actually the same length as me. If it didn't reach where I needed it to, I'd be super angry. But it does. Don't buy it if you're really expecting literally 120\" of cable. It's barely over 60.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Misleading information (\"high-speed\" does not guarantee 18Gbps)","reviewDescription":"As of May 9th, 2019, the bullet points list the cable as supporting 18Gbps.  Further down, the manufacturer only claims 10.2Gbps.  The packaging and cable markings provide no clue about the actual supported speed.  According to wikipedia (and elsewhere), hdmi cables labeled as \"high-speed\" support 10.2Gbps, and hdmi cables labeled as \"premium high-speed\" support 18Gbps.After purchasing, my conclusion was that these are only guaranteed to support 10.2Gbps (4K at 30Hz) and will NOT guarantee 18Gbps (4K at 60 Hz) which is common in hardware nowadays.  The bullet points are false and misleading.  18Gbps may work at smaller lengths but is NOT guaranteed.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1557446400000}
{"reviewTitle":"Cheap but unreliable. Don't buy.","reviewDescription":"I purchased to connect my laptop to my flat screen TV, which is about 12 feet away, so that I can watch contents on my laptop on my TV. Somehow this cable lost signals frequently, and the TV blacked out, and said there is no signal detected. I purchased and tried a different cable thinking that the problem is not this cable but either my PC or TV. That was not the case; with an different cable, there was no problem of black out. I concluded that this cable is not reliable, and returned. The price is good, and in general Amazon Basics offers good-quality products at decent price points, but for this cable, you just get (bad) what you paid for (cheap). I never purchase Amazon Basics cable again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1485302400000}
{"reviewTitle":"excellent performance at a great price","reviewDescription":"I had bought an Amazon Basics High-Speed 4K Ultra HD HDMI 2.0 cable quite some time ago, and I was really satisfied with how this baby performs. It is a quite long 15-foot cable, and it has been really nice to have in the arsenal of entertainment equipment for the house. First off, the build quality on this cable is very great. The cable itself feels solid and well-made, with good connectors that make nice fits into my devices. That is long enough for me to get between the TV and components without being stressed out or cluttered. Then, in terms of performance, it's just what this HDMI cable says. Well, I tested it on my 4K TV with a variety of streamer boxes, and the picture quality is brilliant. Video flows clearly and smoothly at HD color with sharpness from 18 Gbps bandwidth and a 60 Hz refresh rate. I mean, the experience of playing movies, games, or series, it's just great. It also works great on my devices; I've used it in conjunction with a Blu-ray player, game console, and streaming box, and it works great every time. Being compatible with 4K Ultra HD, HDR, and 3D makes this device really versatile for the modern setup. In conclusion, the Amazon Basics High-Speed 4K Ultra HD HDMI 2.0 Cable is an excellent product for its very reasonable price; it offers great performance, good built quality, and big compatibility. I can surely recommend this to anyone who is looking for a trustworthy HDMI cable for home entertainment systems. No doubt, five stars!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Good quality","reviewDescription":"Such a good product for this price! It worked perfectly for my Lenovo monitor and my Macbook. 3ft is the right length if you are going to use it for your laptop and screen in the office~ another tip: if you plan to use the cable for your tv or other things, get a 6ft one which offers more flexibility","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Amazon Basics High-Speed 4K Ultra HD HDMI 2.0 Cable \/ Cord, 10ft \/ 3m, 18 Gbps, 60 Hz, 2160p","reviewDescription":"Plenty of length, good quality, slick appearance and flexible. Good price and convenient.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Seamless Connectivity for Your Entertainment","reviewDescription":"Experience crystal-clear visuals and immersive audio with the Amazon Basics HDMI Cable, a high-speed connectivity solution designed to enhance your entertainment experience. Engineered with precision and reliability in mind, this HDMI cable delivers exceptional performance, allowing you to enjoy 4K resolution at 60Hz, smooth video playback, and seamless audio transmission for all your multimedia needs.High-Speed Performance: The standout feature of the Amazon Basics HDMI Cable is its high-speed performance, capable of supporting data transfer rates of up to 18Gbps. Whether you're streaming high-definition content, gaming with friends, or enjoying your favorite movies and TV shows, this HDMI cable ensures smooth and uninterrupted performance, allowing you to enjoy every detail with stunning clarity and precision.4K@60Hz Resolution: With support for 4K resolution at 60Hz, the Amazon Basics HDMI Cable delivers breathtaking visuals with vibrant colors, sharp contrast, and lifelike detail. Whether you're watching movies, playing video games, or editing multimedia content, this HDMI cable ensures a true-to-life viewing experience, allowing you to see every frame in stunning clarity and precision.Enhanced Audio Transmission: In addition to stunning visuals, the Amazon Basics HDMI Cable also delivers enhanced audio transmission for a truly immersive entertainment experience. With support for high-definition audio formats such as Dolby Atmos and DTS:X, this HDMI cable ensures rich, immersive sound that brings your movies, music, and games to life like never before.Universal Compatibility: Compatible with a wide range of devices, including TVs, monitors, projectors, gaming consoles, Blu-ray players, and more, the Amazon Basics HDMI Cable offers universal connectivity for all your multimedia needs. Whether you're connecting your home theater system or setting up a gaming rig, this HDMI cable provides seamless compatibility and hassle-free setup, ensuring a reliable connection every time.Durable Construction: Built to last, the Amazon Basics HDMI Cable features a durable construction that withstands everyday wear and tear. The gold-plated connectors ensure a secure and stable connection, while the flexible PVC jacket provides added protection against bends, twists, and tangles. This HDMI cable is designed to withstand years of use, ensuring reliable performance for all your entertainment needs.Convenient Length Options: Available in a variety of length options, ranging from 3 feet to 25 feet, the Amazon Basics HDMI Cable offers flexibility and convenience for any setup. Whether you need a short cable for connecting devices close together or a longer cable for reaching across the room, there's a length option to suit your needs and preferences.In conclusion, the Amazon Basics HDMI Cable is a must-have accessory for anyone seeking seamless connectivity and stunning performance for their entertainment setup. With its high-speed performance, support for 4K resolution at 60Hz, enhanced audio transmission, universal compatibility, durable construction, and convenient length options, this HDMI cable delivers everything you need to enjoy a truly immersive multimedia experience. Upgrade your entertainment setup with the Amazon Basics HDMI Cable and enjoy the ultimate in visual clarity, audio fidelity, and connectivity reliability for all your favorite content.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Year-Long Reliability - Amazon Basics High-Speed HDMI Cable Review","reviewDescription":"Overview:After nearly a year of unwavering service, the Amazon Basics High-Speed HDMI Cable continues to shine as a paragon of reliability, seamlessly connecting my computer to an older TV for countless movie nights. This cable has proven itself not just as a functional accessory but as a durable and steadfast companion in my entertainment setup.Functionality and Long-Term Performance:The cable's primary function, establishing a flawless connection between my computer and TV, has remained consistently impressive over the past year. It effortlessly handles the transmission of digital signals, providing a consistently smooth and high-quality viewing experience without any signs of degradation.Quality and Durability Stand the Test of Time:The initial sense of durability and sturdiness has translated into enduring quality. After a year of regular use, the cable shows no signs of wear and tear. The connectors maintain a secure fit, ensuring a stable connection without any glitches. This long-term durability reaffirms the cable's value and reliability.Value for Money Over Time:The Amazon Basics High-Speed HDMI Cable's initial reputation for value for money has only strengthened over the course of a year. Its consistent performance and enduring quality make it not just an affordable choice but a wise and economical investment for anyone seeking reliable connectivity.Final Thoughts:As I reflect on nearly a year of seamless connectivity, the Amazon Basics High-Speed HDMI Cable has proven itself as an unsung hero in my entertainment setup. Its unassuming nature, coupled with exceptional functionality and durability, makes it a standout choice for those who value both performance and longevity in their tech accessories.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"Works just fine!","reviewDescription":"Have not had a single issue using this product, and I've hooked it and unhooked it from multiple things like my laptop and TVs and the performance seems to be just fine. This is also a very reasonable price for this length, and I would recommend it over getting only a 3-ft or 6 ft cable, because to hook in from a laptop to a back of a TV could require more length so you can comfortably plug it in without having to worry about it being short.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Works well for 4K HD and regular HD on TiVo, Apple TV, 4K projector, TV","reviewDescription":"Quality cable, does the job.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"There is no need to buy more expensive HDMI cables","reviewDescription":"Please do not waste your hard earned money on overpriced HDMI cables in the name of picture or sound improvements. I currently am using these AmazonBasics High-Speed HDMI cables to connect our Yamaha v379 AV receiver to other HDMI enabled devices that link back to our 4K Samsung Smart TV and these have performed flawlessly.HDMI cables come in four types: Standard-speed --> Standard-speed with Ethernet --> High-speed --> High-speed with Ethernet. Since High-speed cables are so cheap (e.g these AmazonBasics cables), there really isn't any point of getting Standard-speed anymore. On the other hand, as most HDMI devices today can't receive Ethernet over HDMI, High-speed HDMI cables are really all you need.** Some numbers **Standard-speed HDMI cables are rated up to 1080i (\"i\" stands for interlaced). In order for a HDMI cable to have a \"High-speed\" moniker, it must be capable of showing resolutions up to 4K --> 3840 x 2160 at 30fps (or 4,096 x 2160 at 24fps). And as the highest resolution any 4K TV currently on the market can produce is 3840 x 2160 at 30fps, even if you found a $100 cable at your local BestBuy that claims it can transmit much more than that, it doesn't matter as you are limited by your source (i.e your cable box, Xbox, PS4 e.t.c) and your TV's hardware capabilities.Also HDMI cables can either produce an image\/sound or nothing at all. There is NO in between. Therefore, a HDMI cable will either work or won't work (it may show a flashing image but this means it's a bad cable). But a more expensive HDMI cable will NOT show darker blacks and sharper colors than a less expensive HDMI cable. You either get 100% of the signal or no signal at all. Now if you intend on running your HDMI cable for more than 50ft, then you might want to invest in a HDMI cable that has \"active\" chips that help maintain the signal quality over a longer distance (but does NOT make the image\/sound any better than the source).** What about HDMI 1.4 or 2.0 or HDCP 2.2? **This is another common misconception due to manufacturer marketing. HDMI 1.4, 2.0 and HDCP 2.2 are all hardware changes that do NOT require a cable change! Although there is a difference between them (you can google that yourself), there is no such thing as a HDMI 1.4 or 2.0 or HDCP 2.2 cable! The version numbers refer to the devices that the HDMI cable connects into & NOT the cable itself. The cable simply is a pipeline linking the two. Hence, if you do happen to own a TV and another device that both have HDMI 2.0 ports, any AmazonBasics High-speed rated cable will work perfectly fine with it.** Conclusion **At this price point, there is very little reason to spend more money on more expensive HDMI cables over these AmazonBasics High-speed cables. If you have a 3D, 4K, HDCP 2.2 or HDMI-ARC compatible device, these High-speed cables will work perfectly fine for you.","isVerified":true,"ratingScore":5,"reviewReaction":"2,959 people found this helpful","country":"United States","date":1453161600000}
{"reviewTitle":"Great quality cable.","reviewDescription":"I've purchased multiple Amazon Basic HDMI cables in the past and they all work great!  I have a 4k 144hz and a 3440x1440 144hz monitor hooked up with Amazon Basic cables and have 0 issues.Crystal clear image and sound with no flickering or any other issues on all my devices.I highly recommend these cables!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Solid HDMI Cable","reviewDescription":"Did the job, Cable is thick and should hold up, fast delivery, good price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Snow flakes on screen with 1080p projector","reviewDescription":"This  6 ft 2016 cable has been in my \"spare\" collection for some time.  I used it today with a new BenQ 1080p video projector.  The result was random flashes of light on the screen and some flickering.  I swapped it out, and tried a Cable Matters slim 15' cable.  The picture was perfect, steady, and no random flashes.  Projector stays; cable is tossed out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1549238400000}
{"reviewTitle":"Not Exactly perfect","reviewDescription":"I bought this switch to switch between a game machine and a satellite receiver to a single TV monitor. The switch appears well made, however, when I select the satellite receiver the sound cycles on and off unless I disconnect the cable to the game controller, which pretty much defeats the purpose of having to deal with cables when I want to use another device. Can't recommend this product for that reason.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1545955200000}
{"reviewTitle":"Cables aren't up to spec","reviewDescription":"The description says that these cables can do 4k@60Hz, but that's not the case for me. One of them works at 2560x1440, the second one manages 2048x1152, but any higher than that, and the picture drops out or has horrible noise, making the screen unusable. Other cables work fine for me in the same monitor and computer, just these don't. I'm disappointed, but I guess you get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1547251200000}
{"reviewTitle":"I though these were 3 feet.","reviewDescription":"I bought a 3 pack of em but it would seem that each cord is a foot long:\/I wanted the 3 feet ones not the foot ones.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651363200000}
{"reviewTitle":"Broken after 6 months","reviewDescription":"I haven't had this cord for a year and it's already going bad. Bought it for my Roku and initially I thought it was pretty good. The picture and sound quality were pretty good, about what you would expect from a cheap cord. 6 months later, however, my signal started fuzzing and then completely cut out. I switched cords, no issues. So I know that the cable has gone bad. I guess the moral is that I should have bought the protection package. If I would have done that, they would have replaced it. You get what you pay for I suppose.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1493164800000}
{"reviewTitle":"Do Not Use With Apple 4K TV!","reviewDescription":"Nothing but flickering and blackout problems.  Not just me but a huge Apple forum thread on this.  The answer is the Belkin cable for the 4K Apple TV.  Yeah, $40, just do it.  I tried all sorts of ways to avoid that and wasted a lot of time for nothing, as have many others.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580601600000}
{"reviewTitle":"Purchased a Samsung UM8000 4K TV along with these cords ...","reviewDescription":"Purchased a Samsung UM8000 4K TV along with these cords and an Apple TV 4K. I cannot get 4K signal on the Apple TV with these cables. Constant flickering and then the Apple TV 4K downgrades to 1080p 25GHz or whatever loser resolution it can handle with my TV. Still came in handy for other devices but watching 4K on both new devices is what I was looking forward to upon ordering these cables. Bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1522800000000}
{"reviewTitle":"Dies quickly","reviewDescription":"I've had a pair of these HDMI cable for 5 months. Both are now dead. Basically, the picture and\/or sound consistently cuts out every 5-10 minutes for 2-3 seconds at a time. Just annoying enough to require replacement. I always treat cables great, never bend corners, etc.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622505600000}
{"reviewTitle":"Started Failing After a Year","reviewDescription":"Cable worked as expected for a while, delivering 4k content from my streaming device to my TV.  However it began showing snowy random pixels and would drop sound or cut out image and sound entirely from time to time only a year after I bought it.  Would not buy again, though it seems that's what Amazon wants me to do.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1560729600000}
{"reviewTitle":"Does not work with LG's OLED Ultra Deep Color setting","reviewDescription":"Bought the 10' cable to use between my PS4 Pro and LG's B7A OLED TV. When enabling the \"Ultra Deep Color\" setting in the menu, the screen goes black and won't display anything. Switched to an old 3' Amazon basic cable I had laying around and it worked fine. Not sure if it's a problem with the 10' version or what, but I'm a bit disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1543190400000}
{"reviewTitle":"6ft hdmi cables","reviewDescription":"did what i needed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"good quality","reviewDescription":"good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Works amazingly.","reviewDescription":"This works very well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Projector","reviewDescription":"Got for my classroom projector, this has saved me as my projector didn't come with one. This now makes it so I can move it anywhere in my portable. I love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Works as expected","reviewDescription":"Good basic cable. nothing else to say. i got 3So Ill just give away the other 2","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Review","reviewDescription":"Fast service, very happy with item.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Great addition to my cable","reviewDescription":"Great addition my cable  monitor","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"End of the line for overpriced HDMI cables","reviewDescription":"THIS.... Is Amazon basics  HDMI cable... and I can say that it is the best quick option for a nice HDMI cable at any length you could need!Let me clear the air on some HDMI misconceptions real quick - HDMI cables have nothing to do with whatever version of HDMI your tv has be it HDMI 1.4 , 2.0 , 2.1 or 2.2 as that is the PHYSICAL port on the tv, soundbar, GPU or what have you - the cable is merely the transporter from one thing to the other and either work or doesn't. There is no need for a higher 'grade' of cable as there is nothing you can do to the cable to make it transmit data better. I am sure that Bestbuy would love to sell you on 1000 reasons their $150 cable makes your colors better, but that is all marketing. This is exactly like charging your phone, the cable doesn't charge your phone faster as it is all in the block plugged into the wall - this is the same principle as the cable is merely passing the data.The non-braided cable and endpiece are really well-constructed out of generic rubber-ish material, they are ever so slightly stiff, but are otherwise perfect for any need you could have! There is no issue slotting them next to each other either as the head of the plug maintains a slim profile.I recommend this HDMI cable to anyone in need of one! The price is unbeatable for an HDMI cable, and you will be wasting your money on anything more expensive as this is about as good as it gets(unless you HAVE TO HAVE a braided cable). Once again another reason to have high expectations from an amazon brand as this is another example of a great Amazon Essentials product!REMEMBER!! Your cable is only as good as your HDMI port, so this cable can do 1080p, 4k and more!","isVerified":true,"ratingScore":5,"reviewReaction":"60 people found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"great item works well","reviewDescription":"great value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Good cables","reviewDescription":"Very reliable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Good cord","reviewDescription":"Quality hdmi cord for lower price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good buy","reviewDescription":"Cables work great no issues for my outdoor speakers or my outdoor TV. Also used on a new kitchen TV and sound bar.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Work?","reviewDescription":"Cable length good,plugs goodFabric cable covering very flexible, good value couple years supply in 1 bag","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Good Product Good Service","reviewDescription":"We've purchased a number of these cables without issue.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"A+","reviewDescription":"Worked fine for my need","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good product gets the job done.","reviewDescription":"My old HDMI cord decided it's too old and doesn't want to work so I purchased some off of Amazon. They came quick and they work! Quality is good!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Great deal","reviewDescription":"This is a great deal on a good length for an HDMI. I need these for everything and this one just made one of my favorites. I used it to connect my second monitor to my computer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Nice cord","reviewDescription":"Nice cord that got my TV back up and running. Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Great HDMI cable","reviewDescription":"Great HDMI cable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Good","reviewDescription":"This product serves its purpose as needed. Good buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"HDMI Cable","reviewDescription":"Functions very well Good quality very easy to install😎","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"It works","reviewDescription":"Being a long cable it is quite thick but it works well. You may need to reinforce the cable at the end as it is stiff and can unplug easily if the cable is pulled on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Great","reviewDescription":"Perfect length easy to use!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Good cable","reviewDescription":"Does what it was expected to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Cords work great","reviewDescription":"My son is so excited. He hooked his computer up to the TV and plays games.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"I’m happy","reviewDescription":"Its works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Worked great","reviewDescription":"They did the job requested","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Perfect for the job","reviewDescription":"Great product dependable and reliable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"It's four HDMI cables that work.","reviewDescription":"This was a good price and it works fine. I've got three others in case I need another cable. Good deal.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"It does the job!!","reviewDescription":"I purchased this product to hook up a monitor to my work laptop and since then, it's been a game changer. I'm able to work at a faster pace using the monitor instead of my laptop!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Insufficient info on description","reviewDescription":"It cannot do 4K 60fps HDR. I was hoping this wire would eliminate audio drop outs with my 10 year old wire, but this wire can even send a signal of that quality.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Too Fat 25 FT Cable","reviewDescription":"I got the 25Ft Cable and it was a great deal for the price paid, but the cable to too bulky to be used for a under the carpet cabling. It shows up like a lump on the carpet and not useful as a concealable cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684368000000}
{"reviewTitle":"10ft cable glitches out","reviewDescription":"For a long time, I thought my TV had issues with HDMI inputs. My screen would go black for a few seconds every so often while the audio would continue playing. I didn't think it could be the HDMI cable - after all, AmazonBasics is a trusted brand and all modern HDMI cables should be able to handle 4K HDR, and the audio wasn't cutting out. But eventually I replaced the cable with the other one from the 2-pack of 10ft cables I had bought. And just like that my glitches stopped happening.Since one cable works but the other glitches out, I'm going to speculate the manufacturing quality is not consistent. Even though the second cable seems okay, I'm replacing it with a certified premium HDMI cable - both MonoPrice and CableMatters have ones that are not much more expensive than this one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1559520000000}
{"reviewTitle":"Did not work with my 4K HDR TV and player","reviewDescription":"I have a Vizio M65-E0 4K HDR TV and an LG UP970 UHD Blu-Ray player, which worked fine with other HDMI cables I had. I bought this AmazonBasics cable (in 10ft length) to replace the existing cable, and when I connected the equipment (the player connected directly to the TV, not going through a receiver) and tried to play a disc I got no picture whatsoever... totally black screen. I then swapped back in the old cable, and it worked perfectly.I have no idea what the cause is... whether these cables are incapable of handling HDR datastreams, or there was some incompatibility with one of the components... but one way or another, this cable did not work at all where another cable worked fine.(Giving it two stars because cable build quality seems good and it may work just fine for other uses... just not for mine.)","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1515542400000}
{"reviewTitle":"Worked flawlessly for two days, then started to deteriorate.","reviewDescription":"My computer, which is hooked up to a tv started having green lines streak across the screen off and on. this got progressively worse until it would happen every few minutes. I then amped down the resolution to 2160px1440p and I saw better results, however even that didn't last long, as the green lines started to appear again. I know this is not the TV because the lines only appeared when hdmi was plugged in and casting onto the TV screen. Got another hdmi cord that can supposedly do 8k, so that would be my recommendation to anyone looking for a cord that can do 4k, shop around and find a better one. Don't trust this cord because it says Amazon Basics.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1591401600000}
{"reviewTitle":"You get what you pay for.","reviewDescription":"Began having issues with the cord about 3 months after purchase. Using it to connect a second monitor to my laptop. My laptop remains stationary so I do not plug\/unplug the cable often. While having multiple screens open, certain portions of my laptop screen will freeze and make it impossible to continue working. I would restart my computer every time. I thought for a long time it was my monitor or my computer malfunctioning. Nope, I learned its the $7 cable. All you have to do is unplug and plug it back in. However, I now have to do this multiple times a day. Would not recommend this cable, especially if you plan to use it with items that are difficult to plug\/unplug often.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1588032000000}
{"reviewTitle":"MASSIVE in diameter. Very rigid.","reviewDescription":"Be advised that this is a seriously industrial grade wire, which makes it very heavy and difficult to bend. Moreover, one need to consider the potential of damaging the socket that it plugs into due to its excessive weight. I have no idea why they made it, so large, but take that into consideration before you purchase it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671321600000}
{"reviewTitle":"Depends on your setup and TV resolution...","reviewDescription":"We recently purchased a LG OLED UHD TV and Yamaha sound bar for our living room.  Knowing that HDMI cables are not created equal, we decided to try this product since it was less expensive than other 4K cables.  After 2 months or so, the conclusion is that this HDMI cable can't handle the load.  We sometimes (perhaps 4 times an hour) have a screen and sound freeze on the TV.  I had a similar problem with another product on my LG OLED in my basement home theater.  The solution was -- Belkin Ultra HD High Speed HDMI Cable, Optimal Viewing for Apple TV and Apple TV 4K, Dolby Vision HDR.  I purchased another to solve the latest problem.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1601769600000}
{"reviewTitle":"Works fine if you only need 3'.","reviewDescription":"I've bought some of these at 3', 10', and two at 25'. Only the 3' one has worked. I recently bought a 4K TV and needed a 25' cable to run between my PC and TV. It didn't work so I got another figuring it was a bad cable but the replacement didn't work either. In both cases the signal dropped out constantly and I could not run 4K content at 60hz. Got a cable from Monoprice and it has worked great. It was a bit pricier than these but I'll gladly pay for a product that does what it claims to. The 3' one I got has been fine, but I just tried to use the 10' one for an NES Classic and it too doesn't work. The few times I get a signal it's either audio or video and it drops out frequently.Overall I'm really disappointed and won't be buying anymore Amazon branded cables.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1479081600000}
{"reviewTitle":"Doesn't appear to support Dolby Vision","reviewDescription":"I know the product doesn't advertise that it supports Dolby Vision, but so many reviewers here do.I own brand new Onkyo TX-RZ620, Apple 4K tv, and Vizio PQ65-F1 which all support Dolby Vision.  When running the test on the Apple TV for Dolby Vision, it fails and Apple TV indicates my cables don't support Dolby Vision.  I checked watching directly from my SmartTV function of the Vizio and it was obvious the visual difference while watching Stranger Things on Netflix 4k HDR.  There was so much more detail in the dark scenes when watching Dolby Vision via Smartcast on Vizio.  I'm leaving open the possibility this is operator error but I'll be purchasing different cords that are certified to work with Dolby Vision and see how that goes.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1543622400000}
{"reviewTitle":"Do not pass HDR\/Dolby Vision","reviewDescription":"I ordered these because I was recently got a new receiver which was 4K and I knew I was going to be getting a new TV soon.They worked fine with 1080p but once I got my new TV they would only push 4K HDR for a few days and then I would get a flashing image. I hooked up directly to Tv to confirm there wasn’t a handshaking issue between my Apple TV 4K, Denon Rx, and my TCL tv. Video would pass for a day or two and then would start flashing again.I swapped these out for a another cable and have no problems now.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1614211200000}
{"reviewTitle":"One worked the other not at all","reviewDescription":"Went to use the 2nd one and it is DOA. Way past the return date as I did not need it till now. Took a chance and lost. Will steer away from Amazon Basic electronic devices...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Don't buy Amazon brand","reviewDescription":"Very poor quality.  I regret basing my decision on other reviews as they were inaccurate. The connection into brand new Samsung TV is sloppy.  The picture is not as \"spectacular \" as with the previous \"Twisted \" cables.  There is a stutter in the picture with these cables.I reverted to previous cables and picture is much better with NO \"scene stutter.I would like to return them but like many other Amazon customers, i have been threatened to have my membership cancelled if I return anymore purchasesUpdate 2-2-16:  Thinking I wanted to give the cable a second try, because its hard to believe a cable could negatively affect a picture I hooked it up to another HD TV in the house. Surprisingly the picture was duller much like when I used it on my UHD TV but there was noticeable \"judder\" in the picture. Moving the cable actually caused a change in affect. WOW.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1454025600000}
{"reviewTitle":"Bad HDMI Cables","reviewDescription":"Bought 3. Only two worked right out the box. One wasn't even 4K HDR compliant. Know this because when I used another HDMI from the 3, the signal showed up in 4K HDR. But then that HDMI was giving me issues. Constant flickering, signal would go in and out. Tested these HDMI cables with a PS4 Pro, XBOX One X, and a 4K capable PC running a GTX1080ti.  The last and 3rd HDMI worked great. No flickering, no signal cutting out on any of the 3 4K HDR capable devices. A week passed by, and you guessed it, flickering, signal cutting in and out. I ended up returning all three cables. Also did the test's with HDR turned off. I must have just received a bad batch of HDMi cables.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1551398400000}
{"reviewTitle":"Video and Audio cut out often","reviewDescription":"I bought this cable to connect my laptop to my TV (not a smart TV) to watch Netflix. First time I plugged it in, the audio would cut out for a half a second, and this would happen a few times every minute. Then, I noticed the screen would flash white and freeze on whatever was playing from my computer for a half a second as well. I switched computers to see if the HDMI port was a problem. Then I used this with my friend's TV to see if my TV's was a problem. The same things kept happening, so it is definitely the cable. DON'T BUY! WASTE OF MONEY!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1627344000000}
{"reviewTitle":"Cable","reviewDescription":"They were fine but too short for. The connection.  I had to swap out other cables.  Pain in the toosh.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"100% failure","reviewDescription":"I have purchased multiple of theses with 100% failure! these are the worst hdmi cables they make, DO NOT BUY","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Using this caused HDCP ERROR","reviewDescription":"I purchased the Amazon Basics High-Speed HDMI cable to get a reasonably priced cable, but it was a failure. I connected my Apple TV 4K to my HDMI port of my monitor. I did not work. A HDCP error popped on the screen. So I used an old Radio Shack cable and it worked fine.  FYI… HDCP is a digital copyright protection function. Maybe LTT’s review of this brand was too nice.  Don’t waste your time with this.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1663372800000}
{"reviewTitle":"Audio Doesn't Work","reviewDescription":"Although the picture quality was good, the audio did not work. There was no audio.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Video blanks out constantly with HDCP Warnings","reviewDescription":"These cables worked just long enough to where I can't return them now. Now all three of them constantly blank out my TV every 5-10 minutes and cause HDCP errors. I have no issues with any of my other cables. There's literally no reason these should not have a 3 year warranty on them. There's no point in an exchange, because if all 3 of them quit working, the next batch I get won't work either.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"Super thick","reviewDescription":"This cord is very thick, which probably makes it more durable. The problem is that it's super heavy and I'm afraid its going to put undue pressure on the connecting port and eventually require repair of my tv or computer. It has worked great so far but I would advise the buyer to add supports at both connections.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676160000000}
{"reviewTitle":"Not always working","reviewDescription":"Went to Best Buy with TV to see what was going on. They tested TV with their own cable TV worked fine. They gave me the cable that they used said to use it and if the TV disconnects again to photo or video it.It hasn't happened anymore over a month ago. I would have to unplug and replug the Amazon cable repeatedly every time I turned the TV back on. Oh well maybe Sony and Amazon cables don't like each other. Used it on a Samsung and no issues. All I can say Sony owners pay attention.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1656633600000}
{"reviewTitle":"Good, but could  be longer","reviewDescription":"Did not notice that it was too short. I would have bought longer one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691539200000}
{"reviewTitle":"Buyer Beware: Does not work for 4K on Xbox and AppleTV","reviewDescription":"I have been using the 10 feet version to connect to my Denon receiver, and I was noticing some weird flickers, especially with Amazon Fire TV in 4K. AppleTV 4K was more forgiving, but most of the time was not passing HDR. Moment of truth came when I plugged the Xbox One S, NO IMAGE at all. Using the Xbox supplied cable, I saw that Xbox and TV were working fine, and narrowed down the issue to that very Amazon cable, which I replaced for roughly the same price with that one:Amazon cables smaller than 10 feet might work, but I would not take the chance if you want to use 4K resolutions.First picture shows the Xbox diagnostic with the Amazon cable, and second picture with KabelDirekt cable, nothing else changed...Pretty clear evidence that this cable does not deserve the label High Speed...","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1531353600000}
{"reviewTitle":"Wasn’t compatible with my iPhone","reviewDescription":"I didn’t like the device. It said it was compatible with iPhone and it didn’t work with my phone at all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683072000000}
{"reviewTitle":"You might have to play with the cable to get the picture to pop up","reviewDescription":"I only gave it three stars because on occasion the outlet that I plug into on my television - the cable is kind of thick and heavy and it doesn’t hold 100% solid in the outlet - in the HDMI outlet on my TV - and on occasion I don’t get the picture. But 98% of the time I do. it really isn’t a problem, but every once in a great while I have to play a little bit with the Connection to get the picture to pop up - typically it’s only when I actually connect the cable that I have the problem. once I get it connected and get the picture there isn’t any problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615420800000}
{"reviewTitle":"Great (but really wish they lasted longer)","reviewDescription":"I know there is no real meaningful difference in picture\/audio quality among all decent HDMI cables; however, I am a little disappointed at the durability of these cables. I absolutely love them when they worked, and the price cannot be beat. However, I wish I could get one to last more than 3-4 months. I bought this in February and it just stopped working.To be fair: I use my HDMI from my laptop to TV and watch movies\/TV quite frequently. I also switch between my fiance's and my computer all the time. That is, I am very frequently plugging and unplugging these cords, and I have them plugged into some laptop and computer probably 12 hours a day, but I wish they could make them last longer.Another to be fair: I have never had an HDMI cable last much longer.So, all things considered, it is a great HDMI cable, especially for the price, but if you are a Netflix addict, it might not last very long","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1497744000000}
{"reviewTitle":"Fantastic when it's working...","reviewDescription":"Well, when it works it's the best thing ever! 6 months ago I had trouble with the 5G channel dropping out every couple hours, then finally there was a firmware update and it fixed it! Wow! It worked fantastic for a couple months. Then there was a new firmware update, I installed it just 'cause I like to keep it up to date, boy do I regret updating it! The current version, reboots 1-2 times a day! All by itself for no reason. So now I have to just wait for it to reboot. It seems to know when I'm using it too 'cause that's the time when it reboots. Tech support seemed uninterested in helping me so I just deal with it... If I could go back to the last firmware, I'd be happy. But when I try it just boots back up with the latest version. I keep hoping they will realize their error with a new fw version but it hasn't happened yet. I'm just too tired of fighting with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1476316800000}
{"reviewTitle":"packing","reviewDescription":"looks not new","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"It’s a MASSIVE cable!!!","reviewDescription":"They should provide a better description when they advertise this cable. When I ordered it, I had no idea how Thick, Heavy(for what I’m doing!!!) and Long it was!It’s probably a great buy. (I’m sure I’ll find another use for it) But, for what I need it for, (“Lightweight Communication” between Desktop Devices, (Computers, T.V. screens, Cell Phones, etc.,)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668038400000}
{"reviewTitle":"Works","reviewDescription":"Works as described no complaints so use it","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Quality Cables (pretty thick)","reviewDescription":"I got these cables for an HDMI switch, and they are perfect for my office and security system.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Amazon Basics HDMI Cable, 18Gbps High-Speed, 4K","reviewDescription":"Like this item. I would recommend and would purchase again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Despite its plainness it will display 4k60","reviewDescription":"Short review:-Took cables out of box, got them to work with an LG 4k60 TV (55UF6450) plugged into an NVIDIA GTX 960 video card. Linux Mint ran 4k60 display (3840x2160@60Hz) with no issues.Long review:-TIL an Intel NUC7i5BNH miniPC will NOT run 4k60 out of it's HDMI port, the max it will do is 4k24. Only the USB-C port will deliver 4k60 with no issues, and I used this cable (https:\/\/www.amazon.com\/gp\/product\/B07RM1KGCT\/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1).-Both TVs used were a TCL 43\" Roku TV with 4k60 display and an LG 55\" \"smartTV (runs WebOS so claim is dubious)\" The TCL probably runs HDMI standard 2.0a\/2.1, the LG came out a year after HDMI 2.0 standards were adopted.-I've only used the cable for one day, will do some gaming via Steam and possibly update this review if I run into problems.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"Cool Tool","reviewDescription":"Cool Tool","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"My fault...had to return","reviewDescription":"I ordered the wrong length so had to return.  It did look like good quality tho.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"I liked it","reviewDescription":"The product was good depending on the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Reasonable quality","reviewDescription":"Reasonable for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"I'm told it worked fine.","reviewDescription":"My son requested this item and I bought it for him.  He says it works fine, and the price was good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Can be purchased for cheaper price","reviewDescription":"Amazon Basics 3-Pack HDMI Cable, 18Gbps High-Speed, 4K@60Hz, 2160p, Ethernet Ready - Arrived as advertised.  The quality of manufacture is acceptable and does the job it was designed to do.  I notice no interference with the picture.  Similar cables may be found now for a cheaper price; however, these cables are not a bad buy.  Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"It matters that you get a reliable hdmi cable","reviewDescription":"This cable is durable, high speed, and won't cause lagging or glitches. Subpar hdmi cables can make your cable, gaming, and internet cut out so get a good one like this","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Good","reviewDescription":"I didn’t really get to try it cause the computer was broken in some way but it’s working on another","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Great value pack","reviewDescription":"I've used these with several different PC monitors and TV brands. All working well. I will buy them again.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"speed and service","reviewDescription":"help with computer","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Yes, I'm old and technology is not my thing.","reviewDescription":"So what do you know? I plug the cord into the smart TV and into my laptop and darn if it didn't just load on it's own and start projecting\/streaming. Sometimes I want to watch a web series or my local HOA meeting (through Zoom) on my TV and I was having difficulty making it work. The last thing I want to do is attend an HOA meeting in person. I was having trouble making the TV an internet browser. Probably because my TV is more than 10 minutes old. This little cord (HDMI and HDMI on both ends) worked great. Painless. Next time, I would get a longer cord so I don't have to get up from the couch to mess with the laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Works great, great value, don't get anything else.","reviewDescription":"Really, this cable is fine for 99% of people. There are a few other options for durability or if you want a higher level of HDMI, but this does the job without fuss.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Amazon Basica true to pattern with reasonable product at a reasonable price","reviewDescription":"Amazon Basics is not a brand known for frills, and none are found here. But what you do get is solid construction and the traits that matter: meets the spec and has gold-plated, secure connectors.One of the things that pisses me off about cable makers is they try to sell us all this marketing garbage about low-oxygen Vatican-blessed copper with left-spin neutrons or whatever it is audiofools decided matter this week. They slap on the fancy words then think that means they can charge us Blackrock-house-rental prices for a bit of copper in a bulky jacket and some oversize connectors.You know what *actually* matters when it comes to HDMI cables? Gold plating to avoid oxidized connectors, meeting the specification, and not being so bulky or heavy that physics defeats you. These do that, and have a price tag set by someone not out to rob you.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712793600000}
{"reviewTitle":"Thank you!","reviewDescription":"Recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"worked","reviewDescription":"tks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Bien","reviewDescription":"Muy bueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Works great","reviewDescription":"I use it quite often and currently no issues. Seems like a good quality cord","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Great","reviewDescription":"Great durable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Works exactly as advertised","reviewDescription":"Gets the job done. 25 ft and works as good as 4 ft.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Works as well as expensive brands.","reviewDescription":"Same as any other expensive cable. No reason to spend extra money, these work as well as any other cable","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Good cable. Only last a year tho","reviewDescription":"I use with an adapter on an older PC. Had to buy new set after 14 mos. Unsure if it's this cord or adapter tho.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Quality","reviewDescription":"Works great. Snug fit","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Phone plug in's","reviewDescription":"Long cords and fast charging I  would buy again I've had it for about 6 months and it works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Works exactly the way I hoped it would","reviewDescription":"Use it to transmit from laptop to TV. Works great. The really long cord allows me to sit far across a large room and still control the display. It's exactly what I wanted.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"HDMI Cable","reviewDescription":"Item was packaged well and arrived in a timely manner.  HDMI cable for connecting HDMI devices to a Samsung Smart TV.  Item works as advertised.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"It works great","reviewDescription":"I lost the hdmi cable that came with my Nintendo Switch so I bought this to replace it, and it works like a charm.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Great substitute!","reviewDescription":"I’m sure that if you buy a crazy nice cable you get some level of benefit that can’t be identified. I’ll take the challenge any day of the week. It’s my belief that all HDMI cables are created equal, and the differences are negligible.So what makes this cable better? They aren’t trying to rip you off by claiming that gold ends are making some kind of a better sound quality or video quality happen. These cables are all you need and won’t cost an arm and a leg.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"MUST BUY, 5 STARS","reviewDescription":"We just got a new Fire box and needed these cables for our satellite box as well. We purchased 2 of the 6 feets cable abd it made a big difference. The pics and resolution looked sharper and better.  It was amazing. I highly reccomend this as a purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Great for the money","reviewDescription":"I bought this to replace one I paid twice as much for at Walmart. That cable started failing on me, causing glitching between my laptop and the TV. I of course blamed the laptop, but after a while decided to buy a new HDMI cable.This one did the trick. No more glitching and half the price of Walmart. The Amazon basics stuff is generally solid and a good bargain.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Not all cables are the same.  Do your research.","reviewDescription":"Ok, here’s our setup: LG 65\" 4K OLED TV - TiVo Bolt -  Sony Blu-ray - Samsung SoundbarWhen we bought the TV, we initially bought cables we thought were good quality.  Actually I think we bought them because they were color-coded and we were fishing cables through the walls and that likely clouded our judgement.  Since then we’ve had intermittent “HDMI connection not permitted” errors for no reason, requiring a reset to clear.  We also had picture dropouts any time a static electricity charge was grounded anywhere in the room.  Turning on the gas fireplace would cause a dropout.  Electrical storms in the area would cause a dropout.  We decided to isolate the entire setup with a UPS, which helped quite a bit, but never quite solved the HDMI error.  Research indicated the problem might be the cables and further research indicated the Amazon Basics cables tested well and were highly recommended.It’s the cables, dummy.  The Amazon Basics cables cleared up all the problems.  Wish I had done this sooner.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Worked Well To Connect To Projector","reviewDescription":"I needed a cable that I could route along the perimeter of the room to connect to a projector (versus cutting yet another hole in the floor).  This worked very well and I've had no problems with it for over 4 years.  I even have it hooked up to an automatic hdmi switcher hub for a speaker setup and it's functioned fine with that.  Solid cable at a decent price.  I've used quite a few Amazon Basics HDMI cables over the years and never had any problems with them regardless if it was for a tv or monitor setup.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"No problems here!","reviewDescription":"This product has been great, came in fine and is working perfectly!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Does what it’s supposed to","reviewDescription":"Does its job.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Works just fine","reviewDescription":"It's a basic HDMI cable, what more is there to say. Priced well and it works as it should. No complaints.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"very good","reviewDescription":"very good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Excelente","reviewDescription":"Funcional","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Doesn’t last","reviewDescription":"Bought in 2021 and it just died today in 2023. Haven’t moved it since plugging it in the first time. Just weird that it’d just stop working one day…was fine until then.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Would Not Work With My Shield TV Streaming Device","reviewDescription":"I was excited by the reviews on this cable and seen it looked like a good quality cable. I was soon disappointed. First, I didn't pay attention and accidentally bought the 25 ft in stead of the 6 ft, so more cable then i needed, which was my fault. I had a big problem with it. When i hooked it to my Shield TV streaming device i could not get it to work. Just a black screen. A few times i got the home screen for about a minute and then it blacked out again. I even tried different ports on my OLED TV just in case but still got the same black screen. I switched out the monster cable from my JBL soundbar to the Shield TV  and it worked perfectly. I switched the Amazon cable to my sound bar and it worked just fine. I can't figure out why it would work for the soundbar and not the Shield TV. Does anyone have any ideas? The Shield TV is 4k so it just doesn't make any sense why it wouldn't not work.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1595030400000}
{"reviewTitle":"Failed almost 3 years to the date of purchase","reviewDescription":"Never had one fail until yesterday. It took me a while to figure out it was the cable and not my receiver or tv and devices. Glad it was simple and just a cable.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"Randomly stopped working.","reviewDescription":"Good chord but barely lasted 1 year","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Hdmi Cable","reviewDescription":"I didn't know the cable was too short","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Not All It's Cracked Up to Be","reviewDescription":"I can't speak for all Amazon Basics HDMI cables, only the one I received. It was apparent the moment I plugged one end of the HDMI cable into the TV that the plug itself was undersized compared to other HDMI cables. It's not what you would call a firm, snug fit. Other cables offer a bit of resistance going in, just enough to demonstrate that this would be a secure connection. The cable I received does not give that feedback. It's in, it's working, but by no means is it a firm, snug, confident fit that one comes to expect in a quality HDMI cable. I'm disappointed and will likely be sending it back. For what it's worth other Amazon Basics products, such as their batteries, are great. But this cable is simply \"basic\". An apt description.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1622764800000}
{"reviewTitle":"Stopped picking up sound.","reviewDescription":"I had purchased this product back in 2018.  Originally, it was okay to use when I'm conducting training.  I need to adjust it to be really close to my mouth to pick up audio.  Since 2020, it has stopped working.  It no longer pick up any sound. I connected it to my home use PA system and my portable Behringer PPA500BT sound system.  In the past the product have worked fine with the same sound systems.  Anyone has any luck with this product lasting longer than 2 years?  Now, I'm back on the market searching for a better wireless headset for presentation and training.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650153600000}
{"reviewTitle":"Good While It Lasted","reviewDescription":"I bought this cable (25 Ft HDMI) nearly 4 years ago. Overall, the cable has done its job and carried the AV signal from my Xbox to my TV. This morning I fired up the XBox and didn't have any sound. I swapped cables and the sound was back, which indicates this cable has failed.I don't know if 4 years is considered a typical lifespan for this type of cable, but I can recall having cables from the 80s that lasted for decades, so it seems like a short lifespan. Unfortunately, I have this cable snaked from my receiver, through my walls, into the attic, and back down through the wall to the TV. Doing that again is not a happy proposition.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630022400000}
{"reviewTitle":"Wore out with one month of daily plug use","reviewDescription":"I purchased this cable to connect my laptop to an external monitor while creating a home workstation for the pandemic. Although it worked as advertised initially, I prefer to put my laptop away at the end of each day, which involves disconnecting the HDMI cable. Within a few weeks, I noticed that the display on my monitor was prone to strange color shifts and pixelation, which went away when I pinched or adjusted the HDMI plug at its connection to my laptop. Switching the orientation of the cable (so that I'm unplugging and replugging the other, less worn end of the cable, while leaving the delicate end in place on the monitor) helped initially, but the end with loose connections still sometimes leaves me with a weird display on the monitor. This cable should be perfectly adequate for someone who will plug it in and leave it that way (e.g. for a home entertainment system), but I wish I had spent an extra $5 for a more durable cable.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1595721600000}
{"reviewTitle":"May Not Fit","reviewDescription":"The rubber end of HDMI cable did not fit into the recessed area on my LG TV to  connect  a soundbar. Could be a LG design issue. Used it instead to plug into a HDMI switch box for something else. LG had limited HDMI connections on the model I have, so the switch box solved that issue !  Otherwise cable works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Nice Long Cord, But A Bit On The Thick Side","reviewDescription":"This cord is just the length I was looking for, but it's a bit too thick to run inside and through the projector mount I have. Looks more like a heavy duty, professional grade cable than your standard hdmi.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"Works well","reviewDescription":"I dont know if this is just me but I run into issues with 4k 4.2.2 on the Apple TV, where it flickers.Turning it to 4.2.0 works just as well, I cant tell the color difference, and I was about to return these until I saw that there was a fix. So yeah, if your tv is flickering at 4.2.2 just turn it to 4.2.0 and it should work beautifully.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1672617600000}
{"reviewTitle":"High-Quality Video Output with Amazon Basics HDMI Cable: 18 Gbps, 4K\/60Hz, 6ft, Black.","reviewDescription":"I recently bought the Amazon Basics High-Speed HDMI Cable, and I'm happy with how well it works. The cable supports 18 Gbps and 4K\/60Hz, giving my 4K TV a sharp and fluid image. The black color complements my other cables well, and the 6 feet length is ideal for my setup. Overall, I'm happy with my purchase and would advise others to use this HDMI cable.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1674518400000}
{"reviewTitle":"Hdmi cable","reviewDescription":"I brought this for a hdmi switch.has gold colored connectors and I think this improved my picture quality over my old hdmi cord.picture is more sharper.its not thick like a coaxial cable slim rubber casing which I like easier to hide the cable.got it for a good price on Amazon.tjinking about replacing all the hdmi cords for tv's in my hiuse to this one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"It Works great","reviewDescription":"First one they sent was a dud, but replace free of charge!  No issues with the second cord.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"As expected","reviewDescription":"Nothing of note to share. It is what it is and performs as expected.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Amazon Basics high-speed HDMI cable good for missing parts","reviewDescription":"This high-speed HDMI cable was not necessary for the new monitor that was ordered at the same time.  Most new products that are of a certain build quality will come with a decent HDMI cable for most uses. While this cable is higher speed, the monitor that it will be used for may not have a noticeable effect.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1672617600000}
{"reviewTitle":"Works as intended","reviewDescription":"HDMI connection works as is should, easy connection, good picture!  Its a touch bulkier that other brands, but the only tricky part was getting it through wall.  After that the price savings is well worth it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679011200000}
{"reviewTitle":"Works... pay attention to the plug in direction","reviewDescription":"It would be nice if there was the direction arrows on the cord. It's a one direction cord. When I plugged it in to my laptop to mini projector the first time nothing happened. So I switched the plug and then it works, which means it only communicates the HDMI feed in one direction so you have to pay attention to what is being plugged into what. If it doesn't work the first plug in, switch it around and it should work fine.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1654732800000}
{"reviewTitle":"Good for 6 feet","reviewDescription":"I had bought these to replace my older AmazonBasics high speed cables (10.2Gbps), however after purchasing a XBOX One X, those cables would not allow the XBOX to work in 4K. I had a similar issue with my Roku Ultra which would not work with the 4K 60fps setting. I decided to try these as they are rated at 18Gbps. While the first cable I tried worked flawlessly (no artifacts, flickering or other issues), the other two did not work as well. I tried Twisted Veins HDMI cables as well and had similar issues. I finally picked up Monoprice cables and haven't had any problems. Most people have good luck with these cables in shorter lengths (6ft or less), however at 10ft or longer I recommend looking for something else if you are using these on a 4K display. The two issues I saw with these cables at 4K 60fps were sparkles or repeating signal loss.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1586131200000}
{"reviewTitle":"Beware of picture quality in longer length cables","reviewDescription":"I purchased a 25' cable and at fist it seemed to work well enough.  Then during a certain movie with a dark scene, I could barely see the picture.  At first I thought it was because the room was too bright.  Later on during the same movie the screen would go blank for 1-2 seconds every 20-30 seconds.  I ejected the disc and wiped it off but the screen was still flashing.  I had never observed this before but began to suspect the cable.  So I moved the DVD player next to the TV with a shorter cable and the problem went away.  I replaced the 25' cable with an Audioquest Pearl cable (I know, expensive) and the dark scene I couldn't see before was perfectly clear and visible even in the bright room.When researching on-line, many articles say cables need to achieve a speed of 18 Gbps.  The Amazon basics cables claim a speed of \"up to\" 18 Gbps even for the 25' cable.  I don't think they're getting there.  The Audioquest cables say \"exceeds\" 18 Gbps.  I never would have guessed it but you can tell the difference and it's significant.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1559347200000}
{"reviewTitle":"Died after about 3 months","reviewDescription":"The cables were fine for roughly 3 months, and unfortunately the return window was only 1 month.  Signal to the external monitor stopped working for BOTH of the cables at essentially the same time.  I confirmed that the cables were at fault by swapping them both in and out against a third cable to determine that it was not the monitor or the laptop at fault.The issue was signal degradation, as far as I can tell.  Both cables were causing significant occurrence of vertical lines appearing, and an offset image on the monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1666224000000}
{"reviewTitle":"Bad roll of the dice on this HDMI cable","reviewDescription":"Unfortunately, I got unlucky with this 25ft cable. Can't hold a 4k 60z signal. Keeps blinking in and out when I hook up my PC to my UHDTV. It seems to work fine with any signal other than that though, so if you are in the market for a long 1080p cable (maybe even 4k 30hz?), this will do fine.Why do I know it's the cable? I tested my system with a shorter high speed hdmi cable I have, and my signal was perfect, even after hours of use. Of course, that meant I had to temporarily move my PC next to my TV to test, which is not a set up I want to keep, otherwise I wouldn't have bothered with a long cable such as this.I don't really blame Amazon that much though. The longer an hdmi cable is, the higher the risk of a bad one. If you really want to be a bit more sure when buying these types of cables, I would look into buying a certified one - a bit more expensive, but you lessen the chance of the cable not performing to what you expect, since those tend to be tested.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1490745600000}
{"reviewTitle":"could just be unlucky and I got a pi** poor made cable","reviewDescription":"5 months old, and already one cable has failed, surely it can't be the cable, they are new, so i checked everything else it could be, nope still no signal coming from cable box to the tv, so just for s**ts and giggles I tried another cable.... well look there, tv is receiving a signal \/ picture, tried the replaced cable on the dvd player, now no signal from dvd player,(yup, cable is bad) so i have 2 six foot cables and one 10 foot cable ... all Amazon Basics HDMI cables, 10 foot one was ordered to run thru the wall (project that I have not started yet) and now I won't be using the brand, could just be unlucky and I got a pi** poor made cable, but not gonna take the chance with using these on my wall project (running cables hidden) you get what you pay for, so that is my fault, Amazon does and has a lot of good things, maybe they should leave the HDMI cables to other manufacturers, I also replaced my Toslink with the Amazon brand.... fingers crossed that it doesn't die also","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1532649600000}
{"reviewTitle":"Warning! Do Not Use with AppleTV 4K Dolby Vision!","reviewDescription":"These cables do not consistently work with the Apple TV 4K with Dolby Vision enabled on my brand new 55\" LG OLED B8.  I bought three of them to replace an old Insignia HDMI cable that was not rated for HDMI 2.0.  The new cables needed to be routed through my entertainment system which is time consuming.  It wasn't until after I'd routed the cables that I discovered through a great deal of testing that only 1 of the 3 cables functioned with Dolby Vision enabled on my Apple TV 4K.  The funny part is the old Insignia cable that was not rated for Dolby Vision 4K worked flawlessly with the Apple TV 4K in Dolby Vision mode.  I should have never replaced the Insignia cable!  These cables seem fine for regular 4K and I'm leaving them in since it's too much hassle to replace them in the install and send them back.  It's unlikely that I'll need more than 1 Dolby Vision enabled device in the future, thankfully.  Don't buy if you're using an Apple TV 4K in Dolby Vision mode, some of them do work but it's not worth gambling on these.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1541203200000}
{"reviewTitle":"Worked for a little bit","reviewDescription":"It worked great when I first used it then started flickering the picture and then eventually never came back on","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Not HDMI 2.0 compliant (10 foot version)","reviewDescription":"I rearranged my desk and needed a slightly longer HDMI cable to go between a PC and a 2015 Samsung 4K TV.  Unfortunately, this cable failed to perform as advertised.  I tested several output modes from the PC, and these are the results.4K 60hz 4:4:4: Fail (Video corruption or \"No Signal\")4K 60hz 4:2:2: Fail4K 60hz 4:2:0: Success4K 59hz 4:4:4: Fail4K 50hz 4:4:4: Fail4K 30hz 4:4:4: SuccessHDMI 2.0 supports all of those modes.  The two that succeeded are supported by the older HDMI 1.4 standard.  Therefore, I can only conclude that this cable meets HDMI 1.4 requirements but not HDMI 2.0 requirements.To be fair, I got the same results with 4 out of 6 older cables I tried.  The 2 cables that worked (among them, an older style 6 foot AmazonBasics!) are both too short for my desk arrangement.Update (Sept 20, 2016): I found a 10 foot cable that works perfectly for 4K 60hz 4:4:4.","isVerified":true,"ratingScore":2,"reviewReaction":"19 people found this helpful","country":"United States","date":1473984000000}
{"reviewTitle":"Cable is unreliable","reviewDescription":"Im always having to adjust the cable with my PC, should have paid for a better one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Didn't Last","reviewDescription":"I had this cable (AmazonBasics High Speed HDMI Cable 6 ft.)  for just under a year. Didn't use it all that often. Wouldn't say I even averaged out to once a month. I started having trouble with it about a week before hitting the one-year mark. When I hook it up to my computer, the image that comes up on the t. v. is distorted (lots of static). I've tried it several times just to be sure.  I live alone. No one else uses it but me, and I take good care of my stuff. Very disappointed in this product.  I gave it two stars only for the little while out of which I got some use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644192000000}
{"reviewTitle":"You're not really saving money","reviewDescription":"Tried to save a little money and use this cable with my 144 hz Aorus monitor. From time to time I would see streaks flashing horizontally across the monitor. Did all the usual things; troubleshoot the monitor, make sure I had the most recent drivers for my GPU, tried tweeking the overclocking on the GPU, etc. It kept getting worse. Finally I unplugged the HDMI cable and plugged it back in and shazzam problem disappeared, mostly. It still comes back and reseating the cable makes it go away. Even the orientation of the cable as in it exits the GPU or the monitor a little to the right or left makes a difference. So I am replacing it with a higher quality cable. So I basically wasted the $7","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594684800000}
{"reviewTitle":"Wouldn't connect laptop to new 4K television.","reviewDescription":"Didn't work properly as description suggested. I attempted to connect a laptop to new Samsung 4K television and no \"source\" was recognized. I replaced this cable with a SecurOMax 15 foot cable and it works perfectly. I connected to the same locations on each device and in the same order. I had the exact same problem with a 3 foot version of this cable a few months ago and used a SecurOMax version as a successful replacement back then as well. Something else surprising was how thick this cable is compared to shorter ones and how stiff it is compared to the replacements I purchased. It would have been a challenge to make tight turns to hide the cable.  I'm giving 2 stars for great pricing and b\/c I've been extremely satisfied with all other AmazonBasics products.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1485907200000}
{"reviewTitle":"Cable Died After One Day","reviewDescription":"Edit: One of the 2 cables stopped working after the first day. It was fine the first time I played a movie, but the next day when I turned on the blu-ray player, it showed the blu-ray logo on screen for a second then went black and the signal cut out. No matter how many times I unplugged and plugged everything back in, it did the same thing. I switched over to the other cable and that one seems to be working.Original review:I bought a 2-pack and I've only used one so far but it works flawlessly connecting my Sony blu-ray player to my Samsung HDTV. The cables are sturdy, well built and easy to bend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1526515200000}
{"reviewTitle":"HDM","reviewDescription":"This HDM lasted less than a year. Next time buy a thicker one to make it worth it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Doesn't work when playing old pc games on windows 10","reviewDescription":"After a couple of months of usage, I just found out that these cables doesn't work when I'm playing old games. I have Windows 10 and in order to play older pc games, the display usually has to be switched to compatible mode (less color depth and less resolution), but I'm getting a black screen from these cables, and I couldn't even shut off my monitor due to this. I'll have to unplug and power cord and plug it back in to get the monitor to display normally again.I have tried both cables in the package and both have a same behavior. This is bad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1565049600000}
{"reviewTitle":"Quality has dropped since 3 years ago","reviewDescription":"I have two of these cables: one from December 2015 and one from now (December 2018). I had been using the old one to send sound from my TV to my receiver with HDMI ARC, and it was working perfectly. After I swapped the new one in for the old one, I started getting skips in the audio signal every couple of minutes. If I put the old cable back, the skips stop.The new cable has different connector molding and is noticeably thinner than the old one, so something has clearly changed in the production process. Maybe the new one has less shielding, leading to this issue?","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1543968000000}
{"reviewTitle":"the cable stopped working soon after use","reviewDescription":"the cable stopped working soon after use. I wrote the seller asking for a replacement and never heard back.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Can only get sound on one show at a time!","reviewDescription":"Been having an issue getting sound over my smart tv. I can only watch one Hulu series at a time. Try to watch another i get either no sound or only music and no voices. Getting angry!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677456000000}
{"reviewTitle":"Will not work for Xbox","reviewDescription":"I hooked it up to my Xbox 1 and it will not work. I swapped another HDMI cable from my PC to my Xbox and it worked fine. Im not sure if this is truly \"High-Speed\" as it claims, but regardless, it wouldnt work for the xbox.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663804800000}
{"reviewTitle":"I regret buying it","reviewDescription":"I wish I had bought a Belkin. After a few months it’s started randomly disconnecting from the TV. It was a pain to set it up. And now I have to move heavy furniture and re run new cables that work. So that I may watch a movie without losing connection 12 times.When reading good reviews. Keep in mind how quickly post purchase the review may have been posted. My issue happened a few months in.Update: it caused damage to my Apple TV. They are not compatible","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1584316800000}
{"reviewTitle":"Early failure \/ poor quality","reviewDescription":"I bought a three-pack of these ten months ago. All was well...for a while. I started getting strange error messages for one of my inputs. I replaced the cable and the problem was gone. Today, I tried using the Bluray player and got \"no signal.\"  Re-doing the connections didn't help. I replaced this cable and the player is working fine. I tried the Amazon cable on another input and got no signal. So two of the three cables have failed in less than a year. I guess they were not the bargain I thought they were when I bought them. Look elsewhere for better quality!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1530144000000}
{"reviewTitle":"Didn't work","reviewDescription":"I didn't get the chance to try this out. Hooked everything up and the cable was bad. I tried my other monitor with it and even my TV. I was just sent a bad cable. Returned and got another brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Years later I figured out this cable can't do Chroma 4:4:4 @4k 60Hz","reviewDescription":"You'll just see fuzz on the screen. You can set it to (at 4k) 30Hz 4:4:4 or 60Hz 4:2:2 so you can either have crisp text or fast refresh rates, not both. Replaced with a better cable and it just magically works! Left this review because no one has pointed this out yet.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"Does not work--faulty!","reviewDescription":"Right out of the box it was of no use.  We tried it on numerous devices and it is no good.  They're sending a replacement but I have doubts.  Would have preferred a credit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Awful Fit","reviewDescription":"The cord will not stay plugged in snuggly.  I was using it for my smart board at work but it wiggles so badly in the port that it continually disconnects. Unfortunately I got busy and didn't replace and return it so I'm stuck with the useless piece of junk","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Not \"HIGH SPEED\"","reviewDescription":"Not HDR compatible. Works fine for anything less than HDR.My Playstation Pro when outputting HDR with this cable does not work on the TV. Everything else such as 1080, yes. With My 4K LG tv.So as far as using it with anything else that are not HDR it's a good quality cable. BUT.... this is being advertised as a \"high speed\" cable.Those in here that are stating\/reviewing the product saying it works with PS4 Pro HDR are wrong. They most likely dont have the Console output settings to HDR or upscaling.I tested this with two cables. 1. The Cable the PS4 Pro comes with (HDMI).  2. And this Amazon Basic cable.The PS4 Cable works.Again, this Amazon Basic cable doesn't work for HDR. I bought this in 2016.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1560729600000}
{"reviewTitle":"fragile","reviewDescription":"Got it into place and 24 hours later it stopped working.  Had to get my son under my desk to look at it but somehow even tho it was working fine for over 24 hours, the connectors were so fragile that they bent just installing it.Terribly disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"WASTE OF $$","reviewDescription":"So it’s priced so low that I decided to purchase this “high speed” hdmi cable 3pack. Alas! Only 1 cable actually wors Not purchasing anything from “amazon basics” again! Branding suits it well— BASIC!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Spend a dollar or two more","reviewDescription":"I have bought a number of these, maybe 9 or so. They seem to always fail. I've had to rewire my entertainment system many times to root out which cable is dead, nearly always it's one of these. It has to do with the \"handshake\" that HDMI uses. I get an active signal, but no picture \/sound, or an intermittent flash off and on of the signal. I do not advocate buying expensive HDMI cables, just not these. Go to monoprice.com for cheap cables. Luckily, I keep a handful of HDMI on hand for rewiring, I'll never buy these again. Just spent 2 hours swapping cables tonight after 12 hours on my feet working retail... Amazon, get a better supplier, these are not good.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1542844800000}
{"reviewTitle":"Didn't work","reviewDescription":"This was a used HDMI cable. I should have known better. It transmits no signal at all, but the ones I already own transmitted perfectly on the exact same devices. Took to Kohls for return, then a UPS storefront, but they couldn't handle the return. Wound up paying more in gas trying to return this dead cable cost, so just gave up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676160000000}
{"reviewTitle":"Does not work with Amazon FIRE and Sharp TV","reviewDescription":"I'm a big fan of Amazon cables and batteries so the last thing I decided to try when my brand new Amazon Fire box didn't work out of the box was swap my brand new Amazon HDMI cable with a different brand and then \"wa-la\" it worked perfectly. I tried this cable with my laptop and a different (Samsung) TV which worked fine so the cable is not DOA, it's just something weird about the Fire box and my TV which doesn't seem to be an issue with my other cable. Reading other comments it seems like these cables sometimes have issues. Very disappointed that I can't rely on the Amazon brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1583280000000}
{"reviewTitle":"Stopped working in less than a month.","reviewDescription":"When I first got this, i was so excited! I thought it was worth the money and it worked perfectly. Unfortunately after less than a month, it just stopped working. I tried to see if it was just the device I was using but it wasn’t, I tried it with other devices... and still a no go. I didn’t even have it bent or anything. So I’m a bit confused as to why it stopped working...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1579824000000}
{"reviewTitle":"FOCUS Power Headphones-Poor Quality","reviewDescription":"I recently purchased the FOCUS Power headphones and am already experiencing poor quality sound and Bluetooth connectivity issues. It sometimes takes several attempts before the headphones connect to my iPhone and I can literally walk maybe 2 feet away from my phone and will lose the connection. In addition to the connectivity issue, the volume quality is poor in that it sometimes doesn’t increase\/decrease when adjusting it. Overall, very disappointed in the poor quality\/performance. I’m planning to replace the headphones very soon before they completely die on me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1538611200000}
{"reviewTitle":"Stopped working after the first year","reviewDescription":"I have to agree with several other reviewers. This cable (I bought 25') worked great for awhile, but after about a year it started working only intermittently. I wasted tons of time troubleshooting the problem, not knowing the cable was to blame. Finally I gave up and ordered a Power Bear HDMI cable. Problem solved instantly. Thus I cannot recommend this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614902400000}
{"reviewTitle":"You get what you pay for","reviewDescription":"I had consistent pictures issues and had to unplug and plug these back in a few times a week to get them to work. Switched to better cables and the problem went away","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"Unnecessarily Thick","reviewDescription":"Be aware that these cables are extremely thick, I mean ridiculously thick. If they were listed as \"Heavy Duty\" or something similar, that would be fine and I would have chosen something else.These were a nightmare trying to do any type of cable management. Ended up throwing them to the side and using normal gauge HDMI cables to run my dual computer monitors. They also put a lot of pressure on the HDMI port that you are plugging into.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1551484800000}
{"reviewTitle":"Great initially, but didn't last long","reviewDescription":"I bought this cable and then actually bought it again a few weeks later. Everything seemed okay, but then they both failed on different devices months later right about the same time. I had one connected to a TV and the other connected to a monitor and they both died out in the same week. You get what you pay for, I guess.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611619200000}
{"reviewTitle":"Will it last","reviewDescription":"The cable worked for a year and five months. One day it started showing a lot of static in the picture. At first I thought it was the Roku I was using.  I tried a Blu-ray player and had the same issue. I ended up ordering a fiber optic hdmi cable and that solved my problem. I don’t know if it’s worth the hassle of trying to get a replacement cable from amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1569196800000}
{"reviewTitle":"Doesn't work for two high-res displays","reviewDescription":"This cable will not allow me to extend displays across a 4K laptop screen and Dell 3840x1600 monitor. It will allow one or the other to be used (or both duplicated, which is useless). Other high-speed HDMI cables that I have will allow the displays to be extended, i.e. as soon as I connect a different cable I can view both screens as one desktop, so this is an issue with this cable specifically. If you need to drive roughly two 4K displays, don't buy this cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1522022400000}
{"reviewTitle":"Trash:  Only lasted 9 months","reviewDescription":"Buy this cable if you have a desire to buy another one in less than a year.  Minimal usage and no wear and tear, but second monitor started blinking and had red dots.  Had a 5 yr old HDMI cable at home that I plugged in and problem solved.  Don't waste your money on this or be fooled by the Amazon endorsement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1621900800000}
{"reviewTitle":"It just stops working","reviewDescription":"Everything is great until it just stops working. First one failed after about 4 months, the second one failed after about 5 months. Will definitely not buy this again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1658966400000}
{"reviewTitle":"Good","reviewDescription":"Works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Great replacement for PS4 Slim","reviewDescription":"After keeping my ps4 slim stored away I realized I was missing my HDMI cable and decided to order this. Turned out to be perfect and of better quality than the original HDMI cable that was included. Would recommend as a replacement.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Works as expected","reviewDescription":"Bought in an emergency because I needed a cable quickly. Quality is as to be expected. Would not hesitate to recommend this as a lower to middle end solution for cables. It is as flexible as most other cables. Cable gauge seems to be adequate for video feeds. Picture quality is fine. Not sure what to say about how this cable looks, but it looks like every other black HDMI cable with what I assume to be zinc plated ends out there on the market. So the appearance looks good enough. The length is good too. Installation was a breeze. Connector fit in to the HDMI port as it should.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Thick & stiff (in 25' length), but this one actually works!","reviewDescription":"After trying a couple of other cheap 25' HDMI cables with poor results (one failing to work at all, the other only at low resolutions like 480p), I looked for the thickest reasonably-priced cable I could find, using the HDMI connector as a scale reference in photos.  The body of this cable is about 4 times thicker than my others. It pushes perfect video & audio from my HTPC to a television in another room, even with an HDMI \"splitter\" (distribution amp) on the source end, and a 3-to-1 source switch on the receiving end, both of which weaken the signal somewhat.  I'm only using it at 1080p\/60Hz, though, the limit of that remote TV, which is less demanding than the specified 4k resolution.  Its thickness makes this cable more difficult to run, but at these lengths that's a necessary trade-off when pushing distance limits, just based on the physics of signal transmission. A thinner cable of equal performance would need to use fiber optics, or active in-line amplification, either of which will increase the cost, and add additional powered electronics that could fail in the future.The 25' version of this cable is marked 24AWG, meaning its individual wires inside are equal in thickness to those of a typical Cat5e or Cat6 cable.  I cut open & stripped my off-brand, non-working-even-at-480p 25' cable to compare, and estimate the width of its individual conductors (within one of the 4 twisted-pairs) to be 30 AWG at best, possibly even thinner.  (Larger AWG = American Wire Gauge numbers mean thinner wires... it's one of those weird upside-down scales).  Size matters!  Shorter cables in this listing do appear to be thinner, which is fine at those lengths, so long as you don't try to chain several of them together.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Works well. Solid cable.","reviewDescription":"Got this to connect my MacBook to an LG screen. Works well. Solid cable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Good Value","reviewDescription":"Used for cable tv connection. Works fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"HDMI Cable For Nintendo Switch","reviewDescription":"Great product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"price","reviewDescription":"Great item  great price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Good connection","reviewDescription":"Transmits great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Works like it should","reviewDescription":"Just a basic hdmi cable. No issues so far","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"6’ HDMI  cord .","reviewDescription":"Worked good . Should have ordered it longer .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Perfect","reviewDescription":"Perfect product. That is what I want. It successfully connects my laptop with my PC monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Best ever","reviewDescription":"I love the length because the cord does not hang out","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"GREAT Product! Amazon delivery SUCKS!!!","reviewDescription":"GREAT Product! Amazon delivery SUCKS!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great Price","reviewDescription":"Works as supposed to.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Good Value","reviewDescription":"Priced right by comparison to similar cables.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Product was exactly as described","reviewDescription":"No SurprisesNo IssuesNo Problems","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"work well.","reviewDescription":"i’ve had these hooked up for several months now and have no complaints.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Works great","reviewDescription":"Length is great. Had bought it because my cable broke for my Xbox.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Very poor quality cable","reviewDescription":"You can tell just by the look and feel that it is a cheap quality (Well I asked for it I guess!). One of the cables was faulty. I only needed 2 for connecting to desktop monitor, so didn't bother but I did waste half an hour figuring out why my monitor was flickering every few seconds. After switching the cable the issue was resolved.Note: The cables that do work out of the box, if they are not faulty they work well but in case, you need high quality cables, avoid this and spend a few bucks extra.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"No work","reviewDescription":"No working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"sucked not work correctly","reviewDescription":"sucked not work correctly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Not a Good Cable!","reviewDescription":"It lasted 6 months and then died. :(","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"There is DEFINITELY a need to buy more expensive HDMI cables (for 4k@60Hz)","reviewDescription":"Despite being advertised as supporting 4k @ 60Hz, connecting my new Intel 7th gen NUC computer (HDMI 2.0) to my LG OLED TV (HDMI 2.0) caused blank screen\/ audio dropouts every few seconds. This occurred for both the cables in the twin pack across all 4 TV HDMI input ports, suggesting a physical design shortcoming rather than an isolated quality problem.  Replacing this cable with the one that came with my PS4 Pro resolved the problem.In summary, works fine for connecting lower resolution\/lower refresh rate devices (computer 4k @ 30Hz or 1080p @ 60Hz), but doesn't cut it for ultra high bandwidth HDMI 2.0 connections. Comments such as Oliver T. \"And as the highest resolution any 4K TV currently on the market can produce is 3840 x 2160 at 30fps\" are inaccurate so watch out - this experience has demonstrated that there is indeed a need to buy more expensive HDMI cables if you want to run at 60fps (60Hz).Trying these ones next - hoping they perform better","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1491091200000}
{"reviewTitle":"Not Acceptable for 4k HDR\/Dolby Vision with a Reciever","reviewDescription":"So I always though that HDMI cables were all the same. I was wrong. Although these cables are marked high speed they did not work in my setup. I have a Vizio M65-E0 TV, Onkyo TX-NR575 Receiver, Apple TV 4k and Xbox One S. With these cables hooked up my Xbox One S would not recognize my TV as being 4k HDR  and the Apple TV 4k would not allow Dolby Vision. The receiver can pass HDR and Dolby Vision and my TV is capable of both as well. I also had issues displaying anything from the Xbox that was not 1080p such as DVDs etc. I was very frustrated and spent hours swapping settings and resetting all my gear. I finally decided to try some different cables. I purchased the Monoprice Certified cables also available on Amazon. Voila, everything was perfect. If you are looking to get 4k HDR or Dolby Vision out of your home theater setup passing through a receiver, I would recommend you steer clear of these cables and get the Monoprice Certified. They are only a few dollars more and much higher quality.","isVerified":true,"ratingScore":1,"reviewReaction":"83 people found this helpful","country":"United States","date":1520985600000}
{"reviewTitle":"This cable does not work with Roku Premere+\/Ultra and Samsung KS8000 in 4K HDR mode.","reviewDescription":"Bought 6ft version on Dec 2016 for my new Samsung 65 inch KS8000 (late 2016 model) and Roku Premere+.  This cable does not work in 4k HDR mode.  I kept getting HDCP purple screen error with Amazon and Google play apps on Roku.  After a lot of research on the Internet I found out if I disable HDR and use only 4k output mode on Roku, HDCP errors go away.  So HDR was causing HDCP negotiation to fail.  This is one workaround i discovered.  Then I tested an old HDMI cable i bought from Monoprice 8 years ago for the heck of it.  Turns out this old cable works reliably in 4k UHD HDR mode.  The old cable from Monoprice looks more like an old VGA cable with feritte cores on each ends of the cable.  So days of all generic high speed  hdmi cable being equal are over with 4k HDR.  People are discoving hard way that compatability issues are caused by HDMI cables with HDCP 2.2 and 4K HDR signalling.  Gone are the days when any generic hdmj cable just works.  This is probably a welcomed news for price gauging cable upsellers like Monster and best buy sales guys.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1482624000000}
{"reviewTitle":"I wasted about an hour trying to make the cable work ...","reviewDescription":"I ordered the two pack version to use them with a Samsung JS9000 48\" SUHD TV and a Mac Mini and a PC.  I wasted about an hour trying to make the cable work with a Nvidia 980Ti in native 4K resolution(3840 x 2160)\/60Hz\/RGB(4:4:4)\/Full Output dynamic range, but no matter what I tried, the TV would only display full resolution\/color at 30Hz.  Worse, setting inputs as HDR would detect no signal from the video card at all.On a whim, I tried a no name cable lying around that I thought I had purchased as a HDMI 2.0 compliant cable, and all of sudden I was able to set my resolution to full 4K\/60Hz\/RGB\/Full dynamic range, as can be seen in the included screenshot.  The resulting clarity with the HDMI 2.0 compliant cable was stunning.Since it's been more than 30 days (took so long to try these cable since my first shipment was damaged during transit, and had to return the first order), I can no longer return the cable, but for anyone considering using the cables with a 4K TV in its native resolution + HDR + 60 Hz + 4:4:4, I highly recommend staying away from this cable.","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1472515200000}
{"reviewTitle":"Worked great until it didn't.","reviewDescription":"Bought this to replace the power cord for my Dell laptop. Worked great for about 6 months until today. It's still lights up on the end but My laptop was not charging. Thought maybe it was the laptop port but it wouldn't charge my phone either.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Will not work for sound bar to smart tv","reviewDescription":"This will not work with my Samsung smart tv and Sony sound bar. The sound bar originally came with a small thin optic wire that wasn't long enough. I should be able to use an HDMI cord. But a message pops up on the TV that says to plug it into HDMI3 since it's arc also. But that's what port its plugged into!! And it won't work. Returning since this is the only reason I bought it. The TV is only a few weeks old so it can't be the TV.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Works great.","reviewDescription":"I needed to hook up a new computer to its monitor, worked just fine.  Recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Works for wqhd 3440×1440 @ 100hz","reviewDescription":"Monitor only supported hdmi 2 so there was no reason to overpay for a hdmi 2.1 cable. I can run 3440×1440 at 100hz without any issue. Video quality is good and no flickering","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Reliable Performance for Your Entertainment Needs!","reviewDescription":"4K Ultra HD Support (4\/5):The HDMI 2.0 cable supports 4K Ultra HD resolution, providing crystal-clear and vibrant visuals for your 4K-compatible devices. It delivers a high-quality viewing experience.High Refresh Rate (4\/5):With a 60Hz refresh rate, this cable is suitable for smooth and fluid motion in your video content, which is essential for gaming and fast-paced action sequences.High-Speed Data Transfer (4\/5):The cable boasts an 18 Gbps bandwidth, allowing for high-speed data transfer between devices. This ensures minimal lag and high-quality audio and video transmission.Wide Compatibility (4\/5):The Amazon Basics HDMI cable is compatible with a wide range of devices, including 4K TVs, gaming consoles, Blu-ray players, projectors, and more. It offers versatility in your entertainment setup.Durable Build (4\/5):The cable is built to last, with sturdy connectors and a durable outer casing that can withstand bending and twisting without compromising signal quality.Secure Connection (4\/5):The connectors are designed to provide a secure and reliable connection between your devices, preventing signal loss or interruption.Variety of Lengths (4\/5):This cable is available in various lengths, allowing you to choose the one that best suits your specific setup and requirements.Affordable Price (4\/5):Considering its performance and quality, the Amazon Basics HDMI cable offers good value for its price. It's an affordable solution for your high-definition connectivity needs.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Amazon Basics 2-Pack HDMI Cable","reviewDescription":"Good value for good cables","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Does the job!","reviewDescription":"We used this as a replacement we needed for the Switch dock to TV. This has done a great job at first plug in…cord length, picture and connection is fantastic still.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Basic hdmi cord","reviewDescription":"The AmazonBasics HDMI cord delivers reliable performance and durability at an affordable price. It supports Ethernet, 3D, 4K video, and Audio Return Channel (ARC), making it a versatile choice for various home entertainment setups. Its build quality is commendable for the price, offering a sturdy connector and a flexible, yet durable cable sheath. Ideal for users seeking a cost-effective solution without compromising on essential features and quality.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Great quality and easy to use","reviewDescription":"Used this cable to connect a somewhat older monitor to my desktop. Works as intended and is high quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Good length for club meetins.","reviewDescription":"Needed to connect a laptop on a desk to a monitor on the wall.  This was a good length.  Works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Works great","reviewDescription":"Works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"HDMI long wire","reviewDescription":"This HDMI long wire works very well long enough so I could have the other room and have the wire go through the walls to the TV perfect I would recommend this if you need a 50+ HDMI wire very thick","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Stopped working a little less than 1 year","reviewDescription":"I have several HDMI cables and this is the first to stop working within a year. This is also the newest HDMI cable I purchased and the only one that has stopped working. Will not be replacing with another Amazon basics product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"As thick as an outdoor extension chord and as stiff as a garden hose. Not usable with a laptop.","reviewDescription":"This cable is as described in the heading. I was shocked at how \"fat\" the cable is, and how stiff it is. I have numerous other HDMI cables of varying lengths, although none are this long, however all are of the same \"capacity\" and all are much thinner and more flexible. I had intended to use it between my laptop and HD TV so I can use the TV as a monitor, however it  is impossible to use with a laptop because it is way too \"heavy\" and stiff, and it is impossible to coil and stow behind the TV when not in use. There is nothing in the description which alerts you to the \"thickness\" of the cable so now I am somewhat apprehensive about purchasing a different \"brand\" because I don't want anything like this again. Although I don't need an ultra-thin cable, I assume that's the only way I can be assured that I will be getting something \"workable\".","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1528329600000}
{"reviewTitle":"Will Not Work For 4K Sources","reviewDescription":"I've tried pretty much every combination of source\/TV I have, but I continue to get no signal through these cables (I'm on my second set) when using any hardware that outputs a 4K signal.My 4K hardware consists of a Sony UHD Blu-Ray player, a Roku Ultra Box, and X-Box One S. When cables are attached to any of these devices and connected to EITHER a 4K television or a 1080P-only set, no signal is transmitted. When the cables are connected to a regular Blu-Ray player (both a Sony and LG) or a non-4K streaming box (WDTV Live), the signal passes through. It also passes through an old Acer Revo Windows PC. But 4K? Not on your life. My previously purchased cables from Monoprice work just fine with all the hardware mentioned above.Since I bought it for 4K use, it gets one-star. If you want it for 1080P stuff, grade it higher.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1562112000000}
{"reviewTitle":"Lasted 2 Months","reviewDescription":"This lasted all of 2 months. The picture started glitching in and out. I changed the HDMI cord and haven’t had a problem since.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"WiFi devices Showed No Inter-Connection with Wired Ethernet Receiver after Using These Cables","reviewDescription":"I Exchanged these cables for my \"non-ethernet\" HDMI cables attached to my LG OLED TV and Comcast Box, along with Apple TV, Samsung Blu-ray 4k player, and Xbox X. attached to my Yamaha AV Receiver.  I have only one ethernet cable attached to my AV receiver and these cables were advertised to extend to other devices without needing an ethernet cable on each one.  Well, I got only static on my Blu-ray player and my Apple TV which was working perfectly the night before the exchange suddenly stopped working no matter what I plugged into it (which may be a coincidence, but...who knows?).  And as for ethernet connectivity, well, the devices attached to my AV receiver (which is wired) still only recognized connection via my WiFi network.  In summary, the cables did nothing for network speed or connection, and in at least one case (the Samsung Player) would not even work as a typical HDMI cable.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1531180800000}
{"reviewTitle":"Does NOT support 4K HDR10.","reviewDescription":"After reading reviews here to confirm that these cables are 4K HDR10 capable, I ordered a set of three to run in the wall between various devices and a new LG 4K tv.  They work fine with regular HD devices, but connected to an Xbox watching 4K Netflix, they fail within a few seconds every time.  It'll show a few seconds of the video, flicker to static for a second, or show noise patterns, then go blank.  Switching back to the HDMI cable that came with the Xbox works flawlessly.  All three cables exhibit this problem, so this doesn't seem to be a one-off issue.The Xbox renders all its menus and other output at 4K all the time, but the only time the cables fail is when Netflix enables HDR10 (the tv shows a little HDR badge in the corner when this happens), so I'm assuming the incompatibility is with HDR10.","isVerified":true,"ratingScore":1,"reviewReaction":"162 people found this helpful","country":"United States","date":1503878400000}
{"reviewTitle":"I bought 2 of these and had the same problem ...","reviewDescription":"I bought 2 of these and had the same problem with both. You either get no picture or a very red striped or pixelated picture not clear enough to make-out or watch. It isn't enough of a connection to provide a signal so it goes in and out. We used one in our bedroom and kept having problems with the connection. We thought it was the Roku or the power supply and replaced both. We eventually quit using the Roku thinking it just wasn't going to work. We used the other in our game room to attach an extra gaming system to the TV. Apparently it has never worked - I just thought my kids preferred the other games. When I realized their's hadn't worked either I tried a cable from our cable box and both my Roku and their gaming system worked perfectly. Since they were both used on \"extra\" electronics, I didn't realize they weren't working in time to return them.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1492214400000}
{"reviewTitle":"Cable disconnects from monitor easily","reviewDescription":"This cable continues to disconnect from monitor even after a small vibration, which indicates it is not a tight fit. As a result the cable does not serve its purpose.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Won’t work for me","reviewDescription":"Tried to hook up between my phone and my monitor in my RV prime would have none of that","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"16.6% Success Rate, AVOID","reviewDescription":"I ordered a 3 pack of the AmazonBasics “High Speed” HDMI Cables, 10 ft. Upon receiving, I plugged in my Xbox One X with the new cable, but nothing displayed. After troubleshooting, I determined it was the cable. The cable would pass 1080p signal, but when changed to 4K from the Xbox One X, it would no longer display.Of the box of 3, 1 HDMI cable properly displayed the 4K HDR content. I called Amazon and they sent me out a replacement set of 3. When I tested these 3 cables, NONE of them worked.Of the 6 cables I received, ONLY ONE worked as advertised, the other 5 were all defective.I should note that I am an “IT guy” and know my way around electronics. From my experience, AmazonBasics should be avoided for High Speed HDMI purposes, unless you are ok with a 16.6% success rate.","isVerified":true,"ratingScore":1,"reviewReaction":"39 people found this helpful","country":"United States","date":1551052800000}
{"reviewTitle":"Beware of the Fine Print (False Advertisement)!!","reviewDescription":"I’ll start by stating that I LOVE AMAZON!!! However, I’m disappointed in this product. Amazon needs a spanking for this one! Amazon Basics describes this product as a “High-Speed 4K HDMI 10ft Cable.” Well, they got the attributes right, except for the part about 4K. All quality HDMI cables will have fine print written on their exteriors. This “fine print” usually lists all the cable’s specs, informing the consumer of what the product is and what it isn’t. This particular cable is no exception. Its fine print is VERY detailed and makes absolutely NO MENTION of 4K! It’s a high quality cable, but it isn’t 4K (it’s just a standard cable). If it matters to you (like me) that the cable be 4K, this isn’t your product! However, if 4K doesn’t matter to you, then I’d recommend it. In conclusion, If 4K quality matters, keep looking; this isn’t what you want!!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1652227200000}
{"reviewTitle":"Intermittent glitching","reviewDescription":"It worked okay for a few weeks until the screen started blacking out every few seconds. I went through the troubleshooting steps but nothing worked.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Burn out !!!!!","reviewDescription":"I got this product maybe a year ago for my gaming monitor don’t really use my pc and randomly I got on my pc and the cord was burn out the metal input was charred and I was wondering why my monitor wasn’t working or turning on mind you I have two monitors smh never getting this again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Stopped working after about 3 months.","reviewDescription":"Amazon Basics High-Speed HDMI Cable, 1.4B Male to Male, 18 Gbps, 4K\/60Hz, 15 Feet, White.Used for traveling presentations. Used periodically for a couple of months. and picture quality was good.  About 3 months old it stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Cable didn't work with basic monitor","reviewDescription":"Not all cables are created equal. I used this cable on a new Acer monitor which supports a native resolution of 1920x1080 @60hz. The best of would do was 800x600 @50hz. Once I changed cables to something else, problem solved. Unfortunately, I have to point the finger at the cable in this case. Bad cable, cable design not 100% too spec? I don't know, unfortunately I don't have time to process a return. I just need something that works.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Not compatible with AppleTV 4k running a 4K, 60Hz signal","reviewDescription":"Unfortunately, this cable does not function properly with the AppleTV 4k running at 4K, 60Hz with Dolby Vision connected to an LG C7P TV. Other cables from other manufacturers do work. Apple recommends the Belkin Ultra High Speed HDMI cable, which is not sold in lengths longer than 2 meters.Initially, this cable did pass the cable-check feature of the Apple TV, but then the picture would intermittently be lost while watching shows using various apps like Hulu and YouTube. The behavior exhibited when the signal was lost is similar to what you see when you use a cable that you know not to work (I know because that is where I started).  Substituting a shorter modern HDMI cable (one that shipped with the HTC Vive VR set) worked fine.I don't know whether any 10 feet cable will work using a 4k signal from the Apple TV. I have instead purchased Apple's recommended cable (2x the price for 1\/2 the length) and plan to mount the Apple TV behind the TV set. The AppleTV is pretty small - that will work.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1507161600000}
{"reviewTitle":"25 feet cable - No go for 4k 60hz 4:4:4 chroma during 02-10-2017.","reviewDescription":"25 foot cable- what a POS. Apparently they're 'under review' & not available at the moment or something to that effect.1st cable- No signal2nd cable (replacement)- No signal when connected in one direction. When swapped end-for-end, green dots all over the screen.Setup was a PC + 4K + Amazon basics latest version 25 foot cable. Bought it due to the good reviews, would recommend trying a different cable atm. I'm assuming there was a manufacturing defect or bad batc etc. The Best Buy Insignia 8' cable is working fine with the same setup, still looking for a longer cable. Seen recommendations for Monoprice, & KabelDirekt. Crapshoot.It may be adequate for 1080p, or lower quality resolutions, but the item is described as: \"4K Video at 60 Hz, 2160p, 48 bit\/px color depth) that supports bandwidth up to 18Gbps\" which is the reason for the 1 star review. I'd give it 0 if possible. If it met those specs it would be a good buy.tags- 25', 25 foot, 25 feet, 4k 60hz 4:4:4 chroma, 4k 60hz 444 chroma","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1486857600000}
{"reviewTitle":"HDMI cable","reviewDescription":"The picture was not clear and was not bright compared to the original HDMI cable that came with the LG 34” screen. I returned it for a refund the same day I received it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Cable went bad","reviewDescription":"Bought cable in 2020 and rarely used it in our finished basement. Recently started to use the basement and the TV would not connect to source. After trying several devices like Apple TV, DVD player and cable box, found out that the cable itself was bad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"These don't last","reviewDescription":"Purchased a bundle of 3 in early 2018. They look well made but do not seem to last. Two of them been plugged to a TV, Nintendo Switch and nVidia Shield TV. Both of the cables stopped displaying any signal after about 2 years.Pinpointing the issue the first time was frustrating, the one on the Switch failed first and a couple of hours were spent fiddling with the dock, the TV, the switch and a computer monitor to rule things out. The cable is pretty much the last thing you would expect to fail out of the blue. Once it failed with the Shield TV it was quicker to figure out the culprit after the previous experience.As for the third cable, it mostly sits in a drawer but it still works. At this point I would suggest getting something more robust and avoiding the potential time spent troubleshooting and replacing cables down the line.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1592092800000}
