{"reviewTitle":"If you just want a basic iPad for a great price, this is it","reviewDescription":"As my review title says - If you just want a basic iPad for a great price, this is it - while it lasts! Although the 9th gen iPad has an older design with a larger bezel and TouchID home button, it still works great as a basic tablet to do simple things. The most common activities - browsing the internet, checking email, chatting through Facetime, reading news, and playing basic arcade games - do not require you to have the latest, greatest, and more expensive iPads when this one can do it all without compromise or a reduction in experience.The fact that the current pricing is $80 under MSRP makes it a steal; at this price, I don't see why one would buy some inferior tablet from other brands when a genuine Apple iPad can be had for under $250! But of course, this price can only last so long, so if you want a basic but high-quality, fully functioning tablet, you can't go wrong here.","isVerified":true,"ratingScore":4,"reviewReaction":"67 people found this helpful","country":"United States","date":1704499200000}
{"reviewTitle":"Great Buy!!!","reviewDescription":"The only reason I didn’t give this 5 stars is because the shipping was pushed back a couple times and I actually got it later than expected. And in their defense the area it was shipped from had snow and ice so that was probably the culpritThis was a present for my 16 year old niece and she loves it. She can watch her shows and Facetime her friends, I honestly haven’t seen her without it since it came so all around great gift, great price…","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Great iPad for school kids","reviewDescription":"I purchase this iPad just as transient iPad while I recover my iPad Pro which I lost at airport security. It has a simpler functions than the pro but I was happy to download my data from the cloud and be solvent again. The iPad is very light and the screen is cheap and easily breakable which makes it an almost disposable iPad for kids unless you use an armoured cover to protect it. The price is just right.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Solid tablet","reviewDescription":"This iPad fills my needs. I surf the web, send and receive email, create and save documents, create calendar reminders, stream music... fairly basic usage. It does so fairly quickly and smoothly. Downloading Google apps made for easy transition from Android.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Dodgy Connection","reviewDescription":"Tends to say connected to internet but won’t load anything until the Wi-Fi is turned off and then turned back on.  Doesn’t do this with other devices that I have.  Very odd.  Overall, Apple makes a good tablet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"A great iPad at a great price.","reviewDescription":"I didn’t need a full blown top of the line iPad, but I wanted one that would do everything I wanted.This generation works well for me. It is like my iPhone, but larger. I can work with all types of documents, manage my accounts, sink everything with my phone and laptop and have a screen that is comfortable for reading books and watching movies.I am extremely happy that finally bought one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"More universal","reviewDescription":"My first venture to Apple, so had a few quirks to learn, but did not take long. It seems most apps have been designed for Apple, so more universal. Pleased.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"worked great for a year","reviewDescription":"bought this for my daughter who lives in the virgin islands... this unit worked great for a year+ .. just out of warranty and the unit would not respond to the screen...","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Good budget choice as the lowest-priced current iPad","reviewDescription":"Does almost everything you want an iPad to do, supports all of the apps that I have seen or used, has a good size screen and supports 1st generation Apple Pencil and bluetooth keyboards if you want these items.  Very satisfied.  However, note that if you intend to use the iPad for artistic work you may be happier with one that supports the second generation Apple Pencil that has a more \"paper-like\" feel on the display surface and has a sensor for how much pressure you are putting on the point (the newest USB-C Apple Pencil is not supported on the 9th generation iPad and, by-the-way, the newest. Pencil also does not have pressure sensitivity even on the models that support the second generation Pencil).  Other models are smaller, lighter, bigger, and\/or faster (e.g., for games or apps like Photoshop) but all of this at added cost.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"First time user of Apple product","reviewDescription":"Apple is really hard to learn.  Not used to this product.  First time user of Apple.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Unmatched Performance and Versatility – Apple's 9th Generation iPad Shines","reviewDescription":"The Apple iPad (9th Generation) is a technological marvel that seamlessly combines power and versatility. Fueled by the A13 Bionic chip, this iPad delivers a level of performance that stands out in its class. The 10.2-inch Retina Display is a visual feast, offering crisp and vibrant images, making every video, photo, and application come to life. With a capacious 64GB storage, I found ample space for my apps, files, and multimedia without a hitch. The 12MP front and 8MP back cameras capture stunning photos and videos, making this iPad equally adept for creative pursuits and video calls. The inclusion of Touch ID adds a layer of security, and the all-day battery life ensures uninterrupted productivity or entertainment. In Silver, the iPad exudes elegance, making it not just a gadget but a style statement. Apple's 9th Generation iPad is undeniably a powerhouse, setting the bar high for tablets in terms of performance, display quality, and overall user experience.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Excellent price…","reviewDescription":"Purchased this iPad for my sister who is new to the table world. This is an excellent iPad for beginners, as well as for more advanced people. The display is great for streaming movies and for personal pictures. Best of all is the price. Excellent quality!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Surprisingly Great! An Affordable and Comparable Option","reviewDescription":"I'm the kind of person who prefers to have newer versions of products, but decided to give this one as a gift to someone who has never used an Apple product. This model was affordable and only a couple of years old, so I thought it would still fair pretty well for what this person wanted to use it for. Let me just say, this product blew my expectations right out of the water. It works extremely well! It's not slow, laggy, or constantly freezing\/crashing. It works well with the first-generation Apple Pencil, connects easily via Bluetooth, and has great touch-screen sensation. It easily runs the Procreate and Canva apps and is able to keep other apps in the background without issue. I am very pleasantly surprised about this, as I was expecting a cheap, old product. If you are looking for an iPad to use for art\/graphic design or are a student looking for an affordable option, this one is definitely for you!","isVerified":true,"ratingScore":5,"reviewReaction":"50 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Best entry device for the apple ecosystem","reviewDescription":"It's not just a purchase, It's an investment I should say. For a good price of 270$ you get a great tablet, with great battery, handful of polished software, and latest ipad OS.Evident Pros:The battery life is admirable. In my experience so far, it ocassionaly withstands 2 days before having 17-22% just before I recharge it. Worth to mention however, I don't use it for any mild-heavy gaming.The UI and the OS itself make the tablet a big win for art, study, and partially productivity work. It's very reliable.Nice responsive smooth screen. It's bright, colorful, and the panel is pretty qualitative, and what's important it's fairly repairable, so if you break the front glass it could be easily changed without the need to replace the whole screen.A13 processor. Let's not forget about that. Everything works smooth and fast from UI to the apps themselves.Shots to the overall quality of the product. It's very well-built what makes it feel like a more of a premium product for this money.Cons:The Camera unfortunately is only in the device for the sake of having a camera. If I wouldn't have to, I wouldn't take any photos on this thing. It's too unreliable.Have you seen the bezels of the screen? Having it's crazy specifications for its budget the front screen design makes it look like you bought a tablet from way back in 2016.Apple pen 1st gen. Seriously. Was it that hard to implement apple pen 2nd gen support? Come on apple, you don't even include the pen in the package.Absurd prices on accessories. I won't even care about these, since they cost more than a tablet itself lol","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Great for a tight budget.","reviewDescription":"Bought this to help with my wife’s stroke recovery. Downloaded some apps for aphasia. Works really well. Holds a charge forever. Plus you can create some cool art on it. Very cool.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Very great quality for a great price","reviewDescription":"This was an upgrade to an older iPad I had for years. And although this isn’t necessarily the NEWEST iPad, this is incredibly high powered and has a lot of great functionality. The only misleading thing about the product on here is that it almost insinuates you get the pen stylist and keyboard, but it’s just the iPad you get. All in all a great purchase for a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Typical Apple!","reviewDescription":"The iPad is a wonder to behold and to use. It is like a mini computer: somewhat limited, but very good at what it does. It is actually between a phone and a computer. It does everything your phone does, with a screen big enough to actually see! I love it and use it a lot. And it is durable and made to last. My old one is still working like a champ, but doesn't have the system or the features I now rely on.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"great battery LIFE","reviewDescription":"First of all, the BATTERY LIFE is Excellent!  BUT if you are Newbie, battery life will SUCK!  Why?Because you are newbie!  Understand battery life takes into consideration how many things are turned on  and how much juice you are currently using.  Let me give you an example.Your Home is POWERED by electricity,  and the more stuff you have turned on, TV, air conditionair, fans, refrig,  freezer, etc ... the higher your electric bill.  Are you with me so far?  With the IPAD, apple wanted to impress you with WOW factor when you got your IPAD, so it turns on tons of stuff, and has lots of stuff going in the background, using POWER.  YOU the USER will have to turn OFF the features you are NOT USING to increase how LONG the battery lasts.WIFI, Bluetooth, screen brightness, games and apps... going in the background, might NEED to be TURNED OFF if you don't need them at the moment.  ( example you don't need to turn on A.C. in your home in the middle of winter).... watch YouTube videos for tips and pointers on turning off\/on only the features you need at the moment and learn all the cool things this device can do.I made this review when I read a number of posts of NEWBIE'S saying they got the IPAD and returned it because the battery life sucks.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Amazing drawing tablet when paired with the Apple Pencil","reviewDescription":"Drawing feels natural: She loves using the Apple Pencil (sold separately, FYI) - it's like drawing on paper, but with way cooler possibilities. She spends hours creating colorful creatures and fantastical landscapes.Apps galore: There are tons of amazing art apps available, from kid-friendly drawing tools to pro-level software. We're obsessed with Procreate - it's like having a whole art studio in your pocket.Portable creativity: We can take this iPad anywhere, which is perfect for keeping her entertained on long car rides or doctor's appointments. Plus, it's lighter than lugging around a sketchbook and markers.A couple of things to keep in mind:Storage can fill up fast: If your kid is a digital art picasso like mine, you might need to upgrade to a larger storage option.Accessories add up: The Apple Pencil is essential, and there are cases, stands, and screen protectors to consider. Factor those into the cost.**Overall, the iPad (9th Gen) is a fantastic tool for budding artists. It's sparked my daughter's creativity and keeps her entertained for hours. Just be prepared for the potential of exploding app stores and a growing collection of drawing accessories.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Reasonably priced iPad","reviewDescription":"I needed to buy a new iPad as my iPad mini 2 hasn't gotten an update in a few years. I don't use an iPad for much other than a reader and to watch video on so I really didn't \"need\" to buy another one. My mini still has great battery life. I still like it. The only thing that bothered me was some games required a newer IOS than what I had, but I generally game on my computer. I did want to put my bank's app on my iPad and that is the only reason I bought a new one. Being able to waste time at the doctor's office on a screen I can see is a huge plus. Battery life is very good and this iPad is much smoother than my old one. I've never used a laptop. I've owned a few and didn't like them. Too much of a hassle to carry with you on daily activities. I figure I got 3 more years of updates at the very least. Apple is still selling this \"new\" and they do support discontinued hardware for 3 years usually. Not always though.I guess time will tell.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Nice quality and construction. Needs a phone to verify making an account to do anything useful.","reviewDescription":"As someone who likes privacy, I found the phone requirement off-putting. I could buy a tablet for an open OS and download and use anything I wanted. This feels locked down and doesn't have freedom and privacy to it. I need to tie a phone to an account to download and play silly games on the ipad. It continually asks me to finish setting it up when I dont want siri or any of the other functions always listening to my conversations and logging that data.I can still use it for education or watching youtube, so I guess that's a plus. It comes with a number of apps which might be useful, and it can act as a personal daily planner. But without an appleID I cant unlock its full potential. I considered buying a burner phone just to deal with that, but then I asked \"why should I have to go through another hoop? I should have the option to install things without requiring an ID on my personal machine and pay for them using the typical process that existed 20 years ago; cash or a credit card\".Steam has never asked for my phone number to make or continue to have an account with it.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"No Sim card slot. Am done with Apple.","reviewDescription":"Am done with apple. Not only has the hardware gone downhill, software and apps are horrible. With all of Apple ads touting its camera abilities, Storage, viewing, customization, personalization, renaming more than one photo, is all non existent. Customizable screen interface between tapping and swiping doesn't exist. No handicap settings for those of us with only one hand. Unfortunately only Microsoft offers any Customizations\/Personalization. I don't like Windows 10\/11 Windows 7 is still better.Please spare me the steve jobs aesthetics about Sim card slots its a ridiculous argument. The Apple Lightning SIM card adapter is has horrible looking as it is useless. Icloud is a slow joke. Am done with apple. Google is actually worse at photos than apple. Unfortunately it's going back to Windows is my only option.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"short life span","reviewDescription":"We bought this ipad for our daughter for christmas. She loved it so much but after just 4 months it started glitching and malfunctioning.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"NOT a cellular IPad as described","reviewDescription":"Verizon notified me that this is not the same as a cellular iPad. Which makes it pretty worth less unless you’re going to sync your iPhone to your iPad like a watch or use a different app. Disappointed as can be.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"battery defective?","reviewDescription":"I set up this I Pad with information from my old I-Pad and have been using it.  I am having to recharge it daily as the battery runs down quickly. I wonder if the battery is defective. I replaced my old I pad for this one due to the recharging problem. and its age.  Can I get a new replacement I Pad?  Thank You.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Could not use as something wrong with unit","reviewDescription":"Unit unusable.had two computer technicians try to fix, no luck. Service from Amazon outstanding, had no problem returning unit, Took a lot of frustration from purchase, will reorder again after refund obtained","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"It’s not as good as my old one!","reviewDescription":"m not happy with it. It doesn’t hold a 24 hour charge. It’s not any different than my other old, old one. I think I wasted my money on it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Should’ve stuck with my iPad mini","reviewDescription":"I needed to replace my iPad mini and I was reluctant to pay almost $500 for the new model. I wanted to save money but I should’ve stuck with the product I like.This iPad is slower to respond then my mini 3 touch screen. I’ve had problems with apps freezing, that requires a restart. I never had that problem with my mini. The size is awkward, too large to fit in my purse and carry with me, but too small to act as a laptop.If iPads keep getting more expensive without significant software or hardware upgrades I may have to start looking somewhere other than Apple.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Don’t purchase Apple products through Amazon","reviewDescription":"This iPad is “glitchy” and definitely NOT a product of Apple! Beware of who the seller is !!!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"APPLE'S AUTHENTICATION & VERIFICATION PROCESSES HAVE SIMPLY GONE TOO FAR","reviewDescription":"Look, I'm sure this thing is the greatest thing since wheat toast, but we bought several of them recently, and it was a stoned-cold nightmare! Tried to initialize it, couldn't, because Apple required one code after another, sent only to iOS devices (what if you're using Android?), followed by iPad lock-outs, forced time-outs, etc., and then the iPad wouldn't even recognize their own freaking codes! Absolute amateurism! Called Apple Tech Support, only to be told that they had no idea what was wrong. Just a complete freaking joke! You've gotta be outta your freakin' mind to support this company.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Great","reviewDescription":"Bought to draw in and surf apps.I like it very much.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Works well. Fast and reliable","reviewDescription":"It looked like factory packaging. We’re well done. Fast and reliable. The battery doesn’t last super long.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Good price","reviewDescription":"Phone screen is getting smaller every year.  This helps alot","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Very heavy","reviewDescription":"A little bit expensive","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Still the standard","reviewDescription":"There's a reason when people think tablets they think ipads. It is the standard. Though this model may be the last generation version, it is still solid. The new formfactor has some quirks to work though. I would still recommend this version if you want a proven, solid tablet computer with wide app compatibility. Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"Almost Perfect! (Bad Audio)","reviewDescription":"I am Android phone user since day 1. Because of that, across the years I bought a lot of Android tablets and even some premium models from Samsung and Asus. The outcome was always the same: every now and then the tablet felt sluggish and frozen.After reading many praises to this model, I gave it a shot given the huge window return for the Holidays and I am keeping this one: fast, nice screen and very responsive touch screen.Highly recommended, removed one star because the audio quality is mediocre and speakers are located at the bottom so you cannot experience the stereo environment. Not a deal breaker as 75% of the time I use it with my earbuds.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1672012800000}
{"reviewTitle":"Worth purchase price","reviewDescription":"I’m older and enjoy reading from my Kindle books. This is perfect for reading.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Beware!","reviewDescription":"Heads up this item does NOT come with the pencil and keyboard as depicted. The rest looks fine. I’m going to price out those things and return if appropriate.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"Great replacement I pad","reviewDescription":"My I pad mini was on its last leg and I needed a replacement.this I pad meets and exceeds my expectations. Fast easy to use,setup is way to easy just set my mini next to the new one Follow the instructions done. I am really impress all my games information transfer with no loss and it has all that I could possibly need or use.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Stone dead after 1 year and six days","reviewDescription":"Black screen.  Tried all the suggestions on the web. As far as I can tell it is totally dead.Not too useful as a doorstop.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Batteria defectosa","reviewDescription":"La batteria vino defectuosa alos dos meses ya no cargaba la batería tube que iniciar la devolución de la tableta, tengo otra la 7th generación asta el dia de hoy trabaja como nueva,","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674172800000}
{"reviewTitle":"Lousy battery.","reviewDescription":"1st: the picture image that is showing on here is NOT the correct image for this model. I bought mine in Oct 2022 and the \"on\/home\" button is on the top NOT on the silver margin. So misrepresentation or image error?2nd: the battery takes 6-7 hours for a full charge IF you can even get it to charge.I have to plug\/unplug 5+ times for it to even start charging.3rd: IF it does start charging and after 6 hours you can get a full charge, with minimal use or even NO USE, it will only last about 3 hours.So after only 6 months, with average usage of 14 hours a week, it's become pretty useless and getting worse.I will look into buying an Android from now on. Apple is such a disapppointmentand I do not recommend buying this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684886400000}
{"reviewTitle":"Not working as it should...","reviewDescription":"Nothing but issues with this since we got it. First there was some bug that forced us to update right away. Then we realize the camera won't focus, iPad randomly turns on by itself and will start playing music or videos, etc. All Apple wants to do is basic troubleshooting that we've already gone through. Would recommend buying an older model with better feedback, as I hear I'm not alone in the issue I'm having.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Locked Out of Device After Opting Not to Make a Password - Edit - Amazon Support Helped!","reviewDescription":"I thought it would be nice to have a tablet for reading and art, so after some research I found that this iPad would make a really nice combination of both for a pretty reasonable price (especially for apple) I've had many Apple Products: Several iPhones - durability, extended battery life and planned obsolescence obviously annoying but otherwise fine - and one excellent MacBook that lasted me from 2011 to 2022.This item was on the path to being my favorite, until about 4~ish days ago when it decided that I had to put in a passcode to unlock it. For reference - I was asked to do this upon installation, HOWEVER I CHOSE NOT TO DO SO. I understand that means that my information on my iPad was unprotected, but I didn't have any sensitive information on it. The simple solution - give it the good ol' restore via iTunes! Well... It won't connect because I have to put in my non-existent passcode to give my computer access to the device.Oh well! I can always give it a factory reset! Nope. Can't do that. Every time I follow the procedure to do a factory reset, I am locked out of the iPad for EXPPONENTIALLY INCREASING intervals of time.Obviously, I'm annoyed by this. I wanted to see if I could return it and get a new one, so that I can put in a stupid passcode as soon as I set it up, but IN ORDER TO RETURN THE ITEM I NEED TO DO A FACTORY RESET ON IT! Fun fact, that's not possible because every time I follow the procedure for the factory reset, the thing locks me out for longer! So now I have a completely useless iPad. And Amazon support will not assist, and apple will not respond to my inquiries. I hate giving something that has potential to be a good product a bad review, but sadly this one is unusable and I am receiving no assistance. Hopefully nobody else has issues with this kind of thing!Edit: Amazon got in touch with me shortly after review and they offered me a return\/refund on the product. Shout out them!","isVerified":true,"ratingScore":3,"reviewReaction":"39 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Just OK, wouldn’t buy another one.","reviewDescription":"I’ve had this a few months and it’s generally alright but it has a very annoying “feature” which is more of a bug. It is constantly reloading pages for no apparent reason. Often while I’m reading a long article it takes it upon itself to reload the page even if I’m not touching it. Sometimes I’ll be maybe 5 or so minutes into the article and RELOAD! Now I have to page down until I find where I was.This never happened with my Samsung Galaxy.The only reason I got it was because I needed something with an IOS operating system for a hearing aid app.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Seemed to be brand new. Not so sure","reviewDescription":"It keeps locking me out even with fingerprint. Tried to return and tried speaking to a rep but she kept putting me on hold because she must not have known her job. Stuck with an iPad until I pay even more for someone to fix it so it stops locking me out. 3 stars because it looks fantastic","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Another \"meh\" Apple product","reviewDescription":"The hardware itself is no issue, but like a lot of Apple products, I found the device cluttered right away on startup with all kinds of random apps I had no use for. Apple also continues finding ways to be really unintuitive for someone who isn't a lifelong Apple-user. It's fine, but doesn't excel beyond that.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"NEED TO PURCHASE SIMS CARD","reviewDescription":"I received my iPad a couple of days ago.  So far so good, except I was surprised to discover that I need to purchase a separate SIMS card for the cellular side of things.  If that is noted anywhere in the description, I fail to see it.  Also, my first attempt at Apple Care was a disappointment.  You can request a callback when contacting them with questions which I did twice with no success.  I tried the messaging option which took over an hour to get answers to 3 simple questions because of the long pauses between responses.  All in all, I am happy to have a new iPad because the battery life on my old one had given out, but I think things could have gone a lot smoother.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Ok….","reviewDescription":"Not bad but NOT good . I’ve had it for less then 4 months and it is so bad!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Disappointed","reviewDescription":"After6 months and having issues with it. No matter what I do I can’t solve the issue","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Charging is short lasting","reviewDescription":"Change is not long lasting. Really it is  bad","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Was ok","reviewDescription":"OK tablet.  Someone stole it after only a week.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"I thought this was new ?","reviewDescription":"After turning my new iPad on, I noticed two specks on the screen. I got a micro fiber cloth and tried to wipe them away, and they didn’t come off.. I took a closer look and realized these specks are under the glass screen ! I paid for a new iPad, not a used or refurbished iPad.. so I’m not 100% satisfied with the purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Good tablet with room to improve","reviewDescription":"It's a good table but there are some improvements that can be made on the UX of the iPad OS.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"IPad 10,2’","reviewDescription":"Estoy satisfecho con el iPad, se un regalo para mi esposa y está encantado con su equipo.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686614400000}
{"reviewTitle":"Update password","reviewDescription":"It was easy to update my password","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Good Tablet but needs case","reviewDescription":"The Ipad 9th Generation is a good tablet however if you want to take it outside with you without any production it might crack","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Looks nice where's the charger","reviewDescription":"Delivery was on time the driver was exceptionally polite and helpful, the issue up to this point was I did not get the charger cable or the charger block. Product has not been tried yet as it is a mother's Day gift.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Enough for me","reviewDescription":"Just a good one not the best but works.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Quality product","reviewDescription":"No complaints","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Promptness","reviewDescription":"Promptness.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"Most of my products have been great","reviewDescription":"I don’t dislike any of my products just sometimes the hats are not to good just a few of them","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Works as specified","reviewDescription":"Looks brand new when received.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Battery life\/charging stinks","reviewDescription":"Bought for my girls for Christmas. They love their iPads but the battery dies so fast and the charging takes forever.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"A bit frustrating","reviewDescription":"When I am reading an article it shuts off and restarts the article.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Great while it lasted","reviewDescription":"This iPad died after only five months.  Can not get it to turn on.  Tried both “forced start” methods with no results.  Called Apple support and was told that because it came from Amazon, it did not qualify for expedited replacement.  Will have to send it in and wait two to three weeks for repair.  Apple rep even said it was probably refurbished, but the invoice says it is new.  It was great as long as it worked, thus the review.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Screen stopped responding","reviewDescription":"The screen stopped responding after 6 months. Pretty annoyed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Not as easy to use as my I Phone","reviewDescription":"Waited for keyboard to arrive to see if i can use this i pad for work. Already miss my face recognition that i have on my i phone and fingerprint scan on i pad does not seem to work. I am somewhat disappointed with the i pad lack of ease to set up and thought it would be same as my i phone without the calling function. Turned out the iPad would not work for what I needed it for with my job so I did end up returning it only to find out that it takes forever to get a refund when you order any Apple products from Amazon because they have to actually open the box to make sure the serial numbers match Before a refund can be issued unlike most other products on Amazon so in the future if I ever order anything like this again or any electronics, I will just buy at Best Buy or it’s simple to buy and return if needed","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"overheating","reviewDescription":"This iPad works very well and I was really glad I bought it, but, it has now started to overheat often and shuts down. I don't know whether to return it or if there is someway to fix it. I did buy the warranty.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699056000000}
{"reviewTitle":"Does not come with keyboard or Apple pen","reviewDescription":"This item was advertised (both in pictures and in the description) as coming with an Apple pen and smart keyboard. All that came was the iPad and charger (wire and plug). The iPad itself is nice and appears to be new, but the listing needs to change.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Screen Burn-In \/ Ghosting Images","reviewDescription":"I bought my iPad in October of 2022. I rarely use it and noticed that the screen seems to have real issues with screen burn and ghosting. Which is surprising because Apple is known for its quality. The iPad is usable at least for now even with the screen issues. I have a friend who bought their iPad a year or so before I bought mine and has had zero issues.You can see an example of the ghosting screen if you look at the edge of the photo I've posted. In the second photo, you can see the burn-in \/ ghosting from the icons at the bottom.For those wondering, the screen was not left on for an extended period of time.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"It had a knick on it when it came, kind of disappointing but still works","reviewDescription":"I use this product to watch TV or do work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Battery aches","reviewDescription":"The iPad is great but the battery is stuck at 54%. I’ve had it in the charger for over 30 minutes and it will not go up. When I take the charger out it goes down 3% in another 30 minutes so not really impressed. One of the reasons I got a new iPad and I wanted the battery life. I know this is refurbished but still. For $269 it should have a good battery.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Impossible to set up ... on chat with Apple Support forever ... Useless ... Sending Back ... JUNK","reviewDescription":"I have three other iPads. Every one was a joy to use and easy to set up. This piece of junk has eaten several hours of my life trying to get it set up. I tried the hilariously named \"Quick Setup\" and watched as it took over 90 minutes to get the initial software update (OS) done. This was done on a fast WiFi setup. Then, with my old iPad next to it, I try to transfer data, photos and Apps. It never ever gos anywhere. I let it sit the firs day I got this thing over night and it was in the exact same state ... I reset and tried again. Same thing. I checked the Internet and this is a common problem. One other person with the same problem wrote \"Not Ready For Primetime\" ... An understatement in my experience. My wife, a lot more patient than I, said try Apple Support. Spent a frustrating 30 minutes with a tech who was less that useless. I told him the problem and he wanted the serial number. However, the iPad was stuck in an update and I had to kill that and ... hard to believe ... it reset itself ... all the way back to the HELLO screen... I even tried to skip the Quick Start option and do setup manually but when I tried to transfer data, it took me v=back to teh never ending data transfer....Sending this one back ... VERY DISAPPOINTED ...","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Pray you don’t need repairs","reviewDescription":"It’s probably doesn’t deserve a one star but no one reads a 3 or 4 star review. I broke the screen fairly severely. Apple offers absolutely zero help unless you enlist in their very expensive AppleCare program and they absolutely despise third parties for making any repairs. Their system is designed for you to buy new products, and repairs are prohibitively expensive. Parts are immensely inflated and expensive. in order to have my iPad repaired,  It was going to be $200 through Apple itself and $180 through a third-party. There’s no way replacing an 11” by 9” piece glass is actually that expensive. They make it that expensive. So I guess I’m stuck with a broken iPad for a couple of years.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Almost all of my computers and devices are Apple.  Today, I doubt I will ever buy another.","reviewDescription":"I was eagerly looking forward to a new ipad, as my old one was showing all the use it has had.  My new one arrived yesterday.  I have apple computers, ipads, and phones, and have enjoyed been a staunch supporter of apple products since the Apple II came out.But my new ipad is horrible.  Well, it may be a great tablet.  But I can't get past all of the disgusting invasive and pervasive built in marketing and advertising to find out.  I bought the ipad.  I paid for it.  But it does not seem to be my device.  It belongs to Apple and their marketing partners and serves as a conduit for all their obnoxious ads.  I don't know if I will ever be able to get all of the intrusive ads to go away.  Shame on you Apple.  I have been a staunch supporter of your products all these years.  Instead of the joy I have always felt about receiving a new Apple product, I simply feel used and betrayed.","isVerified":true,"ratingScore":1,"reviewReaction":"52 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Misleading Description","reviewDescription":"No pen or keyboard. I bought this for my granddaughter. She wanted the IPAD with pen and keyboard. The description said \"APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection. \" Anyone can read it on the Amazon page (https:\/\/www.amazon.com\/dp\/B09G9FPHY6?psc=1&ref=ppx_yo2ov_dt_b_product_details). the one we received did not come with either, and there wasn't an option to add it on purchase. I feel mislead, adn my granddaughter was so disappointed !!!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Piece of junk","reviewDescription":"This is the worst iPad I have ever owned. I’ve had several iPads through the years. They have all lasted from 2-4 years….this has been a piece of junk since I tuned it on. Constantly freezes, shuts down, touch works about half the time. I’m shocked at the great reviews…I’ve only had about 4 months….I must have been shipped the lemon.I would never purchase an iPad from Amazon again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"I cancelled my Amazon prime for good","reviewDescription":"My daughter saved up and bought this and AppleCare coverage. Amazon shipped an iPad out, but it doesn’t match the serial number on the receipt.The iPad cracked, because it’s of low build quality, but Apple can’t do anything because Amazon messed up the serial number (like they’ve apparently done a LOT).Today is my daughter’s 8th birthday, and after WEEKS of trying to get the problem resolved, I just got notice that they won’t do anything for her. They say it’s been too long, that we didn’t notice their problem fast enough, and now when she wakes up I have to tell her and she’s going to cry.I’ll never buy anything from Amazon or Apple again.","isVerified":true,"ratingScore":1,"reviewReaction":"27 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Defective priduct","reviewDescription":"It stopped working or powering up slightly beyond the 15 day window to return!  All trouble shooting at home was unsuccessful. I am at an apple authorized service provider and they cannot get it to power on either. So they are running a diagnostic and will likely have to send it to Apple for further help. I am very disappointed that it didn’t last longer and only worked just long enough to miss Amazons return opportunity. I deserve a new device. A product of this value should have a longer return window. This is my second iPad purchased through Amazon so I though I would have had another good experience.  The first one I had for several years and I just gave it to my grandson then and it is still working. I bought this one. This one must have been defective. Apple\/Amazon should replace this defective device that lasted less than 30 days.","isVerified":true,"ratingScore":1,"reviewReaction":"43 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Didn’t last long","reviewDescription":"This iPad started off great! Worked as intended but unfortunately, after 14 months of use, it just quit. Tried all the fixes, hard resets, ect but it would not power on. Took to a repair shop hoping us was just a bad battery. As it were, critical hardware failure. And since it was two months outside of Apples warranty, they said there was nothing they could do. Very disappointed and can’t bring myself to buy another tablet.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Huge pain to set up for kids","reviewDescription":"Bought this to give to my kid for Christmas. Setting up a child's account is a nightmare and completely unintuitive. It will force my kid to enter an iCloud password each time they want to REQUEST a free app. The whole point of requesting an app is for the parent to be able to approve\/deny. Now I either have to make the password something ridiculously easy that my kid can remember (which would be awful for account security) or be there every time they want to install an app. I wish the fire tablets weren't so painfully slow and unreliable otherwise I would have stuck with those.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Worst support I've ever seen","reviewDescription":"I spent several hours trying to get this thing setup. Couldn't use my usual email address because it complained that it was already used for some reason. Created a brand new cloud email and it worked for about 10 minutes and then it began asking for my password. Each time I entered it, it complained that my apple id is was not active. The unit was basically completely unusable..prompting for my email password anytime I tried to do anything. Spent the next week trying to get help using chat (which was totally useless) and by phone (never got callback despite multiple attempts). Worst support I've ever seen. Finally returned it out of frustration and bought another kindle fire (for 100$ less) and had it all setup in about 10 minutes. This product is overrated, over priced and under supoorted. Do yourself a favor and buy a kindle instead.","isVerified":true,"ratingScore":1,"reviewReaction":"25 people found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Glad to have to read kindle books.","reviewDescription":"I wanted to use it to read Kindle ebooks,, and for a bit of internet.After I received it, I discovered that this version of Ipad will work with Amazon Prime movie downloads.  Since I can not afford at home internet, is great.  Download at library.At home I have Hot Spot on Iphone to look at weather and news.I would have preferred the latest iPad with the most of memory and so on.  but this was affordable,  and EOL (End of Life, when Apple will not longer update OS) is a while in the future.I delayed opening box until I had, in hand, a stick on screen protector, and a case.  Being poor i got a cheap silicone case like a child would use.  I don't anticipate breaking it.I bought monthly version of Apple Care Plus.  Apple care advice phone is like having a geek who is a best friend, and who has all the time in the world to be helpful.  and who has a good grasp of how to talk to someone not technically knowledgeable at all.  Apple Care is the support that you always thought a computer support guys should be.  At least that is my previous experience with Apple Care.  Actually paying more for fixing hardware, that is why I bought case.Get a case.  Don't open iPad box until you are ready to put case on.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"The best technology purchase","reviewDescription":"Like every Apple product that’s is a really good option in the relation price-quality, I’m content creator and this iPad be my best friend and my principal tool for work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"More than my expectation","reviewDescription":"I bought last week, my ipad coming new with box even, absolutly amazing. Thanks for amazon and seller, want to buy 1 more","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Great Device for Both College Students","reviewDescription":"We purchased two of these for our college-aged kids.  They are invaluable to them.  Our nursing student has tod us that EVERY nursing student uses an iPad in class. Also, there is no need to purchase the next generation, this generation is more than enough!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Fantastic IPad.","reviewDescription":"Great Ipad! Haven't had any issues with it so far. Color on the screen is great, sound is as expect from an Ipad and overall very happy with this purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Great product","reviewDescription":"I wish a lot of the apps were free for it mostly of apps for kids, productivity or anything else have to have a payment plan. But it’s great for other things specially if you buy the accessories for it like the keyboard, pen and case.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Works Well","reviewDescription":"My other iPad was old and no longer working.  This iPad works much better and it does what I need for it to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"its perfect in terms of what it offers","reviewDescription":"i would say buy it if u want a standard tablet or entry one. It really has everything you could ask for","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"CALIDAD","reviewDescription":"Justo el día de hoy me acaba de llegar y me encantó la pantalla, el táctil, la memoria, ojalá me duro mucho.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"These are perfect.","reviewDescription":"Gave my own old iPad to my child and treated myself to this new one. These work perfect and I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Great IPAD for the money.","reviewDescription":"Replaced my older IPAD because the IOS became too old to run any apps.Very satisfied with the feel and the quality of this IPAD at the price paid. A very good value for the money and works great. Has a fast snappy feel to it. Recommended to anyone who just needs a WIFI device to play games or run Utility aps Happy I bought it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Nothing beats the iPad","reviewDescription":"Apple's iPads never disappoint. This is another winner in a steady stream of iPads. Nothing could have been any easier than purchasing it through Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Its turns on and works normally!","reviewDescription":"It was packed good, and come with good condition. Only the box was little bit damaged, but other then that it is doing pretty well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Product was new as described. Great product at a great price.","reviewDescription":"Their ad described the product. I received the product as described in new condition at a good price. Don’t know what they could’ve done better.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Long battery life ever!!","reviewDescription":"I love this item I highly recommend getting this brand I haven’t needed to charge my iPad when I got it the other day 🩷","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Very pleased","reviewDescription":"I like this iPad. It was an upgrade from my older iPad, which was running out of storage. This newer model is so much faster! The delivery was quick, the price was perfect. I am very happy with this purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Everything that I needed","reviewDescription":"Bought this for my work to use with an app that was not available on any other platform.  The speed and ease of use is quite better than any other android device that I have ever owned.  This is my first Apple product purchase. So far so good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Very nice iPad.","reviewDescription":"I got this iPod thinking it would be a toy tablet. Well I got a nice keyboard and it’s turned into a nice laptop!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"I live on this thing!","reviewDescription":"This is my second iPad, replacing an older one that my late brother got for me years ago. I didn't think I needed an iPad back then. Now I do pretty much everything...except phone calls, texts, etc.....on it! This one has a much sharper picture, colors are true and it's much faster than my old one. I love it and can't think of being without it!Additionally.....I often watch TV on it, using headphones. The headphone jack is on the opposite side from the charging port. I comfortably survived an especially loud, explosive New Years Eve watching a movie and other shows until the neighborhood \"calmed down\". 👍","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1706313600000}
{"reviewTitle":"Great","reviewDescription":"It’s lighter than my older generation tablet. It’s the usual iPad and is good. The only thing I can’t figure out is how to not have it block after one failed password attempt…","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Already an issue with the screen.","reviewDescription":"No wonder ipads are cheaper on Amazon than other sellers. The screen already has an issue despite being in an overly protective case since the ipad was first opened. The issue is so  bad that it appears to also be affecting the volume button sensors and perpetually lowers the volume.....","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Doesn’t work!!","reviewDescription":"I received the iPad Tuesday 7\/26 (two days ago), let it charge for the day, and tried to set up yesterday 7\/26. As soon as I got done putting my finger print for Touch ID, the screen went blank\/black and won’t turn back on. I tried updating iOS and factory resetting the iPad via iTunes. Nothing worked. I finally took the iPad to apple, and they couldn’t fix the screen either. The iPad turns on, but the screen is still black. Others have had this issue as well. I will be returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1658966400000}
{"reviewTitle":"Touch screen doesn’t work","reviewDescription":"Unable to do anything, touch screen is not functioning properly. Unable to return or exchange.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Got buggy after 6 months.","reviewDescription":"Worked great to start with… started getting extremely buggy after a couple months, ive factory reset it many times and it doesn’t help. Just spend your money and buy a brand new one instead","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Not new device","reviewDescription":"I’m pretty sure this was a refurbish device the box was damaged and the screen seems to be after market the home button isn’t flush like it usually is with or other iPads Seems like I got scammed in a unit","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Charging Port Malfunction","reviewDescription":"We have purchased two of these iPads for our teen age children and both of them have had problems charging. We took them into an Apple store and they said there is not way to repair them. I would highly recommend purchasing iPads from a reliable source.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"Battery life is bad","reviewDescription":"Worked and was in good shape but battery only stays charged like 20.minutes from.100%","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Missing pen and case","reviewDescription":"I was suppose to get pen and case with iPad. I paid for package","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"nothing but issues from the second I took it out of the package","reviewDescription":"would give 0 stars if i could","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Freezing","reviewDescription":"Very unhappy with seller.  Had iPad less than a month.  Slow, freezes and hard to stream.  Seller said they would get back to me in 3 days.  Have not heard anything since and has been past three days.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Battery does not last all day","reviewDescription":"I would get a different one if I knew the problems I'm having.  I play games the most on it and it will stall or the screen will turn white.  I did not get the insurance and the return time limit was up when I found all the problems.The shut-off tab is not easily pushed.  I need to reboot often and recharge 3 or 4 times during the day","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Not for me…","reviewDescription":"I didn’t like this iPad, it was slow in transferring my data, I had to reset the password several times because it wouldn’t recognize it. I would have returned It it but unlike others, this one had only a 15 day return policy so after 15 days of trying to set this one up, the return widow closed.  Very disappointed with this iPad.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Not sure how long it will last tho….","reviewDescription":"Pros: I love the size, the screen is clear, takes really good photos, no damage to the front or back, the ports work and the volume and power buttons work.Cons: It takes forever to pull something up and then it says the server couldn’t connect and it’s not our Wi-Fi bc my husbands phone doesn’t have this problem...it all started after about 6 months of use. X-ing out of a tab doesn’t work every time and the Battery life isn’t strong as well. I have to close it down, wait for a while and restart it.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"iPad 9th Generation","reviewDescription":"It’s good, a little bit mediocre to be my first smart tablet ever. I expected the magic pen to be a little bit more sensitive to the touch screen.However, it is a great iPad for kids that is going to college for the first time or if you want an iPad kid (slave ) for the rest of your life","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Good, but battery hasn't lasted long","reviewDescription":"I bought this 10 months ago and for the most part it's been good! I use it for digital art and although it's not the best iPad for that it gets the job done. My only issue is that the battery life has decreased a lot since I first bought it.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Problematic Battery","reviewDescription":"Really good overall, no problems with the touch screen or camera. However, it has a tendency to go from 90% to dead in a few hours WITHOUT use. There is no slow recording of drainage, just 90% and then dead.I will go some days without using it and will check on it's battery during the off days and it will be pretty high, but then the next day when I do want to use it it's completely dead. Really thought it was a decent buy, but now I'm reconsidering.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1683936000000}
{"reviewTitle":"Sharp learning curve","reviewDescription":"I’m all Apple, but this screen is very sensitive to the touch. Working out how to rotate between horizontal and vertical without the screen rotating back immediately. I wouldn’t say don’t buy it. I’m hoping these issues will go away.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Difficult to set up manually","reviewDescription":"This iPad was so difficult to set up.  I had to do it manually.  I finally managed get it set up.  It was so easy to add newspaper bookmarks on my old iPad, but on this one it was so frustrating  I gave up.  For som reason those icons didn't copy from iCloud.  I would not buy this iPad again ... way too frustrating.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"Locked me out","reviewDescription":"iPad  locked me out first attempt to set it up and will cost me to have it unlocked before I ever got to use it!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Tree Stars is generous","reviewDescription":"I should never have bought this reconditioned IPad.  I thought it might be satisfactory, but it is not. It’s functionally is quirky at best, and I have serious doubts about the  life expectancy of the battery. The battery gets very hot with just average use.  I have never had this trouble with any other purchase from Amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686528000000}
{"reviewTitle":"Bought this for my husband","reviewDescription":"Loves this new iPad and great value for the $$","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Slow","reviewDescription":"I just received this item two months ago. The battery dies pretty quickly and the tech is slower than other Apple products I’ve used.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1684454400000}
{"reviewTitle":"Just ok","reviewDescription":"Small issues using the buttons to turn off and take photos. They work some times but not most of the time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Product is okay","reviewDescription":"The camera is not that great!It has some good features though like it detects you and moves the direction of the camera wherever you go during facetime which I really liked.Also just to let you know it is a 720 px resolution which I expected more from apple.Try to add 150$ bucks more if you can and get the latest as this one doesn't have apple pencil magnetic charging too.But if you just need it for taking notes during class then it does the job pretty well which is why I am sticking to this.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1665187200000}
{"reviewTitle":"This is my first Apple product","reviewDescription":"This tablet looks great but for some unknown reason it stops during the mid point of a podcast and won't continue.  I have to power off and power it back on to be able to finish watching the podcast or show.  It has done this twice now and is very frustrating.  It also keeps asking me to add my email address in order to \"finish\" my Apple ID.  I already did that and received a \"Done\" notice afterwards.  Grrr.  Glitches I didn't expect from an Apple product.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1664755200000}
{"reviewTitle":"Nothing but issues!!!!","reviewDescription":"Keep getting the pink screen on this! This is brand new, it should not have had that problem and considering how much money I paid for it.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Too large for pocket","reviewDescription":"Too large for a pocket","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Dissatisfied","reviewDescription":"Could not activate. Even though last years model, still new, not refurbished. But, it has to be updated before it can be activated. And if you don’t have a Mac ,or a personal pc, you have to take it to an apple store to get that done.Nearest apple store to me is 100 miles.Not doing that. Returned it no problem, Amazon arranged ups pick up,  it still, I was disappointed as it was 40 th anniversary gift for husband.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1664150400000}
{"reviewTitle":"I should have waited to get more ram... 64 filled in just a couple of days.","reviewDescription":"It's all in the headline.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687046400000}
{"reviewTitle":"Keeps disconnecting from WiFi","reviewDescription":"I bought the same item locally and I haven’t had any issues but this one I have to keep reconnecting to WiFi for some reason.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675987200000}
{"reviewTitle":"Great I pad!","reviewDescription":"I got this for my bird named Beeper, he loves to hit bubbles with his beak and burst them and lives watching other birds on YouTube. So I have it up and running and it is nice. Picture sound and controls are great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"So far so good!","reviewDescription":"Granddaughter needed one for school and the price was very reasonable. No bells and whistles but she doesn’t need them at her age. We’re very satisfied.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Small differences but not the best","reviewDescription":"It has not the down button so you have to remember to “throw” the page in order to go to another app","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"New iPad","reviewDescription":"It is not always responsive  to my touch .","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Great price but no headphone jack","reviewDescription":"This iPad is excellent, larger than expected. Easy to use, great price. If you hope to split the audio left and right, you'll need to use a Lightning cable to do so, not a 3.5 mm (1\/8\") cord. Battery holds for a long time. Bright screen.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Charge","reviewDescription":"It does not hold it’s charge long enough.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1698537600000}
{"reviewTitle":"Facilidad de uso","reviewDescription":"Reemplace un Ipad 2020 qu e se malogro","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Me gusta","reviewDescription":"Las iPad son mucho más rápida","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"xxxx","reviewDescription":"like my old one better","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Ipad","reviewDescription":"Touch screen do not work wel","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Worse battery life ever!","reviewDescription":"For a brand new iPad I can’t keep it charged!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652918400000}
{"reviewTitle":"Very good","reviewDescription":"Fit perfectly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653868800000}
{"reviewTitle":"I do not recommend this item","reviewDescription":"This is a refurbished item","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Problems with no help from Apple","reviewDescription":"Mine was delivered 7\/31\/23. About 3 weeks later, I went to sign on was got a message that the device was not available and to wait 1 minute.  waited several, tried again, now says wait 5 minutes, then it was 15 and then and hour. spent two hours on the phone with apple support and was unable to get in. took it to the apple store next day, wiped out the hard drive and reloaded.. All was fine for another two weeks and it happend again. but this time, after about 15 hours, it allowed me to sign on. took it to the store as I hada appt., they ran diagnostics and said they could not find anything wrong.. then it happened a couple of more times. Apple was no help, Amazon did not want to help as the return period had expired, but eventually they allowed me to return it..other than the fact that it would not let me in when I needed to use it, it was a good machine. but cannot give it a glowing report. Still waiting on the refund so that I can purchase another computer. not sure if it will be an apple.  bad taste in my mouth.Update-  ended up buying a Generation 10 iPad ($50 less than the Generation  9) from Target.  Same storage and larger screen. Very happy with purchase","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"Bad Past Experiences with Apple Products","reviewDescription":"Based on the fact that I have an iPad that locked up on a senior and, because she had an obsolete email ID and forgot her password, Apple customer service refused to unlock it: I am not very impressed with the iPad and will be getting a Google Pixel or Amazon Fire for her instead. There are so many better options out there. There's no excuse that we should have to have an expensive piece of equipment like this be locked and worthless after spending hundreds of dollars on it so the company can be rewarded for forcing us to buy another of their products.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Not that great...","reviewDescription":"There's no SD card slot for this or any of the apple products.  That's why I switched over to samsung Galaxy tab and phones.  At least I can upgrade my storage instead of being forced to pay Apple a monthly fee for Apple Air storage.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"I was expecting case and keyboard as it says \"About this item\"","reviewDescription":"Box just arrived w\/o case or keyboard.  Very misleading, I might say, deceptive.\"About this itemWHY IPAD — All the essentials in the most affordable iPad, with a beautiful 10.2-inch Retina display, powerful A13 Bionic chip, and an Ultra Wide front camera with Center Stage. Work, play, create, learn, stay connected, and more.IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. iPad comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.FAST WI-FI CONNECTIVITY — Fast Wi-Fi keeps you connected at home, work, school, or wherever you go with your iPad.PERFORMANCE AND STORAGE — The A13 Bionic chip gives you the graphics performance you need. And with all-day battery life, iPad is perfect for playing immersive games and more. Choose from 64GB or 256GB storage options.APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection.10.2-INCH RETINA DISPLAY — With incredible detail and vivid colors, it’s perfect for watching movies or drawing your next masterpiece. True Tone adjusts the display to the color temperature of the room to make viewing comfortable in any light.UNLOCK AND PAY WITH TOUCH ID — Touch ID is built into the top button, so you can use your fingerprint to unlock your iPad, sign in to apps, and make payments securely with Apple Pay.\"","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Great until it died","reviewDescription":"We had the previous model, bought barely over two years ago and it suddenly quit working. Our daughter loved it and had a lot of apps on it and was using it for school but we're reluctant to buy another one if it's just going to die after two years. It just wouldn't turn on one day and I brought it to an Apple store where they ran a diagnostic on it and confirmed that it was a brick. They were happy to replace it with the same model for $250 or to sell me a new one. No thanks. Very disappointed in Apple's quality and will stick with other manufacturers (for example we have a 7-year old Motorola phone and a 6-year old Fire tablet that still work fine - they're mostly obsolete but they still turn on).","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656288000000}
{"reviewTitle":"not expandable","reviewDescription":"until they make these expandable and the ability to download netflix shows im not buying another one, Samsung allows this and its too important to give up.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664150400000}
{"reviewTitle":"Died after less then two years","reviewDescription":"It broke after less than 2 years. Took it to Apple and they basically said oh well only under warranty for one year. Figured for that price it would last longer than that.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1656720000000}
{"reviewTitle":"The battery life is awful","reviewDescription":"We got this for our kid and the battery life sucks do better Amazon","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Not everything works","reviewDescription":"The touch ID\/fingerprint scanner only works when it feels like it screen fitment is off things on the screen. You need to be able to touch to click on or cut off like you can only see half of them. There’s a bunch of minor flaws and the battery seems to be dying very quickly And it’s advertised all day battery","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Volume on speakers don’t work","reviewDescription":"I’ve had it into Apple Techs twice and it still fails toPlay audio on any app needing it","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"Missing Accessories","reviewDescription":"APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection. Well, where are these accessories???","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"not needed need pro","reviewDescription":"thanks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Very VERY Disappointed in Apple","reviewDescription":"THIS iPad came with NO instructions!!! NONE!!  Didn't even know which button to use to turn it on.  Then it kept asking for me to depress the 'home' button ...when I had NO idea what the 'home button was!!!Absolutely HORRIBLE!!!!!!!  (...and I STILL haven't figured out what the iPad is asking for!!)My advice:  Buy an andoid that comes WITH instructions.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"external keyboard will not work with this","reviewDescription":"I have tried three external keyboards with this iPad and none of them work.  No support at all. Otherwise iPad works but if you want an external keyboard get something else. This one is awful.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Just received my new IPad on Saturday","reviewDescription":"I just received my IPad on Saturday. The reason I bought a new iPad because I was using an old IPad Air and the battery life was not great and also the IOS would only update to 12.5.1.After researching and looking at the reviews I settled on this IPAD mostly because it said that the battery life was up to 10 hours. Needless after charging my IPad to 100%. I noticed that after 30 mins of using my IPAD the battery went from 100% to 95%. I’m so disappointed right now that this battery life isn’t great either.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Beware if you want to return!!","reviewDescription":"This review is about Amazon and not Apple product quality. I ordered an iPad thinking it was from the apple store but it’s sold by Amazon BTW. The newer version just came out so I’m attempting to return it since I bought the new one direct from Apple. First off, UPS must pick it up from your home and provide the tracking label then. There is no way to return the item direct to a UPS store so prepare to sit home waiting for a pickup. I learned this by speaking with Amazon customer service which is the most frustrating experience ever!! Have you ever called them? Good luck understanding them!!  I’m hoping UPS calls before the pickup since I couldn’t understand the woman. I order a lot on Amazon but never again with big items! Ugh","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1666828800000}
{"reviewTitle":"Not happy with this product","reviewDescription":"Being on fixed income, I was hopeful this product would work for me while in a store. asking for wi-fi and passwords all the time is not always easy. I now find out I need a wi-fi=cellular model.  Of course it is past the return date and I am stuck with it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"Came new in box","reviewDescription":"A very new iPad straight from the box. Love it perfect price I’m using it as a POS system for my restaurant.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Just what I needed.","reviewDescription":"This has all the power & memory I need. Works perfect. Replaced a iPad Air 2 with this.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"My husband loves it","reviewDescription":"Works great. It is used for gaming, scrolling thru social media, and watching sports. Works great for everything.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Happy with purchase","reviewDescription":"Excellent for my use - mainly reading, emails and web surfing. Much easier than using my smartphone.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Amazing fast connection beautiful graphics","reviewDescription":"Love everything about this product does what it says transfer from iPhone was easy super fast connection","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Love!","reviewDescription":"1st time owning one and I love it. My kids and myself use it all the time","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Apple ipad the best tablets hands down","reviewDescription":"Cant go wrong with an apple tablet, fast and reliable comparable with price of other tablets. Came in on time no issues. Screen quality, battery life and other features are top level.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Worth it!!!!","reviewDescription":"I used this for editing videos and watching Netflix mainly so this one is good for me!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Un nuevo juguete","reviewDescription":"La compré para leer. Creo que Apple todo lo que hace lo hace de buena calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Must have for traveling!","reviewDescription":"Definitely a travel necessity. I use it all the time during flights and at the hotels.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"iPad won't stay connected to WiFi","reviewDescription":"I realzie this is an Apple product. We connect this iPad to our WiFi. It works. If you go to use the iPad hte next day it looks like it is connected to WiFi, but it isn't. I have to tell it to forget the WiFi connection, reconnect it and then it works fine. I contacted Apple. They reviewed several settings. We thought we had it working, but the same problem persists. All of our other devices connect to our WiFi without an issue. Some of these devices are Apple products, some are from other manufacturers. When it actually is connected to WiFi it works fine.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"POS","reviewDescription":"Received this iPad and 3 days later it wouldn't turn on!! Called Apple support and they tried every avenue available but stated it needed to be taken to an Apple \/\/store location to determine the issue...instructed to go to Best Buy in Olympia...called and couldn't get an appointment for 4 days!!! took it there on the scheduled appointment...technician stated the battery was shot and so was the iPad...called Amazon they told me I should have contacted them instead of going to an Apple store but then I was instructed to go to a different App Store in the Tacoma Mall....long story short iPad is not repairable and as far as I am concerned Amazon has dine nothing for me other than schedule a pickup of the defective iPad...what a joke...all my time wasted running to 2 different locations and chatting with Amazon about what they would do to Mae it good as a Prime Amazon member...NOTHING!  Drove to Olympia to Target they price matched and I got a brand new now for the same amount Amazon quoted...but no wait time!!! Won't be buying any large ticket items from Amazon \/EVER again...my advice is don't do business with them!!","isVerified":true,"ratingScore":1,"reviewReaction":"69 people found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"Not better than my old Ipad Pro","reviewDescription":"I wanted to buy a new computer b\/c my 6 year old iPad’s battery would not last a day. I do not stream movies.  It was slow, so I checked into this 9th generation. Even plugged in, which my old one mostly read `100% when using my recipe notes, email, etc.This battery drained while using notes and cooking all day yesterday and now I did an hour zoom call and even plugged in is at 95%…..Since it is only 1 week old wondering if I have a defective one, or this battery is as good as my 2016 IPad Pro?","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Was awesome until.....","reviewDescription":"So I absolutely loved this iPad until 2 days ago it completely died. I've had for 15 months and did not buy an extended warranty. I took it into the shop hoping maybe a battery problem or something else but no such luck. Repairman said this is rare especially considering the age but something most likely fried on the motherboard or whatever powers the device. His only suggestion was to buy another one a this point. So needless to say I'm quite disappointed. However on the positive side it gave me 15 months of pleasure for $300.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Poor battery","reviewDescription":"Wouldn't purchase from here again. Haven't had it a month and the battery life sucks. Takes 4hours to fully charge and dies within 2 hrs off basics usage( streaming\/games) noticed the return window closed within 2 weeks of purchase","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Software issues, BAD.  do NOT, do NOT buy this item","reviewDescription":"Slow to respond to typing, logging in ,and WILL NOT  open a shared FB post on messenger. Thought it was my settings so went thru ALL options, nothing worked…so I took the devise to a computer repair lab, they checked it out as well as another devise the same as mine, SAME PROBLEM.  They checked reviews ( as I should have done) , same results. Too late for a return at this point, and CAN NOT  get a response from Amazon or seller. DO NOT BUY THIS PRODUCT !","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"No good","reviewDescription":"I had it one month and it don’t charge beside it did not come with an apple charger.  So I used it twice and can’t return it.  Don’t buy. Another words I was scammed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"opened it up closed it it never opened again locked out","reviewDescription":"biggest ripoff ive ever bought from amazon opened the box took the ipad out looked at it put it away 1 week later tookit out couldnt open tried for to open for a couple weeks went to apple they said they  couldnt open it so i took it home put it in a safe place and there it sits no nothing no return all thats left is a ipad you cant get in lol thats amazon for you better luck next time","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"Defective device  Buyer beware!","reviewDescription":"Haven't been able to set up this iPad as I had to wait until August for Apple to send me a pass code.  Passcode won't open device. Each time I turn device on it tells me \"iPad unavailable. Check again in 3 hours\". Still doesn't work after 3 hours or even more. Wanted to return device but I didn't know Amazon was only allowing 15 days since purchase date to return.  Now I'm going to need to work directly with Apple Store which isn't convenient. Amazon should allow this device to be exchanged or returned.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"NOTES KEEP GETTING DELETED","reviewDescription":"If you want to buy this ipad for note taking do NOT buy it!!! I bought this for school and every couple days now my notes will not save or it will randomly glitch out and delete all my work. This ipad has wasted so much of my time at this point and I'm over it. I would stick to taking paper\/pencil notes or getting a different ipad.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"OK, this is a follow-UP, BUT...","reviewDescription":"NOT to say this is a perfect product; BUT TO SAY that after 3 helpers and today a \"final\" expert\/friend who spent 3 hrs in my house this AM, we now have it running up 80+% - come on APPLE this is not the ease for those that cannot squeeze!  :-(","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"It’s nice but not awesome.","reviewDescription":"The battery is decent, I do use the iPad for a baby monitor and that kills the battery very quickly. Some of the iPad features are not working as well as I’d like. The screen freeze that prevents you from clicking out of apps works, I use to play movies for my kids without them going to other apps, but won’t let me get out of it without completely restarting the iPad. It’s nice overall but definitely not the best.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1640908800000}
{"reviewTitle":"Great price","reviewDescription":"I purchased this one to replace my iPad generation 8 and I don’t see much difference in this one versus I think it is a nice iPad standard I do like the space it has that is very nice the screen is clear camera quality takes beautiful pics","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1657065600000}
{"reviewTitle":"It gets hot","reviewDescription":"I like it but it gets hot. I've never had an IPad do this. It is a bit concerning.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1671235200000}
{"reviewTitle":"Planned obsolescence forced purchased","reviewDescription":"Replaced an older model. Lets face it, Apple forces you to buy new products after 5 years by slowly making your current unit inoperable. Sure, it works fine, but so did my old one five years ago, hence 3 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1654646400000}
{"reviewTitle":"Box very damaged and the iPad was damaged!!","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1687651200000}
{"reviewTitle":"Start up","reviewDescription":"Just got it and it is hot in my hand. Will try it again tomorrow after fully charged. I laid my iPhone 13 next to it and it would not connect. I had to manually process it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658880000000}
{"reviewTitle":"Earphone monitor malfunctioned in 2 weeks","reviewDescription":"At first it has electric static sounds when I use it with karaoke apps, suddenly one day, earphone monitoring has no sound after 2 weeks. And it estimated takes two months for a replacement...This was supposed to be the only iPad worth buying, but not anymore.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643932800000}
{"reviewTitle":"It’s Okay","reviewDescription":"When watching videos it has lines thur it!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Not easy","reviewDescription":"I wanted something easy for my parents.This is not it.The old ipads made sense. I don't even know how to use this and I have a MacBook","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653523200000}
{"reviewTitle":"not worth the cost","reviewDescription":"i was looking to replace old ipad with amazon fire tablet.  Big mistake.  When is try to get help i am asked for payment information.  Not right.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"CANNOT even use. Do not recommend buying from this vendor.","reviewDescription":"This iPad is not functioning and can not be unlocked since day 1 of receiving. Better off buying from store so they can assist with a defaulted product. Very dissapointed.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Hardware is incompatible with apple device manager...","reviewDescription":"Ipad works like how you expect an ipad to work, but apparently these batches are not made to work with device manager. In running a small office we're adding apple devices for better security. Even buying brand new from an authorized reseller these devices are still \"locked\" and unable to be added.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Didn't get everything I thought I was buying","reviewDescription":"I have not yet used the iPad 10.2 inch that I bought. I understood and as I look at the order, I was under the impression I would receive the keyboard and pencil as part of this package. I did not get these items and wish to know if they should have been included and if so, why not.  Lela Aldrich","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"Ipad 9th Gen 2021 Model","reviewDescription":"My phone from 2017 has better battery life than this, plus it doesn't get as hot as this from playing games or watching streams.The battery life in this thing seems to last at least 30 minutes depending on what you're doing, that's a complete joke for how much you pay for this thing. Especially considering my Android phone that's from 2017 has better battery life than it and it's not lasting as long as it used too.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1679356800000}
{"reviewTitle":"Old stock","reviewDescription":"The date on the box showed 2021, while Costco has been shipping 2023 models.  Meanwhile, my daughter tells me the screen goes black for a second intermittently.  Looks like a lemon, but stay away from Amazon on the 9th generation model.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Charging Issiues","reviewDescription":"The charging port has failed on three of the 5 new IPads I've purchased over the years.Apple does not acknowledge the ongoing problem.Difficult to remedy. (and costly)","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Doesn't work.","reviewDescription":"Bought this as a Santa gift for our son. Delivery was kind of crazy. Package got lost and finally showed up two weeks later but still in time for Christmas. Our son was being bad so we told him we could not open it up till he was better. Now we open it and all it says is ipad unavailable! No help from Apple and Amazon won't do anything for me. Do not buy not sure if they are stolen items.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Package and item are broken!","reviewDescription":"The package was broken, plastic sealing was already open and the screen looks like it was heated and not working 😡","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"would've been great had i been able to use it","reviewDescription":"returned it and amazon claims i sent back a package with wrong serial number and never refunded me. brand new , still wrapped box. i should've just kept it and tried to resell on marketplace","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Battery is awful","reviewDescription":"The battery doesn’t hold a charge like it is supposed to. Amazon won’t take it back because it is passed the return window. Apple will not do anything to fix it. Very disappointing!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1649548800000}
{"reviewTitle":"Glitchy","reviewDescription":"Lots of little problems that my old iPad never had, like the speakers not working, email failures, stuff like that. And the speakers sound tinny, despite trying all the eq settings.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1637971200000}
{"reviewTitle":"Didn’t where is my refund","reviewDescription":"I did not like how it workI have a question why it takes so long to refund it I am nervous","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662076800000}
{"reviewTitle":"Definitely refurbished","reviewDescription":"For months this refurbished iPad will not hold a charge and when you do charge it the iPad takes 2 days to charge.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1641254400000}
{"reviewTitle":"It's a good ipad","reviewDescription":"The ipad is well but the price doesn't worth it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669248000000}
{"reviewTitle":"Storage","reviewDescription":"This IPad said it was 64GB but is actually only 5GB big rip off!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1655510400000}
{"reviewTitle":"charging is terrible.","reviewDescription":"the charging and charger are terrible.  won't charge. battery life is very low.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655683200000}
{"reviewTitle":"Great buy!","reviewDescription":"Love it!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"bad product","reviewDescription":"Why does the return policy expire and then you have problems","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648598400000}
{"reviewTitle":"My Cellular carrier (XFINITY) refused to provide a SIM because the iPad wasn't purchsed from them.","reviewDescription":"If you plan to use this on XFINITY do not buy this from Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643068800000}
{"reviewTitle":"A bit misleading","reviewDescription":"The description gave me the impression that it came with a keyboard and stylus, it did not.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Loved it","reviewDescription":"I purchased this product to give it for some one else and they like the Apple IPad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Great Buy","reviewDescription":"Love my ipad. Everything about it just works and have had no issues with it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"What to say it is a Ipad","reviewDescription":"It is very fast. But battery is not as good as my last Ipad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Not bad but battery drains fast","reviewDescription":"Works ok but picky on charging wires","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"The best!","reviewDescription":"Fast and efficient for work!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"looks good","reviewDescription":"works like a new one","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"works great","reviewDescription":"Great product, great price and fast shipping.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"good ipad","reviewDescription":"good ipad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Size","reviewDescription":"Thank you!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Works great!","reviewDescription":"Just noticed it has Wi-Fi but NOT cellular!!! Didn’t know this was possible. Would not have purchased had I known this!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"I pad review","reviewDescription":"Yes I y did I love it. I love how easy it is to use it. It’s it is so cool . More convenient . I love how quickly it loads things I didn’t care for the color would love it to come in purple. My favorite color.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Terrible service","reviewDescription":"I have purchased two iPad through Amazon Refurbished. I have been very excited to get a good deal and a good product. Both times they had something wrong with which made them inoperable. It has been sucks disappointing experience with Amazon. Won’t buy again through their refurbished store.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"BUYER BEWARE DECEPTIVE ADVERTISING! EVERYONE SHOULD FILE A COMPLAINT. *FEDERAL TRADE COMMISSION.","reviewDescription":"APPLE PENCIL AND SMART KEYBOARD ARE NOT INCLUDED!  In the description: Apple Pencil transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection. This was an anniversary for my wife and timing was very bad. What a disappointment. I had to buy the accessories separately. This incorrect description APPLE?","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"Poor battery life","reviewDescription":"Brand new out of the box, fully charged.  Read for 4 hours and battery went from 100% to 19%. Expected more.  Sent it back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Battery doesn’t last long","reviewDescription":"I received the IPad when I returned from my vacation. I have notice the battery doesn’t last for four hours and it dies. Bad market","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Didn’t even last a year","reviewDescription":"Got the black screen of death not even a year after purchase. It was always in a protective case too. Costs just about the same price to fix it as it would to buy a new one.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Won’t turn on","reviewDescription":"I can’t get the iPad to turn on! The screen says “ IPad unavailable “I’ve had a specialist to check it and it can’t be fixed! I’ve been trying to return or exchange it but I’m not getting any response! Please help me!! Thank you","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Freezes and restarts","reviewDescription":"I’m so disappointed with this purchase. After updates and even a factory reset to try and remedy the issue, this iPad kept freezing and restarting every few minutes. I asked for a replacement but have to return and wait up to 30 days for a refund to potentially repurchase. When I get my refund I’m going to Best Buy.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"Broke in a month","reviewDescription":"Incredibly disappointed in this refurbished iPad. After a month of careful use I went so use one day and the screen was black. Wouldn’t turn on, won’t respond to hard reset! Absolutely broken! I have ZERO options and I am out all of the money I paid for this! Buy new from Apple!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Not as good as my old iPad!!!","reviewDescription":"Battery is overheating with very little use!  The battery is advertised as \"all day\", but after only an hour of checking email and Facebook posts the battery is at only 80%.  My old iPad can be used for hours and will still have plenty of life remaining.  Obviously, this iPad will have to be returned!  Very disappointed with the new iPad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655942400000}
{"reviewTitle":"A2602 Model","reviewDescription":"My 3rd IPad. 1st is an A1474 which was replaced by an Air model that failed and was a loss...I ended up using the A1474 again until today. Most of the setup went smoothly, except the fingerprint setup which was impossible to achieve, so that may be a negative on this machine.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1668470400000}
{"reviewTitle":"The battery uses very fast.","reviewDescription":"I was very disappointed.The iPad was only used one month and the battery consumption was very fast.It didn’t last as long as my old ipad I bought two years ago. I wonder if it’s a refurbished ipad.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1676419200000}
{"reviewTitle":"Ipad","reviewDescription":"Brand new I pad and wont open upVery frustrating","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Nice iPad with a defect","reviewDescription":"After purchasing this iPad, brand new, and using it for 30 days, the home button became unresponsive unless I initiated it for several seconds. This is clearly a defect on a brand new tablet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673481600000}
{"reviewTitle":"Seven months and it won't power on.","reviewDescription":"It was a great device for SEVEN months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Poorly packaged","reviewDescription":"Thankfully it wasn’t damaged.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685232000000}
{"reviewTitle":"Purchased in July 2022 and as of September 2022 the screen is black and can't do anything with it.","reviewDescription":"I dislike the fact I've had the iPad less than 70 days and it has stopped working and Amazon Customer service can't seem to find my purchase to help replace it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1663891200000}
{"reviewTitle":"Won ‘T hold network, needs to be manually activated","reviewDescription":"Apple support tried to help, couldn’t fix it.  I have another IPad and IPhone, both work under the same circumstances","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"Not what I expected","reviewDescription":"The battery dies fasttttttt","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1683590400000}
{"reviewTitle":"Exceeds expectations in every way","reviewDescription":"From my use of an iPad mini, I expected that the iPad 9th generation 10.2 inch would be like the mini only with a larger screen. Although that's true, I find the larger iPad easier and more satisfying to use because of the larger retina display and plethora of features provided by the latest version of ipadOS. I am not an Apple fanatic, but I do appreciate many of the high quality features and programs available on the iPad. Up to now I've been more in the Samsung Android ecosystem with my Galaxy S21 phone and S9 tablet. After spending a lot of time these past few days enjoying the new iPad, I might have to rethink this basic position.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"Great deal on a great tablet","reviewDescription":"I found a great deal: $249 for a *NEW* iPad 9.  I know it's one product release back and it's right up there with buying last year's car model.  But it's new and the fit and finish is perfect.  It was super easy and smooth to set up and configure.  The rest is standard my iPad is great stuff.This is an upgrade from an iPad Air 2.  I'm sure the hardware on this old iPad is capable of much more than it was delivering.  But it's Apple's way of forcing you to move up to a newer platform.  They're not alone - If they were, I'd still be using Windows 95 at work...Bottom line - I got a great deal on a tremendous iPad.*Update*  This was a birthday gift for my mom.  She was the one upgrading from the old iPad.  After just a few days she told me that she absolutely LOVES her new iPad.  I'm happy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Seamless transfer","reviewDescription":"This was for my 90-year-old Mom, who uses it primarily for email and facetiming with her friends.  I don't know about Apple products and was concerned about the data transfer from her old iPad to her new one, but it was very easy.  Obviously, Mom was thrilled.  Her old iPad (Gen 2) had been dropped so often that it was literally coming apart.  It was time.  She is saving it as a backup.  Bless her heart.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Best Value for iPad","reviewDescription":"I wish the entry level iPad had USB-C instead of lightning but it's hard to argue with the value for this tablet.Pros- Fast and runs all my apps- Good battery life-  Fast A13 Bionic Chip- Supports Apple Pencil and Magic Keyboard- Lowest Cost iPadCons- Still uses lightning- Doesn't use laminated display","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Just… AMAZING","reviewDescription":"I’ve had my new iPad by 3 months now and couldn’t love it more. Easy to use, accessible. I’ve used for entertainment, studying, painting, writing. This iPad can really make it all. Completely worth it for the price, updated and still has a couple of years ahead to be used. Really really recommend, especially adding keyboard and pencil. This can totally substitute any laptop or computer for the day to day activities.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Get What You Pay For.","reviewDescription":"This is a great iPad for the price. You have to understand, you are getting what you pay for, you do not plan on doing anything crazy on this is iPad, or you want something for your child. This is a great product to buy them. Obviously i recommend some accessories, but just by itself, it serves my purpose for not taking notes, some occasional games here there, like casual cod mobile or some auto clicker games, and some occasional media consumption. Looks good, very bright, and great inside.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Ubiquitous for a reason","reviewDescription":"I bought this to replace a Lenovo tablet that I had been using for a few years. The Lenovo tablet was okay, but I wanted a larger screen and more built-in storage. Plus, I wanted iOS instead of Android. My phone is an iPhone and after using both operating systems extensively, I just prefer iOS. I use my iPad every day and I'm very glad I finally made the upgrade.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"perfect entry level tablet","reviewDescription":"i love this ipad! its perfect for watching movies and playing games. it runs fast, is very responsive, and the transfer of data from my iphone 15 was not super quick, but not horribly slow (the whole process was maybe about 45 minutes, but that is due to slow wifi not anything to do with the tablet). i got this as somewhat of a cheap replacement for my degrading laptop until i can buy another one, and so i don’t have to lug my laptop around on vacations anymore. the battery life, while not groundbreaking, is very decent and what you’d expect from an apple product. the screen is beautiful and clear. everything runs as smooth as butter, and 64GB of space is more than enough for someone who’s just doing casual stuff like me. i definitely plan on buying more accessories for it like a pencil and a keyboard! it’s definitely going to become my new best friend, i’m obsessed. if you really wanna use your ipad outside of the house in a place you may not have wifi, don’t waste your money buying the cellular one and then adding it to your data plan, that’s such a big waste of money!! use a mobile hotspot on your phone instead, it’s a completely free alternative that works just as well.","isVerified":true,"ratingScore":5,"reviewReaction":"48 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"No se la duración de la batería","reviewDescription":"Solo llevo casi 1 mes con ella y hasta ahora todo Perfecto solo estoy viendo que la batería ya no dura tanto como al inicio me toca cargarla a diario, esperemos que no se siga descargando cada vez mas rapido","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Love my new Ipad","reviewDescription":"I have been using my Apple 14 for all my games and decided to invest in a new iPad and I'm so glad that I did. It  is so much easier on my eyes! No issues at all!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Used one?","reviewDescription":"I thought I ordered a new one, but received what appears to be a used one; the label says \"Thank you for giving a second chance\". Please advice before I return the product. Thank you.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"It works for small applications or just surfing the web","reviewDescription":"I have not had any major problems with the iPad . It's internal memory only allows for a limited number of layers for procreate which is what I use it for but overall it's a nice iPad. Procreate uses alit of power so the battery drains over a couple hrs but just for surfing it's awesome. I will buy another one with a biggerInternal memory eventually.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1667520000000}
{"reviewTitle":"No instructions, no customer support","reviewDescription":"I received the carefully packaged IPad with high expectations of quickly understanding the basic functions and being able to perform them. There was no instruction manual, not even a phone number for customer support. I am very disappointed. Please pass this on and connect me with someone that can help. Since I purchased this through Amazon the local Apple store doesn’t seem to want to help me.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1664841600000}
{"reviewTitle":"Fingerprint","reviewDescription":"I always had a problem with my fingerprint  Couldn't download apps with it. Fingerprint wouldn't take several times. If there was option  to use security code I didn't see it.  I never had an Apple product before.  I am sure it is very good not for me.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"quality","reviewDescription":"Can you believe you buy an Apple  I Pad  then have to spend another $10 to get a user manual. , had I known this I would not have bought it from amazon.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1669939200000}
{"reviewTitle":"Should have just bought a new one at the Apple Store","reviewDescription":"I have no idea what the heck this thing is going after less than a year. Seems to have a mind of its own. Basically a piece of garbage.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1670976000000}
{"reviewTitle":"Ipad","reviewDescription":"Didn’t work returned","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685145600000}
{"reviewTitle":"Battery life is very poor.","reviewDescription":"I love Apple products and that’s all I own but my new tablet loses battery quickly without even being used. My older one is 4 years old and battery life was great until about a year ago which is why I bought a new one. So I don’t understand why the battery life is so bad. Really bummed especially when they cost so much. Not really happy about this at all.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1656374400000}
{"reviewTitle":"Works fine as expected- battery life sucks","reviewDescription":"Prior versions had decent battery life. This one is maybe 12 hours unplugged.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Sound quality","reviewDescription":"I listen to a lot of music on my iPad.  The sound is very tinny on this iPad .  I returned it on June 3, 2022, Amazon received my return on June 8, 2022.  Apple won’t give me my refund until around July 3, 2022.  Goodbye Apple.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1655424000000}
{"reviewTitle":"Unacceptable - Don’t buy this","reviewDescription":"I bought my son this iPad for his bday. It’s broken and won’t download any movies. A very basic feature. This is supposed to be a ninth generation iPad and it comes brand new and doesn’t work. And when you typically have 30 days to return something we only had 15. It was a birthday gift so it was ordered early so he could open it on his birthday. Return policy is ridiculous. A brand new iPad where basic buttons don’t work. There are a few other functions that you can’t even get the button to press. Should be able to download a kids movie. These are less expensive for a reason. They are probable refurbished and being Sold as new.","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Rotten Apple","reviewDescription":"I bought this ipad as a gift for my wife. (She asked for it). I never saw it work. She brought it to me later in the day to show me it was locked (disabled).  I hate Apple products, but I downloaded and installed iTunes on my Windows PC in an attempt to rescue this device from its disabled state. iTunes choked my PC, then it choked itself. Finally got it working, got logged into iTunes, and began an iPad restore. After an hour, I got an error saying it was unable to restore the device. Tried it again. No joy. Called Apple support and they had me repeat the same steps. I told them it wasn't going to work, but they insisted. They told me let the restore run again, and they would call me back in 30 minutes. That was 2 days ago. Haven't heard back from them. The restore process failed (as expected). Now the device is stuck in restore mode. I have repeatedly tried all the google remedies to free it from restore mode, but none of them work. Its still in restore mode, and I can't even power the damn thing off. What a nightmare!!! I've wasted nearly 2 days following the instructions on this time vampire, and it went from bad to worse!","isVerified":true,"ratingScore":1,"reviewReaction":"63 people found this helpful","country":"United States","date":1647302400000}
{"reviewTitle":"Poor quality","reviewDescription":"This is the 4th ipad on this model we bought in the last 2 yrs. 2 died completely just after a yr when apple warranty expired. 3rd and 4th are not holding battery more than few hrs after full charge. One we bought initially lasted for 5 years, so we thought new ones will last long as well, but didn’t happen. Won’t be buying it again.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Very little disc space left after they updated their software","reviewDescription":"Basically no storage space left after all there updates. And of course Apple does not allow external memory. Very difficult returning process from Apple I had to arrange for someone to be at my house for a UPS man to pick it up. That was over 3 weeks ago and Apple still has not issued the refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Blatantly False Advertising","reviewDescription":"Shame on Apple for blatantly misleading people to believe this iPad comes with a stylus and additional keyboard, which it mentions in the bullets AND listing photos. The only reason I bought it. It includes neither, but misleads the customer to believe it does. Returning immediately.\"APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection.\"","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Not A Rich Person","reviewDescription":"Purchased IPad to replace old one. For reasons I can’t understand the IPads wouldn’t transfer data. In fact, the new one would not finishing the update to 17.11. So I ask to return and back it goes received on Nov 16. I have to wait until Dec 2 for my refund. According to the Amazon site my money is going to credited to an Amazon account balance instead of my credit card. I really don’t want to be forced to have to use that money on Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Apple Products Going Down Hill","reviewDescription":"Received a new Apple iPad to replace an older version we owned.  Found new product to be extremely difficult to setup.  Product would not recognize passwords for setup, would not transfer data, would not work as a replacement.  Maybe if I had no other Apple items and was completely new to Apple it may have worked however; if you currently own Apple products, it is a nightmare!  Called Apple Service for help and they too, couldn't make the product work???  Can only surmise that Apple products have become just like Microsoft, very difficult to setup and full of bugs and glitches.  A REAL HEADACHE for the average consumer to buy and use.  I am returning this piece of junk and will use our old iPad until we no longer can.  Then will look at alternatives to Apple as they are no longer the company I once really liked.  Steve Jobs was the secret to Apple's success.  Tim Cook has destroyed Apple and it is clearly apparent if you buy any of their newer products.  They are all much more difficult to use and way overpriced.","isVerified":true,"ratingScore":1,"reviewReaction":"48 people found this helpful","country":"United States","date":1665792000000}
{"reviewTitle":"Do Not Buy!!! Beware!","reviewDescription":"I bought this IPad for my mother for Christmas. I also bought the Apple Care Plus. This IPad is unusable because it heats up and is hot to the touch. I am afraid that it will burn the house down! Apple will not help me either and Amazon will not take the IPad back.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Defective. Amazon wouldn't replace.","reviewDescription":"Bought this as a gift for my son. When he opened it and we tried to set it up, we realized it was defective. Ipad  would freeze, stall out and crash every time without completing setup. Contacted customer service, but was outside the return window, which was apparently only 15 days and doesn't cover defective products.Long-time Apple customer, but this was my first time purchasing through Amazon. What a huge mistake, highly recommend you do yourself a favor and purchase elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"18 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"WOULD NEVER CHARGE - AND RETURN WINDOW WAS ONLY 2 WEEKS","reviewDescription":"Purchased for my husband for Christmas so by the time he opened it and we realized it would not charge, the return window was already closed.  I guess I expected more from Amazon sales partners particularly for what is supposedly high-end equipment.  VERY DISAPPOINTED. Will never buy electronics through Amazon again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Actually I hate it","reviewDescription":"Thought I was ordering new item but must have been used. Already had password. WTF. Had to take it to 🍎 store to get my own pw. Now realize it doesn't have office apps installed. Google something about iworks. Weeks later I'm still trying to install it. Had ipad b4. Don't know why this one so difficult. I want to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"As a Usability Engineer, I can tell you this is just bad design. You're paying for the brand.","reviewDescription":"I bought this because my parents have Apple products and I need to be their tech support.  And good word, is the usability simply AWFUL.  Every app has different navigation.  The \"stereo\" speakers only work in portrait.  Nothing about the system UI is user centric design.  Just awful.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Bad idea! Just go buy new","reviewDescription":"Bought this came into today, installed password 123456 as it’s for my 89 year old mother. Keeping it simple! Turn it off back on and it won’t take the 123456 passcode. After going through the two step motion,  so I know I got it right. Now can’t access at all,  passcode shows different. Assuming it’s still last persons pass code not cleared properly. Might as well go buy a new one as now it’s the return drama wait forever timeframe. Amazon not the smartest purchase route again!","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"Not worth it","reviewDescription":"I had purchase this tablet as Christmas gift for my daughter, it dis not last even a year. I purchased on November 22 gave it to her on December 25th of 2022 and it stopped working completely a month ago. I have try to take it to fix with apple and they are not taking it not sure why or was going on, on top of it not working I am unable to get fix and it hasn't even been a year of my purchase. Will not recommend it sorry.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"Disappointed","reviewDescription":"I ordered this on Prime day.  When I got it there were horizontal lines down the side of the screen.  There was no option to replace it so I could only return it.  It was brand new, I don't want to have to troubleshoot an item right out of the box, that seems like more trouble down the road.  I was so excited now I'm left disappointed.  The Prime deal is, of course, no longer available .....","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Touch screen nonresponsive 25 months old","reviewDescription":"I received this IPad for Christmas from my husband December 25, 2021 and the touch screen randomly became unresponsive January 15, 2024. We use the IPad mainly for the app attached to our baby monitor, so it rarely leave our house.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"iPad was just as described","reviewDescription":"The product itself the iPad was just as described. It just did not work for my purposes. My problem is, although they refunded my money for the iPad. They did not refund my money for the Apple service and there’s no way for me to request that I’ve tried contacting both Amazon and Apple with no luck.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Glitching and very slow","reviewDescription":"Although I didn’t expect much for the price, this thing has been glitching on me since I’ve gotten it. Wont let me draw with my Apple pen half the time and freezes on me when I need it the most. It’s already updated so I don’t see what the issue is, might return it but very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1700611200000}
{"reviewTitle":"Garbage","reviewDescription":"If I could give it 0 stars I would.  Can't charge iPad due to port refusing to take any cables.  Amazon won't give a refund. Worked for all of two weeks.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"No battery life DO NOT BUY","reviewDescription":"I am so disappointed with this refurbished iPad. I bought it as a gift for my girlfriend. The battery life drains to 0% within an hour. We leave it on the charger all night and it barely gets up to 40%. We literally have to charge it for multiple days to get it up to 100% only to see it drain to 0%. Such a waste of money. DON’T BUY.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"Inconsistant","reviewDescription":"I was anxious to receive my new iPad but now I am beginning to regret the purchase.  I read a lot but I am frustrated with this product.  If I have been reading for a while and want to make a change to how I am viewing the page the touch screen function does not work.  It will not allow me to do ANYTHING!  In order to activate the touch screen ability I must close it down and start again.  This is becoming a bigger and bigger problem.  As a result I am using my old IPad, it is reliable.  Sure I could contact Support, return it or whatever but I should not have to do any of those things.  For the price I paid there should be no hassle or problems.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1659398400000}
{"reviewTitle":"Way Over Priced!","reviewDescription":"All my emails did not transfer over appeared as a split screen.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"product out of time","reviewDescription":"In the eyes of 2023, this iPad is definitely out of time...The spec speaks to itself. Only 64GB and 10.2'' screen with no promotion fresh rate, it is only useable for school in my opinion or some light office work.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1682035200000}
{"reviewTitle":"iPad is no longer top of the heap","reviewDescription":"Compared to our Samsung Galaxy tablet from 3 years ago, this newer 9th gen iPad is clearly inferior. The sound is not half as good. Honestly, this is a big deficiency. We played the same song on both at the same time to compare. The screen is good but not as rich, vivid, beautiful and dazzling as our Samsung.  Samsung wins on camera too. Battery life is good, but again, not nearly as good as the Samsung. The processor speed is good, and this is the only plus in comparison. I think we're paying for Apple name and reputation now. The product seems secondary. It is no longer top of the heap in direct comparison.  Sorry, Apple, you're playing catch up now.  It hurts me to state that.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1659571200000}
{"reviewTitle":"Don’t buy!","reviewDescription":"It’s very slow to scroll down or up for that matter. Maybe this tablet only can’t do much with it just wash YouTube!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"NO PENCIL INCLUDED (like the description states)!!!!","reviewDescription":"Very frustrated that the ipencil did not come with it, when it says it does.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686960000000}
{"reviewTitle":"No Pen or keyboard","reviewDescription":"Received quickly. Brand New. Just be warned all though it is written like the pen and keyboard are included they are not!","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Great product, AWFUL shipping","reviewDescription":"We love this iPad as we have purchased before but this item was shipping in a thin Amazon bag. I have no clue if it’ll be returnable after opening and for the cost, you would think they would package it a little more safely.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1680652800000}
{"reviewTitle":"Does not connect to internet","reviewDescription":"Each time we turn on this particular iPad it says there is not an internet connect although it is connected to our home network. We have to restart the iPad each time . It is very frustrating and we don’t have this problem with any other iPhone or iPad","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"How to set it up","reviewDescription":"I can’t get my iPad set up been on I cloud for 2 days now","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"If you get an iPad that isn't wrapped plastic, it is not new.","reviewDescription":"The iPad was used and not in working order.  It was suppose to be new,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Es nuevo","reviewDescription":"Tenía mucho miedo por los comentarios que de que llegaban y no servían, es completamente nuevo, sellado en su caja con su cargador y cable. Me funcionó al 100% sin problemas. Mi hija lo ama, no es pesado. Es ligero.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Love it!","reviewDescription":"Not super high tech like a Pro but definitely gets the job done for the price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Bought refurbished","reviewDescription":"I needed a new iPad with more memory.  This unit is refurbished but you would never know it.  Perfect condition and works like new, I am very happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Got it for storage.","reviewDescription":"I got this iPad because it was much cheaper than getting it directly from Apple. It is a small upgrade from my previous iPad 7th generation 32g and it has more storage 256g. I am happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Great product","reviewDescription":"This is the 2nd Apple IPad that I bought. It definitely won’t be the last.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Can’t find a better value","reviewDescription":"I ordered this for my 5 year old and am so very happy with it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Exactly what I expected.","reviewDescription":"I don’t dislike anything about it. It is perfect for what I wanted and need","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Apple IPad (9th Generation)","reviewDescription":"Purchased for a young girl to use at home. Good quality and a great gift.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Apple is best","reviewDescription":"Using this i pad for almost 7 months. Works perfectly. No issues till now.Go for it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Buy the insurance","reviewDescription":"I bought this in April 2023. It just froze and won’t let me even turn it off or put in my password. Won’t do a thing. I didn’t get the apple care. Big mistake on my part! I expected it to last longer than 6 months… very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"received refurbished instead of new...","reviewDescription":"My box had a sticker on it from \"GoMint Packaging\" and said \"Fully Functional\" after some looking around with the serial number, the warranty was only good until march of next year when I purchased in July, and after verifying with apple, it was a refurbished device not new. I did return it.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Don’t waste your money. Especially if you have large fingers. This was designed by a child.","reviewDescription":"Too many unnecessary bells and whistles that aren’t needed and definitely get in the way. I can’t even reduce the screen. There’s too much crap. In the way. Unnecessary information being displayed redundant unnecessary things are programmed into it. Shiny bells, and whistles. It’s meant to sell you advertisement. Get anything else.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Will not charge unless I reboot","reviewDescription":"After a recent iOS update the tablet will not charge unless I power off and restart.It is a weird coincidence that my wife’s iPad Pro started doing the same thing at the same time.I have reported this on the Apple Community, where there are hundreds of similar complaints, and no answers.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Apple 10.2inch iPad","reviewDescription":"Will not be buying anything  like this Ipad every again.  Very difficult to use and nothing like using a laptop.  This was a complete waste of money.  Did not come with pamphlet and it hardly does anything that I was hoping for.  I wanted something for my room in the evening that was easy to handle and fun to use and check in with the other websites which I never got to do that either.  I made a very bad choice.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"This iPad is defected cracked screen I didn’t even want to give 1 star","reviewDescription":"The screen was cracked a little when I got it but I work 2 night jobs 7 days a week and I finally had time to open it and it was shattered more just from sitting on my desk for the price I’m very disappointed and upset I would like to send it back!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696896000000}
{"reviewTitle":"Bad phone","reviewDescription":"I was surpised by the bad quality of this phone . Battery 8s almost dead and a lot of scratches. Very bad choice","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"Quit Working","reviewDescription":"Paid $300 for an iPad for it to quit working due to a software issue within less than 4 months. Ordered and delivered on 11\/5\/22 and the return window closed 1\/31\/23 and it quit working on 2\/22\/23. Now I’m out $300+ and cannot afford to replace it. I am a widowed mom and this was my sons iPad. I’m extremely disappointed. From now on I will only order directly from Apple.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"Drops off internet frequently.","reviewDescription":"This might be my fault but kicks off internet frequently. Slow loading..frequent buffering. My other devices in home don’t have this problem only my new iPad so it’s not my internet service. I hate to have to pay tech repairman to correct problem","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"It was NOT worth the hassles to receive!","reviewDescription":"It was NOT definitely worth the hassles to receive!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Defective piece and amazon handled the return terribly. Still haven't received my refund.","reviewDescription":"The item came with a squeaky and defective home button. Amazon advertised that this is 'replaceable' but in reality they informed me after buying it that it is not eligible for a replacement only eligible for a replacement. I called amazon, over 10 times, escalated and have been told that it will take me a month to get my refund. Terrible service, I would recommend never buying any electronics from amazon. Their return process is awful and customer service even hung up on me. The customer service is on the decline at Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Worse Tablet","reviewDescription":"Need to enter password three times to install one app. Apps don’t auto update.App installs eventually stopped working 6 months in (free or otherwise). I’ve done everything I could find, from signing in and out of Apple ID in the App Store to even using a different account. The device is completely up to date, on the latest iOS. Apple is no help.Do not buy an iPad. App Store is very broken. Installing apps is a critical component to a smart device.I daily drive an iPhone and it has none of these issues.I’d recommend an android tablet, you’ll never have this kind of issue, and worse case you can still sideload.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1683590400000}
{"reviewTitle":"FALSE ADVERTISING!!!! BUYER BEWARE!!!","reviewDescription":"Items is NOT what's described.Do not trust what's listed under \"About this Item\".It's clearly untrue.My particular item is described as including: \"ABOUT THIS ITEM-APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection...\"NOPE!!! LIES! What a wast of time. Now I have to return the accessories that would have worked with the items in the description that were not included. PISSED! Hopefully, I can at least save someone else the this incredibly frustrating experience. This is complete BS. If it's not in the package, do not detail it in the listing!!!","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1682899200000}
{"reviewTitle":"Broken after 1 month","reviewDescription":"iPad no longer connects properly to its own charger. We bought this about 1 month ago. I now need to go through Apple services to see if anything can be done. Don’t buy this ipad, and definitely dont buy any ipad through Amazon. This ipad is total crap. Amazon does not permit returns after 15 days. And the Amazon support staff lied to about the possibility of a return. They wasted hours of my time in their \"chat\".","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Ipad dosen't work properly.","reviewDescription":"This Ipad worked for three months, now the screen goes black while using it, the mail wont delete most of the time, and the dates change when ever. I would like to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Doesn’t work.","reviewDescription":"This is so old it wouldn’t even update to the latest iOS so I couldn’t even use it. It was a waste of money. Don’t even know why this is even on here.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Annoying product","reviewDescription":"Played one game of new state mobile and it crashes so much from getting too hot. Put fan on there gets too cold and crashes . Or it can't handle the game graphics and immediately crashes waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Screen has died on me. A week after Return expired!","reviewDescription":"This refurbished IPad should have been ditched ! Thd screen started to glitch, flicker, blink , one week after Return by Date has expired! How nice! Now I don’t know what to do with this clunker after spending a cool $300 on it! Any advice ? Please!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Cannot charge","reviewDescription":"iPad charging port has something stuck in it preventing a charger (the one that came with it) to insert and charge. I cannot do a factory restart due to the iPad being completely dead and unable to charge.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"defective Product","reviewDescription":"We purchased this in October as a Christmas gift. The product is completely defective (per Best Buy Geek Squad). No way to return since it’s past the return window. DO NOT buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Great I-Pad","reviewDescription":"This is not the new version of Apple’s IPad but it is great for the price.  Well worth the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Good Deal","reviewDescription":"There was nothing is disliked about this productIt arrived in good shape no scratches at all o have been enjoying my iPad and I am very pleased with it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"This is a great product at a reasonable price.","reviewDescription":"My mother, who is 94, needed a replacement for her aging MacBook. All she needs to do is be able to watch her church service, and read email. This device is perfect for this.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Apple does it again, the best of Apple in a great price!","reviewDescription":"I have had my iPad 9th Generation 64GB Wi-Fi since the end of November, 2022. It has been about 5 months. I upgraded from an iPad Air 2 32GB Wi-Fi (2014 model) that I had for almost 6 years! I have to say that there is a reason why Apple iPads are sold at such a premium price. That's because they provide valuable practical use for far longer than the vast majority of what is available in the tablet market.With that said the 2021 iPad 9th Generation is a base iPad with a limited amount of fancy features and a dated iPad design. Quite frankly, I actually use my iPad on the go and all of the iPads I have had go directly into an Otterbox Defender case. So I hardly notice the little aesthetics in design when my iPads area always in an Otterbox Defender case.I won't make this review long and will highlight the particular reason why I feel the need to write this review at all. I would say there's three top reasons why I believe the iPad 9th generation is excellent: 1. Good CPU performance\/64GB base memory capacity, 2. Value pricing, and 3. Apple Pencil\/Freeform.1. CPU performance is good with the A13 CPU from the iPhone 11. I am confident that I will be able to use this iPad for at least 4 more years, if not 5. I bought my iPad Air 2 (2014 model) in 2016 and it was supported with OS updates up until iPadOS 15, which is a total of 8 years. But the iPad Air 2 was among the longest supported iPads in Apple's tablet history. So it is not likely to be repeated. But I think that the iPad 9th generation should be supported for at least 6 years, 2021 to 2027. Plus, the 64GB base capacity is excellent for my basic use of the iPad.2. The pricing for the iPad 9th Generation 64GB retails at $329.99, but it is often for sale at $269.99. That's how much I purchased it for during Cyber Monday 2022. It has been on sale for as low as $249.99 at some other retailers as well. So overall, the pricing is very affordable for a device this capable with support for many years to come.3. I know that the Apple Pencil has been out for years, but I have only now tried it. It was not supported with my iPad Air 2 (2014 model) and I never gave it much thought as being useful to me. I always thought that the Apple Pencil was geared towards artists, which to some extent it is. I tried the Apple Pencil on my iPad 9th Generation about a month after getting mine. It was a revolutionary experience for me. I have been looking for a viable substitute for a whiteboard for the longest time. But there is not any real replacement for what you can do on a whiteboard. The Apple Pencil with FreeForm is the closest that I've come to the experience I get on a whiteboard. Although, I do still use a 4'x8' whiteboard for some brainstorming sessions, the Apple Pencil has afforded me to do some basic brainstorming in FreeForm. This is a massive benefit and I can only see Apple getting better with its FreeForm app. Not to mention app developers releasing new apps to take advantage of the Apple Pencil for brainstorming on a virtual whiteboard.Overall, I highly recommend the iPad 9th Generation.","isVerified":true,"ratingScore":5,"reviewReaction":"314 people found this helpful","country":"United States","date":1679788800000}
{"reviewTitle":"Muy útil","reviewDescription":"La tablet la necesitaba para ir haciendo anotaciones, registros en el trabajo. Es justo lo que esperaba y funcion{o perfectamente.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"A very nice replacement","reviewDescription":"Replaces an Ipad from several years ago. Screen is a bit brighter. Battery life is substantially improved from earlier model.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Apple iPad","reviewDescription":"Don't know about battery life yet as it was just recently purchased.  My husband says he is happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Apple is the best","reviewDescription":"Very nice, but I should've returned it, I found my husband's iPad here at home. He has just passed away.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Good price","reviewDescription":"I bought it for my son, I will order one more for my other son who will turn 2 soon.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708646400000}
{"reviewTitle":"Great","reviewDescription":"Finally had to purchase another one. Its nice to have a new updated one. Came in fast and packaged well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"It’s an Apple","reviewDescription":"Apple quality throughout. This is Apple’s trailing edge tech so don’t expect lots of advanced features or performance. But if you need a solid basic iPad…this is it.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"The screen-to-body ratio is so low that you can tell at a glance that it's an outdated device.","reviewDescription":"The iPad9 design is outdated. It doesn't use the latest full-screen and narrow-bezel technology, and still uses round-dot buttons for a relatively modest appearance and low screen-to-body ratio. This is really intolerable, and at a glance you can tell it's not from this era. iPad9's A13 chip is actually okay, but the 3GB of RAM is really too small in today's eyes.But if you're just looking for a tablet to watch videos on, it does do the job perfectly well","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Was not engraved","reviewDescription":"It was not engraved as described","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Love apple","reviewDescription":"Pin the tail on the iPad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Good price","reviewDescription":"The item should be new. But there is a tiny scratch on the cable port, which makes me think this maybe a repacked item from return. Anyways, it works fine and the price is good. Hope I can use it for at least two years.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1702252800000}
{"reviewTitle":"Pretty Happy.","reviewDescription":"I really needed a new iPad and saw this one.  The price was good.  I can’t say anything bad except the battery life is far from all day.  I’ve been trying to run the battery down completely before charging it.  But I’ve been playing games one line for just over 2 hours this morning and only have 36% left.  This ad is very misleading in that respect.  Overall I’m pleased.  I just wish Apple wouldn’t say things they know are not true, unless there is a way to keep battery life longer that I’m unaware of.  This is my 3 rd IPad.  So I am a devoted customer.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Nice but returned","reviewDescription":"I bought the 9th Generation for its price on Prime Day.  I had to upgrade it to download from my iPhone 13 but that wasn’t a problem. After the upgrade it wouldn’t download my data from the Cloud so I returned it.  I was not comfortable using it compared to my phone.  I’m 71 and maybe not iPad ready.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Not Bad After All","reviewDescription":"Being a Windows\/Android user, the iPad takes some getting used to.After some internet searches, I was able to familiarize myself with its nuances.I use it mostly for annotating PDFs for research work. The screen and its color are outstanding.Would I buy it again? Not sure yet.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Great deal","reviewDescription":"I just received my IPad this morning, but I love it so far. The battery is not as long lasting as newer ones, but that is to be expected with apple products. Just put it on low power mode and you’ll be good. I bought this IPad for school, and I am so excited to use it. It came packaged nicely and had no defects. I am very happy with this purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Good product but shipping is slow!","reviewDescription":"This is my second time to buy this iPads again! The quality is super cool! For the first one which I bought two years ago, somehow the battery is running so fast only last one day. The one thing I will complain about it is that the shipping is very slow. It takes two weeks to deliver event I have prime.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"iPad","reviewDescription":"Learning curve for sure. My second IPad  I’m sure I will love it once I get it totally set up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"I like it","reviewDescription":"This is my first pad anything. Didn't really need one but it is sure handy to use wherever I go.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"I’m bad for not researching first.","reviewDescription":"The first problem is I thought it was like my Apple 11 phone but I can’t get them to coordinate","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"very slow for some reason.","reviewDescription":"Kind of slow for some reason with IOS 16.6. very sluggish performance. front camera quality is not good either","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"IPad Review","reviewDescription":"Although still in learning mode operationally, the battery runs down pretty fast during usage.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Not much of an upgrade for me","reviewDescription":"I had an iPad Air 2 (2014 model) and thought  it would be great to upgrade to a newer model. The A2606 has a longer battery life, but I didn't find it to be faster for what I use it for--basic email, apps and internet. Then sadly, the new iPad fell two feet from my lap to the floor and the screen shattered. Replacing the screen would be only $20 less than buying a whole new one so I'm not doing it. Fortunately, I kept my old iPad.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1680912000000}
{"reviewTitle":"Great IPad","reviewDescription":"This iPad is great, works well and easy to use.  The only reason I give 4 stars is because it came everything set to Cupertino, CA.  I deleted the location but the weather couldn’t reset.  I had to spend hours trying to find a way to delete that weather location with no luck.  I was about to take it to an apple store.  I even googled several ways on what to do and kept trying different alternatives until I finally got it changed to my location.  That was a waste of my time that took away my excitement of enjoying this nice iPad from the start .  After all this inconvenience was solved, it works perfectly.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1674345600000}
{"reviewTitle":"Great clarity","reviewDescription":"Screen is very clear and was easy to clone iPad being replaced. Was hoping battery would hold charge longer. One con is WHY does Apple insist on having a different size on every charger?","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"it doesn't have a flashlight","reviewDescription":"Perfect for my needs as far as use.  It doesn't have a flashlight and it needs a different charger than my last iPad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686787200000}
{"reviewTitle":"Buy it","reviewDescription":"If you haven’t, this is your sign too! Buy it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Still not know how to access the internal storage...","reviewDescription":"Got an iPhone 6 (used, bought 4 years ago): best phone I've never had (still using it), that was my first Apple's product. Thinking that an iPad would be a good choice while traveling: very disappointed:  1 - No possibility to add an extra memory (microSD, for example), but this problem is well known...  2 - Difficulty to access to the internal storage: after a month, I'm still not know how to do it.Right now, my iPad is only used to access to the Internet: so little for such a beautiful product.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"The black edge of the screen could dock an aircraft carrier!","reviewDescription":"This screen-to-body ratio is really ugly .... It's understandable that it's a product of 2021, but it's really ugly. And the display is still not translucent enough for today's eyes, and the price is not cheap. If it wasn't for ios I would probably go with an Android tablet.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Reward points refund","reviewDescription":"I paid the money with part of my credit card reward points, about $35, but why I can't get my reward points refund when I returned this item. And I didn't see any warning information about it when I was trying to return. Too bad.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Won't open anything the first time I turn it on.","reviewDescription":"I bought this iPad on May 10, 2023.  I've enjoyed using it for the most part, but most of the time when I turn it on, none of the apps will open.  I have to turn the iPad off and turn it back on.  The second time, the apps work.  It's very frustrating.  It started this about a month ago, and I don't think it should be doing this as new as it is.  I'm sure it's too late to return it.  I would appreciate it if someone in Customer Service would reach out to me to see if anything can be done.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Couldnt get re-used to having a home button. Ittook forever to power on... returned","reviewDescription":"see headline","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Keyboard not correct.","reviewDescription":"Not the best bargain for sure especially the fact that the keyboard has the y and z reversed so typing is a pain as you have no choice but to look at keyboard while typing","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Returned but No refund !!!!","reviewDescription":"The tablet worked fine I'm sure but seemed too technical for me.. I am not very tech savvy and don't know anyone near me that is.. I just needed it to be more user friendly.. turn on and go.. it wasn't so I returned it on the 16th of July, it's the 9th of August and I still have not received a refund. I texted customer service and they never answered back! Where's my refund???","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"No game changer for me","reviewDescription":"Don't let anyone fool you. If you're used to working on a laptop or desktop, such as an iMac, an iPad will seem like a toy. One that can be really frustrating, baroque, limited & time-consuming. On the other hand, if you want something for note-taking, this would be excellent along with an iPencil. It has a native notes app, plus there are many note-taking apps to add, and really good ones like Notability and Good Notes. Also fine for watching movies or playing around. Beyond that ... well, I wish I'd gotten another iMac instead. As for reading, I have an 3-year-old Amazon tablet that was super affordable on sale, and I like reading on it better than I do reading on an iPad. (Kindle app seems better on that too, and I can see my collections well—they are sized way larger.) IPad really is A PAD as far as I'm concerned, and excellent for that, but forget beyond that.If I change my mind in the future, I'll revise this review.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"Died after 7 months","reviewDescription":"I my ipad worked great until it didn't. Without any indication of something going wrong, one day it just never turned back on. It just suddenly died. I pad never dropped and was in a really good protective case. I tried the online help but I got no where with that. To send it for repair would cost me $249.00 and with shipping and other taxes, it would cost more than just getting another ipad. If anyone from Apple is reading this, please stand by you product and replace my ipad without me having to jump through hoops and spending extra money on a product that is less than a year of use. Please Help.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Battery life is not that of a newer version iPad","reviewDescription":"This is a nice iPad and fit my present budget. As many have suggested, the battery life is not very good. It is acceptable for me as I only use it at night for Bible reading and then playing one hidden object game. But after 1 hour it is down to 75% - to me that is not a good battery. Maybe I'm wrong. I could accept 85%, but this is draining too fast...?","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"It works!","reviewDescription":"I was a little worried about the tablet not working, but its perfects. I can do homework and watch movies etc. I highly recommend it ❤️","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Love love love","reviewDescription":"This past summer I spent A LOT of time alone while my fiancé was serving in the military. My TV broke very suddenly and I went for a while without any way to keep entertained. I bought the iPad mostly to watch TV before bed, but now I use it for a lot more. Wedding planning, budgeting, gaming, streaming; I use it for pretty much anything and everything. The battery life could be a little bit better, but overall I am very happy with the iPad and the many uses it has for me!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"ipad","reviewDescription":"I got a used one and it work just fine like it was new I’m im love with it","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Very good","reviewDescription":"Easy to use. Lightweight. Take it everywhere I go to do my work. Fast charge when battery is low.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Bought it for my 6yo girl","reviewDescription":"It gets the job done. Even in 2024 it feels very fast and responsive. Perfect tablet for a kid","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Working perfect, no issues whatsoever!","reviewDescription":"Its an iPad, just works - no issues - connected to PoE 24x7 for the last one year -","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Lo bien que me trataron y la paciencia que tuvieron","reviewDescription":"Me encanto todo y esos productos fue por aniversario de mis padres que cumplieron 64 años de casados","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Works great","reviewDescription":"Bought for my wife for Christmas. Works great for her to watch her shows and surf the internet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"IPad delivers","reviewDescription":"This ipad has a good long battery life.  It feels comfortable and is a good screen size.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Good so far.","reviewDescription":"The Ipad is great so far, just as the listing.  Looks brand new, works great, battery life seems perfect.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Apple IPad !","reviewDescription":"Such a find.  With the increased memory I won’t run out space too soon!  I absolutely love the IPad!  It’s big enough to see small print.or pictures.  The portability is awesome!  Just grab and go!  I loved all of the features on IPad!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Great IPad for the money.","reviewDescription":"Bought this iPad because mine died.  I used it a lot for reading.  Battery lasts a long time which is great my old had to be charged twice a day.  Love it so far.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"The setup instructions are vague. Had problems initalizing unit.","reviewDescription":"Once working, it is great except having a problem with the spacebar registering my tap. Might be because of dry skin. Otherwise, it is fast for my needs. The set up time took a couple of hours because it had to install the latest ios. Once up to speed,, just turned on Bluetooth, set the old and new pads next to each other, manually installed(forget that placing the old pad over the new one) and the contents were copied within 30 minutes. My old  pad was gen 4 with a failing battery. Cheaper to upgrade than to pay for battery replacement.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Probably the best on the market","reviewDescription":"I had a Samsung Galaxy for years, there is a very slight difference in image going to iPad, otherwise it is the best for lightweight, functionality, battery life. Would be difficult imagine there being a better tablet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"great product","reviewDescription":"I bought an iPad Air first but it’s too good for me, lots of fantastic functions I may never use. So I returned it and get iPad 9, which is perfect in every aspect.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Enough Oomph for My Wife","reviewDescription":"Obviously this isn’t the latest iPad or the most power but it’s perfect for my wife. She’s not a heavy user but finds it completely adequate for attending United Way board meetings on Zoom or for emailing and messaging. She loves the screen size. I thought the price was amazingly low. A real value buy.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"I don't like Apple, now I do!!!","reviewDescription":"I had to buy this items because I was gifted a photo booth, only issue it worked with an Ipad which I did not have, So I brought this form Amazon and I'm so please with it now I use this for surfing and streaming to TikTok. It's really fast.  I'm still getting use to Apple the way you navigate, but it's super responsive.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Very good deal 👌","reviewDescription":"Recommend it , easy to set up, honestly its a great price for the fact its brand new ... i saw some for the same price but used or refurbished.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"I wanted a new iPad very badly!","reviewDescription":"An iPad with 256gb memory will be far superior to my 2018 generation 4, with 32gb. Wonderful. I just chose the wrong case. Read reviews carefully. I got this at a terrific price during the President’s Day sale. It was the same price as it was at Christmas! I’m so thrilled.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Love this IPad","reviewDescription":"I was a little hesitant to purchase but I'm so glad that I did.  The reviews were spot on and I am very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Got it renewed Unfortunately about 14 months after I got it the scream died","reviewDescription":"Scream died after about 14 months the warranty was for a yearVery very disappointed and very mad.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Ipad 9th generation","reviewDescription":"New item and could not get it thru set up. Ipad started using voice commands and just kept repeating same thing over and over.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"Tarda una eternidad para cargar","reviewDescription":"Tarda una eternidad para cargarEl cargador que mandaron no es el original de AppleEstoy pensando en regresarla","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Thought I was getting a tablet","reviewDescription":"I thought I was getting a tablet but lack of knowledge on my part I ordered the wrong item and got the same size as my ipad. I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685145600000}
{"reviewTitle":"Disappointed to say the least b","reviewDescription":"This iPad doesn’t hold a charge very long…certainly not for 10 hours and sometimes it doesn’t charge when it’s plugged in. Extremely frustrating and very disappointing.  I know I specifically bought a new IPad but I coming back to this purchase to see if there’s hidden message that it’s refurbished.  Very unhappy","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672185600000}
{"reviewTitle":"Ipad","reviewDescription":"Don’t know if this is new or reconditioned because we bought one and it would not connect to any servers","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Make sure to check for dead\/stuck pixels!","reviewDescription":"I didn't notice it at first, but when I turned on dark mode, I immediately noticed that my iPad has a dead\/stuck red pixel (see pictures). With the brightness turned up, it becomes even more noticeable. I tried the various videos on YouTube, that is supposed to fix the issue, but none of them worked. So make sure to check your iPad, to ensure that you don't have the same issue. I'm going to return this, because I don't want to do a warranty claim and get a refurbished iPad, when I just paid full retail for a new one!","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1639008000000}
{"reviewTitle":"Hard to set up. No directions!","reviewDescription":"Took me 5 days to set up  before returning it!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Misleading","reviewDescription":"Was not aware this ipad was only for WiFi only totally a waste of money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Operating instructions very minimal","reviewDescription":"I just mailed to my family a much cheaper pad because of the operating manual was very vague. But this I Pad came with one sheet where u needed a magnifying glass to read. Basically only stated how to turn on off. Thank you Apple. I'll try and find a young tech kid to help me boot it up correctly. No more Apple for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660608000000}
{"reviewTitle":"Wouldn’t sync","reviewDescription":"I tried to set up iPad and sync with my iPhone. I tried several times and wasted many hours. Customer service was never available to assist. I decided to return. I have been waiting since Nov. 26 to get a refund. iPad was received by Amazon since Dec. 1. As of Dec. 24, still have not received refund.Finally ,refund is pending with credit card company on Dec. 26. One month after stating the return\/refund process.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"It’s okay battery life is terrible","reviewDescription":"Battery terrible","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Remote management won’t let me setup my new iPad","reviewDescription":"Update: Contacted the seller and they were able to walk me through removing the block. I’ll change the stars to 3, because I still think a wipe should have been done before selling the iPad and because I spent quite a bit of time on the phone with Amazon and texting with the seller. But the issue was fixed and iPad is working.Purchased this refurbished iPad on Amazon while I was away abroad. Came home, picked it up and left again, only to find out I can’t set it up at all, because it has remote management configuration on it, which, according to Apple, hasn’t been released by the previous organization-owner. Basically, the iPad that I thought will be mine is remotely managed by the previous owner (never mind that it is supposed to be fully refurbished), and I can’t go further than turning it on.The iPad is useless, might as well hammer in nails with it, it doesn’t work because of this remote management thing. Amazon refused to help, because the return period has ended (“nothing we can do” was their exact answer). I’m furious. Never thought anything like this could happen with Amazon and their partners. Do not recommend ANY refurbished electronics from Amazon, and by how they are handling this, will most likely never buy anything from them at all.","isVerified":true,"ratingScore":3,"reviewReaction":"27 people found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Charging cord stopped working already!!","reviewDescription":"My daughter loves the iPad for use at college, but after only 4 months the charging cord stopped working!  There was no damage or accident to the cord, so this is frustrating. Is Apple going to do anything?","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Scrolling issue","reviewDescription":"This is the second iPad I’ve gotten that has scrolling issues…screen jumps or freezes when scrolling. Very frustrating for me and I’ve returned them on the advice of Amazon support. What does it take to get a functioning iPad?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Transparent transfer of data","reviewDescription":"I found restriction on data transfer between the IPADS. Not all items transferred and manual input was required.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Okay","reviewDescription":"Okay","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Small writing on what ever papers that cane with this item","reviewDescription":"The writing on the papers that came with this item is very, very small. I even have trouble reading it with a magnifying glass.I have not been able to use it much, yet. I am not computer-savvy, and I am having problems getting my new ipad going.What happened to sending manuals and\/or instructions with the item? I mean just enough information to get everything up and running with writing large enough to read.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Uninspiring IPAD with lots of issues","reviewDescription":"I bought this IPAD with high expectations, however, it has done nothing but disappointed.  First, all of Apple's requirements to make an Apple ID, password, passcode, is extremely dragged out.  The process to set up the tablet is extremely long and having to remember all the passwords are difficult.  Second, a lot of the screen is actually blacked out on the side.  I wanted to see the whole screen while watching movies and videos, not parts of it.  Third, some parts of the IPAD is unresponsive.  I had to click multiple times in order for the tablet to register what I was trying to do.  Fourth, the fingerprint requirement is a pain.  When my son wants to download an app for gaming, I have to go over and have it take my fingerprint.  An annoying and unnecessary step.  Fifth, storage is horrible when you download regular games.  I suggest buying the more storage option.  Sixth, the battery is terrible.  I was expecting the battery to rival Samsung Tablets, however, that was not the case.  The IPAD dies quickly even when on low power mode.  Not what I was expecting when I spent hundreds on a tablet.  Onto a more positive note, I do believe that the built quality is up to standard and it was nice that Apple included the charging brick and cables.Pros:1. Built quality is good2. Accessories (charging brick and cable) were includedCons:1. Long set up times2. Very large black bars on the side3. Some spots were unresponsive unless repeatedly tapped on4. Fingerprint system is a hassle5. Storage for apps is horrible6. VERY VERY short battery life!","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1670976000000}
{"reviewTitle":"Screen resolution is very good","reviewDescription":"Minus: controls on screen too small and hard to hit.  No way to make it look like a bigger iPhone, for people with bad eyesight - they just cram more stuff on screen assuming everybody has a magnifier glass handy when using the tablet.Also, icons are too small for the screen size - you get a lot of screen real estate not used around them, with no way to change the distance between icons (to get more icons per screen) or make them bigger.DucDuck and other browsers \/ apps have control boxes which are too small and not responsive.Plus:  worked out of the box, good networking, good audio (especially considering the thickness), good range of accessories available on the net","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Battery life","reviewDescription":"SUCKS. I’m happy with price and product, but the battery life is horrible (they say long battery life) wrong. I’m gone all day and not using this iPad and the battery drains… takes forever to charge so there that 😵‍💫!!  Is it worth it?  Sorta .. price is right battery life sucks 🤷‍♀️","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1686355200000}
{"reviewTitle":"Internet Connectivity issues","reviewDescription":"My kids bought this for me for Christmas, 2022.  It was easy to set up, however whenever it sits for a while, you have to reboot in order to get the internet.  Many games just say \"not strong enough internet connection\"  I'm not sure why since I work from home, my phones and my laptops have not problem with the internet connection.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"Check accessory compatability","reviewDescription":"It's really not great that incompatible accessories are listed on the same pages as ipads they don't work with, with the option to add to cart.  If it's not compatible why is Amazon suggesting accessories be added to your purchase of an ipad they won't work with? This seems like it might prey on unwary consumers, not to mention the inconvenience of having to return this crap now, and wait for a refund so I can buy the pencil that should have been suggested in the first place.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"I thought this would be able to work in the sunshine outdoors","reviewDescription":"Disappointed that I could not use outside.  Guess I didn't explore opportunities. I'm keeping it because I think my 2017 android, samsung, showed some signs of taking too long to react.  Not sure this one yet","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"Missing parts","reviewDescription":"I like your laptop, but I was expecting to get the keyboard and pencil as described","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Ipad","reviewDescription":"Battery life sucks, won’t take a charge. Not a gppd value.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"I prefer Android over Apple","reviewDescription":"I didn't want to buy an Amazon Fire tablet so the next cheapest thing was an Apple Ipad.  Several things I don't like about the Ipad.  It constantly askes for your fingerprint or passcode every time you attempt to download an app.  If you don't have other Apple products, you have to set up your Apple account, two more passwords, one for your tablet, one for your Apple account and since it's not powered by Android which uses Google to store passwords, you need to locate your saved passwords from Google and retype them.  I also don't like the interface.  I have to learn everything all over again.  It's a hassle.  I'll stick with Android next time.  Also I had to buy a separate charger that had a USB connection because I needed to reset the Ipad to factory settings when I forgot what my passcode was after not using the Ipad for a month.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1641340800000}
{"reviewTitle":"Wrong tablet","reviewDescription":"What I received was a 5th generation 10.9” tablet which is why the case I bought for it didn’t fit. I like the tablet but it’s not the one shown. I am rating it 3 stars because of the incorrect information which resulted in the inconvenience of identifying the problem and reordering the correct case.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1682553600000}
{"reviewTitle":"It won't turn on","reviewDescription":"I was so excited to get my first iPad. I couldn't turn it. I plugged it in thinking it could of be dead. I charged it then it turned on. I tried to turn it on nope without it being charged it will not turn on. Otherwise I like it. Kinda sucks needed it for traveling and if there is no outlet.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Great product but Missing pieces","reviewDescription":"Love the iPad but didn’t come with the pen or keyboard as advertised. I have to return the iPad & hope it comes with the item the next time around","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Very nice, and the ship time was amazing!","reviewDescription":"Like the ease of use. Love the screen and the fact it came quickly. Good job!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Fantastic device at a great sale price","reviewDescription":"Our 3rd iPad and the 9th gen does not disappoint.  Even the simple things are so well thought out! Opening the box is even a wonderful experience. Finding on sale in Feb was what tipped the scale to purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Still working","reviewDescription":"My son uses all of the time. Had to have it fixed but works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"It works.","reviewDescription":"Needed a new IPad, does what I wanted it too, which is just play games.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Great battery life - easy to use","reviewDescription":"Like all Apple products, the setup and use of this iPad was easy and quick. We bought it for our toddler and we were able to set up a child iCloud account so our notes, contacts, and reminders didn’t need to sync to our child’s device. Parental controls are useful and have lots of options. The battery lasts for a long time - a few weeks with about 30min of use per day.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Really great","reviewDescription":"My kids love this iPad can’t seem to get them off of it .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Gen9 iPad","reviewDescription":"Very pleased with the iPad! I got 2 of them my kids love them","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great ipad 👌","reviewDescription":"This was a gift for my hubby ❤️He is going to use it for business.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Great price.","reviewDescription":"Love it, very fast. Updated from my old one and very happy with price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Awesome purchase.","reviewDescription":"My ipad minis battery never stayed charged.  This ipad has great battery life.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
