{"reviewTitle":"Poor manufacturing process (lacks correctly sized drill holes for mount) poor service","reviewDescription":"This is the most frustrating purchase I made. As work demands for growing for a dual monitor system upgrade, I proceeded to buy this Samsung product. Upon arrival I noticed something was off, the drill holes were not correctly sized, I nonetheless figured it was minor and the mount \"set in place\" , but felt wobbly\/off. Over time this only got worse, the monitors side by side would not form uniform line, one leaning out forward and curving, obstructing the other. It didn't help that I had an insanely busy work schedule where it was hard to immediately address this, I figured I'll very soon exercise the 1 year warranty. I call Amazon first (since I'm Prime, thinking they can help me), and the first chat rep says he will help me, but then lies and gives up says they are closed (Samsungsupport is 24\/7 so not true) and then asks \"do you want me to follow up w\/ rep\", only to shortly retract their statement saying I need to. I get busy again,  a few days go bye, and I try the Amazon again who does the same tactic (initially offers to help, and pretend to contact Samsung, but then retracts and says and then says I can call Samsung my self. Fine, no issue, I call Samsung, and immediately he gets defensive and vents his frustration about prior experience with Amazon about this and how they handle these situations saying this is on Amazon who damaged it during delivery. He demands I get an Amazon rep on the call, which we do (by now 1 hour has passed on call), amazon rep comes on and they go briefly at it, until amazon says they'll refund it. Initially I am relieved, but then I'm told I got to pay 2 restocking fees for both monitors which were damaged before they got to me (likely during production).  The 1 star review is for both Samsung and Amazon service in this particular order and being bounced around by both with neither party willing to help each other. Until I can get rid of these horrendous dual mounts, my neck will continue to strain, wish me luck and will try again to take this up with customer service.  PICTUERS TO COME SOON!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1648252800000}
{"reviewTitle":"Broke down after 16 months","reviewDescription":"After sixteen months of normal PC use (no gaming) the monitor began producing flickering and densely-colored horizontal lines.  Got progressively worse and there was no troubleshooting fix.  Samsung's response:  'you should have bought the extended  warranty.'  They gave us the name of a repair shop that 'may or may not be able to fix it' and it would certainly cost almost as much or more as we paid for it to begin with.  So we have to take the loss and will buy a Dell.  Never a Samsung again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Serious pixelation","reviewDescription":"I bought two of these and have connected them to a 2021 Macbook Pro with the M1 chip via 8k HDMI 3ft cables and this is the image quality I am getting running at 1920 x 1080. it feels like the year 2000 over here. I guess I need to spend more money that I did. Samsung confirmed all my settings represent the best picture I should be seeing. The monitors look nice... it's really too bad.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Monitor won’t power on after 11 months","reviewDescription":"This monitor has been fine, but quit working. I bought it on Nov 25, 2022.  Gave it as a Christmas present. Today, Dec 17, 2023, the monitor will not turn on. It does not power on, we have followed the trouble shooting guide and changed all the cords, etc.Samsung says it is out of warranty, which is true, probably by a couple of weeks, but has not been used even one year.Customer service says we can ship it back and get an estimate for repair after it is received. I paid $100 for this monitor. I doubt this will be cost effective.Overall, Samsung should focus more on building quality and stand behind their products. Totally disappointed with Samsung. This is not worth the money. I will not be buying Samsung products in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"screen was great until it wouldnt turn on","reviewDescription":"it kept flickering between HMDI and Analog and the screen was black.  Stopped working all together.barely had it 3 months.  Did the flickering a few times while i was trying to work and then wouldnt work at all.  Lost time at work, while I was working or trying to work OT.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Toggle switch is junk","reviewDescription":"First time I used it, it was great. 4 months later I get a black screen. Tried to use the toggle switch...what a piece of garbage. I'd get to something that resembled instructions and the thing kept disapearing. I pressed enter, up, down, lest and right. Nada, zip zero, nyet. I did try different hdmi cables...not the  cable. I bought 2 of these. I'll update when the 2nd one blows.Don't waste your money. The only monitor I've had that lasted was a BENQ. pRICY, BUT WORTH IT.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"DO NOT BUY, YOU HAVE BEEN WARNED.","reviewDescription":"So, I was so excited to get this monitor! I know Samsung makes some good phones, so their other products should be peachy too, right?Wrong. I got this in the mail and set it up before I had to leave for work. I had the HDMI and everything working. Then I turned the monitor off and left for work.I got back 4-5 hours later (shorter shift that day at a local restaurant) and turned the monitor back on. It knew there was an HDMI in there, but the screen would blank and then turn off. I tested different HDMI cords and even a separate monitor to make sure it wasn't something like my GPU, which would've been a whole lot worse if that had been the problem instead of the monitor. Couldn't find a proper way to reset it, and the power\/joystick thing was tripping out. So, I disassembled the monitor, repackaged it, and the day after I got it, I returned it.I'm going with a different brand this next time around. I don't normally leave reviews, but ever since I started heavily using Amazon a year ago, this is the first product that was so horrible that I felt the need to take the time of day to repackage everything and ship it back immediately after getting it.I've seen reviews for other Samsung monitors, and if there's one takeaway I have from this experience, Samsung's monitors are not worth any money and are total garbage. If you want a monitor that will last and the Amazon return window is still open, get that thing sent back immediately. The other reviewers say Samsung's customer service\/PR department will be no help, and after this experience, I'm just gonna take their word for it.Ciao!M. Gage Morgan","isVerified":true,"ratingScore":1,"reviewReaction":"220 people found this helpful","country":"United States","date":1539561600000}
{"reviewTitle":"I'm sorry, my dear old friends.","reviewDescription":"I feel terrible to have to give my Korean friends a bad review, but... Samsung has finally let me down. It was bound to happen sooner or later. This 27 inch curved monitor came in and it worked for about... a week.Then, one night, I was playing some DOOM and I noticed that there was a slight discoloration on the bottom of the screen with a flickering thin white line at the very bottom. I closed the game and ctrl+alt+deleted into the lock screen for it's solid blue background. I was heartbroken to see there was a discolored bar across the bottom of the screen about 2 inches (5 cm) tall. It looked like low resolution masking tape.I shut down my whole system and after about 10 minutes I turned it back on. The bar was gone. Great! 5 minutes later while watching some YouTube, the bar comes back! Depression. I couldn't even finish my sandwich. Depression.At this point, I was in disbelief. Is this happening? Me? Product defect? Samsung? Is my monitor going to explode now?! I did not want to believe that the monitor was the problem. It HAD to be something else. Maybe its the cable! Swapped out HDMI. Tried it on DisplayPort! No! Maybe its my graphics card!! Pulled it out!! Plugged into the onboard. Noo!!! Maybe its my power outlet! Break out the multimeter! Nooo!!! Software! Settings! I even disconnected the monitor from the PC and turned it on without anything connected to it and the bar was still there on the cold, lonely, dimly lit black screen. I never seen discolored blackness before, it was like an off...black. Flickering...off-blackness!I'm writing this review while waiting for a response for my return request. I never had good experiences returning anything online. And I'm not one of those butt-hurt reviewers that will totally alienate an entire company over one tiny defect! I think Samsung does \"flat\" pretty well, but definitely not \"curved\". At least not yet (Jan 2017). I wouldn't recommend this particular monitor to anyone I like. Not this model. Nope. Don't you dare. Just scroll on down. Get that one!","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1484438400000}
{"reviewTitle":"CUMBERSOME CONTROLS, VERY POOR INSTRUCTIONS","reviewDescription":"This monitor came with an international installation instructions that so small and badly illustrated thatI had trouble at every turn.  I had to spend over a half hour with Samsung trying to get them to forward me better to understand instructions.  They sent me a link that was barely better than what came with the monitor.  I decided to return it and was unable to remove the neck of the stand from the monitor.  Once again their pitiful diagram and instructions were so confusing that I had to send it back with the neck still attached.  In my opinion this is a really crummy product and I'm surprised by Samsung's poor assistance.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Defective and sent Canadian monitor so can't make warranty claim","reviewDescription":"Surprised to learn I was sent a Canadian monitor whose model number didn't match receipt so cannot make a warranty claim with Samsung.So, I am stuck with a defective monitor with no ability to have repaired under its warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Amazing Picture very reasonable price!","reviewDescription":"After finally purchasing a couple MiniPC's for both business and personal use, and using an old LCD 21\" Wide Screen Monitor I had, I was finding that I must be spoiled by my 4K TV because the picture on that monitor which I thought was wonderful, just seemed so dull and it did not support 4K which I have come to love to watch 4K videos etc.I wasn't really sure what monitor to get, but I wanted something much larger, supported 4K, and that was at a very reasonable price. I did a lot of searching Amazon's product lists for monitors, and I came across this monitor, and I noticed that it was a curved screen. While I have never owned a curved screen anything, I had seen them at the local electronics store and was darn impressed. So I was very curious about this monitor because it had all the specs I was looking for, at least 27\", Wide Screen, Support for 4K, Native Resolution of 1920 x 1080, LED, and had a curved screen. When I also noticed that it was a Samsung, I was pretty excited to learn more because I have always had very good luck with Samsung products and in fact, I have only had one Samsung product ever fail, and that was a mobile phone that should have stopped working years ago with what It went through.Not knowing much about monitors these days, I started reading the reviews that were written on this monitor and I asked the community a couple questions. The answers I got back to my questions sealed the deal for me. Everyone who responded had nothing but great things to say about this monitor and provided me in info I needed. So I decided to go for it.When it got here, unfortunately the first one had a broken screen. It appeared that it was packaged that way since the packaging was factory sealed but the packing was broken on the inside. Needless to say I returned it but Amazon really stepped up to the plate and sent me a replacement next day, so I was only delayed by 1 day getting to use it. Because the first monitor came with a broken screen, I am going to assume that the screen may be a bit on the frgile side as my old monitor has been dropped, and the LCD screen never had any issues, I don't know jf the screens on LED monitors are more easily broken, or If this was something that someone really dropped hard before packaging, for this reason I gave the durability 4 stars)Setup was a breeze! Just had to put 1 screw to put the base stand together, and that was it. The stand is about the only thing I really don't like because the base that sits on the desk is an upside down chevron shape, which sticks out in front of the monitor a few inches. This makes putting it on a small desk where your keyboard would be in front of it a bit of a pain because the keyboard has to be pulled closer to me and just gets in the way to me. I managed to get around that by putting the monitor up on a little shelf I made out of a box and an old Laptop lap desk that I had. It perfectly raises the monitor by about 4-5 inches, and let's me push the keyboard further back to where I now have more room on my desk.  (Images added to show the base and how I worked around the chevron styled base to give me more room).The monitor has one HDMI port and one Display Port. Now I am not familiar with the Display Port, but all my devices are HDMI, so plugging in a PC is simple. In fact, I have 3 MiniPC's that I need to connect to this monitor so I bought a 5 port HDMI switch. This allows me to easily switch between each MiniPC with just a click of a button.The picture on this monitor is absolutely phenomenal!  Once I plugged in the HDMI plug, turned on the monitor, it automatically scanned for the signal which it found right away and WOW! What a gorgeous picture. The colors are very bright and vibrant. The dynamics between the Black and White colors are stunning and the color definition is very vivid. For never using a curved screen before on a computer monitor, I am very impressed. It almost immerses you in to the picture and almost gives it a extra dimensional view, almost 3D in nature... The thing I worried most about with a curved screen was is there going to be any distortion with a curved screen and I am happy to say. \"Absolutely Not!\". The images looks perfectly flat, but because of the curve, it pulls the outer edges our of your peripheral vision and closer to your focused view when looking straight forward.Learning how to use the toggle button on the back for adjusting the settings van take a bit of getting used to, however, at this point, I haven't really needed to use any of the options other then Sleep and Shut Down as the defaults seem to be perfect for my setup.Unfortunately this monitor does not have built in speakers however, if you have speakers connected to you computer or use a set of Bluetooth Speakers you will be just fine.Overall my impression of this monitor is fantastic! The picture quality is stunning, and the size with the curves screen is awesome. I would recommend this monitor to anyone who wants an excellent monitor for home or office at a more then reasonable price. While I have not used the monitor for gaming, I have used a monitor that has the same 4ms refresh rate and that has the same native resolution  of1920 x 1080 and that monitor is over 10 years old and still holds up today, so I can only imagine that this monitor would be perfectly fine for today's games.  I am definitely glad that I went ahead and purchased this monitor, and should I need to replace the monitor that I amusing as  a secondary monitor, I will likely purchase another one of this model!  Again, Highly recommended and over all this monitor gets a full 5 Stars from me! ~","isVerified":true,"ratingScore":5,"reviewReaction":"120 people found this helpful","country":"United States","date":1539993600000}
{"reviewTitle":"Excellent quality","reviewDescription":"The picture quality is amazing very beautiful monitor worth buying again it's a decent size and the price is decent for the money thumbs up for Samsung","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Great monitors","reviewDescription":"Standard for all my reviews: When reviewing products, I always remain objective and honest about the product or service. I always review with information that I feel others would like to know about the product as I always assume what I'm writing will influence for or against the purchase. I always try to go above and beyond surface characteristics and input into quality, value and application. Most importantly, I will always end the review with an answer as to whether I'd purchase the product again which I believe is the most critical question pertaining to the item. To manufacturers: Want me to review your items, just let me know!I spend a lot of time on my dual-screen PC and with my purchased technologies so when one of my Viewsonic monitors started dying, I decided to upgrade both. After a fair amount of research, I selected two of these Samsung 24\" monitors based upon connection options, refresh rate, reviews and my experience with Samsung overall. As expected, the monitors set up very easily, they look great and the extra 2\" of screen size are definitely a difference-maker.Purchasing monitors is now easy to do without breaking budget and I've learned to trust Samsung. Once again, they didn't disappoint and I'd highly recommend them.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Great screen","reviewDescription":"I bought this for my daughter, who uses her computer to do light gaming and watching movies and videos. This computer screen looks bright and crisp. I love the curved screen and how, even at this size, emerges you more than one with a flat screen seems to. This was very budget-friendly and we got everything we were looking for out of a screen. I definitely recommend this screen.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Amazing Product, Life Changing","reviewDescription":"I am so glad I bought this. I am a data science student and god knows how much I struggled with the small screen of my Macbook. My husband bought this as my birthday gift. And as a tech student, this has been the most useful birthday gift ever. I did not buy anything extra to make it work, all the wires were included in it. I was able to set up the entire thing in literally 5 minutes. I have a fully functional second computer now. God bless this innovation!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Awesome picture!!","reviewDescription":"I love this monitor! It has great picture quality and color. I'm so glad I got the larger size because it helps get the job done!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"Brilliant picture","reviewDescription":"The curved screen is very minor and hardly noticeable. The screen resolution is sharp, and the colors are clear and lifelike. I don't use it for gaming so I can't comment on that, but I'm very happy with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Fast Shipping. Great Value. Large","reviewDescription":"Very Large Monitors. Would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Computer monitor","reviewDescription":"Great picture and easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Curve","reviewDescription":"Just the right size for my office.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Unreliable","reviewDescription":"I've ordered 4 of these so far to try and get my two monitor setup going. I've had one good monitor. 1 was dead on arrival, 1 died in less than a month, and 1 buzzes exceedingly loud.  If I could return the first one, that does work and go with a different monitor, I would! Here's hoping #5 actually works!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Mediocre.","reviewDescription":"The monitor comes at a good price for the size and the modernized curved feature.  The image quality is lacking, much artifacting and pixelating of images.  The ability to use it as a secondary monitor in windows is lost, seems to only be used as a duplicate screen.  The extended screen option does not work.  It seems  I have to re-run the setup driver after rebooting the PC, a simple process, but unnecessary since it should have already been installed, luckily Samsung included it on the internal device drive.Reasonable for the $95.00 black friday sale price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Only lasted 4 months","reviewDescription":"I bought this monitor in September 2023. It was easy to hook up, worked well with my monitor arm, and the display was excellent. It was my first curved screen and I really liked it. I use it for work, so it's on for about 10 hours a day, 5 days a week.Unfortunately, I tried to turn it on this Monday and it did nothing. I tried it with two computers, different plugs, etc. nothing. It's dead. I expected a lot better from Samsung. Especially considering I've used Dell and HP monitors for over 12 years with no issues. I would not recommend this monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Bigfoot","reviewDescription":"This base is like a teradactyl foot. The top curved piece is permanently attached to the back of the monitor. You take the leg of the teradactyl foot and snap it into the curved piece.  Once you do it, it is not coming apart. It is about as stupid of a mount as I have ever seen. There are YT videos telling you how to take this stupid thing apart just to remove the curved attachment\/foot so you can hang it on the wall.  In my front facing shot, the two screws and that curved plate are actually inside the back of the monitor. You have to open the back of the monitor to get inside to remove the curved piece. I have an earlier generation of this monitor so I took it apart and salvaged my old base.  It has a much more agreeable foot in the shape of a small saucer. SO, I guess I voided the warranty to pop the plastic back off the new one to install the old foot.1. Cannot hang on the wall without removing the unremoveable curved piece.2. Awkward to fit on a desktop.3. If the teradactyl foot is no problem, then it's a good monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"IPS glow and backlight bleeding, generally not great picture quality","reviewDescription":"All IPS Monitors will have some amount of backlight bleeding, but it shouldn't be bothersome. I had gotten this monitor refurbished, so that could be a reason for the quality and I was aware of this when purchasing- But I will review anyway to further inform others that this monitor may be prone to IPS glow and backlight bleed.As well, the monitor also comes quite warm tinted out of the box (\"normal\" color tone)- so I always have it on \"Cool 1\". The only way to manage the dimness is to use the Eco Saving Plus or an external app or program to dim it further than computers can allow (which i do). I cannot place my finger on what else is the problem, but the general picture quality is just 'grainy' to me... edges are a bit fuzzy and the colors aren't the best. I'm used to 1440p and not IPS, so maybe I'm not used to 1080p. I'd just strongly recommend saving for a monitor that you'll end up not regretting.For gaming, it's... fine, it's 72hz, but again the picture quality isn't great, so it can get bothersome. Could be better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Not good customer service","reviewDescription":"I had this monitor up for about 3 hours before a third of the display went dark. I called customer service and they said that it was indeed something broken inside and that they would do nothing to make it right. The other two that I bought (one a replacement) work great and look great. Owning something a day shouldn't excuse poor quality control by the company.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"1\/2 monitors were faulty out of box","reviewDescription":"I bought two of these monitors. One works fine, but the other one makes a high pitch buzzing sound in the monitor itself, especially when images with black background are displayed on screen. After some research, I found this is a common issue with these monitors.Amazon would not replace the item. They told me I'd have to pay more money for packaging\/shipping to return the item or they could give me a slight discount to have it repaired, which would also result in me spending more money out of pocket. I've been a loyal customer for years and spend a lot of money with Amazon, so this lack of resolution was disappointing to say the least.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Won't wake up","reviewDescription":"No matter what PC power settings I use (e.g. never to to sleep), the monitor powers down and the only way I can get it to wake up is to disconnect and then reconnect the power cord.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Poor picture quality","reviewDescription":"I purchased this curve monitor my home office and the picture quality is horrible. The colors aren’t vibrant. My scepter curved monitor had an excellent picture quality and vibrant colors. Don’t waste your money with this Samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"CRACKED SCREEN AND WEONG MONITOR","reviewDescription":"Everything else was fine expect the cracked screen and monitor","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Oh boy where to begin...","reviewDescription":"It's been awhile since I've left an Amazon review but this monitor is worthy of my time for sure. I've been staring at pc monitors since the mid 80's and I have never experienced anything like this Samsung, which I might also add, Samsung-oh how far you've fallen. Back in the day Samsung was pretty reliable and pretty good quality, I've owned several over the years. This is my first 'curved' monitor so I was intrigued and excited, especially after spending hours reading reviews on monitors in general, it always seemed like the 'most recent' negative review wiped out the tons of prior positive ones so it took some time to decide. First, I agree with one review here stating the off-color in the corners, yes mine has it as well in three out of four corners, not a huge factor once something starts to play. Second, yep it's ALL shiny plastic, wasn't sure if it's considered Sleekly Cheap or Cheaply Sleek. Third, and this is the Most Annoying 'defect' I've Ever experienced with a monitor and I will try to explain it accurately...I currently have three monitors and the pc that this Samsung is connected to is used primarily for streaming Live TV in the background while I work. The main channel I'm viewing is CourtTV, I mention this in case anyone else has the same issue. CourtTV has Alot of commercial breaks, almost Every Single Time the commercial starts, the sound cuts out, And, half the time the video screen will freeze. You might think this is a good thing, But, whenever CourtTV comes back on after ad-break, I need to Refresh my screen to get the sound back! Every Single Time! Now, considering I'm usually on the opposite side of the room working, I need to go back to the pc to do this! Once in awhile, after refreshing often, it will perk up on its own, but this is a rare occurrence! This is Not a pc issue, as I've simply changed monitors, not pcs. I've never experienced anything like this and as mentioned, it's Incredibly annoying! And finally fourth, and this is the zinger here...it Won't Turn Off! Yes, I've no idea why turning off a monitor now requires a Two-Step process! Really? So once you press the button in the back, a little pop up appears onscreen along with brightness and etc, problem? They don't do anything! I can't 'press' it, I can't move my mouse or use my keyboard, so either it stays on 24\/7 or it requires a manual unplug Every Single Time. So, anything good about this monitor? Well, it looks nice. Would I have purchased it? Nope. Am I disappointed? Yep. Would I recommend this for anyone else? Only if you plan on watching non-interrupted programs\/movies, NOT streaming w\/commercials. Video gaming? Possibly, I did try a quick game from my Steam and it 'looks' good if not the same as a typical monitor. Final thoughts, I was excited then disappointed w\/ incredibly tedious issues i never expected from just a monitor, I certainly hope other people have better luck with this if the decision to buy is made, although I will suggest maybe spending another 50 bucks or more and shoot for better quality in the price range, you DO get what you PAY for, and Samsung is just not what they used to be.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1642982400000}
{"reviewTitle":"Don’t buy monitors from Amazon!!!","reviewDescription":"The monitor itself is fine, very much worth the purchase - I bought two and one didn’t work- I imagine it got damaged in the shipping process. Additionally  Amazon refused to replace the item, only return it, so I’m returning both. It’s really frustrating because a simple return and replacement would have sufficed- I’d recommend buying locally for pickup instead of getting it shipped, it’s not worth the risk of the item retuning damaged and having to deal with the hassle of sending it back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Good monitor. Bad angle mount","reviewDescription":"Great monitor. Good quality and build. My biggest complaint is the mount. The monitor faces downward pretty hard. Not really a fan of that. The mount isn't adjustable either.[Considered returning but I'm just dealing with it*]","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Great While It Lasted","reviewDescription":"This is a good plug and play monitor. I bought two for my gaming computer in 2020. The color and brightness are great.HOWEVER, it's 2023 now and one of them just stopped working. It's showing a bright white screen that flickers, which apparently means the LEDs broke,  and it's basically impossible to fix for a layman like myself. I haven't had a monitor crap out on me since the early 2000s and I've always had them at LEAST 5 years.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Did not come with power cord.","reviewDescription":"Beautiful computer. Bought from Amazon warehouse but nothing was mentioned of no cord in description. Cord was a pain in the ass to find ultimately, and the only options I was given from Amazon was a return for a refund. Nice monitor though.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"The stand is a bit frustrating","reviewDescription":"This monitor is ok, the screen does not have that crisp view.  I don’t know why the stand was made this way. It is not adjustable and leans forward quite a bit. I had to put something under the two front legs just to get it to face forward instead of down.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Cheaply made but Ok resolution","reviewDescription":"Ok monitors. Definitely on the cheap side in workmanship and feel.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"keeping it... Still","reviewDescription":"this a 2nd screen for my laptop and is capable for my streaming but the stand is very bad... cheap plastic that makes it unstable.UPDATE... i have been shopping for an alternative cuz im within the return window. i have tweaked the settings and have streamed some 4K content to judge the results and this is very capable and have stopped looking. This fits my needs and does it well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"Wont let me take it off mute to play console game?","reviewDescription":"Monitor and everything looks fine. However won’t let me take the monitor off of mute so can’t hear anything","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Too expensive","reviewDescription":"For 200 dollars you can get yourself a monitor with twice the hertz and the same picture and color quality. It's not worth the money. Probably going to return mine and buy something that's not awful","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"A review of Samsung & Amazon not Monitor","reviewDescription":"I ordered this monitor for my son as a second monitor to go with his gaming set up.  It was sleek and beautiful but the stand is quite tall which made the monitor too tall for his desk.  I had to send it back and order a smaller monitor which was a disappointment.  I am giving the product 3 stars because the overall dimensions are not clearly noted AND when I called Samsung to try to obtain a smaller stand so he could keep the large monitor they were very unhelpful.  Then I had to pay $23 shipping to return....overall a disappointment.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1480982400000}
{"reviewTitle":"HDMI connection problems every once and a while","reviewDescription":"Everything is perfect except when HDMI connection doesn’t work. Have to try several times until it finally responds. Very annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1651968000000}
{"reviewTitle":"This does what I bought it for, and that's good enough.","reviewDescription":"I dig the curve of the monitor, it's cool. It works great as my larger screen when docking my MacBook Pro. I was disappointed when the first one they shipped looked like it had water damage (from the factory, not the shippers). But Amazon replaced it quickly without hardly any hassle (hooray Amazon!). But it wasn't Amazon's fault, I blame Samsung for a lack of quality control. Other than that, you can tell this is a lower grade monitor, but that's okay, it does the job at a reasonable price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1521936000000}
{"reviewTitle":"Text Pixelated and large pixels. Decent if bought on sale","reviewDescription":"As soon as i connected it I noticed that the text was pixelated. The once straight lines in my games had tiny boxes in them and i could see the pixels. The picture it a little distorted because of the camera but you can see how large the pixels are. With images it's not noticeable but the text you could see the pixels in the letters. I've purchased the LC27JG50QQNXZA instead with the WQHD. This was $159 at the time of purchase so hard to pass up.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1543276800000}
{"reviewTitle":"I've had the monitor 3 days now and it's driving my vision crazy.  Text is not coming in clear.","reviewDescription":"It's so hard to read anything with this monitor as the grey or white text isn't coming in clear.  I've played with the settings and am now hoping someone can give me the default settings to set it back to the way it originally was.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623974400000}
{"reviewTitle":"Too small how to order larger size","reviewDescription":"Screen was smaller than I thought. I had to order a larger size","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649980800000}
{"reviewTitle":"Good monitor but arrived broken","reviewDescription":"Bought a “damaged packaging” monitor at a reduced price since the description says the monitor is not damaged, just the packaging. When it arrived the packaging was perfect so I thought everything would be fine but upon opening it I see the monitor frame is actually broken. The picture works fine but I wouldn’t try to save a few dollars, just buy a “new” one. Time to send it back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1585267200000}
{"reviewTitle":"If yours turns off and doesn't return.  See above","reviewDescription":"My screen keeps turning off every day or two and you have to fiddle with buttons to turn back on.  It happens with both of the ones I bought.  It can also be resolved by unplugging the HDMI or DP connector and replugging.  This is inconvenient.  If you are using as a monitor, it can be too bright.  Just use the eye saver option in the control screen of the monitor","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1573776000000}
{"reviewTitle":"I thought I would have a better picture quality","reviewDescription":"*UP DATE 02\/11\/2020After having someone check out the settings, all settings were correct. The screen has a very slow Refresh rate.For a Samsung product I expected a sharper picture being that it’s an LED curved screen.  But  it’s a good price for a large screen but  picture quality is not as good.  I may have it set on the wrong settings, but my wife likes itso we gonna keeping it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1561593600000}
{"reviewTitle":"Stopped working after 7 months - but worked great before that","reviewDescription":"I am surprised that a product form such a reputable brand would stop working only a month after the support window ended. Money went down the drain. However, it was working well until it died.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"Not adjustable","reviewDescription":"What sort of short person sadist designed this thing without height or angle adjustments.  If you are 5-0 this might work for you.  Otherwise have fun with a crooked neck.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672963200000}
{"reviewTitle":"On my 2nd replacement","reviewDescription":"I have a computer chair that can take 3 monitors, so I bought 3 of these.  1st one went after a month.  Now 2 years later the 2nd one is going.  In the last 2 years I've had the monitors on for a total of 30 hours. Unbelievable.  Problem is I didn't buy a warranty and I can't buy a different model because they all must match so I have to keep buying and this time with a warranty!  I love Samsung and usually never have a problem but not this model: LC27F398FWNXZA","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1592006400000}
{"reviewTitle":"Nice screen but screen is tilted up and not an adjustable stand","reviewDescription":"Nice screen stand is not adjustable at all screen is tilted up at all times which is awkward However I plan on buying a two screen stand and I would be able to adjust it to my likings","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656547200000}
{"reviewTitle":"does not adjust and it does a weird angle down thing","reviewDescription":"this monitor has to be on a stand. it just points downward and adjustable. we ordered two at the same time. they both pointed downward but at different angles. picture was good but.....","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661644800000}
{"reviewTitle":"Died after 1yr 3mths","reviewDescription":"I use this monitor for work so its been busy but still.  You'd expect a monitor by Samsung at this price would last longer than a little over a year.  My other Dell monitor is 4 years +.  I'm so disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657756800000}
{"reviewTitle":"Power cable failed in 6 months","reviewDescription":"The monitor is pretty good. But the power cable that was shipped along with it has now failed . I have to buy this online for another 20$!I expected better quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Poorly created monitor stand","reviewDescription":"Picture quality is fine, but the monitor stand is flimsy and causes the monitor to tilt downwards. I have put it together as instructed but the piece in the back between the feet and monitor is weak and unjustable. Aside from that it is an ok product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647043200000}
{"reviewTitle":"I’ve had to send 2 back now because of dead pixels","reviewDescription":"Within the first two weeks of getting this Monday it had to deadlines across the screen, Amazon was very good about sending me a new one before I had to send this back that way I got to still use them out of there in the meantime. But a few days ago I got more deadlines across the screen in a different area I’m probably going to return it and get a different model because it seems like a recurring problem at this point.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607817600000}
{"reviewTitle":"Revived a Broken Stand","reviewDescription":"I previously owned this monitor and was buying a second one. As I now have to work from home and have to have many applications up for my work. I am only leaving two stars as the product I received had a broken stand and was missing the screw that held it all together. This is very inconvenient as now I have to order a new stand to use the screen. The screen appears to be working fine but I now have to wait to use it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1585353600000}
{"reviewTitle":"Poor Brightness and Image Quality. Compared to 5 year old Dell.","reviewDescription":"In photo is a 5 year old Dell monitor (bottom) compared to this Samsung (top.)  This is as bright and vivid as Samsung can get.  Really a disappointment.  Tried the Samsung in VGA and HDMI.  Very little image quality difference. Also, bought two of the same Samsung monitors and one has a slightly darker shade with the same settings as the other.  Poor image quality, poor image brightness, poor consistency.  I am surprised since this is Samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1604275200000}
{"reviewTitle":"Probably buying a second one","reviewDescription":"I've had this monitor for about 3 years. I'm using it at this very moment, actually, to write this.I can't say I've used this too much for gaming, though I would if I had the PC for it. But I've done a ton of work on it (I'm a data analyst), and it's perfect for the really exciting things in life like Excel and Powerpoint. Jokes aside, it really is perfect for these. It has made working from home SO much more bearable.As for picture quality, I have no complaints. Everything seems nice and clear. It's not 4k, but I've watched movies on this plenty of times and been very happy with the image quality.Finally, brightness. It's very bright, and bright white at that. I've turned on the \"eye saver\" mode since I'm staring at excel all day. The eye save mode is very nice, and tones things down appropriately. That reminds me, the little know system to control menu options is actually really nice. It's a little joystick sort of thing on the back, so you've got left, right, up, and down, and you click it to select. Really simple, works perfectly.Anyway, I'm really happy with this, and I'm thinking about getting a second one, which is why I came back to this product page.OH! If you're going to use this monitor and a laptop, get a cheap laptop stand (they're like $20), otherwise your laptop screen will cover up part of the monitor. It's just a quality of life improvement, you can thank me later.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1593820800000}
{"reviewTitle":"Lovely Monitor for work and play","reviewDescription":"i use it every day for work and i like that it has an Eye saver mode that minimizes the blue light. When i take it off of the eye saver mode in the middle of the day or to play games from it, it is very crisp details and great colors. Lovely monitor","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Excellent","reviewDescription":"I bought 2 of these. I couldn’t be happier. Great quality. Good size. And the eye saver mode actually works.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"One small issue.","reviewDescription":"Pro: Never used a curved screen and thought I might dislike it. Not the case. I work from home and it's a game changer for email, Excel, etc.. YouTube looks really nice also.Con: The V style stand is complete trash. Replaced with an adjustable VIVO which works excellent. Mind as well buy a replacement stand at the same time of purchase. Save some time..","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Nice clear screen","reviewDescription":"Works well, big clear and I like having the curved screen.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Makes work much easier","reviewDescription":"I use this monitor with my 13\" laptop for work.  I don't see any advantage or disadvantage to the curved a screen for my office uses, but I guess it was designed for gaming. The color and clarity are great. I ordered the Amazon recommended \"buy these together\" cable, but one was supplied with the monitor.  I thought maybe it was like a stove and you had to buy the cord separately.  Nope. The first day I plugged it in, there were some error lines flashing horizontally across the screen and I thought I would have to send it back.  I turned it off and back on again and they were still there, but within an hour they resolved.  It's not happened again in the last 3 months.  It makes my work so much easier as I can see full pages of multiple apps side by side.  I am not constantly crouching over my laptop, so neck strain has improved.  Happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1649894400000}
{"reviewTitle":"Perfection","reviewDescription":"Like it even more than I expected to. It's perfect.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Great for Animators\/Digital Artists","reviewDescription":"No one has said much about working with digital art on this thing, so I thought I’d write a review for that niche. I hook it up to my laptop and use it as a dual-monitor. Needless to say, I’m basically using it as my main monitor at this point cause the picture quality is great and it’s the perfect size for my eyes at the desk. I use a lot of Adobe software and everything looks incredibly clear. Color quality is great, too. The eye-saver mode is a godsend for people like me who are often up late working on projects. Just make sure you are aware of what the colors will actually look like, obviously, cause the eye-saver mode will make things look slightly yellow. Great product, would buy another one if I had a bigger desk.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1661644800000}
{"reviewTitle":"Great monitor and definitely worth the price!","reviewDescription":"I liked everything about it, the size is just great, doesn't feel too big or too small. The packaging was perfect and everything worked great! The quality for the price was the best of all and I can work and play comfortably, which is why I bought 2 of them jaja","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Work well good color","reviewDescription":"Same as above","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Beautiful and easy set-up","reviewDescription":"I should have bought this year's ago. My desk looks great and my productivity has increased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"works good","reviewDescription":"work","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Happy Wife","reviewDescription":"Bought for wife's home business, She loves it. Happy Wife Happy Life","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Curved screen","reviewDescription":"My husband loved this. Perfect size and the curve helps with view in his work. Came fast and perfectly protected.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Great looking monitor","reviewDescription":"So good, I got two. My desk looks great, and these monitors work perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Great monitors","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Samsung monitor","reviewDescription":"Computer monitor, fast shipping great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"LOVE IT!","reviewDescription":"This monitor is stunning! Clear & perfectly curved.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Great picture and the curved screen is easy on the eyes.","reviewDescription":"I bought this monitor as it is a new model of the same think I've had for several years. I purchased an HDMI cable to go with it but was surprised there was one in the box with the monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Multi environment monitor.","reviewDescription":"This model is used extensively in our engineering department at work. So, I purchased one and sent it to my grandson up at Michigan Tech. He was surprised and very happy with it capabilities. Thank you.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Not 100% sure yet","reviewDescription":"Over all I think it's a great monitor I think the picture is great, I feel like the monitor is easy on the eyes even without the eyesight saver one. I'm not a fan of the stand I think it's primitive  and the one screw that you have to screw in is hard to get in and I don't feel like it connects the stand the way it should.Why I'm still not sure about it and possibly will return it is I don't like the one button control that is in the back of the monitor it is very small and controls your adjustments as well as being the power button it's hard to mess with since it does jump all over the place, not sure if it's even shutting down correctly.part two of why I'm not sure yet is that I have only had this monitor a couple days and twice it has shut it self down after pausing a video or being on a website. the screen goes black you can try to do what ever to wake it up and it does not wake up you have to hit the power button or unplug the hdmi cord, tonight it happened again after pausing a video walking away I tried to wake it up the video sound started to play the picture never came back and all of a sudden the audio went away too?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638662400000}
{"reviewTitle":"A Design Flaw","reviewDescription":"The size is awesome and the image quality is very good. For those of us that mount our monitors, we are forced to deal with a non-removable plastic nubbin that sticks out from the back. This is part of the pre-installed stand that they force on you. It is a very poor design flaw. I confirmed this with Samsung support. I get to walk by my desk every day and see what appears to be a plastic tail nubbin sticking out of the back of my two monitors.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Really great when you get everything you need!","reviewDescription":"The monitor itself is great. There are many different display options, and it functions well for what I need it to do. My problem is the delivery. I had ordered two of these months ago, and they were delivered in a timely fashion. However, even though they came together, the packaging was so different, and I didn't quite understand why. One had foam, one had bubble wrap. One came with instructions\/setup guide, one without. One had everything needed to assemble, one did not.For the longest time I thought one of them was just missing a necessary screw to put it all together. After talking to Samsung a few times, and waiting many weeks for the delivery, I was finally able to receive the screw needed, only to then realize the whole base is wrong. Granted, I probably could have realized this earlier had I checked more thoroughly, but this also wouldn't have been an issue if it was packaged correctly in the first place. The only reason I was really able to figure anything out was because I had ordered two. At this point after waiting so long for the delivery of the screw, it's too late to return (and I don't have the packaging anyway) so I guess I gotta go make some more calls to Samsung. Needless to say, I'm pretty frustrated. So yes, if you are lucky and get everything packaged correctly, then it's a wonderful monitor. I just can't give it a better rating after everything I have gone and through and am still going through to try to be able to use my second one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1611964800000}
{"reviewTitle":"Mostly OKAY","reviewDescription":"The monitor is great, but the on\/off switch is less than ideal.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Fantastic Unless You Want a Wall Mount","reviewDescription":"I have a total of four of these, two for my NUC setup and two for my wife's setup.I purchased the first one a few years back, and based on the price at the time ($159 I believe) I instantly wanted a dual screen setup.The picture is great, Samsung is a great brand, so why a 3-star review? Recently I got some new furniture for my office that required rearranging and I decided my wildly cluttered desktop needed to be cleaned up. I purchased a floating monitor setup to help declutter everything and today rearranged and mounted up my two monitors.Here's the problem - to remove the last part of the base stand you have to REMOVE THE COVER of the monitor, which means when you're using a flathead to pop open everything you're about 1\/4\" away from touching the innards of the monitor. Inside there are two screws that connect the base to the monitor, which is about the dumbest design decision you can imagine.One of my monitors made it out unscathed, the other is toast now with the right side of the screen apparently having been compromised.Long story short, if you're going to use the stands this comes with, you'll be fine. If you want a wall mount you will have to basically take the danger of ruining your monitor.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1623801600000}
{"reviewTitle":"Cannot Register Product | Poor Customer Support","reviewDescription":"Its a pretty good product for the money. I cannot register it. I tried various customer support venues with frustrating results. They are great \"sales\" people. They try to trick you into getting a good survey result without actually producing any results.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"No DP as listed only HDMI\/VGA","reviewDescription":"Listed as having DP\/HDMI inputs in-fact it only has the same VGA\/HDMI as the flat version.  Should have trusted the pictures not the description.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"This was a mistake","reviewDescription":"This thing has a short fixed base, and on top of that it’s angled slightly down so it looks weird at the bottom so you’ll need to stack some books on your desk to get it tot he right height. And it just will not come on when you get your computer up","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"I like Samsung, at least usually ...","reviewDescription":"Since I have switched almost exclusively to Samsung for televisions and monitors, I had high expectations for this monitor. My Samsung TVs are great, and the large 32\" curved monitor I bought two years ago has been great. This one, however, is so much ... underwhelming. It is not sharp, not crisp, not stable physically on its stand, and it is not smart. By \"smart\" it does not recognize the source and automagically switch and sync. So, if you need a monitor, it certainly works, but if you have any expectation that it will behave with anything like what the TVs or other monitors do, then keep looking. Maybe Samsung has a better one, but now there are SO MANY models it is hard to sort through what is what.SAMSUNG, if you are reading this, why do you need to have so many models? Just make a few good ones and make it easy for us to choose. And don't make dumb versions of stuff. How hard is it for you to have the monitor recognize the one HDMI port and see there is a source on it? Come on, you could have done much better for very little effort.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1644278400000}
{"reviewTitle":"No tilt adjustment","reviewDescription":"No tilt adjustment on the stand","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Exactly what it eases it is. Great screen for expanding your workspace. Easy to use and setup.","reviewDescription":"Comes with an HDMI cable!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"IT IS A GOAT","reviewDescription":"This is the best monster out there literally this thing makes your setup nicer and adds productivity. so I have a MacBook M1 Pro, I needed a moniter and I came across this one for $120, so I bought it and when it arrived I hooked it up and turned it on and boom it started working and shortly after I got another and it works perfect. JUST GET IT!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1679184000000}
{"reviewTitle":"4 purchased! great screen!","reviewDescription":"We have purchased 4 of these so far, its a great screen! Great size, quality, etc... not the best refresh rate, but adequate.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Perfect size and price after 7 months","reviewDescription":"Perfect size and price For what it’s worth.  Needed a second screen for gaming.  This wasn’t bad.  I’d buy it again.Still works.  No issues so far.  Looks like it’ll hold up for a few years.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"This screen changed my life!","reviewDescription":"This Samsung, 27\" curved-screen monitor has changed my life. When working or gaming on my laptop's screen, life seemed meaningless, directionless, hopeless. But, since connecting this monitor to my laptop, I have reason to believe in myself again! I have given up drinking, and I am back in therapy with a mental health professional! I have reconnected with many of my close friends with whom I had lost contact. My wife and I have reconciled, and we are trying to save our marriage. We were also able to keep our daughter in school! THANK YOU, SAMSUNG!!! Also, the Blue Filter feature really helps with eye strain, which is also a plus.","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"Great product","reviewDescription":"I love my new monitor.  Large, light-weight, and easy to set up!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Great right out of the box","reviewDescription":"I had bought an Acer KG1 Series monitor during Prime Day this year because it had a 144hz refresh rate. However, out of the box, the colors were all sorts of terrible. Despite trying over and over to get the colors right, the thing was just plain bad. So I returned it for this Samsung. Right out of the box the Samsung's colors were fantastic. It helps that it's an IPS monitor, so the color accuracy is much better - but seeing them side-by-side was striking. The Acer had a weird tint to it, either too blue, too green or too red. I couldn't find a setting to make the whites actually look white. The Samsung is super crisp, just the right level of brightness, and the whites actually look white - which is really important when creating graphics.The curve on the monitor is slight, so things don't look too weird curving around the screen. It's too bad IPS monitors get so expensive when you go to higher refresh rates. If this monitor had a 144hz refresh rate it would be perfect. But the 60hz is still smooth enough for most work applications and many games. I'm not a FPS player, so having the slower refresh rate isn't really all that noticeable.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1565136000000}
{"reviewTitle":"Love these monitors","reviewDescription":"Light weight, but if your going to mount on the wall, don't add the base. It was difficult to remove it afterward and had to search on youtube how to remove the base so that we could mount them on the wall.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"9\/10","reviewDescription":"i bought two of them and have them side by side. i have 2 things i would of liked. 1. I would have liked it more if they had speakers built into it. 2. I would have liked a remote to power it on and off. I am not a gamer so i don't know how the spec compare to others but i think they are really good","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"1 day after 1-month warranty expires, there's a black vertical line","reviewDescription":"exactly 31 days from the purchase date, this monitor has a black vertical line and is worthless. It would cost more to fix it than the almost $200 I paid for it. Completely unsatisfied and an unhappy Amazon customer. Warranty for electronics should be longer than 30 days. Best buy gives you 60 days. Absolutely infuriating!EDIT: Amazon's customer service wins the day, and has honored the refund even though it was a day after the return window. I had waited to set this up and 3 of the monitors worked fine and this one didn't. Thank you Amazon for doing the right thing. I will change to 5 stars after this is fully resolved","isVerified":true,"ratingScore":5,"reviewReaction":"19 people found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Excellent product","reviewDescription":"At first I was a little skeptical of this monitor based only on its price. Surprisingly, the quality of the image and ease of setup was phenomenal. It does have very limited settings and cannot be adjusted in terms of tilting the monitor.Overall, I’d recommend this monitor if you’re looking for something affordable and casual. If you’re a graphic designer, photographer or anything similar I recommend you look for a higher quality monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"So far, so good...","reviewDescription":"Needed to pick up a quick monitor replacement due to one of my two (flat) 24\" Samsungs suddenly dying on me (have had them for a few years and typically use them 8-10 hrs\/day). Was already thinking about upgrading my WFH set up to 27\" curved monitors - so given the replacement situation I found myself in, I decided to go ahead and pull the trigger on one of these inexpensive Samsung options. Delivery was same day with Prime, which is always a huge bonus.After installing it and dialing in the screen settings a bit, I'm generally happy with the performance and use I'm getting out of it...at least so far. I typically don't do any gaming or heavy movie\/content watching from this particular set up, so the screen and picture quality are fine for my general work needs - I'm not in need of high dollar\/high performance monitors. As long as this thing holds up over some time, I'll be purchasing another one to swap with the other 24\" I'm still using.One note worth mentioning (not sure if others may have mentioned this), but if you're looking to mount this monitor on adjustable arms (not using the provided desk stand), you can do this; however, you'll need to pick up some spacers (not provided with monitor) so you can get the separation of space needed from the mounting bracket to the backside of the monitor - I used 1\/2\" spacers that I already had on-hand and they work fine. Some may see this as a pain in the neck, but it's an easy solution. It'd also be ideal if the portion of the desk stand on the back side wasn't permanently installed and was able to be removed, but is what it is - not a make or break for me...as long as the monitor functions properly, that's all I care about.Again, I can't speak to quality\/performance when it comes to gaming or watching movies, but if you're looking for an cost friendly option to upgrade or if you find yourself in a similar situation that I did, I'd recommend this monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"good monitor but not adjustable","reviewDescription":"First of all, wouldn't you know, soon after I ordered the monitor, Amazon lowered the price by $30 -- wouldn't you know?!  Overall I like the monitor.  The picture isn't as sharp and clear as my previous Samsung monitor, but that may be in part due to the increased size?  My main quibble is that the monitor cannot be adjusted up and down.  The monitor is tilted downwards and it stays that way.  I have a stand for my monitor, and if I hadn't constructed a support to increase the height at which I view it, the thing would've been pointed at my upper stomach and lower chest.  But overall, it works fine for me and I enjoy using it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Cured screen","reviewDescription":"Curved screen, like it","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"MacBook Air","reviewDescription":"I’ve only had it 2 days but so far so good. I use it with my macbook air. No issues, picture comes in clear and I use this as my main monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Great upgrade.","reviewDescription":"I have always had an old TV that I have used for my PS4 gaming, so upgrading to a monitor of this caliber was great. Although the PS4 is capped at a certain level of graphics, this was incredible to see the difference in quality from where I was previously. I would absolutely recommend this to other people who are looking for a cheap starter monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Nice Monitor","reviewDescription":"Great, well performing and lightweight monitor with a stable and effective stand. Easy set up. Good picture \/ color quality.Minus: no speakers, so you end up with external ones and the space saving aspect of this monitor is out the door!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"very happy with","reviewDescription":"do not know how to turn off screen..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"not the most crisp picture","reviewDescription":"video quality is fair to good. color is a little dull. Not bad for the price though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Good for the Price.","reviewDescription":"Monitor was easy to unpack, put together and install.  Downloaded the needed drivers from the Samsung website.  It definitely needed color and gamma calibration but once that was done, the image is acceptable and I can even use it for editing photographs.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Pretty gucci","reviewDescription":"Overall great monitors and they look nice on my desk but they dont have a spot to plug in from graphics card. Cant remember what its called rn tho. Sadly one of mine has a speck underneath the screen but it’s pretty small so I dont notice it too bad. But yah the picture quality is pretty nice and the curve makes it more immersive when gaming","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626652800000}
{"reviewTitle":"Comfortable on the eyes","reviewDescription":"Coming from a cheapie flat screen, this is luxurious and an eye opener, can sink into the screen, was looking for white but they didn’t have it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653004800000}
{"reviewTitle":"Decent enough monitor","reviewDescription":"Works pretty good. Doesn't had a dedicated power button like most monitors I've used. Click the button than have to move it around for options, like to turn it off. But other than that I've had no issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"Monitor arms recommended","reviewDescription":"They're grrreat! Only issue is the factory stands they rest on. At the time of this review I have three of these sitting side by side. Two of them are leaning way forward and I have to wedge a DVD case under the feet to get them level as the one sitting upright as it should. Maybe someone at Samsung ought to be checking in on the quality of these once in a while. The screens themselves are terrific, using them for online gaming allows me to see more of the map and I can fit more emails or other text in frame as opposed to my smaller screens. I plan to mount these on arms to alleviate the ... shall we say 'bad posture'.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1528329600000}
{"reviewTitle":"Monitor from Samsung","reviewDescription":"I like the monitor, but there was like 0 instructions or a CD rom to help me understand how to operate it. I had to go online to try and figure it out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643760000000}
{"reviewTitle":"Outstanding","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668124800000}
{"reviewTitle":"Awkward viewing angle - UPDATE","reviewDescription":"Updated 7 Oct - Upon further review the monitor does have a small amount of north-south tilt adjustability.  However, still recommend a separate monitor stand.  Added another star...Original review - As with other reviewers have noted, the stand supplied with the monitor angles the monitor down and is not adjustable. Awkward for viewing if the monitor is placed on the desk top.  Recommend purchasing a stand that has an adjustable angle (tilts) and also adjusts vertically.  If not for that would have rated it higher.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1601942400000}
{"reviewTitle":"Nice curved monitor","reviewDescription":"I like the size and picture quality. However the stand for it is not very sturdy and the monitor is quite wobbly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658534400000}
{"reviewTitle":"Nice Monitor","reviewDescription":"Great monitor. Came with missing powercord","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1663027200000}
{"reviewTitle":"Looks great - slow to wake","reviewDescription":"I bought 2 of these to replace 2 older Samsung 23 inch monitors. They look great. I like it that they have an \"night time\" or \"eye saver mode\". The curve is subtle and have mostly gotten used to it. All around pretty nice monitors. The only reason I give them 4 stars and not 5 stars is that, like me, they are slow to wake up. Sometimes it takes 20-30 seconds for them to come on after I've been tapping the keys or moving the mouse around. It's not a day-ruining problem, but annoying nonetheless.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1596585600000}
{"reviewTitle":"Work great","reviewDescription":"I work from home and bought two of these for work.  They work great and are a big upgrade from what I had.  Got them for a very reasonable price too - just make sure you know what you're getting.  I have no idea if these are good for gaming, but they work well for what I'm using them for.  I have them mounted on a monitor arm and didn't use the stand that they come with.  It has a piece on the back for the stand that sticks out.  However, it hasn't been a problem for me.  The HDMI cable also goes straight out the back too, so if you need something flush with the wall, this isn't going to work.  Also, it only has a single HDMI input and no display port.  If you need both, you'll have to buy a cable to convert it.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Would have been a 5 but...","reviewDescription":"But, how to you screw up an on off switch. They opted for a software on\/off sw. Push the button, scroll to the on\/off function and push the button again. Easy enough right, unless you are using Windows 10 where you shut down the computer from the on screen start key. You have to shut the computer down and wait for it to power all the way off then go through the push button ritual to power the monitor off. Just because you can do something doesn't mean you should, newer is not always better.I'm just part of the microwave generation, if something takes more than 5 seconds it's taking too long. Information and support came up a little short. Printed info. included with the screen was lacking and when I tried to register online it wouldn't accept the m\/n, s\/n combination from my monitor label or from the software. After online chat and a call to tech support they gave up and told me the warranty is good even if I can't register it.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"Got as a gift","reviewDescription":"Bought it as a gift for my bestie. She loved it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Really nice device","reviewDescription":"I bought it for my sister and she \"loves\" it. Fairly good quality and very easy to setup. Major upgrade from before and she spends a lot more time ⏲️ enjoying the computer 🖥.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Update your view settings (provided in review) to make picture quality look better","reviewDescription":"OVERALL PICTURE QUALITY  ->  Good. OOTB settings are not optimal but can be adjusted to make the picture look good. (See settings below)VIDEO QUALITY ->  Very goodTEXT QUALITY  ->  Fair -> AverageBLACK DEPTH  ->  AverageWHITE  ->  Very goodCOLORS  ->  Very goodSIZE  -> 23.5\" diagonal screen viewVESA  ->  The monitor has a VESA mount compatibility, my suggestion is go for a mount.PROS:-Extremely lightweight-Good picture (after settings adjustment) even in bright light-Low price & excellent value for money-VESA CompliantCONS:-Basic monitor with no add-ons like speakers or USB-Don't expect the samsung LED TV quality at this priceOVERALL: I recommend the monitor because you won't find anything better at this price. However I do recommend buying a mount so that you have a better viewing angle and won't hurt your neck.The unit I got had been repackaged and missing the screws to the stand which makes it a little unstable. I'm likely going to order 2x27\" instead.UPDATE TO SETTINGSIf you are not liking the picture quality on your Samsung Monitor particularly if your screen is pale looking, you need to adjust the settings. Samsung should have done a better job at providing this OOTB but they haven't.Please follow these settings in the order listed1) Goto MENU -> SYSTEMFreeSync: ULTIMATE ENGINE2) Goto MENU -> PICTUREBrightness: 56Contrast: 94Sharpness: 36(COLOR)Red: 50Green: 54Blue: 100Samsung Magic Upscale: Mode1HDMI Black level: LowEye Saver Mode: OFFGame Mode: OFFLeave a comment or upvote if it helps please.","isVerified":true,"ratingScore":4,"reviewReaction":"409 people found this helpful","country":"United States","date":1594944000000}
{"reviewTitle":"That stands are horrible.","reviewDescription":"If you have a small work area or would like to push these monitors close to the wall, the stands will not permit it.The design and packaging is well thought out.I will have to order desk arms so I can make the most of my desk space.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"not bad - and compatible with mac","reviewDescription":"pretty good just a little small and no speaker","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694649600000}
{"reviewTitle":"Great Picture, cant get the speaker to work","reviewDescription":"This is probably a user error because I am a 20-year-old girl. However, for the life of me, I cannot get the speakers on this monitor to work. I can tell that my computer is trying to push sound, as that is what it says the speakers are out-putting to. However, I cannot make it work on the computer. Also, I cannot find the sound buttons. It might have helped if I  looked it up or found a manual, however, I haven't. So in terms of a great monitor, it is awesome. It feels luxurious and is very easy on the eyes. I am running it off of my laptop and props to my laptop too, because she runs like a champ. Anyway, if anyone could tell me how to get the speakers on the monitor to work? I would be grateful, although the likelihood of me coming back to this post or this review page is extremely low. I will suffer in silence. thanks for reading.","isVerified":true,"ratingScore":4,"reviewReaction":"20 people found this helpful","country":"United States","date":1667865600000}
{"reviewTitle":"Read carefully","reviewDescription":"Great screen just wish the would explain that it doesn’t come with internal speakers","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Good value for the money","reviewDescription":"Good value for the money","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"really is poorly designed","reviewDescription":"For the amount of money this cost it should have built in speakers that's just standardedThe buttons that turn it off\/on are also the menu and settings buttons which is also stupid. I have to use it like an analog stick(think of the two black sticks on a gaming controllers)The stand to hold it up is big but I have a large table so it isn't too much of a problem.As for the stand coming off to mount it I think there's small lock button that requires you to insert a pin to take the whole thing off.So far it's fine but from what I can see on Amazon I wish I had just bought a 24” tv at least that would have all the components I needed already installed","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1636675200000}
{"reviewTitle":"Buzzing noise coming from monitor","reviewDescription":"The monitor works great and as expected. However, just a month after using it the monitor makes a buzzing noise. The noise gets louder or quieter depending on what colors that are showing on the screen. It’s not so loud that it’s unusable, but definitely annoying. I bought this same monitor a couple years ago and that one is still working great and makes no noise. Must have gotten a bad one this time around.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666742400000}
{"reviewTitle":"Coil Whine","reviewDescription":"Just FYI- I was getting serious coil whine (high pitched buzzing) from this monitor that was driving me crazy. Tried replacing the HDMI cable three times (usually fixes it) but no deal. Finally picked up an HDMI to VGA cable and that fixed the problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672963200000}
{"reviewTitle":"the stand angle is not correct and not adjustable","reviewDescription":"It is not comfortable that the monitor screen has a forward tilt, and the stand is not adjustable","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679788800000}
{"reviewTitle":"HDMI channel crapped out after 98 days","reviewDescription":"I've always liked Samsung monitors and TVs, so I thought this was a safe purchase.  After 98 days of not-quite-daily use connected to my laptop, the HDMI channel just stopped working.  Crapped out in the middle of my work.  Totally black screen, except for a momentary \"HDMI\" graphic when it was connected.  No amount of replugging, restarting, or reconfiguring would bring it back.  Tried another laptop; same issue.  It *might\" be the cable, but I think that's unlikely.  Since I'm not a gamer, I tried the VGA input through an adapter, which works fine for my purposes.  So caveat emptor and all that; you might consider buying the extra coverage offered by Amazon, or at least save the Samsung box for a year.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1633651200000}
{"reviewTitle":"Disappointed…","reviewDescription":"This is the most mediocre monitor you can buy.  I guess you get what you pay for.  I always expect more from Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1674000000000}
{"reviewTitle":"Not for Gaming but good monitor","reviewDescription":"Upon receiving this monitor I was extremely excited to get this running on my pc. I wanted to play call of duty, halo, destiny, and other first person shooters. I also play World of Warcraft from time to time. Now getting this out of the box the curve is not really as \"curvy\" as you'd expect at all. Obviously you can tell if curves but it's nothing drastic. Keep in mind as well its only 60hz and 4ms. The picture looks really good and movies on kodi or other platforms look great on it. Worked perfectly and stylish. However playing call of duty and other first person shooters there is a notice why input lag. To explain better because everyone told me on here it's fine which it is not. Turning from left to right and quickly zooming on an enemy player has a feel of slowness. I plugged in my benq 1ms monitor after trying this monitor and there was a NOTCIABLE difference and could tell I could aim and turn faster from left to right. World of Warcraft looked good but almost to dark for it even with brightness turned up. I do not recommend this monitor for multiplayer competitive play you will get  frustrated.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1502841600000}
{"reviewTitle":"Fine monitor","reviewDescription":"Monitor quality is fine.  For the price it is exactly what you could hope for.  However, this is the first monitor I have ever seen that doesn't allow for any movement what so ever.  I don't find the base too large as I have bigger monitors with similar bases that I have seen some people complain about but it is tilted \"down\" for some reason and has zero ability to move.  I might as well be sitting on the ground to make it look right.  Will be propping it up but what a design flaw.  Will probably end up having to buy a mount of some kind.  What a silly oversight by samsung","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1635724800000}
{"reviewTitle":"Decent monitor but…","reviewDescription":"I use this monitor for remote work, picture is clear. For whatever reason my laptop (main device) does not recognize this screen at all. I have toyed with the setting nearly a year now and IT can’t even figure it out.  Aside from that, you cannot adjust the tilt on it at all. The biggest drawback in my opinion is that I have had this monitor randomly tip forward and fall dozens of times.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1663200000000}
{"reviewTitle":"Decent for the price","reviewDescription":"Decent monitors for a decent price. I shoulda of purchased another different kind that has better resolution for gaming. But something for a basic start up PC, or even an extra monitor this is a good deal for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669161600000}
{"reviewTitle":"Not reliable. Have 3. 1 replaced and now one powerless.","reviewDescription":"Have 3. Returned\/Replaced 1 already for pink line appearing on left side of screen and 1 just lost power. No lights, nothing. Sending all 3 back after purchasing replacement.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667433600000}
{"reviewTitle":"Missing parts!","reviewDescription":"Missing the 2 screws that hold the adjustable arm on.  Annoying.  Only choice is to take it back for a return.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669334400000}
{"reviewTitle":"Good image quality, but not adjustable at all","reviewDescription":"I purchased this monitor for home office use.  The screen is nice, the picture quality is good, and the brightness is perfect for work lighting levels.  My only issue is that it tips forward slightly, so the top is closer to me than the bottom edge.  The stand is fixed, so there is no was to tip it back, nor can you raise or lower it to accommodate different heights for viewing.  I would order something else for home office use.  I am not thrilled with this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635379200000}
{"reviewTitle":"Good screen, check the screen before you throw the box iut","reviewDescription":"I purchased two of these when I was told that we’d be working from home much longer than what we thought. I’m constantly in excel and email and I haven’t noticed any issues with fuzziness with letters or numbers.I did receive one that the screen has separated from the frame, but I was in the process of moving when I received them so I didn’t return it. The frame is still off in spots and I know I have trouble down the road, but like I said, I didn’t return it due to the hassle of returning a product while I was in the middle of moving. I might try a different company when the screen dies, it bothered me that it came to me already broken.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1607126400000}
{"reviewTitle":"I bought 2 of these and one is noticeably dimmer than the other","reviewDescription":"I bought 2 of these for a dual monitor setup and one of them is dimmer than the other. I have one plugged into an HDMI port and one plugged into a DP port with an HDMI converter. I switched the ports to see if the problem was because of HDMI vs DP but the same monitor remained dimmer. I have the monitor settings exactly the same on both and NVIDIA control panel settings the same on both.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641427200000}
{"reviewTitle":"Awful stand and viewing angle","reviewDescription":"The angle the stand provides is horrendous. The stand itself is cheap plastic. Have to jury rig a solution to set things thing up in a good way and I’m debating returning it. Seems like the only viable option if I keep it is to get a separate monitor arm. Suboptimal","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"Quality of text - NOT good enough","reviewDescription":"I currently use a 25 inch Samsung SyncMaster P2570 monitor, with a 20 inch Dell UltraSharp as my second monitor. I wanted to use this new 27 inch monitor as an upgrade, and move the 25 inch monitor to be my second screen. Unfortunately the quality of text is unsatisfactory.I spend most of my day working with Excel files, Word documents and database tables. With this very large monitor, the pixels are noticeable, and the text is simply blurry. I have played with all the various adjustment menus, but it did not make a noticeable improvement. I checked on line to see if the settings were wrong, but there's nothing.  I went through the usual ClearType adjustments, but it did not help much.I have a Samsung TV, which I love. I hoped the quality would come through on a computer monitor - FAIL!NOTE - I returned the monitor for a refund already","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1497830400000}
{"reviewTitle":"Not crisp or clear","reviewDescription":"I’m using it as a computer monitor to work on photoshop and indesign. It’s not as crisp or clear as I was hoping or very useful for what I need it for. The picture\/screen display also comes off a bit white\/foggy. 2 stars because it works but don’t buy if you are using it for work or design.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1641340800000}
{"reviewTitle":"Bulky and cannot remove entire stand for mounting","reviewDescription":"This is an okay monitor. If you plan on using it for office work then this is fine. But there is no built in audio, and the stand the monitor sits upon is super bulky and cannot be entirely removed for when it needs to be mounted.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646611200000}
{"reviewTitle":"Great picture, Great Price, Sleek Look, Dumb Non-Adjustable stand.","reviewDescription":"I love Samsung products so I may be biased in my review but I’ll be honest. I like the curved design my first one. The picture is great, the monitor itself is sleek and doesn’t feel cheap even though the price was cheap. The negative and to me it’s a pretty big negative is that the screen tilts down and the stand isn’t adjustable. I have it on an adjustable desk that I can negate the downward tilt by making my desk taller but I really can’t understand why this item tilts down so much","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1613606400000}
{"reviewTitle":"Meh","reviewDescription":"Pay for what you get.  A little cheap feeling.  Not good for gaming, but perfect as a work monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661990400000}
{"reviewTitle":"Decent, but not hi-def (as expected for the price)","reviewDescription":"I bought two of these just to have more screen real estate for coding.I bought two of the same model together and they have all the same settings, but they don't have the same quality. I can only do so much \"process of elimination\" since I only have two of them, but I think one of them might be faulty. It also has those light shadows around the corners when the screen is displaying a dark background.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607040000000}
{"reviewTitle":"Read the fine print","reviewDescription":"I was comparing MANY different monitors, and must have overlooked a VERY important thing about this item. It does NOT have a remote. Period. And no built in speaker. This is by definition the most bare bones you can get.  The monitor was easy to set up, and looks pretty good. BUT you must be prepared to try to do everything (setup, switching, volume, etc) by reaching around the back of the unit. I just wish I could turn it off and on with a remote.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1563321600000}
{"reviewTitle":"Pixel line failed 34 days after received.","reviewDescription":"A horizontal pixel line failed 34 days after received (4 days after return window closed). Worked fine until then. Amazon allowed return\/refund which was very appreciated!  I wouldn't recommend getting this model though.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1651449600000}
{"reviewTitle":"Decent for the price","reviewDescription":"These were my first external monitor for my home office set up. Once you open the box, you can tell the monitors are not as well built as other Samsung products. Resolution is decent, don't expect Dell, HP or Macbook type resolutions. It gets the job done.Don't recommend these for video editing or graphic work. The curve is a good feature if you have 2 of them side by side, which gives an immersive experience.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1591142400000}
{"reviewTitle":"it’s not great with macbook m2","reviewDescription":"i returned this i’m disappointed with samsung on a variety of fronts","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673654400000}
{"reviewTitle":"Broken pixels straight out of the box!","reviewDescription":"Straight out of the box this screen has broken pixels and that is disappointing. I probably would not recommend. For the price there are better options. I will be returning but wanted to make a review before hand to warn people","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640304000000}
{"reviewTitle":"Great product, arrived damaged","reviewDescription":"The screen is great, I use it for work and it has a very clear picture. I love the eye saver mode, reducing blue light. The only reason this is less than 5 stars is that the item arrived with a crack in the screen. Fortunately, it’s not in a high-volume area, but it is distracting and disappointing given the price for a new product that had lots of packing materials.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1595808000000}
{"reviewTitle":"The specifications on Amazon says it has a D-Sub connector, it does not","reviewDescription":"It comes with one HDMI input and one DP-IN, which I have not been able to get to work.  If you are expecting a D-Sub connector because that is in the specifications you will be disappointed.  Its fine as long as all you want to do is use the single HDMI input.  If you plan to connect it up any other way, you will be disappointed because the D-Sub does not exist and the DP-IN doesn't seem to work for most people.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1548720000000}
{"reviewTitle":"Resolution is pretty terrible.","reviewDescription":"This product is alright. The curve is less than I expected. The plastic frame has a way of getting dust stuck to it very very quickly. The resolution actually just isn’t that good. I am not a particular fan of it, after having it for about 5 months. I definitely should have went a different route. I recommend getting a different monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600992000000}
{"reviewTitle":"Great Product","reviewDescription":"Have 2 of these at work and 2 at home for drafting  on civil 3d and gaming both could not be happier.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Bought for my wife’s home office","reviewDescription":"Great product for the price would highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Great for dual monitor set up\/WFH","reviewDescription":"Love this monitor!! I use it to extend my Samsung Flexbook 360 screen onto a second monitor. The OLED is nothing compared to the quality on my laptop, but it gets the job done and is worth the lower price for sure!I'm running numbers all day and sending quotes, so this is great for normal computer functions. This would not be good for someone in marketing who is dealing with graphics and what not.If you're looking for a quality monitor for your office, this was definitely a good buy!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Best monitor I have ever owned!","reviewDescription":"Have you ever sat in front of your computer and realized that your monitor is just not quite right and that it is time for an upgrade but the last few times you spent very little and got some nice monitors but now... it's time to pamper yourself? This is what happened to me. The monitor that i was using wasn't cutting it for me anymore. I wanted to upgrade and I remember earlier this year at one of the major electronic stores, I saw for the first time a curved monitor that was huge and was approx. $800 and I was going buy that monitor when the right time to upgrade came!The other day, I did some amazon research on the monitors and it was surprising to see such a wide price variance between model to model and brand to brand. Thankfully the reviews help. I came across one review that said these monitors are not good for spreadsheets and when I read that, I then changed my mind and decided to go with purely flat and looked to see if I could find any good deals.Yet, something was telling me... I have to have the curved monitor. I do spreadsheets, yes... but I also work with photos and videos and for the price, why not? It would be worth it and if it doesn't work out, then I could easily buy a cheap flat screen just for spreadsheets and documents or send this monitor back.I ordered this very monitor, Samsung, and curved! The shipping box was very light and I loved the fact that you could tilt the box on it's short end and carry it that way. When I got the monitor home, unboxing was a breeze and assembling the stand was very simple. The screen does tilt, which is nice. This monitor does have an external power supply, but it is very small and lightweight and would rather have it external in order to keep the monitor ergonomic and light. Within 12 minutes, I had the monitor assembled, plugged in and turned on and receiving a signal.I am blown away by the sharpness, quality, and how my photos and videos look on screen, no matter what angle I am at. The curve helps me to keep focus on the center and it is a very cinematic and interesting view. I did test out a spreadsheet and actually like it curved! I am so glad I didn't abide by the other review and not get this curved monitor.This monitor hooked up nicely to my Mac Mini. The Windows 10 VM opens up nicely as well. I do love this perspective and thankful for the cost and for all the other reviewers that helped. If I ever wanted a monitor side by side, or for another pc, I would certainly get this one. I am used to buying cheap 32\" tv's and using those as monitors but having a dedicated monitor at 27\"  offers so much more clarity in the text and photos. I feel like 27\" is the perfect size.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1477440000000}
{"reviewTitle":"Good Monitor","reviewDescription":"I wanted a wide monitor so I could work with two or three windows open at the same time without having to go with multiple monitors at a single workstation.  I know that this is touted as a \"gaming\" monitor, but I am not a gamer.  I am a writer, so mostly I use LibreOffice and\/or FocusWriter to compose stories and set up the book's layout.  I also manage my home library from this station and it is useful to be able to display information on, say, a hundred-year-old German language adventure story and the fields of Library Thing at the same time when I am entering information.  It is also useful when entering data into a spreadsheet from online bank statements and\/or mutual fund reports.  The monitor fits into the space available on my desk and does not crowd the other items there.  Assembly was simple, and though there is an owner's manual, I did not use it.  The back of the monitor has standard VGA and HDMI interfaces and perhaps others.  I used the VGA interface with my \"antique\".  The Fedora Core 33 OS had no trouble adapting to the new monitor.  The curvature of the screen took a few minutes to get used to, but after that initial adjustment period, I no longer really noticed it.  All in all, I am glad that I bought this monitor, saving myself the difference in the cost of a television with an HDMI interface which I really did not need in the first place.  I've been using Samsung devices for some years now and never had one that failed to perform well.  The only one of their products that I've ever had to replace was the television that my adult severely autistic son put his fist into during a tantrum.... and even that one COULD have been repaired I suppose as only the screen was broken.  I don't think you could go wrong with this one and while you can get perfectly serviceable monitors these days at second hand stores for five bucks, this one will outclass them by a wide margin.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1619049600000}
{"reviewTitle":"Quality monitor.","reviewDescription":"I work from home and use several applications at once. Wish I bought this monitor first because it makes the other look crappy. The curve is easier to view too. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Great gift","reviewDescription":"Present for myself and I love the curved monitor. I use this almost everyday for my computer and when I’m gaming and have no issues and so far the best monitor I’ve had.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702512000000}
{"reviewTitle":"works great.","reviewDescription":"Great monitor not the best for gaming, but looks very good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Very Good Monitors.","reviewDescription":"This is my second time around buying this computer monitor. I’ve had the other monitor for a year and it’s held up perfectly fine. I even dropped it changing my set up around and it’s still going strong. Once I saw it on sale again I went ahead and bought it again. Definitely worth the purchase if you’re looking for a really good sized monitor grab this one for sure. It’s also hard to pass up on the price especially if it goes on sale again.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Does its job","reviewDescription":"I work from home and wanted an external monitor for my work issued laptop and this was on sale.  Arrived undamaged, quickly, and works great.  I didn't need it, but bonus points for including an HDMI cable.  Used mostly for MS office products, email, and web surfing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"Worth the price!","reviewDescription":"This is a great monitor and is worth every penny!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668384000000}
{"reviewTitle":"No Speakers, Only one HDMI Port","reviewDescription":"Got this screen within one day, so great shipping. It is my first curved screen, and it feel natural. It is on my desk, I am sitting about 2 feet back and the screen looks great for gaming. Also, for work, the screen seems great, it is not too big, but big enough to have two files side by side. I wish it had more than one HDMI port and speakers. But for this price, I cant complain. I like it so much, I am considering buying a second one for dual screen as I do work from home a lot and need to have a few different programs running all at the same time. I use to only work off of my laptop and this is a game changer. Now, I need to buy a mouse and keyboard as having my laptop in from of me to control everything defeats the purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1539820800000}
{"reviewTitle":"Great but there is no off switch","reviewDescription":"It's a super nice screen and works great for gaming. There is no off switch on it tho so if the computer is on, it's on. Not all that bad except we have cats that like to walk across desks and keyboards at night and the light shines out in the darkness very bright when you're barely awake.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650240000000}
{"reviewTitle":"4.5 stars","reviewDescription":"The Good :-Colors are truly amazing for a non-PLS, non-IPS panel.  Not listed in the description (at the time of purchase), but this is a Samsung VA panel.  Does that mean anything to me?  No.  This has a MUCH nicer picture than my 27\" IPS LG monitor that was $100 more expensive.  So yeah, I plan on selling the LG and buying a second one of these.-The curve is subtle, yet essential (after being accustomed). I now prefer curved screens.The Meh :-The sharpness setting in \"game mode\" is much too high and not adjustable.  Only reason this bugs me is that I cannot replicate the color vibrancy through the manual calibration to the same level as \"game mode.\". Very close, but not %100.-Due to the design of the stand, it is excited to let you know when you bump your desk by making the monitor dance.  They did include VESA mounts, so I'll be purchasing an adjustable monitor arm mount.The Bad :-I'll be sure to update this review if I find anything","isVerified":true,"ratingScore":4,"reviewReaction":"95 people found this helpful","country":"United States","date":1474243200000}
{"reviewTitle":"its great but has motion blur","reviewDescription":"i bought this when our old monitor stopped working and this one was better in almost every way when compared to the previous one.  but there was one problem that annoys me when i play games. it had bad motion blur, even on the highest refresh rate. red and green create a noticeable black trail. and if the in game text is black, good luck trying to read it while moving. the only other small complaint is that it was really bright when we first got it, but you could easily adjust that so i wouldn't even be mad about it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1615248000000}
{"reviewTitle":"Great monitor but the stand is TRASH","reviewDescription":"I really wanted to give this thing 5 stars. Really slick, nice picture and resolution, very affordable.The only reason it’s 4 and not 5 stars is that the stand it comes with is absolute trash. It’s a flimsy piece of plastic that barely sits straight, doesn’t swivel, and feels like it’s going to break every time you touch it. You may as well buy a mount at the same time, which also hurts the affordability (though simple mounts are quite cheap, about $30).Great quality monitor, useless stand.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1622073600000}
{"reviewTitle":"It’s wonderful","reviewDescription":"I love it, it makes a great second screen for my work and school but the connection doesn’t always last through multiple days, the color will be disrupted to pink hues until I unplug and plug back in.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"HDMI not compatible with most video Cards","reviewDescription":"This model does not have a VGA port to attach to most video cards. You must have an AMD Rad R9 series video card in order to use the HDMI slot,, not only tha,t it has to be a certain AMD Rad RD Video Card. This is not stated in either the quick start or manual that came with it. It is stated in the online manual. The other port requires a DP display cable that does not come with the product. This cable has a connection which should fit any VGA video card. The cable is available at AMAZON for under $9.00. There is another model that does have a VGA, HDMI, and DT display slots for the same price also available at AMAZONS. None of this information is available in the box","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580169600000}
{"reviewTitle":"Not adjustable for height or for tilt","reviewDescription":"I should’ve rather reviews report purchasing but will end up keeping the monitor. I wish that it was adjustable for tilt and for height.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1660694400000}
{"reviewTitle":"Amazing display but NOT FOR GAMES 60hz","reviewDescription":"Amazing display, super nice monitor.  I will be saving up for another samsung monitor curve. However 60hz is absolutely no good for games. Dont waste your money on this as a gaming monitor. Only business\/work\/home use.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1644710400000}
{"reviewTitle":"broken","reviewDescription":"garbage it came in broken","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700524800000}
{"reviewTitle":"Was sent a used product","reviewDescription":"I paid $129.99 for what I thought was a new monitor.  After installing the monitor it worked well for about 2 hours then began blinking in\/out  Now it won’t even recognize it’s plugged into my laptop via the HDMI cord.  I grabbed the manual to try and troubleshoot the issue and that’s when I noticed the “Amazon Renewed Unit” sticker.  This seller shouldn’t be sending customers second hand products when they clearly choose the “new” option.  Now I have to go through the hassle of returning this junk.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1668124800000}
{"reviewTitle":"Text is fuzzy -- no way to fix","reviewDescription":"Wow. Only after hooking this up and discovering how terrible the text was did I start to research.  A known problem.  Ghosty, grey letters with extra fuzzy material around them.  Seriously like something out of 1993. ClearType does not fix this. Nothing fixes this. Sadly, I missed the window to return, as this was for a remote location.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"2 Months old and problems already","reviewDescription":"Had this monitor for 2 months and like another buyer has stated it has started flickering in & out. Dont waste you time on purchasing this product very disappointing","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Very poor design","reviewDescription":"Hard to get back brace off and back piece is flimsy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"The Screen became Defective after 5 months !!!!!!","reviewDescription":"I bought this in April 2021 and there was no problem with it. All of a sudden after 5 months the screen started to have mulicolored lines appearing out of nowhere! There was no physical damage done to the screen, and when I touched the lines to see if it will somehow disappear, it made matters worse! The lines spread all across the screen! And then it looked as if the screen was shattered in 3 places! This is definitely the worse monitor screen I have ever had, I’m going to purchase from LG next time. The monitor is currently being investigated by Samsung to see if they will fix it free of charge, which they should since it was built faulty !!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"Sad digital designer here.","reviewDescription":"I bought it as a replacement for my work monitor that was going kaput.. and wow. It is bad.Color is terrible. No height adjustments. Resolution is terrible (I thought it would be a setting like the \"larger text, default..\" that are on other monitors I've had.. it's not.) which is obviously my bad.If you care about making pixels look good for your job, stay away from this BS.I hate it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679702400000}
{"reviewTitle":"Text is so blurry it strained my eyes","reviewDescription":"I had this monitor set up for a full two weeks and used it while waiting for an usb-c to hdmi adapter to arrive, which I was hoping would solve the problem. The display was so grainy, it was tough to look at. I fought by okay, until I had do to something with a lot of text. My eyes hurt so much from trying to focus on the blurry text that I knew I had to send the monitor back. The adapter didn’t help.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1660435200000}
{"reviewTitle":"Image quality is not good","reviewDescription":"I already had one of these monitors that I bought new and when Covid-19 happened I needed a second monitor and I bought this \"refurbished\" one. The screws in the box to mount the monitor didn't have the washers and the screws were to short so I had to go out and get screws that fit right with the washer that goes around it. I uploaded a picture I took of my screens with my phone (it's an image of google chrome extending into both monitors displaying the same color but they don't show the same color, the monitor on the left is the new one and the one on the right is the \"refurbished\" one I bought from these guys!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1596585600000}
{"reviewTitle":"Send the correct cable","reviewDescription":"I haven’t even gotten to use this monitor yet because it came with the wrong cables. Either supply the correct cables or at least include which cables need to be used in the instructions.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"It’s okay","reviewDescription":"Fuzzy for any Microsoft applications. Text is not clear, don’t recommend for work","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1652400000000}
{"reviewTitle":"NO SPEAKERS","reviewDescription":"If you are looking for a model with speakers than this one is not the one for you! You must have a separate speaker system plugged into your PC or you can use the HDMI pass through audio out to a headphone port located on the back of the monitor!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1561420800000}
{"reviewTitle":"Tried getting this one because I thought it was a good deal, honestly if you're wondering about spending the ...","reviewDescription":"Was working well for the first few weeks and now it randomly shuts off in mid gaming. Tried getting this one because I thought it was a good deal, honestly if you're wondering about spending the extra money on a 4k just do it. I'm still using it but I'm in a hurry to upgrade already...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1532908800000}
{"reviewTitle":"It's so and so","reviewDescription":"I got it because I like the prices v.s the one 23\" I recently for almost the same price. I hope this works great for me as I do a lot of editing work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615507200000}
{"reviewTitle":"Good product but Display Port does not work","reviewDescription":"I bought the monitor because it has 2 ports (one for each of my laptops). However, about 3 months after I purchased the monitor the display port stopped working. I am now down to 1 HDMI port and the seller will not do anything about the defective product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1542931200000}
{"reviewTitle":"NO sound and controls were cumbersome","reviewDescription":"Decent size and brightness, but there is no sound and the controls to modify the color were so exhausting that I returned it. Many other monitors out there with sound and easier setup.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593820800000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Easy to set up, works okay for text and code but the resolution is shockingly bad. Very grainy \/ pixelated image to the point where it’s painful to watch video (or even video chats) on it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1584576000000}
{"reviewTitle":"Low resolution","reviewDescription":"Not good for work. Resolution too low for text manipulation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646265600000}
{"reviewTitle":"Great monitor. Sound doesn’t work","reviewDescription":"Bought new and sound does not work whatsoever.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"nice screen but...Saw one similar and Cheaper at Walmart","reviewDescription":"Just wish it was adjustable height so it can match the height of my iMac. I guess that's what books are for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625097600000}
{"reviewTitle":"Useless after 2 years","reviewDescription":"Not a high quality monitor. Purchased it as a Black Friday special in 2017. After a little over 2 and a half years, the monitor has trouble staying powered on with reoccurring power loses. At this point, I am looking at an LG or Asus as a replacement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1598400000000}
{"reviewTitle":"I might have a lemon","reviewDescription":"For some reason this particular monitor has errors in a multi display set-up.Still trouble shooting, but out of three monitors this one continually “forgets” the connection causing me to physically plug and unplug the hdmi cable in order for it to display correctly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616284800000}
{"reviewTitle":"Great Monitor, tv static?","reviewDescription":"Really amazing monitor I was really happy with my purchase but 3 days later the screen started to glitch out and there are like little spots around the screen that looks like tv static that appear every now and then which is really disappointing because this monitor is actually good quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594425600000}
{"reviewTitle":"Disappointed....","reviewDescription":"I want to give kudos to Amazon to delivering this on time, but when we pulled it out of the box, the screen color was malfunctioning.  I called Samsung to help me troubleshoot, and they ended up creating a ticket and I had to ship it to them.  So now I don't even have it.  Very disappointing experience this time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1544140800000}
{"reviewTitle":"I found a larger screen, same brand and a less expensive price.","reviewDescription":"Too expensive.  Larger screen available at a lesser price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663632000000}
{"reviewTitle":"Does not have DP port","reviewDescription":"I bought a total of 4 monitors, 1 being from this vendor. Box was different and did not have the DP port on the back of the monitor only HDMI.  I had to order DP to HDMI cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619481600000}
{"reviewTitle":"It's a fixed height and angle","reviewDescription":"It's a fixed height and fixed angle monitor. I wish I could move it up and down as needed. Good picture quality and brightness. I do not play games and so can't comment on it. Overall, not good for the price.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616544000000}
{"reviewTitle":"Broken. How to fix ?","reviewDescription":"The monitor was working and then I heard a pop.  The inside of the monitor seemsTo be broken. There is no picture in middle and looks cracked  but not on outside","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"Be careful, cost is an indication of what you get.","reviewDescription":"This monitor is fair at best. The resolution is poor (I am using a surface pro to connect) . The response time is good, but is very pixelated.  The stand is very space intensive. The arm in the back makes it take up more room than necessary.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593993600000}
{"reviewTitle":"Great Picture Quality, Reliability Suspect","reviewDescription":"Fantastic picture quality, easy setup, totally satisfied with that.  However, my company has purchased multiple units, and the fallout rate for us is 25%+.  Some units fail right out of the box, some after a few months of use.  When they work, they are amazing, however they have not proven reliable for us.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1557273600000}
{"reviewTitle":"BUYERS BEWARE! DONT BUY THIS!!","reviewDescription":"I’ve only used this monitor one other time and it worked fine and now it won’t work. Even before plugging it into hdmi to my laptop it just flashes. I’m past my return date by 9 days… of course. This wasn’t cheap and now it’s not working!! Don’t buy this product! I tried plugging it into other outlets and another computer and this still happens. I’d like a refund!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1675900800000}
{"reviewTitle":"Screen just stopped working","reviewDescription":"Screen goes black randomly while working. Need to unplug and replug in hdmi at least once or twice a day. Didn’t see this review anywhere else but a slew of terrible reviews. Wouldn’t recommend this monitor to anyone. Go a little more expensive and get something reliable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681084800000}
{"reviewTitle":"Defective After 4 Months","reviewDescription":"After 4 months of use as a second monitor  white horizontal lines appeared over bottom  task bar and when unit had no cables attached.Samsung support is horrid like the other reviewers with same problem have mentioned.Do not buy, stay away.UPDATE: Followed the painful, long process on the Samsung website to register the product and send in for repair.  Had to pack myself, but they after dropping it off at UPS store they did repair and send back in two weeks.  Would still avoid....","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Terrible Monitors","reviewDescription":"When these monitors go to sleep they will no wake up until you unplug and re-plug them into the computer. We purchased 6 of these for my department and all have been removed from service. They are horrible DO NOT BUY.  PS, I am the head of IT for my county.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682467200000}
{"reviewTitle":"Mailed broken","reviewDescription":"I received it with a broken screen. I was really sad about it and had to ship it back again","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Horrible colors","reviewDescription":"Has a pink hue that did not go away no matter how much I tried to play around with the settings on the screen or try different laptops and cables. It also does not ship with a VGA cable (and doesnt have a display port) so I had to order one separately after I received the monitor. I kept this one because I missed the deadline to return it. I got an HP E243 for less, and even though it's not curved it has a much much better image quality, it made hate this Samsung one even more. Save yourself the money and dont fall for the curved screen gimmick, it's not worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1598659200000}
{"reviewTitle":"blurry and sea-sick","reviewDescription":"i'm connected to a new macbook air. the screen's resolution is notably worse than my mac's and it's already set to its max resolution. the curve is also making me sea sick... i wish i had a chance to set this up sooner so i can return this sooner","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"4 months","reviewDescription":"It’s been four months since I purchased this….Today lines showed up on the monitor screen and it’s annoying.Not happy at all.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"I ordered 27\" with HDMI and DP ports, recevied HDMI + VGA","reviewDescription":"HDMI port works just fine - DP, not so much.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Heads Up: If you plan to mount the monitor, don't ever install the stand (irreversible design)","reviewDescription":"This monitor was great until I bought a monitor arm to mount it onto my standing desk. So naturally I took off the tripod base and realized how dumb the design is. The neck of the stand hinge doesn't come off once you pop it in. The base comes off just fine with a simple screw but you have to literally take apart the whole monitor the undo this.For those having the same problem as me (Going from monitor stand to mounting it on an arm)- you can Youtube \"How To Completely Remove The Samsung Monitor Mount or Stand Hinge\".So ridiculous. Dumb design by Samsung.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1609804800000}
{"reviewTitle":"This monitor is perfect for the price!","reviewDescription":"When I saw how cost effective this monitor was, I was a bit skeptical. Once it arrived, I unboxed it, everything was wrapped up really well and I could tell that there would be no room for damage in transit, this is a key detail of buying anything with a screen from online!A few of the key features that I personally love:Design:The base is minimal and matches the curve of the screen. It isn't large or clunky, and blends well with the curve. The edges and back\/side of the monitor are very slim, it can blend in with most surroundings while still feeling immersive. The curvature is perfect if you have it elevated about 8inches off of your desk like I do.Quality:The pixel resolution is perfect. I sit around two feet away from the monitor and I can't see a single pixel. For the size of the display, that is very impressive.Overall:I love everything about this monitor. The only thing I would change, is that when my computer is off, the power light on the monitor flashes, which can be fairly annoying at night. Otherwise everything is perfect! If you are looking for a curved monitor and for something in this price range, I would highly recommend this display!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1534809600000}
{"reviewTitle":"Works great","reviewDescription":"We replaced two older and smaller Samsung flat screen monitors with two of these 27\" curved displays. With the HUANUO Dual Monitor Stand we also purchased to hold these, it is a wonderful improvement to our office computer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Perfect monitor, nice size, brilliant graphics","reviewDescription":"I have had this monitor a while now. Verified purchase. I was so excited to upgrade my old monitor and this came so fast. Yay Amazon Prime! When I opened it I noticed it was packaged really well although I don't recall if the box showed it was a monitor or not. It was easy to unpack and even easier to set up. The base just attaches to the bottom of the monitor. No tools needed. The monitor is pretty sturdy on the base. I may look into a arm mount just to show it off even more. All cables were included and it came with some written material that was completely not needed to get it set up and turned on. Once on the monitor is stunning! The size is a bit larger than my old one but I didn't want to go to big so 27\" seems just right. I really lose myself in it. It's bright, and has a brilliant picture. The curve is also just right. Too much would be too much. It brings the edges of the screen in closer. The settings are via a toggle button on the back that's very easy to use. In short I am so very pleased and have absolutely not a single negative thing to say about this lovely 27\" curved Samsung Monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1483488000000}
{"reviewTitle":"Gorgeous, high-quality display but may require some tinkering to get it to feel comfortable for your eyes","reviewDescription":"Took some real getting used to for this thing.  When I first got it, it was straining my eyes pretty fiercely and I actually processed a returns order for it.  I decided to take a few days before boxing it back up to see if I could solve the problem, and I think I found a combination of things that work just fine.First, I increased the scale of my display to 125% in Windows' display settings.  Icons and text were too small at 100%, and increasing size seems to have helped a lot.Second, the \"eye saver\" feature is great if you'll be staring at text or websites for an extended period of time.  I don't use it while watching movies or playing games, and don't need to.Third, I picked up some bias lighting by Antec and stuck it on the back of the monitor and together these three things appear to have eliminated the issues I was having with eye strain.It's a sturdy, excellent display that looks beautiful and works wonderfully.  I don't currently have an AMD GPU, but I will likely pick one up once the Ethereum craze dies down and prices stabilize again so that I can take advantage of the FreeSync feature.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1500422400000}
{"reviewTitle":"Great Monitor","reviewDescription":"So far so good! I purchased two of these with the recommended arms and everything was a breeze to install.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Perfect","reviewDescription":"I bought two.to work from home.  They are clear and work really well","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Good monitor","reviewDescription":"Needed something larger for home now that I am here 100%. This curved monitor lets me put it in the corner of my desk. I like it. Picture quality is good. Works perfect setup as a second monitor with my laptop. I like the setting and features that it comes loaded with as well. I also setup my google home to cast on it so I can see stocks while I work sometimes as well. Would be nice if it came with a small speaker built in. Obviously this isn't a feature I thought about prior to purchase and doesn't change my rating on this either. It does have a headphone jack so I can setup an external speaker if I would like. I use the stand and don't have it mounted to the wall. I would say the stand is slightly flimsy, I don't feel it will break, just moves around a lot if I hit my desk or move around heavily. Still not a problem just something I noticed.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1605484800000}
{"reviewTitle":"QUALITY SPEAKS FOR ITSELF!!","reviewDescription":"I game a lot and the quality of my video is immaculate.I was able to play really well and easy to maneuver.I wish the monitor is adjustable because it only stands in one direction and cannot be adjusted.The options to adjust screen brightness and all the, you can press the power button in the back and I like how it will not turn off right away, it will show in the screen the options which is a HUGE HELP!!So far its a 5 star affordable screen! Thanks to CyberMonday lol","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"The easy of setup","reviewDescription":"I liked it so much I order additional one for my office","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Awesome Monitor. Bright, Curvy, Does it's job","reviewDescription":"This is a great monitor for what it does. It only has one resolution, but I only bought it because I was tired of doing all my reference and other work on one 16\" Cintiq monitor.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"Good monitor for the price","reviewDescription":"For the price it’s a pretty good monitor. Video quality is good. Fits on my desk without feeling like it’s taking up too much space.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Great monitor but no mobility","reviewDescription":"The picture doesn't do it justice. This monitor is very clear and the colors are vibrant. My only complaint is that it is not phyically adjustable. I cannot move the screen up, down or sideways, so I have to keep it tilted on a ledge which causes one of the legs to stick out. It has a Y shaped base which isn't good for limited surface space desks.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Mount it or you’ll regret!","reviewDescription":"TL;DR if you buy this monitor, please either mount it using a vesa mount or mount it to wall\/desk in some way. Do not trust the stand on its own.Got it to become my main monitor for gaming. Got a secondary one that is flat that I keep vertical for coding.It looked great and was easy to connect to my eGPU set up. My only mistake was not mounting it to my wall or desk in some way.I decided to use the stand to keep it on my desk. I have a gaming desk that has a dedicated laptop stand that supports up to 28”. One day the stand leaned forward and toppled over. Since it was on the laptop stand, it gained enough momentum to pull the power cable and fall completely to the floor, causing the screen to crack in one side.I contacted Samsung support to try to get a repair but looks like they are going to submit the request as OOW (I’m guessing they are considering it accidental damage - I’ll try to fight it and see what happens).Disappointing but I liked the monitor so much I ended up getting another one (I need A secondary monitor for work anyway and it being great for gaming is a bonus - figured if the repair pans out I can use it as a third monitor). I plan to mount it to the desk this time in case the stand fails out again.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1546905600000}
{"reviewTitle":"Very attractive screen and picture.","reviewDescription":"I use this product daily for communications and playing card games. It is a good clear picture with decent response time. I would have given it 5  stars except that the button on the back to operate the menu and turn the screen off is clumsy and difficult to use especially if you have large fingers. I installed a 10 foot HDMI cable and discovered the screen would not turn off when I turned off my computer. Little icons rolled around the screen until it was manually turned off by the button in back, clumsily. I installed my old analog cable and the problem went away. The screen now turns off with my computer (windows 11). Would prefer an HDMI connection in case it would give a better picture. Does anyone have a similar complaint or solution.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1661990400000}
{"reviewTitle":"Good buy","reviewDescription":"Decent good buy should have gone for 27” , a bit smaller to my aesthetics.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686096000000}
{"reviewTitle":"Decent for the price point","reviewDescription":"I do like that the screen curves. However, the picture quality just isn't there.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"I need to stop trusting Samsung products lol","reviewDescription":"the picture quality, especially with any type of text is AWFUL, I bought this monitor for work and reading anything on it SUCKS. You have to zoom in A LOT to get clear text but it messes with the image quality of everything else on the page.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Easy set up and great picture","reviewDescription":"The only thing I don’t like about the monitor is that the stand is flimsy. But the monitor itself is a good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680998400000}
{"reviewTitle":"fine product just very low quality","reviewDescription":"monitor is fine graphic wise for games but when i go to bring up google\/facebook\/discord anywhere where there is a text bar its got a red and black lines through it obviously didnt expect this from a 150$ dollar monitor when my 75$ monitor thats 8 years old still works flawlessly this kinda sucks if this wasnt my second monitor id be extremely pissed more than i already am","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Awesome Display","reviewDescription":"This display has great color. easy to use. Works with any HDMI pc.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681862400000}
{"reviewTitle":"Great monitor, just doesn't have built in speakers.","reviewDescription":"Monitor was easy to set up, light weight, and had great picture quality. The only downside is that it didn't have built in speakers, but not a big deal. Happy with the purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"Good buy to compliment your WFH experience","reviewDescription":"Great for working from home. I was worried about the screen size going from a 34\" bit it's worked out. Much better than one small 12\" screen. Easy to navigate settings and menu. Loses some resolution when displaying some files in full screen mode but generally very clear. Screen is not as curved as other models but not a huge issue. The stand is a bit awkward and would have been great to have adjustable height but I placed on a stand and it's worked out well. 4+ stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1597276800000}
{"reviewTitle":"Best bang for you buck gaming monitor.","reviewDescription":"I don’t get to play games as much as I used to but I finally did decide to spend some money on a monitor to replace the tv I’d been using and a can say that games like, TES V: SkyrimTES IV: Oblivion,  Fallout3 and Fallout: New Vegas look leagues better than how they did on my tv. Picture quality is dang good for the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614988800000}
{"reviewTitle":"Great monitor but...","reviewDescription":"I purchased two of these monitors and only or of them has a singular pixel that is out... I know it doesn’t sound like a big deal... but when I noticed it the first time, I see it all the time now and I hate it!!Other than that it’s a great monitor :)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623888000000}
{"reviewTitle":"GREAT MONITOR, JUST A FEW MINOR FLAWS (IMO)","reviewDescription":"This monitor is overall a great monitor to have, especially if you're into gaming and editing and all that. The stand is incredibly sturdy as well. The only things I'm not super happy about, is that the screen doesn't rotate forwards or backwards, it doesn't move up or down for better viewing, and it doesn't appear to have any speakers. Besides that, this monitor is great. I do recommend it if those three incredibly small flaws don't bother you. I've had this monitor since December of 2019, and so far I haven't been disappointed with it's performance or quality.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1587254400000}
{"reviewTitle":"Very good in this price range","reviewDescription":"Good curved monitor in this price range and work perfectly for WFH.Only problem is the options\/buttons they provided, we have to struggle to choose the correct option but out of the box options are suffiecient for daily usage.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635984000000}
{"reviewTitle":"Decent for the price","reviewDescription":"Decent for the price i use this as a second monitor for streaming and does the trick for now until i save for a better one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643414400000}
{"reviewTitle":"Good monitor for the price","reviewDescription":"While I would've preferred 1) support for g-sync, 2) higher refresh rate, and 3) higher resolution obviously, I am still an initial fan of this monitor.  I was on a budget when I built my recent computer and 1080p w\/ HDMI was the desire.  I also only have a Nvidia 1050Ti video card...in hindsight an AMD RX 470 or 480 could've been an option.  That said, the curved screen, brightness, and color are fine, and works great.  I like the design (vertical adjustment would've been nice too) and hopefully it will last.  For the price, I would recommend.  I think a good FHD monitor is better than a cheap QHD monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1491004800000}
{"reviewTitle":"The picture quality is great from all angles.","reviewDescription":"I don't really like the stand because it stands out too far in the back preventing me from putting it close to the wall. I ended up removing it and hanging the monitor from a wall bracket. Don't like the rotating button in the back to turn it on and make screen adjustments. My last Samsung monitor had the controls under the bottom edge that you couldn't see but it was much easier than reaching behind and rotating on this old game handheld type. But the picture is nice and I can see clearer from more angles. Once I got it set-up, I really don't have much use for the button.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1513814400000}
{"reviewTitle":"Bad product","reviewDescription":"The screen after 2 months, very bad service from Amazon and manufacturers, they told me it’s with the warranty time and I have to send it to them and they will fix it, a new product, imagine what will happen during the next 10 months, bad product, don’t recommend it, I should have bought from Best Buy, with a better service","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614297600000}
{"reviewTitle":"Monitor works great for reading sheet music and watching music videos.","reviewDescription":"Researching the Samsung name brand for the best monitor to suit my needs, I came across this 27\" LED on sale at just the right size. I needed a mountable monitor over my keyboard to use when reading sheet music, to practice, and play along with music videos. Having vision issues, there was some concern about using a curved screen but , after a few days, Id never go back to flat. The monitor provides a crisp, clear picture with clarity and depth, which is important to me. I like that it is slim and doesn't take up too much space and ,with the wall mount arm, I can adjust the screen from side to side as needed. As other reviewers mentioned, don't attach the stand if you plan on mounting. Pleased with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1607817600000}
{"reviewTitle":"Fantastic Product For The Price","reviewDescription":"**DISCLAIMER**I ordered the C27F398 model but actually received the C27F396 model. After looking up the two on Samsung's website I concluded that there is absolutely no difference between the two besides the model I got having a VGA port instead of a display port. I decided this was fine as I don't intend to use display port anyway but figured I should warn buyers that you may get this error from the seller too.I bought this to replace my old 32\" television I was using for my PS4 and laptop secondary display. Happy to say that I am blown away by how much better this display is in almost every way. It's got a super pleasing panel on it with a decent response time for the price point. If you enjoy gaming and consuming media then the curved screen does a really solid job of immersing you too. The stand and port selection leave some things to be desired but a cheap hdmi switch fixed that problem and quite honestly the height of the monitor is fine for me.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1509494400000}
{"reviewTitle":"Screen is nice, just the JOG button that sucks","reviewDescription":"I like the screen, it looks nice and i have two of them in my work setup. It's got great features. Unfortunately, on one of my monitors I can barely access the features because the JOG button gets locked where it only lets me adjust volume or brightness and not any of the other things like eye saver or whatnot, unless I fully unplug the monitor and plug it back in. Also it doesn't let me \"power off\" when I want to, I simply have to unplug it.Whoever created this JOG button probably thought it was really neat and convenient but I just would prefer multiple buttons that performed single functions, especially for important things like power off or input switch. The fact they want to put it behind a broken menu makes the monitor annoying to use.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1602547200000}
{"reviewTitle":"Not the best for viewing textual documents","reviewDescription":"Reading all the great reviews, I was really hoping for more with this monitor.  I may have been expecting too much for this price-point though.The monitor is built very well, has a nice curve to it, and setup was extremely simple.  Gaming on it is ok, but I wish I would've spent the extra money on a monitor that supports higher resolution.  With this monitor only supporting 1920x1080, everything looks like it's stretched to fit the 27\" screen.  I have a 13yr old 20\" Dell that supports the same resolution over DVI, and honestly, it gives a better picture due to the same pixel count in a tighter space.  I work from home a lot for my job, and do a lot of work in Excel, so stretched lettering gets annoying.My 2 cents, if you're looking for a monitor for a lot a spreadsheet type work, look for a higher res if you're looking for this size screen or larger.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1551398400000}
{"reviewTitle":"Great screen for the money","reviewDescription":"I love this.  The picture is crystal clear, and the screen is matte so there's no glare at all.  The only complaint that I have is that you cannot adjust the height or angle of the screen at all.  It does tip downward a bit which forced me to build a stand to set it on in order to raise it up for easier viewing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652054400000}
{"reviewTitle":"Entry level curved monitor. Good browsing, computing and casual gaming screen.","reviewDescription":"Easy to set up, came in a comically large box. Took some getting used to visually, and the color isn't as nice as it would be on a more expensive monitor. It wasn't an expensive monitor though and I'm very happy for the price I paid. Probably should have bought two, but then I'd have to buy a display cable.The controls being on the back, a staple of Samsung's television design, is a bit annoying. The little directional control works just fine, but having to reach around the back of the monitor just to mess with the menu is somehow more cumbersome than having buttons and (God forbid) a bezel to hold them.Freesync is nice if you've got a compatible card. I don't, but the feature is there when I make the inevitable shift back to AMD GPUs.It's big, it's nice. I might buy another one so I can set up my girlfriend with her own system.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1539561600000}
{"reviewTitle":"works great","reviewDescription":"works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"Good but not great","reviewDescription":"I got this monitor about a year ago and overall I am really satisfied with this monitor (for the price range). Unfortunately, it is not perfect, the back button did stop working leaving me unable to turn off the monitor so it just sleeps when my desktop does. I can still go up, left and right, but I can not press on the button to access the more in-depth menu. The monitor does come with freesync, but the response time of the monitor isn't great and leaves contrast trails. I believe that this monitor is good, but not great, some more reinforcement on the back button or a higher quality switch would have been better and would make this monitor get a 5 star from me. For the price though, you can't really complain, I do appreciate the inclusion of a display port and a 72-hertz refresh rate makes gaming smooth especially with freesync.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1552348800000}
{"reviewTitle":"May not be as described in listing","reviewDescription":"The monitor itself is great fore the price. It has all the features you want for gaming or just PC use. However the stand that was included with the unit I received does NOT tilt at all. It is fixed in a single position that makes for a horrible viewing angle. The instructions that are included with it are generic and show multiple different versions of the stand as well as a disclaimer that the product may vary form the description. Had I known this in advance I would have purchased a different unit. I went ahead and ordered a different mount for it so it isn't a loss, but if you plan to use it as a desktop monitor, beware of the stand that is included.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1600041600000}
{"reviewTitle":"I hope you don’t have Directv","reviewDescription":"This is a pretty nice TV.  The picture is very nice and the sound is good.  We did have a major problem getting Directv hooked up to it (we were just switching it from our old TV to this new one).  I’m following directions and the cable coming from the Directv box is an HDMI cable and the instructions are guiding me to a coaxial jack.  Obviously this isn’t going to work.  After spending 45 minutes on the phone with the Directv guy and trying any number of combinations of things, I had to set up an appointment to have a tech come out.  It took him a while, but he finally got it hooked up.  I did get billed for this, so the TV cost me a little more than I expected.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1570147200000}
{"reviewTitle":"good for price","reviewDescription":"If i could fit another in i would, it's affordable if you want a gaming set up but don't have thousands of dollars for a wide screen plus i can watch things on one screen while gaming on the other.Just check and make sure your pc has two hdmi connections for it cause i had to buy an adaptor.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Great find!","reviewDescription":"I'm totally satisfied with this curved 27\" screen. I use it for work and it's been a great size to split multiple windows on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"I love this monitor","reviewDescription":"This monitor is so great for the price. I use it for gaming and watching sports and I love the quality of it. It was easy to setup, looks great, and has held up nicely. It's so nice I bought another for my girlfriend so we can game in the same room","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Absolutely Excellent!","reviewDescription":"I have been working with the earlier model (vga\/hdmi) of this monitor for some time on a stream I produce. It was time to gain some more screen real estate, so we needed a second monitor.This is the exact same curved monitor but with updated inputs (hdmi\/displayport 1.4).Since the streaming machine has a 30 series RTX card, we needed something with DisplayPort. It's awesome to get the exact same, excellent quality monitor as before, but with updated inputs! Everything matches and works perfectly together!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Just As Advertised","reviewDescription":"This monitor is perfect for my home office. The curved screen and quality of the picture makes it easy to see my computer screen. The product arrived right when the seller said it would. Definitely recommend this product and seller!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Gracias, THANSK,  10  Estrellas","reviewDescription":"Excellent producto,  la oferta, espero que sigan colocando ofertas de más productos así de calidad y eficiencia en el servicio.  Very Good.God bless you.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1701561600000}
{"reviewTitle":"Security","reviewDescription":"Again it was on time delivered undamaged. Brightness and color were amazing.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"best curved monitor for home office","reviewDescription":"Bought two of these 24 inch curved samsungs and I am in LOVE. Before I say anything else if you are a SERIOUS gamer maybe get something slightly more expensive.. If you are working from home, making music, or want to have a bad ass new set up for once get these.. I know im slightly biased because I'm a galaxy nut, but they are exactly what I was looking for. They are 1080p so the picture quality is perfect and exactly as advertised as far as I'm concerned. If you're a picky gamer pay 3 times as much for slightly better resolution and a higher frame rate and stop crying. Read the description its 60 hz which is all I need. I bought a type c docking station, connected it to my samsung galaxy flex alpha, and if you have two extra monitors make sure that it supports triple display, so double check that unless you only plan on connecting one monitor. Or double check if you use Mac, I know those are weird. One hdmi cord from each monitor into the docking station and you're rolling! No speakers, but I use a jbl flip via aux cord to laptop if im not wearing headphones anyways. Was not planning on mounting them when I originally purchased, but the way the stands are, it makes the monitors look like they're slightly off center when side by side, making a seamless connection between the two nearly impossible. My desk is not able to have a C-clamp mount so I bought a free standing mount and now they line up PERFECTLY. Very happy with the picture. Settings aren't complicated, i.e. my dad could figure out how to make it look good and he can barely send a text. Game mode automatically changes the settings to a great picture but has the brightness all the way up. I love it because next time you go to use your computer it's back to normal.. unless you choose game mode always on. Good luck","isVerified":true,"ratingScore":5,"reviewReaction":"43 people found this helpful","country":"United States","date":1593302400000}
{"reviewTitle":"Not bad for the $","reviewDescription":"Pretty nice monitor for the cost! Lightweight! Haven't tried gaming on it, but we'll come back and update if I remember","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Samsung monitor","reviewDescription":"It works perfectly, has a very good resolution and amazing size","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"As expected","reviewDescription":"Monitor was purchased with the expectation it is of lower quality and I was fine with that. But what I didn't expect is that when the monitor is powered up for the 1st time everyday, it has erratic white lines that shoot across the screen until it gets warmed up. I contacted Samsung support and they sent a return label and handled it as they should. All in all for 150 bucks I am happy with it. But it is what you should expect and that's a cheap monitor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1586563200000}
{"reviewTitle":"Great screens, wobbly base","reviewDescription":"I bought 2 of these beautiful monitors and am thrilled with the picture quality and brightness.  However, the base they sit on is not nearly as stable as they should be.  Even as I type this review, they are both shaking just from the impact of my fingers on the keyboard.  It gets worse when I'm writing.  I only use them for work.  I am happy for what I need them for.  However, they would NOT be my choice for gaming because the wobble would drive me crazy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1598227200000}
{"reviewTitle":"It’s decent","reviewDescription":"No speakers and the graphics are not the best. But i got this for my 11 year old son it’s good enough for him. I just feel like the curve makes the graphics look weird but idk much about this stuff","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641513600000}
{"reviewTitle":"Max resolution is 1920","reviewDescription":"I ordered these for my office but had to return them when I found out that they would not give me the resolution I needed. It is unfortunate because they are a good value for the price. Although I am not a PC gamer, I would think that today's games require higher resolution than what these offers.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624147200000}
{"reviewTitle":"Monitor missing mounting threads","reviewDescription":"Monitor appears nice.  Actually runs off 12v DC with 110 ac adapter.  So it could be used in RV or mobile solution.Only complaint... One of the monitors I ordered was missing the female threads for bracket\/wall mounting.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638230400000}
{"reviewTitle":"Once assembled stand cannot be removed for wall\/arm mount","reviewDescription":"I would have given this a 5 star but for the most ridiculous stand clamp. I had it on a stand and then wanted to remove the stand to mount t it on a arm but there is no way to remove the stand once you have assembled it. So I had to open the back screws which basically broke the led screen... I am very upset because it was less than a month old and every other Samsung or any other company monitor or tv allows you to remove the stand for mounting easily","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1595376000000}
{"reviewTitle":"arived used sold as new","reviewDescription":"this product arrived broken and used , item sold as new. Customer service was Great and fast. they are sending a replacement. We will see what happens with the replacement the replacement item arived in good shape and works well.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1639785600000}
{"reviewTitle":"Screen does not tilt","reviewDescription":"Was not a fan of how the screen doesn't tilt up or down. Had to return, but besides that seems like a great monitor","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648166400000}
{"reviewTitle":"Glitches after 1 week use","reviewDescription":"I dont want to point out what's wrong and act like this isnt an absolutley awesome TV. Please see the video to see the glitches it started doing just about after 1 week of purchase. I need this fixed. I'll be contacting the seller and seeing if we can resolve this.","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1613606400000}
{"reviewTitle":"Great, but sent the wrong cord?","reviewDescription":"The monitor is great and all, but...it requires an HDMI cord, which is supposed to be included in the package. The package included a cord, but it wasn't an HDMI cord that would fit the monitor!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636329600000}
{"reviewTitle":"Excellent choice for a home office","reviewDescription":"Great buy for the price, the build & display quality is excellent and I finally get to work without straining my eyes looking at my laptop's small screen.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Just what I needed!","reviewDescription":"For use in my home office; the screen is large, clear, and meets my needs totally","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"If you don't care about latest and greatest!","reviewDescription":"Don't get me wrong, this is a great monitor. Just know what you're buying! You won't be getting a UHD\/HDR 4k, 1ms 120Hz refresh super make-you-a-better-gamer monitor. I bought this model for curved, 1080p, 60±Hz and it works great for that! I do not have an AMD GPU, so I can't speak on the sync for smoother gaming. However, combined with the EVGA 1070 and some settings tweaking, my games look good and feel good on the eyes. For the work aspect: I work in spreadsheets, Engage LiveOps (Serenova) and am web browsing all day doing customer service as part of a digital team. The monitors are run through a Lenovo dock powered from my company work laptop. As before, taking the time to tweak settings made the monitor shine. It was fine right out of  the box, but was most satisfied after settings tweaks. The eye saver mode is actually coming in handy for long work shifts. I noticed a difference at the end of shifts compared to when I didn't use it, but obviously it throws off the color, so won't be handy for photo editing or anything color oriented. I use this monitor as my main monitor and a smaller flatscreen 21\" as secondary. I just ordered another one of these 27\" curved as I realized I grabbed all windows from the 21\" and brought them over, making myself less productive.I'm very happy with my purchase and with Samsung on this monitor. And while this older model is still around to buy new, I was convinced to get a second one. Hope the review helps you decide to treat yourself for $200 also!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1522022400000}
{"reviewTitle":"Excellent quality","reviewDescription":"Excellent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"Screen looks excellent,","reviewDescription":"Picture, including brightness and color, are excellent especially in comparison to the 24” LG TV screen I am using for my secondary monitor. I am completely satisfied with it as it stands today BUT I did face one relatively minor issue as I was setting everything up and preparing to mount the monitor onto my wall. There is a bracket type thing for the stand to connect into on the backside of the monitor that looks like it should come off but I found no way to remove it this leaving it sticking out from the back an inch or so. This allowed ZERO room to be able to tilt the screen down once it was mounted in the space of the other monitor I had. I made something out of a block of wood that cannot be seen so that it protrudes out from the wall enough so that the screen can tilt down and allow that bracket to be out of the way. Maybe it can be removed..? ? It was not mentioned in any manual so I worked around the issue. Problem Solved, Daddy happy, Son happy... All is well.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1610582400000}
{"reviewTitle":"Great Screen at the Price Point","reviewDescription":"Samsung makes a great screen\/monitor. I got this for a remote work office setup and it has been perfect. I use it for my work laptop (HP) and have used my personal (Mac) and had no issues. I would say it's good for basic needs, and would go higher quality for gaming.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Great color","reviewDescription":"Purchased two for use in my home office. They have fantastic picture.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696118400000}
{"reviewTitle":"Beautiful picture","reviewDescription":"Crystal clear display, easy to set up, great quality!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Very good monitor on a budget","reviewDescription":"This just came in a couple of days ago, so I can't speak for longevity. However, out of the box this monitor is fantastic. The stand is easy to snap together without tools while still feeling solid and sturdy. The screen is super bright - I had to turn on Night Mode on a lot of my commonly-used sites - and the colors are rich and deep. The white is bright, the black is dark, and picture quality is wonderful. This monitor replaced my 23\" Vizio TV that I'd been using as a monitor for seven years, and it could only do 720p, so upgrading to full 1080 was a big jump for me. That being said, if you're looking for a high-performance gaming monitor, this ain't it. Good luck finding one for 200 bucks. It's not 4K and it's only got a 60hz refresh rate, so anyone who insists that 144hz+ is the only \"real\" way to game is gonna have to look elsewhere. But that isn't the fault of this monitor, thus the 5-star review. It doesn't claim to be high-performance gaming equipment, and it's not priced as such. A 4K 120-144hz monitor is gonna run you $500+, but for 200 you can't beat the quality of this one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1587340800000}
{"reviewTitle":"To good of a customer rating to ignore!","reviewDescription":"I had three old displays on this computer. I got really tired of three displays that were all different. My eyes had to constantly adjust between the different qualities. Last week I bought here on Amazon three of these because it had a 4.9\/5 rating and people marveled at the colors and clarity. They were not wrong. But there is some adjustment needed to get an outstanding picture. My solution, that took awhile to discover, was to put the monitors in cinema mode and use the Nvidia control panel to make the adjustments. I do not play any 3D games that require AMD freesync so I cannot comment on that. The games that I do play though are so much more fun to play on this monitor because when setup correctly they just pop of off the screen. I also see more detail in the darker areas because of the 3,000 to 1 contrast ratio. The continuous curve of having three of these monitors side by side is also very pleasant compared to having three monitors angled together. They have no internal speaker though so I had to buy speakers. I ended up getting a 32 inch sound bar and connecting it to one monitor with an auxiliary cable and placing it just behind the monitors. I was worried that the sound might not be so good however the sound is great. Also there were no bad pixels! Compared to my other monitor experiences I would give this monitor a 6 out of 5 if I could.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1472601600000}
{"reviewTitle":"Worked for less than 3 months.","reviewDescription":"The HDMI cord they sent was dirty and had to be cleaned before it would even work, then it kept disconnecting every time I moved my laptop or if I breathed too close to it.The screen itself is great and was easy to setup.Edited to update: no longer works, even with a new HDMI cord. My laptop is recognizing it as on, but the display itself does not work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686614400000}
{"reviewTitle":"Faulty Product!","reviewDescription":"Unfortunately my return window has closed and I’m beyond disappointed. After finally being gifted my desk mount I took the monitor off the stand to attempt to mount and just noticed how poor production has misaligned screw holes (so a screw CANNOT feed into this making the monitors useless for what I intended, not to mention the separate mount and now hole drilled into my desk). If you plan to mount these PLEASE check that you can screw into these holes before your return window closes.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"BUYER BEWARE","reviewDescription":"microsoft has better customer and tech support in comparison to samsung. i bought three 27 inch curve monitors. the first one started flickering after just 10 HOURS OF USE. it was used on a laptop and xbox. same issue persisted. traded cables, both power and hdmi, with no effect. my second monitor started doing this shortly after my first. be ready for out of pocket expenses when sending these back for work. the third one hasnt started this problem, yet. gonna send it back anyways. avoid these monitors and company.  does what it is supposed to do and does it GREAT for around 10 hours. customer service, a joke. their website barely works and constantly crashes. the website assistant will also fight you tooth and nail to make a selection. after many failed attempts to get just an account started they (samsung) disconnects the chat. thats okay, you have a phone service. called the phone, was quick to get labels but also to let me know that alot of this will be out of pocket depending on the problem. AVOID, DO NOT BUY.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1571702400000}
{"reviewTitle":"Failed after only 6 months. Warranty is useless.","reviewDescription":"6 months after buying it, the monitor started making a high pitched screeching noise.I contacted Samsung support, and sent the monitor in for repair.I received it back two weeks later, and the problem was still there.I requested to speak to the \"Executive Customer Relations\" team to see if they could replace it.They were supposed to call me within 48 business hours of the request, but they didn't call me until a week later, just to tell me that I had to get the monitor serviced twice before they would \"consider\" replacing it.I sent it in for repair again, but the techs failed to fix the problem yet again.I called the support line once again and requested a callback from ECR.A week passed, and I received no call. I called customer support and the rep said he would speak to his supervisor so they would definitely call me within 48 hours.It has been another week, and they STILL haven't called me.Don't buy Samsung products because their warranty is useless. Worst support on the planet. I've been at this for three months.","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1500854400000}
{"reviewTitle":"Cheap stand","reviewDescription":"Display leans forward too much. Not at all adjustable. Very cheaply made. Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"0\/10 would not recommend.","reviewDescription":"I've had this monitor since the end 21' as a dual screen set up for my Pc, hardly used it other then discord or music off to the side and today it simply lost all display in the lower half of the screen. I have 2 flat screens from circa 2013 that seem to be out performing this Samsung 'Curved\" monitor. Just silly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Ordered a new monitor but used one was sent","reviewDescription":"I placed an order for new monitor and a used one was sent to me. The package even has writing saying “problem solve” and there is no plastic wrapping, cables are loose and monitor base is missing in the package.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"The Description Of The Monitor Is Incorrect On The Amazon Page","reviewDescription":"I was very disappointed that the description on the Amazon page about the monitor was not correct. I spent more time packing it up and sending it back than unpacking it. We should expect more from Samsung.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Do not buy, complete waste of time and money","reviewDescription":"I bought this monitor because it was a cheap option and Samsung is a well known brand so I figured the product would be good, but that was not the case. After having this for less than a week I started experiencing numerous problems, the biggest of which being the monitor constantly turning off randomly when used, and the external speakers having the sound constantly cutting in and out every half second which makes the speakers useless as nothing can be listened to through the monitor and since the monitor doesn’t have built-in speakers, you need external speakers if you use your monitor for videos or anything if that nature. Do not buy unless you want to return in a week and a half like I had to. There are more expensive monitors out there for a reason (like the MSI 27-inch curved that I bought instead) that are out there and priced higher for a reason, they’re worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1599177600000}
{"reviewTitle":"BAD QUALITY (also Breaks\/cracks extremely Easily)","reviewDescription":"Ok, I am a gamer and an avid movie fan so let me explain why this monitor sucks.1. No audio (unless earphones or external speaker)2. Only 1 HDMI cable, so if you have more than 1 use for it (like a game console or laptop connector) get an HDMI splitter or be prepared to carefully remove and plug in HDMI cables everytime you need to switch sources.3. high price for good but not exceptional visual quality (monitor top speed about 60 fps)4. Breaks easier than any iPhone or Apple product. If you get it, treat it as if its a thin glass panel.5. Lack of adjustments possible. ok so if you get this you literally cannot change the way it faces up or down. If on a regular desk and at a regular chair it will feel and look like its way too low angled and you feel like you're looking down and not at it (small thing but big for gamers or people looking to immerse themselves).","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1545004800000}
{"reviewTitle":"Unfortunately the quality of text is poor. I am using this monitor in an office ...","reviewDescription":"Unfortunately the quality of text is poor.  I am using this monitor in an office application, and the text is very difficult to read.  Maybe its a good monitor for gaming, but as far as doing any email, document editing, powerpoints or spreadsheets, its difficult to view.  I have looked on line to see if the settings were wrong, but there's nothing.  And the literature that came with the monitor is too basic.  I have a Samsung TV, which I love, so I thought that the quality would come through on a computer monitor.  But no such luck.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1475020800000}
{"reviewTitle":"Great picture but won’t last long","reviewDescription":"After three months of regular use, I turn off the monitor one night and it won’t turn back on. Blue light is solid indicating power is off but it won’t take any input for turning on. Tried unplugging it for an extended period of time, tried moving to an alternate outlet and still getting the same thing. Moved both my computer and my Xbox to an alternate display to make sure both of these didn’t go out and both worked fine. Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1550534400000}
{"reviewTitle":"The stand attachment was missing the screws -- the documentation did not specify a size...","reviewDescription":"As stated above.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Tilts Forward","reviewDescription":"Monitor Leans forward. This is not an assembly issue for me as the monitor is rather elementary and it's not because it's curved.  It appears to be poorly manufactured.I am returning it!! ASAP!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637884800000}
{"reviewTitle":"Initially worked okay but then went bad after using 3 days a week within a month!","reviewDescription":"Disappointed as I needed this monitor for my office and thought a Samsung would last well.Thanks to Amazon's policy and warranty I was able to send it back.  I also wanted a monitor that could not only be adjusted up and down but also tilt back and forth and swivel.  I replaced it with a Dell.  So far that is working well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580083200000}
{"reviewTitle":"Multiple issues","reviewDescription":"We've ordered 4 of these. First two about 17 months ago. One just crapped out. Ordered another 2 for s different employee and one of them didn't have the polarization filter in it and looked like a rainbow. Returned and replaced. I've never had any other monitor with this high level of failure.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600819200000}
{"reviewTitle":"Not suitable for modern gaming","reviewDescription":"After giving it a shot for about a week I've decided to return it. There's significant motion blur when playing racing games such as Forza and far off textures are pretty pixelated on games such as call of duty black ops 4 and Battlefield 5. There's also an annoying yellow tint that I just couldn't seem to get rid of no matter how much I played with the settings.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1544054400000}
{"reviewTitle":"RECEIVED WRONG PRODUCT?","reviewDescription":"Received a completely different product, still from Samsung but its white, and a different model. |I received Model: C27F391FHN which has a VGA port instead of a display port.This model works great, but I was hoping to receive my product with a display port and not a VGA port......","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595980800000}
{"reviewTitle":"it worked fine though the colors and brightness are a bit","reviewDescription":"Bought it during black friday, it worked fine though the colors and brightness are a bit.. weird. It's either too bright, or too dark, colors are either too muted or too vivid. There's no happy medium. Today however the top half of the screen is covered in black & blue dead spots, nothing I can do fixes this.Might be just a defective monitor from get-go, but I wouldn't buy a second.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1522022400000}
{"reviewTitle":"BE CAREFUL WITH WINDOWS OPEN!","reviewDescription":"This would be a 5-star, but the other night I had the windows open and a gnat got in between the outer glass and the display itself! I would not recommend this because of the lacking security.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1624838400000}
{"reviewTitle":"Several Issues","reviewDescription":"First problem right out of the box. Most pc monitors have a cord and plug with (3) vertical pins that plugs into the Monitor. But Samsung, see the attached photo, has a strange power cord setup that takes (2) cords. This created some problems because I wanted to use my existing cord which is buried within my desk. The  monitor tint seem to be a tad out-of-whack. The whites were a bit pink\/beige. I tried to adjust it so many times but it wouldn't work. So I had to change my background from \"Light\" to \"Dark\", which I don't prefer.  So I returned it and purchased an HP monitor and love it!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"Non adjustable base and the screen leans forward.","reviewDescription":"The monitor itself is great, 5 Stars. But it's base is completely non adjustable. Additionally the screen leans forward on its base. The top of the screen is about 1\/2\" more forward than the bottom of the screen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Bad choice.","reviewDescription":"Bad choice. Just bought it to work as a second monitor. Have it next to another brand monitor. This Samsung (24\") is not bright, not adjustable and just looks really bad next to the Dell. It was inexpensive, and might be good for the price, but for very little more I can get a good quality monitor. I'll return this if I can, but I'm certainly not going to use it. Bought it right after getting a Samsung TV, and now I am 0 for 2. I had Samsungs previously and like my older TVs and Monitors. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Terrible for Text and Images","reviewDescription":"All text is super super pixelated and grainy and there is an overall tint to the screen that no amount of adjusting can remove. Movies and stuff are alright. I got this as a second monitor for me as I design and develop mobile apps. I was hoping this would provide a good image quality and colour accuracy so that I could use it while designing but it has this really strange tint to it and I cannot (after literally hours of trying every setting) get it to go away so it must just be the screen quality. So I decided to use it while coding and came to find out that the resolution is not able to display text clearly and crisp. Instead it looks terrible and hardly readable. I have had to just zoom like crazy to that I can better make out text which is not ideal when trying to sort through hundreds of lines of code. I did find that watching movies and stuff were alright on it. Overall, I would not recommend this if you are at any point going to need to open a word document, code, browse the internet, or do anything needing colour accuracy.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1608422400000}
{"reviewTitle":"Three months great then just quit working.","reviewDescription":"Worked great for three months then it just stopped working. Powers on and connects to the computer but there is no picture at all. I have trouble shooted any computer issue that may be the problem but it just won't work. I can get another monitor to work fine on the same computer using the same cable and port.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"it's the cheapest in this category for a reason","reviewDescription":"It's \"fine\" but not everything it says on the box. The displayport doesn't work. Like at all. Neither do the built in speakers. But an HDMI to displayport adapter and I'm all set, and I never planned to use the built in speakers anyway so it gets the job done.It was frustrating to have to find work arounds though.But if you're fine with only one HDMI port, full HD \"only\" and the usual 60hertz refresh rate and want a decently large curved monitor it'll mostly work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"Doesn't work with nintendo switch hdmi cable","reviewDescription":"Works fine for computer. But when playing Switch games, it'll randomly flicker black for a few seconds and then go back. Occasionally, it'll just stay black until I turn the switch on and off.Nothing wrong with the switch as far as I can tell. I've tried everything the internet said--tons of different settings, different HDMI cables, everything. I know the issue is the monitor because the exact same setup on the TV works fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Screen went all white in three months","reviewDescription":"Sat at my desk to see a white screen. Rebooted. Unplugged and plugged back in. Checked all the connections and still white screen. Tried to go through Samsung.com for warranty and their warranty page kept showing up blank. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686614400000}
{"reviewTitle":"Overall bad quality, and bizarre and annoying sound from monitor","reviewDescription":"This monitor is not worth trying. The first thing i noticed was that the stability was awful. If I even lightly bumped my desk, the monitor would shake. The picture quality is atrocious. It's extremely blurry, and regardless of the settings, it doesn't seem to get better. But the worst part BY FAR, was that the monitor made this annoying buzzing electrical noise. I could almost get rid of it by cranking the brightness up, but it was still there and then this picture was too bright. The noise changed frequency based on the color and brightness of the image on the screen.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1661904000000}
{"reviewTitle":"Does not adjust in anyway whatsoever","reviewDescription":"I was disappointed because this screen stand does not adjust (bend down or up or side to side) at all.  I cannot imagine people would not want this feature.  It's a decent product but, for the price, can do much better.  If you don't mind the screen pointing at exact angle it is when attach the stand, then it's fine.  I found it not good for this reason.  For this price, they should have a halfway decent stand. I would look elsewhere.  Whyn would they not make this with this basic and very necessary feature.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660694400000}
{"reviewTitle":"Not bad at all, but randomly cracked","reviewDescription":"I bought these on Aug 23 of 2020, have used them daily for work, gaming, video editing etc. Look good side by side with a second one on the Vesa mount. Today the bevel randomly cracked and scared the poop out of me (images provided) coverage from amazon a disappointment, it ended in February of 2021 so SOL till it fails and I get a replacement","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634774400000}
{"reviewTitle":"unmountable","reviewDescription":"The picture and definition is exactly what I would expect but if you intend on using it with a stand or mounted anywhere, you have to take the back piece off. They put the mounting holes on the back so they are aware this is how it will be used but you basically have to rip off the back panel to unscrew the bottom stand. Very disappointed in this because it was not simple to do and in the process I cracked part of the frame. very disappointed that a company like Samsung would have such poor usability.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1611273600000}
{"reviewTitle":"Great display, bad downward tilt","reviewDescription":"The screen size and display is great but the screen itself tilts downward on the stand which stresses out my eyes on my standing desk. Ended up purchasing two Acer monitors for my home office and gave this to my teenage son for homework and gaming. It works much better on his regular desk and eye level so it worked out.Works great and display is nice but potential buyers should know about the tilt to compare with the type of desk they have.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616544000000}
{"reviewTitle":"The graphics are not great","reviewDescription":"This was a disappointing purchase.  At first I didn’t think the inability to adjust the position of the monitor would bother me, but it turns out it is a required feature. The graphics are also not great - especially since it’s a curved monitor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643587200000}
{"reviewTitle":"Almost perfect","reviewDescription":"Great product but needs to be adjustable. Screen angles downward.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Decent monitor, cheap parts","reviewDescription":"It’s been about 5 months since purchase, it’s a good monitor if you get it on sale for 130$ or less but it’s definitely not made with the best parts. The switch used to turn on the monitor is now failing, making it rather annoying to turn on and off or go through the setting. Minor gripe but something as critical as the ONLY button on the screen shouldn’t be failing within 5 months..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621555200000}
{"reviewTitle":"Dead pixel","reviewDescription":"Just received this product and set it up. I have another monitor just like this. Same brand as well, but unfortunately I'm having some issues.Straight out of the box the colors were off a bit. After about an hour of manually adjusting the color I got it  sorted out and the cors looked accurate enough. Unfortunately that's when I noticed what looked to be dirt on the screen. Upon further inspection it is not dirt. It's something behind the screen. Either a dead pixel or something but I can't do anything to remove it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1587600000000}
{"reviewTitle":"Great until it wasn’t","reviewDescription":"Great picture, nice size, and worked well.  I bought two but one died after a year.  I will be replacing it with the same monitor but will be getting the insurance this time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1647216000000}
{"reviewTitle":"Great monitors but doesn't line up well with the stands","reviewDescription":"This is a great monitor dont get me wrong I got two btw when I went to set them up I wasn't able to use my vesa mount because my new desk wouldn't work with the vesa mount so I just set it up with the stand and man they did not want to sit flush up against each other (they still dont) I did move it around and put stuff under the stand and it kinda works now but still bothers me a little bit I am getting a vesa mount that will work with my desk but until the time being I have to deal with the monitors being slightly off","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1565654400000}
{"reviewTitle":"You get what you pay for","reviewDescription":"Dont get me wrong, the monitor is decent, I snagged this one for 150 and I saw the other day the price jumped to 250 or something around 200 and it is not worth that price one bit. I'd say it's worth closer to 100 flat, maybe 115 because for the simple fact you cant adjust the thing. I wish I would've read the reviews more thoroughly and instead went off of the overwhelming rates of 5 out 5 stars but that's not the case here. Picture quality is great, not out of this world. The quality of the stand and monitor it self, not the actual screen, feels quite cheap too.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1590710400000}
{"reviewTitle":"Very clean Screen love using it for work\/gaming","reviewDescription":"Very clean Screen love using it for work\/gaming. Very clean and curved well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Great quality for the money","reviewDescription":"Best monitor in this price range.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Display","reviewDescription":"I am writing a review after using it for almost a year and the screen is too good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"I love this monitor - curve is very slight which is what I wanted.","reviewDescription":"Perfect size for my desk and distance viewing 20 to 25 inches away.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"My first curved screen","reviewDescription":"I work from my home office as a software engineer so I'm in front of my screens practically all day. I bought 3, two for me and one for my wife. I replaced two 24\" HP flat screens with these bad boys. These being my first curved screens, I was a bit concerned that I wouldn't like the curved effect (it seemed a bit gimmicky to me), however, I couldn't be happier. The brightness and clarity of these screens are also superior to my previous screens. I fiddled with brightness, sharpness, contrast but, in the end, I didn't have to tweak them all that much. The default settings are pretty nice. While these screens are larger, they still have a max resolution of 1920 x 1080 so don't expect a super fine HD quality image.They were a breeze to assemble. Just snap the base into the slot in the monitor. I like the stand itself. It's very low profile and leaves more space on my desk for my keyboard (wireless, illuminated, Logitech K800 - I suggest picking one up) and mouse (Microsoft wireless laser mouse 5000 - nothing fancy, gets the job done). When I bump my desk there is a bit of a wobble to the screens but it's not bad or very noticeable. Sometimes when I'm vigorously typing away, I will get a little wobble, but, again, I remain unperturbed. I was crossing my fingers (figuratively of course) when I pulled the screens from the box and examined them for damage. The surface of each of the three screens I purchased was in flawless shape and after getting them hooked up, I looked for any dead pixels, color lines, etc. that would be a no-go. I'm pleased to say that all three screens were in top shape.I primarily use Visual Studio and I found that I had to change the font from the default Consolas to another, finer, monotype font (I found a free one called Monofur that works perfectly at 12pt) in order to optimize font clarity and lines of code on the screen. With these screens Consolas at 12pt was way too big. And simply reducing the font made it ugly (pixelated, blocky, etc.) so I wanted something better. I'm not sure how well the screenshot will translate to your current screen but I've captured a little snippet to share how clear my screen looks to me.As for the curved effect, I was a bit concerned after reading other reviews, some of which go on about how terrible they are for spreadsheets. I'm not sure what that's all about since I find that these screens are ideal for looking at long lines of text across the screen for extended periods. When these screens are in front of you the curve itself is almost imperceptible. As I mentioned, I use two screens sitting side-by-side and I find that these perfectly wrap my work area in a more immersive way that my previous non-curved screens. My wife works on the other computer as an editor (so again lots of text and spreadsheets) and she absolutely loves it.The ONLY complaint I have at the moment is that when I sit these two screens adjacent to each other, the tops\/bottoms don't line up perfectly. One edge is raised about 1\/4\" over the other. I haven't fiddled with the monitor positions too much to see if I can correct it since I don't really notice it while I'm working. I have a few thoughts on how to remedy it if it actually starts bothering me so I really can't complain.Overall, if you're looking for a nice upgrade to your current screen without breaking the bank, these screens will do the job nicely.","isVerified":true,"ratingScore":5,"reviewReaction":"331 people found this helpful","country":"United States","date":1536278400000}
{"reviewTitle":"This is great!","reviewDescription":"I am so happy that I pulled the trigger and purchased this monitor.  I use it 8-12 hours a day to work and what a difference just a few inches makes!  The set-up took 5 minutes and it has a lovely picture.  I could not be happier.  I was hesitant due to some of the reviews but geez! they must be extremely sensitive or pectuliar.  Samsung has never let me down in my HDTVs and so I went for it.  A+. Getting it on sale made the deal even sweeter. <3","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Absolutely love this thing","reviewDescription":"Amazing monitor 10\/10 recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Great picture, Questionable FreeSync","reviewDescription":"So far my monitor looks and performs fantastically.  I'm able to use it with my existing monitor mounting setup out of the box, and I'm currently play games and do various other things normally as I've done before.  The only issue I've had is FreeSync.My situation may be different, so take it with a grain of salt.  I have 2 monitors (1 FreeSync, one not) and a Ryzen 2700X with an RX5700.  When I enabled and tried to use the FreeSync function, no matter what I tried to do game performance would start to lag, and eventually freeze up.I would get on a high end 25 fps, and on the low end 10 or less.I tried uninstalling and reinstalling drivers with no luck.  Unless the monitor comes with its own drivers, I will be avoiding FreeSync until I upgrade my PC.Beyond that aspect, the monitor itself has a great curve to it, and the picture looks great.  It's also fairly light and easy to maneuver on my mounting setup.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"review is for monitor not stand","reviewDescription":"Yes, the stand is trash... who cares go buy a VESA 75x75mm mount like I did. The nature of a curved monitor demands a movable arm type of mount anyway.. As for the monitor itself I bought for my old gaming rig that plays games up to 1080P. This monitor is an absolute beast for gaming with like a 2ms in gaming mode or something like that, faster than my flagship 2022 sony oled in that regard lol... I feel 1800R curve is perfect for everyday use, old school gaming and 1080p gaming. The colors are really good after initial calibration using widows 10 software... extreme value for the money paid. Not to mention pre pandemic electronics always seem to last 10X longer than anything manufactured 2021 and beyond... I expect this monitor will last for years, or decades.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Great monitor","reviewDescription":"Price was right. Great picture quality  Delivery on time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"False advertising","reviewDescription":"I ordered a 27\" monitor which actually measures only 24.5 inches. The box also measures less than 27\" across.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"For the price, it's a decent monitor","reviewDescription":"Bought this as a gift for a friend. They seem to like it.Don't get me wrong though, you'll want a muuuch better screen than this for gorgeous picture quality if you're a gamer or work with high quality photos, art, video editing software, etc. But for the average everyday user, it gets the job done nicely.The screen is big enough for just about anyone. The curved feature is alright. I'm not a big fan of curved screens to begin with, so this isn't something I'm particularly fond of (but it looks nice nonetheless. Also my friend was adamant about this, so there we are!)The eye saver mode is a pain in the ass though. It makes the screen so... fuzzy? I guess? That was one BIG complaint my friend has. They never use it even though they were looking forward to having something to help with eye strain since they work from home.Overall, if you're looking for a cheap, large, curved monitor that can get the job done then this is a good choice for you!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"Display Port Adapter Is Useless For Me","reviewDescription":"I was under impression that I can connect either my Desktop or my Laptop using the Display Port Adapter connection. No it doesn't or maybe I am not doing it correctly.  I have two other 27 inches NOC monitors and these monitors have DVI and HDMI connectors.  This Samsung curve monitors only have HDMI and Display Port connectors.  I purchased two of these back in July 2018 and I have been using the HDIM connector to connect both monitor to my desktop PC or Laptop.  I am getting so impatient moving around the connection every time I do office work on my laptop.  I ordered the Amazon Display Port to HDMI cable and as soon as I received these cables today I tried to connect my Laptop to these two monitors using my Display Link pluggable dual head multi display adapter via the Display Port adapter.  That doesn't work.  I tried to connect my desktop PC thru the monitors Display Port adapter with no luck either.  Very disappointed.  I almost forgot to mention one of my Samsung curve monitors power button sucks.  It so difficult to turn it off.  Sometimes it works but most of the time it doesn't.  It won't switch to the power button.  I mean it is so difficult to toggle from Menu, Source, Eye Saver Mode, Return, and Power Off.  Also one of the monitor has a dead pixels. I thought it was just a scratch.  I wish I can return them but it's too late.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1546128000000}
{"reviewTitle":"Samsung hides too much about this monitor's specs","reviewDescription":"I was disappointed in this monitor. Because I do a lot of photography & print on canvas on a Giclee printer which costs over $500 to replace the ink in (& the canvas costs a bundle too), I do calibrate my monitors using a Datacolor Spyder5 in order to not have to print a zillion copies until the colors on the printer are tweaked correctly. I put a lot of effort on trying to calibrate the monitor before I do a print run. Which highlights the issues below.MAJOR CONS:- You have to hunt on the Samsung website to ascertain that the gamma adjustments are Mode1 = Gamma 2.2, Mode2 = Gamma 2.0 & Mode3 = Gamma 2.4- There is no information on the \"Color Tone\" (which is really color temperature). Settings are Cool 2, Cool 1, Normal, Warm 1, Warm 2 & Custom. Samsung needs to at least make the color temperatures for each of these settings available on their website. Better yet, do what my Viewsonic monitors do and just state the color temperature on the display as you scroll through these settings. (Same with the gamma settings.)- Have yet to get it to actually meet the NTSC color gamut specs on a chromaticity diagram.OTHER CONS:- As many have pointed out, this monitor has no speakers. While the system this monitor went on already has really good external speakers so I don't care, I can see why a lot of folks found this easy to overlook as most monitors these days have speakers.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1532217600000}
{"reviewTitle":"Photo Image Deceiving","reviewDescription":"Two things to be aware of. As hinted in the Subject line, the Samsung photo image is of a curved building. That image was specifically selected to increase the PERCEPTION that the 27 monitor's 'deep' curve is more dramatic. Upon, unboxing... it's not. Secondly, the base is rather feature-free. You simply screw in 2 base components together. The shortcoming of this simplicity is that you have zero adjustability to tilt the screen up\/down in alignment with your eye-level while at your desk. They could have at least given us 5-10 degrees of tilt capability. Otherwise, as expected from Samsung, it is a solid quality monitor at a good price.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"FIXED in a Downward Position!","reviewDescription":"This monitor is great, EXCEPT that the tripod type mount is not adjustable, making the screen face downward at about a 15 degree angle. It appears to be a Samsung design ERROR. You can send it back OR PROP UP THE FRONT LEGS. The monitor is curved and cool looking, but I really wish I had bought a different one. Gave my old one away, so I put blocks under this new one - looks terrible, but works.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1673481600000}
{"reviewTitle":"It is ok. But not great.","reviewDescription":"This monitor is ok. That is it. The monitor wobbles on the stand. Adjustment is stiff. Feels flimsy. Picture is really only ok and is not so clear or nice to look at.In hindsight I should have bought another Asus as I have on the other computer. It is so much better. In every way.Also be carful when you click “available from other sellers cheaper” as I bought this and the fact that what I got was used was completely not clear until it arrived.When I contacted Amazon I was simply told that I should read more carefully. So it is mine now. Like it or not and this annoys me. Things like this I guess are just plain better to purchase from brick and mortar","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648598400000}
{"reviewTitle":"Works as advertised","reviewDescription":"Good little monitor. No speakers thou bill have to buy some if you want sound.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"Very Expensive for the Size and Quality","reviewDescription":"I have a 27\" iMac and another 27\" gaming monitor and saw this come across my feed as I was shopping for a 3rd, so thought that given my experience with Samsung TV's I would give this a go.IMO it is not any better than a generic brand monitor, and because it lacks multiple inputs and other high-end features, it does not do anything to justify the price.I would not have purchased it if I had another chance to make the decision, but it was already opened and installed before I realized how poor its performance was.A normal browser looks fine, but games and application windows are very pixelated and blurry.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649462400000}
{"reviewTitle":"it’s alright","reviewDescription":"It’s a nice-ish monitor, but it faces downwards and there’s no way to tilt it up, so unless you’re slouched down all the time, you can’t see the screen well. It’s also really pixilated so the quality isn’t the best. I honestly don’t know if I like it, and the fact that it permanently faces down is super annoying and hard to look past.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1668988800000}
{"reviewTitle":"Inaccurate description - Not Display Port compatible","reviewDescription":"I ordered the Display Port version of this monitor, but both came with only VGA and HDMI. A little disappointed. I'm keeping them since they are only work monitors, however. The seller needs to update the description for accuracy. These would have been returned if I didn't have HDMI ports on my docking station.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Fixed height and angle of monitor, and quality could be better","reviewDescription":"I work in civil engineering and was hoping to get a nicer display to work on plans, however my laptop screen has better quality. It somewhat hurts my eyes to read on here. Based on reviews, I thought it would be better. I also did not think about how it is mounted when I ordered it. It is at a fixed height and angle. RIP","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658016000000}
{"reviewTitle":"Good monitor","reviewDescription":"Works and looks fine.  Just the stand points the monitor downwards with no way to adjust it upwards.  Had to buy a separate stand and tilt up","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1670112000000}
{"reviewTitle":"The stand is horrible!","reviewDescription":"Overall, the monitor is really good, but the stand that it comes with is very cheap. It has not adjustment options, and mine was not sturdy at all. The I ended up trading it for a regular non-curved monitor that my dad was not using. If you are going to mount it, I would say buy it, but avoid it if you are planning on using the stand.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649894400000}
{"reviewTitle":"I would buy again but","reviewDescription":"One monitor has a bad pixel","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"Inexpensive, and it shows","reviewDescription":"Colors are decent but it's limited to a rather low resolution. I've got it as a secondary monitor to a very good monitor and the difference are glaring. I really should have read the details better and looked at the max resolution before purchasing... Ah well. Good cheap monitor if you're OK with large text and aren't looking to game on it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1650844800000}
{"reviewTitle":"Display Port Issues","reviewDescription":"The monitor is great and looks very good but the display port did not work. I sent the product back and got a replacement but the display port still did not work when I connected it to xbox and mac. I did try multiple cords so the issue was most likely the monitor.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663632000000}
{"reviewTitle":"Good monitor bad light","reviewDescription":"Monitor is a great but if left in sleep mode there is an annoying blinking blue light and the cable it comes with is basically useless (1ft HDMI) too small to connect to anything and it should have been a DP cable. Seems like curved ones feel a little smaller then flat ones so make you go get an extra couple of inches of what you want.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660608000000}
{"reviewTitle":"on off button sucks","reviewDescription":"hard to turn off","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Just fine except for a faint but annoying defect","reviewDescription":"I work in video. Sometimes I deal with \"interlaced\" footage where the video has black horizontal lines every other row. This monitor has a defect that reminds me of interlaced video: there appear to be faint black horizontal lines between pixels when certain colors are displayed.The black lines are invisible when the monitor is displaying pure white. But for other colors, the lines are noticeable and distracting, at least for someone sitting as close to the monitor as I do. I imagine this might have something to do with the fact that this monitor is large for its resolution, so the pixels are big.Other than that, this monitor is great for its price. There is some color distortion caused by vertical viewing angles, but it is not a major issue. But it has this issue with the black lines, so I have to return it. I would rather use my 2011 ASUS panel (which was a TN) than this monitor.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1569196800000}
{"reviewTitle":"Screen has awful black line, poor quality","reviewDescription":"The screen all of a sudden had a black line doing down the middle and Samsung us saying from “physical damage”, which is not even possible since the screen worked the day before and nobody was in my home office since I worked on it.  Poor service experience and poor quality.  If not for this damage, I’d otherwise recommend, but a screen should not break after six months of use.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1656201600000}
{"reviewTitle":"Screen turns off on its own","reviewDescription":"This screens keeps loosing power. I gave changed my Tarsgus port for multiple display, changed the HDMI cable and nothing works. The display is beautiful but in the middle of working with it it goes out. So you have to unplug and plug back in.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"No speakers","reviewDescription":"This Tv\/computer monitor has no speakers and no sound","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691452800000}
{"reviewTitle":"Burnt!","reviewDescription":"The monitor did not last 2 months! It burnt!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"BEWARE!  Terrible picture quality","reviewDescription":"This monitor might be considered ok if you were a time traveler from 2006…  the image quality is so terrible that my eyes hurt after 5 min looking at it.I ensured resolution on display settings was maximized and even tried multiple HDMI cables, still no luck.I’m planning to return it, but it cannot disassemble from the stand to place back in original packaging.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1657584000000}
{"reviewTitle":"Broken","reviewDescription":"This might be a really good monitor. Sadly I got mine and it did not work. It turns on. But that’s all I was able to go. The screen was damage.When I got it deliver It was just tossed over the fence. No knock or anything.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1669334400000}
{"reviewTitle":"Was a great monitor for about 10 months...until it died","reviewDescription":"This was a good monitor, until it started power cycling and going black.  I have a two monitor set up, and the constant power cycling made the monitor basically unusable.  I can't find anywhere for customer support, and am now shopping Black Friday deals to replace my $200 Samsung.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1669593600000}
{"reviewTitle":"Trash","reviewDescription":"The auto source detection on this monitor is absolutely trash.  I bought these as dual displays and have two PCs connected.  I need to readily put one unit to sleep and boot the other up.  The issue is the monitors fail to recognize that the second source has booted up despite the monitors entering hibernation before I switch.  It's 2020 and these monitors are from 1960.  Thoroughly disappointed with the accessibility of this monitor.  Appears to be a systemic samsung issue and they have no interest in fixing it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1600387200000}
{"reviewTitle":"poor quality","reviewDescription":"at first I didn't believe all the reviews about the shadows in the words, its all blurry and very annoying for the eyes. I tried all possible ways to improve the quality of the image, but even you can see the pixels all over the screen. I'm returning, don't waste your money and time.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1661990400000}
{"reviewTitle":"THE CUSTOMER IS SUPER BAD AND THE QUALITY IS TERRIBLE","reviewDescription":"This is the first time I leaved a 1-star review - after 2 month properly use, the monitor became periodically disconnected and blacked out when using (happened over 5 times a day) then the curve frame popped and the curve  is no longer curving - it became flat - I called Amazon - Amazon transferred me to the wrong department of SAMSUNG and then the SAMSUNG guy kept transfer me to another department and did not solve my issue. DON'T TRY TO ASK THEM TO HELP YOU SOLVE YOUR PROBLEM","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1604620800000}
{"reviewTitle":"Bought two, both failed within 3 months.","reviewDescription":"UPDATE: Since posting this review both monitors have had to be replaced. The first failed within the return period. One day it started having an issue every time the computer would go to sleep. On wake up, the monitor would look like an acid trip until powering it off and back on.UPDATE2: After both monitors failed within months of purchase and dealing with Samsung support, I will not be buying another Samsung product. Their support process is awful and I suspect I have not seen the last of the shenanigans. I CAN NOT recommend these monitors. Lowering to 1 star. :(The second monitor suddenly started having an issue with the display port shorting out. So the monitor would behave as if you were plugging and unplugging the monitor. Swapping cables\/ports had no effect. They are nice monitors but I am lowering my rating to 3 stars due to the failure rate.Pros:- Very nice screens with no apparent dead pixels yet.- Light weight and easy to mount to monitor stands.- Small, clean bezels, with a minimum of lights and controls.Cons:- Comes with HDMI cables, not DP.- Power cord is a 90 degree plug which sucks for power strips and UPS.- Failure rate.- Poor customer support.- Does not play well with multimonitor setups or using switching between HDMI and DP","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1473811200000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working after about 10 days. Was surprised since Samsung usually makes good products. Very disappointed and now have to deal with the inconvenience of returning. Spent over an hour on the phone with Amazon only to find out that I have to package back up and return on my own. Disappointed with the quality of this product. Would stay away from Samsung monitors.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"Went into Sleep mode never woke up","reviewDescription":"Was all excited to upgrade my monitors. Plugged it in got everything running smoothly, went downstairs to make dinner, when I came back up it was in sleep\/powersave mode. Wiggled my mouse, the old monitor came on, the CF39 did not. I proceeded to hit buttons, and mess with the \"power\" joystick in the back. No effect, even called Samsung for support. We went through a 6 hour process, and still nothing. Samsung tells me this is a known issue (as of 2\/01\/23) and that a small percentage can go into sleep mode and while the monitor might \"wake up\" the screen never actually turns on. So I just got unlucky, but beware this can happen.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"Wrong connection ports","reviewDescription":"Ordered this product exclusively for Work-From-Home capability, and needed a DisplayPort connection.  This was reflected in product description as \"HDMI\/DP\" connectivity.  Product only contained VGA\/HDMI connectivity. Submitted for a replacement, we'll see if it was an oversight by product delivery or if this is faulty advertising. Will update my rating accordingly if I receive the correct product.UPDATE: did not receive any resolution. Amazon admitted to it being the vendor's mistake in the description, but offered no resolution other than a refund upon return - so I'm still out my money and have no monitor for work until then. DO NOT BUY THIS PRODUCT if you are relying on specific connection types.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"2 out of 3 ain't bad","reviewDescription":"Bought 3 of these over the course of a month back in Jan. '21 for a triple monitor setup. The first one I bought has always been slightly off-colored than the 2nd and 3rd one, but I never let it bother me. But here we are, not even 8 months after being hooked up, and there is a line of dead pixels. I use the computer for about 2-3 hours a day, maybe 3-4 times a week.. so it's not like the monitor is being \"over used\" or anything. A couple days ago, I was rearranging my pictures from my phone to my hard drive when the line of dead pixels just popped up after the computer was on for about 20 minutes, for no reason. While the other 2 monitors work flawlessly, I am assuming they will probably follow the same fate. You can even see in the pics the difference in color (specifically in the taskbar) and all 3 monitors are set exactly the same. All well, live and learn I suppose.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Nice monitor, won't 'wake up'","reviewDescription":"This is a great monitor when it works, but I can't get it to wake up about a third of the time. Not acceptable at work!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Makes noises","reviewDescription":"Screen makes noises depending on what it showing, very low frequency noises.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Died one day after warranty expired","reviewDescription":"Worked good for 91 days then the picture constantly flickered. Samsung warranty is only good for 90 days. I could sent it to Samsung at my cost and they would evaluate it but refused to warranty it, going back to LG","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Looks great if you get one that actually works","reviewDescription":"This is a beautiful looking curved screen monitor.  The image is fantastic and crisp.  Great for applications that need large screens.  However... and this is a HUGE however.  It is plagued with problems.  I have gone through 2 of these in less than a week and now Amazon will no longer send me a replacement and I am only allowed to refund.  That may be the best thing.  My first one worked great for about 2 days and then would not power on whatsoever.  The plug appeared to output power so it was definitely something in the monitor.  The 2nd one came and I was very happy until I noticed what looked like a hair in the middle of the screen.  On further inspection it was a line of pixels that were dead...  So I am waiting shipment on a different brand monitor now and will refund this one too when the other arrives.  I am very disappointed in this product as there were many good reviews.  Perhaps I just got a batch that was defective.  In either event you may want to compare other brands before buying this one.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1532476800000}
{"reviewTitle":"Don’t buy","reviewDescription":"This monitor keeps flickering in & out. when it stays steady it knocks out my laptop and no sound. At time i have to unplug the hdmi connection  for my laptop to work. This monitor has an issue and you need to corrected  before it blows someone computer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Very good picture quality but the source input detection is a deal breaker","reviewDescription":"I thought maybe the problem was just this monitor but I read through the other reviews and even their  G5 and G7 monitors which are top tier report the same problem with it detecting the input. Basically the Auto source input detection and even on manualsource it has the same problem. Basically when you reboot the PC or you're trying to install Windows 11 the monitor will be blank and you have to manually turn off and turn the monitor back on or at the very least you will miss the bios \/ uefi screen and you will just have to guess when the uefi or bios screens come on and you have to push your function keys blindly to get into them. When installing Windows the screen is just blank even though there is actually is an image being sent out from the integrated graphics or video card during windows setup. Sure this isn't completely unusable but this is just basic functionality a monitor should just stick to whatever input you set it. And apparently people have complained to Samsung and they do nothing about it except rehash scripted replies from their engineers so that means that they are ignoring their customers and they make great TVs but apparently their engineers are incompetent on how to make a basic computer monitor which even an $80 monitor has no problem with the source input. Stay clear of this monitor and all Samsung monitors until they actually start listening to the customers","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1654732800000}
{"reviewTitle":"Pixelated garbage","reviewDescription":"The resolution on this is so low, I have no idea how the reviews are so good. All text and graphics are pixelated. The whites are yellow. Immediately sending this back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Don’t buy!","reviewDescription":"It was a sick surprise to get a “brand new” computer only to have the entire left panel fried. Save your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Purchased 3 Over 1 year ago Review","reviewDescription":"I purchased 3 of these over 1 year ago at this point.  They all share my desk in a multi monitor setup.  I just replaced them with Dell monitors after purchasing a different Samsung last month to compare against Dell for the same price point.One of these kept blacking out for 5-15 seconds randomly and a second now didn't recognize HDMI or Display port input.  The picture is ok if you are just doing work but if you want to game, they are crap compared to the Dells.  I would return them if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Received a refurbished and broken unit","reviewDescription":"This is a decent monitor when it works. However, despite being listed as \"new\" I received a refurbished unit.Normally that wouldn't bother me too much, however it was sent with a DisplayPort cable (this monitor only supports HDMI and VGA inputs) and it wasn't working properly. After obtaining my own HDMI cable so I could connect the monitor to my PC, it started having issues with the screen going black at random. Was instructed by Amazon to contact Samsung for tech support but they were not able to resolve the issue and the product didn't have any warranty (as it was refurbished) so I had to return it. Very poor quality control for a refurbished unit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Does not last past 2 years","reviewDescription":"Purchased two of these monitors right before the pandemic to work from home. Yesterday, one of them finally went out. The screen started sputtering all different colors and next day, totally black. Be warned of the lifespan of these monitors.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"I’m very angry.","reviewDescription":"Worst monitor for gaming I have never been so dissatisfied and unhappy in my life. Samsung makes horrible devices and this is no different, terrible connection issues and will constantly complain about my connected device no matter what it is. I hate this stupid monitor and truly hope you all never buy this thing. Trust me and save yourselves the headache.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Llego roto.","reviewDescription":"La ventana de devolución se cerro antes de que me llegara. Pésimo.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Defective out of the box","reviewDescription":"I've bought this exact monitor locally before and decided to order another one online for a dual set up (was not available locally anymore). The monitor came in pretty fast and the box was undamaged. Like I did with the previous one before, I was going to unscrew the back panel so that I can remove the protruding bracket the stand connects to (it's the only way to do it...I've researched it) so that I can mount it on arms. However, as I placed my screwdriver into the hole where the screw is supposed to be, I found that there was no screw at all. In fact..., there was not even a pre-made hole to allow a screw to go through. I originally thought to myself..\"ok..no biggie... I can deal with it\".  I then looked around the frame and saw that at the bottom part, the bezel\/frame and back plate were not flushed and I could not simply flush them into place by pushing them together. All I could think about was how light was going to emanate from the bottom edge of the screen and annoy me. At that point, I decided to test the monitor, and lo and behold, 2 ugly solid dead pixel lines ran vertically through the screen.Being from Guam, I'm quite disappointed in receiving a defective product because returning items and waiting for a replacement is quite a hassle here. I mean seriously, going to the post office and standing in line for an hour or so?? We don't get home pick ups here. I'm sure it was just the luck of the draw with this one. *insert sad emoticon here*","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1555804800000}
{"reviewTitle":"Excellent buy for a desktop monitor. Not for VESA mounting, though.","reviewDescription":"This is a beautiful curved monitor that extends a work desktop gracefully and displays text and images with crisp snappiness. However, don’t get it if you want to mount this to any kind of VESA bracket. The big giant metal desktop stand is *not* removable (the bottom part comes off, but the big long “neck” and the “guide” (as Samsung calls these) are permanently bolted in and cannot be removed without “the assistance of a technician” who will pry open the case to unbolt the stand. I have watched YouTube videos of this conundrum, but refused to believe Samsung could have produced such a flawed product. So I studied the user manual, which clearly shows exactly how to remove the stand. However, the external screws they say should be removed do not exist. So I reached out to a very kind and patient support person at Samsung, who tried to step me through the same process outlined in the user guide. I sent photos of the actual monitor, which he and other support team members studied and compared to the user guide. No luck. In the end, he said the stand was permanently affixed and the only way to use a VESA mount would be to pay a technician to come to my home to crack open the monitor’s case and unbolt the stand. (Thank goodness for Amazon’s kind tolerance for things like this. I will be returning the monitor and buying a replacement that is *not* Samsung, since even the user guide and Samsung support team can’t trust their own “VESA mountable” specification.)","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1604448000000}
{"reviewTitle":"Excellent choice for a mid-tier level monitor","reviewDescription":"Great product for the value. Only 1 HDMI port and No internal speakers. There is an aux port for headphones. Overall picture\/screen quality is above average for a monitor at this price level. I bought this TV to play Rainbow 6 Siege and my KD went from a 1.0 on a 52\" TV to a 1.8 with this 23.5\" monitor. Response time averages 2-3ms after testing. Note that the stand is not adjustable. Overall 4\/5 and I would gladly purchase another of this exact model if needed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1575676800000}
{"reviewTitle":"Got an open box when i ordered a new one. Monitor is great though!","reviewDescription":"The monitor itself is really great and the picture quality and the look are fantastic. only reason im knocking this down 1 star is because i ordered a new one and i definitely received an open box one because all of the cables and booklet were loose inside and there were no cable ties or coverings for anything. amazon however did take care of the situation for me but just giving a heads up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1602979200000}
{"reviewTitle":"Work very well.","reviewDescription":"I don’t game but these are very nice for my use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658361600000}
{"reviewTitle":"Gets the job done.","reviewDescription":"The big issue is that it is angled downward making it not the best option for a second monitor.  Other than that is great for everything else I do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639267200000}
{"reviewTitle":"Needs to be set at Dynamic Contrast","reviewDescription":"Needs to be set at Dynamic Contrast or else it is just average like any other monitor. You can only get so much high definition at 1920 x 1080 and the larger the screen the more you need a higher resolution.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1626998400000}
{"reviewTitle":"Great for gaming","reviewDescription":"This monitor has a really clear crisp picture and the fast frames a gamer needs. The only thing we do not like is that it does not have speakers. Definitely was not expecting it to not have speakers but it was our first gaming monitor purchase so they might all be this way. Other than the speaker issue it’s really great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609545600000}
{"reviewTitle":"Good Value","reviewDescription":"Overall I'm happy with these. I'm a software developer, and I use them 8 to 10 hours a day. The picture is sharp, the size is perfect, and I quickly adapted to the curve. Now that I'm used to the curve, I wouldn't want to work without it. My only complaint is the enormous power brick which cover adjacent outlets on my power strip. They probably could have come up with a better design for this. I ended purchasing a second power strip just for the monitors. Otherwise they're a great buy and I would purchase them again.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1533600000000}
{"reviewTitle":"Deals and steals... I won in this one","reviewDescription":"This was one of those rare finds!  I love this display, everything is crisp and clear ready in the eyes, which I didn't even realize I was experiencing eye strain and best, the price was fantastic!  Unboxing it, I was concerned about some of the reviews I've read however I have had nothing bad happen. I'm sure it was thrown around quite a bit during it journey to mine.. the packaging was very secure.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1596499200000}
{"reviewTitle":"Good monitor for the price, but stand doesn't tilt","reviewDescription":"Some reviews said the screen was blurry, but it's fine for my purposes in my home recording studio. Not blurry, also not 4k. While the stand is sturdy enough, there is some movement when I bump my desk.Only complaint so far is that the stand doesn't tilt at all, which is especially noticeably with a bigger monitor.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610582400000}
{"reviewTitle":"Great Monitor for the price","reviewDescription":"This is a great monitor for the price! Very clear picture. This is my first curved monitor and I wasn't sure if I would like it but it was better than expected. I just ordered a second one for my dual set up to have identical monitors. I would give it 5 starts if it had multiple HDMI ports. It only has 1. Other than that its great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1603152000000}
{"reviewTitle":"Still work but...","reviewDescription":"About three months after purchase after I stop using computer for a few hours and I try to wake her up the monitor don't work, it just show a gray light with some color in the edges but it does not matter if I move the mouse or punch any keys it don't change, I need to unplug it and plug it again for it to work, since I never buy extra guaranty I guess I will have to keep doing this until it finaly it stops working.Other than that, I like it but......","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1587600000000}
{"reviewTitle":"Sound distorted","reviewDescription":"sound frequently distorts\/becomes static filled, generally requiring a full restart of the computer to get back to normal. If I \"wait it out\" audio is no longer synced to the source. Issue doesn't come from speakers, as they work fine with other monitors and I have all drivers up to date.Tried to get a replacement from amazon, who also determined the issue to be the monitor and they said they couldn't because it was a deal of the day, which is it's own form of bizarre. Was told to wait to talk to amazon until after the 30 day return window to \"hopefully\" take advantage of the warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1533600000000}
{"reviewTitle":"I need a  mother return label too get my $$$  back.from  Samsung!!?  Thanks Zack a real","reviewDescription":"I finilly got it to working!!\/\/\/9\" moniter and this one to.. Left all on overnight, and the next morning it was working!!! Man this is a Great 4 K picture!!! I LUV it!!! A old happy man\/\/\/ Zack It .. Now I mailed it in fof service.. mGanuintreed 1 year...Not a good product so far...??? I probally won\"t buy  Samsung product again,,,Wish I wouln\"t have bought this moniter..Maybe it will work on newer Computers???\/\/\/ I don\"t know or care!ng product again!!!!!! My Bro in Laws Samsung T.V. Went out 2 times = had to fix it...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1576454400000}
{"reviewTitle":"Goes Black","reviewDescription":"Constantly my screen keeps going black while playing on the pc. I can’t do anything to fix it it just stops recognizing my pc. Haven’t had this issue with any other monitor. Definitely would not purchase again and will probably being throwing the one i have out considering it doesn’t work and i didn’t buy the warranty. Cause that’s my fault i didn’t pay the extra money for something that stopped working already when i purchased at the end of June.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1632009600000}
{"reviewTitle":"Trash","reviewDescription":"Had this monitor for less than a month but it never really worked like it should. It could never decide whether it wanted to recognize if something was connected to it or not, and sometimes didn’t even try before it went back to sleep after a few seconds. I’ve been sitting here for an hour trying to get it to connect to my computer, but I’ve reached my limit.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643846400000}
{"reviewTitle":"DO NOT PURCHASE -- Backlight Bleeding","reviewDescription":"Bought this monitor with very high expectations, I've been a long-time fan of Samsung products but was extremely disappointed with the quality of this monitor. I purchased this monitor only 2 months ago and have barely used it at all. This week I started noticing backlight bleeding spots on the screen. Spots are starting to appear on the monitor and are very noticeable when the screen is dark. A shame that this product would do this after only 2 MONTHS of use. Will be contacting customer service.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1601424000000}
{"reviewTitle":"Dark after 7 days","reviewDescription":"Seems I could be an OK monitor, but then it flickered bw light and dark for a couple days and then stayed dark after about a week. Dud…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681862400000}
{"reviewTitle":"Faded outline!!!! Do not buy!","reviewDescription":"When I got the screen I noticed this outline when the screen was not showing anything remotely dark or patterned. Any dark or black screen has this ugly faded outline that has gotten worse. It looks terrible and makes watching and playing things on it almost unbearable. I expected better from Samsung. Should’ve returned it when I first bought it because now I have to go get a new one. At least I know not to get another Samsung. This picture does not do it justice. It also leans forward. Had to use a couple programming books to prop it up.","isVerified":true,"ratingScore":1,"reviewReaction":"68 people found this helpful","country":"United States","date":1532390400000}
{"reviewTitle":"It just stopped working.","reviewDescription":"It just stopped working. I've tried turning it on several times, and it won't turn on. Not really sure what happened.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680566400000}
{"reviewTitle":"Save your money, time, and emotional bandwidth and buy something else","reviewDescription":"It was good while it lasted - 3 months. Bought it as a part of my WFH setup and one fine day a wide black strip appeared on the screen. Sent it to Samsung since it was under “warranty” and Samsung came back saying physical damage voids warranty so it will be a paid repair. The only “physical damage” it endured was use. Save your money and buy something else, or buy this if dealing with this drama seems to be your jam.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1606867200000}
{"reviewTitle":"Left side of screen waves and shakes","reviewDescription":"I have two of these monitors.  One is fine, but one of them has a section down the entire left side of the screen that waves and shakes.  It's difficult to look at.  The eye saver mode works well but discolors everything, so screenshots will not look the same as they do when the eye saver is turned off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Worth it when it works.","reviewDescription":"This 27\" curved monitor looks great, it is lightweight, and the picture quality is great for my application. I used it as a double monitor setup for work, and as my main monitor when I play my Xbox One at my desk. I have no complaints with what I just mentioned, I am a satisfied customer.However, the reason for the low Star rating is that this monitor randomly turns off on me and before people start asking the basic \"have you??\" questions, I have done the following:I checked all connections, HDMI at both ports; I tried different HMDI connections; power supply connection at outlet, monitor, and the block itself. I have made sure that there is plenty of air space behind the monitor so that heat doesn't built up behind it. The Energy Saver mode is off.Like I said before, the monitor turns off random and the picture does not come back. I have to turn off the power and turn the monitor back on. This is a huge inconvenience during my work hours as it tends to turn off during meetings, specially when I am presenting. I used to have a cheaper Dell monitor in its place and I never had this issue.Also, there is a few dead pixels, but I am not concerned with that since most of the time I am working with Microsoft office applications that have white background. This just adds to the questionable quality of this product.Everything else is great, except this huge inconvenience. Perhaps I received a bad batch, I don't know. I tried everything possible minus adding drivers, though I doubt that is the reason because my Asus 27\" monitor does not have this issue and I have never had to install additional drivers.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1612483200000}
{"reviewTitle":"Came DEFINITELY used. Not \"like new\"","reviewDescription":"I ordered two of these monitors. One came packaged well, the second not so much. The plastic frame had to be snapped shut. It was already on when I plugged it in, and the cord they send with it was not an HDMI cord like the other one. The picture quality is also more dingy and noticibly different than the other even when both are set to factory default.The one that came in is a solid monitor for the price. If you're going to buy these for general use, don't go for the \"used like new\" option because it'll be a gamble. I learned my lesson.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688428800000}
{"reviewTitle":"Good monitor apart from the stand attachment design","reviewDescription":"Works great, just have to be extremely careful if you ever want to remove the stand part to attach it to something else. Rather than just attaching it with a screw, you have to lay it face down and brute force the thing off. Even having cushion supporting the screen I still ended up messing up the monitor to where it is now unusable. Most idiotic design for something like a fragile curved monitor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"Buyer beware","reviewDescription":"This is a great screen, when it works. Whenever I turn on my computer, the screen will come on but it won't display anything most of the time. Sometimes it starts up fine. Others, I have to unplug and plug the HDMI cable back in until the screen connects to the computer. It's irritating. Samsung makes great phones, but a lot of their other electronics leaves something to be desired. Would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"OK for movies, but look at a different solution for work.","reviewDescription":"I purchased several Samsung C27F398 monitors for a multi-monitor setup.  The picture quality of these displays is inferior to the 6 year old ASUS 24\" they were meant to replace, and the buyers should be aware of what they are.  First of all, just like many other monitors, \"LED\" only refers to the back lighting source.  It is still an LCD panel, which can be manufactured with a number of processes:  TN, IPS, VA, etc...  TN is the worst in terms of color accuracy and contrast ratio, and is exactly what this monitor uses.  As such, if you really spend a lot of time working with graphic design, modeling, or editing videos, this monitor is not for you.  Specifics below.PROs:1. Stylish2. Curve feature is interesting after you get used to it...CONs:WHITE BALANCEAbsolutely awful.  All three monitors, configured with the same settings, were displaying different hues of white - ranging from cool to warm.  Settings were manually applied with all dynamic features turned off, yet I was unable to make them look the same.CONTRAST RATIO3,000:1 static, and MEGA:1 dynamic.  While claimed numbers may seem inspiring at first, there's a significant amount of light leakage from backlighting, and the panels glow at night, something that you won't be able to fix in lieu of the LCD panel being a TN type.PANEL TYPEAs mentioned earlier, this is a TN panel.  IPS and VA are far superior in terms of how they manage light gating, which is direclty responsible for color accuracy and improved contrast.  Discard everythign Samsung claims and invest into an IPS or VA type panel.Photo below shows two monitors displaying different hues of white - which is unforgiving.","isVerified":true,"ratingScore":2,"reviewReaction":"10 people found this helpful","country":"United States","date":1511913600000}
{"reviewTitle":"Angled Downward - Requires Separate Mount","reviewDescription":"I'm trying not to be extremely disappointed with this monitor but it has a major flaw - it's angled downwards and unable to tilt in any direction. Reading reviews, most people who wrote good reviews seem to have replaced the mount, which is what I'll have to do I guess.Right now I have it set up on a shoe box riser so it's not as bad but already my neck and eyes hurt from having to view at a weird angle. I really don't understand the point of this position and why they made it as such except to get you to purchase a new mount. It's so stupid.The same time I got this screen I got a Sceptre curved monitor for $100. That one actually seems better, having a straight-on angle. So if you are looking at this and are not an extremely sort person who looks up at their screen anyway... you'll have to get a second mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Where i can fix this?","reviewDescription":"Bought it about 9mths ago and used it when i wfh. So basically there is no damage phisically but it just went bad. Cant see anything but see this broken screen. Left a message if they provide after-sale-service that i can pay for fix didnt get any response.. then it means basically i cant do anything if it is broken after i bought lets say 3 mths??","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Display is great but makes high pitched sound","reviewDescription":"The monitor overall works well. The display is clear but it makes a constant high-pitched buzzing sound all the time. Anytime I scroll or open a new app it changes level of buzzing and gets louder. I’ve tried adjusting the refresh rate to see if that helped but it didn’t.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Cheap, and it shows.","reviewDescription":"First off, I like Samsung products. All my 4k TVs are Samsung and they are great. This display, is absolute junk for me.1) it’s angled so that it’s always pointing down. This might be fine if you have a desk where you can place it up high, I don’t have one.2) #1 wouldn’t be a big deal except the display isn’t adjustable! I’m very tall so this display is constantly pointing at my navel.3) the stand is awkward for small desks.4) and this is the worst part… I know it’s a 1080p display which means it’s going to run at 1920 x 1080, but images and fonts have kerning. That’s the rough looking to fonts that makes them look like steps rather than being smooth. And font smoothing is already on. That means the 1080p stretched across this display is working against the quality your OS is trying to push.I could have dealt with 1-3 with a little woodworking and jankification, but I cannot take poor image quality.Returned.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1643500800000}
