{"reviewTitle":"Great value, love the simplistic design","reviewDescription":"Very simple and functional yet it has all of the essentials without any of the gimmicky frills. Maybe it takes a $300 laptop so I don't have to deal with built in Alexa-enabled something, HP-specific ports, fingerprint scanner, and other stuff I don't want or need. They don't try anything fancy with this one which for me is a positive. Plus it's TKL keyboard which really should be the new norm. Does not have a backlit keyboard which is a slight miss but for the price it's not a huge deal.You can take it out of S-mode easily and remove a lot of the addons and you have yourself a perfectly functional Windows machine. Despite the lower-tier hardware it still starts up very quickly if you make sure you don't have too much bloatware. Sure it's a little slow at times but if you're using it for day to day tasks it should be fine. Battery life seems very good, the laptop is also fairly lightweight as well. What more could you ask for at this price point.","isVerified":true,"ratingScore":5,"reviewReaction":"270 people found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"very nice I just enjoying my lap top is TOP","reviewDescription":"I really like very much my lap top I just got it . I am very satisfied  with it. thank you HP","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"10\/10","reviewDescription":"I recently purchased the HP Newest 14\" Ultralight Laptop and let me tell you, it has been an absolute game-changer for both my student life and my business needs. As someone who is always on the go, I needed a reliable laptop that could keep up with my busy schedule, and this laptop has exceeded all of my expectations.Let's start with the design - this laptop is sleek, lightweight, and portable, making it perfect for carrying around campus or taking to meetings. The 14\" screen is the perfect size for both work and play, and the Intel Quad-Core N4120 processor ensures that everything runs smoothly and quickly. The 8GB of RAM and 192GB of storage (64GB eMMC + 128GB Micro SD) provide more than enough space for all of my files, photos, and videos.One of my favorite features of this laptop is the 1 Year Office 365 subscription that comes included. Having access to all of the Microsoft Office programs has made it so much easier for me to stay organized and productive. The webcam is great for virtual meetings, and the HDMI, WiFi, and USB-A ports make it easy to connect to external devices and accessories.But what truly sets this laptop apart is its incredible value for the price. I was a bit hesitant at first because of how affordable it is, but I can confidently say that this laptop is worth every penny. The performance and quality are on par with laptops that cost twice as much, and I couldn't be happier with my purchase.In conclusion, if you're a student or a business professional in need of a reliable, efficient, and affordable laptop, with amazing battery life, look no further than the HP Newest 14\" Ultralight Laptop. It's a 5-star product that will truly make your life easier and more enjoyable. Trust me, you won't be disappointed!.","isVerified":true,"ratingScore":5,"reviewReaction":"94 people found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Easy to use","reviewDescription":"Liked everything. Great price.  Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Love love love!","reviewDescription":"Definitely worth the cost!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Works. Nothing fancy. Not supposed to be.  Looks nice.","reviewDescription":"Nothing fancy but works for internet surfing and word processing just fine.Make sure you take it out of s mode.Pretty good deal. Came With extra storage card since its got small Storage capacity.Holds a charge. As long as it lasts a coupleYears or so, im happy with it.I needed a basic spare computer.Would recommend. For basic light computer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Great Value.  Easy to set up","reviewDescription":"Great value for this robust laptop by HP.  I was very impressed with how easy it was to set up.  I am 61 years old and can be challenged by technology.  Surprisingly, I was able to completely set up with all of my accounts in three hours.  The HP laptop was half the price of my old laptop I purchased in 2019.  I am thrilled and highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great laptop at reasonable price","reviewDescription":"I bought this laptop for my son last year to use at college. He wanted a smaller, lighter laptop than his previous one to make it easier to pack around campus, so this was perfect for his needs. He has reported that the computer was quick and performed well for completion of his research and other assignments. Unfortunately, the laptop sustained damage while moving to a new place (his fault).  Therefore, he needed a new one. He liked this one so much, he decided to order this one again.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Satisfied","reviewDescription":"I really wanted a touch tone computer but, they're pricey. I don't have much time to use this computer but, it's so far it I'm satisfied.ThsnkU, S","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Perfect for me","reviewDescription":"I baught this computer because I dumped a protein shake on my large one and I use it for school. It’s quick and clean and stylish. Small enough to carry in my bag but large enough to do its job. The battery lasts a long time too","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Does not work","reviewDescription":"The day we received and tried to operate, so frustrated returned it.  Disappointing.  I bought this to have the Webcam and microphone so I ordered a Webcam Monitor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"DO NOT BUY!!!","reviewDescription":"I just received this computer yesterday, took it out the box, plugged it in, set it up and go to use it, the screen wouldn’t do anything but flash! After spending 40 mins on the phone with HP tech support including 2 video calls so they could see the computer, they wanted me to spend $45 MORE to have a flash drive with a new operating system. HP IS TRASH!!! This is literally the second brand new out of the box HP product that has not worked for me in the past month!!! They wanted $19.99 to help me with my printer. Product Returned!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"White boot screen - don't try to call HP warranty","reviewDescription":"Bought this laptop for my son. After less than a month he went to school and this is what he was presented with. After going thru the difficulties of HP warranty, they say this must be taken care of by the Amazon seller, not them. So, just make sure you don't think the warranty is covered by HP. Original system (according to HP) was shipped with a 16G hard drive and only 4G of RAM, and that since it was altered that we would need to go back thru the reseller.Depending on their results of their response to this review, I may update.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Defective Laptop","reviewDescription":"The laptop seemed ok at first. Turned on and after a few minutes of using it, while watching a YouTube video, the screen went dark. I could still hear the video playing, but the screen remained dark even after touching the keys and touch pad. When I shined a flashlight on the screen I could see that the screen was still on, but dark and tried turning up the brightness at that point. That didn’t work. Had to return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Even for class work, runs very slow!","reviewDescription":"When it arrived, the attached damage was observed. No damage to the box, though, so it was shipped in this condition. But all ports worked properly, so the damage didn't hinder any of the uses. I use this laptop solely for class work, run minimal tabs and it still runs slowly. Unnecessary applications were uninstalled\/disabled, which didn't improve performance. Ontop of that, the time\/date always unsyncs and picks up the time\/date when it was previously online. So I have to constantly resynce it when it conflicts with a program I have to use. Adjusting the advance settings for it to automatically do this didn't resolve it.With patience, I am able to complete my class work. But I don't recommend the product and advice others to look into other products.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Frustrated","reviewDescription":"Bought this laptop for the very simplest of reasons (to make books on Shutterfly) and it will not stop with making me restart to update. This is the 4th “update restart” in less than an hour. The computer screen just goes blank for a couple seconds at a time. It’s slow af. I’m about to return it if it doesn’t start to work properly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Do not buy","reviewDescription":"I bought this computer for the price and office 365. I did not like that it came in S mode, which prohibits you from downloading anything that is not Microsoft store approved like google chrome or our epson printer. The seller said in their description that you can remove it, but it was far from easy. It took several hours of researching, trying and failing, contacting the seller, who gave instructions for removing it from windows 10 when they sold me a computer with windows 11. I replied to them and told them they sent the wrong instructions and never heard back. I would stay clear of this computer, even tho it has a tempting price.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Garbage - can't even browse on Chrome","reviewDescription":"Absolute garbage. I had low expectations for this computer, but I hoped it could at least serve the one purpose I bought it for: to browse the internet. It fails miserably even at that. Having more than like 5 Chrome tabs open, the performance becomes insanely slow and laggy. System says it has 8GB of RAM, so this is shocking. All drivers are up-to-date, and still the thing is garbage. Google Meets is a choppy nightmare, running any kind of extra apps or dual monitor in addition makes the thing unusable.Build quality: very poor. It arrived with the keyboard-side plastic surface slightly bulging from the housing. Trackpad stinks, very loud & \"clicky\". Screen is really poor quality. HP bloatware is obnoxious - blows my mind you would add even more performance drag on an already budget POS.Really disappointed in this thing for having so many high ratings. Any chrome book are probably a way better choice than this. Frankly better off just spending more money on a better laptop, this thing is bottom of the barrel garbage. Total waste of time & money","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Screen flashing on and off\/freezing up","reviewDescription":"UPDATE: my son used this laptop no more than 3x for a class and the screen started flashing on and off and freezing up. very disappointed.It was time to upgrade our teen’s Chromebook and we got a great deal for prime day. This runs very smoothly and fast. We are very happy with our purchase so far. Our high school student will be using it for schoolwork.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"BEWARE","reviewDescription":"After having issues with this laptop I discovered, that the hardware in it is “upgraded”, but not with HP hardware. So, even if you have a “warranty” with HP it is not covered. So I would steer clear from this one. I will say Amazon customer service helped make it right in the end. But, I just wanted to let others know.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Instant regret","reviewDescription":"Bought this to be my gaming\/fun laptop. It’s lightweight, but feels insanely cheap. The amount of GB it says this laptop has, it doesn’t have. I went to download something and couldnt because there’s already no space on the laptop. I would say spend more money to get a better laptop. This one is not it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"NOT GREAT FOR WRITERS","reviewDescription":"If you plan on spending a lot of time typing on this computer, you will most likely find it frustrating and here’s why.1. Design. The keyboard is set unnecessarily high. There doesn’t need to be that much space at the bottom of the keyboard. It’s not ergonomically functional. I am a writer and I frequently lose paragraphs at a time because as I’m typing my palm slides over the touch pad and highlights text. I often find myself wondering what happened to a whole block of text. Obviously clicking the undo button in the middle of a writing project could mean clicking undo 75 times before you find the mistake.2. The screen is way too small for a writer because it is long. That means that your document will only display about 4 inches at a time unless you minimize the text down to about 70%. As a writer, these options are very frustrating.3. I believe this laptop was advertised as a touchscreen, it is not.4. Auto sync- don’t do it unless you really want everything transferred over to your brand new laptop. I have old files that should’ve been deleted from my old computer now on my new computer and I never wanted any of that. Be really careful with the options you select if you do end up buying this laptop.What I do like about the computer is that it’s","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Keyboard","reviewDescription":"Love the laptop itself, works great so far for school work, and basic eamiling and web surfing, but trying to type is very difficult. The keys themselves are silver and so is the writing on them. Battery life is terrible, constantly has to be plugged in. Just not what i expected. First laptop i have bought since dell made the inspiron colorful ones. So like 2010.... do not recommend","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Problem with Microsoft set up","reviewDescription":"I just received this today. I claimed and set up the 1 yr free subscription to Microsoft 365 Personal that was included with my offer. I even signed up to continue it at the end of 1 year on my cc on 12\/10\/24 when the subscription expires. After set up, I got a pop up on the computer from Microsoft  asking me to accept the License Agreement which states that I can use Office until Thursday 11\/16\/23 - 5 DAYS FROM TODAY!!! - after which most features of Office will be DISABLED (see photo of screen included with my review). I called Asurian (yes I bought the warranty) for tech help and they said the warranty does not cover software and don’t know what the problem is. They ga e me the number to call HP, which I did, but they don’t open until Monday, the day I need to start using this computer. In the meantime, I have a useless computer locked up with a pop up screen unless I want to “accept” these terms. I don’t think so! I’m hoping whoever sells this product package can explain this mess. If so, I can upgrade my review with more stars. If not, I’ll repost with 1 star and recommend 0 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"10 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Keys are “sticky” out of the box","reviewDescription":"While trying to set up the laptop a few of the keys have to be pressed really hard for them to register and don’t pop right back up.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"No me funciona el Microsoft","reviewDescription":"Ellos me vendieron  esa lapto disque con un año de Microsoft gratis y no funciona, y lo peor es que no me resuelven con la activacion esto es un fraude al cliente.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Streaming almost impossible and very slow","reviewDescription":"Tabs and computer as a whole freezes a lot. It does what I need it to (sometimes) which is just reading my email and working on school stuff. Apart from that, even online shopping has proven difficult as it freezes a lot and you have to wait before you continue scrolling. Lots of crash reports for different program, but mostly web browsers. In conclusion, you get what you pay for - if you're looking for a laptop to work on documents on, you'll be fine with this one. If you're looking for one for anything else, keep looking.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Very Basic","reviewDescription":"It’s very slow and has poor resolution. Mine doesn’t charge well at all.  Save your money and buy a better computer.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"TOO MANY PROGRAMS, NOT ENOUGH RAM","reviewDescription":"The white Laptop I purchased is nice, sleek, lightweight, and looks modern, but runs like a commodore 64! After spending a couple nights trying to clean, defrag, and modernize its OS speed, I threw in the towel! I bought the comp due to a project I need completed asap. Bc I had a hard deadline, so I couldn't spend days & days increasing its' speed. I would buy it again W\/O all the programs, and Yet AMAZON Keeps the laptop laden w numerous programs i","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"S mode by microsoft made it useless.","reviewDescription":"Comes with S mode that it was impossible to get out of.Only Microsoft apps allowed  made it useless for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"For the price it is very good","reviewDescription":"This is not a touch screen, for the price it’s hard to get a touch screen.  I use this for work remotely.  It’s starts quickly and has no lag or other junk slowing it down.  I had a dell that was three times the price and awful.  The memory is non existent so I added a large SIM card and external drive for $80, still cheaper than other computers.  I can run excel and a few apps at once but have not tried gaming.  The screen resolution is okay, would be an issue with gaming.  The battery life using just the internet is 6 hours.  It is easy to get out of S Mode to make it easier to download apps.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Works great!","reviewDescription":"I’ve just recently started using this laptop. It seems to be working great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Good laptop for the price","reviewDescription":"Got this as a graduation gift for my grandson. He’s very happy with it and plans to use it for college.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Todo bien","reviewDescription":"Todo bien","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"So glad I purchased this","reviewDescription":"I bought this computer for my job. I needed a new laptop cuz I work from home every other Friday. This computer has been great. Its fast and lightweight.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"It works","reviewDescription":"For the price point (which is very reasonable), I have no complaints.  Using this laptop as a backup for my work issued computer and quite frankly I prefer using this thing.  I run through a virtual desktop anyway and getting this laptop fired up is a breeze.  Battery life is decent.  No touch screen capability, but that's not a deal killer in my book.  Worth the minimal investment I made.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Easy-to-use","reviewDescription":"Setup was a breeze. The only drawback is Microsoft store doesn't have some of the apps I want.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Excelente","reviewDescription":"Realmente funciona súper bien, tiene un tamaño perfecto y es súper rápida me encanta","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Good computer","reviewDescription":"I like the HP brand. It's not overly expensive and serves it's purpose. I've used similar laptops from junior college to the Master's program and will be using this one for business. I would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1716768000000}
{"reviewTitle":"Lightweight and fast","reviewDescription":"It is smaller than I really wanted, but it is very light weight, the battery life is great, and it is so much faster than my previous laptop.  Worth the money for sure.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1717200000000}
{"reviewTitle":"Easy to use","reviewDescription":"I love my new laptop! It’s easy to use, user friendly and fits easily into my bag","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"HP 14' Laptop","reviewDescription":"Easy to hook up to my wifi and set-up.  Loving my new laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Really Nice! Follow the Directions!","reviewDescription":"Computer is truly excellent for the cost! So happy with it from ease of setup to functionality. My only caveat is you MUST capture and follow the instructions --available twice in the product listing-- for disabling \"S Mode\" if you want to download anything that's not a Microsoft product. You will be bullied to use Microsoft Edge. Ignore that. Overall, super happy with this purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Nice Basic Computer","reviewDescription":"My Acer died the Black Screen Death in a couple years.  I like it for the basic print things google and Amazon.  I am usually on my Iphone.  Seems well made for under $300.  I am 81 so it serves my purpose.  I do like Windows 11.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"So far so good!","reviewDescription":"After setting everything up for my husband, which took a normal amount time, the laptop is performing well.  Other than checking email, shopping on Amazon and EBay and playing Google Solitare, we don’t ask too much from a laptop. One of the most important features is a secure power connection and this one has a pin connection which seems secure.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"I Love it","reviewDescription":"My MacBook got too old and like most apple products by the time they come out with the newest model the software updates start to overload the hardware causing the computer to glitch, malfunction, and eventually crash leaving you with no choice but to spend more money on yet another computer. I’ve never had that problem with HP laptops! They have always lasted longer than MacBooks by at least 3 years! Nothing bad to say! One of my favorite makes!","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Perfecto","reviewDescription":"Estudios","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Hp lap top","reviewDescription":"Quick delivery and seems to be working very well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Download","reviewDescription":"I downloaded Chrome and it hasn’t opened so once. That was about 10 days ago.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Best laptop","reviewDescription":"I absolutely love this laptop! It takes care of all my needs. From typing up documents, uploading and downloading files, and browsing the web it does everything without fail. Does take a little getting used to but other than that it's great! Also it says touchscreen but it's actually not ....","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Perfect","reviewDescription":"Bought this just for school. It’s so light weight and does everything I need it to do so far. I did have to take it out of S mode so I could install an app that I needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Very good","reviewDescription":"Thin, lightweight, small but works very well, Brand new was easy to setup. I think windows 11 or 10","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"Great product","reviewDescription":"I initially bought this for working from home, it's fast, efficient and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"I love it thanks","reviewDescription":"Had no problem working great not slow or losing battery power cord isn't connected I charged it white I am a happy customer a must buy item compared to my  other hp chromebook that's slow not this one I took a picture of my old one it's the black one","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good buy","reviewDescription":"Laptop is as advertised 👍🏼","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Perfecta!","reviewDescription":"Compré 4 , para todos en casa, necesitábamos más de una para un nuevo negocio, y estas son ideales, buena calidad-precio.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Right for the price","reviewDescription":"A very decent laptop for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Perfecta","reviewDescription":"","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Light weight and Easy Set up","reviewDescription":"We like the light weight of the product.  The speed fits with what we are using the computer for.  We’ve just had it a few days, but no issues so far.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"The best laptop","reviewDescription":"This laptop is so convenient and works perfectly with my work and school.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Super lap top for the price!","reviewDescription":"Perfect little laptop for the price. Performs as it should, it’s small and lightweight… Easy to carry.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"I like it","reviewDescription":"Comes with sd card and 1 year 365. The white looks clean.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Excellent","reviewDescription":"Excellent product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"100% recommend","reviewDescription":"For the price this is actually super good. Was a gift for my son and does the job it needs to.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"So far so good","reviewDescription":"Booted right on up. Bought for work, so far it’s serving its purpose. No complaints this far.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"The keyboard has nice sized keys, it’s lightweight and it was easy to set up!","reviewDescription":"I’m very happy with the HP laptop! I have a HP Printer so I thought I’d give it a try. Worked out great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Works","reviewDescription":"YouTube","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Recommended","reviewDescription":"Needed a laptop for school works well fits the needs I was looking for and office included for 1yr makes it a plus.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Calidad","reviewDescription":"El producto es igual a lo que se oferta!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Does everything I need it too","reviewDescription":"Great labtop for the price and comes with a year of 360 that’s a bonus. No complaints it was easy to setup everything and it runs smoothly. I love that it’s also lightweight and would be good for travel as it doesn’t weigh down a bag.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Too much security","reviewDescription":"I can’t download apps that aren’t on the laptop store. Too much security","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Laptop","reviewDescription":"To many problems with this laptop!!Called HP SAID let Amazon of the work order, that showed wrong components listed!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Not worth the money","reviewDescription":"I thought I was going to get a quality laptop but it is so slow, it was legitimately 8 hours to set up and get rid of all the Microsoft programs that are inferior.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712793600000}
{"reviewTitle":"Caught in a hole, no one takes responsibility","reviewDescription":"Laptop stopped working short after buying it.  According to HP, the seller is responsible because of the upgrades it did: although warranty is still active, it is no longer useful, and even worse: the time it took HP assistants to understand this, made the return window of Amazon to close. So I have a new item, defective, but no one takes responsibility. It seems I lost the money and the time.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"No SD cart port","reviewDescription":"Since I need a new laptop asap I saw the product and it was perfect. But when it arrived the color was silver it had no SD card port. Stuck with a SD card. And I need the laptop for work this week o well.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Slow","reviewDescription":"Idk what I was expecting purchasing this laptop I needed a program that only ran on windows so I purchased this one in a pinch and man is this thing slow, not only that but it wouldn’t let install the program because it wasn’t a part of Microsoft or something like  that.I returned it that same day. I knew it wasn’t gonna be good for the price point but jeez, my work laptop is a M1 MacBook Pro so it’s night an day an not worth comparing","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Defective product","reviewDescription":"The computer worked fine for the first 44 days then the battery would not charge anymore got the run around from Amazon then the seller and have a useless laptop... buyer beware.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Waste of money","reviewDescription":"This laptop worked fine for an affordable laptop for about 5 months. After that it stopped throning on at all. It would charge but will not turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"not from HP, missing adapter!","reviewDescription":"Arrived missing an adapter with stickers all over it from a third party vendor. I should have noticed the listing was misspelled and somewhat sus, but the price seemed too good to be true, and it was. I returned this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"This seller is scamming you !","reviewDescription":"I was told by HP that the laptop was tampered with. That extra RAM was put into the laptop after market and now this laptop is defective.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"Very convenient","reviewDescription":"Great value for the price Small and easy to carry around.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"School laptop!","reviewDescription":"Great computer for school work with a great price!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"Beautiful laptop with fast speed","reviewDescription":"I was excited about this laptop to come to start my remote job hunting.As soon as I got it I tried to download the apps that were on my phone. Most if not all are available through your hp PC.I downloaded Netflix, text messages and calls to come straight to my phone while on the laptop.Video quality and performance are too quality.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"Good value","reviewDescription":"I purchased this for school. I have no complaints and I’m about 4 months in. I’ve only used it for online study, using word, and excel. It responds well and does all that I require it to do","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Good product","reviewDescription":"I had a broke book and I couldn’t use it or school.i bought the ho and I love it.fast light weight and it has what i need","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708560000000}
{"reviewTitle":"Love it!","reviewDescription":"Bought this computer from my college son, whose previous Dell died within a couple years. Didn’t want to spend a lot of money so far he loves it! It’s easy to use, and very lightweight and easy to carry highly recommend for a basic student laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"A much needed laptop","reviewDescription":"I recently started school and my teacher said that a laptop was needed in the class. I'm so grateful to find this one!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Great value for the buck","reviewDescription":"At least with this one I can have Minecraft on it I love how fast it goes and it’s really a great color I love white","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"It's incredibly lightweight, making it perfect for on-the-go use","reviewDescription":"The vibrant display brings movies and videos to life, and the battery life is exceptional. Whether you're a student, a professional, or simply someone who values portability and efficiency, this laptop is a fantastic choice.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"A satisfying shopping experience","reviewDescription":"The computer packaging is quite tight, intact and undamaged, with a beautiful appearance that looks noble and fashionable. The overall computer is very good, with fast startup speed, smooth operation, and no lag. The configuration is rich, and it was a very satisfactory shopping experience.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Be somewhat careful when you are spending your money.","reviewDescription":"did not come with office 365, stopped working completely after 2 months, honestly I would rather get a mini gaming pc for 190$. It didn't even come with 128 gb it came with 57 instead.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"It's a Lemon","reviewDescription":"Everything is locked into \"S Mode\" which seems to be something Microsoft added in order to lock you into Microsoft products.  Theoretically, there's a way out of it, but you will run into any number of errors and web searches for fixes.  One of these fixes might work for you, but there's a very real chance they won't, and you'll be stuck.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Will break and not covered by HP warranty","reviewDescription":"We had this laptop for 8 months before it completely stopped working, wouldn’t even turn on. We called HP because it was still under warranty, or should’ve been. HP informed us that they do not manufacture an 8gb RAM laptop of this model and it has been altered by the seller, therefore their warranty is void. Eventually we were offered a refund by Amazon, but I would definitely advise against purchasing this product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Won’t turn on 17 days after warranty expired","reviewDescription":"Won’t turn on, 5 slow flashes with 3 fast flashes means going inside to repair boards and soldering. Almost $300 and back to where I was before I gave crapazon more money. When will I learn!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Stuck in S mode","reviewDescription":"I should not have to be a computer nerd to get this out of s mode. This laptop refuses to exit s mode. I get an error message every time I click the button to exit s mode. It just says \"something happened then a useless button that says try again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Terrible product","reviewDescription":"Terrible lap top. Cuts off in between project. Screen goes off. Some times have to push 10-12 times power button to turn it on. I hv already sent the lap top back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Dont buy HP will not Warrantie DEAD- after a month","reviewDescription":"I went through support only to find out these models have been modified and dont support 8gb of ram so they will not cover under there warranty,got for a back up it worked to set it up gave to my daughter for school  back up, due to her pc acting up every once and awhile. when she needed it would not boot up at all or course was past the 30days so was money out the window","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715472000000}
{"reviewTitle":"Will not go out of Mode S as described","reviewDescription":"This Mode S from Microsoft is crap. Needed to download one (non Microsoft) app to use for SD card updates.Says you can go out of Mode S, but don’t believe it. It’s so bad, there are many info web content how to do…..  worst ever.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Update Brick","reviewDescription":"Bought for grade school kids. Worked well for a couple months then went and did an update and now it’s a brick","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Not worth it!","reviewDescription":"Spend a little more money and get a decent laptop. These are slow and a pain to use without a mouse.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Doesn’t work, probably pre-owned","reviewDescription":"Delivered 15 minutes ago and doesn’t work. From what I can tell there’s missing or damaged drivers. Seems like someone owned this before me and it broke so they returned\/sold it, and the manufacturer sold it to me trying to pass it off as brand new. Seems like fraud in that case. Absolute best case scenario, it’s just a crappy product that doesn’t work.Save yourself the hassle, get something else.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Junk","reviewDescription":"HAd this since January 2024 and over time it has steadily declined in usability and functionality. Now  it will not connect to the web, the card reader has failed and about half the time there is so little memory available, programs lag and will not complete saves.I am kicking myself for not buying the protection plan.But, I would think HP could build a better pc.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Screen breaks","reviewDescription":"Garbage screen broke when I opened it the next morning. No drop or hitting the screen just broken.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Broke after 10 months. No returns","reviewDescription":"Internal hardware issue not allowing internet connection.No internet this thing doesn't do me any good.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Windows Issue","reviewDescription":"I purchased this refurbished hp laptop and set it up with no problem however I tried downloading google chrome and it would not allow me too so I called Microsoft support. They informed me windows was not installed properly so I have been on the phone for over two hours trying to get it fixed and still unable too. Ridiculous!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Super slow","reviewDescription":"This computer is very slow to be brand new, do not buy or else your gonna be waiting a very long time to do anything","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Stopped working after 3 months","reviewDescription":"It was a good product up until it won’t turn on. Just stopped. Nothing could be done to it. Unless you want to send it to repair for the same price of the laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Don’t do it!","reviewDescription":"I was hoping this inexpensive laptop was going to be usable due to the fair reviews it had previously received. I’m not sure what changed but save yourself the money and frustration and invest in something better. I’ve had this maybe two months and every time I try to use it, it’s a new issue. Slow, setting issues, bad keyboard- you name it, almost unusable and past the time I can return.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"SLOW","reviewDescription":"Not as great as I thought it would be. Runs very slow…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Do not buy this","reviewDescription":"It has not been two months and this obvious refurbished computer is done. I wish I read the review before buying it. I was literally working on this computer and the screen goes blank. I tried to hard shut down and nothing happens. Returning. I am because I can’t even remove personal items. I will take my chance","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"OK for the price","reviewDescription":"Very disappointed that I didn't notice that the keyboard has no number pad. Makes it hard to use this at my job","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"This is total garbage !","reviewDescription":"The mouse keypad tracks very poorly ! This laptop turned out to be such a piece of garbage ! It doesn't let me install apps that I want and it constantly has pop up ads ! Then it runs ads for me to buy anti-pop up software for EXTRA $$ ! I'll pay the extra $$$ and buy a GOOD laptop at Best Buy !  Amazon buys LOTS of garbage from China  and this was one of them !!!!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Blue screen","reviewDescription":"I keep getting the blue screen of death.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Don’t Purchase if You Care About Privacy","reviewDescription":"The process to get out of S mode at setup to have a local sign-in is so miserable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Have to restart it after working awhile … mouse selects too much or nothing at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Where is my FREE Microsoft 365?","reviewDescription":"Nothing tells you how to start or activate the one year FREE Microsoft 365? All ask for cash for a subscription!  Not seeing anything that would activate the advertised FREE subscription?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Terrible Computer. Terrible seller.","reviewDescription":"Computer is an awful product. Nothing but a headache. Seller offers no real support. Returning and would never buy again nor deal with this seller.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"JUNK","reviewDescription":"SLOW ..MAKES YOU LOG IN AND OUT EVERY FEW MINS''WONT LET U CHANGE THESE SETTINGS''FULL OFF HP JUNK TAKING UP WHAT LITTLE HARD DRIVE  WE GET'''DONT BUY'NOTHING WORKS ON THIS EVERYTHING FREEZES UP''''I HATE THE LAPTOP''DONT BUY''300 WASTEDi want this posted so others can see my review stop hiding it;;i m so up set at the lack of stuff u can do and loggs out every 15 mins messing up my work;;NEVER AGAIN BUY ANOTHER  HP CRAP","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"DANG","reviewDescription":"Unfortunately this device has been so slow and the shortcuts take longer than a Mac.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Terrible Product","reviewDescription":"Windows 11 is horrible and this system is too slow tonallow any changes. Stuck in S mode.  Buy Chromebook or Apple. Avoid Windows 11.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Omega 3 Laptop for Cassandra","reviewDescription":"As this was a gift for our daughter, I have to assume she loves it as I have heard no complaints.  I did purchase a protection plan for this laptop and hopefully she will never need to use it. I highly recommend always purchasing a protection plan for any electronics especially high priced ones.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Easy set up","reviewDescription":"I’m keeping my 7-year-old laptop (also an HP) as it still works well but I wanted an upgrade. So this one is a tad smaller, but that makes it easier to cart around. It easily picked up on all my “stuff” because of my Microsoft account, so startup was easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Wife loves it","reviewDescription":"Impressive for the price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Quality Laptop, at excellent price","reviewDescription":"Great Choice, couldn’t be happier with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Cumple con mis requerimientos","reviewDescription":"Lo libiana","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Great little laptop for the price","reviewDescription":"Pretty good for most of your needs","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Spot on for the price","reviewDescription":"Very solid laptop. Bought it for our daughter whose Chromebook screen had cracked.Just make sure that you get the right item. We ordered it again for my wife and they mistakenly sent the wrong laptop. The one they sent did not have a port for the removable SSD hard drive so I was stuck with only the 64 gigs that are on board. Versus the 128 that we bought.However, in general it's a great laptop and Amazon was really great in sending us. The replacement. Hasn't arrived yet, but I'm sure it'll all work out.So just make sure when it comes out of the box that is the one you ordered.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Computer","reviewDescription":"Great price and quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Great product","reviewDescription":"Great product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Quality computer for the","reviewDescription":"I needed a computer fast for my job this one fit the stuff I needed it looks good it arrived fast all super fast and I've been using it ever since no complaints would probably buy again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"MS Office does not come with it. Felt lied to.","reviewDescription":"I bouhht this product for another family member. This laptop was advertised as having 1 year free of MS Office in the description. Initial setyp was fine, but when we tried to validate MS Office, it's asking for a product key and we never received one. This was the very reason we chose this product to begin with, and I wish we had chosen something else.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Don’t buy","reviewDescription":"Hard drive failed after a like 3 uses","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Pin issueS","reviewDescription":"Tried to set up a pin in Microsoft and it told me they were unable to create a pin tried numerous times with numerous people and nobody could get through and unfortunately my return plan had expired now I’m left with a computer I cannot use","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Very slow and inefficient","reviewDescription":"I probably got a defective one but if not It’s very slow and inefficient I messed around with it to see if it would ever speed up it sped up a bit but was still very slow returned the same day I got it. I’ve installed one application after it running so poorly just for it to be unable to run the application. Save your money I’d suggest spending 50-55$ on a Chromebook and getting better results over all.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"does not include Microsoft 365 as advertised","reviewDescription":"Does not include Microsoft 365 as Advertised","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Poor quality","reviewDescription":"Laptop stopped holding a charge 10 months in to owning it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Unacceptable on too many leels","reviewDescription":"Doesn't accept my emails, says I owe over $200 to Mcafee. When I tell them I want Mcafee removed they tried to scam me into giving my debit card number.  I've notified Amazon I want to return the laptop for full credit.  UPS picked it up yesterday.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Glitchy to touch","reviewDescription":"When I picked it up it went glitchy and froze moments after getting it. And turning it on. Sent it right back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"SLOW AF","reviewDescription":"slow slow slow, did I say slow? In 2023, you should not be able to purchase a BRAND-NEW laptop as slow as this one. I can't believe this is an Amazon choice. Why, does one hate normal speed internet? It's torture. I would honestly like to send it back.DO NOT RECOMMEND working on this thing. You won't be able to get much done. I'm really mad at myself for buying an \"Amazon choice\" laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Laptop is horrible!","reviewDescription":"This computer will not charge at all. I did the diagnostic and it tells me there is no battery, how is that even possible. Its also very slow and is super frustrating. Ive been working with HP to see what is going on but have no luck. Its also ridiculous that the return window is only a month. Such a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Newest Hp","reviewDescription":"My newer laptop is great and it handled the transfer of data from the older one perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Great Laptop","reviewDescription":"I love this laptop it's very lightweight, super fast & keeps a charge for quite a while.  I would totally recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Works as advertised","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Great value","reviewDescription":"Nice little computer...great for bill paying","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Great value","reviewDescription":"HP laptop met all my needs great value!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Solid computer","reviewDescription":"Does what I need it to do. Not running much on it just a browser and it works fine for that","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Good unit, Good price","reviewDescription":"This HP is light and works well. I have always had good luck with HP laptops","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Very satisfied, beyond expectations","reviewDescription":"Love it, almost too clean and snowflake white to touch. 😄 Honestly, it took me a few weeks to find the laptop I needed for work, and this was my pick out of many reviews read and comparisons made. Imo, great choice.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Can withstand Anything!!","reviewDescription":"This is my second HP and it has yet to disappoint. Only reason I got a new one was bc my old one was so outdated, that's how long I kept it. As far as performance and tech wise it works for me. What I needed out of a laptop was one that could withstand me and events of clumsiness and constant moving. Definitely passed that test x1000.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Perfect for basic web based operations, lightweight, good battery life","reviewDescription":"I love the fact that the re-seller removes all of the \"junk\" that typically comes with new PC's or laptops.  Keep in mind this is a $300 laptop, make sure you get the computer you need.  It drives me crazy when people buy a $300 laptop, try to use it for gaming, and then give a bad review when it doesn't work well.  I use this for almost exclusively web based computing, Microsoft 365, email, etc. and it works flawlessly.  In addition, it's really light and mobile.","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1703462400000}
{"reviewTitle":"Very disapointed","reviewDescription":"I purchase this laptop for an online class that Im taking used if maybe three times since my class started on August 19th and now the damn thing will not power on .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"I can type faster than it can display.","reviewDescription":"Needed a newer laptop to leave unmolested for work and school. No games. No internet browsing. No watching movies or wasting time. Something to keep clean and running like a top that I wouldn't need to worry about.I figured because of my intended use I wouldn't need to spend too much. WOW was I wrong.Here's the thing, this laptop is so bad that I type faster than it can display what I typed. I have literally NOTHING installed. It's running only what it came with from the factory. And when I type a single word in any app or program and I have to wait a moment for it to finish.This is BAD. This should have never gone to market. And what's hilarious is that this is in S mode which I guess is supposed to provide better performance.On paper it meets the requirements for windows 11 but I'm struggling to do anything.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"Dysfunctional","reviewDescription":"This supposedly brand-new laptop cannot perform its basic functions. It can't download anything from the Microsoft Store; it can't get out of S mode, which prevents you from downloading anything from the internet instead of the Microsoft Store. It won't even finish the process for the Windows 11 introduction","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Would not boot without error","reviewDescription":"According to HP when I called them the memory installed was not adequate for the computer.  The company did return the product without issue, but it did take time out of my day and lots of aggravation as I had purchased this for a new work from home job and it caused me days of delay before I could start the new job.  Do not purchase","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Garbage!!","reviewDescription":"1st attempt at starting up thus POS I chose to include downloading all my data & apps from my previous laptop. After 2 hours of \"loading\", checking for \"Updates\", etc ... I get an error message saying Windows 11 didnt download properly & was unable to open. I then reset the computer to factory settings & started over but this time didn't choose the download data & apps from my old laptop. It finally was able to open windows 11 but I've had nothing but issues with it since. I wouldn't recommend this laptop to anyone. I gave it 1 Star because they don't offer a NEGATIVE STAR OPTION.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"Not reliable!","reviewDescription":"This computer has had problems from day 1. It is very slow. It kicks me off any wireless internet I’m on intermittently, and now it won’t boot up when I try to turn it on. After several attempts it eventually does, but when I’m at work, and need it, I cannot depend on it. Would never purchase from this seller again. Buyer beware!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"BEWARE DO NOT BUY","reviewDescription":"This computer is garbage, it is ridiculously slow, times out or needs to refresh every single time. It’s a complete waste of money, DO NOT BUY. It takes 15 minutes to log in to anything and that’s if you can even login. I should have done more research I basically lit my money on fire. JUNK!! Disappointed in HP for making this garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Flimsy construction, warranty not worth the text it is written on","reviewDescription":"HP Newest 14\" Ultral Light Laptop for Students and Business.This $300 laptop was poorly constructed and did not last 9 months. The body felt plastic\/flexible and did not have structural rigidity when purchased. A cosmetic plastic cover fell off and 2 weeks later the screen stopped working. I tried taking it to a local repair shop who relayed that it was dead. I called HP tech support for help and they quoted me $350 for repair. I did not take them up on the offer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Defective laptop","reviewDescription":"This was supposed to be a brand new product and it started having issues the first week that I got it. The laptop stopped turning on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Amazon added more RAM than this computer was compatible with.","reviewDescription":"This laptop was great until it wasn't. I had it for 3 months and then it died and wouldn't turn on. It was past the return window and so I contacted HP because it was still under their warranty. They told me this computer was only made for 4 GB RAM, but said Amazon must have installed additional RAM and it crashed the laptop. I didn't realize they tinkered with the laptop. I assumed it came straight from the manufacturer. However, after I had this info, I contacted Amazon and they refunded my money.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"What i expected Love it","reviewDescription":"great laptop for the price..... i needed a laptop for work and this is perfect it only as 64G but you get a sd-Card for more storage perfect for work from home and school","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Great!! I truly love my laptop","reviewDescription":"I bought this for a proctor exam and was going to give it away after I took my exam. But not only did this work for my proctor exam, but I use this laptop for YouTube and movies!!! I was iffy about buying this because I needed a laptop to take my managerial food handers exam. And it served it's purpose and more. You can use this laptop to take a proctorU exam","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1717459200000}
{"reviewTitle":"Enjoyed using it","reviewDescription":"I’ve enjoyed using it so far. The white was a great choice. Screen quality great and great performance. I’ve had it for about 3montha now using it everyday and the condition and appearance is still good. Sound is good and versatile.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"That it is everything i love it","reviewDescription":"I love it all very very njce comouter","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Happy","reviewDescription":"Great cost.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Portable Powerhouse: A Review of the HP 14\" Stream Ultralight Laptop\"","reviewDescription":"The HP 14\" Stream Ultralight Laptop is a stellar choice for students and business professionals seeking a versatile and reliable computing solution. With its sleek design and under 3-pound weight, it's effortlessly portable for on-the-go use.Powered by an Intel Celeron N4000 series processor and 8GB of RAM, this laptop handles everyday tasks with ease while delivering crisp visuals on its 14\" HD display. Plus, with up to 10 hours of battery life, it's perfect for all-day use without constantly needing to recharge.While storage capacity may be limited for some users, the addition of cloud storage options and a microSD card slot helps alleviate this concern. Overall, the HP 14\" Stream Ultralight Laptop strikes an excellent balance between portability, performance, and affordability, making it a top choice for those with busy lifestyles. Highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"76 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Great Laptop","reviewDescription":"The computer arrived on time. I unpacked the laptop and was shocked at the slim design and lightweight.  The processor is fast and it came with Microsoft applications. I plan to buy my niece one when she begins school.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Light Weight","reviewDescription":"Haven’t had any issues. I don’t use it for anything major just school & business. It does the job & I’m more than satisfied","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"very light","reviewDescription":"fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"great prize for youngster","reviewDescription":"great prize for youngster","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"locked into MS S mode, be careful of the bait-n-switch","reviewDescription":"5\/31\/2024Update: Revised review to 4 stars from 1. If you're lured to these by an Amazon flash offer, and begin to compare other options\/offers, be sure to throughly compare the descriptions. Or you'll purchase something you didn't want. If you find this out after you set everything up and there is no problem with the computer itself, you're stuck with it. The other issue I had was the inability to exit Win 11 S mode. After hours of trying the standard method and several youtube videos with complex work arounds, I gave up. Today I decided to express my feelings in the MS Edge search window and I received this response from Copilot. (posted in the picture above). I post because subsequent requests produced different results. This work around worked quickly and was a three step fix. Have exited S mode and am happily running Google Chrome. Plus all my Google info and files from my broken laptop ported over. One last note: this is definitely a computer for students. It is priced reasonably considering post Covid greedflation prices. It is comparetively slow and not for use use for gamers. I will keep it as I need a computer for research and writing papers.5\/30\/2024-My laptop broke. Needed to complete paperwork for a project with tight time lured by \"Deal\" for laptop with 4GB ram 64 storage Bluetooth, Wi-Fi. $169, 12hr delivery.  I figure it was good enough to get my work done. At the site several other options were available with the same features and more memory. All had delivery dates of 1=2 days except 1 with 8GB ram, 192GB storage for $259 w\/ $40 coupon, Thought extra memory and storage was worth extra $90. Computer arrived. It took an 1-1\/2 hr to do updates. When I tried to download Chrome to work in Google docs {state recommended for changes}. This computer is locked into MS S mode blocking download of apps not in MS store. After spending 2hrs trying  different S mode exit directions is was resolved to doing the work on my Samsung S20 which took 3 hours to do 1 hr of work. This computer doesn't have Bluetooth, is extremely slow. MS locks y into using Edge in a worse case scenario than they did with Explorer 25 yrs ago. Don't be lured by the free1yr of Home 365. Cannot return because I used it and is technically not broken. HP is obviously returning to the days of cheap low-grade Compaq. Clearest example of Greedflation. It also moved data from broken laptop creating what will be hours of scrubbing to sell at 1\/2 price on Ebay.","isVerified":true,"ratingScore":4,"reviewReaction":"41 people found this helpful","country":"United States","date":1717027200000}
{"reviewTitle":"It's OK for what it is..","reviewDescription":"It's a handy little computer that I got for just one special task.  I have an off-grid solar powered shop and sometimes the battery bank jumps voltage from 51.2 back to 50.. Then I get an obnoxious warning signal and flashing red error light.. I have special software that I use to communicate with my inverter to reset the battery voltage to 51.2.  So I use this computer to reset the voltage..The two finger tap for right mouse clicks is clunky and frustrating.. So I got a mouse and a self-adhesive mouse pouch and stuck it to the computer..  The computer works fine now..","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Lightweight","reviewDescription":"I actually really like this laptop for the size and the weight but the memory filled up really really quickly and I had to buy a hard drive, which is probably my mistake. I should’ve bought some thing with more memory overall it’s definitely worth the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Excellent computer..just not liking Windows 11","reviewDescription":"Hay! So I originally got this for my mother and there's no real issue with the computer. Very sturdy, very well made, just the force of having to log in with your google account is a tad annoying","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Get what you pay for","reviewDescription":"Overall, it’s lightweight and affordable. But it also feels lightweight and affordable. The keyboard clicks are loud and the screen resolution\/color is pretty low quality. However, for $267, you get the value and it gets the job done.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Glitchy","reviewDescription":"My computer screen randomly goes black and that is an issue with function. So far it has worked well, and it has been needed. Buy a protection plan so you can send it in if it has issues. That will be lifesaving.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Not bad for price","reviewDescription":"If you are looking for a simple computer to do very simple minimal things on, this is great. If you need a gaming or work computer, this is not the computer for you.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Works ok for work","reviewDescription":"Cheap price for new. Would buy higher model in future. TouchPad mouse and pointer response erratic at times.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Laptop","reviewDescription":"Satisfied","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"You get what you pay for - but not bad!","reviewDescription":"Honestly, for the price, this is not a bad laptop! I was looking for something I could game on, instead of cramming up my MacBook with stuff. The initial storage room for this laptop is not huge; however, it comes with an SD card! That was a nice bonus. It is not the fastest laptop in the world, but that is to be expected for how cheap it is. The keyboard is really nice and the keys feel good to type on. I don't really use the mouse tracking pad, but it hooks up to my USB mouse just fine! I think that this laptop would be perfect for someone who doesn't need to load a lot of programs, maybe someone who enjoys streaming videos, or just browsing the internet. Overall I think this is a good laptop for the price, but do your research to make sure this is what you are looking for. When I set the laptop up, it said something about a finger print lock and a touch screen - both of these options are not available for this laptop.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Works but cheap and flimsy","reviewDescription":"By the price I should have known but this computer feels like it could break at any second 😅 it's light as air which is nice but even opening up the laptop there is some weakness to it like you have to give support in another spot so it doesn't crack in half. Also the storage is an absolute joke. They give you a memory card to put into the computer which is then almost fully taken up by pointless daily updates. I ended up purchasing a terabyte card and moving the one game I downloaded onto that since there wasn't enough space to download it onto the brand new laptop. They just don't make em like they use to.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"No internal memory","reviewDescription":"Too small of memory, couldn't do anything with it!!!! Returned it!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Doesnt run very well","reviewDescription":"Slow, sometimes the screen goes dark and you have to do hard reset I middle of what you are doing and it also deletes work. I use it for school exclusively and shouldn’t be acting up when all you use is zoom and college ur laptop Brady research websites.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Waste of time","reviewDescription":"Very slow,it's not worth the buy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Cheap","reviewDescription":"Poorly made. I'm only using it for school, looking up articles and typing papers but often it's gets so slow. I'll be typing and there is like a 5 second delay for each letter. It's been freezing where the mouse won't work and I have to wait a few min for the system to catch up. I received this 1\/19 so 9 days ago and it looks like the bottom right of the screen is already burning out. The keyboard is extremely cheaply made. I guess you get what you pay for....I just figured it would be months before I started having issues...not days","isVerified":true,"ratingScore":2,"reviewReaction":"13 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"YouTube\/Movie streaming","reviewDescription":"Is Horrendous on this laptop","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Not for business.","reviewDescription":"The laptop does not have the RAM needed to perform in our office setting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"So slow","reviewDescription":"This computer takes forever","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Not working","reviewDescription":"Haven’t been able to get it to come on. Followed really minimum directions and I am replacing  another very similar HP laptop so the product is very familiar to me.  Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Screen Quality and resolution","reviewDescription":"Screen quality and resolution far lower than I expected it to be. Also it freezes frequently.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"So far, so good","reviewDescription":"It seems to be running better than I thought becauseI'm used to systems with lots of space.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"great for the price","reviewDescription":"Not a great computer but for the price, it is. Good size screen. The mouse is a little funky, but I could always get a separate mouse.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Totally worth it","reviewDescription":"Wonderful laptop for the price!! i only have 64gb of storage when i paid for 128 so that’s why it’s only getting 4 stars but it’s really awesome besides that!","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Light weight","reviewDescription":"So far so good. Had a little glitch. But over all has been working good. Would recommend 👌 👍🏻","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Decent basic laptop","reviewDescription":"Overall, a very good basic laptop.  Touchpad works well, and screen size very good.  Very lightweight, and doesn't overheat.Cons:  Prepare to spend a while getting it set up.  It downloads Windows 11, and then you'll spend quite a bit of time going through multiple updates.  You'll also have to unlock the \"S Mode\" if you want to install anything like Firefox, Chrome, or any other package not available in the Microsoft store.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1655078400000}
{"reviewTitle":"It's in S mode.","reviewDescription":"This product comes in S mode which limits apps to Microsoft store apps. No biggie, I decided to wean myself off of Google and give S mode a try. I am in my 50s and don't do or need a bunch of garbage on my computer. The solid state harddrive fires up quickly and it plays all my music just fine. You can take it out of S mode if you want to. I do not want to.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1656460800000}
{"reviewTitle":"It works with cable","reviewDescription":"The regular cable will work but turn it upside down.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Quality","reviewDescription":"Very good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668902400000}
{"reviewTitle":"Has anyone had toorder an external keyboard\/mouse?","reviewDescription":"Apparently the keyboard on the original was bad.  Has it bee improved, or is it the same one?","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"Nice product for the price","reviewDescription":"Its little bit slowly. But inuf to my needs","isVerified":false,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"It okay for the price","reviewDescription":"I'm not a tech person at all so let me say that this laptop is fairly easy to set up when you barely know where the on button is.  You just have to take your time and read the instructions that pop up on the screen thoroughly.  What I did notice (and it aligns with reviews I read before purchasing) is that some things are slow to load (took forever to get it to recognize my printer and scanner).  Also, during set up there are a ton of annoying ads to purchase further apps etc.  I just deleted those as they came up, but still annoying.  (I know what I need, I know what basic security comes with the laptop so stop trying to sell me extraneous crap I don't need!!!)  The reason I got this HP is two-fold. First is sale price.  On a budget you can't beat under $300.  I don't stream movies or do gaming.  I just need a basic laptop for bill paying, shopping and emails.  The second is I had to get away from the crappy chrome books I've previously bought.  Found out you cannot add memory to them and the memory runs out quickly even when you delete a bunch of stuff and keep apps to a minimum.  So having a 'regular' laptop is going to be good in the long run if I need to add memory.  If anything wonky happens in the next few weeks I'll be sure to come back and update this review.  So far its okay.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"So cheap- very disappointing","reviewDescription":"I get that this was an on sale laptop, but it’s terrible. I regret buying it. The mouse pad sticks horribly. I needed a computer to run my business on. I didn’t have alot of money to start with and I literally have to hold the laptop on its side for the mousepad not to stick and mess everything up.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Bad cord from the start","reviewDescription":"We ordered this and right from the beginning the cord is bad.  Went to HP for support as the site says too and they said unit had been upgraded from original and we had to go to Amazon or the seller - spent hours back and forth and decided to return and just order something new again","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Microsoft sucks","reviewDescription":"It just does, piece of garbage computer did everything it possibly could to keep me from installing chrome. From scummy warnings, pop ups, blocking me from installing \"untrusted apps\". They even hid the way to disable that block inside their microsoft store. Ps, the actual pop up for the block doesnt tell you what you need to do to disable it, in fact it tries to trick you in a round about journey.Big tip, look up switch out of S mode. Follow the walkthroughUpdate: the laptop is also incredibly slow, worse then a phone. Applications are constantly freezing or crashing. It's a brand new device and yet preforms like a computer from 2010 thats been in use for five years. It's pathetic, if it continues to disappoint then I will be returning it as a under performing product that cant even do the basics that it needs to","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Was this refurbished?","reviewDescription":"I have had this computer since January 2024 and have had problems with it since day1. Suddenly it will start typing in caps and the cap lock button is not on.2. Sometimes it won't recognize the keyboard3. Some buttons are sunken into the keyboard on the left side...Horrible purchase.  Stay away!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Very Slow","reviewDescription":"We bought this for zoom only. It is pitifully slow. We are using external camera and external speakers and zoom application. One to two second lag with any mouse movement in zoom or keystroke. There is a lag even when the only app running is MS word! Really disappointed and we'll need to buy a different laptop. We did not begin using it within the 30-day return period or we would have returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Very flimsy cheap","reviewDescription":"If you're wanting this for anything other than basic use please do not buy. The keyboards are loud. The buttons stick. The screen is very small Really the laptop is small in general. Does not have this sleek look to it. The battery life is not the greatest.If I could go back and choose a different laptop I definitely would not be choosing this one for school","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Very slow","reviewDescription":"I bought this for my daughter’s graduation. We have done all of the updates and it is so slow. Unfortunately it’s out of the return window and now she is stuck with a computer that barely works for college. I don’t recommend","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"Microsoft Edge has a deathgrip on this laptop - you are not allowed to install apps","reviewDescription":"You cannot use another browser unless you download from Microsoft so they can have their fingers in your data. There is a setting they have enabled, requiring all programs be downloaded from them that according to the internet can be disabled by going into app settings and changing a setting in apps and features, selecting \"anywhere\" for where you are allowed to download apps from.On this laptop, that setting has been removed from the menu, you can search it in the app settings, it clearly says it is located under advanced app settings, the description before you open it states, \"Choose where to get apps\" however that setting has been removed from the menu. This basically bricks the laptop as far as i am concerned.This laptop is TRASH","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"Worthless piece of junk","reviewDescription":"I wanted to buy a relatively inexpensive computer to do minor work and this computer is slower than molasses. Also, the mouse pad doesn’t work and it takes forever to do anything. I missed the return period and am now stuck with junk and can’t do the work I need to do. Not happy.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Stuck on this screen","reviewDescription":"It has been stuck on this screen for hours :\/ after a couple hours I went back and tried again, and still stuck. I’m not sure what the issue is but I will be returning","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Windows does not work","reviewDescription":"I paid $144.44 for Microsoft windows and it does not work not work on this computer.  it  took me two nights two find the product code.  The tool bar is monotone, Word does not work IT DOEST NOT WORK!  I also ordered an external CD\/DVD player, Windows 11 does not read it, I cannot down load any soft ware for read the external drive Windows blocks it.  Now the Amazon RIPOFF ARTISTS would let me return their piece of crap HP computer or the external drive or Microsoft Office!  Your a bunch of crooks selling inferior products!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Not new","reviewDescription":"Received this computer and looked great and was working fine so threw the box away. 2 weeks after purchase tried to print and it said the print driver was not available. After calling HP support I find out that this computer is refurbished and has no warranty. On top of that it has viruses. Can't say that it came with them since it was connected to my WiFi but since I threw the box away, I'm stuck. Will never buy a computer from Amazon again.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Hard, difficult to set up and get running","reviewDescription":"Can not setup.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Slow and Caps lock randomly gets stuck.","reviewDescription":"Laptop is slow. I mean can struggle to open the files window slow. I bought it to basically use word processors on and I can’t even do that since the caps lock will randomly toggle on, even when it’s not been touched. I’m 5 days outside of the return window now having these issues so DO NOT BUY.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Junk","reviewDescription":"I am very disappointed with the computer, so disappointed that I'm leaving my first ever review.  I bought this as a cheap work computer I could at least use for Zoom.  But everything lags, including videos, despite a great internet connection.  Even typing is slow to appear on the screen!  I'm not sure if it came with too much pre-installed junk, whether I need to manually update a bunch of drivers, whether I need to add RAM or a new graphics card, or what, but I shouldn't have to. Perhaps this computer just represents a $300 lesson learned, the lesson being to not try to save money on computers!","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Don’t waste your money.","reviewDescription":"I never write reviews on anything, but this laptop is NOT worth your money. The charger cord doesn’t stay plugged in like it’s loose. If you put the caps lock on and turn it off, it sometimes still stays in caps lock.. it is NOT touch screen even though it says it is. The absolute worst laptop I’ve purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Scam","reviewDescription":"RECEIVED LOCKED LAB TOP. CANT GET LOGGED IN. TERRIBLE SUPPORT","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Junk","reviewDescription":"Received first--keyboard did not work. Returned it for a replacement. Replacement's keyboard did not work. You get what you pay for.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Soooo slow ….teaches you patience","reviewDescription":"Everything is super slow operating on this laptop .  You would be better off getting a Chromebook","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"The details that are stated in the product specifications is WRONG","reviewDescription":"Sound low asfBattery goodBrightness goodColor goodQuality it could’ve been better I wanted a 8GB laptop for work I read multiple times before purchase it stated 8GB when I scanned the barcode for information it is a 4gb you’re very lie kmft not worth it don’t buy keep searching","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Not Happy at All","reviewDescription":"Just received this laptop today.  Went to start it up and no power at all.  When I first opened the box it didn't look right.  Nothing was sealed and the power cords were not properly wrapped, as if someone else had quickly packed it up and sent it back because it didn't work for them either.  There were fingerprints on the laptop and the paperwork with the directions were so mangled I could barely read them.  Needless to say I am sending it back immediately.  Not happy at all that I have nothing to use now.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1692748800000}
{"reviewTitle":"Died within 5 months.","reviewDescription":"It was a decent little laptop when it worked.  I used it fairly minimally just every few days or sometimes a week or two in-between.  Last week when turning it on, the thing crashed and died.  It lasted less than half a year.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Dead after 5 months","reviewDescription":"The screen went black, dead, after 5 months of use.  Not sold anymore on HP products...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Slow","reviewDescription":"I’ve only had the computer for about a week and it runs so slow. Waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Undeniably slow","reviewDescription":"This is the slowest electronic I’ve ever purchased I have to constantly turn it on and off and hope it actually lets me open anything without it glitching or freezing and I purchased this to complete school work I don’t know it it’s something that can be fixed but I don’t think it worth buying even if it’s more affordable it’s not worth the headache. Also the time will freeze and i have to constantly go into setting to change that.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Don't buy from this seller","reviewDescription":"They send you problematic computers that will die days after the 30 day return policy is completed and then tell you to take the issue to HP.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Terrible","reviewDescription":"Had the computer 2 months and it’s been nothing but problems, super slow, won’t download anything, keys don’t work, and today it completely crashed…. Don’t waste your time or money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Sucks","reviewDescription":"The touch pad is garbage","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Too cheap - my bad","reviewDescription":"I knew this laptop was cheap, but it was so slow that it was unusable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Stuck in S mode","reviewDescription":"Complete junk won’t come out of S mode just save your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Too Slow","reviewDescription":"Wish I had not purchased it. The slowest laptop I've ever had. Terrible to use the internet. Don't buy it!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Not good","reviewDescription":"Stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Graphics?","reviewDescription":"Everything about the laptop is great but just having the worst time with the graphics on it?… i phone 5 had a better time running basic stuff in google than this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Look else where","reviewDescription":"I purchased this computer in order to complete my schoolwork. Unfortunately, it is extremely slow and if you have more than one screen open at a time, because even worse, and sometimes my screen even blacks out","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"It's ok","reviewDescription":"I expected better, don't think it will last long, already seeing screen issues.Wanted to give HP a try but wish I went with Dell. I've had Dell's in the past and for price they seem better. Maybe it was this retailer but I would not buy this again or from this distro.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1657756800000}
{"reviewTitle":"Cheap.","reviewDescription":"I have only had it three months and it doesn’t come out of sleep mode. Constantly has connection issues with Wi-Fi.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1661472000000}
{"reviewTitle":"NOT EFFICIENT","reviewDescription":"The major dislike of this laptop is that you have to be directly in front of it for anyone to hear you talking. It glitches and the screen goes black. Not a good buy.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"The pc drops, the picture isn't very good.  It is plastic basically.  The picture was pixalated.","reviewDescription":"Picture was pixalated.  Touch pad was over sensitive. Sceen would suddenly go dark periodically with no warning.  You have to have a microsoft account to use it.  Windows use to be available eithout a microsoft account.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"laptop","reviewDescription":"wouldn't start! returned product! poor support","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Not great from day 1","reviewDescription":"I got this specifically for my son to play games on, but the arrow keys stick which really messes up the game.  Maybe stick isn't the right word, but when using the arrows or even the space bar, it will often make the game character take off in an unintended direction and there's really nothing you can do about it.  Because the keys externally look fine.  Not the end of the world, but since that's the intended use, it's extremely frustrating.I've also already had to hard reset the product with the \"black screen of death\" being the reason, and I've only had this for a couple of months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Extremely slow","reviewDescription":"Very slow processor and a 4-hour battery life.  They make you go through hoops to get rid of Bing.  Even after dumping many crappy add-ons, it's slow to respond. The only good thing about this laptop is the speakers.  Extremely narrow viewing angle.  I was trying to save money, but it wasn't worth it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Get rid of edge","reviewDescription":"Microsoft edge slows everything down","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Very Very Slow","reviewDescription":"I liked The Price,  But Very Very Slow.  Poor response and locks up or freezes a lot.  Was just using it for basic use, not gaming.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Slow slow slow with zero help from seller","reviewDescription":"As I type this, the letters won't even appear. Take a few seconds before they catch up.When I click to open the File Explore, it takes like 8 seconds to open.Want a new word doc, have a seat and wait.I reached out to the seller by email twice and called once. No response.If you have to do any actual business or need a laptop to do multiple things at once, DO NOT BUY THIS","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"So slow","reviewDescription":"After 2 hours of updates.. It lags with ONE chrome tab open. ONE TAB.... No thanks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Not functional","reviewDescription":"Constantly slow and losing functionality. It will cap lock even if the button isn't pressed, won't connect to a mouse, mouse pad stops working, keys lag when you press them. Not good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Amazing","reviewDescription":"Battery and the look amazing it looks like a goddess but now in that sense","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Works great","reviewDescription":"Arrived on time and kids use it for school work","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Thank you","reviewDescription":"Love the lab top and best lab top ever","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Laptop","reviewDescription":"My old laptop was very slow and couldn’t keep up.  The new hp is clearly more productive.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"Little Blessings Daycare","reviewDescription":"Good quality and good price! Pleased!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Light weight","reviewDescription":"Has HP quality.  Pleased with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great lightweight PC","reviewDescription":"I bought this PC to take with me while traveling.  It is very light and meets my needs perfectly.  On top of that, I was pleasantly surprised to find that it had a 128GB eMMC (instead of the 64GB eMMC advertised) +128GB Ghost Manta SD Card!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Perfecta","reviewDescription":"Asegúrese de quitarle el modo S y funcionará a la perfección se la compré a mi hija para la Universidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Amazing to use !","reviewDescription":"Aamzing lappy indeed","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Deal","reviewDescription":"Works.well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"This Mac User Is Very Pleased","reviewDescription":"I'm an Apple Mac and iPhone user but needed a laptop for working remotely. My company works on non-Mac environs so I wanted to integrate easily and pay as little as possible. I'm very pleased with the look and performance of this laptop. Great looking, big screen. My only issue is the track pad - needs a lot of pressure. No matter... I hooked up a wireless mouse an all is well But when HP makes a next generation, I'd def suggest fixing that.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Good","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Not the fast speed I expected","reviewDescription":"I did a lot of research for good laptops within my budget before choosing this one. I looked up the difference between the types of memory, what memories were faster, and I thought this would be the best. It’s a decent computer. It came with a 1 year Microsoft office subscription which was cool. But I’m just not impressed with the speed. The time between clicks is too long in my opinion, and it’s not just when using the internet - so it shouldn’t be due to bad WiFi. I got it to use for a remote job, and I hope it’s good enough for that purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Not bad for the Price","reviewDescription":"It works pretty well. I don't really need for anything to complicated. For surfing the web and watching videos. I don't use it for games or design so it works pretty good.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"slow","reviewDescription":"Does the job but there is a lag while browsing","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"There is no touch screen on this model","reviewDescription":"Was specifically looking for a laptop with a touch screen and was really disappointed to receive this without one even though it says in the description that it has one.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Great laptop for the price","reviewDescription":"I always buy HP.  This little laptop is easy to transport, works great for my needs.  Especially for the price it was an excellent purchase","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Cannot run most games or other heavy programs, keys jam occasionally","reviewDescription":"You pretty much get what you pay for to be honest. I'm using it as an emergency backup until I could get my good laptop fixed. It can't run most games like terraria or minecraft, but can handle a few simple ones like undertale. It starts up quickly and otherwise does everything a laptop is supposed to do. It comes with a year subscription to all adobe products but I haven't used that as I don't need those programs. Sometimes a key will get stuck and you have to push it again to unstick it, which is pretty awful for gaming but not a huge deal outside that.I only took off one star as to be fair this isn't advertised as a gaming laptop and is very cheap compared to other new options. If you don't want to run heavy programs it's a perfectly functional option","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"troubleshooting","reviewDescription":"there were few if any instructions\/manual. spent $10 taking it to a local computer service. They found issue in a minute.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Update issue resolved- No year of Microsoft 365 as advertised","reviewDescription":"Update- the seller mailed me an office 365 key card and resolved my issue within a week of my purchase.Having a year of free Microsoft office apps was a significant factor in my decision to purchase this computer as opposed to others. It did not come with a product key or any instructions. I have been messaging with the seller for 2 days to resolve- they are being responsive, but have said they will “mail me an office 365.” I am slightly confused and skeptical- I will update this review when or if I receive a satisfactory resolution.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Tiene contraseña","reviewDescription":"Me pide nombre de usuario y contraseña, donde puedo obtenerla ?","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"This laptop does exactly what I need it to do","reviewDescription":"My only complaint is that the mousepad is a little outdated and makes hard clicks.  Other than that this laptop does exactly what I need it to do.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Does not have Ethernet plug","reviewDescription":"It’s light weight but no Ethernet input","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Great Laptop, wrong color though…","reviewDescription":"I received my laptop yesterday and noticed that the “snowflake white” color laptop is more of a silver color? 🙄 Other than that, it’s working great so far.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Nice little laptop for the price.","reviewDescription":"What do you expect for a $300 laptop?Got this for my wife for Xmas.It starts and runs without fail and she can get her work done.  She doesn’t game or anything so we don’t push it.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"Does the job","reviewDescription":"I got this as a short term arrangement. It is working well minus some issues with the keyboard at times. It is light enough for me to carry in my backpack and functional for me to get work done on the go.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"The latest Windows is annoying to navigate , but the laptop is OK, it's just a little slow .","reviewDescription":"The laptop is good but slow . The latest version of Windows is a pain to navigate .Battery life is dependant on your brightness setting , and online searching , or video watching .With just regular usage it lasts about 6.5 hours off of a full charge .","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Perfect","reviewDescription":"Nice laptop for work. Seems to work great for what I’m doing browsing, zoom calls. Nice and light too","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Windows 11","reviewDescription":"So far so good the only issue I have windows 11 will not me to load any app not the Microsoft StoreWanted winapp as my music player it’s te best I ever had. I had to download Microsoft media playerOther than that all so far good. Paired with my Bose speakersIt’s not the laptop’s fault but Microsoft’s telling what I can download","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"My daughter likes it","reviewDescription":"It worked out of the box, seems good quality, and does what my daughter needs. Seems slow to me, but she’s happy so I’m good","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Missing Half the charger","reviewDescription":"It did not come with the outlet side of the charger, so cannot use.  Classes start this week and I'm screwed.","isVerified":false,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Not enough RAM","reviewDescription":"I knew it was a risk when I bought it but there is not enough memory for what I need this laptop for. I use it primarily for my small business and need to upload and store product pictures. I’ve had to transfer files to a jump drive to free up space. It would be great though for a student it if using it just to get online! The other thing I noticed is that the brightness is just not that bright. Not great for editing pictures or watching videos, but would be fine for other things. I do have to restart it quite often if I’m working on it quite a bit. It starts to slow down and freeze.","isVerified":true,"ratingScore":3,"reviewReaction":"43 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Disappointed... Slow processing speed","reviewDescription":"Forced to get a new laptop because of audio system incompatibility with new Windows in my last laptop. Pleased with this HP laptop's design and the specs (on paper) especially with the SD card reader. However, extremely disappointed in this whole S mode business, which is a Windows thing not unique to HP, so I had to switch out of it to download apps that I usually use (including MICROSOFT Teams! I don't know why that's not \"safe\" for S mode). Processing speed is very slow, even with only one Internet browser open. I can no longer multitask on Zoom meetings because the audio starts to cut out and lag when I switch windows. I also had a lifetime Microsoft 365 subscription, but I was unable to transfer it to this laptop (again, general Windows issue). Moderately disappointed with this laptop given the positive reviews but I will manage...","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"Better check PC before downloading all you files","reviewDescription":"I bought the HP 14\" Stream Ultralight Laptop thinking, it was a good addition to my current desktop HP computer running Windows 11. Setting up the new PC was easy, perhaps too easy. New PC asked for router password which I gave.  PC asked for permission to copy all my files from my old desktop.  I am figuring “what the heck” it made set up new PC easy. Big mistake!  You have to understand everything was automatic up this point.  I didn’t get real feel for the laptop. When I finally got around to actually using PC it was BAD.  It picked sometimes without hitting left button (the “hover” function was turned on --- I tried to turn off NOPE).  Often, I had to press the left button several times to pick.  Later on, when I hit left button it acted as if I pressed right button. (given a choice number of actions “open new window” etc.). I requested a return and Amazon approved my request.  But here’s the rub: Amazon does not want my personal files on the laptop.  But my new laptop is a clone of old desktop through the connection with THE CLOUD – anything I do to one of PC is reflected on other PC!  I thought I broke the connection by disabling the laptop access to router NOPE.  When I try to delete a file from laptop, the laptop says “cannot delete file because you are offline”.  Apparently, the new laptop is a good PC, I just happened get this lemon.  I will try to show you the problems on video. I could only upload one video -- I press the left button and PC act like I pressed the right button.","isVerified":true,"ratingScore":3,"reviewReaction":"24 people found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Works but has issues","reviewDescription":"Not all the keys register being pressed, causing endless spelling and grammatical issues.The mouse pad keeps getting stick and will not register clicks or randomly registers extra clicks.Everything runs okay once you remove S mode on it, otherwise you are stuck using slow and ineffective programs.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1725235200000}
{"reviewTitle":"pretty good for the price but....","reviewDescription":"As a student taking online courses, this laptop is ideal for me. The keyboard is comfortable, and the battery has a long life between charges. It's fast and operates smoothly. However, I've noticed some defects on the screen. At first, I thought it was merely dirty, but it turns out there are small, blurry blotches on the actual screen, which is quite disappointing. Were it not for this issue, I would rate it higher, as it fulfills all my requirements.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Bare Minimum","reviewDescription":"I needed a laptop that was inexpensive and lightweight, and decided to give this one a try. It will be light to travel with, which is what I wanted. But it's just okay - nothing spectacular about this laptop. Microsoft doesn't make switching out of S mode easy, so if you plan to use other apps (like Chrome), just know you will probably have challenges. That's no fault of the laptop - just something to know before you purchase. Battery life isn't great, so keep your charger handy. It's a bit slow, but does mostly what I need it to do.... for the price, it's an ok laptop that should be fine for very basic use.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Box cam semi smashed cans tell if contents is compromised","reviewDescription":"Carefully unpacked contents and all appears to be intact only damage is with box  only thing is one of the cords for charging is missing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"S Mode is a Joke","reviewDescription":"Honestly what a pain in the butt. It will not get out of s  mode no matter what I try. In the end I had to reformat the entire computer on a windows 11 boot disk. After doing that, it would finally get out of s mode.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Slow and screen could be clearer","reviewDescription":"I bought this because I needed a newer PC with Windows on it to run Power BI. I am a little disappointed.The boot up time and the time it takes to open up programs is not fast. The screen is not clear and I have a hard time reading the numbers (even with reading glasses). The screen looks over exposed and changes in the settings won’t correct it. The keys are pretty loud. It looks like it was built on a Friday; the edges of keyboard section don’t quite meet up right with the case.I have decided to dig out my ‘20 MS Surface Pro to handle PBI.I will give it a 3 instead of 2 star because my daily user is the MacBook Pro w\/M3 and I didn’t pay a lot for the HP. I did like that it has two USB and a USB-C ports.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"No back light","reviewDescription":"I was disappointed in myself that i didn't do my research better with the specs.  192 GB storage is misleading, what it really has is 64GB, however you can only access 39 GB.Also there is no keyboard backlight. For $ 359.00 a keyboard backlight was frustrating to find out. I can't exchange my laptop because of amazon return policies. This will be the last laptop i purchase through Amazon. I gave it a three star because it's a good laptop. besides Storage and backlight the laptop works decent.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Glitchy keyboard","reviewDescription":"Overall, it's ok, thought a cheap laptop. I consistently have problems with a glitchy keyboard, but didn't do something in time to be able to return it. I had to go through several rounds of unsuccessful HP support service sessions to try to fix it.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Slow and didn't sync","reviewDescription":"It was pretty slow right out of the box. It also wouldn't sync the time properly. I tried all the settings to correct this issue but it never resolved the issues. It was so slow that even typing was a chore bc the letters were delayed. I had to return it. Although the price is cheap Unfortunately so was the computer.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Mi opinión","reviewDescription":"Es muy básica","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"its okay","reviewDescription":"Got this for our 11 year old who loves to write stories and plays roblox. I guess you get what you paid for, good for 11 year old but it is NOT touchscreen. But she is able to write her stories and play games on it just fine. Pretty good battery life.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Wont load or run older versions of Microsoft software","reviewDescription":"Was very disappointing that I now have to pay for subscription for the standard MS Office software.In past, you could upgrade a computer and retain your current versions of software.  Seems eachapplication requires you to accept a subscription to use it, and Microsoft defaults all the commonapplications to its subscriber versions of its software.  You have to wade thru a biased setup process tochange any of the selections, very under handed if you ask me","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1700784000000}
{"reviewTitle":"Slow & flimsy","reviewDescription":"This is fine for the price, but I would not purchase if you are doing time sensitive tasks all the time. It takes a while to load pages sometimes. The laptop is super lightweight it is a little flimsy though I can see the keys moving into it when typing on it. Have had it for over a month will update later.","isVerified":true,"ratingScore":3,"reviewReaction":"32 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Misleading info regarding to storage","reviewDescription":"This was supposed to be 190 GB laptop. Everyone pay attention it’s really 57.4 GB. But!!!! With the operating system, you’re left with 27.7 GB.I recommend you use a cloud service to save your large files or eventually upgrade to a larger SD card. For the price its worth it, especially if it’s not your primary computer. i’m planning to use it for seven classes hopefully should be enough for a semester. But again for the price I can’t complain I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"Wouldn't recommend.","reviewDescription":"Overall it was an okay purchase. I use to for school work its a bit slow but gets the work done. If you are looking for a computer to game on, I won't recommend this laptop, Slow and the graphics are terrible. Also one day it shut down all of my tabs and I lost a lot of work I had to redo.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Slow","reviewDescription":"It’s just very slow you cannot game on this laptop whatsoever","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"It was good at first","reviewDescription":"I loved this laptop upon arrival, but after a couple of weeks the mousepad started to jam and it would randomly start typing in CAPS LOCK although it was turned off, and sometimes wouldn’t write in caps lock even when it was turned on.Outside of that everything was fine.I thought that it was just this one, but I ordered a replacement and had the same exact issues.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Works well but slow","reviewDescription":"I feel like I'm using an old laptop.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"El cable eléctrico no es el correcto y no carga la batería ni provee energía eléctrica a la laptop","reviewDescription":"No cortó la batería.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"It’s ok not great","reviewDescription":"So I got this computer to do photo and flyer edits. Now it’s extremely light and looks great. Unfortunately it runs slow. I did buy an extended hard drive to make sure it’s not a lot on the computer to make it run slow but it still runs slow. I’m not sure if I would recommend this to anyone but if you’re not doing a lot and don’t need the space then get.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"Bare Minimum","reviewDescription":"Got this for an elder parent to read emails, shop, print, and browse the web (which so far it does).  Windows 11 takes up most of the internal storage leaving you with 56Gbs on the eMMC. Not sure how well this will handle down the road with security updates and so on.  Also note, if you try to install anything not verified by Microsoft (which is everything) you'll be assisted into circle of frustration.  After much research, you need to go to the Microsoft App store and search for \"Switching out of S mode\", insanity...  I removed some of the bloatware installed and found some malware that Malwarebytes picked up before doing anything.  Be on guard.Otherwise it is quicker then the previous 10yr old laptop it is replacing. Only positives are it's light weight, it does work(just), and the battery appears to be holding it's charge. You get what you pay for...","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Not as fast or clear as expected.","reviewDescription":"I bought this to replace my old Lenovo laptop, which was slowing down. I like that this one is smaller and lightweight, but the speed was actually as slow as my older one. And the screen is not as clear as I expected in the newest version of an HP laptop. I actually ended up keeping my old one and still use it more often than this one. It’s a decent computer to do daily tasks on, but it’s not the fastest or clearest model.","isVerified":true,"ratingScore":3,"reviewReaction":"21 people found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"the price is the best thing of that deal...","reviewDescription":"you get what you pay for . it's good for basic and simple day to day use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Battery does not last","reviewDescription":"Computer is good but you have to keep it changing, battery is not good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Charger doesn’t work","reviewDescription":"Giving this a 1 star because the charger doesn’t work. I don’t know if it’s the cord or the internal system of the laptop.Updating to 3-star as the charger finally started working. I had to change the angle which is frustrating to buy a brand new laptop and it can’t charge properly except at an angle.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Cheapo for emergencies","reviewDescription":"The construction is really flimsy.  It bounces when you type.  Feels like it will fall apart at any moment.  Wifi finds all kinds of signals around me but connect to mine?  Nope.  Keeps dropping.  I'd say this is for emergencies only, your spare when your regular laptop is in the shop.  And you might want to plug it in instead of use the wifi.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"you need better customer service","reviewDescription":"The product is great, the customer service is terrible","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1698796800000}
