{"reviewTitle":"Errors Without Formatting First","reviewDescription":"First of all, I purchased the 256gb model, and it only has 232gb of capacity.  With the first one I received, I tried transferring some files to it, and it kept giving me an error like the drive was disconnecting and reconnecting.  So Amazon sent me another one and the same thing happened.  HD-Tune showed 98% damaged sectors.  I figured I would just try formatting the drives before I send them back, so I did.  After formatting the drives, both work as they're supposed to.  Also, this drive gets extremely hot.  It makes me wonder if the heat is somehow responsible for the damaged sectors.  Both times I formatted I let them cool off to room temp first.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Try these as soon as you get them","reviewDescription":"Had these for 4 days past the 30 day return window.  Went to copy 28 gigs of photos to share with relatives only to have 1 of the 3 thumb drives get really hot and disconnect from the pc after 4 minutes of copying files.  It does it each time it is I've tried to copy files.  I've tried copying smaller batches of files and the same thing happens: it overheats and disconnects.  I guess it will eventually take the files if you allow the thumb drive to cool off between transfer sessions, which I would recommend be no more than 4 minutes of copying at a time with a 5 minute cool down before your next attempt.So........... Highly recommend you copy 10 gigs of test files to these when you first get them to see if you received a dud as well.Overall, I have always been very happy with SanDisk equipment.  This is the first BAD experience I've had with them.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"This product is a bit fragile","reviewDescription":"If you use it a lot and or put it in your car with music like I do it starts to bend when it's inside of the slot and unfortunately for the price it's not worth it then. Have been through several of these and will not buy this brand anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Flash Drive Already Open and Used","reviewDescription":"I paid for a new flash drive; the one sent was opened, taped back together, and used. The only reason I'm giving 2 stars instead of one is because so far, it's working. Really unprofessional, lazy, and low quality control. Pretty disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Does not work for what i need it to do","reviewDescription":"These flash drives do not work for what i need it to do - it uploads the music from my PC (plenty of storage space) but it does not play the music on my truck sound system - but it will play it on all my PC's in my home but not when I plug it into the USB port on my sound system in the truck. I put the same music the same way on a flash drive I had (not as much storage space) and that works in the truck but these flash drives shows up on my truck sound system as no device detected. Since the new vehicles of today don't have CD players in them they put USB ports for playing music.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Out of 2 Drives, one failed immediately with write-protected error.","reviewDescription":"Ordered the 2-pack Sandisk Ultra USB3.0 64gb drives.  After copying about 10 files onto the first drive, started getting the error \"The disk is write-protected\".  This has made the drive unusable, cannot add or delete files (I can read the files though).  I am hesitant to return the drive as my data is on it, and I am unable to remove it now (can't delete, format or re-partition).After some googling, I see this is a common problem (at least with SanDisk USB drives), once this message occurs, basically the USB drive is toast...So far the second drive seems to be ok...Update: Contacted SanDisk, they sent a replacement after I provided some basic information on the FlashDrive that failed.  Back in business...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"I learned the hard way not to keep data on these things for a long time !!!","reviewDescription":"Whats never advertised is the fact your data is less secure as they go up in capacity .I left some video on one of these for a couple years .I can no longer copy any of the files from the drive . I can view the video but constant errors anytime I try and move a file .I don't trust these things and practice is showing me that I should not !HDD's and optical may be outdated but I would like to see what happens to a PC with one of these \"wonder drive\" SSD's in it ? ALL MY ARCHIVE DATA IS STORED OPTICALLY .I still have music CD's that I bought in 1987 .......they still play perfectly .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Slow","reviewDescription":"Very slow for what I need it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"bad","reviewDescription":"I just use it once for install linux system and then it is broken.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Less Storage Than paid For","reviewDescription":"I purchased 1 2 pack of the 128 GB 06.25.2024.Both display 114 gb as others have statedI just would like the truth and honesty in the advertising of what  I am paying for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Only has 114 GB of space available","reviewDescription":"Good product but even after deleting all data it only has 114 GB of actual space.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714176000000}
{"reviewTitle":"No LED","reviewDescription":"Unlike previous SanDisk drives this one does not have an LED indicating read\/write status. Save a penny, degrade your product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Useless out of the package","reviewDescription":"Doesn't work unless you download a complicated program.  I wish I would have known that p","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Horrible design. Cheap piece of junk.","reviewDescription":"You’ll get the full 256GB, but the design of the drive is horrible. When pushing it into a USB drive, it almost always snaps back into itself. If you’re attempting to put it into the back of a TV, as a possible scenario, forget it. It’s impossible. Also… NO LED to ensure the drive is actually inserted!!! Just… very poorly and cheaply designed. Frankly, SanDisk is no longer the go to for external storage.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"False advertising","reviewDescription":"It advertised 128 GB, it only has 114 GB.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"I would avoid","reviewDescription":"2 of the 3 thumb drives in this pack died in the first week. Save your money and look elsewhere","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Too wide to fit next to any other used USB ports where there are side-by-side ports.","reviewDescription":"The case is too wide to fit next to any other used USB ports where there are side-by-side ports.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Paid for 128gb but only has 114gb available","reviewDescription":"Definitely incorrect with storage amount.  Does what I need it to do though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not so nice.","reviewDescription":"The part that you slide to actually reveal the metal USB port part of it is extremely loose, so the port just slides in and out as it once, which is a hazard to the metal port. I started having problems with computers not being able to communicate with it within two months of purchase, probably because whenever I pull it out of my pocket, the USB port is exposed. Not sure if perhaps I just got a faulty one. Also, even though it has a little hole to attach it to a key chain, this is the third or fourth time I just found it lying by itself in my car or elsewhere. Somehow just keeps falling off the key chain.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1668902400000}
{"reviewTitle":"Shipped postage due","reviewDescription":"The flash drive is ok.  The package was shipped $3.78 postage due, forcing us to go to the post office to settle up.  Not convenient.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Impressive Performance and Great Value: Sandisk 64GB USB Sticks","reviewDescription":"I recently purchased a two-pack of 64GB Sandisk USB memory sticks from Amazon, and I couldn't be happier with my purchase. Both drives were exactly as described and arrived promptly in secure packaging. The build quality is solid, and they have a sleek design that fits well with my other devices.In terms of performance, these Sandisk USB sticks exceeded my expectations. The transfer speeds are impressive, allowing me to move large files quickly and efficiently. I've used them for both work and personal storage, and they've handled everything flawlessly.Additionally, the 64GB capacity is ample for my needs, providing plenty of space for documents, photos, and videos. I've had no issues with compatibility, as they work seamlessly with both my laptop and desktop.Overall, I'm very satisfied with these Sandisk USB memory sticks. They offer great value for the price and have proven to be reliable and efficient. I highly recommend them to anyone in need of dependable and high-performance storage solutions.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Lightning-Fast Performance and Unmatched Reliability: The Perfect Flash Drive from Amazon!","reviewDescription":"I recently purchased a flash drive from Amazon, and I must say, it has exceeded my expectations on all fronts. The [Brand Name] Flash Drive has quickly become an indispensable tool in my daily life, providing lightning-fast performance and unmatched reliability for all my data storage needs.Let's start with the speed and performance of this flash drive. Equipped with the latest USB 3.0 technology, it delivers blazing-fast transfer speeds that have significantly reduced my data transfer times. Whether I'm transferring large files, high-definition videos, or a vast collection of photos, this flash drive handles it all with remarkable efficiency. It effortlessly moves data at a speed that I had previously only dreamed of, saving me precious time and allowing me to focus on other tasks.The build quality of the [Brand Name] Flash Drive is exceptional. The sturdy and compact design ensures that it can withstand the rigors of daily use without any signs of wear or damage. The durable construction gives me confidence that my data is safe and protected, even when carried in my pocket or tossed in my bag alongside other essentials.One of the standout features of this flash drive is its impressive storage capacity. With [XX] gigabytes of storage space, I have ample room to store and carry a vast amount of data wherever I go. Whether it's important work documents, multimedia files, or backups of critical files, this flash drive has more than enough space to accommodate my needs. I no longer have to worry about running out of storage or juggling multiple drives.The plug-and-play functionality of this flash drive is another aspect that I appreciate. It seamlessly connects to my computer or other devices without the need for any additional software or drivers. It's incredibly convenient, allowing me to quickly access or transfer files on any compatible device. The drive is universally compatible, working flawlessly with both Windows and Mac operating systems.I have to mention the reliability of the [Brand Name] Flash Drive. It has never failed me, even after extensive use and numerous data transfers. My files remain intact and accessible every time I plug it in, giving me peace of mind knowing that my important data is always safe and secure.Finally, the affordability of this flash drive is worth highlighting. Despite its impressive performance and robust build quality, it comes at a price that won't break the bank. It offers excellent value for money, making it an ideal choice for students, professionals, and anyone in need of reliable portable storage.In conclusion, the [Brand Name] Flash Drive is an outstanding product that combines lightning-fast performance, unmatched reliability, and ample storage capacity. Its seamless plug-and-play functionality, durable build quality, and affordable price make it a top-notch choice for anyone in need of a reliable and efficient flash drive. If you're in the market for a high-quality storage solution, I wholeheartedly recommend the [Brand Name] Flash Drive. It's a true gem that has exceeded my expectations in every way imaginable.","isVerified":true,"ratingScore":5,"reviewReaction":"56 people found this helpful","country":"United States","date":1688256000000}
{"reviewTitle":"Compact, fast & a great value","reviewDescription":"I’m beyond satisfied with this SanDisk 128 GB USB storage drive. It offers fast transfer speeds and ample space for all my files. It's very convenient for backing up important documents\/media, & at such a great value. Highly recommended for reliable and efficient storage.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"A good, albeit slightly wonky, flash drive","reviewDescription":"512 GB is a ton of storage, so this flash drive will get a lot of use from me. I primarily am using this to store copies of personal files and it works great for that, the copying speed is good. My only real problem with this is that the lever you push to push the USB port up and down feels rather wonky to me, it takes some resistance to do. It can also be a bit of a tight fit in some ports; it fit perfectly fine in my computer, but when I put it in my PS5 it felt like I was jamming it in there (it does still fit and work as intended though). Worth noting that this flash drive comes with some files already on it, that being instructions on how to install some sort of SanDisk software, but you can just delete those and still use it with no problems.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Reliable and Fast USB 3.0 Flash Drives","reviewDescription":"I bought the SanDisk 32GB 3-Pack Ultra USB 3.0 Flash Drives, which have been fantastic for my needs. I use them primarily for installing Windows operating systems, and they easily transfer installers, drivers, utility, and BIOS files. The 32GB capacity is just right for these tasks.They’re small enough to carry around without any hassle, and the USB 3.0 speed makes the process much faster. I've used them on multiple PCs and never had any compatibility issues. These drives are reliable and have become an essential part of my toolkit.If you're looking for dependable and speedy flash drives for system installs and important file transfers, these SanDisk drives are perfect. I highly recommend them!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Quality flash drive at a decent price","reviewDescription":"I use thumb drives for my car's music playlists. I don't use anywhere near the 32GB capacity ... usually limit a playlist to 5GB ... but the drives load the music quickly and they work in the environment of the car ... which can be a bit harsh ... hot and cold extremes. The containers they come in are convenient for storing when not used in the car (I only have one it the car at a time). Helps keep them organized.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"flawless Fedora40\/Plasma6.1 install on old Dell 7710","reviewDescription":"Making the move to Linux, first step dual boot with Win10 on old Dell 7710 8-core Xeon laptop (still a strong machine but getting squonky about current versions of things). Several other \"USB 3.0\" USB sticks hung up at different points of the installation process. One USB failed permanently. This Sandisk SDCZ48-128G-GAM46 worked flawlessly and was as fast as advertised, much faster than the older sticks, always nice. Highest++ recommendation.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Decent for ISOs, too slow for heavy use","reviewDescription":"These are great and priced right for long term cold storage of small amounts of data, or for ISOs.  These two USBs, combined with a multi-ISO bootable software like Ventoy, are all you need to store many operating systems, rescue disks, backup programs, and other boot media efficiently.  These are excellent for the price.These are absolutely the wrong product for system backup\/restore, large data backup, and media production.  Honestly, even the best flash drives (e.g. 2TB Kingston) will heat up like a nuclear reactor under such loads.  Your best bet is portable SSD (preferrably USB 3.2 gen2x2 for 20GBps, or even USB 3.2 gen2x1 at 10GBps) which will operate very fast at a reasonable temperature and still be small enough to easily carry in your shirt pocket.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Great Product","reviewDescription":"I like the retractable USB connector.  I like the fact that this is USB3.0 so it is fast.  I am video professional and I need to be able to transfer video files fast.  This has 512gig so it has enough space for a lot of files. You can not beat the quality and consistency of the SanDisk products.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Did not run hot","reviewDescription":"Excessive heat was a big concern when purchasing these flash drives.  However, after copying almost 120 Gig of non-stop data to one flash drive, I can report that the drive did not get very hot.  If compared to water temperature, I would judge the flask drive temp to be in the luke-warm area.However, write speed was running at only 15-20 MB\/s, so the date transfer rate was not as fast as I had anticipated but that could have been a function of my laptop computer.  Nevertheless, I consider excessive heat to be a bigger potential problem\/concern than date transfer speed, so I'm very happy with these flash drives.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Listen to the reviews","reviewDescription":"The drives I was sent have the problems written in other reviews. Gets hot quickly after writing to the drive, and they get nowhere near their max speed of 130mb\/s. Another review had the same experience as me, around 15mb\/s while writing according to windows. Get higher quality drives if you plan on using these often.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Limited File Size","reviewDescription":"The drive works well but they say you can backup large files.  However, I couldn't copy any file larger than 4 gig to the drive.  That rendered it useless for what I needed.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"Actually 113gb instead of 128gb","reviewDescription":"Ordered the 128gb thumb drive but was sent 113gb instead. Be aware that you may not get exactly what ordered but works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"They're OK","reviewDescription":"Not the highest quality it's a hit miss and you're putting it in the computer. Sometimes works sometimes doesn't","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Bad Design","reviewDescription":"Small recessed button makes it difficult to slide USB out of its shell.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Not as much storage space as advertised","reviewDescription":"I ordered the 512 GB but it only came with 490","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Works fine but gets HOT.","reviewDescription":"I've never used a flash drive that gets HOT so quickly. It doesn't get to the point where it's TOO HOT touch, but I know this isn't normal. I haven't even used it for too long or transferred too many files either.Other than that, it works just fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Gets HOT in USB 3 or higher port.","reviewDescription":"Well lets start with the good. Yes it's fast, much faster then USB 2.0. Bad, gets HOT!!! Now when I say hot what does that mean. If I transfer any data beyond 5 minutes, and remove it. Put it on my hand, it would burn into my flesh! I thought it was my USB card, took it out several times, kept changing things, played with windows power settings, and no change. Now on a USB 2.0 port it's cold. Very disappointed. Not really sure how long this is going to hold up. The first time I noticed is when speed transfer was around 1.5k... pulled it out, and wow. The whole thing was hot. AND I have other usb sticks and also drives. They  don't even get warm. Do not recommend.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Password software is not included and the download process does not work","reviewDescription":"The Drive is supposed to have pasword protection but the password softwre is not included in the flash drive so that you have to download it.  When I click on \"install sandisk software.exe,\" it takes me to a Western Digital page from which I installed the security software, which I then click.  A window opens that says \"attach a supported WD drive.\"  It does not work and nowhere does it recognize the SanDisk external drive.I finally Googled how to install password software to SanDisk Ulta 3.0 and followed the following instructions:Connect the SanDisk USB flash from to the computer.Download SecureAccess. ...Copy SanDiskSecureAccessV3_win.exe to the USB flash drive. ...Double-click on SanDiskSecureAccessV3_win.exe.Click Next.Check the box to accept the License Agreement and Privacy Statement.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Does NOT get 30mb\/s write speeds.","reviewDescription":"Used these for ISO files and wow did it take a long time to write even in quick format. Did a quick file transfer with one and capped at 15mb\/s","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Works but not reliable long-term","reviewDescription":"Bought two drives and the first died in less than 6 months the second is still working but these are also have a wide bezel around the drive so dont expect to fit this beside another usb plug\/drive.Ill buy something more reliable and with less plastic housing next time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Not 128GB. Only 114GB capacity.","reviewDescription":"I needed the extra space and it was not available. I formatted it twice and nothing changed. Why advertise for 128 if it's only 114? Pshhh....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Agonizingly slow write speed. Temp problems.","reviewDescription":"Writing maxed out at 5 to 10 MB\/s. That's terrible for USB 3.0. The drives also run hot, which worries me since I used them to archive photos.No, it's not my system configuration. Other USB flash drives work well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"drastically slow down","reviewDescription":"Slow down a lot when you copied and pasted large file","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"had bad spots","reviewDescription":"I wanted to backup my hard-drive on this flash drive.  I had issues of copying files to the flash due to bad spots  on the flash.  I find that typical of high capacity drives.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"DANGER! Will Robinson DANGER! Does Not Compute!","reviewDescription":"This version of the SanDiskUltraUSB 3.0 Flash Drive 64 GB is not supported by the latest SanDisk\/WD SecureAccess\/PrivateAccess software which means you cannot password protect this version of their USB flash drive made in Malaysia. According to the SD\/WD website the only versions supported by SecureAccess\/PrivateAccess are: \"SanDisk Extreme Portable V2, SanDisk Extreme Pro V2, SanDisk Professional G-Drive SSD.  SanDisk iXpand and USB Flash drives are not supported.\"","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Not so easy...","reviewDescription":"One of those SanDisk was giving me troubles with formate process!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717545600000}
{"reviewTitle":"Only comes with 114GB of free space","reviewDescription":"I reformatted this completely using a tool that will delete all files, even hidden and automatically included ones, and still managed to hit the capacity limit at 114GBI know that the advertised capacity and the real ones don't usually match but, but losing that much storage seems abnormally high! Not impressed tbh.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"One is defectice","reviewDescription":"The first drive I used works just fine. The second doesn’t work at all, I tried it in three different computers, two pcs and one macbook. All of which didn’t work, the drive didn’t even show up in device manager. Tested in all usb ports","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Drives Labeled 64 GB - ACTUAL SIZE is 32 GB","reviewDescription":"Everything looks good, including the label 64 GB,  except the actual drive size which is 32 GB.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Right size Flash Drive","reviewDescription":"I needed a flash drive that was just the right size.  Most drives are much larger than what I needed at that time.  These worked fine.  Thanks.p.s.-The large drives are needed some times too!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"best brand","reviewDescription":"sandisc is the best brand USB memory sticks out there. work perfect as advertised.  highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Great product, great price!","reviewDescription":"I’m very pleased with this product.  I was able to quickly and easily move a large number of wedding photos from my computer to this flash drive.  It couldn’t have been easier.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Works","reviewDescription":"It work so. Pretty good. Only got it for something simple and for that it worked as intended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Great","reviewDescription":"Excellent capacity.  Stored large photos on this.  No problems.  Great price.  Good transfer rate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"very good","reviewDescription":"It worked well as I expected and the price was good for the amount of storage","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Excellent product, other sellers fake space on a fake flash drive","reviewDescription":"At least I know Amazon sells real products, on offerup.com or macari.com you don't know what you're getting and if you can test it you'll find out it's not 1 TB Etc it might be just 20 MB it's too late you bought it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Great price","reviewDescription":"Work great and outstanding value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Price worthy","reviewDescription":"Fast and easy to use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"USB FLASH DRIVES","reviewDescription":"Work, as they should.  Good price, tho, and great to have extras at decent cost.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"said it was 64GB but isn't","reviewDescription":"like i said it was not 64GB like i ordered it was 31.9GB i only needed 8GB but i hate being lied to >:(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Storage less than advertised, gets very warm over a short period of time","reviewDescription":"I purchased the 32GB, windows states it as 28GB max. I understand they can't make a 32GB drive and have all the space available for the user, but for the size I don't know why they can't add another 4 and give you what you're actually buying. All drives have sandisk .exe and documentation trash on them, seems like we should be beyond that at this point. Drives become quite warm, to where it's concerning, even while not doing anything. Slide button for the drive connection is too far back on the drive to comfortably open and close it with one hand, there isn't any texture on the raised portion so you have to get behind it to move it.It's fine, but disappointing that we're still doing things like this.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"256GB , really 232GB even with the small print it should be 250GB","reviewDescription":"Wanted this for a bootable OS that needed 250GB, this is 232GB...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"One in 3 was defective.","reviewDescription":"I have a few of these already on hand. I've had good luck with Kingston drives before, so I consider this an anomaly. Since it was considered a 3 pack (...but each had its own package...), I had to return all of them. That was kind of silly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"One is faulty out of two","reviewDescription":"Needed 2 for 2 different updatesOne would work sporadicallyOther one is goodEnded up digging through my drawers and found one to operate for the one update to replace the faulty oneWould I purchase againNo","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Flimsy housing","reviewDescription":"Works fine but the dive has the flimsiest housing I've ever seen. Feels like it will break very easily.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"works good but would be nice if it had a led to tell when working","reviewDescription":"no let to tell if it is loading or downloading","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Maybe fast writes on a 16GB drive, if you get lucky","reviewDescription":"For a cheap drive, this is probably one of the best you can find. Although it does not have blazing speed, you don't expect that at this price point. But you do get a solid drive, with positive locking retractable plug.The write speeds don't make you feel like you are waiting forever to put your data on the disk, and reading back is also very fast.An even better deal is the 3-pack of the 32GB size...it gives you 6 times the total storage for about 3 times the cost.EDIT: The 3-pack of the 32GB drive is cheap, and you get what you pay for. Read speeds at high queue depth are still good, but read at lower queue depth and write speeds are about 50-60% of the 16GB version.EDIT: And, the next 16GB drive I bought had the same terrible write speed as the 32GB drives, and the read speed has dropped a bit from the first 16GB drive. These write speeds are below USB 2.0 speed, so tell me why SanDisk claims this is a \"USB 3.0\" drive? I should have paid more attention to their claim of \"5x faster than a standard USB 2.0 drive (4MB\/sec)\". USB 2.0 can easily handle 30MB\/sec.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1650067200000}
{"reviewTitle":"Not as much storage as advertised","reviewDescription":"Now I know there are software things that are included with our USB flash drive, but to only have 111 Gigs out of the 128 (even after deleting unneeded info pre-installed) is a big difference in my eyes.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Less Space than Advertized","reviewDescription":"I got the 256gb, so it came with ~24gb less than advertised, which feels like a lot. That said, it works well, and is still a good price for what it is.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"transfer speed are slow.","reviewDescription":"not as advertised. don't expect 130 MBs transfer speeds. not even close. the most you can get is 40 MBs.beware. some are getting 12 Mbs. it doe not matter if you have it formatted at exFat. or NTFS. even if you disable indexing you won't see any improvement.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625443200000}
{"reviewTitle":"Slow","reviewDescription":"The connection seems really slow. Returning it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Disappointed","reviewDescription":"Disappointed as couldn’t use in my car which was the purpose of buying it. !","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1583539200000}
{"reviewTitle":"perhaps a new one","reviewDescription":"This item arrived with its package opened, which is a surprise!The flash drive itself looks new, and works.Good reading speed: 100+ MBSlow writing speed: 15~18 MB only","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Singapore","date":1662508800000}
{"reviewTitle":"Guter Stick für den Preis - hält aber nur ca. 6 Monate durch","reviewDescription":"bulk write: 15 MB\/secbulk read: ~150 MB\/sec(gemessen mit \"dd\" unter Linux, an einem USB 3.0 port, 1024 KiB Blockgröße, direct mode)Update (nach 6 Monaten): Komplett elektronisch tot. Wird nicht mehr erkannt, alle Daten (logischerweise) weg.Update (nach 6 Monaten und 2 Wochen): nun ist auch der zweite Stick tot.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1602892800000}
{"reviewTitle":"Von wegen 128 GB ... 114 GB!","reviewDescription":"... was soll man da noch sagen, wenn ein USB-Stick mit 128 GB dann vollkommen leer nur 114 GB zur Verfügung hat? Zumindest ist der Stick wie alle meine anderen von SunDisk sehr schnell...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1616716800000}
{"reviewTitle":"USB memory","reviewDescription":"Have had hard time trying to send the wrong item back. Went to Shell Garage mentioned as reference but their system not working for last 3 months!! Went to anther place Express food centre they said we need a new QR.Can you tell us what we suppose to do?Thanks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1723075200000}
{"reviewTitle":"Worst design ever.","reviewDescription":"It does what it's supposed to do I guess, which is store some data. But the form factor is pretty bad.These thumb drives are very light and about as slippery as a wet, round bar of soap. You will inevitably drop them to the ground once or twice before you even reach you computer.  Good luck trying to plug them in without aggravation.  It's like trying to insert a wet suppository, alone, into a less than cooperative canine.  I can't believe these have moved along all the design and development stages to the point of reaching actual consumers. Its quite obvious that the designer of these was the big boss' son or nephew during a summer job and nobody said a thing for fear of retaliation. I'm sure Sandisk has other less aggravating thumbdrives to offer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1720828800000}
{"reviewTitle":"You do not get 512GB!","reviewDescription":"So I bought this pen drive as a backup for my family photos, the drive arrived and I plugged it in straight away and the file size is only 460GB and NOT the 512GB. So 112GB is gone?I am currently moving 120GB across to the drive as a backup, in a hope it works but yes. I was shocked to see such a huge drop in the size, so for that I have given it 2 stars. I bought another pen drive recently and I got the size I paid for! I even bought an M.2 NVME and I got close to what I ordered so yeah, not amused and tempted to raise a complaint because this is insane!Also the photos with the drive transfer speed is correct. It is not transferring at USB speeds. It is below 40Mbps transfer on a USB 3 system with high specs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1710979200000}
{"reviewTitle":"Rasenmäher sind schneller","reviewDescription":"Die Schreibgeschwindigkeit ist ein Witz. Ja, die ersten Megabyte kommen auf bis zu 70 MB\/s aber nach wenigen Sekunden geht der Stick in die Knie. Bei vielen oder größeren Dateien, z.B. einem Film, werden gemittelt ca. 25 MB\/s erreicht, manchmal nicht einmal 15 MB\/s. Der Stick wird schnell heiß, vermutlich hat das Einfluss darauf. Mein alter USB2.0 Stick schreibt 2x bis 3x schneller.Der Stick ist OK aber 130 MB\/s wurden womöglich unter dem Einfluss von euphorisierenden Substanzen gemessen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1719532800000}
{"reviewTitle":"Worst USB Hub Ever","reviewDescription":"Purchased and received from Amazon the package of two SanDisk Ultra USB 3.0 128GB flash drives. Simply could not copy the contents of an old flash drive --- one still working fine --- onto one of the new ones. Almost solely MS Office files, PDF files, and the like; nothing fancy.  Tried the other drive; no luck.  Tried to read the endless verbiage on the package; the font is so small that it is impossible to read even with a magnifying glass. Would it have killed Western Digital (the producer) to have included an instruction sheet actually readable?  Do the drives have to be formatted?  No way to know.  Is there software that has to be downloaded?  No way to know.  Tried to find a customer service phone number on the web; there isn't one.  Instead, there is a chat function (which I rather dislike) at the end of which the assistant sent a form to fill out to get a phone call from a technician.  Supposedly $1, \"fully refundable.\"  Filled out the form, submitted it, and then Western Digital tried to charge my credit card $63.  (The two drives in total cost about $24.)  Is this supposed to be Western Digital's idea of how their customers should be treated?  I will never buy a SanDisk\/Western Digital product again.  In contrast, Amazon's customer service rep for returns was great.  BZ","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"don;t buy can't get replacement lids from company buy instead stanley flip straw tumbler","reviewDescription":"I purchased a  Sandisk USB 3.0 256gb as I needed a storage drive for study labs. What a waste of money but more importantly, a waste of my time. Both of these USB's are \"write protected\" which basically makes them useless. (These do not have an outside physical switch to turn on\/off). You cannot store anything or even open the drive until it is \"formatted\" but you can't format it because it's \"write protected.\" I shouldn't have to pay Sandisk extra money to remove the write protection from a product I purchased from them, so I refused to go that route. I viewed countless online help forums for this specific issue and none of the methods listed helped at all. (cmd, Windows Registry, 3rd party apps, etc.) This is beyond ridiculous and Sandisk should be slapped with a class action lawsuit for this practice. I found several other people online with the exact same issue and nothing helping to remove the write protection. This has caused me countless hours that I could have dedicated to studying outside of working hours. no insruction wer includedeven theirwebsite reqyired fiddling wit a verifivaion code.i woul avoidbuyin from this company.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Total SCAM - Would rate -5 if that were an option","reviewDescription":"I purchased a pack of 2 Sandisk USB 3.0 64gb as I needed a storage drive for study labs.  What a waste of money but more importantly, a waste of my time.  Both of these USB's are \"write protected\" which basically makes them useless. (These do not have an outside physical switch to turn on\/off).  You cannot store anything or even open the drive until it is \"formatted\" but you can't format it because it's \"write protected.\" I shouldn't have to pay Sandisk extra money to remove the write protection from a product I purchased from them, so I refused to go that route.  I viewed countless online help forums for this specific issue and none of the methods listed helped at all.  (cmd, Windows Registry, 3rd party apps, etc.)  This is beyond ridiculous and Sandisk should be slapped with a class action lawsuit for this practice.  I found several other people online with the exact same issue and nothing helping to remove the write protection.  This has caused me countless hours that I could have dedicated to studying outside of working hours.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Slower than cheap USB 2.0 flash drive!","reviewDescription":"Unpacked and immediately tested with H2testw for data integrity and speed. H2testw writes 1Gb files to the drive until full. It took 51:55 minutes to write the drive to full capacity! Write speed was 9.42 MB\/s! Read speed was 68.2 MB\/s. Unpacked the second drive and tested with the same results. I was shocked. SanDisk scamming buyers? I decided to test USB 2.0 flash drive to compare them. I bought 16GB 5-pack last year and they currently sell for $13.99 for a pack of 5. The brand is DEEKOO, Chinese manufacturer. Same app, wrote to full capacity. The write speed was 10.1 MB\/s! I remember testing other USB 2.0 flash drives years back and I was getting upwards of 16MB\/s. SanDisk USB 3.0 flash drive slower than cheap USB 2.0 drive? SanDisk Ultra? Ultra GARBAGE for sure! Returned the next day. Never SanDisk again!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"SLOWWWWWWW","reviewDescription":"32MB. Write speed - Getting 10-20MB\/second MAX; average in the 12-13MB range.  I have 10 year old 64GB USB drives running almost 50MB\/second.  These are empty no space used and running like molasses. I wanted replacements but not having to wait 2-3 times as long for completion. I'm backing up 2GB zips.  Maybe for runs faster for trivial sizes but these are slower than my 10 year old drives.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"I used it to backup before updating macOS","reviewDescription":"... less than 2 years ago and also to move stuff to a new Mac but stopped connecting after 4-5 times of use, when today I tried to connect it to backup some docs. I bought it Sep 2022, so 2-3 backups and less than 2 yrs and it appears as its USB connector went bad as my Macbook recognized it for a sec. and then it recognized it and opened it as I held it a little bit up as I felt the contact might be loose. SAD. I use other Sandisk flash drives (32,64,128 even still a 4GB) almost everyday with music and photos and this 256 with also important backup stuff for less than 5 times and it breaks. Like are they made to connect and disconnect how many times?","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1719273600000}
{"reviewTitle":"Encryption is buggy, terrible interface, poor customer service","reviewDescription":"The encryption software for these Sandisk products doesn't work well. If you don't care about the encryption, then these flash drives might be fine. They don't come with the encryption software installed and you have to download it off their site. It is not at all clear how to download the correct software as the instructions are poor. I did get the encryption software running after calling their customer support line. The customer support people are difficult to understand, and their training is inconsistent. The interface is very clunky, and the transfer speeds with encryption are much slower than the other flash drives I use. Yes, the drives are very inexpensive, but in this case you do get what you pay for. All three of the flash drives I bought stopped working after one year. I recommend paying more and getting a better flash drive especially if you need encryption. After a frustrating experience with Sandisk, I bought the Kingston IronKey for encryption, and I am very pleased with it.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"DO NOT BUY THIS","reviewDescription":"literally all the usb drives became \"read only\" in the first week of usage.there is ton of information out there and when this happens you cannot restore the disk, you cannot reformat it, NOTHING! SanDisk offers no support or help on this, neither does Amazon.What you will end up with is drives that have your sensitive info, that you cannot return to get a refund for obvious reasons and instead you will eat the loss and say thank you!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Don't buy this brand...","reviewDescription":"Bought a 128 GB, even says that on it and it's only 32 GB.  The price difference between the 2 is only a few dollars so I can't even be bothered to send it back.  I've been in IT 40 years I know what I'm talking about.  Don't buy this brand.  I'll just get something else.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Set up was a nightmare","reviewDescription":"I needed this to be password protected for work files. When I plugged it in and clicked on the set up application it took me to a software download page that had 8 different programs that could be downloaded and it did not clearly state which one(s) I needed. After trying three of them and it not being set up correctly I gave up. I tried to do online chat with help support but they were not available and wanted me to put in an email help ticket. I've used several other password protected drives and never had this issue. I'll go back to Kingston moving forward.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"Easy to use but not 512 GB","reviewDescription":"It is easy to use but it is not 512 GB! The actual capacity is 460GB (494,134,099,968 bytes), the pre-instaled software only takes up 11.4MB (11,993,088 bytes). Where is the rest of the GB advertised? This is what I call false advertisement.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1635465600000}
{"reviewTitle":"Should be 256 GB","reviewDescription":"It came with only 232 GB","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"FALSE ADVERTISING It says it has a 512GB capacity but that is a flat out LIE","reviewDescription":"The actual capacity is 460GB (494,134,099,968 bytes), the pre-instaled software only takes up 11.4MB (11,993,088 bytes) so how can they advertise it as 512GB when it clearly is missing 52GB. Other than the missing storage space I do like these flash drives, they are easy to use and durable, but I keep my drives in a safe space and they are not exposed to drastic temperature changes or the elements.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1595116800000}
{"reviewTitle":"Knock off?","reviewDescription":"Did not last long.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672531200000}
{"reviewTitle":"Over heats at times","reviewDescription":"It does what it’s meant to do for the 32gb one works fine got here early but tends to over heat? Like badly that even my brother got burned plugged it to my computer took about 2min for it to start heating up Same thing when I plugged it to my ps4 pro it works but the over heating is just a big uhhhhhh for me","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1596240000000}
{"reviewTitle":"Lower than advertised storage capacity","reviewDescription":"It only has 23 GB of space on it. I already had one that had 20 GB and I bought this 32 GB one to organize my old files and lo and behold it doesn't have enough space. Should tell you somewhere on here what the actual storage capacity is. I know it's never exact, but where tf has the 9 gigs gone?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611014400000}
{"reviewTitle":"USB","reviewDescription":"Muy buen producto pero yo pague por 256 GB y solo llegaron el producto con solo 230 GB","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661644800000}
{"reviewTitle":"Fast!","reviewDescription":"Fast transfers but very very very cheap plastic. Might bend in your pocket.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1662595200000}
{"reviewTitle":"Missing 52GB","reviewDescription":"The drive was missing 52 GB.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669248000000}
{"reviewTitle":"Relatively pricy","reviewDescription":"You will be partly paying for the brand. I ended switching to a different choice that is doubled the storage for less $.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"OK but a bit overpriced","reviewDescription":"Too expensive for the quality you get.  They work OK but are awkward to use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Meh","reviewDescription":"One of the drives literally crapped out after I safely ejected it the first time","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"OK Value.","reviewDescription":"Bit bulky. Hard to plug in next to another USB device. Fairly fast","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Good usbs","reviewDescription":"Nice price for 3 drives intended for system recovery only.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"61.5GB, 12.6MB\/s write,","reviewDescription":"The nominal 64GB drive has a true capacity of 61524148224 bytes, or 61.52GB, or 57.31GiB, or 120164352 sectors of 512 bytes each. This is before any partition table or filesystem is created.I created a FAT32 filesystem on the drive, and sequentially wrote 60 files of 1.00GB each, containing encrypted zeros (effectively, random data). The total time was 4744.81 seconds (including the sync command), for an average rate of 12.6MB\/s. Non-sequential writes would be slower, but 12.6MB\/s should be considered the maximum possible write speed of the drive.On reading back the files, the first 52 files were error free. After that, the drive failed, and seemed to reboot its controller repeatedly. I noted that the drive was too hot to touch, even through its plastic case. I disconnected and reconnected the drive, and the rest of the files verified correctly. The overall read speed was 142MB\/s when there weren't any errors.All these tests were done with the drive sitting in open air, at 72 degrees F ambient temperature. Reading a huge amount of data off the drive should be done carefully, in shifts, to avoid overheating it. Idling and write accesses don't seem to make the drive overheat, but the metal connector always feels uncomfortably warm after unplugging it, even if you hardly do any operations.Note that I did all these tests on a USB 3.x superspeed port. If you use a USB 2.0 or USB high speed port, your speed will likely be limited to 30MB\/s.I removed 1 star for lying about the capacity (3.9% is missing from the advertised size), and another star for lying about the write speed (it claims to be 10 times faster than a 4MB\/s USB drive, which is 40MB\/s, but it actually can't write faster than 12.6MB\/s). I still gave 3 stars, because it is faster than other USB flash drives I've tested of similar capacity.","isVerified":true,"ratingScore":3,"reviewReaction":"27 people found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"3 out of 3 Sandisk Ultra 32GB thumb drives needed to be formated with DiskPart command line utility","reviewDescription":"All 3 of the thumb drives needed to be formatted with command line utility right out of the packaging.Plugged in my new thumb drive ready to use it, received read only errors (all 3 of the 3 pack), Windows formatting would not work, had to go to hardcore on them with DiskPart. Is it a big deal, no, is it a huge waste of time, YES! It takes 30 minutes+ for each of the 3 drives to format 32GB with command line utility.Going by what I read on the Sandisk forum, they are aware of the problem but will not fix it. Third hand information but if it's true that is troubling considering Sandisk is supposed to be a good brand.I looked at the huge selection of thumb drives on Amazon and was tempted to get a brand I've never heard of but opted to go with a 'name brand' because I was worried about getting an unreliable drive. Time will tell if Sandisk is still reliable but considering they started with a problem, I'm not holding my breath.Originally gave 2 stars, bumped up to 3. They do work well once formatted.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"They work at least","reviewDescription":"But they are 114 gb not 128gb","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Good for basic use, but QLC flash like performance will be an issue for large files.","reviewDescription":"I purchased the 3 pack of the 32GB drives knowing that it would be slow to write, but the marketing will mislead many users. The write speeds are slower than many low cost USB 2.0 flash drives from 7-10 years ago, and that is likely due to the use of QLC NAND which has a major write speed penalty. Read speeds being high is common since additional flash levels only really carry an ECC burden, where if the controller is fast enough, then the speed penalty is minimal.Since the drive seems to also have a tiny amount of faster storage (likely to also handle other controller management data), it will also create misleading results from smaller benchmarks that may only use a fast region of NAND. With this in mind, I did a linear read and linear write from 0 to 100 %.Read performance: Reads are quite good with an average of 159.7MB\/s that is largely sustained throughout the entire length of the drive.Write performance: Writes are significantly slower, with a 0-100% average of 17.9MB, but that average is influenced by the initial higher speeds in the 30-36MB\/s range. Without that initial faster section, the speeds very frequently bounce around 15-17MB\/s. Furthermore, this represents a best case scenario as it is a 100% linear write done as raw writes, ignoring any partitioning or file system. Anything that increases the IO workload, will result in lower write performance.Overall, if you need a flash drive for basic use (documents, images, audio, etc., then this Is a great budget option, but if you need something for larger transfers, such as multiple GB videos, linux live USBs, and other mixed uses that can result in wither large transfers, then don’t go with anything lower than the Sandisk Extreme flash drives, as pretty much all of their lower end units have gotten slower over the years in terms of write speeds, while read speeds have steadily increased.","isVerified":true,"ratingScore":3,"reviewReaction":"24 people found this helpful","country":"United States","date":1635724800000}
{"reviewTitle":"Works","reviewDescription":"Works as intended, but it is on the older side so my comp was having difficulties reading it. Could be software? Not sure but once I got it going no issues. Build quality isn't the greatest, fits kinda loose and the slide is also too loose inwhich it wants to retract the USB port when it's connected. Not the best but not terrible.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Does it's job with minor issues","reviewDescription":"Works like you would expect a USB thumb drive to work. Sliding the USB plug in\/out can stick at times, but may just leave out to avoid that. The others I have, even Sandisk brand, have lights to show activity, but these do not which is unfortunate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Not 16 Gb","reviewDescription":"I bought this item to have a Mac OS Installer on OpenCore Legacy Patcher. It requires a 16Gb drive. I had an old one that was 15.66Gb and was working perfectly fine, so I ordered this one for another computer. However, this one is too small (15.29 GB after format in APFS), and Opencore does not allow the creation of the installer due to its size.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Crashes my file explorer whenever I try to access the drive","reviewDescription":"Terrible product. Waste of money. Plugged into USB 3.0 port and I can't access the drive. I can see the drive in the directory but if I click on it or right click on it, I get a loading bar in windows file explorer where it gets to about 95% and then just endlessly hangs until it crashes my entire file explorer and I can't even restart the file explorer through task manager, I have to restart my entire computer because this crappy product is causing major issues just trying to open what should be an empty flash drive. Also, the drive is suspiciously very hot every time I unplug it from just trying to get the thing to work. Now I have to go through the trouble of driving across the city to the nearest Staples to drop this piece of junk off just to get my money back. Huge inconvenience for what should've been a simple and easy to use product. Never buying from SanDisk again.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"worst piece of worthless crap I ever bought.","reviewDescription":"I am soooo pissed! I've always used sandisk and never had a problem. I bought 3 of them for something I needed fast. what a joke. it's been over a month and all I get from them is an immediate \"update\" box that sends you to the same website...no way around it...wtf happened to plug and play? It never updated, just froze midway and couldn't get the damn thing to download and install. I don't give a damn about their \"cloud\" requirement, no way around that either. waste of time, money and sanity. totally regret this buy, and shame on what used to be a trusted brand. don't recommend and won't buy anything from sandisk again","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"I wasn't able to use the SanDisk 128GB Ultra USB 3.0 Flash Drive to install Ubuntu on my ASUS laptop","reviewDescription":"I don't know what the problem was with the SanDisk 128GB Ultra USB 3.0 Flash Drive but I wasn't able to use it to load Ubuntu on my ASUS laptop. The instructions and website info were not useful. Fortunately I was able to use an older 8GB USB flash drive to get Ubuntu installed. So I am very disappointed with it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Broke after 6 months, low quality","reviewDescription":"I got the 256 GB flash drive to save some videos on, I uploaded some content when I first got it with no problem. Then I went to upload content 6 months later, and in the middle of a file transfer it crashed. And now any time i plug it into my computer, it is unrecognizable and requires a disk format, which wipes the content. These flash drives are very unreliable, i am disappointed. Also, this not a problem with my USB port, as my other flash drives work fine.Buy a Samsung flash drive instead, I've noticed those are more reliable.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Interesting!  32GB Flash, but won't hold 16GB file?","reviewDescription":"Interesting!  32GB Flash, but won't hold 16GB file?  Only item I wanted to add to this flash.  So, I ordered a 128GB drive now.....","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Package broken and the flash drive has already been used","reviewDescription":"Received two but one package is open and the flash drive looks like already been used . Potential virus hazard","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Write-Protected - Gamble If You Dare","reviewDescription":"Upon receiving the SanDisk 32GB 3-Pack Ultra, I was eager to put these thumb drives to use. However, my initial excitement quickly turned into disappointment. One of the drives was dead on arrival. When I tried to use it, \"No Media\" was displayed in both DISKPART and Disk Management, indicating that the drive was dead.The remaining two drives were functional in terms of being recognized and displayed the correct size, but they presented another issue. They were write-protected, which means I was unable to write any data onto them or format them. This severely limited their usability and left me frustrated.Given these experiences, I find it hard to recommend the SanDisk 32GB 3-Pack Ultra. It seems that purchasing this product comes with a certain level of risk, as the quality and functionality of the drives are inconsistent. Therefore, I advise potential buyers to proceed with caution. If you choose to purchase this product, please be aware that you are doing so at your own risk.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Slower than spec","reviewDescription":"The USB lie about their read write speed. Thought Sandisk was a reputable and the extra cash was worth it. Turns out it is as slow as the cheaper usbs. The extra cost is just a complete waste. (Side note I also find the construction to feel kinda of cheap)","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Not so great","reviewDescription":"The description doesn't tell you that there is no LED indicator or what the write speed is. The write speed is very slow. Buy something better. I want an LED indicator. L.A.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Unable to format the drive","reviewDescription":"I need to format this usb drive in order to use it for memory for my Tesla dashcam, but I’m unable to format the flash drive on my car and computer. So, the flash drive is useless to me. Also I got rid of the original packaging so I’m unable to return it for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"USB Drive was Dead On Arrival","reviewDescription":"I've purchased and used dozens of USB drives. This USB was dead on arrival and when going to format it read as 64MB. There must be a bad batch at SanDisk's because I'm not the only Amazon reviewer who experienced the exact same problem and now the burden is on me to return and exchange it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Immediately stopped working","reviewDescription":"This drive had so much promise. Immediately after I started moving files to it, the drive locked up and became write protected. No amount of googling or terrible support websites could help, no I have wasted my money and I can't return the drive because I can't remove my data from it. Terrible product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Blatant lie! 460gb only! Not as advertised!","reviewDescription":"They apparently think it's okay to say it's way more storage than it actually is and I have no idea why. There's nothing that takes 52gb of space anywhere on this drive, but they somehow think it's okay to lie. It is a straight 460gb only! Not a kb more.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Dead on arrival","reviewDescription":"Plugged it in, opened the intro PDF, didn't load. Plugged it into a different USB slot and now it's unreadable, unformattable, and reads as 64mb. Did a bit of troubleshooting (nothing worked). Ridiculous. Not the first issue I've had with SanDisk either. Save your time and money. Terrible product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724457600000}
{"reviewTitle":"Write-protect problem","reviewDescription":"I got two of these to copy over some audio files and some home video files.  I set up to move the home video files from my desktop computer to a folder I made on this USB drive.  It copied over 3 video files OK and then stopped\/screwed up the 4th one (I had MANY more to copy over).  When I tried playing this video number 4 from the USB drive it would not play (evidently the file had become corrupted as it was \"copied\" over).  This USB drive had decided part way through these transfers that it would shift to a write-protect mode.  There is no mechanical switch on the device to do or undo this, it is evidently done in software.  SO, I tried looking on line on how to fix this.  Tried a CMD approach I found - that did not work.  Tried the Sandisk website and tried to download software to \"control\" (??) this thumb drive but that said it would only run on a Sandisk device and the only one I had was write-protected.  Very frustrating.  I can't even re-format it because, of course, it is write-protected.  I used to think Sandisk produced good products....no more.  I will never buy Sandisk again.","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1689465600000}
{"reviewTitle":"Do not get SanDisk","reviewDescription":"I had bought 4 of these 256 gigabyte ones and within 20 seconds, it overheats and cannot receive huge data files (1+ gigabyte). You are better off getting Samsung. Granted that the 128 gigabyte SanDisk ones don't have this problem (In my experience) but I suggest that you folks get Samsung instead.I am not alone in this; Google \"SanDisk USB Drives overheating\", \"SanDisk USB Drives overheating and can't transfer huge files\", or something like that and read the forums about it.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Me and OTHER people in August 2024 got 100% dead Sandisk 512GB ultra","reviewDescription":"I normally love sandisk, but Me and OTHER people in August 2024 got 100% dead Sandisk 512GB ultrasread the 1 star august 2024 reviews.I am reordering, and hoping mine was a fluke from one batch.one star","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1724198400000}
{"reviewTitle":"Junk with appalling customer service","reviewDescription":"I bought these to use one as an external boot drive for Mac os 14.5. After erasing and formatting APFS with Guid partition installation of the os failed and the USB drive shut down and when removed was boiling hot to the touch. Now it is completely unusable and inaccessible with Mac's Disk Utility. When I asked to return it I was referred to WD product support. This is an extraordinarily unfriendly web site which tries to sell you products rather than helping to fix them. I had good luck with SanDisk before they were apparently taken over by the behemoth WD. I will not be buying products from them in the futiure.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"Avoid New Generation SD Ultra","reviewDescription":"I have around a dozen Old Generation SD Ultra 3.0 Flash Drives and have never had a problem, unlike some reviewers. But I started buying the New Generation 32GB and even 2 64GB drives, and they all suffer from the same \"bugging out\" problem. Meaning that when I initially plug them in, the antivirus chimes and asks if I want to scan the drive. After that the Old Gen can sit in the port for hours without issues. However these New Gen will bug out within 1-15 min, repeatedly, meaning there's the chime that's made when the drive is removed, and immediately the antivirus asks again if I want to scan. Any file transfer is stopped, any video being watched crashes, etc. So there must be some bad connection in these New Gen. It would be easy to blame a bad lot if they were all the same size or came from the same seller, but when the problem affects both multiple 32GB and 2 64GB drives bought from different sellers, I can only blame some change in the product by SanDisk. The only physical difference between Old and New is that the blue plastic slab seen at the bottom, the connection point, is much thicker in the Old Gen, with that in the New Gen barely perceptible. No clue if that's part of the problem, simply pointing out the only physical difference I can see. And it's not my USB ports since other makers, like Samsung and PNY, work just fine on the computer, for hours and hours. So I won't be bothering with SD Ultra 3.0 New Gen anymore. Buyers beware.","isVerified":true,"ratingScore":1,"reviewReaction":"29 people found this helpful","country":"United States","date":1646092800000}
{"reviewTitle":"These flash drives are quick","reviewDescription":"I don't do anything that complicated. The drives work for my purposes. They are considerably faster than the old drives I had been using.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great product!","reviewDescription":"Great product for the price. Sandisk is the only brand I like specifically for usb drives. I'm glad they're sold in multiples.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"A WAY TO DELIVER VIDEO TO CUSTOMERS","reviewDescription":"I video events and place the final product on these USB Drives.  I specifically chose SanDisk because I trust the brand.  I felt the unit price was worth my investment.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Disc","reviewDescription":"The Stick performed as expected. The size was perfect and easy to use. Great value for your money","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"The best for DJs","reviewDescription":"#1 Recommendation for serato or rekordbox DJs. Quick processing, attaches to my keys. No issues at all.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Ordered about 9 of these. Work flawlessly as boot media devices.","reviewDescription":"On the drives I do use as media devices, I have never lost data or ever had one fail. I need different operating systems on different drives so this was my third time ordering a 3-pack and have never received a bad drive. I will continue buying SanDisk as quality is very important to me. Some SanDisk drives I own are as old as 4 years and are still being used to this day to install operating systems on computers on a weekly basis.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"works well","reviewDescription":"feels very nice in the hand has very fast download speeds overall is a very good product if you don't want to spend $45 on one flash drive","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Does the job well","reviewDescription":"There are not a lot of things that you could say about a flash drive but it does everything it says it does, transfers things very quickly, and also comes with a 1-year media recovery subscription thing which is very useful for some people. I used it to install Windows on my new PC and it worked perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Works as intended","reviewDescription":"No issues; work fine in my PC.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Super Fast Transfer Speed","reviewDescription":"I am a research collector\/analyst in the medical field. I needed a small back up drive with lots of storage to store files away in an archive I can give to someone else. This was the perfect ticket. Price, fast delivery, and very good feedback was other reasons for the purchase... Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Reliable and Spacious","reviewDescription":"I recently purchased the SanDisk 512GB Ultra USB 3.0 Flash Drive (SDCZ48-512G-G46) in black, and I couldn't be happier with my choice. This flash drive has quickly become an essential tool for my digital life.First and foremost, the storage capacity is exceptional. With 512GB of space, I can store all of my important files, documents, photos, and even large multimedia files without worrying about running out of space. Whether it's for work, school, or personal use, this flash drive has more than enough room to accommodate my needs.The USB 3.0 interface ensures fast transfer speeds, allowing me to quickly and efficiently transfer files between devices. This is especially useful when I'm working on multiple computers or sharing files with colleagues and friends.One of the standout features of this flash drive is its reliability. SanDisk is known for producing high-quality storage devices, and this one is no exception. I've been using it for several months now, and it has never let me down. I trust it to safely store my valuable data without any issues.The sleek black design is also a nice touch. It looks professional and modern, and the compact size makes it easy to carry around with me wherever I go.Overall, I highly recommend the SanDisk 512GB Ultra USB 3.0 Flash Drive to anyone in need of reliable and spacious storage. It's a fantastic investment that has greatly simplified my digital life.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Great Storage Drive, But No Light.","reviewDescription":"As a storage device, the SanDisk 64GB Ultra Flash Drive works just fine. I expected the Ultra drive to have a light, since the Ultras that I have purchased before had lights. I install operating systems on these drives, and the behavior of the light can be a useful status indicator. Other than the lack of a light, the drive works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Does Not Work With My Fire TV Stick 4K Max","reviewDescription":"I purchased this 64GB USB 3.0 drive, and an OTG cable to add storage to My Fire TV Stick 4K Max. I make the connections and nothing happens. This drive is not detected by the stick.  A 32 GB USB 3 drive from another company is immediately recognized. I inserted this 64 GB drive in a Chromebook and it seemed to work fine. I formatted as FAT32, tried again with my Fire TV Stick 4K Max and nothing happened. I suspect the problem is probably with my 4K stick, but this USB drive is not working for my intended purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"It's a great 128GB drive@","reviewDescription":"This 128gb drive is very quick!I compared it against a 512Gb. Same manufacturer had run AttoDisk Speed  on both drives.  While the 512 drive did okay\/good the 128gb drive did exceptional!I don't know know why the 128 does so much better. But I believe that the manufacturers use a different controller on 128Gb drive. The speed of the 128GB drive is noticeable quicker.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"saved my important photos","reviewDescription":"easy to use and holds so many photos,","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Small and fast","reviewDescription":"This is an excellent memory stick. It's small and super fast. Two small criticisms: I would have preffered it if it were made of metal—I have a couple of metal thumbdrives from Sandisk and they feel sturdier than the plastic ones. It also would have been nice if it'd had a USB port too, instead of just USB-C. I looked for it but couldn't find it on the Sandisk vendor portal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Decent thumb drive","reviewDescription":"The product is fine. I'm just removing a star because one of the thumb drives was DOA.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Clunky design","reviewDescription":"This uses a shell from a decade ago. Doesn't stay securely extended. Prone to retracting when you try to insert it into the computer. You have to hold it awkwardly to insert.Works well otherwise.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"It works good","reviewDescription":"I like the product very good. Does what it say plug and play ready to use. Great build and I would recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Good","reviewDescription":"I haven't used it yet, but I'm sure it will work fine.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Only 32GB of storage","reviewDescription":"The product was advertised as a 128GB drive, but it only has 32GB of storage.  Off by a factor of 4.  Also I couldn't find this product code on the Western Digital (Sandisk) website, so I'm suspicious whether it's genuine.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722038400000}
{"reviewTitle":"Horrible user friendly experience","reviewDescription":"I connected it to my pc and turns out you need “internet” to use it for the first time. It was on read only mode and cannot be formatted. The installation is not user friendly. I didn’t get to use it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"WARNING-  DRIVES CANNOT BE SHARED.  DOES NOT WORK ON ALL COMPUTER SYSTEMS.","reviewDescription":"WARNING:  Western Digital's claim that San DIsk's USB flash drives and be shared in FLASE.  After two years and hundreds of hours on working on a project and distributing data to others on their SanDisk's USB flash drives, I discovered that some systems won't even read the flash drives let alone let me edit or retrieve it's data.  When I contacted customer service about the details, they were ambiguous and not very transparent with what they could do for me as a customer. They refused to give me a full contact name and phone number of a supervisor who was supposed to be handling my case.  They ghosted me.  They said that they would get back with-in 24 to 48 business hours of my claim and they never did.  This makes me very suspicious of the company and i have lost faith in the product as my new computer does not recognize the SanDIsk.  The computer has been trouble shooted and it is a SanDisk issues with not being able to retrieve the data from this project.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"2 of 3 broke after 7 months","reviewDescription":"I bought the 3 pack, placed some files on the drives in 7 months after sitting in my office I tried to use the drives of the 3 drives only 1 worked, do no buy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Overheats Immediately. Not safe for use.","reviewDescription":"I don’t normally leave reviews but since this is a safety issue, I felt compelled to do so. Plugged this into my computer and within 20 minutes of transferring a few large files it had overheated so much that it caused my computer to shut down. I rebooted and plugged in a few hours later after allowing it and my computer to cool completely. After 15 minutes of non-use (just letting it idle in the port) I ejected the drive safely and it was again hot to the touch to the point of causing me to drop it. Will be throwing in the trash immediately. I’ve always had good experience with SanDisk in the past but this is absolutely horrible. I don’t know if this particular product is defective or what but this is a safety hazard.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Unique experience","reviewDescription":"The item wasn’t as expected because it was never recieved. We were sent an small bag with nothing in it 😊 Other than that, I love everything else which was nothing 🤗 10\/10","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Don't buy - no longer an easy to use device","reviewDescription":"With San Disc you used to be able to just plug it in and then be able to transfer your files. Now has gotten complicated with downloads to wade through before you can use it. You now have to open your computer up to potential invasions of your security and privacy.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Can't handle 5gb video","reviewDescription":"I bought these specifically for my moms funeral. I spent a week compiling pictures, scanning them and making a slideshow with all of the pictures. Each of these thumb drives say they can hold THIRTY TWO GBs and none of them could hold it because the thumb drives format said it was \"too large\". I have to hope the emailed version I have will work and look nice otherwise an entire week of work will be wasted. Again, my video was only FIVE GBs but that was too large. These thumb drives suck.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Died","reviewDescription":"I was copying to the USB drive when I got a message that it was protected. Sure enough, now it's write-only, even though I had copied items to it just a week ago.  Mac Disk Utility cannot do anything with it.  This is a piece of JUNK.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"2 Failed Right Away!","reviewDescription":"I ordered 2 of these 256gb drives and both of them I filled all the way up, then dumped the files somewhere else and then upon going to fill them up again for another dump, the write speeds go from 32mb\/s on average, down to 200kb\/s-700kb\/s. Not sure what's wrong with these drives, but don't fill them all the way up! Better yet, don't purchase them. Here's a picture of the best speeds I've gotten since filling one of the drives up all the way, one time.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"These memory sticks do not work in 2 different USB3 expansion ports","reviewDescription":"I have many USB drives, ranging from 8GB to 256GB.  They all work in both of my powered USB 3 expansion port devices.  These 3 sticks at only 32GB, however, do not work in either of my USB 3 expansion ports.  They do work when directly plugged into a computer's USB 3 or USB 2 port.  I called SanDisk support and they told me that they do not test their USB drives in powered extenders.  They told me to plug their USB drive directly into the computer only.  My USB3 ports are on the back, that is why I use a powered extender.  I used to think that SanDisk was the top of the line.  Now I am using Kingston USB drives, they work fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679270400000}
{"reviewTitle":"ok","reviewDescription":"works fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Works well, but does not stay retracted","reviewDescription":"These thumb drives work fine, however they do not lock in place when retracted.  As a result- the metal USB section is always exposed when not in use.  Since I keep them on a keychain, this is a concern they will get damaged.  They do lock in the open (extended) position.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"They worked well for a little while.","reviewDescription":"They worked well but then it got stuck in my computer one day and the USB part broke off. Now I am not able to access any of my photos and videos on that USB and I have to find someone who will be able to access them for me.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"In the battle of USB vs SSD, ...","reviewDescription":"my husband wrote this:Was looking for a faster portable way to do PC and mac backups. I did not need a lot of storage but wanted the portability. Had used a USB to SATA cable with an SSD and it was a bit bulky.So I picked up this 512GB USB to try. Without getting into the details of which format to use (NTFS, Apple FX, ExFat), the biggest issue I had was performance. The USB 3.0 just does not have enough performance vs a USB-3.0-Sata SSD. It's probably due to the larger cache size on a Samsung Evo SSD than on this.Yes, I could have also upgraded to a faster Sandisk USB, but because I am writing to it all the time, there's no way I could even get closer to SSD write speeds with this or any faster USB stick.I'll find another use for this somewhere else.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1652659200000}
{"reviewTitle":"Write-Protect Issue.","reviewDescription":"Ordered 3 of these and somehow 2 work fine and one ended up with a  write protect issue. I didn't access any of them for this to happen. In the process of trying to correct said one is now damaged and I can't do anything with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"Works but missing storage","reviewDescription":"It says 512 gb memory..but 460 GB show on the stick what about the other 52gb?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"No Activity LED","reviewDescription":"I scoured the internet looking for a USB3.0 thumb drive, from a recognized manufacturer, that included an activity LED.  None listed an activity LED as a 'feature', but two user reviews of these drives mentioned them having  \"... a blue light that indicates readyness, and transfer activity.\"  Bottom line: They Do Not.  This is not SanDisk's fault - they did not misrepresent their product.  In this case, I blame Amazon for their policy of co-mingling reviews of earlier versions of products, or worse, 'similar' products by the same manufacturer.  When you are looking for a specific feature, you do not want to read user reviews of totally different products!  I know, I could send them back, and Amazon would give me credit, but I'll make them work, somehow...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646870400000}
{"reviewTitle":"What happened to SanDisk quality?","reviewDescription":"2 work, one did not???? MAG","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"No instructions how to prep it for use.","reviewDescription":"Problematic in getting it useable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Beware country of origin","reviewDescription":"speeds are below stated in amazon , found a physical difference in China units. Malaysia products have 3 times the speed  found in Units from China.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"One defective unit","reviewDescription":"I ordered and received two SanDisk 256GB USB 3.0 devices.  The first one worked fine.  The other I didn't need right away.  When it finally used it, the device only showed 32GB storage.  So it is defective.  It is passed the return date so I am probably out any refund.  I have not contacted the company yet.  If things change I will update my review.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Drive just crapped out - lost many gigabytes of files","reviewDescription":"I have no idea what happened, but where there were once 344 GB of files in a folder, then a couple weeks later there were only 30 GB of files. Suddenly, today, while trying to troubleshoot the drive, the folder went to 0 GB. Nothing brought the files back. Horrible experience. Never seen anything like this from a USB drive. I just bought it in August 2023 and can't even return it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Garbage","reviewDescription":"I used to love SanDisk very user friendly but this one is garbage. Hard to set up and then not user friendly. I removed what little I could get on then removed and returning.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"MALA CALIDAD","reviewDescription":"SON MEMORIAS LENTAS LAS COPIAS NO EXCEDEN LOS 9 MEGABYTES POR SEGUNDOS. IMAGINESE ESPERAR UNA COPIA DE 20 GIGABYTES","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"The 256 GB Ultra USB 3.0 Flash Drive falls far short of advertise speeds","reviewDescription":"I ordered two SanDisk 256 GB USB 3.0 Flash Drives.  I tested one of them to see if the advertised speeds were credible.  On the factory shipping card, SanDisk asserts that the read speeds are \"Up to 10x faster than USB 2.0 drives\" and \"up 130 MB\/s READ\".I used HDTune Pro to perform benchmarks on two significantly different computers.  For the tests, both computers were quiescent, both used primary USB 3.2 ports (i.e., not hubbed), and both used the same brand new SanDisk drive (fresh from the shipping card).The actual measured speeds were consistent for both tests:  the USB 2.0 speeds averaged about 20 MB\/s, and the USB 3.2 tests averaged about 40 MB\/s.  So the numbers fell far short of SanDisk's claims - not anywhere near \"Up to 10x faster than USB 2.0 drives\" and \"up 130 MB\/s READ\".These were the simplest tests possible;  I decided that write tests were irrelevant.I'm very disappointed, and I'm going to return both of these drives.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1625788800000}
{"reviewTitle":"High failure rate...","reviewDescription":"2 of the 3 of these keep corrupting and require re-formatting. Avoid!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"barely got ten uses out of it","reviewDescription":"Used drive maybe a total of ten times in about six months. Worked fine until I plugged it into my blu-ray player to watch a movie and it wouldn't register. Tried it in two ports on my computer and wouldn't register there either. Previous night when it last worked I'd watched about 4 hours of movies and noticed when I removed the drive is was a bit warm to the touch (never had that happen with any other drives before). And now today it's toast. This is the first SanDisk drive I ever bought...also the last. I'm going back to Verbatim for all my thumb drives from now on.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1679184000000}
{"reviewTitle":"Something's wrong your being cheated.","reviewDescription":"One, I know it's not uncommon for a drive to read less than what they say the drive is, but I find this drive is WAY out there. It's listed as a 512 Gb. drive yet when I checked the properties it registers as a 460 Gb. Thats a whopping 52Gigabytes, I think that amount is excessive. Two, It says to download a program from SanDisk sight and your files will be encrypted, I did and when I tried running the software it said it's not good any more, to download a newer version, I followed their link down loaded it and when I tried running the software, it said the software is not for this drive. I've never had a mechanical problem with a Sandisk drive before, I've had plenty but I feel there's something wrong here. Just be forworned, it's no where near 512Gigabytes and the promised software does not work.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1654905600000}
{"reviewTitle":"Overheats and errors out","reviewDescription":"I bought the three pack of SanDisk 32 GB thumb drives.  One of them was mechanically inoperative.  The slide switch was completely stuck in the closed position even when I tried to free it with pliers.  The other two badly overheat when I tried copying about 300 MB of files to it.  I ejected the thumb drive and almost burned my fingers because it was so hot.  I'm guessing the write errors are because of the overheating.  I would never buy these ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"good but.......","reviewDescription":"i got scammed :( i ordered 2x 64gb usb's and I did get 2 usb's but only 1 was 64gb the other one was 32 gb other than that easy to use plug in and plug out and its very portable . good for storing that 2tb of school work too. 👍","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693267200000}
{"reviewTitle":"Plenty of storage for the budget user, but has major limitations as well.","reviewDescription":"I recently purchased several of the 512GB version of the SanDisk Ultra USB to back up my work and other e-files. I am pleased at the size at which these USBs are available. The actual size available for storage was roughly 460GB out of the 512GB.As many previous reviews mentioned, the USB tip (metal part) gets really hot upon plugging in. Therefore, it is definitely not something I want to plug into my laptop for prolonged work sessions fearing heat damage. Also, I had varying experiences when writing files to this USB. Writing numerous small sized files significantly drops the transfer speed, sometimes, to as low as 100Kb\/s.Overall, I would recommend the USB if you just need many cheap, and highly portable devices for double or triple back up of your less frequently used files. The USB provides the most storage per cost basis compared to many alternatives. But, keep in mind of the over-heating and the slow transfer issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1632614400000}
{"reviewTitle":"Fine hardware, miserable software","reviewDescription":"SANdisk makes great memory products. I have rarely had a hardware failure with them. However, they have provided security software on this stick that is very poorly written and even dangerous to use. It is entirely possible for that software to delete the ORIGINAL FILES on your hard drive that you are trying to back up on the stick. I have sometimes saved the situation by pulling the stick out when I get the erroneous message, but once the program succeeded in deleting the source folder on my hard drive.If you don't use their security software, this is a fine product. I don't know in what country the software was written, but it was somewhere with little quality control. The encryption algorithm seems to work, but the practical side can ruin things.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1660608000000}
{"reviewTitle":"Works fine but","reviewDescription":"The mechanism that keeps the flash drive closed is not so good. It's quite easy for it to open inside my pocket. Other than that it works fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Good","reviewDescription":"Easy too but small. Very careful where to put it. It can easily get lost.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Loved it.","reviewDescription":"I'd give it 4.5 fast to download too ,easy to use.  I love em 4.5","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Slow","reviewDescription":"In my opinion Performs slowly in  my PCs. Large files copy\/paste processes should be faster for the money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692316800000}
{"reviewTitle":"Great for a keychain","reviewDescription":"I use this on my keys as a portable storage for work and home, and its great. Consistent, strong and everything I need. Its a little ugly but its something I look past as I care about functionality","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Works as expected","reviewDescription":"Works as expected, available storage size is not as much as advertised but that is on par with how companies calculate the storage size. Exactly what you would expect. Been using it consistently for several months now and not has any issues.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Good","reviewDescription":"This product is pretty good for what I'm using it for but I was hoping for more space.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691539200000}
{"reviewTitle":"Reliable Storage, but Flimsy Holder","reviewDescription":"I've been using the SanDisk 64GB Flash Drive for a while now, and overall, I'm pleased with its performance.The drive offers plenty of storage space for my documents, photos, and music, and the transfer speeds are fast and reliable.However, the one drawback is the flimsy holder with the drive. It doesn't securely hold the drive in place.While I appreciate the drive's functionality, I hope SanDisk improves the holder's design in future iterations. Despite this issue, the SanDisk 64GB Flash Drive is still a solid choice for those needing a high-capacity, portable storage solution.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great flashdrive","reviewDescription":"pros: So far seems reliable. Downloaded a bunch of pics\/vids and have not had any issues like i did with some other flashdrive i had purchased. Reasonably priced. Packaged simply and easy to understandCons: This item feels very lightweight and not very durable. I feel like i could smush it with my fingers. im just worried it wouldnt last if it accidentally fell or something. It overall isnt a part of its purpose- i just dont want its structural integrity to compromise the actual content it holds","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1715040000000}
{"reviewTitle":"car USB","reviewDescription":"Great size for  car used USB, hopefully it won’t melt during hot season. Bought this brand before with different material, it lasts for 2 years only.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Overall impressed and happy.","reviewDescription":"Ok, USB information is hard to find. Something to note: USB 3.0 is 5Gb\/s, USB 3.1 is 10Gb\/s, and USB 3.2 is the fastest at 20Gb\/s. These USB drives are 3.0. They are blazing fast compared to my old drives, but are still 3.0. Also keep in mind the 32GB restriction for FAT32 format if you are planning on using them for ISO installs. For a 5 pack at $50 i'm 8 out of 10 happy. had they been USB 3.1 or 3.2 I definitely would have been happy. I'd probably only buy the one or two I need next time and not the whole pack and then wait till I needed more to get a faster version with as fast as technology is updating.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"High Storage, Cheap Housing","reviewDescription":"It's strange to be in a world so futuristic that this much storage is inexpensive and small enough to fit in the coin pocket of my jeans -- and yet the plastic housing is so casually designed that it's a little disappointing.  Drive doesn't want to stay in or out of the housing, so you have to hold it with your thumb to put it into a USB port, and it may open in your pocket.  It just needs a tiny, durable friction catch, or a redesign, and it's not like this is a new form factor.  SanDisk has been doing this forever -- let's have housings that work properly.That said, this is still a terrific bargain.  Reliable, cheap, huge storage.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1708300800000}
{"reviewTitle":"The instructions are Confusing","reviewDescription":"The SanDIsk Flash drive comes with 3 files . When you access these files it makes it sound like you need additional files to manage the flash drive. Instructions make it sound like the flash drive has password security and you have to down load additional software online to make it fully functional. I finally gave up and called their customer service number. Apparently  you can just plug flash drive into a USB port and drag copy files to it without have to anything else. Nowhere in their documentation does it say you can just plug it in  and immediately use it...the files on the drive or packaging doesn't tell us this but directs you to other sites in the apparent effort to download or advertise other products. So misleading and frustrating.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"The first one was broken","reviewDescription":"Need to return the first one that they sent me. The plastic part that covers the tip of the USB opening was melted together. The second one that they sent was fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Decent USB flash storage","reviewDescription":"Storage  at 64 GB (61+) is as advertised and checked with Validrive (SGR.com). Write speed is 17-18 MB\/S for very large files. Read is good for playing video files. A good value purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Function is fine. It is too wide in many cases.","reviewDescription":"It’s just too wide. I don’t want to take a file to it, but I’m still thinking about. Don’t think I will buy this type again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Sandisk","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Good product","reviewDescription":"Works as designed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Thumb drive","reviewDescription":"Awesome product…arrived fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Capacity","reviewDescription":"Typical storage fast","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"5 Drives! Are you kidding?","reviewDescription":"Yea! That's what my friend's said. What was best is that they all worked. Plugged them in and formatted them with absolutely no trouble. Better than the ones I get at a local computer center that seem to never work. Thanks so much!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Vale la pena","reviewDescription":"Este producto funciona muy bien.. soy Dj y cumple con mis expectativas es rápido .. muy económico, le doy 5 estrellas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Genuine SanDISK USB thumb drive","reviewDescription":"This is a genuine SanDisk USB thumb drive.  I only buy SanDisk from reputable sellers because there are too many counterfeit and fake drives out there.  The fake drives promise huge storage sizes for a fraction of the price, and trick your PC or laptop into displaying a fake capacity, but they only store a small amount of data and just keep pretending to write.  When it comes time to read your data, it can only retrieve the small amount and the rest of your data is gone.  SO ONLY BUY ORIGINAL SANDISK from known sellers!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Speedy","reviewDescription":"This scan disk is excellent performance, copy very fast and efficiently.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Very good product","reviewDescription":"Works perfectly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Quality","reviewDescription":"The best","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Great for file backup","reviewDescription":"Great for backing up files and photos to my new laptop.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Work like they should","reviewDescription":"Great for extra storage","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Works as expected","reviewDescription":"Works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"It works right away","reviewDescription":"I liked everything","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"free shipping","reviewDescription":"nice price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Flash drive","reviewDescription":"This is exactly what I need to take my files with me in the go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Great thumb drive","reviewDescription":"This thumb drive works great, but it is very small and easy to misplace.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Review","reviewDescription":"They work well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Easy to use","reviewDescription":"This was exactly as advertised. They work well for backing up pictures and videos and were reasonably priced.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Great product !","reviewDescription":"This is a great product with a great price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Great Flash Drive!!","reviewDescription":"I bought this because my laptop ran out of memory and was basically just dying.  I did not want to lose the images and information I have for my business and this saved the day!  So easy to move my files\/images, etc. over to it, pop it into my new laptop and move the files (copy) onto the new laptop!  Easy peasy.  I did not get to try this for free - I paid for it, and I recommend it!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"It's OK","reviewDescription":"Works.?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699488000000}
{"reviewTitle":"Not as advertised","reviewDescription":"Half the speed as advertised. Getting 20MB\/s max and average speeds of 10-14MB\/s. Third drive i bought on Amazon that is falsely labled.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693440000000}
{"reviewTitle":"At least 1 of 3 is Write protected","reviewDescription":"I think 1 of these is corrupt. Tried to download some data, keep getting \"write protected\" error. Tried one of the remaining two and it worked. Searched on Internet for ways to circumvent the write protected status. Found a lot of similar complaints. Nothing recommended works. I bypassed some less expensive thumb dirves as I thought SanDisk would offer quality. Oh well, should have got cheaper ones as only 1 of 2 I tried was going to work for me. I haven't tried #3.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"Thumb drive came apart","reviewDescription":"I've had many SanDisk drives over the years and have never had an issue.  However, one of these thumbdrives was a tight fit in my USB hub and when I withdrew it from the port, the inner part came out.  So, I returned the 3-pack.  I don't think it being a retractable drive had anything to do with it, but in general, I'm not a fan of them.  This one in particular seems a bit cheaply made.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"I only was able to use one of the three.","reviewDescription":"They said they were write protected, I can't find a way to correct this so they are junk to me at this point","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Used open product sent","reviewDescription":"The package of flash drives had been previously opened. I ordered a new product and under no circumstances would I install a flash drive that has been opened by someone else. Seems like a good way to get a virus or spyware on your computer. Returned!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675814400000}
{"reviewTitle":"Not 512 GB","reviewDescription":"It auto-formats to about 460GB useable.  I had 475 GB of stuff on my old drive I wanted to copy, but I had to delete things because, well, the Sandisk can't hold 512 GB.  I couldn't care less how many atomic noodles built on top of giga wammies it theoretically holds in a distant factory.  I need to know how much data can ***I*** store on it, and it will only do 460GB.  So it should be advertised as such.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Broke after 3 months","reviewDescription":"It’s completely fried and unrecognizable by my computer","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Only had 460 gb bought 512","reviewDescription":"Should deliver what is promised  its a big enough difference to notice.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"64GBx2 Ultra USB 3.0 - Does Not Maintain USB 3.0 Speeds, Large Base Can Cover Close Ports","reviewDescription":"These flash drives have ~57.3GB of space for the computer to use. The speeds start off ~55MB\/s for the first GB before dropping down to ~25MB\/s, and then dropping to ~18MB\/s when reaching 1.5GB total written.Additionally these flash drives have a rather large base around the USB port, which can prevent you from using other ports that are close to the USB port you are using.Summary: Storage is rather lacking for price while not even having USB 3.0 speeds, and the design can prevent you from using other close ports.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1647302400000}
{"reviewTitle":"Really old versions","reviewDescription":"These are first generation thumb drives. They work but not as fast as current drives.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Not 512 GB as advertised","reviewDescription":"The disk size is not 512 GB as advertised. It is only 494206451712 bytes as reported by the tool `fdisk -l \/dev\/sda` in Linux.@Sandisk, please fix it!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Stopped working after a week","reviewDescription":"This USB was great and very easily detected and portable, however all of my computers stopped recognizing it after a week. I lost all of the updated documents and work information that I had transferred to it because it stopped being detected. So disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1674432000000}
{"reviewTitle":"Bad Luck?","reviewDescription":"Over 135,000 five star reviews and I get a bad one. Figures! I only tried one and it never got better than 22MB\/s. Used NTFS, Fat32, and exfat but just could not get above 22MB\/s.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686009600000}
{"reviewTitle":"Storage loss","reviewDescription":"I put a file on flash drive then after removing the file the flash drive says its compacity is only 36 gigs now. huh??","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"all these 2's because thre is no where to complain about UPS delivery - they are horrible","reviewDescription":"Ill update product when IF it ever gets delivered.  I expect it would be fine because Sandisk usually are","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687651200000}
{"reviewTitle":"Old USB - Windows 8 compatible","reviewDescription":"Latest compatibility listed in the documentation is Windows 8.  It automatically scanned for an update, found one, then crashed trying to update it.  Windows 10 came out in 2015 so these USB's are probably 7+ years old.  I was able to copy the .exe file from another USB in the package to the USB that had crashed.  It works if you don't perform the software update.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647907200000}
{"reviewTitle":"It takes 3 hours and 45 minutes to fill to capacity.","reviewDescription":"I have a 128 gb unit and it only takes 15 minutes to fill to capacity. This 512 gb unit I would have figured would only take 1 hour to fill to capacity which was five times the time it took the 128 gb unit to fill but it TOOK 3 hours and 45 minutes instead. Otherwise it was a good device. I bought 2 units and fill them with exact copies of the same data and they took the same exact amount of time to fill to capacity.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632355200000}
{"reviewTitle":"not a true 512","reviewDescription":"i would give this a higher review if these where a true 512gb when checking the storge space on it it shows only 460gb after the program which is 11.3mb which it says 494 the math is wrong there should be 500.70 left after the programs are put on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655337600000}
{"reviewTitle":"Difficult to ever use","reviewDescription":"Returned.  You must program the units prior to using them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Excellent quality product","reviewDescription":"I have never had any issues with SanDisk Flash Drives. I save all of my video editing projects on them as well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"ultras useful","reviewDescription":"good for frequent back-ups, and sending large files.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Not bad at all!","reviewDescription":"Perfect for traveling and keeping your data, work stuff, pictures of adventures, etc close to you. Easy to transfer said items to laptop & computers.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"XBox backup","reviewDescription":"Simple to use and works for Xbox one backup drive without any issues","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Bien","reviewDescription":"Funciona bien llegaron antes de lo esperado.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"As expected","reviewDescription":"The thumb drive is supposed to be 512gb. However that does not account for the space used up by built in software. It’s around 470-480 if you take everything into consideration. Write and read times aren’t overall too impressive but they work. I use it mostly for storing larger games from steam cause I’m too lazy to buy an extra hard drive for my computer. You could potentially format the thumb drive and get more storage out of it, but if you’re just looking to store documents and other files that you don’t want your wife or kids finding you should be set.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Make sure to check file system before data transfer","reviewDescription":"460GB available for 512GB drive which is fine because one does not expect to have the whole advertised capacity available. However, the one disappointment was that the drive was formatted using FAT32 by default. I started the file transfer from an old external HDD in the night and went to sleep expecting that it will be done by morning. Realized upon waking up that files larger than 4GB wouldn't copy and it was stuck on the dialogue box asking permission to skip such large files. So essentially hours wasted. Had to reformat the usb stick using exFAT and then recopy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1654992000000}
{"reviewTitle":"Big drive, decent price.","reviewDescription":"Everyone complains about the drive being a 512gb and only getting 460gb'ish from it.  I'm not a computer erudite or anything so I don't know why it loses so much space, but if your concerned about not having that extra amount of space, maybe you should move upto the 1tb size or considered a pocket hard drive instead . . .","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Fast and convenient to use","reviewDescription":"These flash drives work without hesitation. They are plug and play right away. I loaded them up and transferred files from one laptop to another. The transfer speeds were great. The drives fit easily in your pocket or on a key ring or necklace. I only wish they had a light on them so I would know when they are doing something. Otherwise they are the best I have found.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671148800000}
{"reviewTitle":"Fast","reviewDescription":"I needed to copy a large amount of data from my desktop. I was very happy with how fast copy transferred onto these drives.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685059200000}
{"reviewTitle":"Write speed is S...L...O...W....","reviewDescription":"SanDisk 256GB Ultra USB 3.0 Flash Drive - SDCZ48-256G-GAM46Took this thing 90 minutes to write 52gb on a USB 3.0 port, which works out to 9.6 MB\/s.  That's 1\/10 the speed of my 6 year old Toshiba HDD, which is also connected via USB 3.0.  I'll keep it, but wouldn't buy it again due to it's slow write speed.  It also runs quite warm to the touch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"The sliding function does not work longer","reviewDescription":"its holding the data good, but the sliding function stopped working and now it cannot be used easily. Sometimes i cannot plug it in cause the usb does not slide all the way out of the plastic covering no matter how hard you push it. I feel like breaking it. Already asking sandisk to send another one. I would not recommend this design. Just buy a simple one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639958400000}
{"reviewTitle":"Really cool design but stopped working....","reviewDescription":"This usb drive stopped working and I was unable to access my files on it, but I've bought from sandisk in the past and they've been good. So, it was probably a fluke (or maybe user error)","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1665532800000}
{"reviewTitle":"WRITE SPEED SUCKS, BUY SOMETHING ELSE","reviewDescription":"What's the point to have a USB 3.0 flash drive if write speed does not live up to expectation?  I understand you won't get the performance if you plug it into a 2.0 but when I test it on a brand new XPS with 3.0 equipped, the write speed only lives up to 1.2mb\/sec for large file?  The write speed is not as advertised, I wouldn't buy it again.Read speed does live up to the expectation, on the other hand.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1603497600000}
{"reviewTitle":"One of them fell apart soon after I started using them","reviewDescription":"One of them had terrible build quality. The metal casing for the usb plug started to loosen after unplugging, and then the whole board came out. Not good quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671840000000}
{"reviewTitle":"Bent\/damaged","reviewDescription":"The 64gig came with the metal usb tip (the part that comes out and goes into a computer) was all bent. I had to pry it open to make it work because i don't have time to send it back and get another one","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650240000000}
{"reviewTitle":"Not reliable.....","reviewDescription":"I purchased the 3 pack of 32gb drives in August 2022, at present two have failed after being used less than five times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Slow write times","reviewDescription":"Purchased because of the price, however if you don't mind very slow write times then I can see it being a good buy, if you do then spend a few extra bucks and get something better.  Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648857600000}
{"reviewTitle":"Didn’t all work","reviewDescription":"1\/3 of the drives was write protected. I was not able to use 1 of the 3. Don’t know why it would be write protected and I could not remove protection via formatting or registry editor. Had to throw one drive away bc it was completely unusable","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1636416000000}
{"reviewTitle":"Depends on your luck","reviewDescription":"I’ve bought two of these and the first one worked very well. The second one I thought it would work well too, but it ended up deleting my files and won’t even work or let me access it anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"Doesn't contain rated capacity","reviewDescription":"Bought two of these, rated at 128 Gb. Both drives show 114 Gb available. Otherwise work as advertised so far.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"Not worth it","reviewDescription":"I uses it as a start-up device and it went from a 32gb usb to a 2gb usb","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613779200000}
{"reviewTitle":"Messed up storage.","reviewDescription":"The drive had 460GB instead of 512GB. Really disappointed with you SanDisk...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615680000000}
{"reviewTitle":"Cobbler topping music files known issue","reviewDescription":"Questionable quality","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1628899200000}
{"reviewTitle":"Breaks easily","reviewDescription":"It stop working after a week.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1617926400000}
{"reviewTitle":"CHEAP housing. Poor max capacity.","reviewDescription":"This plastic housing is VERY cheap. I wouldn't even trust carrying this on a keychain which is what I bought it for. Looks like it would break in a few days. The  lanyard hole is an EXTREMELY thin hollow wafer of plastic. How do you trust that this won't break off my keychain and be found by a dishonest person? With the 64 GB version, max capacity is only 57.2 GB. Never heard of this! The 64 GB USB drive should be over 59 GB. May return this garbage.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686355200000}
{"reviewTitle":"Maybe mine is a bad one","reviewDescription":"The reason I bought this usb was to increase the storage of my firestick tv, this particular one was advised by a YouTuber saying that it would work...I tried different usb that I already own, they're all recognized by my firestick and this one that was supposed to be THE ONE was not recognized at all. It works alright on a computer thought. Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608768000000}
{"reviewTitle":"Slow","reviewDescription":"Scandisk makes a great product. I have had dozens of their zip drives. But this drive had 32 GB and I guess that is why it is so slow because it is a high speed disk. I cannot use it on my dell computer. The computer is only 2 years old.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641686400000}
{"reviewTitle":"SLOW AS 2mbs or less","reviewDescription":"Writ speed are SLOW! Slow as 2mbs, it does maxout at 20mbs at the start,  than just slow and painfully 🤣","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644278400000}
{"reviewTitle":"Trusted brand but a little too small","reviewDescription":"Maybe because of the premium on the name brand, the price tag is too heavy for the size of the storage. IT works just fine but the pricing can be much better if you look more around","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Corrupted","reviewDescription":"I recently purchased this Sandisk flash drive, and my experience has been nothing short of disappointing. The flash drive was a fluke. It asked me to format the drive, and I did, but nothing happened. I inserted it again, and it's not recognizing the drive. This drive wasn't working at all. It's either corrupt or bad batch","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722643200000}
{"reviewTitle":"Bad Flash Drive","reviewDescription":"I bought this flash drive to back-up my files and my 'back-up' feature will not activate it as it says it detected a virus or defect in it.  So i need to return it.  :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Missing 5gb from the listed storage.","reviewDescription":"The storage space should be at least 119GB on disk manager to be considered a 128GB (since SanDisk defines 1 GB as 1,000,000,000 bytes while Windows defines 1 GB as 1,073,741,824 bytes). However, even taking this into account, there is 5 GB of missing capacity. Even if we account for formatting and functionality, there should only be a few hundred MB's missing, not 5 GB. Will not be buying SanDisk products ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"AWFUL speeds","reviewDescription":"Same computer, same USB port- Samsung 128gb usb 3.0 transfers files from my computer to the USB drive at ~90-100mbps ... this SanDisk is transferring at 10-15mbps. I suspect I was shipped a knockoff.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Runs on older FAT32 File System","reviewDescription":"I did not see in the specifications that this SanDisk flash drive runs on a FAT32 File System.  Each of my files is over 4GB which doesn't load onto this drive.  With my refund, I will buy a drive with NTFS file system which will support my needs.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Overly complicated just to launch & download.","reviewDescription":"I'm actually a loyal SanDisk customer, but not this time. *I'm not an IT expert or anything, but I do have extensive USB drive, and computer knowledge. I have never had a product so difficult to just activate, this software download is so confusing that it's not worth my time.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Ouch - HOT, HOT, HOT","reviewDescription":"Everything about the USB drive was great except that it gets burning hot.  This happens every time it is placed in a port.  You don't have to be writing to it, transferring from it, reading something from it - nothing, it just sits and gets hot.  I placed an empty one in a port and it got hot.  The longer it sits, the hotter is gets.This is a big flaw.  Will damage data and your port.  Not worth the risk.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716422400000}
{"reviewTitle":"I ORDERED TWICE AND YET NONE OF THEM WORKED","reviewDescription":"I am sorry but I am honestly very very dissatisfied with this product.I ordered it for the first time and it didn't work at all, not on my computer, not on windows, not on anything else! My port works fine, and so does my converter. I tried everything the internet suggests me to do too. Go to disk utility and so on, restart, allow external disk, but none of it works. I also called the sandisk to check how I can solve this but they said if that's the case, the USB is not working. So, because it is so apparent that this USB is dead on arrival, I ordered a replacement because I really needed this fast.AND GUESS WHAT? This one doesn't work too!?!? The thing is, It was first connected, the notification to allow and all popped up. But when I pressed the eject button to eject it and reconnected it right after, it can't be recognized!!!!!!! It's unbelievable, and I am honestly so disappointed. Please solve this issue. Whether it's a manufacturing issue or the whole batch is dead, please, this is so stressful because there are people who actually needs this fastly.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"It blocks you from transferring your files","reviewDescription":"Never in my life I had to install software to use a flash drive. For this one we not only have to install software, but we need to figure out which software we need to install. Come on, it's a simple task. I want to save my folders and files. I'm not installing a video game. It's just bad customer experience using this device.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"The flash drive does not work","reviewDescription":"I received the set of 2 sandisk 64gb a day after I ordered it.  Took one of them out and insert it into my laptop.  Windows 11 message was the drive needs to be formatted.  I clicked on format command.  3 format option was available and I selected the sandisk default.  Windows couldn't format it.  Since the drive is 64gb, I decided to use NTFS this time.  Windows 11 did not format it.  I checked the product support of sandisk and they suggested to reboot my laptop.  After rebooting, windows recognized the drive and suggested \"exFat\" format.  drive was formatted.  Then I tried to copy one of my video files to the flash drive.  Windows could not copy it!  The drive had lost the format and needed to be formatted again by rebooting the computer again.  I decided to return the item as defective.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"great find","reviewDescription":"good to go","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"This is NOT USB 3.0","reviewDescription":"Everything about this flash drive is exactly what you' would expect it to be, except for the USB version. It is not 3.0. It is a 3.2. This was important to me because I needed something that was 3.0 or less. I gave it 4 stars because the ad for this isn't technically correct.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"128GB ... Oh, Really?","reviewDescription":"I gave the CAPACITY only one star because after formatting, the \"proclaimed\" 128GB capacity is really only 114GB. In what world does SanDisk believe that 114 is equal to128???? In my world that's false advertising.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"Not really 64GB","reviewDescription":"These are advertised as 64GB but only 57GB are available. I ended up researching why the USB drives are like this, but apparently, they have to reserve some space so the drive can work properly. Which like, okay, I get that. But why are they labeled as being 64GB when they aren't really? Why are they not labeled as 57GB instead? Aside from that, the drive works great. The time it takes to copy over bigger files does take a hot minute, but if you're used to speeds from the early 2000s, the amount of time it takes now doesn't feel like that long. I do like that it has a hole in it so you can attach it to either a keychain or an old-school phone charm. Makes it easier to distinguish that it's your USB drive and to prevent theft. If you leave these USB drives in for a long time, they do slowly start to warm up. But only if you leave them in for a very long time, and they don't get as scorching hot as my phone.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"Lots of space, but pre-formatted with FAT32","reviewDescription":"I bought these to store large file for video editing when it's not practical to transfer them over the network.  The first thing I found out is that they are pre-formatted with FAT32 which has a maximum file size of 4GB.  I reformatted them as exFAT and the problem is solved.Performance is decent for the price.  I measured speeds using USB 3.2 Gen 1 (aka USB 3.0).  Sustained read speed is about 135MB\/s.  Burst write speed is about 66MB\/s and it maintains that speed for about 1GB before it drops down to 35MB\/s.  Most of the files I transfer are 3GB to 5GB in size, so it was a few months before I noticed that write speeds drops down again to 22MB\/s after somewhere between 5GB and 6GB of sustained writes.  The speed remains at 22MB\/s until at least 17GB which is the largest file I've tried.I also had the opportunity to try this flash drive on a USB 2.0 port.  Sustained read speed is about 38MB\/s which is close to the limit of USB2.0.  Burst write speed is about 22MB\/s for about the first 1GB, then the sustained speed drops to about 17MB\/s.  I expected this to be around 35MB\/s since the device can transfer data on USB2.0 at speeds of at least 38MB\/s and it can write to it's Flash at speeds of at least 35MB\/s.Something else I noticed is that while plugged into a USB2 port, the drive temperature doesn't increase, even when reading or writing for several minutes.  However, when plugged into USB3 port for a few seconds, even when the drive is not being accessed at all, the drive gets fairly warm.  It's not hot enough to burn your skin but it makes me think that leaving the drive plugged into to a USB3 port for extended periods of time (something I normally do) will shorten the life of the drive.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1656892800000}
{"reviewTitle":"Thumbs up 👍","reviewDescription":"Faster!!! Should light up tho.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Size of Storage","reviewDescription":"Good price for the capacity and their are fast","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"It is exactly what you expect, and it works as intended.","reviewDescription":"You already know what you're getting with this product, not too much room for error here.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Drive capacity 90% of advertized.","reviewDescription":"I've been using Sandisk products for years. they are a very reliable brand. For this model, I found that there was only 460GB usable. There is always a limited amount of drive space that's unusable. In my particular case its 52GB (10%).  I have not looked at the storage loss by percentage across my other Sandisk products. Perhaps this is normal, but not as noticeable on smaller size drives. I will continue to use Sandisk products.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"I don't know","reviewDescription":"Maybe it's just me but I get so many files corrupted when I use these flash drives.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Slow write speed","reviewDescription":"In the last 18 hours I’ve managed to write about 120 GB. Very slow and disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"HAVE to download SanDisk software, & it uses the I cloud. Purchased PNY next day easier to use.","reviewDescription":"I did not like that one HAD to download SanDisk software prior to use and it uses the i cloud. Purchased PNY next day for plug and play. If one wants encryption and passwords the SanDisk is a good choice otherwise.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"SanDisk Ultra 256GB: Pathetically Slow Data Transfer Rates","reviewDescription":"This device claims speeds up to 130 MB\/s. I realize that's marketing hype but average write speeds were 25 MB\/s. This is only slightly faster than the ten year old SanDisk Cruzer 64GB (20MB\/s). This performance is ok for drive size of 32GB but not for 256 GB unless you are only adding a few files at a time and mostly reading. The drive slows down as it fills too. Capacity value is good. Performance value is poor.A better SanDisk, with increased cost, is the Extreme PRO 256GB. It still doesn't approach the advertised 380 MB\/s write speeds. But it averaged 140MB\/s on NTFS.  Still no where close to the Samsung T5 2TB which does match write of 380 MB\/s. But it also costs 5x more.Tested the Ultra with 72K files ranging is size from 3 GB to < 1KB. Mean size was <10MB.  Best write performance was sizes <100MB approaching 65MB\/s . Read time on small files approached 85 MB\/s. Surprisingly, files systems exFat and NTFS had similar performance with a slight edge to NTFS.","isVerified":true,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1597449600000}
{"reviewTitle":"Blatant lying about the storage size","reviewDescription":"I have purchased the \"512 GB\" version. I am quite familiar with the usual practice of the storage industry of using decimal Gigabytes to advertise the capacity. The drive I have received has 494206451712 bytes. This is the raw capacity of unformatted and unpartitioned drive as reported by Linux kernel. Obviously, it will be less after formatting. Obviously, it is much less in \"true\" Gigabytes defined as 1024*1024*1024 bytes (460 GB).I suppose most users will be convinced by the argument that formatted drive has less capacity, as they might have a limited capability to access the size of the raw device. Others will be convinced by the argument of different units for MB and GB. How would they answer to my complaint? Maybe they would say that Linux is not supported? Extremely unlikely, as devices like that use a general protocol not tied to any particular OS.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1629158400000}
{"reviewTitle":"Not fast at all","reviewDescription":"They say you can transfer a full length movie in 40 seconds, such BS. It takes 10-15 mins to transfer 10 iPhone photos. Movies take way longer. False advertising, this thing is no fast then my flash drives that are 20+ years old.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"They don't work as they should and overheat","reviewDescription":"I would give more stars but it doesn't fully work as it should. It would be great if these would have been able to boot up as the main disk but they won't no matter what. They are also too hot to touch after plugging them in and removing after a few minutes. Tried multiple USB 3 slots, computers and 3 different programs and combinations of formatting and image files but none of it works with these sticks when stem attempting to booting from them. I have an older USB 2.0 SanDisk that works great and will boot up with the same images and formatting. I have sent these in for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1650844800000}
{"reviewTitle":"Requires software download","reviewDescription":"Requires software download but unsupported by Microsoft Edge. Ordered another company's thumb drive, no problem.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Poor Quality","reviewDescription":"These have been really disappointing drives. They malfunction regularly, always give an error message when I plug them in, and the \"3.0\" USB speed is slower than the 2.0 Cruizers I wanted to replace. I bought SanDisk because in the past they were a reliable brand with good engineering. Unless these are defective, that assumption is no longer true. I'm replacing these with a different brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Failed after 6 months","reviewDescription":"After just 6 months, 2 of the 3 drives I purchased failed, preventing access to any files on them. Thankfully I keep backups, but I can't trust this product for my day-to-day work.UPDATE: The third drive died after just a year and a half. I've never written data to any of the drives more than once. They're just faulty all around. Do not purchase these.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"Works perfectly","reviewDescription":"I’ve used these before and have always been pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Handy to have around when needed.  A great value.","reviewDescription":"These flash drives from SanDisk, one of the inventors of flash memory, are handy to have around when needed.  And the price is amazingly low.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"These are awesome","reviewDescription":"I used one of them as a Windows 11 backup and the other two I'll probably either put Kali Linux or backup art and music assets for game development","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"This product has one of the best storages For me I need alot of storage and this has just worked!","reviewDescription":"I loved this product it has all the storage I need because I need a lot of storage because I download 3d printing files which takes up a lot of space, another option is the Memorex 32gb it comes in a 3 pack the colors are red, blue, and green","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Flash drive","reviewDescription":"Good quality and does the job. Good price also.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Works like a charm","reviewDescription":"Works like a charm","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Great","reviewDescription":"Great to store documents","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Always reliable.","reviewDescription":"Scandisk is always reliable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great product","reviewDescription":"Does the job well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"SanDisk is the best","reviewDescription":"I bought a few of those inexpensive, high capacity USB drives and had nothing but headaches.  Whenever I buy a USB drive I run a program against it called Validrive.  It validates that the drive is as big as the claimed size (in GB) and that it doesn't have read\/write errors.  All of the cheap drives have tons of errors and bad sectors.  They are also quite slow.  I recently ran it against a cheap 64gb drive and it took over an hour!  This SanDisk drive only took 7 seconds and it was perfect!  Not a single read\/write error or bad sector.  I definitely recommend these drives.I am done with cheap USB drives.  Only quality drives for me from now on.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Not as sturdy","reviewDescription":"Bought 4 and one corrupted after a month of use. Data lost lucky to still have it on laptop. Went to Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Storage cheap","reviewDescription":"Price for (3) 32 gig, amazing.Used for downloading Linux distros.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Útil","reviewDescription":"Tiene buena capacidad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"return ed item","reviewDescription":"not sauitable for me","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Good size for just pictures.","reviewDescription":"The space it has advertised is not correct. More like 80 GB available. Expensive for not being able to fit much on it. Could only fit very little pictures on it and no videos.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698364800000}
{"reviewTitle":"SLOOOOOOOOW. But it works for transferring files. NOT recommended for backing up large file folders.","reviewDescription":"My wife wanted to archive photos. I bought the 512GB. Formatted size was only 490GB; seems like I got less than what I paid for but I get how the game is played.. shame on you SanDisk! Next time Samsung gets my money. Transferred only about 64GB from my internal computer SSD HD to this flash drive using USB interface. I took quite a while. Almost a half hour to be precise. My Mac Pro was estimating 2 hours but transferred all 64GB in just 1\/4 the time estimated. For comparison, I used an external SATA III SSD 1TB Samsung drive in an external drive enclosure and was able to back up 400GB in the same amount of time. This is a flash drive transfers large files in a frustratingly slow fashion. If you plan to transfer small files around from one device to another, it will suffice. To back up large files\/folders (i.e. batches of videos or photos), or to back up an entire computer, this flash drive is very very slow. Keep in mind that you are paying for form factor and not for speed or efficiency.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1640563200000}
{"reviewTitle":"Too much capacity for AVG to scan without error","reviewDescription":"My work has a paranoid virus scanner (AVG) that wants to scan all of the empty sectors for viruses.  It crashes on anything larger than 256GB.  When I complain to my IT guys, they look at me like someone with terminal cancer and just say that there is nothing they can do - must be a bad drive.  Works on my home computers running defender.  Now I have a nice big drive that only works on my personal computers.  Yay...That being said, it does work well as a device.  I don't have 500GB blocks of data to move at home though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685664000000}
{"reviewTitle":"1 came DOA","reviewDescription":"Great flash drives. I use them constantly. One arrived DOA but I needed the ones that worked. Just be sure to check the drives before you commit and let it pass the return period","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Works but isn't as advertised.","reviewDescription":"It works as a USB 3.0 for sure, I just heavily dislike that it comes with 114 GB of storage, rather than the 128 it was advertised to have.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"works bt cheaply made","reviewDescription":"USB does not lock in place when inserting in PC.  Poor design","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"USB runs hot even when idle!","reviewDescription":"Good read, slow writes, and will get hot just sitting there doing nothing. Thankfully this is just storing some temporary transfers. Would recommend something else for more important things.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655683200000}
{"reviewTitle":"No recognition","reviewDescription":"Neither TV nor laptop recognizes flashdrive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681430400000}
{"reviewTitle":"Poor transfer rates","reviewDescription":"Every other USB 3.0 device I have will transfer at around 100 MB\/s, these transfer at 20 MB\/s at the most.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657843200000}
{"reviewTitle":"not as advertised","reviewDescription":"i do not believe this is 3.0 it is very slow and it does not have the entire 64 gig even with the help file.very poor for a popular Brand. i have attached a screenshot of a test i ran.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629590400000}
{"reviewTitle":"Not very fast write speeds","reviewDescription":"The product description makes this seem faster than it actually is. I'd say slow write speeds for a USB 3 device. Also, the device gets very hot while plugged-in. This doesn't happen with other USB drives I've used in the past.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1627689600000}
{"reviewTitle":"Only 28.6GB each","reviewDescription":"Great products, but absolutely mislabeled as 32GB. They're only 28.6GB, so about 10% less capacity than advertised.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1660694400000}
{"reviewTitle":"Not as aspected","reviewDescription":"Speed at first 54 m\/s then drop to 11 m\/sI don’t recommend it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657584000000}
{"reviewTitle":"Dead Slow","reviewDescription":"Sandisk Ultra 256GB - Good product - Reasonable speedSandisk Ultra 512GB - Poor product -  Slow speed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640476800000}
{"reviewTitle":"did not function as it should","reviewDescription":"it lost some of the files it transferred and if you didn,t  use the password you could still get into the files don,t know if it was this particular unit but thumbs down","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1604016000000}
{"reviewTitle":"Damaged intentionally","reviewDescription":"Looked like someone took pliers and crushed the ports","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648339200000}
{"reviewTitle":"Purchased 1 and went back for two more!","reviewDescription":"These were fine for the money. I bought one a few weeks ago and decided to buy two more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Dense and Cheap, just like your mum!","reviewDescription":"Great value, reliable storage and adequate speeds for both reading and writing.These flash drives are my go to for file migration on my LAN.This is the 3rd one I bought and its just as good as the first 2!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Was what they said it was","reviewDescription":"It’s a flash drive, works fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Good buy!","reviewDescription":"Excited to use this product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Thumbs up 👍🏼","reviewDescription":"Works perfect for my CNC file transfers to machines!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good piece of equipment","reviewDescription":"It works, and works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Excelente","reviewDescription":"Este producto es muy bueno","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Perfecto","reviewDescription":"Capacidad y tamaño perfecta para llevar a todas partes, gran diseño y resistencia. Sus materiales parecen de gran calidad y la transferencia de archivos muy rápida.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"SanDisk","reviewDescription":"What's not to like, they're USB flash drives?","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very reliable","reviewDescription":"This is the only brand of flash drive that I will buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Not 512GB - only 460GB","reviewDescription":"False advertisement - not as advertised. Only 460GB of useable space","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Not even close to the rated speed","reviewDescription":"Ran a system test and tested the usb drive max read and write less that 32Mb\/s. Not even close to the advertised speed +(","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Trying to transfer a 10GB file but get error message that says destination is not large enough","reviewDescription":"I am trying to make a windows boot media. I formatted the drive and tried to copy the file i downloaded. i keep getting the message that the destination location does not have enough space. The properties of the 32GB drive says it has 28.6GB of free space. so over 3GB short of advertised. but trying to transfer a 10GB image file over simply wont.if you need this for simple documents, it should be fine. but i wouldn't suggest it for boot media.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Part of order defective","reviewDescription":"Placed order for 3 pack. 2 out of 3 worked the 3rd one was defective.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Bad customer service","reviewDescription":"Quit working and Mac could no longer read it. Reached to customer support and it’s was like a black hole. No response at all and it’s been several weeks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"512 GB YEAH RIGHT","reviewDescription":"I bought this because I wanted to move some big files and to have them stored only to find out that this device has a capacity of 460 GB instead of the 512 GB that I was advertised and it says it has up to 130 MB of Read speed the max I got was about 24 MB it's not fast at all this is false advertisement do not buy this scan this is gone down in quality and customer trust.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Can't write to this flashdrive, crashes my 3d printerwhen inserted.","reviewDescription":"This flashdrive gives errors whenever I try to write to it and causes my 3d printer to crash whenever it's inserted.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"The worst thumbstick I have ever purchased","reviewDescription":"All I wanted was a thumbstick. You select your updated files in one window, you drag and drop them to the other. You confirm the update and you are done.Not with this horrible piece of garbage. You have to use their special interface tool. It starts to move files while you are still selecting and haven't given any command or dragged any files anywhere, and then it pops up a confirmation message with no file detail and no cancel button, so you don't know what you are confirming and what action will happen and you can't back out safely. It is so counterintuitive and clumsy that I managed to overwrite my newer file with the older version, with no way to recover. What makes it worse is that I feel convinced that the interface is intentionally awful to try and sell an upgrade - it just couldn't be so bad by accident.I will never buy another SanDisk product - do yourself a favor and don't buy it even once.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1614384000000}
{"reviewTitle":"Want to like but died the second use on first day.","reviewDescription":"All I got to say is I've used SanDisk over the years and this one may have been a \"one-off\".Second use and the thumb drive died on the same day. When I removed it, it was really hot. I've never had a thumb drive be hot to the touch. I'll be buying something else instead.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701993600000}
{"reviewTitle":"Won't allow me to transfer files over 10Gb AT ALL","reviewDescription":"I have used SanDisk thumb drives for years, and I am disappointed in the 4 I recently received. I don't know if it is because they are the \"New Generation\" but if I try to transfer a file over 10Gb it gives me an error \"This item can't be copied because it is too large for the volumes format\". I'll be the first to admit that I am no computer guru, but ease of product use is a focus of many buyers, and if you can't simply drag a file and have it transfer successfully, some users might want to pass on this product. I tried this on all 4 drives that were delivered, some being 64Gb and another was 128Gb, all three were void of any content, none of them would allow any files over roughly 10Gb to be transferred no matter how I tried.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1615852800000}
{"reviewTitle":"Good","reviewDescription":"Like","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Good but not best","reviewDescription":"I needed external storage that is fast enough for video, easy to use, and affordable.  MP4 files use a lot of memory, but they do a good job of keeping video and sound in synch.  This mem stick didn't let me down.I went on to also buy a 5TB external Seagate for $100.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"They work","reviewDescription":"Needed a few to transfer some files worked great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"big capacity","reviewDescription":"What can I say, it does its job.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Convenient","reviewDescription":"Bought to transfer a copy of my living trust for each of my daughters.  Large page document with ram to spare.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great value","reviewDescription":"Offers large storageLight weightEasy to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"A Worthwhile buy","reviewDescription":"Decent price, can't complain with read\/write speed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Convient & Reliable","reviewDescription":"I have been using Sandisk thumb drives and cards (SD) for years.  As I write this, none have ever failed me.  My oldest devices are the SD cards.  While I have seen reviews about the upload and download times, I really do not have any way to compare these.  I can say that I uploaded thousands of documents (about 90 gigs worth in about an hour.  I am \"backing up from a SATA III hard drive to a USB 3.0 docking device.  All the time I was working on spreadsheets, surfing the web, and editing a few photos.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Upload speed not the fastest","reviewDescription":"These work fine but if you’re wanting to upload large files it’s going to take a while","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"Fairly good.","reviewDescription":"Works good but sometimes stops responding.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Flimsy plastic USB drive","reviewDescription":"Flimsy light plastic USB drive…you could call it 3.0 or 2.0 or whatever…..they are all the same…be careful not to easily crack it if you place laptop in wrong angle with USB attached to it…I’ll get the metal one for sure next time…","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1715472000000}
{"reviewTitle":"Good Value, Not Durable or Stable","reviewDescription":"This is a good value for basic modern USB drives. However, I have had problems with all 3 of these drives which is surprising since I have had no issues with other brands of flash drives (Samsung, Silicon Power, Patriot Memory). 1 simply broke mechanically. I don't particularly like the slide style USB drives for this reason as they seem weaker and more susceptible to any sort of strain. I was hoping that because these were SanDisk (I use the same drives at work) that the build quality would be above average, but I was wrong.The other two are having formatting issues. Overall, I am disappointed with these drives and will probably look elsewhere when I need more.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Advertised capacity more misleading than usual","reviewDescription":"This USB flash drive is advertised as having 128GB capacity.  In actuality its only 114GB.I'm well aware the advertised capacity is often below what you actually get, but in my experience the loss is usually around 6% even on cheap flash drives.  In the case of this SanDisk flash drive, the loss is 11%.  That's ridiculous.Just be aware of the actual capacity of this flash drive.  I i calculated it's actual capacity would be around 120GB, which was large enough for my project.  I now need to make other arrangements.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1710806400000}
{"reviewTitle":"Difficult to hold it open","reviewDescription":"Is not bad but holding it open is not that easy when inserting them in a USB socket","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Wish it had a cap","reviewDescription":"It’s ok & I am using it. I really wish it had a cap over enf","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Not good with video files. Won't let me transfer","reviewDescription":"It says I have 117gb space left on the disk but when I try to transfer even 1 video file that's about 6 gb, it says there's not enough space on the drive. Which is not true! But it simply wont let me transfer it. Probably better for photos and documents but it doesn't do well with transferring videos. It isn't even that long. it's about a 20 minute video and it just freaks out and wont let me do it.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Warm","reviewDescription":"Get very hot under only minimal load.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Bit difficult to use.","reviewDescription":"The retractable portion of this drive is a bit difficult to use. It’s in and out movement is clumsy. Where you push n pull to extend and retract is not easy to use. Have other sandisk drives that are not difficult to use. Why would any company change to a design that is more difficult to use than previous ones? Other than that it’s fine. Would not buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"good","reviewDescription":"nice","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Beware. Security software will not install.","reviewDescription":"Fine USB stick. I have had others like it. But when you attempt to install the security software on the stick it directs you to the Western Digital site to download the latest version. That software will not install so I cannot password protect the stick.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Note this comes with FAT32 format (max 3gb file size)","reviewDescription":"Why would a large capacity flash drive come formatted with FAT32 - which limits size of any single file to 4 GB max? It's not hard to reformat to exFAT to remove this limitation, but I didn't even think to check before loading a bunch of data - and then it hit the FAT32 roadblock. Rather than reformatting, wiping it clean and starting over, I reformatted another sandisk flash drive purchased at the same time (that also came FAT32) to exFAT and it took six 6+GB file with no problem. Interestingly, the reformatting menu shows exFAT as the DEFAULT for this flash drive, so why would Sandisk ship it with FAT32?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613347200000}
{"reviewTitle":"The unit I received did not have an ACTIVITY INDICATOR LAMP","reviewDescription":"I am not sure if the unit I received was defective or if the lamp was removed from the design.  Either way this is not acceptable to me and I returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"Its the wrong product","reviewDescription":"I ordered the USB 3.0 with 64 GB and on the outside that is what it appears to be. The packaging, case and serial number are all for the product I ordered. But as soon as I plugged it in and looked at the properties it said that it only had 32GB and was actually USB 3.2. this does mean its faster but its not really noticeable because most computers only have USB 3.0 on the front panel and the loss of half the storage that I paid for means that I cant use it for the reason I purchased it in the first place.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611100800000}
{"reviewTitle":"ONLY HAS 460 GB AVAILABLE!!!","reviewDescription":"It works and is fast but it only has 460 gb even though I bought the 512gb version","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"the scan disk working","reviewDescription":"the scan disk does not have any instructions or data.... I put it into my windows 8 .. and the device did not install a 4GB file.. then I troubleshoot it and it was fat32 .. so I had to format it correctly and I put 4GB file  into the scan disk ..correctly ..so I had to format it to NTFS ....","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1637020800000}
{"reviewTitle":"Inconsistently recognized","reviewDescription":"The drive has great capacity, but fails at the primary task I bought it for.  I needed a larger USB to store video files to play on my TV.  Problem is that the drive will work, but once you turn the TV off, about 90+% of the time you have to unplug it and plug it back in.  I replaced this with a Kingston USB and have had no issues with it at all, so it's the drive, not the TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618617600000}
{"reviewTitle":"Not 512GB","reviewDescription":"It has a lot of storage,  that's the only reason for 2 stars.Not fast at all. After their stuff on it there is only 460GB left.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1665187200000}
{"reviewTitle":"Finicky with Xbox Series X","reviewDescription":"Sometimes, it works. Sometimes, it doesn't.It might be more reliable with a PC or something, but I bought them to use with the Xbox, and it's not going so well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651708800000}
{"reviewTitle":"Great....Until it wasn't","reviewDescription":"Used for movies in my car (for passengers) and for watching during flights and other travel. Excellent capacity and portability. However, it simply stopped working - transferring files, and ultimately would not allow my mac utility to erase it at all.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643932800000}
{"reviewTitle":"Works so far but gets too hot to last.","reviewDescription":"Confirm others complaint about over heating. Not sure it will last with the high temperature. Intermittent lose of access when used with iPhone camera adapter. So far has always recovered by disconnect and reconnect, seems to have better heat dissipation when plugged into computer but still gets hotter than I would expect for an electronic device.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624752000000}
{"reviewTitle":"Does its job","reviewDescription":"Works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Excellent drive","reviewDescription":"Drive is fast and reliable with download speeds consistently running at 60-70mb\/sec.  Highly recommend this drive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"The sliding mechanism for sliding the connector in and out does not hold it in very well","reviewDescription":"I use the flash drive as a rescue tool for Windows machines. It's on my keyring all the time. when you pull the connector into the storage position it doesn't really lock into place and will come out in your pocket. I don't know that this will be an issue in the future but it's annoying and could lead to damage which may not let you plug it in. Other than that it has worked fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696032000000}
{"reviewTitle":"Advertised capacity is not available capacity","reviewDescription":"In emails exchanged with SanDisk, they wrote:\"A portion of the total capacity is used to store certain functions including optimizations of the memory that support performance and endurance and therefore is not available for user storage. This is disclosed on our packaging and marketing materials when you see the statement \"Actual user storage less.\"\"On a 64 GB USB drive, available capacity is 61,509,107,712 bytes.Further, SanDisk defines 1GB differently than does Microsoft: Operating systems define a 1GB as 1,073,741,824 Bytes. SanDisk defines 1GB as 1,000,000,00 bytes.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Easy to use","reviewDescription":"Good amount of storage and an easy to use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Decent storage for price","reviewDescription":"Decent storage for price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Not 512 GB. Not even 500 GB. Is 494 GB unformatted.","reviewDescription":"Yes, I understand the difference between GB (gigabytes) and GiB (gibibytes) and the difference between raw unformatted capacity and formatted capacity.This flash drive, for me, shows a raw unformatted capacity of 494,206,451,712 bytes or 494.2 GB. Since 512 GB should be 512,000,000,000 bytes, 3.5% of the promised capacity is missing.I'm still giving it 4\/5 stars, though, because it works great, doesn't run hot, was inexpensive, and lives up to its promised speed rating (although I have seen throttling when doing sustained writes in a speed test, but that's to be expected). And while a loss of 3.5% is annoying, isn't enough for me to get angry and return it. Sometimes bad blocks are locked out at the factory, and perhaps this disk had an unusual number of them. That being said, it should never have passed quality control, in my opinion.In comparison, I have a 12 TB Western Digital Elements disk that shows an unformatted capacity of 12,000,105,070,592 bytes (0.00088% more than promised), a 128 GB SanDisk Cruzer Glide that shows an unformatted capacity of 128,043,712,512 bytes (0.034% more than promised), and a 64 GB SanDisk Cruzer Fit that shows an unformatted capacity of 63,065,554,944 bytes (1.46% less than promised).Operating system: MacOS 11 Big Sur.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1612656000000}
{"reviewTitle":"Wish they didn't have the curved tail","reviewDescription":"I've had absolutely no problem with these drives. I just wish they were flat so they would fit better in tight spaces.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Good value, but slow, compared to others in 2023","reviewDescription":"Good for inexpensive storage.But it is not up to modern standards in two ways:1) Speed is relatively slow.2) Design is outdated and wider than it has to be, so the case interferes with some devices and port covers.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Using for Replacements","reviewDescription":"I haven't tried these yet, but I'm familiar with brand and bought again.  Needed to replace some older flash drives that were acting up by retrieving.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Warning, do not buy","reviewDescription":"I only used this flash drive once and then had it sitting my my drawer where I keep all my flash drives for a couple months and then when I went to use it again none of my pc's could read it, and when I tried to format it it would give me a \"this disk is read only\" error. After searching on the internet for a solution I found that Sandisk has been having this problem a lot. It is an non-fixable defect.  The thing is useless now. I paid more for this USB because I thought I was getting better quality buying a Sandisk, but I will not be buying from them again. Pisses me off!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"POS FAKE USB FLASH DRIVE DO NOT BUY","reviewDescription":"This drive CANNOT BE formatted or used as is.Ex-FAT does not work, I tried formatting the drive:format D: \/FS:NTFS \/L:disable \/A:512The formatting never finishes and you get a message that the drive must be formatted before use.IT'S A POS.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Not as advertised","reviewDescription":"Packaging and even the label ON THE PRODUCT says 128GB, but once opened and inserted into a PC, only 32GB available to use. Originally I was going to keep it and use it, but after thinking about it. Giving me a product which is missing 96GB of space on it, I felt too ripped off to keep it. I returned it today for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"File too large for destination file system","reviewDescription":"Able to copy some stuff to the drive, other times gives me an error. The file system it uses has problems and I don't feel like figuring out how to re-format a USB thumb stick, should be done already at the factory. Junk","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"false advertising","reviewDescription":"says its 512 gb but when i plugged it in it was only 460","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"I can use only one of them","reviewDescription":"I cant use one of my usb drive. It was write protected. And I couldnt solve the problemI wanted to return(i need to return both of them By return policy). Unfortunately, I need one of them now. As a result i feel like scamed. I","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Garbage","reviewDescription":"The product I purchased was advertised to be 64GB per stick. Windows shows this is correct (after you account for how they calculate this number, it's 50-something GBs). However, each stick shows as full (will not accept more files) at about 30GB full! Windows shows ~30GB free, but when you drag a file to the drive, it will tell you there is no more room. I'm not sure what's going on here, but these drives are garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Extremely slow over 10 minutes to copy 1.13GB on it MORE like USB1.0","reviewDescription":"Extremely slow over 10 minutes to copy 1.13GB on it MORE like USB1.0","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Will break!","reviewDescription":"Had this flash drive less than a week and now it won’t let me transfer files to or from it. Also now has personal information on it so I’m not going to send it back to get a replacement like Amazon requires. Don’t waste your money on the 512 gb.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Legit version is great, but....","reviewDescription":"The legit version of this stick is great and has reliable speeds. The problem is apparently amazon sorts products by mfg code not vendor. So when ordering stuff like this you are just as likely to get a fake with a copied mfg someone sent in as a legit version. It took me 3 trys to get a legit 256 gig stick. The fakes I got looked legit and had a firmware that tricks windows or whatever into thinking it had 240+ gigs but when tested with h2testw they only had 16 gigs of storage that didnt error. Unless you're willing to return and exchange with amazon for a month or 2 I would not recommend buying any popular brand name flash storage medium over 128 gigs on amazon. Always make sure you test any flash drive or sd card with h2testw to make sure it actually has the space and speeds its supposed too before you try to use it for something important.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1673395200000}
{"reviewTitle":"Good USB Drive","reviewDescription":"Stores a lot","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Quality good.","reviewDescription":"Product works well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Great purchase","reviewDescription":"Fit my needs","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Pen drive","reviewDescription":"Excelente 👍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great price for multi-pack!","reviewDescription":"Great price!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"works","reviewDescription":"Works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Works great","reviewDescription":"I’ve had no issues with this. Works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Great product","reviewDescription":"Whenever i need flash drives  scandisk products are first on my  list.  Works great never have any problems!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Secure storage","reviewDescription":"It's a great space for password protected storage.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Storage for safety","reviewDescription":"Got this to keep a few important documents on. Easy to transfer files, fast for the price, and it doesn’t feel horribly cheap. Works well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Temperamental","reviewDescription":"Do not usually have problems with USBs but this one randomly stops working\/being recognised by the mac. Not sure if its because it is 500+gbs. Also did not work at all in a windows pc. It is notable that it is never recognised in a non-powered anker usb adapter but works in a powered one (albeit temperamentally) - I am wondering if it needs more power due to the size?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United Kingdom","date":1716163200000}
{"reviewTitle":"Runs hot during long writing","reviewDescription":"If you want to buy a flash drive just to do some daily work then it's fine for the price, but it can't handle large files and long writing times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1723420800000}
{"reviewTitle":"Enttäuschend","reviewDescription":"Kauf von 2 Flash-Laufwerken im Dezember 2021, Kapazität 512 GB. Erstes Flash-Laufwerk defekt im April 2024. Kundenservice von SanDisk (Western-Digital) nicht erreichbar. Umtausch durch Amazon problemlos, dafür ein besonderes Lob. Übertragungsraten grottenschlecht, gerade mal 10% des angegebenen Wertes von \"bis zu 130 MB\/s\", Für Sicherung wichtiger Daten nicht zu empfehlen.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Germany","date":1712534400000}
{"reviewTitle":"Problemi supporto","reviewDescription":"Ho inziato da poco ad utilizzare una delle tre chiavette ma continua a scollegarsi; inoltre, ogni volta che la inserisco nella porta USB, il sistema operativo mi dice che ci sono problemi sull'unità.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Italy","date":1718841600000}
{"reviewTitle":"Hab einen 512 GB gekauft und es NUR 460 GB verfügbar","reviewDescription":"Hab einen 512 GB gekauft und steht auch auf der Verpackung drauf ABER es NUR 460 GB verfügbar !! Siehe Bilder Video","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Germany","date":1708905600000}
{"reviewTitle":"May have some compatiliby issue when using between linux, windows 10 or windows 11.","reviewDescription":"After  the usb drive formmated as NTFS in Windows 10,  the usb drive is written with Ubuntu Linux tool with160GB of data it takes about 4hours.  Then the usb drive failed to be detected properly with Windows 11.I did not investigate further.  I just reformatted the drive in windows 11 and it works properly now.Really do not know the rootcause, so I have cautiously using the usb drive ...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1689465600000}
{"reviewTitle":"Very very slow to save files","reviewDescription":"I liked the idea of having this much storage in a flash drive and I was glad that I could encrypt the files.  However, this flash drive is very, very slow when it comes to saving files.  I assume that this is due to the encryption process but it takes up to 4 minutes when I copy files onto it before it is ready to use again.  These were not large files (all less than 2 mb each).  I get worried when I see the \"Not Responding\" message going on for so long.Also, copying and pasting files to this flash drive is very clumsy.  The copy and paste and cut and paste icons don't seem to work.  I have to drag files onto the flash drive.I will go back to Verbatim even though the largest size I can find with them is 256 GB.  It also had encryption and did not take nearly the amount of time that this one does.Unfortunately I have already thrown away the package and so I won't be able to return this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1611360000000}
{"reviewTitle":"Write protected with bloatware","reviewDescription":"I could not unprotected it without buying bloatware.  To solve the problem use DISKPART. LIST VOLUME, SELECT VOLUME, FORMAT.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Canada","date":1705017600000}
{"reviewTitle":"Dispositivo da 512 GB, velocità in scrittura del tutto inadeguata.","reviewDescription":"Pagata 86,90€. Quando tolta dalla confezione la PenDrive, arrivata rapidamente come consuetudine Amazon, si presenta interamente in plastica di buona qualità, almeno così sembra. Anche il meccanismo di apertura e chiusura appare ben fatto ed è facile usarlo con una mano sola. Quando aperto risulta fermato in modo tale da non aver problemi nell’inserimento del dispositivo in una presa USB. Non manca un led dalla luce poco invadente che ne segnala il funzionamento. La PenDrive arriva formattata dal produttore con FAT32 ed è presente un programma di crittografia e le relative istruzioni. Sulla parte frontale della confezione viene indicata, in modo ben visibile, la velocità di lettura che il costruttore dichiara fino a 130 MB\/s, quanto riportato sul retro, con caratteri veramente molto piccoli, permette di calcolare, sempre secondo il costruttore, la velocità di scrittura che arriverebbe a 10 volte la velocità standard usb 2.0 di 4MB\/s, cioè fino a 40 MB\/s.Purtroppo le effettive caratteristiche della parte elettronica sono assolutamente inadeguate: la velocità di scrittura di un file di grandi dimensioni (2,8 GB) supera di poco i 16MB\/s ovvero circa il 41% di quanto dichiarato, mentre in lettura risulta essere inferiore, anche se di poco, ai 100 MB\/s. La prova è stata eseguita più volte su presa USB 3.0 di un computer dotato di SSD con la PenDrive vuota. Sullo stesso computer, sulla stessa presa e con lo stesso file, una PenDrive Patriot Supersonic, di analoga capacità e prezzo, superava gli 80 GB\/s in scrittura e i 250 GB\/s in lettura. Data la capienza del dispositivo riempirlo, quando vuoto, con file di grandi dimensioni (lo scenario più favorevole) richiederebbe circa 9 ore, posto che riempiendosi le prestazioni non degradino. Non oso immaginare quanti giorni o settimane ci possano volere se i file sono di dimensioni più contenute.Per quanto mi riguarda è bocciata. Ho effettuato il reso.Kuhn Rath","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Italy","date":1601942400000}
{"reviewTitle":"Well theres lots of storage. Just not fast.","reviewDescription":"It was on sale when i bought it. Needed a large capacity usb drive and the supposed fast write speed convinced me to buy it.  It does have great read speeds, but if your writing to the usb drive and your file is bigger than 1 gig this is no better than usb ver 2.0. The first gig of your file transfer will be 60\/ mbs per sec, then it quickly drops off to 20 \/ mbs after that.Dont ask me to explain but after about 50 write erase write new data cycles it seem to be getting a faster. I have no reason for why that should happen.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"Canada","date":1657843200000}
{"reviewTitle":"One major issue with this design","reviewDescription":"As far as digital operation goes these have been fantastic.  Problem is the wide stick design.  These will not fit side by side in most USB hubs or computers.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Good storage, super fast...","reviewDescription":"Good storage, super fast, a little pricy...don't like the shape or the push to expose the USB for insertion.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Great USB for daily use, size could be better.","reviewDescription":"I recently bought the SanDisk 64GB 2-Pack Ultra USB 3.0 Flash Drives, and I'm quite satisfied with their performance. The speed is impressive—file transfers are quick and efficient, which is exactly what I need for backing up large files and moving data between devices. The USB 3.0 technology definitely makes a noticeable difference compared to older models.However, I did find the size of these flash drives to be a bit bulkier than necessary. While they still fit into USB ports without issue, their slightly larger size can be cumbersome when using adjacent ports or packing them into a tight space. Despite this, the overall quality and speed of the SanDisk Ultra USB 3.0 Flash Drives make them a reliable choice for anyone needing dependable storage solutions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Plastic","reviewDescription":"Good product - note plastic is cheap the hole for my lanyard broke relatively quickly on this","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Fit description","reviewDescription":"Functional and works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"decent storage","reviewDescription":"I works ok but did not write as fast as I thought it should","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Missing data","reviewDescription":"Missing like 54gb but other than that its a really good hardrive.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"SanDisk 32GB Ultra","reviewDescription":"The product is as advertised and came in nice packaging. The drive performs as promised. I chose this drive because it had a lot of good reviews. The company ensures my data is safe and has the space needed to save my files and documents.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Just what I needed","reviewDescription":"The bundle was at a pretty good discount when I bought it, I haven’t got an issue, good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"They work","reviewDescription":"Yep they work. The price at the time I bought them was convenient.  I recommend them","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Scan disk","reviewDescription":"Received and using. Nothing to compare these with. They were just as shown.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Works great!","reviewDescription":"I have reordered these USB3 sticks more than once because they are so dependable.  Out of perhaps 20 Sandisk sticks, only one has ever failed, and that was one of the older USB2 32 GB stick that had the LED activity light.The ONLY thing I don't like is that Sandisk apparently has stopped providing the internal LED that visibly shows disk activity.  If, for instance, Windows Defender is scanning your usbstick to delete Potentially Unwanted Programs (their opinion!)  that you really want to keep, the LED will remind you to Exclude the usbstick from scanning.  I gave it only 4 stars as a message to Sandisk.Does having an LED activity light cause premature failure??? Inquiring minds want to know ...Well, this USB3 Ultra [without LED] is a good buy. I will still purchase more as needed.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Good, but not without problems.","reviewDescription":"I've now had 3 of the SanDisk Ultra USB 3.0 Flash Drives become corrupted and unusable to the extent that a computer will not even recognize them.  That's really disappointing.  At the same time I have a bunch of these floating around the house, office, workshop and car.  Overall they seem to be fairly good and have a good read \/ write speed.  It's just that every once in a while one with just die.  They're still better than some of the cheap USB sticks I've had, or used, over the years.  Isn't just an annoyance when one dies, and it never happens at a good time.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Sustained random write speed is ~8.3 MB\/s; read is ~100 MB\/s","reviewDescription":"It might make for a good backup medium if you run your backups in the background so you don't get distracted by the speed. I used up 253 GB of this drive with a backup and at least verified that it's not a false-capacity scam like most of the cheaper drives on various major websites. It took 8 hours and 37 minutes to complete the backup, hence the random write speed estimate in this review's headline, but it's vastly slower at writing small files (Windows reported <1 MB\/sec) and faster for large ones (Windows reported >60 MB\/sec). I ran my backup and supplementary tests by copying files to and from my insanely fast M.2 SSD (ADATA XPG SX8100, benchmarked around 1 GB\/sec write and 1.8 GB\/sec read).Unless maybe you're reading this 5 years after I wrote it, you may as well just get an average 1 TB portable spinning disk drive for any short-term storage\/between-locations transfers, but the relative longevity of flash memory (as long as you don't write to them often) makes this a decent option for slow backups. This drive would also be fine for write-once, read-many-times needs, especially in cases that your write speed is throttled anyway (e.g. if you're downloading straight to this USB drive from a <500 Mbit\/s network).","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1636156800000}
{"reviewTitle":"Good","reviewDescription":"I needed one of these so i can back up the Sims 4 just in case my computer breaks or something. I didn't try copying the game yet (it's like 16 gb because of all my mods lol) but I did test it with a bunch of random pictures and it seems to work fast enough for me. (20 pictures only took like 5 seconds)Will probably take long to move 16gb but that's to be expected.Only complaint is after testing and removing it (only used for a few minutes) the metal USB part was very hot, hotter than other usbs I've used.But I think it'll be fine if I'm just using it to store some files.I ordered the 64 gb and the actual usable storage on it was about 57gb. That's understandable though. So if you need a certain amount of gb, always buy a larger storage amount just in case.Anyway, if you need a USB that's affordable and decent, this is for you. If you want something more high quality, find something more expensive.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676678400000}
{"reviewTitle":"BEWARE! Says 512GB But Is Only 460GB","reviewDescription":"I use SanDisk's thumb drive and it's frustrating that they always have less storage than they claim to have: 32GB thumb drive has 29.3, a 256GB thumb drive has only 233 available, etc.Unfortunately this one is no different and the storage discrepancy far worse. 512GB on the package, but only 460GB on the device itself.I know some people will try to claim that this is due to some esoteric (and trivial) difference with how GB's are calculated but that doesn't wash.Everybody knows that when people say \"GB\" they're talking about how much storage will be available when they put it into their laptop or desktop and every company knows how to do that.If SanDisk gave me the item and I claimed to have paid them $45 for it, but they found out afterwards that I only gave them $41, nobody would offer excuses for me if I claimed that it's due to some obscure difference in how money is calculated for amazon, Sandisk and myself -nobody would buy that.I've never had problem with SanDisk products but let's all be honest , this is false labeling and it needs to stop.","isVerified":true,"ratingScore":4,"reviewReaction":"54 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"It worked","reviewDescription":"The drive wouldn’t mount when I inserted it into a copier\/printer at my local FedEx Office, I had to use their computer to print files from the drive.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Not 128GB","reviewDescription":"I do not why It has 114GB when it must be 128GB","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"SansDisk Flash Drives","reviewDescription":"These flash drives are very easy to use. My only complaint is that I wish there was some color variation between their various flash drives with a larger storage capacity.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Not 256 GB","reviewDescription":"When I opened the drive it stated 232.8 GB capacity.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"These are FAT32 formats and not NTFS - 4 Gig transfer limit","reviewDescription":"I didn't know these were FAT32 formats, which have a limit of 4 gig for file transfers.  This format dates back to Windows 95.  If you have a lot of small files to backup, no problem, but if you are trying to copying anything over 4 gig it will tell you \"No enough space\" even though you might have 45 gig free.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708905600000}
{"reviewTitle":"Couldn't write to USB on Windows 11","reviewDescription":"On Windows 11 I had no choice but to encrypt these USB disks with Bitlocker. After I did that I was unable to write anything to these disks because it said they were write protected. I am aware this may not be an issue with these USB drives but could be a Windows 11 issue, but I dug around and it seems like others have had issues with BitLocker. Just wanted to post as a heads up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Trash == dog droppings","reviewDescription":"Keeps burning up running a gnu\/linux os","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"2 drives damaged beyond use","reviewDescription":"There were 3 in the package\/envelope. The package was damaged and 2 of the drives were bent so badly they would not insert in to my laptop.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"NO GOOD!!!","reviewDescription":"Completely unable to use this flash drive!  Forced to download software, installed it, drive won't even open now.  VERY DISAPPOINTED:  previous experiences with SanDisk were good, so that is why I chose it.  USELESS.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Failed after only 30 days.","reviewDescription":"Failed after only 30 Days.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"It's not a 128 GB. There's only 115. What a rip off","reviewDescription":"I didn't like anything about it. What I dislike instead, it was not a 128 GB. It was only a hundred and fifteen. It's not a quality flash drive joke.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Unable to use the secure feature","reviewDescription":"I have always used SanDisk USB drives to backup my work because of the security features and always been very satisfied with their performance.  I purchased these drives with the same expectation, but I will be returning them.  On my previous drives, setting my password was very simple.  I selected the RunSanDiskSecure_Win.  On these drives that option is not available.  The only selection available is to Install SanDisk Software, which is a link to their website.  On that website the only option is to download the Private Access software.  But it will not download to my PC and I am unable to download it to the USB Drive.  This is a shame, but I will be looking into other options for a secure drive.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1674777600000}
{"reviewTitle":"slow","reviewDescription":"rediculously slow. Pure junk","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Unusable with Windows 10.","reviewDescription":"Windows 10 cannot see this drive... and I worked through at least 10 solutions. I'm a retired tech, so I am familar with the utilities involved in making this work. It doesn't. Works fine with Linux, so I gave it to my husband. Will not buy Sandisk again, tho","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1711756800000}
{"reviewTitle":"It gets hot","reviewDescription":"This product gets really hot if you leave it connected for long enough.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Compact","reviewDescription":"It performs great as soon as I plug it into my computer it reads it super fast to move archives it looks really nice and stylish","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Works well","reviewDescription":"Cheap plastic, but works as needed","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Good so far","reviewDescription":"Nothing new here, just the results of my initial tests.TL;DR:  Seems genuine, no bad sectors.  Only 460GB, not for people in a hurry.  Verify a SuperSpeed connection.lsusb -v shows:-------------------------------------------  idVendor  0x0781 SanDisk Corp.  idProduct  0x5581 Ultra  iProduct  2  SanDisk 3.2Gen1-------------------------------------------One USB 3 hub  detected this as HighSpeed and another SuperSpeed.  Not sure why, but USB 3 hubs always surprise me.The disk came FAT 32 formatted, with 3 useless files (I don;t do Windows or Mac):-rwxr-xr-x 1 root root  707152 Sep 23  2021 'Install SanDisk Software.exe'-rwxr-xr-x 1 root root  552605 Sep 23  2021 'Install SanDisk Software.dmg'-rwxr-xr-x 1 root root  300509 Sep 23  2021 'SanDisk Software.pdf'I use the Fight Flash Fraud (F3) software to verify my flash devices.  This one checked out well:-------------~ # f3probe \/dev\/sdcF3 probe 8.0Copyright (C) 2010 Digirati Internet LTDA.This is free software; see the source for copying conditions.[...]Good news: The device `\/dev\/sdc' is the real thingDevice geometry:  *Usable* size: 460.27 GB (965246976 blocks)  Announced size: 460.27 GB (965246976 blocks)  Module: 512.00 GB (2^39 Bytes)  Approximate cache size: 0.00 Byte (0 blocks), need-reset=no  Physical block size: 512.00 Byte (2^9 Bytes)Probe time: 2'57\"-------------------------------------As others noted, this only has 460GB usable.  Deceptive marketing.I had not noticed the device was running as HighSpeed, but as others have noted, when writing USB 2 and 3 are about the same.  If took just over 9 hours to fill the thing!----------------------------------------~ # f3write \/mnt\/usb [ ...]Average writing speed: 14.08 MB\/s---------------------------------------Reading it all back showed zero errors, but took almost 3 hours and 30 mins!---------------------------------------Average reading speed: 36.37 MB\/s---------------------------------------So writing as SuperSpeed would not have gone faster.Moving it to a hub that detected this as SuperSpeed read it back in just under 53 min:---------------------------------------Average reading speed: 149.60 MB\/s---------------------------------------The cheap thumbdrives keep calling me, and turn out to be junk.  This is the real deal.","isVerified":true,"ratingScore":4,"reviewReaction":"37 people found this helpful","country":"United States","date":1682726400000}
{"reviewTitle":"Reliable Drives, But Slow Write Speeds and No Activity Light","reviewDescription":"I recently purchased a 3-pack of these SanDisk Ultra 32GB flash drives. They have a nice compact design that slides easily onto a keychain or in a pocket. The USB 3.0 interface means fast data transfer speeds when using USB 3.0 ports.However, I was disappointed to find the write speeds limited to USB 2.0 speeds, even when plugged into USB 3.0 ports. Saving large files seems to crawl compared to reads. There is also no LED activity light, so you don't know when data is transferring.That said, the read speeds are fast, allowing quick access to media and documents. The drives feel well-constructed and sturdy. And you can't beat getting 3 drives for the price.Overall, the drives work reliably and I'd purchase them again for the convenience of having multiple flash drives. But the slow write speeds and lack of activity indicator prevent this from being a 5 star product. I'm taking off 1 star for those shortcomings, so 4 stars from me.","isVerified":true,"ratingScore":4,"reviewReaction":"25 people found this helpful","country":"United States","date":1699833600000}
{"reviewTitle":"These have lots of storage","reviewDescription":"Since my current vehicle doesn’t have a CD player or satellite radio, I wanted to use these to store and play music in the car. All of my CD collection has been converted to mp3 and is stored on a drive with other downloaded music to supply these USB drives for music playing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Casing is like paper, it's so weak. But the storage is good. Don't keep important stuff on it.","reviewDescription":"The casing is super cheap but it's good for OS installs where you only keep it in a one room. A brighter color would be better because it always gets lost. Alsonit comes preloaded with some kind of software, I need a clean fresh USB for OS install so I had to delete all of that, dont know if that harms it or not.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Just own issue","reviewDescription":"I got it just fine. The only issue is that I ordered the 512GB but it came with 480GB instead. It's still a lot so it's fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712966400000}
{"reviewTitle":"Great little USB memory","reviewDescription":"Went to Wal-Mart. They had never heard of a USB key or anything like that. My 72 YO dad was completely clueless as to the matter. Bough this to put Win11 on a new laptop. Success!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Perfect for transporting files.","reviewDescription":"Lots of room and compact.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"The lock doesn’t work","reviewDescription":"Folders can’t be locked & online also lock system is non existent","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"No sirve","reviewDescription":"Me salio mala esta unidad y no la puedo devolver por que vivo en panamáLe pongo un otg para que mi samsung me la lea y no lo haceLo puse en mi PC y tampoco me la reconoceDe verdad me siento engañado","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"NOT 32GB","reviewDescription":"Not 32GB.  Only 28.  Can't be used to create a windows 11 recovery drive!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Junky construction","reviewDescription":"I was pleased with the earlier versions of Cruzers from SanDisk I've used. But these 32 GB Ultra 3.0s are junk. I bought two 3-packs of them, and two of them--with only moderate use--have become mechanically unusable. The USB slide-out connector of one got out of line and was more and more difficult to insert in the slot--until finally it fell out. On the other, the solid bar on one side that ensures correct alignment into the slot moved from tight to the side to out in the middle of the end of the enclosure. After that it wouldn't seat into the slot at all. I had more than 20 Gb of essential data on that thing, and if I hadn't had a duplicate elsewhere the data loss would have been catastrophic. These things are poorly made junk. Avoid.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1666742400000}
{"reviewTitle":"No activity LED, slippery edges","reviewDescription":"Why are USB flash drives so chintzy now? No LED on the drive, you don't know when it's reading\/writing. This one has rounded slippery edges and it always slips out of my hand. The back of it has a flared edge that slips between my fingers. I literally drop it every time. Maybe these are trivial complaints, but they are annoying nonetheless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Not working","reviewDescription":"Not working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Nope","reviewDescription":"It worked for a short while then kept giving me read only error message.  Lost all the data I stored.  All this occurred within months of purchasing it.  Best to spend a bit extra and buy a quality one.  Hopefully the future versions are improved, but for now, it's long-term functionality is an \"L\" for me.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Comes write-protected and can’t remove!","reviewDescription":"I had this issue with my current Sandisk flash drive but thought it was just an issue with my current one so I bought new ones. I tried to put my Ford Sync update on the brand new disk but they come write-protected and despite spending hours Googling how to remove it I’ve had zero luck.  I just need a flash drive to plug in and go without all the fuss.. these are not those!  Returning!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699747200000}
{"reviewTitle":"Misleading","reviewDescription":"The listing, the packaging and even the product all say 128 GB but when you plug it in there is only 32 GB of available storage. Very misleading.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"wow these are slow","reviewDescription":"i can't believe how slow these are. 3.0 is capable of 5 gbps but these get  around 15 mbps which is usb 1.0 speeds 2.0 is at least 25. i would speed the extra and get better","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"512 GB usb drive have 460 gb space","reviewDescription":"Not sure what is occupying 52 gb of space in this 512 gb USB drive as only 460 gb free space is available,","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"This does not have 512 gb of storage. It only has 460 gb of storage.","reviewDescription":"So I do very much like the item. I needed a decent USB for usage in my schooling and this one does the job. The main issue I have with it though is that the one I received did not actually have 512 gb of storage. It only has 460 gb of storage. Which is a far cry from 512 gb of storage. I would have rated this item a 5\/5 if the storage was actually 512 because this genuinely is a good item. But it is lacking 52 gbs of space so I think that this item shouldn't have been falsely advertised in this manner.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1635033600000}
{"reviewTitle":"Really crappy casing and button to open","reviewDescription":"Drive is fine. The case it comes in is really crap. It is cheap thin plastic. The button that you push to advance or retract the USB connector is difficult to work because the plastic itself has no tension - so you can't \"feel\" the button pushing in to \"release\" and can't know when to push it to advance or retract the connector. Its pretty nerve wracking if you have important information on the drive - I never know if I am going to be able to open or close it, or if by trying, I will break the mechanism and won't be able to access my data. I would look for a different manufacturer next time.BTW - it didn't run hot for me.I bought two, and I wish I hadn't. Too nerve-wracking.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1593993600000}
{"reviewTitle":"Works Perfectly (But Fiddly To Plug In)","reviewDescription":"It does exactly what it says it does, and what it should do. Its great. Except that, if you have fumble fingers (I have severe arthritis) it is difficult to hold in a way that doesn't push the plug into the body instead of actually plugging into the computer. It is entirely disability unfriendly, which is a shame because I never had this problem with past versions. If this had some kind of \"lock\" to keep the USB part of the device outside of the body, it would be perfect. This is not hard to design, lots of USB devices have them. I incorrectly assumed this one would have something similar, too. Great buy for someone who can use it, not so much for someone who has weak fingers. Otherwise it would get five stars.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611878400000}
{"reviewTitle":"Slow data transfer","reviewDescription":"This thing transfers data super slow. Even plugged into a USB 3.0 port it will slow down quickly and become ridiculously slow compared to other drives. My guess is it has something built in to limit itself to not overheat. Would not buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"Not true 512GB","reviewDescription":"Only came with 460MB available storage.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684368000000}
{"reviewTitle":"Beware: no LED indicator for drive activity","reviewDescription":"I have 20 or 30 SanDisk products, all of which have performed fine with regard to specs. As USB 3.0 flash drives, these do the job I bought them for: creating USB boot drives for installing system image backups. That's a long job for Windows 10 now that it needs 16GB of space instead of 8GB. I thought these drives would have some type of LED indicator of drive activity, but there's nothing at all to indicate whether the drive is still reading or writing data. Other USB drives I have (A-Data, Kingston, Transcend) all have drive activity LEDs. SanDisk can do better at this price point. Also the plastic around where a lanyard would be attached is too thin.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1615075200000}
{"reviewTitle":"I returned this","reviewDescription":"It may work just fine storing data but I bought it to use with my Blink camera system.  Blink said their system can use 256gb.  But this didn’t work with it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"Cheap plastic housing","reviewDescription":"The device works fine but the body of the device is super cheap and flimsy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"It's a flash drive.","reviewDescription":"Meh. Capacity is what it is, they are never what they are billed to be. Dozens of GB short.Poor design flaw though for using on a keychain. It comes open from the key ring, other keys, and moving it around. What's worse is it closes with much more fuss- you need the button to close but not to open.So now this thing is open all the time, begging the question of why make it retractable if it cant stay tucked away?Not sure I would buy this again and would definitely not recommend for someone who plans on carrying it on their keys.Otherwise it performs basic cursory functions of a flash thumb drive.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1611446400000}
{"reviewTitle":"Who'da Thunk It","reviewDescription":"Once upon a time 256Mb was considered pretty good for a thumb drive.  Now you get 256Gb for even less!  I used these to share converted home video with family members.  Speed is sufficient for streaming, a little slow for copying.  I would like to see more thumb drives with USB C plugs instead of USB A.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Reliable","reviewDescription":"Works fine right out of the packaging.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"good value","reviewDescription":"I bought these to use in place of 1 GB drives for the additional space. These worked very well as I use them to record from vhs tapes to digital format. I am doing this to preserve family get togethers, trips and weddings over the years. Also you can't buy a new VHS machine anymore or at a decent price if you can find one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Usb","reviewDescription":"Great size and value for it. Sadly the metal part of the usb gets hot really fast.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Great","reviewDescription":"Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Useful item","reviewDescription":"Works well for what I intended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Engineering supplies","reviewDescription":"Just what my son in high school needed! Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Works great on Smart TV","reviewDescription":"Bought this after two cheaper ones would not work for pausing live TV. Spend the extra buck or two and get this one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Functions as expected","reviewDescription":"Purchased for granddaughter to take to college with her in the fall.  Liked the gigs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Good for xbox game capture","reviewDescription":"I set my xbox to save clips and recordings here and works good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
