{"reviewTitle":".","reviewDescription":"Nice product.  But the mounting disk that comes with it. The double sided tape is not worth trying to stick. It unsticks within an hour after installation. Even after iI prepaired the surface with rubbing alcohol. I ultimately scraped off the double sided that came on the disk. And replaced it with 3M red double sided tape. Now the mounting disk works great.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1715990400000}
{"reviewTitle":"Suction cup melted to the window","reviewDescription":"Holds really good until it gets hot inside my pickup. The suction cup has melted and started to slide down the window.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Disappointed that it won’t stay on dash.","reviewDescription":"I bought this because it sounded like it would stick on the dashboard well. However it doesn’t stay stuck on my dashboard.It does stay well on the glass though.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"hot climate... dont stick","reviewDescription":"i live in hemet ca.... HOT... in summer... can be 110...this just slides off the window... i even have a plastic disk on my dast.... in the heat... it falls off...and leaves a sticky mess.but i use the vent clip and it is ok... it works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Disappointed with enduring quality","reviewDescription":"I purchased this item in June of 2023 so exactly a year ago. It worked fine for most of that time no problem. But in November of 2023 I purchased a Z Fold 5 which doesn't fit in the holder so I stopped using it since so i didn'tthunk about it much. Then yesterday I climb into my car. It was exceptional heat for Michigan 92 degrees and I find it broken on the dash. Just from one hot day? That was disappointing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Suction cup no longer works","reviewDescription":"Like the product, but suction cup no longer works","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"VICSEED Phone Holders for Your Car doesn't stick nicely yet mounts on vent ok;","reviewDescription":"VICSEED Phone Holders for Your Car I tried both the 3M pad and main sticky end for the dashboard mount and didn't stuck well enough. So now I am using the vent mount. It works ok, but if you have a heavy phone case it will make the mount tilt down so I'm constantly lifting my phone up, constantly; Its ok but nothing special about this one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Not too bad","reviewDescription":"This isn't too bad. I use the grip that goes on your vents, and it holds the way it's supposed to. It's a little loose but works the way it should.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Didn't stick to dashboard","reviewDescription":"I tried both thr 3M pad and main sticky end for thr dashboard mount and neither stuck. So now I am using thr vent mount.  It works ok, but if you have a heavy phone case it will make thr mount tilt down so I'm constantly lifting my phone up.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"\"I Got The Batch With  A Product That Got Away From Quality\/ COSTUMER SERVICE RATING\"","reviewDescription":"As my product review with the first order, company did reply back to make things right which I really appreciate. They sent me a free disk phone holder to try and I am very thankful for all effort and great costumer care they showed me. They do really care about the impact of their products to valued costumers.I apologize for the long rating, the 2nd one provided to me worked for awhile... couldn't really figure out why it falls after being put in the disk slot for at least few days... I enjoyed the moments I've used it, it is very cool. Again very sorry for any inconvenient I have cost as a costumer but I will be only rating costumer care service, effort of the company, great communication\/ response....Didn't do what the advertising claimed.... Suction is badly poor👎🏽👎🏽 Waste of my money 💰 💰 \"1 STAR FROM ME!!!!\" I ordered new Suction to replace the bad batch i got!!! Yeah! Yeah! Yeah! I learned alot from working in plastic manufacturing on how business works for 8 years from being a temp employee to becoming the 3rd shift Quality Lead. I bought this around the beginning of this year⏳. I belive🤔. Instead of returning it, I just went ahead and kept it and try to fix it ourselves🤳🏽🧲 Then we forgot all about it for quite awhile⏱ I was just going through my history then I saw this🤔 I'm  only sharing my experienced with this product📦","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1589068800000}
{"reviewTitle":"Sturdy, but....","reviewDescription":"I bought this to install it on the dash of my 2024 Honda Accord. The dash doesn't have a lot of flat real estate to work with and it's not a smooth surface. The instructions call for waiting 24 hours before using the phone holder after attaching the holder to the base. I waited longer and could tell it wasn't going to work. The base never stuck good to the dash surface.The remaining options are using the suction cup to attach it to the windshield (don't want to do that) or use the included clip to attach it to the A\/C vent.  The problem is that that's not on Hondas. So, I ended up using it on the cup holder which is not desirable, but the only viable option I have other than buying another holder and trashing this one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"2nd time, Not a charm","reviewDescription":"I had the older version of this mount. So when I needed a new one, of course I went back to this mount because me, my husband, and my son all have it and love it. But this one DOES NOT STICK to the dashboard of my Mazda. Even the 3M disk mount attachment doesn't stick. It's very disappointing. I had high hopes and this just isn't it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Does not stick very well and suction is poor also","reviewDescription":"I only gave this 2 stars because Does not stick. Suction not great either. Pretty color, matches pic. Hold phone tight. Easy release.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"One side will not expand out.","reviewDescription":"Almost a waste of money.  It does stick to my dash though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"La inconformidad","reviewDescription":"No siempre lo que publican  con los artículos  es sierto","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"I wanted to loved it, but","reviewDescription":"This is a very well made product and I really wanted to love it, but it was a miserable failure. I followed all directions for installation to a tee and waited 72 hours before attempting to use it. After applying the device to the suction cup plate, I waited another hour before trying to place my phone into the holderImmediately my phone and the device crashed to the floor of my vehicle. After several more attempts I have given up and will be returning it for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"adhesive does not work","reviewDescription":"Mounting the phone gives us hands free media and is visible to see. Does not stay adhered to dash.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Won’t Hold","reviewDescription":"Dash mount","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Quality","reviewDescription":"I had bought it 2 years back and i was thinking such products should be fine for few years. But unfortunately  its not holding on to the dashboard any more and comes off easily ... may be the sticky suction part has gone off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Hard to find space for it in small car fo it to stick","reviewDescription":"Difficult to finger a space for it in my small car .  When I did attach it, it did not stay attached.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"*UPDATE*","reviewDescription":"*Update* it says my phone is compatible (iPhone 12) but seems too heavy for the hardware. The round plastic knob broke and my phone is always tilted down. Didn’t want to have to purchase an entire new mount so I messaged the seller about purchasing a replacement part and have not heard back. Changed my rating because of this! I’ll be looking into another more durable mount.So after following instructions: cleaning dash with alcohol, letting it dry, sticking dash pad & leaving it for 72hrs … the phone and mount came falling down. The dash pad did not stick! However I have it suctioned to my windshield and the suction is good so far, it’s been about a month. I bought this with the intention of using it on the dash so there’s some disappointment there, other than that I like the way my phone is secure in the mount and I have the option to use the vent clip if needed. That deserves 4\/5 stars alone, however the seller should consider giving more than one dash pad cause once it falls off it cannot be reused only purchased and that feels a little unfair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625184000000}
{"reviewTitle":"Half of it is good","reviewDescription":"I have a 2017 Hyundai Santa Fe Sport.  Tried to use the dashboard mount.  Cleaned the dashboard, applied the adhesive part more than 24 hours in advance.  Attached the suction part and it fell off.  Adhesive was completely useless.  Dashboard isn't completely smooth but it's probably pretty common.  As soon as the part that is supposed to adhesive to the dashboard came off, I touched it, wasn't adhesive at all.The good part is they include a piece that will connect to your vents.  That piece works great.  It clamps down on the vents and holds the phone securely.  Just seems that the product could be a third of the cost if you could just buy the vent piece.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"Doesn’t hold suction","reviewDescription":"Works well & well made but too heavy with a phone  it falls off a lot maybe because of the summer heat. I also used Alien tape to help secure it but it still fell off.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"NOTH WORTH THE PRICE","reviewDescription":"Doesn't work as claimed. It is loose when I use the vent clamp, wiggles too much. The dash piece is unusable, and yes I put it on a clean flat surface. I've given it a try for a couple of weeks too. Would return but it's such a hassle. I'm sick of Amazon and barely use any services anymore. Most drivers are incompetent and lazy too. I'll probably give it away and find a better one. I DO NOT RECOMMEND.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Consider the heat!","reviewDescription":"Bought this product March 23rd of this year, needed something to keep my husband's hands on the steering wheel. It worked very well at first, great suction, good handle on the phone, great for the drives. Summer came around and because of the heat, the adhesive on the suction didn't work anymore, without it, the suction didn't seem that great either. Our stand fell from our dashboard twice and figured we couldn't keep it anymore.It did great for the time being, but figured the heat wouldn't be too bad, there's hotter places out there and California weather isn't that bad. Our parking has a roof, so I didn't think we would have to worry about the adhesive wearing off much. With all these issues, 3 stars seems appropriate, should've lasted more than 4 months I think $24 was too much for just a short time. If the weather is better where you are and doesn't get as hot as Los Angeles weather, then this may be perfect.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628121600000}
{"reviewTitle":"Florida sun","reviewDescription":"The sun destroyed the gummy base. It melted over time. Purchased 2021","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Suction did not work!","reviewDescription":"The suction did not work so I had to put it in my cup holder which was not comfortable to use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Too hot for this product","reviewDescription":"I live in Phoenix, AZ and the outside temperature gets as high as 117°. This is a very nice product, very durable and solid; but here in Arizona, it doesn't work. Thank you.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Window mount fails in hot climates.  Leaks fluid when left in sunny area.","reviewDescription":"Installed on F-150 and it fails to handle the Texas sun.  Sun has caused the suction portion to fail and the fluid in the window attachment leaks.  Do not recommend in these conditions.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690588800000}
{"reviewTitle":"Great for a minute","reviewDescription":"Worked dash sticker worked well for maybe a month. Then it only half stuck and continued to hang lower and lower.The vent clip was okay but I didn't like that it covered the whole vent.Reached out to customer support and was notified 12hrs I'd hear something over 24hrs later and nothing.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"My Everyday Driving Companion! 🚗📱","reviewDescription":"I've had the VICSEED Universal Phone Mount for Car in my vehicle for a few months now, and it's become an integral part of my daily driving routine. I'd like to share my personal experience with this product.From the moment I installed it, I was impressed. The mount securely holds my smartphone, no matter its size or the case it's in. It's such a relief not to worry about my phone slipping or falling, even when I'm navigating rough roads.What stands out the most is the build quality. This mount feels solid and dependable. It doesn't wiggle or shake during my drives, offering a stable platform for my phone.Setting it up was surprisingly simple. The suction cup adheres firmly to my dashboard, and the adjustable arm allows me to find the perfect viewing angle. Once it's set, it stays in place, requiring minimal adjustment.The 360-degree rotation feature is a handy touch. It's effortless to switch between landscape and portrait mode, and the quick-release button makes inserting and removing my phone a breeze.In short, the VICSEED Universal Phone Mount for Car has genuinely enhanced my driving experience. It keeps my phone accessible for GPS navigation and hands-free calls while ensuring safety on the road.If you're on the hunt for a reliable car phone mount, I wholeheartedly recommend giving this one a shot. It's made a world of difference in my daily commute, and I can't imagine driving without it now.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Great holder","reviewDescription":"This phone holder is great.  Holds phone snuggly and adjusts to different sizes. I used the vent attachment. Quality is very good.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"3 years and still there","reviewDescription":"Very solid mount with good adjustment capability. It holds my phone very securely and releases easily when taking the phone out. Gave it 4 stars since if there's no phone in it, its internals can rattle a bit.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"nice phone holder, great customer service","reviewDescription":"This phone holder works pretty good. Two options, #1: suction cup for the wind shield. works well, #2: a clip for an air vent. Unlike others I have had this one has a nut on to really clamp onto the air vent grid. It works very well and the phone stays put.The phone holder has a 1\/2\" plastic nut to clamp the phone holder to the suction cup or the air vent holder. Watch it because  it can get lost if you don't pay attention. I didn't and lost mine. I messaged the vendor to see if I could just buy a nut. They offered to send me two no charge. They were out initially, but two weeks later they arrived. Very quick response all along. Hard to find vendors with such an excellent customer service team. I was impressed since it is so rare.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Must have!","reviewDescription":"Have had mine for years, and have repurchased for my whole family. Very sturdy, and easy to use. For our vehicles allows you to put it in the perfect places, too where you can easily use GPS and it is not distracting or too far out of the eye sight. Absolutely recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"very well built","reviewDescription":"I like how strong the suction is.  I put it on my golf cart and it never moves.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Bought 2021","reviewDescription":"I used this in the vent and have an iPhone 12 max pro this held up till today. Well worth the money about to get a new one. (I am hard on my car mounts) I live in the PNW I never used the suction part.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Cell phone holder","reviewDescription":"This is my favorite  as it holds larger phones good quality and can use on the dash in the window or on a vent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Amazing !!","reviewDescription":"Its great, it holds the phone perfectly. Also its stays steady it doesn’t move. Perfect for long road trips. The glue holds very strongly. I will say its a great satisfying purchase. I recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Всё 👍","reviewDescription":"Всем доволен 😊","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Worked for a week or two then it broke","reviewDescription":"I used this for a little bit then the part that sticks broke and will not reconnect so now im forced to use the vent mount which blocks a lot of the air flow in my car.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606089600000}
{"reviewTitle":"Suction cup adhesive melted","reviewDescription":"Adhesive for suction cup ended up melting after 1 year mounted to windshield.Suction cup will not hold without adhesive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641772800000}
{"reviewTitle":"Worked till it didn't","reviewDescription":"Stopped sticking after a year or so.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661385600000}
{"reviewTitle":"Cheap","reviewDescription":"Doesn't fit with a pop socket on the back and the circle thing on the back broke the secondI put the sucker together.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620864000000}
{"reviewTitle":"Doesn't hold up well over time","reviewDescription":"I bought this is February and five months later it is already coming off of the dash. My car is mostly kept in a garage and the adhesion that keeps the round disc mounted is already halfway off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595980800000}
{"reviewTitle":"It was ok for about two weeks","reviewDescription":"It was ok to use until the glue on the base dried out. I like in Florida where the sun can be brutal, once the base losses its suction ability the gadget becomes useless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1605312000000}
{"reviewTitle":"Doesn't keep suction\/adherence","reviewDescription":"Unfortunately after one day it stopped sticking to the included dashboard pad. I don't think it can handle the summer heat that the interior of the car  reaches.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Very easy to install","reviewDescription":"For my car. Easy to assemble and use","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1660262400000}
{"reviewTitle":"Part broke after two weeks","reviewDescription":"The part that attaches to the air vent broke after a couple weeks  cant find out how i can get in touch with the seller","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600905600000}
{"reviewTitle":"Suction cup not strong at all","reviewDescription":"The suction cup didn't hold at all. Ended up having to super glue it to the base, otherwise it fell right over. Wouldn't buy again in the future.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1585872000000}
{"reviewTitle":"Won’t stick for long","reviewDescription":"I live in Florida so it gets really hot. As soon as the heat of the day kicked in, it melted off and never stuck on for more than 5 minutes after that. Really disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632960000000}
{"reviewTitle":"Extends but swivel is limited","reviewDescription":"The product does well to extend out, BUT the swivel in the end is limited to just about 45 degrees. That limits the versatility of the extension that I was depending on to fit in a crampy dashboard. Returned since it didn't work for me....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606521600000}
{"reviewTitle":"Suction cup melted","reviewDescription":"Removed and reinstalled numerous times to clean my windshield then one time trying to remove discovered it melted to the glass. Pain in the ass to scrape the residue off....beware!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634515200000}
{"reviewTitle":"Doesn't work on several elements","reviewDescription":"Suction doesn't stay. Won't hold phone over bumps bc I have it in a (very thin) case, so if you have any case at all on your phone, this probably won't hold.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617148800000}
{"reviewTitle":"Terrible Adhesive","reviewDescription":"Lasted about a month and fell of the dash. Adhesive is terrible and would not stay mounted. Tried to contact manufacturer but website does not work. Do not buy!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620172800000}
{"reviewTitle":"Bummer","reviewDescription":"Suction circle ⭕️ plate is not strong adhesive i wont hold enough to place it in dashboard","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1649721600000}
{"reviewTitle":"It’s not sticky on dashboard","reviewDescription":"This phone holder it’s very bed it’s not sticky on dashboard","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Broken after a few months","reviewDescription":"It holds onto my vent in the car ok and did not fall off for a while, but broken after a few months. I hope to find a more sturdy one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1601164800000}
{"reviewTitle":"This Thing is Sus","reviewDescription":"You better commit to where you place this. Once you try and move it, it will never suction again.It is a sticky suction cups and falls.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632787200000}
{"reviewTitle":"Failed after 8 months","reviewDescription":"Quality and Design of the Cradle itself is very good. However, the vent clamps failed after 8 months of use. The foam pads compressed and lost any grab they had.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Adhesive sucks","reviewDescription":"Does not stay on glass if you have to change position once installed. Continously falls.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Disappointed","reviewDescription":"Unfortunately the adhesive did not stick to my dash as advertised and I’m very disappointed and can’t even use what I paid for","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668816000000}
{"reviewTitle":"It lasted less than 2 years with a small iphone SE","reviewDescription":"I bought in Nov 2021 and the clip broke down June 2023.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"The suction, adhesion stopped working two months ago. Very disappointed.","reviewDescription":"The adhesion stopped working and constantly fell off my dashboard at moments when I was in traffic.  I’m disappointed and was so frustrated I threw it away.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1656201600000}
{"reviewTitle":"Only last 3 months","reviewDescription":"I purchased this product based off of the good reviews. However after 3 months the suction is no longer strong; rendering this product useless. I have a fairly small phone too, Google pixel 3a and 4a. I'm very dissatisfied and I tried to contact the Visceed company which lead to no resolution.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620518400000}
{"reviewTitle":"worked great until it ripped a hole in my dash","reviewDescription":"mounting plate came lose and when removing it took part of my dash board with it. Glued it back on to cover up the hole it left. Get one that sticks to the inside of the windshield not this one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"Disappointed but good product","reviewDescription":"The mounting pad doesn't stick at all on the dashboard like the instructions stated even after over night application. Otherwise the phone mount holds my phone and has great reach for easy access.  Might return for another that will stick better to my dashboard.The vent clip is too close to the vent and makes my phone hot.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1610928000000}
{"reviewTitle":"Broke easily","reviewDescription":"I bought this for my boyfriend and we liked it so much that I got my own. We both loved them, until they both broke in the same spot only two weeks after installing them. We unfortunately can only use the vent clip, but since they break so easily I will not be getting a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1597104000000}
{"reviewTitle":"Hate it!","reviewDescription":"I cannot get it to stick to my dash or suction! The attachment for putting it on the vent is awful! I will be driving and it falls off the vent with my phone! I have tried a million different ways and CANNOT get this thing to work! Up to you if you want to waste your money!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1609286400000}
{"reviewTitle":"Suction Grip","reviewDescription":"I like the product until I installed it. The suction grip isn't up to par. I would like a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666396800000}
{"reviewTitle":"Good quality, for a while.","reviewDescription":"When I got this and installed it on my dashboard, I was really impressed. It held on to the dashboard for a little over six months. Then it just started falling off. I wiped down the dashboard thoroughly and tried reapplying it. It would stay on for maybe a week at a time. I finally gave up on it. I tried everything short of gluing it down. Maybe they can work on the sticky substance that is on the suction cup so it can handle they heat of summer and the cold of winter.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689033600000}
{"reviewTitle":"After 4 months it feels cheap and no stable","reviewDescription":"I bought this for my commute to work, I even bought a second one for mother I like it so much. Sadly, after 4-5 months of use it's not as stable as it was when it was new. The ball socket that connects the holder to the arm cannot be tightened enough to hold firm. I suspect I will have to outright replace it in another couple of months.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Bummer","reviewDescription":"It didn’t last very long. I have it only a year and didn’t stick to my car dash very good.Not worth it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Lost the sticking after a while","reviewDescription":"The mount was fine when it first came, but after a while the phone mount would just completely fall off to the ground while I am driving. I would try to put it back on, but it would just repeat the same motion until I just gave up and placed it away. It’s nice for a while until the suction wears off and doesn’t do it’s job anymore. I do think that this can do better, and I have hope that the one I have has been defective.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649721600000}
{"reviewTitle":"High hopes for the design, but doesn't adhere","reviewDescription":"I love the design of this phone holder, but in my Ford Escape, there isn't a single flat surface to be had. So I used the dashboard disk that comes with it.  Absolutely NO adhesive on that thing.  And for all the talk of how hard it would be to remove the disk, it just came off the dash in my hand.  Using the holder in an air vent in Texas isn't appealing to me. I need every air vent I have. I might have tried the windshield, but they've been tinted and the instruction booklet discouraged use with tinting. Plus that suction cup doesn't want to stick anyway.  So sad this didn't work!!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1639353600000}
{"reviewTitle":"Loved it until it broke (BUT THEN GOT REPLACED!!)","reviewDescription":"EDITED: The seller reached out to replace the whole product. I already loved it and was satisfied with the design, hold strength, and angles but the back screw broke off. They were very prompt in responding and diligent in sending out the new mount. I love it! It amazing! Going to order another one for my work truck and my girlfriends car!I loved it but one day I was tightening the back screw as I was adjusting the angle and it broke so now it won’t tighten and it’s just dangles downward. I’ve tried to reach their customer support but it seems like their webpage doesn’t work and there isn’t a way for me to get ahold of Vic seed to see if they could just send me a back screw to continue using. That’s the only reason I give 2 stars :(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"Does not stick","reviewDescription":"I followed the directions perfectly and stuck the adhesion part to my dashboard. I pressed hard for over a minute to allow it to adhere to my dashboard as per the directions. I left it there for OVER a day (over 24 hrs) and when I went to go attach the part that holds the phone and then place my phone in it, the entire mount just came undone from my car dashboard. It does not stick whatsoever. I currently use the part that attaches to the air vent, however I don't like that if I need the heat on, it blows hot air into my phone and I can't close the vent to it because the product while attached obviously hinder that action.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615420800000}
{"reviewTitle":"Not big enough in depth to hold phones with pop sockets.","reviewDescription":"Suction and adhesive to dash was great for only a little while since the sun’s rays beats on it through the window. Once that happened it didn’t stick anymore it fell I couldn’t reattach. The wind hands that hold the phone are too curved to hold phone with a case and any other accessories on phone(pop socket, or wristlet string. Needs to be deeper to hold and accommodate accessories. Putting phones in holder on vents can cause phones to over heat if heat is on in the car or too cold in summer when AC is on so dash is the best but wasn’t able to withstand the sun.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642204800000}
{"reviewTitle":"It’s kinda alright for small phones","reviewDescription":"It sticks really well onto the included 3m plate but the actual phone holder flings around when driving. After using it for a while having it fully tightened down it starts to get loose, and then you can’t tighten it anymore.(Update)Customer support read my review and sent me another phone mount, which yet again failed to hold up my phone. I had a iPhone XR, and then switched to the 12 pro max; the XR held for about a week and then started to not stay tight on the arm. I tried my new phone with the new mount they sent and it just wouldn’t stay up. The product needs to have some metal parts to it so it can handle being tightened better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608422400000}
{"reviewTitle":"Setup Great, but Not Practical","reviewDescription":"The product was easy to mount and assemble.  Problem is that the phone is not easy to see from the distance or angle.  When pulled closer, the phone charger cord hits the touch screen and changes the radio channels and functions while I am driving and then I have to fix it.  The functions are hazardous and I am afraid it will damage the car dashboard in removal.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667865600000}
{"reviewTitle":"Price and product","reviewDescription":"The product was as described and easy to insta.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"WONDERFUL and FRIENDLY Customer Service  & Great Product!","reviewDescription":"First off, let me say that I really like this phone holder.  I mounted mine on the windshield & use it every time I drive.  It is very handy and you are able to look ahead and see both your phone & the road and other cars.  It was simple to install and easy to use.  I love mine.As for the Customer Service, I was really impressed and greatly appreciative.  You see, we live in Central Texas and it is super hot this summer.  As per my picture, the 100 degree temps finally took a toll on my suction cup and I watched it melt away day by day and it finally separated and fell down.  I was so sad, but I told myself to reach out anyway and explain my situation.  So I wrote to them and told them exactly what had happened and asked them if they sold a replacement suction cup replacement.  They checked on it and approved it and sent me not only just the suction cup, but the whole end and all we have to do is replace the end piece, clean the windshield really good again and re-apply.  I am debating on waiting until this horrible heat wave is over and the cooler temps are here.Thank you Lily for all of your kind help!","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1659484800000}
{"reviewTitle":"Superb Customer Service","reviewDescription":"I needed help with installing one of my products that I purchased from Vicseed and they’ve been nothing but helpful with their support and response to my needs","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Fits perfectly","reviewDescription":"Due to the shape of my dashboard, I had trouble finding a holder that fit.  Price was right and it did fit","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715385600000}
{"reviewTitle":"STRONG GRIP AND MOVES EASILY!","reviewDescription":"LOVE LOVE LOVE THIS, purchased for a Honda Pilot, no place to really put it except in the radio display. It’s currently gripping vertically, it’s super strong! I will comment again once we’ve passed the Arizona summer. The vent clamp is also pretty string to place it completely out of the way.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Great product, sucks in AZ heat!","reviewDescription":"This mount worked great for 2 years after installation until the second Arizona summer started, then the suction cup melted. This was supposed to take the heat, but I guess not. The disc held well but the rubber grips on the phone clamp fell off, I'm assuming from the heat. But this lasted 2 years and held my note 8 with otterbox case. I ordered a second mount, I hope it does better, I would hate to have to remove that disc from my dash. I  really want to be mad, but it is hard to find products that withstand the Arizona heat. Do not guarantee your product to with stand the heat if it doesn't. This is my second melted suction cup, the first one was Mounted to the windshield, with a dash cam and it slid down the glass. I'm hoping for better. I gave a 5 star rating because I really like this mount, it suits my needs. Please don't make me sorry I  bought another one.","isVerified":true,"ratingScore":5,"reviewReaction":"16 people found this helpful","country":"United States","date":1686614400000}
{"reviewTitle":"Clamps so well","reviewDescription":"I use the clamp on the far left drivers side.  It’s out of the way and I still get plenty of air out of the vent.  Very versatile.  Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"It's awesome!!!","reviewDescription":"I drive a 3\/4 ton truck with hard suspension. It's NEVER dropped my phone at all.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Really like this","reviewDescription":"So far, this is a really good cell phone holder the 3M. Stickplate seems to be holding very well to the suction cop. And it was very easy to install. I think this is the one that i've been looking for","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Perfect delivery","reviewDescription":"My 2nd time buying this phone holder.  Fast shipping. Will recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Best cell phone car mount!","reviewDescription":"I bought this product 4 years ago and it is still working just as well today as it did the day I received it. I haven’t had a single issue with it at all.  That impresses me because you don’t see quality like that from MOST things we buy now, and I felt the product deserved a shout-out!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Quality and worth it!","reviewDescription":"Extremely robust, versatile and looks awesome!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Sturdy and adjustable","reviewDescription":"Son-in-law has had this for a year and recommended it as the best. I like it because it’s very sturdy and very adjustable to go on my slanted screen dashboard. Wasn’t sure if anything would fit in that perfect spot but this did..","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Solid mount that lasts!!!","reviewDescription":"Amazing customer service.  I am 100% satisfied with the phone mount and would recommend. Here is a picture of it installed in my car, it works great. I drive for a living and am constantly taking the phone on the mount and back in and it continues to function without issue","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Safe visual directions while driving","reviewDescription":"This stand securely holds my telephone where I can check my location while driving while keeping my focus on the road and the traffic around me.  There are two methods to use in placing the holder, the first is a sticky method that would adhere to the dashboard, and the second is a unique device that adheres to an air conditioner vent.  The sticky platform was ruled out in my case because I have faux leather covering on the dashboard and I am fearful that the sticky substance would ruin its appearance in the long run.  The vent that I adhered to is somewhat blocked by the phone, but not so much as to cause a problem when I need the cooled air.  I am very pleased with the results and highly recommend it to anyone seeking a GPS system for driving.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1687132800000}
{"reviewTitle":"Great cell phone holder","reviewDescription":"I bought this for a trip & needed to use my phone for a GPS in a rental car. I was going to use the suction cup on the windshield to hold the phone. Ended up using the vent clip. Worked wonderfully. It’s not a flimsy unit.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"👍🏿👍🏿👍🏿👍🏿👍🏿","reviewDescription":"👍🏿👍🏿👍🏿👍🏿👍🏿","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Great","reviewDescription":"Holds phone. Wish grip arms on sides were longer to hold bulky phone but it stays up. Good product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Best Mount I have used. And I have used alot.","reviewDescription":"I like this mount. I use it on my vent. If you have bigger hands you might have a slight issue adjusting this. I would adjust the prongs until it just will slip over the vent because then you will only have to make a few adjustments. (If that makes sense.)Like any other thing that has a suction cup you will need a smooth surface. (Logical would state this.) If you don't think a suction cup from the dollar store will stick to your dashboard, more then likely this won't. If you have a plastic console in the middle of the console that feels like plastic this will more then likely work. The fancy coating will not with this suction.Also. Like any other suction cup... it's thin. It will melt in the heat. Plain and simple. Especially in the summer. There really isn't a way around it.I bought three of these. One was for my boyfriend and the other my ex liked and I just gave it to him. (We are amicable.) And my bf is one of those, for some reason or the other thinks higher priced things work the best. He had like a 60 buck thing or something and it sucked. He loves this one.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1645747200000}
{"reviewTitle":"Lasted 4 1\/2 years","reviewDescription":"I’m buying my second one of these for my vehicle. I thought about changing it up, but why? The first one lasted me over 4 1\/2 years until one of the pieces that clamps on the phone failed. I’m say that’s a pretty great lifespan for $25.I love how adjustable and incredibly sturdy it is.I have a large vehicle, so it is extended more than it would be for most people. It doesn’t bounce around or loosen itself up. Great product!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"Phone holder","reviewDescription":"I like it for my iPhone 13 Pro max","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Works perfectly","reviewDescription":"Exactly as described. Holds my Pixel 8 Pro no problem and was super easy to install.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Works Great","reviewDescription":"I have an iPhone 14 Pro, with a decently bulky case (including a pop socket) and the mount works like a charm on bumpy roads and through roundabouts. Sticks really well to my slightly rounded dash.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Hot weather alert","reviewDescription":"only issue was when it was REALLY hot, the adhesive didn’t hold. Maybe switch to the vent holder in the summer. Otherwise good hold!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Phone holder","reviewDescription":"It works well","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Great!","reviewDescription":"Well made. Easy to install car cell phone holder","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Phone holder","reviewDescription":"Good quality, easy to use, so far it has worked well for my wife because she is on the road a lot.She is a happy wife!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Wonderful product and even better customer service","reviewDescription":"The holder worked great, over a year on my dashboard … (in Florida!!!) …the sticky part was loosening but their customer service was amazing and sent replacement part quickly","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722384000000}
{"reviewTitle":"Stays put","reviewDescription":"It's easy to use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Wife loves it.","reviewDescription":"Easy to install, works great with my wife's iPhone in her car for hands free driving.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Excellent Customer Service!","reviewDescription":"I would like to share my experience with Vicseed. The car mount I ordered did not hold my iPhone due to the thick Otterbox case. I had to return it. Linda, from customer service, sent me an email regarding why I returned the item. I explained the problem. She wanted me to be satisfied so she sent me another car mount by Vicseed, B07R1QZ8V1, FREE of charge. She has checked with me to see if everything was satisfactory. I am impressed with their customer service department. She has been helpful and gracious. I commend Vicseed on their excellent customer service.In regard to the new car mount, I just got it so I have only tried it out for a short time. I used the vent gripper to attach the car mount. The arms of the mount open wide enough for my phone to fit in, but the arms are not long enough to fully go around the front of the case, however there is rubbery material on the mount's arms that help to grip the phone. So far it has worked. I don't know how it will hold up over the long run or over bumpy roads. Time will tell.  I would definitely recommend ordering from Vicseed given the priority they give to go over and beyond trying to meet their customers' needs.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"HIghly Recommended!! 10\/10","reviewDescription":"Buy it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"It works!","reviewDescription":"We have two, one for each car. Mounts easily to the air vents in both cars. We have Pixel 7 phones and when mounted they are easy to see and read. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Insanely Resistant","reviewDescription":"I had a terrible car crash and this thing was still holding pretty steady with no scratches, definitely worth the money! 🫶","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Sticks well and holds phone securely","reviewDescription":"I bought this but expected the suction cup to come loose from my dashboard in the car quite easily and was expecting that I'd have to enhance the suction cup's sticking ability with velcro or alien tape. But to my very pleasant surprise, the suction cup has stuck firmly to my dashboard and without using the 3M adhesive! It has not lost it's grip on my dashboard even through summer's heat!The holder holds my phone securely as well!In addition, it's easy to use and adjust. And the holder doesn't bounce when I hit bumps or potholes.I did get this in the summer so I don't know if the suction cup will have problems during winter's cold, but so far it has held quite well. And my dash is textured, too. On a truly flat and smooth surface this should stick even better!Great product, wish I'd gotten it sooner!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Adjustable arm phone holder","reviewDescription":"I like how adjustable it is. Also it holds the phone firmly in place. I like the release button.Very good suction cup. It’s on my windshield and holds very well. Very pleased with the quality","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Very versatile phone mount","reviewDescription":"Bought several other types, all failed due to the steep curvature of modern windshield. This one has an extension, see photo, that did the trick in allowing me to take pictures plus to provide google map.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Well Designed Phone Holder","reviewDescription":"Vicseed makes well designed and constructed products.  Excellent customer servicer.  I needed a new suction cup for the Universal Car Holder and Customer Service responded quickly advising me the arranged to send me the replacement part for no additional cost right of way.  Very satisfied.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"Built well","reviewDescription":"Outstanding product Held my radio and allowed me to push button without knocking it loose.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Two year review","reviewDescription":"After two years of regular use this product is still working and is easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"VICSEED Universal Phone Mount for Car","reviewDescription":"I used the air vent portion of the mounting system in my Hyundai Santa Fe.  It provides the most secure attachment of any vent attached phone holder I have ever used.  I've tried a number of differed vent phone holders and they always fall off the vent with my phone attached over a short period of time.  They all lacked the variable grip adjustment that the VICSEED has.  The adjustable ball mount allows you to easily set the angle of the phone and lock it in.  It stays in the position you set and doesn't drop or change the angle over time, as so many other products that I've bought.It is the Best phone vent support that I have ever used.  I've not used the dash mount portion of the phone holder yet, but if it is made as well as the vent clip, I expect it to be a good product too.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1669075200000}
{"reviewTitle":"Very Versatile!","reviewDescription":"Full disclosure, I usually do not leave reviews, unless it is a junk item, but I am truly amazed with this thing!I have not used a mount before this one, so I do not have anything to compare this product to; but this is amazing.I have two separate jobs, one requiring me to drive to certain destinations using a company vehicle, the other doing the same in my own vehicle - the fact that I can easily use this mount in both vehicles by only unscrewing the phone cradle is great! One vehicle utilizes the extended bracket with the suction cup, and the other uses the vent clamp. The extended bracket is adjustable both in height and length, and very sturdy - I cant even begin to explain how many REALLY bumpy roads i have flown down, and the extended arm still stays in place!The phone cradle is awesome too! It has a quick release button on the side, so I can remove my phone in a moments notice and the spring clamp (holding my phone in cradle) is strong enough to prevent wiggle. The cradle also has an adjustable height bracket that allows me to position the phone exactly where I need the phone to perform fingerprint unlock. You can also position the cradle at any angle - you can have it titled up wards, for easy one hand use, landscape, to view media better, or even upside down.Great product, i would recommend this to any of my friends!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1610064000000}
{"reviewTitle":"Works for a Pixel 3a XL with a Spigen Tough Armor case","reviewDescription":"Bought this Vicseed Easy Clip Car Mount for a Pixel 3a XL phone in a Spigen Tough Armour case and for a dash mount installation on the small shelf on the dash of a 2003 Toyota Camry.  The size of the mounting disk and the angle of the hinge of the mount took up more space than a previous installation of a smaller unit.  I emailed Vicseed on a weekend with a question about installation (of note, I had not yet found the installation guide, which was under a flap at the bottom of the box).  I received a quick response from the company with a request for a photo of the dashboard, which resulted in an equally quick response with instructions to dispense with the disk and use only the suction cup and a link to an instruction video.  Installation proved to be both simple and workable in the space I had available.  Phone mount seems very stable and works well.  Customer rep also mentioned that she had notified their marketing folks to ensure that the instruction manual was more prominent in the box.  Excellent customer service.5\/15\/2021 Update.  The suction failed about 1 1\/2 months ago after well over a year of use.  I reviewed the installation instructions and viewed a Vicseed video, then re-installed the phone holder.  The suction cup failed again about 3 weeks later.  I emailed Vicseed and communicated with Alice, who I believe was the person I communicated with about my original installation.  I simply asked for suggestions as to how I could reinstall the original unit.  She said that she would send a new suction cup, but I today received an entirely new unit.  Excellent support for a very good product.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1578528000000}
{"reviewTitle":"Easy to set up and does exactly what I need","reviewDescription":"I upgraded to a larger phone and my previous magnet mount isn't able to keep my phone upright.  Plus, I would really like to not have a metal plate in my phone case that interferes with the wireless charging.  So far, this mount is easy to use and I haven't run into any issues.Soft padding on contact points with a phone - I wanted to make sure my phone wasn't going to get scratched up or mess with the case.  Both the clamps on the sides and bottom are well padded as well as the middle where the phone rests.Very adjustable - Being able to move the arm up and down and rotate the clamp as needed makes it easy to adjust the viewing angle.  The only difficulty is if you need to adjust the arm left or right.  You have to undo the suction, turn the arm, and then redo the suction, but it's fairly easy.Two-part suction - This feature was one of the main selling points for this model.  You peel and stick a base that gives you a flat surface to attach the suction cup on the arm.  So far, the arm has not fallen off and seems very stable.  The true test will come this summer when the vehicle reaches over 100 degrees.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1612915200000}
{"reviewTitle":"Go ahead and click buy!","reviewDescription":"I was looking for a really good mount for my work truck. I deliver for a living and my truck isn't exactly made for comfort.  That being said....I needed something that would really stick to my windshield and not drop my phone. Got to work on Monday and opened the box. Boy was I impressed! First of all....the suction cup is heavy duty and thick as well. It already has sticky stuff on it to help it adhere. I moved it several times before I found the right spot. Keep in mind I ride with my doors open so everything is dusty. The entire mount is adjustable with screw like things to really tighten them down to lock it in place. The part that holds the phone is strong as well. And the quick release button is located in a super convenient place. I go down dirt roads and crappy driveways all day and this thing has not moved or dropped my phone at all! I feel completely confident that my phone is safe even without a case! I like it so much that I bought a second one for my car the next day! It also comes with a small mount for your vents but I only used it once....didn't care for it being on my vent.When it's all said and done...you can't go wrong with buying this... especially if you need one that's tough and want to keep your phone safe. It really is worth the money! If it wasn't I would not have bought two! Get one and you won't need another one because it comes with a year warranty on it....yup sure does! So.....click buy and thank me later lol.","isVerified":true,"ratingScore":5,"reviewReaction":"99 people found this helpful","country":"United States","date":1580601600000}
{"reviewTitle":"Love this car phone mount.","reviewDescription":"I’ve bought a couple of the phone mounts for my 2 Fiat 500’s. I’ve mounted it on the dash because it’s the perfect angle and height while driving. The first one I bought has had no issues. The second one has given me some trouble staying stuck to the dash. I’m guessing because the dash has some texture to it and neither the disc or the suction cup stay stuck very long. However, the customer support (thank you Cara) has been great and are shipping me a new one. I’m hoping the new one will perform much better.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Multiple users","reviewDescription":"Purchased for the ability to use in a shared vehicle.  Works great to hold many different models of phone.  Solid.  Easy to adjust.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"To always depend on my phone holder to be dependable and efficient","reviewDescription":"Iam very happy with my new phone holder.Seems to be very durable and dependable so far.I would recommend this product to everyone looking for a dependable efficient phone holder.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Has a nice weight to it","reviewDescription":"I'm glad I got it!There's a small push button and it automatically releases the grips on both sides and its AWESOME! Hahah","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Great Customer Service","reviewDescription":"I have purchase five of these phone holders for myself and family members. One of them, we over tightened the locking nut and it broke. I contacted customer service and explained the situation. They replaced the parts with two new replacements parts. Quick shipping and no charge. I recommend this part. The oldest holder I have is 4 years old.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"On the fence liking it","reviewDescription":"I did allot of research in various phone holders and decided on this brand. It arrived in a timely manner. The suction cup was not something I was thrilled about. It has gooey silicone stuff on it. I had one before that was similar and the goo eventually got weird and sticky collecting dirt. It had the same washing instructions as the suction cups on this product which it never really got clean and remained sticky in a bad way.The unit also comes with a clip that attaches to the ac vent. THAT I find practical and is how I use it. One thing I didn’t realize at first is the tightening screw needs to be used for the ball joint. This means you take it off the suction cup holder and transfer it to the ac vent holder.It works very well as a vent holder. I give it 4 stars because the company should get rid of the sticky goo stuff on the suction holder. Maybe then it would receive a 5 star review.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Excellent","reviewDescription":"Holds really well, especially as compared to my last mount. I prefer this kind of design, but quality varies among brands. Have no regrets going with this one. Recommended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Great!","reviewDescription":"I love the way it Clips your phone into the stand but I'm giving it four stars because if you live in 100 or more degree weather it won't stay sticking on and it keeps falling off so you're going to have to get some type of strong glue to put on the bottom of it to get it to stay on your dashboard, I used Krazy Glue super glue","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"It’s pretty good!","reviewDescription":"I only gave it 4 stars because the adhesion doesn’t not stick on all car’s dashboard due to the car’s material! I had to end up sticking it to the window which I originally didn’t wanna do but I still love it and the pink! I would get it again.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"I USED THE VENT CLIPS","reviewDescription":"I've used the vent clips because I didn't want the glue on the dashboard. It comes loose often and I have to adjust it and clamp it again. I don't know if it's the width of the vent or what .... but I still like it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"Easy install","reviewDescription":"I installed it on my windshield and it was quite easy. Be sure to clean the windshield before with a bit of alcohol. It holds my phone even with the puck on the back. I am very pleased.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Great windshield attachment maybe too good but very rigid","reviewDescription":"It’s great almost too great. I did not notice the UV and other extras when I put it on. I only clean the window and removed the cover on the suction then I placed it on. It hasn’t fallen since. I actually tried to remove it from the windshield but I could not because of the adhesive. It worked a little too good. The only con is the neck of the holder isn’t very flexible","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1709769600000}
{"reviewTitle":"Great product","reviewDescription":"Great quality, stability, it hold my iPhone 13 max pro like a champ, great product for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Good","reviewDescription":"Good only for the windshield.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Works, but not the way I wanted","reviewDescription":"Had I known the suction wouldn't hold on my Escape dashboard or anyplace else, I would have bought a different product. As it was, I ended up using the vent \"clip\" and although that wasn't my intention, it does work for me. I should have sent it back and look for a model designed strictly for the vent.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Comes off the dashboard","reviewDescription":"I bought it because of the reviews. The product quality is good. It’s sturdy. But I had few issues so returned it:1. I stick it to the dashboard with the glue plate it comes. But I’m just one day, it came off. Now it is not sticking anymore.2. The phone release button is on the side left. Which is completely hidden when you put the phone. So it’s little bit inconvenient to get your phone off.Otherwise the quality is good. You may stick it with a dua side strong tape. But I’m not going to spend another $5 on tape.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Why is the bolt on the bottom?","reviewDescription":"I'm very particular that I don't have my windshield instructed. However with this product, I couldn't get the arm to go down enough because a bolt stopped it from moving farther down. Furthermore, it isn't stable if you tilt it upwards beyond a minimal distance so it performs poorly on that front as well.Worse, my dashboard mount didn't come with stickiness on the bottom so it wouldn't adhere. Very difficult to use. Customer service was kind and offered a replacement however the fundamental issue of its mechanics prevented me from taking them up on this offer and issuing a return request instead.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"unusable","reviewDescription":"The suction cup is too big for my dash. The instructions say keep out of the sun so it can;t be used on the windshield. It is way too heavy to clip on to the air vents and even when I tried this I then couldn't change gear. A real disappointment and for me a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Do not buy","reviewDescription":"The product doesn't work at all. I wish I could still return it because I never use it. I just completely forgot to return the item during the return policy time.My iPhone 10 kept falling from the holder, it wouldn't hold up. I just wasted my money on this product!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Won’t stay on my dash","reviewDescription":"I’ve had $5 phone holders stay on my dash better.  This constantly falls off.  Didn’t come with alcohol pad- but I still cleaned my dash per directions.  Such a waste.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Tab broke on the 1st day","reviewDescription":"One of the ball mounting tabs broke on the 1st day of use but I was able to still use it. A second tab just broke and now I am out of my return window so its basically garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"False advertising...","reviewDescription":"This phone holder DOES NOT use suction whatsoever.  It is entirely held on with adhesive.[ suhk-shuhn ]nounthe act, process, or condition of sucking. sucking.the force that, by a pressure differential, attracts a substance or object to the region of lower pressure.the act or process of producing such a force.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Did not stick to dash even after 48hrs","reviewDescription":"I was disappointed with the quality of the product, the adhesion was terrible and fell off the first time it was used. Not worth the money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"It is not good quality! And I doesn’t not hold my phone","reviewDescription":"It is not good quality! And I doesn’t not hold my phone","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Wont stay","reviewDescription":"Constantly popping off of the area I suction to. To the point where I cant use it in fear itll drop my phone :\/","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Convenient easy to use","reviewDescription":"The clamp that holds it on the air vent is easy to use. Holds it securely. Very sturdy design. Holds my android phone well. Good quality product. Good value.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"The Best Universal Phone Holder I have purchased!!","reviewDescription":"VICSEED Universal Cell Phone Holder for Car Phone Mount Car Phone Holder Dashboard Windshield Air Vent Long Arm Strong Suction Cell Phone Car Mount Fit with iPhone SE 12 Pro Galaxy S21 All Phones Over the years I have tried numerous phone car mount holders, numerous!  About 2 years ago I searched through Amazon and rolled the dice on this particular mount made by VICSEED, it was well worth the gamble.  The mount came in well packaged, and simple instructions.  This mount can be used on the dash, window, and vent.  I particularly prefer the vent mount holder with any phone mount holder I have purchased.  The major difference that I seen and noticed is the quality, it is hands down better quality than any of the phone mounts I have purchased over years.  So, satisfied that I quickly ordered another one for my other vehicle.  Attached are pictures of the VICSEED Universal Mount (first 4), compared to one of the mounts I have purchased in the past (last photo).  The VICSEED Universal Mount, securely holds my phone in place no matter if I hit a bump, or any form of driving.  The other mount, in park doesn’t stay in place, and will completely fall off the vent leaving my phone in the floor.  I personally have a large phone in which (Note 20 Ultra)  in the picture is my son’s Phone note 9 and the VICSEED holds up amazingly, it also has a quick release for when you want to release your phone.  Lastly, what I noticed is a major difference is the quality of the clamp. Great customer service….one day I accidentally broke the vent clamp, I didn’t think about contacting the company at first because it was my fault, I just ordered another one.  After receiving my new VICSEED mount (same one) I emailed VICSEED simply to see if I could purchase a new vent clip, they responded fairly quick, and shipped me a new one (no charge). Awesome product with great customer service!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1624320000000}
{"reviewTitle":"Easy to mount to window shield","reviewDescription":"Husband uses everyday He loves being able to put his iPhone in it and use google maps!  Very easy to install I recommend it, especially for the older generation.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"MAGIC BUTTON ⭐️⭐️⭐️⭐️⭐️","reviewDescription":"I bought a cell phone holder from Verizon 6 months ago. I was impressed...for a day or two. Fast forward to turning a knob to tighten the sides around the phone and this being such a pain and u could never get it quite right. It even fell out one day while I was driving which was really dangerous. The sides also had foam inserts in them to cushion your phone as it held it. They were both falling out. I actually brought the phone holder inside and was super gluing it and securing it with clamps to dry when it struck me how ridiculous the situation was and how this product was so much more trouble than it was worth.I am getting ready for a road trip and needed something to hold my phone safely so I can use it for phone calls, navigation, music (and be switching back and forth between all these functions. To be honest, for once I didn’t really read a lot about the product or look at the reviews which is wild considering the nightmare my last holder proved to be. I picked this one cuz it was an Amazon Choice and it had almost perfect stars. OMG!!! The button on the side is AMAZING! I just rest my phone on the “shelf” for the bottom and squeeze the sides together and it just stays put. NO KNOB TO TURN!!! But WAIT...it gets BETTER...to release your phone, you just push the MAGIC BUTTON!!! WHAAAT??? Who is the genius who came up with that? This seems really well made and I don’t anticipate any unusual wear and tear like I ran into with the piece of crap I had before. There is no foam in here to fall out and I am not worried in the least that my phone will slip out when I’m driving and be sliding around under my feet. I liked it so much straight out of the box that I adhered it to my dash. I have never done that before with anything and didn’t know what to expect. I don’t worry about that coming off either...it’s solid. You know how every once in a while an everyday purchase makes your life infinitely better? This was that purchase for me.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1599436800000}
{"reviewTitle":"Best phone Stan","reviewDescription":"I was hesitant when I first got this phone stand because I had yet to find one that won’t break or make my phone fall during the first week. This one has met all my expectations and is really sturdy!! I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Worth it's weight in gold.","reviewDescription":"This phone holder is absolutely awesome! I own two of them!  Simple and easy to use,  rugged and extremely sturdy,  these holders will make you smile.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Works really well.","reviewDescription":"Sticks to various surface's, no issues. Very sturdy unit.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Hermoso","reviewDescription":"Lindo ajustable perfecto 💯","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Good size holder","reviewDescription":"Judy tight for truvl","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Great vehicle phone mount!","reviewDescription":"I tried the VICSEED CD phone holder since I preferred not to attach my phone to one of the A\/C vents or mount on the dash or windshield. The VICSEED CD mount was very sturdy and well made but I didn't like that my phone obstructed my backup camera screen on my Prius V. I was disappointed because I liked the quality of the VICSEED phone mount so I wanted to replace it with another VICSEED product. I was very pleased with this VICSEED suction cup mounted phone holder. It is actually designed for the dash or windshield mounting but my Prius has a small quarter window that I was able to mount the phone holder. It is the perfect location since it doesn't obstruct my view and I can easily view my phone when using GPS. So far, the suction cup is very strong and stable. The VICSEED products are high quality and are reasonably priced.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Perfect vent mount for 3G Silverados","reviewDescription":"This unit has multiple ways to mount the phone holder. You can use the suction cup, add adhesive, or use vent mount. The dash in the 3rd Generation Silverado does not allow for any clip or spring mount and since I won't use adhesives on my vehicles, I have opted for the vent mount. However, since a suction mount is included, it is nice to know that I could try the suction option, down the road. Anyway the vent mount holds my phone tight and no slippage. I tried another brand of mount that has the stabilizing hook, but it wouldn't work with my wide, vertical louvers. Because of the column gear shift, I cannot use the right vent, so I placed it on the left, with good results. I am satisfied with my purchase and will keep this product ear marked if I ever need to buy a new one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"RECOMIENDO LA COMPRA DE ESTE SOPORTE...","reviewDescription":"Es el segundo que pido para otro coche que tenemos en la familia, y os puedo asegurar que es de calidad y de muy buena sujeción, pues había probado otras marcas y se soltaban por el peso del tfno o por el movimiento del coche, y con este modelo voy tranquila, ahora no solo escucho las indicaciones del GPS sino que puedo mirar por donde me lleva ya que lo tengo a la altura de mi vista.Es apto para cualquier tamaño y modelo de teléfono...LO RECOMIENDOIt is the second one that I have ordered for another car that we have in the family, and I can assure you that it is of quality and has very good support, since I had tried other brands and they came loose due to the weight of the phone or the movement of the car, and with With this model I feel calm, now I not only listen to the GPS indications but I can look where it takes me since I have it at my eye level.It is suitable for any size and model of phone...I RECOMMEND IT","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"Works","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Doesn't fall off","reviewDescription":"All of my previous experiences with car mounts involved things falling off.  I've had various Garmins with Garmin mounts, and they always fell off (whether from the windshield or a disc).  It got to the point that I would leave my GPS plugged in constantly while using it, so that if it fell in floorboard while I was driving, I could pull it up with one hand using the power cord.  It did that a lot.  Inevitably while I was driving in very heavy, crazy traffic with an exit coming up in under a mile.  So that's what I have to compare this mount to.This mount came with a disc to put on my dashboard, but I didn't want to pry off the old Garmin disc.  I was afraid that would damage my dashboard, since the thing has been there for 12 years or so.  I considered stacking the discs, but thought I should try the new mount on the old disc first.  The mount just barely fits on my old Garmin disc.  The disc that it came with is slightly bigger.  But it did fit. Just have to be really careful to get it lined up, since the fit is so close.  And it does NOT fall off.  Honestly, I can't even pry it off.  I have to get my husband to pull it off when I want to remove it, and it takes him a minute or two to get it off.I've had this for two months now.  It's had a decent amount of city and country driving, and it's been on one roadtrip so far.  Lots of bumpy roads and such.  And it never once fell.  That's all I really wanted.  Was something to not fall.It fits my iPhone SE well.  Because of the case I have, it is difficult to insert the plug into phone in while it is in the mount, so I just plug it in before I stick it in the mount.  I like how adjustable it is.  I was able to position it to where it was comfortable for me very easily.  The air vents in my car would not take air vent clips, and those were too low for me to see easily.  This one is perfect.The one thing I can't speak to is how meltable it may be.  It spent most of the hot days at the end of summer in the garage.  Not a lot of chances for it to melt the gel.For what I wanted though, this is great.  It just barely fits on the pre-existing Garmin disc, and it doesn't fall.  It's never dropped my phone.  It was a good purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"135 people found this helpful","country":"United States","date":1571875200000}
{"reviewTitle":"Easy of use","reviewDescription":"Easy install and removable.  Like the rotating parts","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"The Best!","reviewDescription":"This is the best car phone holder I’ve ever had! It keeps my phone in place, it’s easy to install, easy to use and is durable!! Highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Perfect","reviewDescription":"Got this for my daughters car and it wad easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Awesome service","reviewDescription":"I had an issue with my suction cup not sticking back after I had to move it. I contacted the company and the replaced the part ASAP and kept a check on if and when I received the replacement. I recommend their product for quality and service.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717286400000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"100 Things WRONG ...","reviewDescription":"I'm a real skeptic and typically find 100 things with something and end up disappointed. But, this phone holder is 100%! I'm very happy with it. I have one in my car and one in my Freightliner Cascadia. It's amazingly strong and sturdy and doesn't jiggle in my truck. If you're a truck driver, you'll love this. If I had to be picky, I would have made the arms a 1\/4\" longer. However, the arms are long enough to hold my phone with the case on. Love it!Manufacturer note: Think about incorporating 4 tiny magnets to grab and hold the phone while the user closes the arms. They need not be strong magnets - just strong enough to grab the phone and hold it flat while the user closes the arms.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Does not work with all phone cases","reviewDescription":"it works for my galaxy note with protective case but not for my wife's leather fold over case. The little arms that hold the phone are to short (not high enough) to grab and hold the phone and cover. If the arms were 1\/4\" longer (higher ) it would work great. Therefore the maker should list cases it will not work with or make it universal which mean \"ALL\".","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619222400000}
{"reviewTitle":"Seems like kind of a flimsy mounting system","reviewDescription":"I hooked it to the fan levers and its seems flimsy. I haven't really gotten to use it much yet. I wanted it for travel and I haven't traveled yet. My mind may change after I do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646265600000}
{"reviewTitle":"Dash mount plate did not adhere to my textured dash surface, eliminating the dual mount option.","reviewDescription":"I wanted 2 options for mounting. The flat plate didn’t adhere at all to my textured dash surface. Total loss for that option. The vent mount locks in well, but has broken a vent louvre. Not too happy with that result.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640563200000}
{"reviewTitle":"Doesn't like phone cases...","reviewDescription":"Worked great until I bought a protective hardshell for my phone.Now, the little arms that you squeeze to secure the phone, are too small to grip it properly and tightly, it keeps falling off.Something to consider if you have full hardshell case on your phone...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630540800000}
{"reviewTitle":"Didn’t last long","reviewDescription":"Didn’t last on my dash but maybe a couple of days, I guess it’s too hot in my car. Kept falling down holding my iPhone 11 medium size without case. Suction wasn’t super sticky. I make car driving videos and this last only a few drives. Oh well, I will look for a different one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624147200000}
{"reviewTitle":"Seems flimsy and cheap.","reviewDescription":"Last one lasted a couple years and melted off the winshield for some reason.This one goes on, but the part thet holds the phone seems cheap and is manual.  My last one closed on the phone automatically.Time will tell.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630022400000}
{"reviewTitle":"Didn’t work for us","reviewDescription":"There were so many great reviews, so we were disappointed when ours kept falling off the windshield. Within a week it fell off more than four times. Plus, the sticky part got all full of carpet fuzz. Amazon was great about the return, though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1630713600000}
{"reviewTitle":"Returned","reviewDescription":"I was going to try to use the suction cup attachment, however for my car, the prime placement would have interfered with either sightlines or dash functions. The weight of the item closed the vent without the phone in place and attaching it to the passenger vent put the phone too far away. I suppose it would work for a different car.","isVerified":true,"ratingScore":3,"reviewReaction":"34 people found this helpful","country":"United States","date":1582848000000}
{"reviewTitle":"Doesn’t automatically grip phone you have to manually do it","reviewDescription":"Lots of other products will automatically close on your phone when you place it on the stand. I did not realize this one did not come with that feature.So far this one holds my phone in place well and sticks to the dash well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626393600000}
{"reviewTitle":"The south Florida heat and humidity will cause the mount to Lose its suction ability.","reviewDescription":"The south Florida heat and humidity will cause the mount to Lose its suction ability over time. Mines slide off my window shield after 4 months. Try to contact the manufacturers. But website is no longer available.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"Texas Heat Fail","reviewDescription":"Ideally a great product, however it couldn’t stand up to the Texas heat. I appreciate that it can adjust to the size of your device and is an easy in\/out to release and engage.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627862400000}
{"reviewTitle":"I mean... I guess...","reviewDescription":"The clip works fine but the little adhesive circle did not work at all. I even pressed on it for a minute and didn’t put the suction on for 24hrs🤷🏽‍♀️ I really wanted to mount this to my dashboard.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622419200000}
{"reviewTitle":"Would not stay put","reviewDescription":"Constantly came loose.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"Bulky","reviewDescription":"This works very well and swivels easily. However, it’s so bulky, it blocks your view.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642809600000}
{"reviewTitle":"I love this mount but it doesn't stay put","reviewDescription":"perfect size and ability to adjust the position. But the screw part comes loose often and I have to keep remounting it. I tightened the piece on the back and it still did the same thing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623888000000}
{"reviewTitle":"Just deep enough to hold","reviewDescription":"Only problem with most of these cell phone  holders is with the fact they are just barely  deep enough to hold one with an additional outer protective casing (otter).Otherwise it works fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"Don't stick this anywhere","reviewDescription":"Suction and adhesion both terrible.  Car out in sun for a few hours and adhesion wore off.Tried suction but slight curve to dash made it impossible. Ended up using clip mounts.  That works better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620691200000}
{"reviewTitle":"Buyer beware!!","reviewDescription":"Not what the picture showed! It works, but none the less not the same head, if you are looking for model# UV 450 26 with the led lights your better off checking on the Shark website or calling shark","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617753600000}
{"reviewTitle":"Worked great while it worked","reviewDescription":"This was easy to install, we used the vent clip because the suction wasn't that good but after not even 6 month, the clip just snapped one day. Now its useless.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624838400000}
{"reviewTitle":"Must have FLAT surface.","reviewDescription":"While this is very easy to install and can be handy, it wasn’t quite as sturdy and strong as expected. Unfortunately there aren’t many flat surfaces on our dash so we had to rig it a little to make it useful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614038400000}
{"reviewTitle":"Not so great for Ford Edge after all","reviewDescription":"The holder itself is great, and the vent option is decent, but this was highly recommended for a Ford Edge dash attachment, and that does not work very well.  If you want to attach it to a dash board, you need a perfectly flat surface.  The Edge is slightly curving in all possible attachment areas, so the adhesive disk does not have full contact.  For other cars, a 4 or 5 star rating might be appropriate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657497600000}
{"reviewTitle":"2nd one to lose adhesion. Wasn’t even that warm","reviewDescription":"Loved this item to start. First one stayed put for 2 yrs or so, but it finally cut free on a really hot day. Could never get it to hold, so I bought another. Cleaned the dash per instructions, located it a couple inches over so it wouldn’t be on top of the old location. With a few months, and not a hot day at all, it lost adhesion. Done with this brand.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652486400000}
{"reviewTitle":"Suction cup isn’t good","reviewDescription":"Falls every three seconds. It’s annoying because I drive a lot for my job and need a gps but this doesn’t stick. It holds my phone between the clamps well but doesn’t hold the entire car mount at all. Waste of money…","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1675468800000}
{"reviewTitle":"Easy to attach phone","reviewDescription":"I like the way it grips the phone. Im using my vent & I wish it had more swivel on the vent. It’s a bit stiff. But overall I like it & I would buy one has a gift if someone was getting a car","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667952000000}
{"reviewTitle":"Holds thick iPhone 11 OtterBox case","reviewDescription":"I searched and searched to find a car mount that would hold an OtterBox commuter case because they are thicker and heavier, particularly with an iPhone 11. I’ve only had this for a week but it definitely seems to clip more securely in the vent. The clip goes fairly far back and one can tighten it pretty well. I did not want to go through the hassle of getting a new phone case and the suction cup really wouldn’t work in my older car. Fingers crossedUPDATE MAY ‘22 - still holding phone fine. No flopping.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638403200000}
{"reviewTitle":"Better Design Than Most","reviewDescription":"I like the design and materials used for this style phone mount, however, it’s still not made to hold onto phones with thicker cell phone protective cases. I have a recharging battery pack (almost an inch thick) built into my protective cover which makes it impossible to find the right dash cell phone holder to mount it securely. I’m still looking for the perfect holder but I do like what this holder has to offer for just a cell phone only.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Don't put this in a plastic bag","reviewDescription":"When I first purchased this, it was great! It mounted easily on my windshield, adjusted easily and held its position well.Then I put it on a plastic bag to take on an airplane, and when I took it out, the bag got stuck to the suction cup on the mount.I pulled off most of the plastic from the bag, but now it doesn't hold suction at all.Very disappointed. They should at least warn you to keep the original cover that the suction mount came with to use for travel. Then I would, still be able to use it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1629331200000}
{"reviewTitle":"I bought 2 of these and both vent clips broke on me.","reviewDescription":"The only problem is the vent clip! I bought 2 of these and both of the vent clips broke. Other than that I would of gave this a 5 star. Everything else works perfectly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679443200000}
{"reviewTitle":"Good value, well built, recommend!","reviewDescription":"Updated review - worked fine in winter months, but since weather warmed up this won't stay hooked on dash.  Don't recommend.Old review - Works as advertised.  I have a bigger phone, not huge, but heavier with the case and this worked well.  At first I thought it may not work well, but realized you need to pull the bottom part down so all the weight is distributed.I have a pretty flat dashboard, and I would say that's important when using this item.  I haven't tried the vent function but it seems pretty simple to use.  I also like it has both options.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1602460800000}
{"reviewTitle":"It works great until the sun melted the adhesive pad","reviewDescription":"I loved this until the 100° weather hit Kentucky then this melted into a sticky mess and the oily stuff covered my windshield im going to try and fix it with out the adhesive pad sry the pic is dark couldn't charge my phone bc of this mess","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1656460800000}
{"reviewTitle":"Doesn't stick to dashboard","reviewDescription":"I have a 2017 Kia Sportage and I couldn't get this darn thing to stick to the dashboard.  I currently have the one where you clip it to your vents, but I am afraid of breaking my vent.  I have tried so many of these car mounts that I am just ready to put my hands up.  The quality of the product is good, it just doesn't stick.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Not supportive","reviewDescription":"The product did not stay stuck to my dash less than  24 hours. It didn't support my phone at all. Threw the product in the trash.?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"Didn’t stick","reviewDescription":"I bought this to use for Apple Maps. When I received it I wasn’t impressed. Went to install it. It stuck for about 30 seconds before it fell off. Bought a vent mount that works perfect","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"fell off","reviewDescription":"fell off as soon as i hit a bump. it doesnt have a long range of motion. can't put it where it needs to be","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1681948800000}
{"reviewTitle":"Release button in poor location, beyyon 3 much better but was out of stock","reviewDescription":"Use with iPhone 14pro with otter box case. The release button is behind phone and not as easy to use. Beyyon 3 which I have in different vehicle works much better, unfortunately was out of stock","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Air Vent Clap Design Flaw: Broke or did not work!","reviewDescription":"The clap that goes into the air vent broke on the first use. It had to be broken when shipped. Just purchased this phone holder like within the last few days and already got issues. I am not sure if there is a flaw in the design or what. I would definitely like a replacement. I am going to say it was just this car holder but not a representation of all. How do I receive a replacement?","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1597190400000}
{"reviewTitle":"Ball bearing used to support phone is major design flaw","reviewDescription":"Because of the design the weight of my phone points the screen down out of vision while I drive. I've tried tightening the joint in question, but since it is a ball bearing joint it's designed to be flexible and in this case floppy. I regret not trying it out in time to return. Buyer be warned.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"Total disaster","reviewDescription":"I bought this item and followed instructions , cleaned the dash, etc and applied it to dash, waited 24 hours before using and fell right off.  Total waste of money.  threw box away so can't return.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1676073600000}
{"reviewTitle":"Waste of money","reviewDescription":"There is no “suction power” the suction cup only works by the adhesive on cup. The adhesive doesn’t work either, my drive to work is about 45 minutes and 20 minutes in it falls off my windshield. When I come back to my car after leaving it overnight, it has fallen off as well. Do not buy this garbage. I would have returned it if I hadn’t tossed the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1608681600000}
{"reviewTitle":"Worked for a month.","reviewDescription":"The suction cup doesn't grip on a slightly curved windshield or on a textured dash. It worked great on my vent until it slipped a little. I tried to reinstall it and one of  the gripper fins broke. Now it's in a landfill. Replaced it with the Komoi. I love it. It grips well and costs 1\/3 the price. I give it 5⭐s.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1622678400000}
{"reviewTitle":"cannot use this if u have a popsocket","reviewDescription":"This product was actually really nice! I liked how it had the extended arm on it. The suction was kinda annoying because u can't use it right away the suction haa to sit for 24 hrs before its at its best suction. Also you cannot use this phone holder if u have a popsocket on your phn so that was a deal breaker for me because I have to have my pop socket. Other then that its a nice product just not for me","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1621468800000}
{"reviewTitle":"Too top heavy","reviewDescription":"After all the fantastic reviews, I bought this, and am utterly disappointed. Everything was fine until I set my phone in it, causing it to be too top heavy, pulling the adhesive up from the dash. Yes, I cleaned and dried the dashboard prior to adhering the mount. Yes I adhered it to a flat portion of the dash. Yes, I adjusted the arms. I am glad so many people have had good luck with this, but it was a waste of money for me, and a big disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1605312000000}
{"reviewTitle":"Garbage product","reviewDescription":"I had a cheap car mount for my phone I got for like 5 dollars from Marshall’s, and figured I would upgrade and get a nicer one since I liked having it so much. Well this was a waste of money. Followed all the directions and the 3m didn’t stick AT ALL, and thought maybe it would work with just the suction.. about 5 minutes down the road and it came flying off. Totally unsafe and a WASTE of money. Go get yourself one from Marshall’s and don’t waste your time. Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1626134400000}
{"reviewTitle":"Loses all ability to stick within a month","reviewDescription":"At the bottom of the suction cup they add adhesive. Seemed like a good idea when I first got it but now I can't even get it to stick for more then 15 seconds. This product is a waste of $$ I now use my cupholder to hold my phone over this because my cupholder is more reliable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1656460800000}
{"reviewTitle":"trash","reviewDescription":"the moment ipulled it out of the box the 'locks' didn't work, but that wasn't important because they mostly stayed in place anyways. the major disappointment of this is the adhesion- or the lack of it. the gelpad on the bottom doesn't stick to my dashboard at all. I tried so many different tricks to get it on (including the lighter trick) and it just keeps falling off. absolutely no suction power, no adhesion, not worth your money","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1624060800000}
{"reviewTitle":"Do not buy this product","reviewDescription":"I attempted to mount the product to my dashboard and followed the instructions exactly and it would not stick to my dashboard. I spent $32.00 for it and it did not work. Do not waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688688000000}
{"reviewTitle":"terrible product","reviewDescription":"Didn't stay on for a week. Waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Once it's on your dashboard, don't ever move it or it won't stick again","reviewDescription":"I had this mounted to my dashboard for several months. It was very easy to install and I had no issues with it. Then, I had to move it slightly to the right. It never stuck again.I ended up using duct tape to try and secure it, because it kept falling off the dashboard with my phone while I was driving. The adhesion of the suction cup seems to be a one-and-done type of thing, so if you purchase this item, be aware that you can't mount it more than once","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1623283200000}
{"reviewTitle":"ISSUE RESOLVED | WASTE OF MONEY !","reviewDescription":"DO NOT BUY THIS PRODUCT AFTER SEEING ALL THAT MANY REVIEWS ! I HAVE USED MANY DIFFERENT PHONE HOLDERS AND THIS IS ONE OF THE WORST PRODUCT, I THINK WALMART PHONE HOLDER IS A LOT MORE BETTER THEN THIS & ALSO LOT MORE CHEAPER..***UPDATED***THEY WENT ABOVE AND BEYOND TO RESOLVE MY ISSUE, I’M MORE THEN HAPPY WITH THE PRODUCT NOW, THANK YOU VERY MUCH 😊🫶","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1659484800000}
{"reviewTitle":"Junk, do not buy!!!","reviewDescription":"The suction cup will not adhere to the dash of the vehicle for more that a couple of minutes.  It constantly falls off creating a potential driving hazard.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Great Mount","reviewDescription":"It did take a couple of mounts before I found this one. I do carry a larger phone with a pretty durable case around it and one of the issues I have had with other mounts I tried was they just couldn't hold the phone well or would detach completely from wherever I had it mounted in the car with even slight bumps in the road. I will say that the suction works best on the windshield, which is perfect for me since I like my phone mounted in the left corner of windshield behind the steering wheel. Although, it does stick pretty well to other surfaces in the vehicle.I have only had the mount itself detach once when the inside temperature of the car was well above 100 degrees on an unusually hot day. I have never had an issue since.My one issue, and this is very nuanced, is that because I have a case on my phone, when I go to plug in a USB cable and then place the phone in the mount it does not fit perfectly with the case\/USB combo. This may be in large part due the fact that my phone case does have a dust protector over the USB charging port that hangs from the bottom of the case when a USB cable is plugged in. However, if they would just make a small adjustment bottom of the mount (since many decent phone cases do have charging port covers) that would accommodate phone cases with or without charging port covers, it would make for an almost perfect phone mount.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641168000000}
{"reviewTitle":"Doesn’t stick to dashboard","reviewDescription":"I followed the directions to a T, mounted the phone holder exactly as instructed, and within a week of mounting it, the little plate that sticks to the dashboard giving the holder a smooth, flat surface to mount onto, popped off. Very annoying. And it happened literally 3 days past the return date. DO NOT waste your money on this one.Update: while all that I said was true, I really didn’t expect that this company would reach out and offer a full refund or a replacement. The customer service is outstanding. The woman who helped me, Kyra, seemed to care that the products that her company sells are working right and she clearly cared about the customer buying their products. You can’t ask for more than that. If you don’t have a completely flat dash, this holder may not work for you, but don’t be afraid to give it a try. This company is worth supporting. I wish more people did business the way they do.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1684022400000}
{"reviewTitle":"Affordable, but careful eith the lock ring","reviewDescription":"I've bought this product twice. The first time was for a different car. Admittedly, I didn't take the time to read the instructions carefully. I took the main unit and affixed it to the dashboard without the baseplate.  It still holds up, but now I'm worried the material may have melted into the dash. (I'll check later). Be careful not to tighten the lock ring on the back too much or it will crack and lose the ability to hold position. If you email the company for a replacement, have your order number ready.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Edited: Broke at 6 months. 2nd review after support.","reviewDescription":"I like the system and it held my phone very good but the screw knob to tighten the swivel cracked because they use plastic.Edited on 12-10-2010So I reached out to the company and shared my issues with them. They immediately sent out the parts to make the repair. I followed up with another email stating that I had another issue with the suction cup, once again they immediately sent out parts to repair. First problem was a broken knob. This issue can be from the user over tightening the knob. The second issue was the suction cup. It had NO problems sticking to my window for a full 6 months, the issue was removing it!  It was so strong I had to use 2 hands to pry it off. To be honest, my truck is in the sun a lot and I have never removed the product from my windshield. What seems to have happened was that months of Texas heat possibly made the rubber break down a little and made it stick even more. There is NO damage to window and the product as it sits with the new suction cups still works, just very sticky.This is a robust product that I have put through some rough conditions. So I give the product 4 stars but the support and response a big 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1638576000000}
{"reviewTitle":"It holds well and works on dashboard and window.","reviewDescription":"It holds well and works on dashboard and window. On the windshield I had a little trouble with it but overall worked well. On the top of my smooth dashbaord it worked well. We just finished a 2,000 mile round trip with it attached to the dash. I've also used the vent clip to mount it in my truck around town and have not had problems. The adjustable arm works fine if you tighten it fully. It's worth the purchase price to me and nice to have dual mounting options.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"So far it work well","reviewDescription":"Usually I stick it on the windshield. But I was in a hurry one evening and used the attachment for the vents. Works great so I’m going to leave it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Personal experience. 2020 TAKE & 2024 TAKE","reviewDescription":"Nov. 4, 2020Sadly I was disappointed to see that it keeps falling off due to the suction not being strong enough it comes with a pad and the pads its self is stronger than the suction of the mount itself. the arms that holds the phone is fine it works good but the fact that the suction on the arm does not work at all, makes the purchase worthless I was certain that it was going to work but to my disappointment and my own experience with it, it continues to fall and never be able to hold its own regardless how hard I press on the suction to the pad or the surface alone as well as having it suction to either the pad or the surfaceMay 14, 2024As time passed witha few fall offs I forcefully kept attempting to strengthen the grip. Eventually kind of worked, but would often fall. The heat from the sun beaming on the mount eventually melted the cup making it harder to fall becoming a plus, but if not positioned to your liking mite need to replace the whole thing. I might have disliked the product but as the circumstances worked out in my favor it served it's purpose; used it on the plate it came with. Switched mount for magnetic one. (Review popped up figured do a double take) I greatly appreciate the product but still can't give a 5 due to it not stay standing from the weight unless it melted.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1604448000000}
{"reviewTitle":"A cross country truck drivers experiance.","reviewDescription":"I am an over the truck driver. I've had this product since january and have put it through 24,000 Miles of use... that's about 2 years worth of Miles for an ordinary car driver. To my surprise, this product has never lost suction or fallen off the dash. My phone is a Samsung s5 active, plus I have a case on it.. and it holds my phone adequately, although more depth in the holder itself would have been nice.As for the side support arms, they simply ratchet click in place to hold the phone.. and has a quick release button for removing the phone. The bottom support arm slides in and out as desired.If I had to complain about anything it would be the suction cup. The suction cup uses an adhesive film in order to assist the suction cup with sticking and staying on a surface. The problem with this design though is that every time you remove the holder from the car, a little bit of the adhesive film wears off. Eventually if the holder is removed too many times the adhesive film will become useless. For that reason, it's best to pick the vehicle and spot that is desired and leave it.. don't move the holder to a different spot unless nessesary.Other than the adhesive film issue.. I think this is a great holder.update: 10\/2\/2022I finally retired this holder last week.. only because I got a new phone and wanted to have wireless charging not because this one broke.. I would still be using this one if it weren't for the lack of wireless charging.","isVerified":true,"ratingScore":4,"reviewReaction":"54 people found this helpful","country":"United States","date":1584748800000}
{"reviewTitle":"Adhesion\/Suction Gave Up","reviewDescription":"I really liked this product.  Unfortunately, after 2 years, I guess it was not able to withstand the heat in Florida that it took a toll on the adhesion\/suction as it slowly detached itself from the dashboard.  Now, I'm wondering if they sell a replacement for the suction cup.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Somewhat tricky to install","reviewDescription":"After checking the reviews, I decided to ONLY use the vent mount. I feared that a window\/dash mount would be difficult to remove, leave nasty residue if removed, and\/or would not be secure. The vent mount was a little tricky to get on and tighten. However, once I got it on it was very secure and did everything I wanted the mount to do. While it sits in front of the vent, it does not significantly block air from the vent.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"Dashboard phone mount","reviewDescription":"Great product.  Easy transaction.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Holds my phone.","reviewDescription":"Not sure how else to title review. I use this on the ac vent,  and it clamps on it very nicely. Held up to my 1st use going to Connecticut,  driving through New York city potholes. Held my phone firmly,  and DIDN'T bust up my ac vent. I will probably get another for my other vehicle.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Great","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Does not come loose","reviewDescription":"This is the first phone holder I had had with 2 options- one for vent holder or two for window holder.  I choose the vent holder since it was quick and easy.  This is the first phone holder I have ever had that actually works and holds my phone nice and steady and does NOT come loose!!  My son uses the window holder and is also very happy with  its sturdiness.  I would highly recommend this product.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Excellent Product","reviewDescription":"Great quality and works well with 3 options.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Awesome product","reviewDescription":"This is a great product.  Went through many of these until I found this one.  No problems works fantastic","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Best Phone Mount","reviewDescription":"This phone mount is definitely 5 stars. I didn’t use the adhesion on the windshield or the dashboard since I tried my luck with the vent mount. I was shocked at just how great it stayed on no matter the bumps and missed pot holes. And I absolutely hate vent phone mounts but it legit does not budge. It has a ball swivel similar to the one on a rearview mirror, which allows me to set my phone at the perfect angle when I’m driving. So I can face it up, down, left, or right. It also adjusts for any size phone expanding from both sides and the bottom, which leaves an open space so I can charge my phone while using the GPS. Stability 10\/10; Performance 10\/10; and overall quality would be 10\/10.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"I liked this so much I bought a 2nd one","reviewDescription":"I liked this so much I bought a 2nd one For my wife’s car. Good quality, easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Love it","reviewDescription":"Doesn’t rattle or shake while driving! Seems to be upholding pretty good in this Texas weather","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Muy bueno!!!","reviewDescription":"Fuerte y resistente, hecho con buen material,lo recomiendo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Didn’t stick","reviewDescription":"Returned it, if your dashboard is textured it won’t sit flat. Your better off just getting something that clips to the air vent or suctions to the windshield","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626739200000}
{"reviewTitle":"Need better adhesive","reviewDescription":"The adhesive did not stick well at all ! I had to replace it with some two sided tape","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"Study and adjustable, but not designed to fit my dash.","reviewDescription":"I drive a MDX and couldn't find a good place to mount the device","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640822400000}
{"reviewTitle":"Base Pad Not Sticky","reviewDescription":"The base pad had absolutely no stickiness after peeling away the red paper backing. I have not yet tried the suction portion. I will update review once I do.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609891200000}
{"reviewTitle":"Not Bad","reviewDescription":"Became loose behind the backplate ,Will not tighten, it still holds the ph good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1637280000000}
{"reviewTitle":"Adhesive pad","reviewDescription":"Good phone holder if using vent clip or suction. Adhesive pad is not very strong. Gave out within a week time. Registered the holder and was able to get another adhesive pad.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1619654400000}
{"reviewTitle":"A little annoying..","reviewDescription":"When mounted to the dash the phone holder keeps slowly drooping downward when used with iphone 7 plus. I’ve tightened the ball joint to the max but it remains loose enough to reposition without much resistance. Otherwise it’s pretty good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1597017600000}
{"reviewTitle":"wont fit my case","reviewDescription":"I have an iPhone 11 with a standard case.  It wont fit, need to remove the phone from the case when using this in the car.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609200000000}
{"reviewTitle":"It's fine","reviewDescription":"The base was too large for where I wanted to place it in my car.The suction cup didn't work, so we and to use the adhesive.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607990400000}
{"reviewTitle":"Fell off my dash","reviewDescription":"This is the second suction\/adhesion mount I got (two different brands) that fell off my dash when the weather got too hot. The AC mount works fine but I don't have near the control of my phone that I'd like.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1593734400000}
{"reviewTitle":"Suction cup doesnt do its job","reviewDescription":"I bought this product to mount to my car's dashboard. I mounted it and the suction cup only lasted for about 40 mins after which it came off. Other reviews said that the suction on it is powerful, but I found it to be weak. Now, to be fair I have the S21 Ultra, which isn't exactly small or light. I also live in San Diego, where days can get hot. But considering that I've used other car mounts and they've worked well, I can't see this as a valid excuse. I found the vent mount to work well, but that's not why I bought it. Everything else looks well built, it's unfortunate that I can't use it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627948800000}
{"reviewTitle":"Does not fit iPhone 15 pro max","reviewDescription":"Product description stated it worked with an iPhone 15 pro max. The phone is too wide to use with this. Will return","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"Suction didn't work for me.","reviewDescription":"The suction feature did not work at all with my car. It was actually more like sticky and gooey rather than suction. I would drive and it would fly off my dash with my phone or when I got in my car it would be unattached from the dash.I do like the vent attachment but sad the suction one didn't work at all. It may have been because it's hot in Houston and I drive a small car so my dash is rounded. But even with the flat additional attachment circle it wouldn't stay. So no idea.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620950400000}
{"reviewTitle":"It’s just an OK product","reviewDescription":"I really love this item when we got it my biggest regret is that although it does adhere to the windshield superbly the adjustment to hold the phone in a sturdy position the part that connects the phone to the stand it’s just way too difficult and too hard to tighten up to keep the phone in the constant stable position I’m a strong man but you have to have pliers to tighten this thing that tight to hold it in a usable comfortable position my suggestions Is that make sure you have a Hercules grip","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1638316800000}
{"reviewTitle":"Needs much better adhesives.","reviewDescription":"While this unit fits into a vent reasonably well, the adhesives used for dash did not last beyond 5 days.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Suction cup isn’t made to last","reviewDescription":"I’ve had this product for less than two years. Around the 18-month mark the suction cup started to lose its adhesive properties, and the thing pops off a smooth, cleaned plastic console under its own weight now. Ditto for a glass window. The suction cup itself was never strong enough to form a bond, so once the sticky stuff wears off, the product is dead weight.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666051200000}
{"reviewTitle":"DO NOT PURCHASE DOES NOT WORK!!!","reviewDescription":"This was one of my worst purchases EVER!!! I got this because I’ve never been a fan of the vent clips, and I wanted something to stick to my dash. I cleaned down the surface, found a flat spot and stuck the suction down. It fell within seconds. I then used the little disc that was included. It fell within seconds again. Now, I have to use the vent clip which still can barely hold up my phone and it continues to fall down on the rotating part. DO NOT BUY. Waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1592438400000}
{"reviewTitle":"Does not stick or stay","reviewDescription":"I cleaned my dashboard it fell of i put in vent it fell out. If feels lik great quality but it would not stay secure.Update, tried sellers recommendations..again...trash dont waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1677369600000}
{"reviewTitle":"Works but...","reviewDescription":"During the summer n Don't Attach to Your Windshield!!! The adhesive melted to my windshield a 1 1\/2 ago and I am still trying to get it off. It looks nasty and is very sticky.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1666137600000}
{"reviewTitle":"Good for 5-6 months or before summer.","reviewDescription":"Bought this in Jan 2021. Worked GREAT…for 5 months, until the Georgia sun worked its might and the holder “suction” let go of the window. Have tried unsuccessfully to get it to reattach to the windshield, but it won’t stay on for even an hour before peeling off. The silicone (?) still feels gummy, but I think the lever just doesn’t pull enough suction to really grip. Guess I’ll be on the hunt for a better device.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627689600000}
{"reviewTitle":"What the actual heck","reviewDescription":"I want to love this product. But the top part always comes off when I put my phone in it. I wish there was something to hold that part in securely. The bottom part stays beautifully, someone tell me how to get the top part from falling off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1584748800000}
{"reviewTitle":"Doesnt last long.","reviewDescription":"At first, the adhesive and suction was strong but over time (within 2 months)  especially during hot days, the adhesive would start pulling off from the base when the phone was mounted.  I ended up buying a different phone mount.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595289600000}
{"reviewTitle":"Frustrating","reviewDescription":"Been using the feauture to connect to AC vent, during the summer months. It keeps falling off, despite trying several angles, clamp tightness and gently adjusting position. Very frustrating. Hoping the suction feature on dashboard works in the cooler months or I'll be shopping again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1597968000000}
{"reviewTitle":"The suction and adhesion only lasted about 3 weeks. I followed the instructions.","reviewDescription":"The suction and adhesion only lasted about 3 weeks. I followed the instructions. Now I have to find something that will actually work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649462400000}
{"reviewTitle":"Not that great of a product.","reviewDescription":"I bought this mount for recording my races. The mount doesn’t keep the phone stable. The suction cup has some play in it. Next the ring that clamps the ball socket broke on me after about 4 weeks. The product need some more development.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627862400000}
{"reviewTitle":"It's ok","reviewDescription":"Suction doesn't really work, the small clip that is included works nicely for attaching to the A\/C vent, but I purchased this to attach to my dash or windshield and this does not do the trick (iPhone X)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600905600000}
{"reviewTitle":"does not say on","reviewDescription":"I love the design and look of the product however it does not stay on my dashboard.  It is therefore useless.  When I am driving and I have my GPS on I want to see it but it falls off and lands on the floor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607126400000}
{"reviewTitle":"Would not stay attached.","reviewDescription":"I cleaned my dash just as was recommended and it only lasted two weeks before it fell off. When it was working it was great. I will be contacting the company to see what my options are.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1601424000000}
{"reviewTitle":"Doesn’t stay attached to air vent.","reviewDescription":"I installed on the air vent. No matter how much I tightened the knob, it still would come off. Will reinstall using either double stick tape, or a coupla dabs of silicone adhesive.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619827200000}
{"reviewTitle":"Suction cup sucks","reviewDescription":"I installed it when the temperature was in the 60s and held for awhile until the temps started to rise in the 70s and 80s an then the suction cup and adhesive would not hold anymore!Would not recommend!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1591747200000}
{"reviewTitle":"Stopped sticking to my dash","reviewDescription":"After 2 months of use with no issues it fell off my dash today and I can’t get it to restick!Kyra was very responsive to my issue and willing to help. She requested pictures of my phone case and what type of car I had.  She offered to send me a vent clip phone holder vs the sticky dash one I had issues with.  I am awaiting arrival of the new phone holder to try and am very impressed by the quick service and shipping!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681171200000}
{"reviewTitle":"Trouble holding weight of iPhone 13 plus but great service","reviewDescription":"I waited too long to install this, so I can’t return it but I have tossed it out and just went and bought the WeatherTech which is what I should’ve bought in the first place.I followed all the instructions, but it kept falling off.The dashboard just really wasn’t up to holding itself in place with the weight of the larger iPhone.After seeing this review, the company proactively offered me a refund and is also proactively looking into what happened so that’s impressive","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676419200000}
{"reviewTitle":"Nothing last a long time","reviewDescription":"It did stick but not very long. The clips also held up but bad positioning. On the item behalf","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"The clip is no good for my car","reviewDescription":"The clip doesn't work for 2015 Prius C vents","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Good, not the best","reviewDescription":"I have uneven dashbords, couldn't get a good full grip. Tried the windshield but my Samsung aA14's weight pulled the sticker off the winshield....so my dashboard and my fatty phone defeated this product. YMMV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Adhesive does not hold","reviewDescription":"This device is very poseable and puts my cell phone right where it want it, but the adhesive on the bottom smooth metal mounting disk did not hold to the dash. I followed the instructions and waited longer than the minimum waiting time for it to set but still had to put super glue on it after the \"lifetime\" adhesive started pulling free.Side note: The suction cup has a sticky gel pad on it that holds wonderful but does not want to release if you want to reposition the suction cup. I pulled the gel pad off and discovered that the cup had very little suction without it. Super glued that too.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1646265600000}
{"reviewTitle":"The heat...","reviewDescription":"Not that great in the heat. It melted and left a nasty goop on my window and it didn't come off.Other than that though it works really well","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Phone clamp broke","reviewDescription":"Used this mount for three years. Lost stickiness about 18 months in which was easy enough to replace for 3 bucks, but now the phone clamp broke and i might as well buy a new one. But while it lasted it was good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681257600000}
{"reviewTitle":"slight improvement needed","reviewDescription":"3\/6 Update: Someone on the customer service team reached out and expressed regret for me not being 100% satisfied with the product which was very much appreciated. They are working on an improved mount which will hold phones that have cases and\/or PopSockets. Looking forward to it!The product itself is sturdy but I would’ve rated higher if there was a bit more depth to the holder. A lot of phones these days are protected with cases or have pop sockets, card holders or those loop band things on the back of them. I shouldn’t have to choose between protecting my phone with a case or mounting it in my car. Make the mount deep enough to hold my phone securely even with a pop socket on the back. I can get it to grab the sides but it takes some effort and isn’t always secure.","isVerified":true,"ratingScore":3,"reviewReaction":"42 people found this helpful","country":"United States","date":1578614400000}
{"reviewTitle":"Design is a bit flawed","reviewDescription":"I don't write reviews much, but I did want others to know that this product did not work well for my VW Passat.  My dashboard is not flat and the texture is very porous. After I set it up, the weight of the phone (due to physics and the leverage) kept loosening the grip of the suction.  I then tried the double sided tape provided, and it also did not hold.  I ended up using the small vent clip, and that is doing well.  However, I'm worried that the vent blade could snap if I'm not careful, or one of my kids uses too much force unintentionally.  We'll have to wait and see.In retrospect, I would try another product and design if I need to get a new one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622160000000}
{"reviewTitle":"Not recommended","reviewDescription":"I wanted a cell phone mount for my car so I decided to go with this one. I attached it to my car's vent and put my phone in it. For about 10 minutes, driving down the road, it worked fine. Then it fell off the vent and onto the floor of my car. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Adhesion stopped working within days","reviewDescription":"I was very much looking to having this product for my iPhone 11.  Sadly the adhesive stopped working within days.  I followed all of the rules, clean and dry surface before adding the adhesive to dashboard.  I also waited the 24 hour period to add the mount to the adhesive so that it was as strong as possible.  Unfortunately after a couple days the adhesive back lifted up.  I would have preferred to reach out to their customer service as it says \"If for any reason on our product is not satisfying, please Let us know to get a prompt and fast solution.\" but don't see a way in which to do so.","isVerified":true,"ratingScore":1,"reviewReaction":"30 people found this helpful","country":"United States","date":1579737600000}
{"reviewTitle":"Did not work well for me","reviewDescription":"The only thing that worked on my car was the AC vent holder, and surprisingly its holding up well, except for the fact that that vent is constantly tilted down because of the weight. The base didn’t want to adhere to my dashboard, even though it’s not that textured, and the suction cup that attaches to the base was not sturdy and I didn’t feel safe driving with my phone attached to it. I do like the little button that releases the arms and for now its a fine enough set up. Once summer sets in I might need to purchase something different cause I need all my vents working to combat the 100+ weather.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1583798400000}
{"reviewTitle":"Hard to use moves around on the windshield!","reviewDescription":"It moves around on the windshield so it’s hard to use to use","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Might be good for smaller\/lighter phones","reviewDescription":"I thought this product would work as I've searched high and low for the perfect phone holster for my vehicle. Alas, it has proven not sufficient for my iPhone 8+. The suction cup gave out that was attached to my dash. Not to mention it couldn't hold my phone steady while driving. The clip that attaches to air vent also couldn't hold my phone either. Going to keep searching for another mount.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1668556800000}
{"reviewTitle":"Phone mount","reviewDescription":"This phone mount does not work well. I stick it on my dash, the windows and even near my gear. After you go over so many bumps it falls down. I’m sending this product back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"A disappointment","reviewDescription":"The side clamps simply fail to secure a phone in position. The adjustable base slider helps, but the security of the holder feels like a failed design. After using it for some month, I regret not returning it.Moreover, the locks mechanism to hold phone in the proper position for best viewing always feels loose and insecure. If you have different sized phones or drivers who want different viewing positions, look elsewhere for something with a better design and better holding power.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1659657600000}
{"reviewTitle":"Good product until it breaks","reviewDescription":"Had this mount for 8 months and it was working fine until the joint tightening screw broke. Everything else is well made and the suction is very good it’s just the mount will be exposed to the hot sun especially during trips and that tightening screw will crack because it’s plastic. Company claims to have a warranty but never responded when I contacted them so buyer beware if you like to leave your mount stuck to your dashboard that screw will wear down and crack.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1656028800000}
{"reviewTitle":"Not what it says it is","reviewDescription":"I have tried for years to find a car mount for my phone that actually works. I have yet to achieve that goal. This one does not work either. The A\/C mount was the best I could hope for. When I attach it, then put my phone in the slot, it falls down and I cannot see the phone. Since the ball mount moves, it stays in the down position. I will be sending this one back too.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1661299200000}
{"reviewTitle":"I bought this in January and it stopped working by August","reviewDescription":"The thing just jams up and doesn’t open to hold the phone. It worked great until it stopped suddenly, most likely cheap springs that got damaged.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Suction sucked, ironically","reviewDescription":"100% the phone holder looks really nice. But the suction legit sucks. I am disappointed in the fact that the suction did not work at all. I bought it for that main reason, to use it on my dashboard. I used the little disk provided for the dashboard and It didn’t stick on the dashboard either. I am disappointed that it doesn’t stick to my dashboard and I feel like it was a complete waste of money. I read the reviews and everything. I thought I was well informed. But nope, it turned out to be a waste. The air vent holder works fine, it’s a bit of a hassle to put on but it’s alright. If you want to use this product for your dashboard **DO NOT WASTE YOUR MONEY!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1591315200000}
{"reviewTitle":"Very disappointed","reviewDescription":"I received this product, followed ALL instructions:1) First, placed the dashboard, waited 24 hours as stated in the instructions2) Then placed the phone holder, waited 15 minutes - as stated in the instructionsAnd only THEN started to use the phoneThe entire thing lasted EXACTLY 1 day!!And it fell.The dashboard didn’t hold.I think ot is too much money to pay to hold it only one day. I wrote to seller asking to either change the dashboard or return my money, but there were no response!!!I would like to return my money.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1668816000000}
{"reviewTitle":"Garbage","reviewDescription":"Lasted about a month and lost suction. Save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Useless if you like phone cases.","reviewDescription":"It broke INSTANTLY. It’s was still usable, but one of the arms stopped moving immediately after trying to put my phone in it. With a wonky arm the SUPER shallow grips weren’t able to grab my phone at all. This is NOT meant for phones with thick\/ sturdy cases AT ALL. My phone has a lifeproof case which proved to be about the max limit for what the car mount could take. When I added a small adhesive wallet to the back of my phone the mount stopped working completely. The arms broke further from me trying to force them closed over my phone. Any time I sped up, slowed down, or hit a turn my phone would fly off the car mount.","isVerified":true,"ratingScore":1,"reviewReaction":"26 people found this helpful","country":"United States","date":1589760000000}
{"reviewTitle":"falls off","reviewDescription":"I literally had this product for not even a day and its already fallen off. i followed all the instructions so I absolutely not would recommend this item and I want my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"La pega es mala","reviewDescription":"Intenté de todo para que pegara y se cae","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"So disappointed","reviewDescription":"Now I only bought this and spent my money on it because it looked like it had some good reviews. Could not have been more wrong. Followed every instruction it came with and everything. Had this mounted on my car for not even a full week and as I'm driving it flys off and unsticks. Horrible! The sticky 3M it comes with is so unreliable and it did absolutely nothing. Will be requesting a refund","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1680134400000}
{"reviewTitle":"Dont stick","reviewDescription":"I bought 2 of these. One for my truck and one for the car. Neither one suctions to the dash board. The stick pad isnt even sticky. It will not stay on either. Tried cleaning the dash and wetting the suction cup. It held for a minute and fell off.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Ruined my dashboard","reviewDescription":"Absolutely terrible. I don't understand why the rating is so high. It ruined the dashboard on my tesla and now I'll have to pay hundreds to repair it. The grip on the phone curls too far and obstructs the screen. What a piece of trash. Also the suction cup has a literal adhesive coating - not a \"nonstick coating\" like everyone else, but a literal adhesive which makes it difficult to remove and leaves residue. If your dashbord is anything besides plastic like mine, then it'll be ruined. It's really a piece of crap and it's the top product on amazon's search result. I'm questioning if I should keep using amazon because problems like this keep happening.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1625961600000}
{"reviewTitle":"Total Failure","reviewDescription":"Just did not work.  Tried several times and while it would adhere for a few minutes, invariably, I would come back to  my car and the mount would be on the floor of the car, having failed.It looks like a great design and I was very disappointed because it failed to do the most elementary and important thing: adhere to my car dashboard.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Totally disappointing!!!","reviewDescription":"This product is made of sturdy material. However, the portion which actually holds the cell phone, no matter how tight I tighten it keeps moving downward due to the weight of the phone. Therefore, I have to keep readjusting it back to the standard position so that I can see the phone. Also, I do not use the mounting plate provided with he mount, but the windshield instead because I move the mount to different vehicles. Sadly, the unit keeps detaching from the windshield falling to the dashboard. It is a real disappointment. Unfortunately, I purchased two of these mounts before I realized that they don’t work (at least how I use them), leaving one in the States and taking the other overseas where I live full-time. By the time I realized my mistake it was too late to return them. They ask in their advertisement to contact their customer service department is a customer has any issues which I did, but there was no response. This is why I am now giving this review.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1623024000000}
{"reviewTitle":"The ball connection fail","reviewDescription":"I will not get another one of these with the ball connection point.  first it blocks the ac vent.  second once you move the ball connection point it stops hold up the phone.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1712016000000}
{"reviewTitle":"In the way","reviewDescription":"Mounts on top of dash so it blocks way too much of my windshield.  I opted for the magnet that attaches to the front of my dash which yields an unobstructed windshield view","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Don’t buy it . It suction cup melts on the window","reviewDescription":"It’s a good cell phone holder it just melts on the glass and is dripping down the windshield . Not good I would think .  There suppose to sent me a new suction cup but nothing yet . Yeah they didn’t keep there word . They  asked me to send photos of the product and they would send  which I did and they never sent a replacement like they said they would . So it’s your call if you don’t mind plastic dripping down your windshield . Oh and they do send it to me then I will  change my review status .","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1685318400000}
{"reviewTitle":"Sticky pad lasted 1 week","reviewDescription":"Sticky pad lasted 1 week before unit fell over. Cleaned area with alcohol wipe applied and let cure for 24hrs.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"Waste of $25...","reviewDescription":"Loved the holder itself and the fact that I can use it 1 handed. However it won't stick to my dash... I tried using the suction cup directly on my dash first and it stayed for about a day before falling off. Then I used the 3M disc that came with it thats supposed to work on textured dashboards. Followed the directions exactly...washed the spot, let it dry fully, then attached the disc and let it sit for a full 48 hours before attaching the phone mount. It seemed to be working great for about a week then suddenly the 3M disc detached and the mount with my phone in it flew to the floorboard. The 3M disc isn't reusable so I'm pretty much SOL at this point. Extremely dissapointed that I basically wasted $25 on this thing. I could use the vent clip but the whole reason I got this mount was to replace my old mount that clipped to the vent. Don't bother wasting you money on this one.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1622332800000}
{"reviewTitle":"Does not Stick","reviewDescription":"I bought this with intent to use the suction cup on the dash. However from day 1 I have not be able to get it to stay for more than 10 minutes. I don't like using the vent clip because my vehicle doesn't a vent with optimal viewing location and as this suction cup doesn't stick I really wasted my money.  I would have returned it if I didn't try to fix it first but oh well.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698624000000}
{"reviewTitle":"Not sticky enough","reviewDescription":"Doesn’t even stick to my car and falls off as soon as I put my phone on it","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Disappointed","reviewDescription":"The stick for the actual phone holder does not stay. The adhesive is not strong enough. I have to use the ac clip which is what I wanted to prevent from doing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Doesn't hold if extended.","reviewDescription":"The 3m won't hold for long if arm is extended. Mine held for less than2 months,  then fell from my dash as I was driving.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Suits its purpose","reviewDescription":"Adhesion not great so mounted in the air vent. Works well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677628800000}
{"reviewTitle":"Got the replacement parts.","reviewDescription":"Fell off of my wind shield on day three. Just peeled off and fell onto my gearshift almost breaking my phone. It wasn't that it didn't adhere. It stuck really well. Almost gooey but it definitely lacks in suction power. After receiving the replacement parts I'm a little less disappointed. I hope they get the product fixed instead of making everyone wait for the parts they shouldn't have had a problem with.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610409600000}
{"reviewTitle":"Okay","reviewDescription":"I did not have a good first impression with this product but their customer service contacted me right away offering to help so I can be a satisfied customer. They even sent me a new product and followed up to see if it was working well. I still did not have the best experience with the product as it could not hold my phone (I believe my phone may be too heavy) but if you use the clip that adds to the air vents that works great.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1581465600000}
{"reviewTitle":"Would of rather got something else","reviewDescription":"It suctions good but I have to keep tightening the screws down because phone tugs down on it when I hit some bumps in the road.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661990400000}
{"reviewTitle":"Steadiness","reviewDescription":"I don’t think the mechanism that holds the phone securely in place is going to last very long but we’ll see","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668384000000}
{"reviewTitle":"Lacks durability","reviewDescription":"It's  a nice cell phone holder with different mounting options and position settings. The plastic nut that tightens the swivel to the pad broke on the second time I mounted it. dissapointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1651276800000}
{"reviewTitle":"Adhesive pad lasted less than 4 hours","reviewDescription":"Adhesive pad does not work. Waited the recommended 24 hours before applying the remainder of the mount. The adhesive only lasted for about 4 hours before completely falling off the dashboard. Now we can't remove the suction cup from the adhesive pad so the dashboard mount is useless. Thankfully the vent clip does work well so far.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633910400000}
{"reviewTitle":"Good product, just not great for my vehicle","reviewDescription":"Problem is my vehicle does not. Have a really flat spot to put the extra suction disk, so when I put that on and then attach the suction cup, it starts to unstick and tilt forward after a day or two.  Have to buy a few extra disks.  Once in place the product works great, just getting it to stay there is the issue for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624924800000}
{"reviewTitle":"Does not stick to dash.","reviewDescription":"I didn't like that it didn't stick to dash. It does however stick on windshield.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673827200000}
{"reviewTitle":"Stopped working 2 days after return window - Seller made it right!","reviewDescription":"UPDATE: The seller reached out to me after posting this review and sent me a free replacement with an additional warranty. Very friendly to work with, and great customer service-----This product was great WHILE IT WORKED. It suctioned well to the glass, and held the phone at the proper angle. Unfortunately, two days after the return window expired, it stopped working altogether. The suction was lost, and the clip holding the cell phone broke. Really unfortunate we now have to throw away.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1594598400000}
{"reviewTitle":"Lasted two years","reviewDescription":"The phone holder worked great for 12 months. Then, the steel nut fell that holds the tilting screw fell off. Finally, the adhesive gave up the ghost. Time for a new one. I'll go for a vent or CD Mount next.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657065600000}
{"reviewTitle":"The Adhesive is Ineffective","reviewDescription":"Everything except the 3M adhesice is very nice. I followed the instuctions very carefully and gave it 36 hours to set before attaching the mount. As soon as I applied the suction cup to it, it fell off the top of the dashboard. I used another type of glue & now it works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"Back Bubbling","reviewDescription":"I mean I guess it kinda works?  Just poor quality.  It does hold the phone stiff enough, but it has unstuck from my dash a few times.  The WORST part is that the “carbon fiber” looking backing is bubbling up.  No moisture whatsoever, and it’s hardly been anywhere near extreme temperatures in my area.  It’s an eye sore to not have my phone there at all times now, and I really only got it for long drives or if I want navigational apps in front of me.Wish I’d have bought elsewhere.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1588032000000}
{"reviewTitle":"generally","reviewDescription":"Think carefully before buying because it is glued to the workbench!  There will be traces left after it is removed!  sucker sucks at all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676764800000}
{"reviewTitle":"Didn't work anywhere except vent","reviewDescription":"Wanted holder that didn't attach to air vent and had high hopes for this one. Unfortunately none of the mounting options would stick to my vehicle because of small textured dashboard material.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1668556800000}
{"reviewTitle":"May not work if you have a thicker case\/something attached to the back of your phone.","reviewDescription":"I have an iPhoneX with a popsocket on the back and this holder was not deep enough to fit my phone, so I had to return it. The arms that hold the side of the phone aren’t very deep, so my phone just kept sliding out of the holder.**EDIT** This company's customer service department reached out to me multiple times, even sending me another \"updated design\" of their holder, trying to make something work for my phone. The second holder still didn't fit my phone with the popsocket on the back, but their rep Lily was still very helpful.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1595376000000}
{"reviewTitle":"User error or defective product?","reviewDescription":"I'll start by saying that both the build quality and adjustability seem great. However, I haven't been able to enjoy those aspects because neither the suction nor the adhesive have held up for me. Maybe it's my fault, but I followed the instructions and tried applying to very flat and smooth surfaces, so I don't know what more I could do. I guess I'll have to buy some extra strong double sided tape elsewhere and hope that does the job.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1608854400000}
{"reviewTitle":"Did not hold up in the summer heat (80°-90°)","reviewDescription":"Have had this product for 4 months. Got it in February where the weather was still in the mid 40s. This product did not hold my phone weight (iphone xr with case). Made a turn once in the highway and it fell off. When it’s too hot and I mount my phone, it falls off mid-ride. I’ve wiped and dried down the area that I stick the suction cup in and it still collapses. Buying a different product now","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1592179200000}
{"reviewTitle":"Not so happy...","reviewDescription":"This, like every other suction cup phone device I have used, sucks (but not in a good way). After it failed I used the vent clip but it (a) never stayed attached to the vent, and (b) actually broke my vent. In frustration with having a suction cup that doesn't actually stay attached I finally cleaned it one more time, attached it to the windshield then put clear silicone all the way around the edges. Hopefully that'll work (though it looks a bit ghetto)","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1621296000000}
{"reviewTitle":"Good but can't use.","reviewDescription":"The holder is good but I stuck it on my windshield and can't get it off.  That may sound great but I can't use the holder because the side grips and bottom holders do not stick out far enough to hold my phone with my protective cover on the phone.  My only choices are to either change my cell phone covers or remover the cover altogether. Neither choice is preferred.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613347200000}
{"reviewTitle":"Doesn't last very long.","reviewDescription":"This was working pretty well until a couple of days ago.  It started coming off of my dash and I had to take my phone out of it.  I do like in AZ so maybe the hot dash is causing it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1627344000000}
{"reviewTitle":"Works well but with a slim cell (no pop up holder)","reviewDescription":"Product was easy to install and adheres well.  I have a pop up button on the back of my cell which makes it difficult for the phone holder to hold the phone securely.  I have to fiddle with it; sometimes take it out of the protective case so it fits securely. Once secure it works great easy to adjust.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1594771200000}
{"reviewTitle":"Not battery pack case compatible","reviewDescription":"Not battery pack case friendly but mock otterbox case friendly. Other than that very stable, happy with my purchase, i use it on my dash and so far so good, just annoying to have to change my phone case to be able to use it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622592000000}
{"reviewTitle":"Comes unglued","reviewDescription":"When your cars windshield gets very hot, amount does not hold to the plastic plate anymore","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657238400000}
{"reviewTitle":"Perfect for taller phones.","reviewDescription":"I never got this installed. I tested my Samsung S9 phone on it first and the back of the holder was too tall to activate the fingerprint function, so I couldn't open my phone. I returned it and was given a prompt refund. If you have a taller phone it's the perfect car holder!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612656000000}
{"reviewTitle":"It was bad because it didn't hold","reviewDescription":"As I said the adhesion didn't hold up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661040000000}
{"reviewTitle":"Poorly made .","reviewDescription":"The back side of the charger broke easy , sometimes it charges sometimes it doent ,","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1653955200000}
{"reviewTitle":"Great customer service & works well","reviewDescription":"I did not like my original purchase due to suction not holding. However, I was contacted by customer service and they replaced the unit and kept in touch to make sure I was happy. New unit works great. Be sure to contact the company if you have any issues, they want you happy.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1583884800000}
{"reviewTitle":"I like it.... But...","reviewDescription":"I like it, it does it's job. Sadly the suction isn't too great, it falls almost every week or so. Also it heats up a lot and makes it hard to put my phone in it without it over heating my phone, even when I have a windshield shade.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1600214400000}
{"reviewTitle":"Great unless you have a case on your phone… so not great","reviewDescription":"It is not deep enough to hold a phone with it’s case on. I have to remove my phone from my case whenever using it. Other than that it works very well.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Solid flexible mount that works well","reviewDescription":"Had this about a month so far and working well Super easy to install, good suction using the plate that comes with. Only failed once but it was over 100 degrees that day and I had the arm fully extended on some rough roads.Only thing I wish was a slightly larger space in the rear for accessing my phone's fingerprint reader.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Worked well for a while, but then....","reviewDescription":"This worked great for the first couple of months on my dashboard. Once the weather started to warm up, it started to fail. At first, it was every once in a while, but over time, it became a daily issue and then finally just stopped sticking at all. It's a shame because it did great in the beginning.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1634515200000}
{"reviewTitle":"Pretty good but sticky pad wont stick","reviewDescription":"Works pretty well but a couple of things would make it better. The suction cup vacuum pressure is not adjustable, the sticky pad adhesive is not strong enough so I cant use this the phone holder on my dashboard, and the vent tool is a little too short so my phone cant fit within the holder in my car.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633132800000}
{"reviewTitle":"How am I going to make it work?","reviewDescription":"Mounting is a problem. Suction is a problem, gets hot it falls off.  Don't want to use the adhesion thing, leaves marks on the dash. Had to use the fingers in the air outlets, works but not a very solid soluision.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1642377600000}
{"reviewTitle":"Will get the job done if not it’ll hold your phone for you at least","reviewDescription":"If you have a dense case or at the very least a pop socket... you may want to get a thinner case or ditch the pop socket. This thing doesn’t accommodate depth. Length and width however are great. It’s study from the arm to the suction cup. The ball joint that holds the device itself is somewhat flimsy but tighten the screw in the back once in a while and that should fix that. Not worse the price but certainly an ok product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595635200000}
{"reviewTitle":"Excellent customer service","reviewDescription":"When I originally bought this phone holder, I placed the disc it comes with on my dashboard and suctioned the holder to it. The holder would always lose suction and fall off. I messaged the seller to see if they sold replacement pats f just the suction part, and they sent me a new one in the mail! I am going to try and adhere it to my windshield this time and hope the integrity holds. Thank you!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1582848000000}
{"reviewTitle":"Good, but not with a case.","reviewDescription":"My phone did not fit with a case and the one time I got it to fit it was too heavy and the whole thing was shaking a lot. but it works well and did the job it needed to","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1649808000000}
{"reviewTitle":"On time","reviewDescription":"Good product but is shaking","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"Industrial Size","reviewDescription":"Compared to similar devices, this one has many optional settings to allow you greater flexibility on how you mount your phone.  The trade off is the size of the device and 'arm' the holds the phone is larger than expected and may look bulky on your windshield.It's not a 'spring' loaded holder but a 'clamp' with release type.  It's ok but you have to be good with one hand when mounting your phone to the cradle then compressing the clamp to hold it down.So far so good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1604102400000}
{"reviewTitle":"This May Be Awesome.","reviewDescription":"I’ve only had this for one day. I’m skeptical that any suction mount, with a long arm, can hold my iPhone 11 Max Pro in its case. It has so far, but it’s only been a day. I’m giving this 4 stars for now because the extending arm is exactly what I need in  my Toyota Sequoia. So if you’re looking for a long reach, this thing is sweet and solid. I will change this to 5 stars if it makes it a few months without crashing down into my coffee.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1570492800000}
{"reviewTitle":"Great quality and customer service","reviewDescription":"The VICSEED product with very well made.  Unfortunately it was not the best solution for my vehicle.  However, their Customer Service was excellent (specifically Kyra) as they reached to me prior to product arrival to provide tips for use and information in case support was needed.  Upon return request, Kyra reached out to understand my reason for return and see if they could assist me with a more suitable product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681084800000}
{"reviewTitle":"Works fine for the need","reviewDescription":"Wife uses it in her car to hold her cell phone.  Mounts well and hasn’t fallen off","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Works great!","reviewDescription":"It worked great for several months and then the locking mechanism broke.  Thankfully, I was sent a brand new one so customer service was great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Stays put, no one can hear me","reviewDescription":"The suction is pretty good, it fell one time from heat when I first applied it but since then it has not fallen off of my Jeep Patriot dashboard. I have a popsocket on my Iphone 11 and most of the time my phone does not slip out as long as I make sure my phone isn't angled and the side pieces are as tight as they can go. Phone has not fallen out when I take my popsocket off but that's a pain. The worst thing about this holder is that almost no one can hear me when I'm using speaker phone. I'm not sure if it's the placement of the prongs on the bottom blocking my phones speakers or if the phone is just a little too far away from me because my Jeep is kind of big. Either way, that's the worst thing for me by far because I bought this for hands free phone calls. Otherwise, the holder does what's advertised and works for directions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1597622400000}
{"reviewTitle":"Great for the car","reviewDescription":"We bought this to put in our car.  It fits well to the right of the steering wheel .  This is better than a suction  cup type we bought earlier.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Solid inexpensive mount, better on windshields","reviewDescription":"Has stayed on my windshield through and already rapidly changing temperature season in the Midwest. One day it’s freezing, next day 80’s with a heat index over 90°F, then back to normal spring weather in the 50’s and humid.It didn’t want to stay mounted on my dash, but it’s not exactly a perfectly flat surface. Instead of fighting and complaining I switched to the windshield and it’s been great. Holds my phone steady enough to act as a stabilized 4K dash cam. I only wish the tension ring holding the phone portion of the mount in place were smoother to position...but for “normal” advertised purposes, I can’t complain. It’s a really good mount and offers plenty of articulation and extension to be used without leaning forward in my seat.Update August 2021: On an exceptionally hot day I found this poor mount lying on the floor of my car. I think a year and a half is all it gets. Not too bad since it’s cheap, but also I had to find a new mount.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1589155200000}
{"reviewTitle":"Design could be better","reviewDescription":"This is by far the stickiest phone mount I have seen, so once you install it, it will stay in place and won't budge. I had to use a putty knife to pry it off my windshield to reposition it. So it's great for stability. However, the release button is on the side, which is unreachable when your phone is in the cradle. So I swapped out the cradle for the one on my previous holder whose base broke. Also, the arm isn't quite long enough. With windshields so steeply sloped these days, you have to mount the holder so far away to position the phone low enough but the arm doesn't extend far enough to keep the phone within reach. Build quality is pretty good - the arm is hollow plastic, but everything else is solidly made.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1620259200000}
{"reviewTitle":"First phone mount ever.... and not a bad choice.","reviewDescription":"I researched car dash mounts on Amazon and found this one w\/ good reviews and I also read the bad ones to know why they had an issue.My phone can't hold the sticky magnet plates (cuz I have a weird phone case)....When I received my VICSEED car phone mount, I didn't use the Mount on Vent option cuz...no! why would you block the air and it wiggles...dangerous option IMO.Easy to install...I would recommend you practice where you want it first before you peel for the long stick. Measure out the full Mount arm and when you reach to interact w\/ your phone. I placed mine in the middle of the dash and forward, toward me with full Mount arm out and it was PERFECT position without distracting my field of driving view...Don't over tighten the joints... I heard that the SUN can melt the glue so time will tell on this part. Would it be funny to make a little cover to protect it from the heat? Maybe too much.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1584403200000}
{"reviewTitle":"Sticks like bare thighs on a hot leather seat!","reviewDescription":"This holder was very easy to install. I live in the South and even in the 90°+ heat the suction cup has stayed adhered to my dash.The only reason I did not give this product 5 stars is because it does not fit your phone completely if you have a Pop Socket or accessory of any kind on the back of your phone. Other than that, it's gravy!A cool feature: if you don't have a flat spot to stick the suction cup to it comes with a small plastic disk; you would place the disk on the surface then place the suction cup to the disk. I didn't need to use it but it's a nifty option!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1626393600000}
{"reviewTitle":"I would buy again.","reviewDescription":"I have an IPhone 12 Pro Max.  It is large and heavy, probably the heaviest phone on the market.  This holder can handle it.  The only problem that I had was the cradle would droop after put the phone in it.  I was able to fix this problem by placing a piece of rubber band in the ball socket.  This gave a tighter fit and allowed the ball to grip better.  The suction cup holds firmly, even with the arm fully extended, holding the phone.  All the other connection held tight.The only reason it does not get a five is because of the little problem that was fixed by a rubber band.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1621382400000}
{"reviewTitle":"Not for IPhone 15","reviewDescription":"Bought for my sons iphone15 and it slipped out . It was securely fastened but the holder itself didn’t hold the phone properly","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720483200000}
{"reviewTitle":"complete waste of money","reviewDescription":"I read the reviews before I bought this product, so I knew it would have trouble sticking to windshields when its in direct sunlight.  However, I didn't realize it is essentially designed to ONLY stick to windows.  It needs a completely flat, smooth surface, so most of the spots where you could use this, like a dashboard, won't work.  Also, the extendable arm will ONLY move in and out, you cannot rotate the direction it aims the phone, so if you want to be able to readjust your phone to deal with glare, you can't.  this is now just a pile of junk that is sitting un-usable in my car.  very disappointingEDIT: after I posted this review I was contacted by the seller, who offered a refund. They also asked me, repeatedly, to delete my negative review. I’m glad I got a refund, but am not ok with being asked to delete my honest review simply because it impacts their rating.","isVerified":true,"ratingScore":1,"reviewReaction":"273 people found this helpful","country":"United States","date":1566777600000}
{"reviewTitle":"Doesn’t work where the sun shines (at all)","reviewDescription":"This product was extremely disappointing. I did lots of research to decide what phone mount would work best for us. I was excited about this product but it failed very quickly.First, the adhesive plate designed to stick to our dashboard didn’t hold. I followed all the steps, cleaned and prepped the surface, and it held until the sun came out. I’m not talking about desert sun, or Florida sun or even super hot days. Just a minivan, in the Midwest on a normal June day. When the sun came out, and the car warmed up, the adhesive stopped working and the mount fell.Second, I figured “Well, maybe I can try the suction cup directly on the window rather than the dashboard mounting plate.”  WRONG!  That normal, average sunshine that made the adhesive ineffectual, also completely melted the suction cup to the plate!  The picture attached shows me trying (unsuccessfully) to separate the two pieces with a chisel. The suction cup entirely melted and permanently attached itself to the plate.So, the plate didn’t hold and now I can even separate it from the suction cup. This thing lasted about 4 days total. Absolute waste of time. Avoid, avoid, avoid.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1626480000000}
{"reviewTitle":"Didn't Stay in Place & Clasp too short","reviewDescription":"The vent clip was too short for my newer 2023 vehicle. Clip would not remain in place, and kept falling off. Unstable. Didn't try to use the dashboard \/ window sticker mount since the vent clip did not work. Check dimensions first, Bc if you have longer vent slots, this may not work or stay in place. Sticker will probably ruin my dashboard and too clunky. I bought another small vent mount that didn't have a chomper clasp. This newer one had a hook vent insert that was longer with adjustable length. Also had a knob type stopper that rotates on outside of vent for extra stability and keeps phonei n place at all times. New one much better, cheaper, stable, rotates, less clunky and less expensive.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Can’t stick it to anything I wanna stick it to","reviewDescription":"Reading the instructions very confusing it seems you only can use the disk that comes with it so you can’t move it around to stick it where you want. the suction cup cannot be stuck on a window or any other fabric or any other part of the vehicle plastic what good is it?","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Sucks","reviewDescription":"Double side tape sucks.. even used 'adhesion promotor' (not included) after cleaning with alcohol (not included) and still fell off during first use. DO NOT WASTE YOUR MONEY.... just get one of those cup ones.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Adhesive is a Joke","reviewDescription":"Followed all the instructions to a T. Cleaned dash, applied, waited 24 hours… and it still came off the dash the first time I tried to use it. Would not recommend, adhesion is bad.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Dunno","reviewDescription":"Already did this. It doesn’t stick","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Don’t waste your money","reviewDescription":"Feel off after one month!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Not worth the money!","reviewDescription":"Fell of the same day I installed it! Cheap item and I should have known better! Beware!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Does not work.","reviewDescription":"I installed it with the initial suction and then with the heavy duty sticker and it would not hold up.  I’m trying to return it as I do not want to use it as a clip on my vent system.  Would not recommend this product as it appears it cannot hold the weight of an iPhone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1601769600000}
{"reviewTitle":"Horrible cell phone holder","reviewDescription":"I wouldn’t recommend this cell phone holder to anybody the suction cup keeps falling off my windshield there is no way to totally tighten down the swivel on it so it’s constantly moving when you put your phone in the first one I purchased came broken the second one I don’t know if I can return it or not I’ve tried but I get no answer from the company","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1579737600000}
{"reviewTitle":"It does not stick and the product came used.","reviewDescription":"When I opened the box and took out the unit, the round plastic bottom was sticky. There was no protective layer and I thought that was a poor package design.  I placed it in my car and it would not stick.  It keeps tipping over, without the phone on it.  I must have received a defective product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1588291200000}
{"reviewTitle":"Not good","reviewDescription":"I mounted this on my dashboard. After my second trip it came off the dashboard. Won’t stick to it, no suction. Money wasted","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"BROKE MY VENT","reviewDescription":"broke my vent clip after having it on for only around a week for light use with my iphone 8. Beware of this product. YOU GET WHAT YOU PAY FOR with this device. Suction is middle of the line and so is the adhesion.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643587200000}
{"reviewTitle":"Suction cup degrades to goop","reviewDescription":"Do not buy.The suction cup turns into goop and the whole thing will fall off as your driving.I only had it for a few months.The holder it self is grate but the suction cup is trash.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Cheap, wobbles, never again.","reviewDescription":"This product didn't last at all. Even worse, it broker 2 days after I could return it.The suction cup can be glued on tight, but the plastic lever used to clamp down is made of a cheap plastic that broke and now the mount wobbles while driving. Never buying this brand again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1597104000000}
{"reviewTitle":"Don’t get this","reviewDescription":"This does not stay on the dashboard. Falls, I don’t like going the hassle of returning things, really want to return this because it doesn’t work since it doesn’t stay. It’s fine as long as your phone is not in it, which defeatthe purpose.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1642291200000}
{"reviewTitle":"Doesn't last.  Holder for phone stop holding bad mechanism","reviewDescription":"I either got a defective one cause it seams well built. But the holding mechanism failed after I weak","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1688256000000}
{"reviewTitle":"Didn’t last a half year","reviewDescription":"The adjustment screw that keeps it tight from moving cracked and it will no longer stay in place and is useless.  Material needs to be changed.  I don’t recommend this product.  There are more quality mounts available.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1660867200000}
{"reviewTitle":"Works great!!!","reviewDescription":"Works great!!! Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"It does what it says...","reviewDescription":"Strong hold... It's been more than a month since I put it on my dashboard and still working good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Size is perfect for the flip phone.","reviewDescription":"Been shopping for a phone holder for my Samsung flip phone fitted with a protective cover for several months. When I saw the holder advertised on Amazon, I ordered it, hoping it would work.  It did.  A perfect fit.  Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Phone holder","reviewDescription":"Holds tightly on rough roads","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Very sturdy","reviewDescription":"Take phone on and off this thing hundreds of times for Amazon deliveries, so far it's very reliable and sturdy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Mi humilde opinión","reviewDescription":"Recomendado al 100%He tenido varios pero cómo este la verdad que noCómprelo , no se arrepentirá ☺️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Tough","reviewDescription":"I mounted this in my school bus. My hot, cold, bouncy high-milage school bus. After nine months, the device stays stuck. In truth, it might be impossible to remove. Now, the phone can bounce out of the holder, especially if you connect your phone to a battery. But this thing has the best mounting I have ever seen.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"Best Purchase","reviewDescription":"I originally purchase this particular item as my sister owns one herself. I loved that it was of great quality & easy to install. I have had mines for quite some time it is has not once failed me unlike other car mounts you may have purchased from a retail store that doesn’t last more than a month. Buy it you won’t regret it!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Looks good","reviewDescription":"Haven’t used this yet, not because there is something wrong with it, just haven’t found the space in my little Bug to put it. Quality is good and I’m sure it will be fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"It WORKS!","reviewDescription":"I purchased 2 of these phone holders by VICSEED for my truck and my wife's car.  My wife's phone holder has worked perfectly since installing it on her car's dashboard.  I installed one on in my truck and the sticky pad\/plate came loose within 1 week.  I replaced it from Amazon and again it did not stick.  I contacted the company and they were more than willing to make it right and fix the issue.  They sent me 2 new sticky pads and this time it is definitely holding.  The phone holder is easy to use and it works perfectly now in my truck.NOTE:  The company did contact me 2 weeks later to see if I was completely satisfied and if it worked.  I'm very satisfied and there is nothing like GREAT customer service.  Thanks May from VICSEED!","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Update to original review","reviewDescription":"After my original review, the seller reached out to me to make it right. Suggested a different one and sent to me at no charge.  USPS lost the 1st one so they resent. I am extremely happy with the one they sent me. Its smaller and works great for the RAV4. I greatly appreciate the seller reaching out to me and suggesting the phone holder they did. Great customer service, we stayed in constant contact thru out the processHighly recommendBig and bulky; didnt work for Toyota RAV4","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651104000000}
{"reviewTitle":"Great product","reviewDescription":"It fits","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Haven't used it yet but seems to work.","reviewDescription":"Hope it's tight and holds tight under power and doesn't vibrate off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Good phone holder so far","reviewDescription":"This phone mount works great holding a phone.  I have only had installed for one long road trip (approximately 2000 miles) and this mount held two different phones, one with a case and the other without a case very security and can be adjusted from my mounting location on the dashboard to be easily within reach and view.  Has held up more securely than other cheaper suction mounts I have used in the past.  The ratcheting lock tightly held both phones and the one-touch release is easy and quick to use.  The reason for the 4 star review is that when a phone is not installed in the mount, the ratchet mechanism rattles constantly while driving, both in the fully open and fully closed position.  I remove the mount and keep in my center console with not in use to eliminate the rattle, but it would be nice if I could leave the mount suction cupped to the dashboard full time instead of removing when not in use.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1575504000000}
{"reviewTitle":"Dose not work all the time","reviewDescription":"The mount started out great,started loosing it grip on the windshield at times.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687564800000}
{"reviewTitle":"Almost perfect","reviewDescription":"Well-made, holds the phone securely in place and the adhesion to the windshield is extremely strong.  Almost too strong.  I'm not sure if it is the intended design, but it cannot be moved (e.g., I wanted to use the holder in another car and couldn't remove it from the windshield).  The only other item I did not like is that the release button (for removing the phone from the holder) is on the left side instead of the right side.  Minor detail, but that design makes it a bit awkward for one handed removal (for me anyway).","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1646438400000}
{"reviewTitle":"Excellent customer service","reviewDescription":"Edit*: The manufacturer reached out to me shortly after writing this review and not only replaced the old clip free of charge, they will be sending me a new one once they revise this version AND updated my warranty to a lifetime. Lily was super quick to reach out and has been so much help.Thanks for making this great experience.I've had this for little over a month, I really liked it at first but after just a few car rides the clip for the vents started to get loose so I would have to constantly readjust it. Just yesterday I was readjusting it again and the side of the clip broke off sending the spring and axel flying all over my car.Super disappointed 😔 I really liked this design but it started to not work properly after about 2 weeks and now it's broken.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1594425600000}
{"reviewTitle":"Great product will continue to use","reviewDescription":"Adhesive to my dashboard mount wore out and eventually lost stick. Maybe due to heat. The vent clip chipped off after a while as well. I am now left the suction option. Unfortunately the adhesive between suction and dashboard mount is so strong I can’t  separate without risking further break. Can I have another adhesion slip for the dashboard mount?The product is great and I love it which is why I want to continue using it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651622400000}
{"reviewTitle":"Good mount.... with a design flaw","reviewDescription":"I actually really like this mount for the most part. I have an otter box and a pop socket on my phone case, and it surprisingly held it pretty well! (I still take my phone case off, because I don’t want to risk it, though) The mount is easy to install and adjust, and comes with an air vent attachment and a suction cup attachment. I used the suction cup, aaaaand that’s where my issue lies. :\/ The mount’s connection to the suction cup is basically worthless - the cup adheres just fine! But it’s connected to the rest of the mount in such a way that the whole mount can shift around in a circle on top of it. There’s no way to adjust this, unfortunately, and I’m still trying to rig something to keep it in place. I think I’d still recommend the mount, but I do wish I’d known in advance!!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1581638400000}
{"reviewTitle":"Holder good. Adhesion fail.","reviewDescription":"Great phone holder if you are prepared to buy your own adhesive tape. We bought our own after it would not stay. The phone holder itself works better than our last one and seems to be good quality. They just failed on the adhesive part, but that can be easily remedied.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1669075200000}
{"reviewTitle":"Good product. Just need one that can withstand the heat.","reviewDescription":"I am going on exactly 3 years since I've had this product. It worked great. Only issue is that the product cannot handle heat, from my understanding. The product has fallen off my dashboard a few times. The adhesive is good but gets bad after awhile. Cleaning it helped a bit. Now, one of the clamps that hold the phone, is starting to break. It is loose now. Let's see how long it holds up.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Great and Very Handy iPhone Holder - Adhesion Issue Nicely Resolved by Great Customer Service","reviewDescription":"Update Below:I’ve owned this now for just about four months.  For the first three months or so, I had a very hard time with the suction keeping it attached to my dashboard.  I would frequently get in my car the next day only to find it sitting on the floor.  Finally just in the past month, it’s stayed put.  Otherwise I like the way it holds my iPhone 8 Plus securely and I can easily see my screen.  With hands-free law just taking effect in Massachusetts, I’m glad to have this since I can easily tap my phone to answer a call, or bring up my navigation maps with no undue effort.  I do like that you also have the option to attach this to your vent, but I have not ussed this option as yet.Update:  The problem with it falling off has been resolved.  The customer service rep sent me a new kit.  I think you just have clean the dash extra clean. and press and hold the disk for several seconds to ensure adhesion.  Mine has not fallen of now for quite some time.  It easily fits my iPhone 8 Plus with it’s case.  My wife also has the 8 Plus, but in a “wallet” case; this won’t fit into the holder since this case is much thicker than mine is.In short, I now love this holder and it works perfectly thus far.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1588118400000}
{"reviewTitle":"does it's job","reviewDescription":"ok, so it works, and I really can't say anything bad about it. I use it with a phone case on my phone AND a pop socket. So it doesn't fit perfectly, but usually doesn't fall out even though it's pretty tight fit. I have it positioned on the dash of my van. And i do wish the extension arm was maybe an inch longer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Beautifully Made, but not for my car.","reviewDescription":"This is a high-quality product that is beautifully made, very sturdy, and I'm sure will last for a long time. If you can get it to fit in your vehicle, I'm sure it will serve you well.  However, I could not make this work in my car and sadly, must return it. I have a 2018 Subaru Forester.  Not enough height from dashboard to windshield.  I cannot mount directly to the windshield either, because my car has what Subaru calls \"EyeSight\"- cameras that show blind spots in the sideview mirrors, and also detects things straight ahead, like if the car in front of you suddenly slows down, it will automatically slow my car to avoid collision.  Anything mounted on windshield interferes. It does come with a vent mount, but I specifically bought this to avoid using a vent mount.  They are not a good option for me with my big Pixel 3XL phone and rugged case- very heavy.  Tried it in my neighbor's pickup truck and didn't work there either- that vehicle has a sharply angled windshield with very little space to the dashboard. The mounting bracket was just too tall no matter how we tried to attach it. He ended up buying a CD mounted bracket which worked for him. That's what I will try next.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1598832000000}
{"reviewTitle":"Very good, but not ideal","reviewDescription":"Not perfect, but pretty good. The suction cup is made from a clear silicone rubber compound that adheres very well to textured surfaces common in interior car plastics. Mind you, you'll likely need to clean the surface with rubbing alcohol to remove any slick shiny stuff. I'm quite sure it will stick to glass, but that's not where I wanted my phone, so I didn't attempt it.What it will not stick to is any surface that has even a slight curvature. This is unfortunate because my first choice would have been such a location.Also problematic was the included plastic disk with a back adhesive covered with a red plastic, similar to auto trim tape I've seen and used many times before with good results. This disk is so you can apply the suction cup after sticking it to  where you want it to go. In my case, it didn't stick any better than a post-it. I think this particular disk had bad adhesive. Disappointing, but not a deal killer.I imagine that the soft silicone rubber of the cup (which must be clean when you use it) would warm and deform and pop off a windshield in a hot summer day. It is much softer than most suction cups of this type, which seems to help it adhere to tougher surfaces. It works well but I don't imagine it lasting as long.This also comes with a vent clip holder which works very well, but I wish I could use the included arm with it. This is not possible as it currently ships; i.e., I wish the main arm attacked with a ball socket on both ends and could be swapped. I'd recommend this change to the manufacturer when they update the design.I've had this phone holder for a couple of weeks and it's one of the best ones I've tried. It can use improvement, however, and that's why I give this four stars rather than five.","isVerified":true,"ratingScore":4,"reviewReaction":"138 people found this helpful","country":"United States","date":1561248000000}
{"reviewTitle":"Excellent product","reviewDescription":"This is a well-made product that has great stability when installed according to the package directions. I installed it on my dashboard in my Subaru Ascent and it’s extremely stable and holds my phone with no problem. I needed a phone mount with a longer arm due to having an SUV that by nature has a deeper dashboard. My only real complaint regarding this product is that it would be nice if there was a way once installed to change the angle of rotation by tightening and loosening something. The way that the product exists currently, once it is in place, whatever angle it extends out to is where it stays forever. You can shorten or lengthen the extension arm as well as change the height of the holder up or down, but you cannot change which direction it comes off the anchored adhesive circle. Overall, great product though, and I actually just bought a second one for my best friend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1650412800000}
{"reviewTitle":"Nice set up","reviewDescription":"The main unit seem to be well made but could be a bite more sturdily made, My 6 in phone with heavy case fits the phone clamp just fine but can get a little shaky depending on road conditions. Used a little non oily cleaner on my dash and this unit has stuck directly to the dash without the use of the mounting disk which was supplied. My next trip to Florida from the northeast will be the test to see if it stays where put. I would recommend this item to a friend. As far as the AC duct mounting clamp, I'm not a fan. 1st i doesn't want the kind of weight hanging on my AC vent, 2nd it block the vent and lastly I really don't like the idea of my AC or heat blasting the back of my phone. Extreme heat and cold is the worst enemy of any battery, so as far as my choice i would rather not use it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1629676800000}
{"reviewTitle":"Holds phone nicely","reviewDescription":"While this item holds your phone well, the base isn't sturdy at all which prevents the suction cup on bottom from working properly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"amazing Customer service!","reviewDescription":"Follow up:Kyra at Vicseed was very helpful in addressing my issue and sending me a replacement with detailed instructions and tips on how to ensure it’s durability. Grateful for that.This mount feels like a good mount, but only after 5 months the suction cup began to fail. Now it wont even adhere to my car dash at all. It is poor quality and its better to buy something that uses better materials.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684713600000}
{"reviewTitle":"Falling off window","reviewDescription":"I’ve had mine for six or seven months. Really like how it works but now it will not stay on the window anymore. Should I expect it to still be hanging on or is normal lifespan less than a year?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Didn’t work well","reviewDescription":"The adhesive didn’t suck well and every time I hit a bump the phone would slump! It was as tight as I could get it. Waste of my money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682294400000}
{"reviewTitle":"Great for 24 hours, then a major disappointment","reviewDescription":"It worked perfectly for about 24 hours, and then the adhesive holding the dash plate in place gave and the whole thing came down mid-drive. It won’t restick, I tried removing it from the base and the adhesive on the mount itself won’t stick either. I’d previously had an iOttie car mount and chose this one as a replacement based on the reviews. Big mistake, I should have just gotten another iOttie mount and stuck with the brand that had already proven itself.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1585440000000}
{"reviewTitle":"Too small for my phone","reviewDescription":"I have a Samsung Note 10+ and this could not hold it with my case on. I ended up flipping the holder upside down and attached it to the AC vent and it worked, but it's not easy to get my phone in. I wish it was slightly bigger so it could hold my Note+ without issues.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1642896000000}
{"reviewTitle":"Fine for cooler weather.","reviewDescription":"I thought it was great at first. I'm short and it was perfect for my minivan dashboard because it extends. Then the sun came out, warmed up the dashboard and the damn thing falls right off the pad that holds it to the dash. The 2nd one for the vent cant hold the weight the my Galaxy s8 with a case on it and I constantly am looking for my phone on the floor.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623888000000}
{"reviewTitle":"Get a grip!","reviewDescription":"I liked this product at first until the adhesive lost its grip.  Followed the instructions which are straight forward.  Works great until the adhesion wears off, can’t find the same adhesive stickers with the proper thickness anywhere.  So you end up wasting money.  So disappointing for a potentially great product.  Come on Vicseed, hook it up, don’t fail your customers.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"Not a good suction cup","reviewDescription":"The part that can clamp to the vent works really well however the suction cup would fall over and over from the very beginning of me buying it and I kept putting warm to hot water for it to get sticky again per the instructions and it failed over and over. I only kept this item because of the clamp that can be attached to the vent.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1601337600000}
{"reviewTitle":"Suction doesn't work in ANY way. Using via air vent is not eh best choice...","reviewDescription":"I have taken long to write the review due to other pressing matters, but I wasn't able to use this product for more than 2 days after purchase. Finally trying via air vent reluctantly...No form of suction didn't work: a) trying to use the suction cap with the windshield (cleaned in advance) b) trying to use the suction cap with the base fixed via sticker to the dashboard. I wouldn't purchase this only if used via air vent. Not a great purchase...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600041600000}
{"reviewTitle":"DON’T BUY!!!","reviewDescription":"This thing is a waste of money. The suction cup has no actual suction and if it does it’s not noticeable. The adhesive on the cup is crap as well. I placed it on my dash and window (without my phone in it) and the weight of the shaft was so much that the suction cup came off, without me touching it. Please buy something else, don’t waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1597190400000}
{"reviewTitle":"Great Phone Holder (but)","reviewDescription":"If you have a pop socket it will not work on the holder - so I have to take my case off everytime but then it’s greatAug 2020 - the glue didn’t hold up to the heat and has fallen off -","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650240000000}
{"reviewTitle":"Fell off of windshield after less than a day","reviewDescription":"Not really a whole lot to say other than I am disappointed by this. I have a phone mount that goes in a cup holder and was hoping to free up the cup holder after buying this one. However it just would not stick to the windshield. I made sure to clean it properly and let it dry before attaching it. However it just kept falling off hours later.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1583712000000}
{"reviewTitle":"Vicseed needs to start including replacement locking handles","reviewDescription":"This could have gone 180 degrees the other way, but I found the replacement part.  The mount works well enough, the locking handle\/retaining nut wore out quicker than I thought it would, or should.  Without the locking handle, the mount is worthless.There is a place here on Amazon that sells the part so I got a couple.  Seriously Vicseed, include an extra one or two.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1662768000000}
{"reviewTitle":"Nice!","reviewDescription":"The dash top of my car has a subtle curve so I was afraid this wouldn’t stick. I’ve been using the long arm holders that stick to the windshield, but they block a bit of view. After cleaning the area, I applied the sticky pad that is included to help adhesion. Well, the darned thing kept falling off. With nothing to lose, I attached the holder directly to the flattest part of my dash and voila’...it stuck perfectly! After about a week of use, it’s still firmly attached. The phone release button is in a different place than the old one, so I’ve been grabbing and pulling until I realize the release button isn’t on the back. If it can handle my inadvertent rough grabbing and pulling, I expect it to have no problems with regular use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1590019200000}
{"reviewTitle":"Set nut","reviewDescription":"Once this takes a hold you'll really have to work to get it loose..and holds my phone steady even attached to machines wind shielding Orderd one for every one of my vehicles and machines..the only flaw is the set nut at the phone base..cracked first day as did all the others..simple fix tho","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Suction cup stands up.  Heck, the whole thing stands up to bouncy semi truck.","reviewDescription":"This phone cradle surprised me for the $$ it costs.  I have a couple of high dollar cradles that don't hold up as well as this one has so far.  The suction cup has a gel that is VERY sticky.  Make sure it's where you want it, because it's a BEAR to break the gel loose from the mounting pad they include with it.  But, it has stood up to all the vibrations and bouncing that my truck and the rough highways can dish out!  My expensive cradles lose suction and fall down, but this unit, mounted to my dash just stays right where I put it.  I'm going to order another fairly soon for my car.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599436800000}
{"reviewTitle":"great customer service","reviewDescription":"This product didn't stick to my dash due to the rough surface of my car but customer service was wonderful with this product!  They communicated with me consistently regarding my options.  I did end up using the clip for the vent and it works great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675123200000}
{"reviewTitle":"Questionable use on vents.","reviewDescription":"I put this device on the vent of my Ram truck and it was too heavy, closing the vent.  So, if you're planning on using it on a vent, beware you won't be getting any A\/C or heat out of it.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1675641600000}
{"reviewTitle":"Quality is great but the depth did not fit my IPhone 11 with a pop-up","reviewDescription":"The quality and look was great but when it didn't hold my IPhone 11 with the popup on the back, it was no good for me. I found that this new phone for me was a bit slippery and large to hold and I really need to keep the popup on it so I won't be able to use this holder. I don't know why they couldn't have made the arms a little more extended. I don't think it would have taken away from the look or been in the way of anything.  Fortunately, my friend needed one for her car so I gave it to her and loves it. The price was very reasonable too for the quality.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1597017600000}
{"reviewTitle":"It’s a preference item shop around","reviewDescription":"I really like the mounts the dash and vent mount but one the dash mount it a bit awkward maybe it’s just the way my dash is set up just feels I can’t get the perfect spot for my phone and I spend to much time adjusting the mount and my phone same with the vent mount and two the vent mount weighs down my vent and blocks it over heats my phone during the winter and makes my phone to cold in the Summer so that’s vent can no longer be used but in all I like it the way the button works that releases my phone from mount is perfect I don’t have to force my phone out and mess up my set up trying to get it out","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1582502400000}
{"reviewTitle":"excellent customer service","reviewDescription":"Whereas I had previously written a somewhat negative review I would like to amend it.  The product did not work for me as it didn't fit in my vents.  Customer service responded immediately and offered to find a solution.  I chose not to do so but they graciously refunded my money even though it was past the date to do so.  What I would say about the product is that is well made but you have to be sure you can get it to stay on your vents.  Customer service will help you.  I am guessing that it will fit most vents just not mine.  Do not be reluctant to buy this product it's a good overall design.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1603843200000}
{"reviewTitle":"UPDATED REVIEW:","reviewDescription":"UPDATE;  Betty and the VicSeed team have gone WAY above & beyond to correct the issue and make sure I am a satisfied customer.  The follow-up has been AMAZING.Their A\/C vent mount & the CD slot mount work very well and I am HAPPY now with the product.  They make driving safer!  I have not tried the windshield mount they said was improved and sent me.......This product had only been in my car for about 2 months and the adhesive melted, stuck on my windshield leaving a mess and the actual phone holder was separated from the adhesive and flopping.  Completely useless.  Of course, now it's WAY past the return date.DON'T BUY THIS PRODUCT!","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1584662400000}
{"reviewTitle":"Doesn’t work great","reviewDescription":"I got this to mount on the dash and it’s not adhering well at all since it’s over half off. It hasn’t fallen off yet but I fear it will soon since it shakes a lot and my phone adds weight  😬 it has a button on the side the widens out and then you can pinch the sides in but honestly seems really cheap and was about $30. Not worth it 🙁 I got a different one for my husband and that works a lot better. Would have returned but tossed the box when I opened it. 🤦🏼‍♀️","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"This thing is junk at six months.","reviewDescription":"I used the hard plastic puck and mounted to my dashboard. The first five months it worked well, no complaints. Now for the last month, see video, the arm is swinging back and forth. There is ZERO ways to tighten this up and now, it will NOT release from the plastic puck I put on my dashboard. I'm in Florida and if this thing turns to junk over the winter, no way it would last through a Florida summer.It literally swings side to side unless you're on perfectly flat roads doing 35mph. ANY bumps, changing lanes at highway speeds, this thing is moving. Utterly worthless now.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1648339200000}
{"reviewTitle":"Ordered new, received used","reviewDescription":"The item is definitely used, suction pad is dirty. The box is missing the phone holder and the dashboard pad. Disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Terrible quality","reviewDescription":"The adhesive is not strong enough to hold a phone and just fell off after installing. Don’t not buy","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Careful ! Don’t buy it dashboard is bumpy.","reviewDescription":"The suction powr\/adhesive was terrible ! It wouldn’t stick on my bumpy dashed board what so ever . In the instructions it did mention for bumpy dash board it may not stick just to wipe it down make sure it’s clean & dry ,but It didn’t show any stickiness at all ! it does come with another Option to install , and that is your vents. I didn’t want that because it blocks a vent for my heat & warms up my phone super bad, so I can only use my heat towards my feet or on windows . Other than that It does hold my phone even with the case on it & it’s easy to rotate the phone around if you need moving it to an angle . Not terrible butNot the best either!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1613347200000}
{"reviewTitle":"Many issues with this product","reviewDescription":"I am so disappointed this product hasn’t worked out. I ordered one last year and it worked fine for months until one of the parts fell out while I was driving and made the whole thing fall on me. I thought it was just a fluke and ordered a replacement. This replacement only lasted me about a month and a half before losing its suction power and falling off my dashboard. I’m so disappointed because now I will have to buy a replacement from a different vendor since I don’t trust the quality of this one. Don’t buy this!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1666569600000}
{"reviewTitle":"It is good in theory. But doesn't hold up","reviewDescription":"I live in California, it says the phone holder will stay and hold the phone up but over time the phone weight weighs it down, plus the California sun melts the \"impenetrable\" suction of the stickiness. It doesn't doesn't stick after about a week of being in 95+ heat in the car. Obviously I'm not going to unstick the holder and take it inside so unleash you live in the colder weather idk how this holds up for people. The vent clip was just way to big. The swivel was probably the only good thing about it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Powerful suction, doesn’t move","reviewDescription":"Wasn’t what I thought it was going to be….. once you place it in your car, make sure it’s where you want it to be, because I placed it in the wrong spot, and can not get it off my window. The last mount I had easily came off and stuck back on pretty well, this has the same system, but this one will not move. Good thing to have, but ensure it’s 100% where ton want it to be. Also doesn’t hold the phone while in the case. So if you have a case, it does need to be removed. Unless you’re like me and have a life proof and outer box. Can’t take the phone out of the case","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1650153600000}
{"reviewTitle":"Didn’t stick to my dashboard","reviewDescription":"Had the product on my dashboard for less than a day after installation. I even let it sit for 24 hours as recommended before using it. Would not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Junk","reviewDescription":"Get a magnetic holder, the arms manual arms on this broke after the first week.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Suction isn’t good w\/ direct sunlight(heat)","reviewDescription":"It’s a good product, but if it’s in direct heat from the sun, for a long time. It will fall off on its own, and sometimes I’d be driving, using gps, and it falls off!!Update:I’m now using the added mini clamp attachment for your air vent, and it actually works a whole lot better. It doesn’t obscure my view, nor does it fall off in the heat, as the main attachment does. My air vents are vertical and they work well with it. Since the attachment can be rotated 360°, I imagine it would work with common horizontal ones, but I can’t give a guarantee.Update:*********Vicseed provided a type of refund, and with that I’m thankful for their customer service.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581552000000}
{"reviewTitle":"Didn't work in my CMV.","reviewDescription":"Bought it to get my phone out of the cup holder and hands free visible while driving.Decent product, but it didn't work as I hoped. Textured dash didn't hold the plate for the suction plate.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1670025600000}
{"reviewTitle":"Great but not perfect","reviewDescription":"It works as intended but the prongs on the side aren’t long enough for my phone since I have a wallet on the back. If they would make one longer it would be a 10\/10. Also sometimes on heavier devices the ball joint swivels while driving and the phone can fall off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"First one broke. They replace another one with no cost. Amazing cupcakes service!!!","reviewDescription":"The clip that holds the phone is slipping. I regret getting it. Hopefully it last and I don’t have to get another in a few months.** Update**Even though I given 2 stars for the first review. I will have to give it 4 stars now. The customer service is amazing. They reached out to me after seeing the review on Amazon. I wasn’t expecting it at all and was taking the loss on this one.  They mailed out another holder at NO cost. I truly hope this one works. Again, amazing custom service and really want their customer to be help with its product.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1577836800000}
{"reviewTitle":"Splitting hairs but saving dollars in the end","reviewDescription":"I own an iottie and have had a few of them over the years. The VICSEED is most definitely a direct competitor to the iottie brand of cell phone mounts. This product over all is built better in most area’s except for the cellphone clamp. I find that in my vehicle it takes a second more to mount the phone because you have to manually clamp the phone in place, where as the iottie is spring loaded. Over all this product is fine and you will only miss out on a little extra convenience found in the iottie. You won’t be sad if you get either one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"sturdy dash-mounted phone dock","reviewDescription":"I found the adhesion of the dock, itself, was poor, even after cleaning my dash with alcohol. However, the adhesive disc that comes with the unit stuck well to the dash, and it was easy to attach the dock to the disc with crazy glue.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"GOOD","reviewDescription":"It's good, i like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684195200000}
{"reviewTitle":"Adhesive failed when the van got hot.","reviewDescription":"My AC needed recharging, but before I got it done, the cell phone holder fell off the dash.  I would like to get another adhesive disk, as it is Fall now, and my AC is charged again.  But, I don't know how to get that.  The Amazon help connection to the manufacturer takes me to a site that is not working - so I cannot ask to have a new adhesive disk sent to me.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631750400000}
{"reviewTitle":"Overall a Solid Product With Some Minor Problems","reviewDescription":"The car mount has worked pretty well for me and I have had no issues attaching it to my car. I mainly use it with the air vent mount and it seems pretty sturdy. My one complaint is that I feel like the mechanism that locks my phone in place is a little finicky. It sometimes feels like it is a bit loose even though I can't tighten it anymore. I spend a little time trying to adjust and then eventually give up. The phone has not fallen out or anything, it just doesn't feel super secure and locked in place.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1612051200000}
{"reviewTitle":"Pad bad. Straight suction cup good","reviewDescription":"The only issue I had was with the pad that was supposed to go on my car. Every time the heater came on the adhesive would come off. After that I just stuck the suction cup directly to my dash and it works 100x better. Love this thing best one I’ve ever got as soon as I got rid of the pad","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1641945600000}
{"reviewTitle":"Stinks","reviewDescription":"This think stinks. The suction cup is useless so I now try to connect it to the ac vents. This lasts about 20 mins and then it collapses to the floor. Piece of junk.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1596672000000}
{"reviewTitle":"bad product","reviewDescription":"Unfortunately it broke as soon as I started using it.poor quality now i have to buy another one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625097600000}
{"reviewTitle":"Temperature prevents it sticking.","reviewDescription":"Living in Florida temp in car prevents it from sticking to glass or dashboard. My car is 2009 focus and slanted dash makes it difficult also.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1626134400000}
{"reviewTitle":"Doesn't work","reviewDescription":"The metal pad does not stick and the arm is not strong enough to continuously hold a dual screen LG ThinQ v60.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619222400000}
{"reviewTitle":"Only for Small Phones","reviewDescription":"The suction cup does not hold phone in place - I would say it isn’t designed for larger cell phones when you have it extended half or more.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622851200000}
{"reviewTitle":"Disappointed","reviewDescription":"It Kept falling of. I drive a semi truck and with every bump on the road it would fall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Waste of my money","reviewDescription":"Poorly constructed the suction power was not adequate to hold the product","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648425600000}
{"reviewTitle":"The clip","reviewDescription":"The clip portion of this does not hold well to my vents.  Even though it is adjustable when I move it from the round ball, it comes off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578528000000}
{"reviewTitle":"Does not stay put","reviewDescription":"Loosens a little bit every day and has to be reattached on a weekly basis. Do not recommend if you want something you don’t have to constantly fiddle with.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1576540800000}
{"reviewTitle":"Doesn't Stick","reviewDescription":"Would not stick to my dash even with the adhesive. Once the adhesive was put on, there was no way to attach it to my mirror. Didn't last a day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1571011200000}
{"reviewTitle":"Not for pop sockets","reviewDescription":"I have just got this and havent really used it yet. It stayed on through the night at cool temps. Im only doing a review to warn my pop socket lovers to beware. Pop socket is too thick. Maybe with an ultra thin case? I even switched to my thinest case and it still wouldnt fit width wise. This is one that has glitter in it. For now im going to use this case so i can quickly take it off and on to put the naked phone in the holder.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599868800000}
{"reviewTitle":"GREAT inside-out - but 2 misses outside-in:","reviewDescription":"1) I need an extra sticky pad for a second-choice location.  I know they're available (not sure of the size match yet) and I don't want to order a dozen.2) Big miss: a normal phone case will not fit.  Naked phone only.  It only takes a minute either way - but it's another thing to get lost in between this and the other thing.  And I really prefer to keep my phone in its case.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1623283200000}
{"reviewTitle":"Easy to use but bounces","reviewDescription":"I was really happy with the quality and ease of installing.  However, i notice that it bounces quite a lot when driving.  I use the suction cup on windshield, so the arm has to extend all the way for me to reach my iphone 11 pro.  I am guessing that the combination of phone weight and extension just results in a bounce.  it could be fixed with a more rigid arm.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"Horrid suction! Unless u have a very light phone......stay away","reviewDescription":"Actually held my phone, I have a note 9 and it has a case and stuff on back but the suction or stickiness didnt last long. Made it about a week then fell off, tried it on dash instead of windshield and that didnt stay an hour... so I now have a useless phone holder.... it was hard to figure out how to open up the holder arms as well. Its tight. Nifty idea just no strength!I have been impressed with the company trying to remedy the problems.  Great company.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579305600000}
{"reviewTitle":"A bit bouncy","reviewDescription":"Used with an iPhone 11 in a tanky otterbox case (keep that in mind). Mounted on a solid steel, epoxy coating device made for such applications and its locked down solid as a rock. I don’t use this in the extended application option. I keep it short and it definitely has a moderate vibration. Tolerable, yes! Still a nuisance though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1635984000000}
{"reviewTitle":"Suction cup rubber does not last very long.","reviewDescription":"Really loved dismount. Bought one for myself and my son. It fit in the awkward spot that I needed my phone to be mounted. Only problem is that the adhesive disintegrated in less than 2 years. And I'm trying to find replacement adhesive. I really don't want to buy a whole new unit","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"👍","reviewDescription":"I am beyond happy with vent holder. I can't use window hold cause it's  winter and below Temps.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Good product. Great customer service.","reviewDescription":"The holder is a nice design. Grips the phone well, release button very satisfying to click. Air vent clip broke a year in, but the 12 month warranty allowed me to get a new one free of charge. Customer representative May was very helpful and accommodating. She responded to my emails very quickly and got a new clip in about a week. Thank you, May.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Great customer service, decent product","reviewDescription":"This product does not stick to the dash board as advertised. The 3M dashboard pad is completely useless and has no sticky adhesive to it. Once taking off the protective piece to adhere to my dash it came right off. Now wont stay at all. I'm very disappointed, however I need this product now as I'm traveling.Edit...upon initially sending this update the company contacted me, gave a refund and was kind enough to offer a replacement. I am truly thankful for that. Great customer service and better product was received.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1575417600000}
{"reviewTitle":"Good Car Mount","reviewDescription":"The plate used to put in the dash was absolutely terrible, and suction cup had so much adhesive from the plastic peel on it... felt like it should of been the other way around. This attached to my window just fine but that wasn’t what I was looking for. I’ll buy a different suction mat for this mount.Was contacted and was sent a new Mount. That was much better then the previous one. Would like to thank the company for the support.  4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1595376000000}
{"reviewTitle":"Don't buy this. It doesn't work.","reviewDescription":"This product will NOT adhere to any surface in my car! This product has ABSOLUTELY ZERO suction power. This product is NOT easy to install. You can't install this product because it DOESN'T stick to ANYTHING! Plus, if you install this product by clipping it into your AC vent this DOESN'T WORK EITHER! The weight of your phone tips it down. Don't buy this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1616803200000}
{"reviewTitle":"It broke, yours might","reviewDescription":"The clippy thingy used to fasten this to the air vent broke. Looking at it further it isn't well engineering in that area. Pity because the holder itself is nice. The suction cup didn't work as there wasn't a large enough smooth surface and any of my vehicles to allow for that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1628640000000}
{"reviewTitle":"Terrible Product","reviewDescription":"I purchased this item back in March and installed it on my car's AC vent.  For all the time I used it, my Samsung Galaxy S21 either kept falling off of the cradle or pivoted downward because the ball's socket was too loose.  My phone isn't heavy by any means.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1628640000000}
{"reviewTitle":"Would not work.","reviewDescription":"I could not get the suction cup to stay in place on either the flat part of the dashboard or on the window.  The assisting pad with the adhesive side did not work either. The pad's adhesive was either really weak or non-existent.  Also to add to the problems with the suction cup not staying put, the holder was the heaviest part of the device which caused an uneven weight dispersion.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1596412800000}
{"reviewTitle":"Waste of money. Wouldn’t hold","reviewDescription":"Didn’t hold my phone, not even for a few minutes. Garbage","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Does NOT stay attached","reviewDescription":"Difficulty in adhering and once attached it only stayed in place for 1 week. Waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Cheap hardware","reviewDescription":"I like how stable the mount was but the nut that holds it in place was very cheap. I only had this two weeks and when I was switching the position from straight up and down to horizontal the nut split. This is when I was loosening it too.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"It just wouldn't stay in place.","reviewDescription":"We continued to try to get this gadget to stay on the dashboard, but was not successful. It would work for a while and then let go. Unfortunately, I waited too long to return it and have now passed the date for that. If you purchase this and it doesn't work, be aware and don't wait to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1620432000000}
{"reviewTitle":"Suction cup lose the succion power or preasure and fall","reviewDescription":"For a few months it worked fine but then the suction cup attached to the base that is placed on the dashboard loses suction power no matter what I do in a few minutes it falls back even without having any phone on it. I do not recommend unless every short time you trash the item and have to buy a new one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1596844800000}
{"reviewTitle":"Difficult to Release Phone from Holder; keeps falling off vent","reviewDescription":"Only lasted two months. Release button freezes up and can’t get phone out of holder. Have to take off car and work on it to get it to release. After having to do this three times I gave up on it. Too late to return it as well. Also keeps falling off the vent slot no matter how tight i make it","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1597190400000}
{"reviewTitle":"Suction weakened after 6 months","reviewDescription":"Mounted on dashboard.  Great for 6 months and then one day the suction stopped working and phone fell in lap.  Won't hold phone anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652659200000}
{"reviewTitle":"It's the last phone holder you'll buy","reviewDescription":"The suction on this thing is awesome!!! I live where the potholes outnumber the people, and it's STILL stuck to my dash!!! Ordered another for the passenger side.UPDATE**** HOLDER WON'T KEEP SUCTION, AFTER REPEAT CLEANING, WON'T HOLD PHONE WITHOUT FALLING OFF DASH","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619913600000}
{"reviewTitle":"Rotation is hard","reviewDescription":"The horizontal and vertical rotation is pretty hard over the ball bearing and feel like you are going to break the vent clip or the vent itself by exerting more force!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1646956800000}
{"reviewTitle":"Half of the product is USELESS","reviewDescription":"Doesn’t stick well at all!  I placed in my car panel last night and this morning, I see it on the car floor... the only useful part now is to place it on the aircon.... for this price and half the product doesn’t work... unbelievable...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1602288000000}
{"reviewTitle":"not as expected.  would not recommend","reviewDescription":"When the arm is fully extended, the unit becomes very flimsy and bounces around, making it hard to read the phone.  Also, there is too much play in the base so that the arm rotates noticeably left and right constantly and there is no way of tightening it down.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1596585600000}
{"reviewTitle":"Did hold weight","reviewDescription":"I like the idea of this product and I think it would be great but the suction didn’t last long I had it for maybe three months I have an iPhone 11 and it did not take the weight of my phone after three months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1631577600000}
{"reviewTitle":"Be sure before you adhere it anywhere.","reviewDescription":"I bought for my new car, but was so excited to try it! I put it in my old car, big mistake! Now the adhesive wont stick in my new car. Very disappointing! Stuck good at first, unable to reuse after that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619654400000}
{"reviewTitle":"Not happy with purchase","reviewDescription":"We bought 2 of these when we were moving. One got messed up when we went to switch it from moving truck to car and we had to throw it away.  The other one broke after 2 months using it!Would not reccommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616025600000}
{"reviewTitle":"Tightness is in holding cellphone is not acceptable","reviewDescription":"The tightest is not what I expected","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Only lasted 8 months.","reviewDescription":"It was easy to install. It was used every day for about 1 hour holding an iPhone 12 mini. Suction and adhesion stopped after 8 months. Left a bunch of glue on my windshield. It was a mess to clean off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618444800000}
{"reviewTitle":"Works like a charm","reviewDescription":"No more watching iPhone mount slip out of the air vent and hit the floor just as new directions are coming up on the display. Love it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"2.5 years later","reviewDescription":"I really like it but the adhesive pad finally gave out on me. So if you're buying this product for a car you'll have longer than 2.5 years, think of getting a new adhesive pad sometime. It came off really guey. I still like it but now on the search for another pad.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"The vent mounting does not fit onto my car. The gripping hands are too short.","reviewDescription":"Would like to give a higher rating had the vent mounting work on my car. The phone mounting could be a tad  bigger for thicker phone case. As it is, it's barely able to hold my iphone with thick case.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Lasted for more than a year before the nut cracked","reviewDescription":"As long as you have a smooth surface on your dashboard, it will stick. It actually becomes super sticky and hard to remove once the car holder is left out in the sun for a few weeks.This product lasted me a year an a half until the nut piece cracked and the main holder wouldn’t remain tilted around the ball\/round part. I still use it, but the phone is tilted all the way down.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1682208000000}
{"reviewTitle":"Company is reliable and predict is great","reviewDescription":"I bought this to install in my sedan so that I may stream music (and skip songs safely) without having to look down for the buttons on my phone. The holder works great! It supports any phone from the bottom and the width is adjustable to secure your device. The only flaw is that the volume button on my phone is partially covered by the side grips, however I have simply lifted my phone a bit higher in the cradle and all works well.After transferring the holder to a differ6 dedan I ran into difficulty with the adhesive suction cup becoming too damaged to function. I emailed the company and they worked quickly to help me replace\/reuse parts I would need.I highly recommend this product and company.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654041600000}
{"reviewTitle":"VERY VERY strong suction phone mount","reviewDescription":"I mounted this on the passenger window of my 1969 M35A2 Deuce and a Half.  Works perfect.  I can not think of a better vehicle to test this mount in.  If you have ever had the privilege of riding in a deuce, you know just how bumpy the ride is!  There is a very sticky adhesive on the back of the suction cup.  Go SLOWLY removing it from your window, as it is VERY sticky stuff, BUT it is removable.  If removed, I would suggest doing so when the vehicle windshield is not hot, as it may cause the adhesive to remove itself from the looks of other's reviews.  The arm is extendable and overall, it provides plenty of adjustment.  I have a Samsung S21 in mine.  Works great!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1651449600000}
{"reviewTitle":"Holds the iPhone with a good grip","reviewDescription":"e comes with 2 different ways to attach it to the car.  One is using a clip to grab onto one of the vent slats, and the other is with a peel-off sticker to adhere to the dash.  I use the clip into the vent since the sticker method isn't recommended to leave in the sun.I like the way it holds the phone and has a button to easily release it, but found putting the clip with the ball difficult to fit into the ring section of the arm.  It took several tries with some force, but I finally got the ball to snap into place.It holds better than a magnet method.  I am ordering a 2nd one for another family member.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645142400000}
{"reviewTitle":"Adhesion failed after two months, but product replaced (UPDATED)","reviewDescription":"ORIGINAL: I was disappointed with this product because the adhesion on the suction cup failed after about a month. I had the product mounted to my dashboard in my Subaru Outback. I cleaned off the surface before using it, and the summer heat got to it. It was surprising that a product intended for cars couldn't handle summer heat (Indiana, 80s and low 90s outside). I have a larger phone (Galaxy S10+) which may have contributed to the problem.UPDATE: The seller replaced my product for me and provided recommendations on how to make the most out of it again. They recommended using the included \"flat pad\" to help even out the surface I had it mounted on, but this product didn't stick to my dashboard (even after cleaning) so I just mounted it how I did originally, looking for the flatted surface possible. It's no longer summer, but the product has held up longer than it did originally. I made sure to remove all cases from my phone to try and cut down on the weight. I'll update this again next summer if I run into any issues again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595548800000}
{"reviewTitle":"Great for Youtubers with moderate anti-shaking mechanism","reviewDescription":"ANTI-SHAKING IS MODERATEI love this product. I have another quality dashboard phone mount ( radioshack brand). By far, this product absorbed more shocks when travelling on bumpy and hilly roads.My phone does not have video stabilization when travelling on rough roads. As a result, the videos recorded was always shaky and blurry. A phone with good video stabilization is expensive. This product did a really good with absorbing some shocks.HOLD YOUR PHONE COMFORTABLE BY SLIGHTLY SQUEEZINGThis mount holds your phone tight and comfortable.  it's also easy to remove your phone to take take a quick video by hand and replace phone back into socket quickly. Just one little squeeze and the phone is locked into socket.IT RELEASES THE  PHONE QUICKLY FOR HAND HELD VIDEO RECORDINGThere is also a nice button below the socket to release phone quickly so you can remove phone and do a hand held recording.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618704000000}
{"reviewTitle":"Not compatible w\/PopSockets","reviewDescription":"Sadly does not hold phones that have pop sockets.  The brackets on the sides are too short.  It’s a design flaw.  All you have to do to make the device compatible with any attachments to the phone is to have the side brackets longer.  So it can hold thicker devices.  Other than it not holding my phone 🤣 it works great with my husbands phone that does not have a pop socket.  The device itself is quality plastic and stays secure to the car.  Has good grip on the phone.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1663459200000}
