{"reviewTitle":"Attachment does not stay on","reviewDescription":"It works, it blows hot air. It doesn't blow super strong but it blows good enough. However, the concentrator attachment does not fit very strongly, so as you dry your hair it twists around and pops off.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Not the best","reviewDescription":"Not enough power\/air flow on its highest setting. If you want one with maximum air volume, you can do better. I went to a thrift store after buying this and bought one with twice the air flow...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Worked Great for a While","reviewDescription":"My wife bought it in March 2024 and at the end of May the high mode started to make a sound like it was about to blow. It doesn’t matter the temperature but not she can only dry on low, which takes her forever with thick hair. Wish it would have last longer. Still works fine but a bummer it only last 2 months before something went wrong.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Low heat","reviewDescription":"It doesn’t produce high temperature air","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Cool is warm, warm is hot, and hot is very hot","reviewDescription":"This dryer works fine, but there is no true cool temperature because the cool setting is actually warm. I can't even imagine someone trying to dry their hair on the hot setting.Other than that, like I said, it works fine, comparable to almost any other dryer on the market.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Needs more power","reviewDescription":"It does the job for the price. Would like it to have a more power but you get what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"Works okay","reviewDescription":"Not the best but does the job","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Does a Good Job","reviewDescription":"I really like the Dryer. It's on the quieter side for sure but unfortunately it takes a while to heat up and dry my hair.I love the sleek look too it, I just wish it heated up quick and dried my hair quicker.The other thing I noticed is the outside coat is easily scratch able so I'm careful when I put it back because I don't want it to look too damaged","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Disappointed","reviewDescription":"This dryer is not nearly as effective (takes longer to style hair) as the prior Conair with retractable cord we previously used. However, the rocker switches are easier to use than the slides in the old dryer.  Really wish we still had the old dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"White finish on hair dryer handle disintegrated","reviewDescription":"I liked this hair dryer a lot.  However, over a period of time (5+ months), the white finish on the handle began to disintegrate.  Little white flecks ended up in my hair and on my hands.  They were surprisingly hard to remove.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Good hairdryer for the price, but the power could definitely be stronger","reviewDescription":"I had owned a Revlon brand for more than 13 years. It was no longer blowing hot air to blow dry my hair so after 13 years, I had to part with it. I saw this one for about the same price that I had bought the revlon one so I decided to give it try. It is lightweight, it is sturdy and I love the chic color, but unfortunately it does not compare to the power of my old 13 year old blow dryer. That is the main reason I am giving it four stars. I also give it three stars for \"traveling\" as it is pretty big and it does not come with a traveling bag. Other than that, I guess it does the job and it does blow dry my hair which is the purpose, but I wish it had more power so my hair could be dried faster.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"Had to replace my old hair dryer","reviewDescription":"I have always used Conair hair dryers. I was looking for the one that recoils the cord but it had been out of stock so I got this one and it is not quite as powerful. I do miss the cord recoiling other than that this does the job for a great price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Quiet but not as powerful as I'd like","reviewDescription":"Lightweight and pretty quiet compared to my last hairdryer. But I have pretty long hair and this isn't as powerful as I'd like, so it takes a little longer to blowout my hair with it. You can change it from low to high and hot to cool and that's great. It's good for the price, I just need a stronger one, but I still use it often.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Disappointed","reviewDescription":"Blow dryer worked for about 5 months then the heating element went out","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"Doesn't seem to get hot enough","reviewDescription":"Overall, this is a great dryer. It's lightweight and sleek looking and has lots of settings and a concentrator included. It leaves my fine hair with fewer flyaways than other dryers. My only gripe is it doesn't get hot enough even on the hottest setting to really do a thorough enough job to get my hair completely dry without spending a lot more time drying.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Good value for the price","reviewDescription":"It lacks some power but does the job. I bought it for a rental place, so value was important, and this hairdryer delivers that. The white looks very nice too.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"It's OK","reviewDescription":"I should have taken note of the wattage because it's not as powerful as the last blow dryer I had. But it's OK. I have short hair that dries quickly. If you have long or thick hair, you might need more power.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Reasonably priced","reviewDescription":"It does what it is supposed to do","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Great price for quality blow dryer!!","reviewDescription":"Such a great price on a really quality blow dryer!! The only thing I would change would be the cord length is a bit short for my liking…..otherwise dries my long but fine hair very quickly! Definitely worth the price point!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"It does the job","reviewDescription":"I probably should have ordered a 2000 + watt tourmaline dryer. It makes my hair a little frizzy and doesn’t blow that hard, but it seems to dry the hair fast enough. It’s okay, it’s a blow dryer I suppose.  I would give it 3.5 stars. It’s not overly loud, if you’re looking for a quieter dryer, and it’s very light weight, perhaps the lightest dryer I have ever held, which is great for someone with a shoulder injury. It’s lighter than my travel dryer which is smaller, but unfortunately it’s as under powered as the travel dryer. If you don’t spend extra time, it will probably give you a bad hair day just like the travel dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"This One Protects Your Hair!","reviewDescription":"Very Nice Hair Dryer!  I bought this for my daughter for a Christmas present.  She has been using it on her knee length hair for about 6 weeks.  She really likes it.This Conair dryer is nice looking and easy to hold.  The handle is comfortable, and it is light enough to not make her arm ache from holding it up.  There are different settings for how hot or hard you want it to blow.  The air is diffused in a way that helps protect your hair from damage.  My daughter can tell the difference in her hair from the old dinosaur dryer she had been using.  She also feels that even though it is gentle, it has been drying her hair much faster than her old one was.The price was reasonable for a nice quality dryer.  If you need one, I recommend you try the Conair Double Ceramic Dryer for yourself.  Thanks for reading. Have a blessed day!","isVerified":true,"ratingScore":5,"reviewReaction":"45 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Works well","reviewDescription":"Purchased to put in our guest bathroom. Works well and the temperature controls are on point. Power of the hair dryer is wonderful. Lots of settings to choose from. Great value for the money.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"Lightweight","reviewDescription":"I like this hairdryer because it’s lightweight and easy to use. Has several settings and does a good job.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Works great","reviewDescription":"Trying to decide between these new fancy dryers that cost $70 and way higher and what I know to be an old fashioned reliable ConAir or Revlon drove me crazy. But guess what, all those features in the more expensive ones can be found in the less expensive ones.  The ceramic I chose over the babybliss titanium because it’s gentler on the hair, less damage.Negative ions, who knew this BS works.Quieter than my old revlon. but hey still a hairdryer, makes noise. Weight comparative to the old style but unless this is your profession or you have a personal issue, it’s really not heavy.Flyaway hair minimal, better shine, better styling and great cool shot.Saw this on Todays deals for $15.  So what do you really have yo loose?Highly recommended!Double ceramic technology in this hair dryer provides infrared and uniform heat for fast drying and less damage. TRUE, who knewConditioning ions in this blow dryer help to fight frizz and bring out your hair’s natural shine. TRUEThis dryer for hair dries your hair fast with 1875 watts of power. TRUEI have somewhat thick hair below shoulder and this dries in less than ten minutes with styling.A cool shot button locks hair styles in place TRUENo pieces are chipping off as others have stated.  But honestly if they did I wouldn’t care.  My hair looks great and healthier.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Salon-Worthy Results at Home!","reviewDescription":"The Conair Double Ceramic Hair Dryer has revolutionized my at-home styling routine. With 1875W of power and built-in ionic conditioning, this hair dryer delivers professional results without the salon price tag.Powerful and Efficient: 💨The 1875W motor ensures a powerful airflow that dries my hair quickly and efficiently. Say goodbye to long drying times – this hair dryer gets the job done in no time, saving me precious minutes during my morning routine.Frizz-Free Shine with Ionic Conditioning: ✨The built-in ionic conditioning is a game-changer for combating frizz and enhancing shine. My hair feels noticeably smoother and looks healthier after each use. It's like having a salon blowout in the comfort of my own home.Double Ceramic Technology: 🌪️The double ceramic technology is a standout feature. Not only does it contribute to even heat distribution, preventing hot spots, but it also helps protect hair from damage. I appreciate the peace of mind knowing that my hair is being cared for while I style.Lightweight and Maneuverable: 🎈This hair dryer is incredibly lightweight, making it easy to handle and maneuver. Whether I'm styling with a round brush or simply giving my hair a quick blast of air, the ergonomic design ensures comfort during extended use.Multiple Heat and Speed Settings: 🔥⚡The customizable heat and speed settings cater to my specific styling needs. Whether I want a gentle cool setting for a final set or high heat for quick drying, this hair dryer adapts to my preferences effortlessly.Conclusion: 🌬️In conclusion, the Conair Double Ceramic Hair Dryer is a must-have for anyone seeking salon-worthy results at home. Its powerful performance, ionic conditioning, and double ceramic technology make it a standout in the world of hair dryers. Say hello to a faster, frizz-free drying experience that leaves your hair looking and feeling fabulous. I highly recommend this hair dryer to anyone in search of a reliable and effective styling tool!","isVerified":true,"ratingScore":5,"reviewReaction":"36 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Works well","reviewDescription":"Good value & works very well","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Good for the price","reviewDescription":"I replaced my old Conair with this one and I love it. I never had any problems with Conair","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"easy","reviewDescription":"the heat setting is variable which is gret","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Very nice","reviewDescription":"This works well and looks good too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Great hair dryer","reviewDescription":"This is a great hair dryer. I've had no issues and it has been a great option, especially for the price.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Does not blow very hard","reviewDescription":"I do not recommend this hair dryer. Although it is 1875 watts it does not blow very strong nor it it very hot. I have long curly hair and it takes forever to dry with this dryer. I bought this becuase of the price and it has a diffuser. It also said less frizz etc so It had me sold.  Not true. Buy a different brand if you are in a hurry to dry your hair. You get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Cheap but will do the job for now I guess","reviewDescription":"Flimsy and cheap. Air blow is not strong. But what can you expect for $20. I will use it for now and next time invest at least $80 or some to a quality product","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Need to Move the Buttons","reviewDescription":"The power button and heat control button are on the handle.  When I grip the handle more often than not I end up changing a setting; either the low\/medium\/high fan speed, or the cool\/medium\/high heat setting.  Also, the cool setting is warm air and not just air flowing through the device.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Does not get hot and buttons suck...","reviewDescription":"Received right away and tossed the box because a blow dryer is a blow dryer right? Wrong! I have a lot of long hair and usually use \"high and hot\" the high option worked but hot was luke warm. The buttons are in an awkward spot on the handle and about 2 days in I accidentally hit the switch from \"hot\" to \"warm\" and miraculously the temperature changed from luke warm to HOT! So apparently the switch is wired incorrectly. Well thankfully those buttons are in a weird spot otherwise I would have never moved them. Occasionally, I hit them and it goes back to luke warm and I have to adjust it again. No box so no return. I'll just wait for it to die before I replace. The only good thing is that it's white and pretty.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"First very loud noise. Then a glow","reviewDescription":"Having used this product for two week vacations and 2 a week at home this hair dryer was used less than any other  hair dryer we have owned. It made a very loud noise, had a glow and the abruptly stopped working. It has treated properly and the cord never abused. I don't think it was worth the money. In fact it left us all with frizz that we never had, and damaged our hair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Bad","reviewDescription":"Idk but I think they painted the blow dryer white because it peels off it be all over your hand","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Does not dry fast enough","reviewDescription":"I have used a Moroccan oil brush for years and straightened my hair with the hair dryer and the brush. My old dryer died and so I ordered this one. My hair winds up all wavy no matter how long I hold the dryer on the brush while twirling it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Short cord","reviewDescription":"The cord is too short making me stay in one position.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"needs special outlet","reviewDescription":"The plug on the Conair dryer needs a special GFCI outlet and you need to test and reset it every time you use it. Also it came missing a part, the concentrator, which is more than helpful if you have long hair. Unfortunately I opened the package after the return date, but seeing as i don't have a GFCI outlet it is pretty useless to me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Paint chipped off","reviewDescription":"The blow dryer itself is fine, but all the paint on it started chipping off soon after I started using it. Then I end up with white paint flakes all over my hair. Would not purchase again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714694400000}
{"reviewTitle":"I will update later","reviewDescription":"Haven't used it yet but right out of the box, I don't like the fan shape of the nozzle, which I noticed in the pictures but was hoping it would be better in-person, and the cord is less than 5 feet long. For reference, my professional round brush dryer cord is 9 feet long.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Paint Peeling","reviewDescription":"Took weeks longer to get product.  Ordered another one and this one came one day before the other one I ordered two weeks later.  Tried both hair dryers and they both worked the same, so I kept this one and returned the other one.  Now I wish I would have kept the other one.  Two months in and i kept seeing white paint on my hands, in my hair and on my hairbrush.  Couldn't figure out at first, then I noticed peeling paint on my hairdryer.  Added duct tape to the handle so it wouldn't get over everything.  Highly disappointed.  Would not recommend product.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"Beautiful but doesn't have convenient cool air option","reviewDescription":"Cord is long enough for me, beautiful product. However the \"cool\" option isn't actually cool air, and would only have cold air blowing if you press the cold blast button. The button needs to be held down completely if you want to have cool air, henve very inconvenient. The drying power of the product is also not very strong.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Not much power to it","reviewDescription":"Is a good size and functional enough. But even on high it does not have a great Air Force. If you have thick hair this would take you forever to dry it!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Very Short Cord","reviewDescription":"The hairdryer works great. However, cord it so is very short.  It’s also fairly quiet. I have very thin hair so it’s great but for someone with a lot of hair, I’m not sure how quickly it will dry the hair","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Great dryer but....","reviewDescription":"This is a great dryer and I would definitely give it more stars if didn't have to pick at all the peeling paint from my clothes and skin. For some reason the paint that coats the dryer just started peeling and it leaves a mess every time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Got most of what I paid for","reviewDescription":"You get the product you pay for in terms of strength. be advised it does not include the nozzle as is blatantly shown on the box and other images","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Less than I need.","reviewDescription":"Compared to my previous experience, the air flow is inadequate and the cord is too short.Sending mine back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Hair dryer","reviewDescription":"Work,s good. For the money I would look around a bit, but I'm not under selling it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Cool doesn't work","reviewDescription":"The cool setting and the warm are exactly the same temperature. Replaced my old one, similar model but doesn't work as well at all. Sad the cool setting doesn't work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Cord is Short!","reviewDescription":"I like the hair dryer overall but the cord is so short!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Cord is too short!","reviewDescription":"The cord is just way too short.  I wish they listed the length in the description.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Blow Dryer","reviewDescription":"Good for home use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Good product and great price","reviewDescription":"I have no problems with this hair dryer, good price and dries my hair","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"My Daughter Liked It Very Much","reviewDescription":"This was a Christmas gift to my daughter. She took it out of the box and looked it over. She thought it was really nice and looked expensive. She was excited to use it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Work well","reviewDescription":"I like the fact that this is a strong blow dryer but I wish it was smaller.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Heavy duty","reviewDescription":"It’s heavy!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"It does the job","reviewDescription":"For me its great. I just need to get my hair dry and go about my day.  There are enough options for settings aka cool, warm, high, low, etc.  The cord isn't super long, but honestly not a big deal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Good for the Cost","reviewDescription":"This dryer is very light. It blows hard, but does not get as hot as my previous Conair dyer. It will work for what I need though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"So far it’s a great hairdryer","reviewDescription":"Could be a little smaller to fit in drawer!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705881600000}
{"reviewTitle":"Just Ok","reviewDescription":"This hair dryer is fine. It’s good because it’s quiet and light weight. Things I don’t like are that the cord is VERY short making it difficult to switch arms and sides of my head without moving where I’m standing, so kind of annoying. Also the buttons are very sensitive. If I accidentally lightly touch the air flow button it changes super easily from high to low, so also an annoyance. It was pretty inexpensive though, so I guess these are minor irritations for what I paid for it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Not very powerful","reviewDescription":"I was surprised at the lack of power this has. I had it on high and it took quite a long time to dry my hair. I would not recommend this product.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Good for price but","reviewDescription":"I wish the blowing power was a little more.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Big problem with this hairdryer,  electrical cord is way too short!","reviewDescription":"Dryer works ok,  but cord is way too short!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Dries hair quickly but not sure if it is truly “ionic” dryer.","reviewDescription":"Pros: strong air with three levels of heat. I typically use medium heat with strongest air.Cons: I used to own similar “ionic” dryer and really liked how it dried my hair. It maintained the right amount of moisture. However this one does not provide same effect.  I doubt that this is truly a ionic hair dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686441600000}
{"reviewTitle":"Works fine but…","reviewDescription":"The hairdryer works fine but the coating on it comes off and I now have small pieces of white paint everywhere. Next time I’ll stick with a black model.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Dryer works great but finish is wearing off","reviewDescription":"Works great but now it gets white particles all over my hands after 3 months. I guess I got a defective finish on mine. Wish I could return.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"Works well but not made well","reviewDescription":"I do love the dryer, dries fast and does a good job…but the quality of the dryer is not good. It’s while and apparently also painted white. Chips of paint are in my hands every time after I blow dry my hair :(","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"Whites flakes","reviewDescription":"This blowdryer works well, and is lightweight.  But, I am getting white flakes off the plastic handle that stick to everything.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"Good for the money","reviewDescription":"Average for use . Nothing special . Good for the money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695427200000}
{"reviewTitle":"Not Powerful Enough","reviewDescription":"This is an okay dryer. It does the trick if you have enough time. I find it not powerful enough for me andI have chin length hair. Can't imagine using it on really long thick hair. The buttons are inconveniently placed and can be switched to a different setting or off entirely when holding the handle. It's light enough to handle, not heavy. I bought a smaller 1800+ dryer that is twice as powerful. I will keep this one as a spare. It may be okay for some people who maybe have short hair and don't need extra power\/heat.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Cord is so short","reviewDescription":"Blow dryer is fine but the cord is so short (at least 5 inches shorter than my other hot tools) that it’s actually problematic.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Paint Chips!","reviewDescription":"The blow dryer works great if you don’t mind the paint chips getting stuck to your hands and face while you use it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Functional, but...","reviewDescription":"I've never really disliked a hairdryer before, but this one fails on two points. First, the ergonomics seem off--it is not especially comfortable to hold, especially if you've got arthritic hands. The control buttons are awkwardly placed, so there are a lot of unintentional power changes because it's easy to tap the wrong button while gripping the handle. Second, the cord is very short--if your outlet is not very close to the mirror you're using, the cord length is going to be a problem. This has been one of my go-to hairdryer brands for many years, so I'm disappointed that this model is sort of a diva to work with. The airflow and temperature levels are normal, but the devil is in the details on this one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691366400000}
{"reviewTitle":"I’m mixed on this one","reviewDescription":"It’s a good hair dryer for the price. My hair feels soft after I dry it. There’s enough power to dry my long hair quickly but not cook the shine out of it. So perhaps the ceramic does make a difference? It’s lightweight & easy to store. Now my negatives are-  the controls are right where I naturally hold the dryer so I’ve accidentally turned it off or down mid-dry. But I’ll train myself to grasp under the nozzle the way many stylists do. The biggest issue (that I pbly should’ve returned it for) was that cord is ridiculously short! Fire the person who thought a stubby cord was a good idea! Luckily I have a small bathroom with the plug next to the mirror so if I don’t take any steps, I’m ok, but when I bend over to dry the roots & under layer of hair, I have to be very careful or the cord yanks the plug. If you like\/need to move around while you dry your hair, this is not the one for you.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1669593600000}
{"reviewTitle":"It works well","reviewDescription":"It is not as powerful as I would like it to be","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Don't buy unless your hair is fine annd thin.","reviewDescription":"My hair is on the thicker side and I could not get it dry in the time I had. I don't have 45 min to blow dry my hair.  Will have to get another one that is more powerful. I can't even return it because none of the return reasons are true. It does work, it just doesn't work well enough to get the job done in a reasonable length of time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"not very hot","reviewDescription":"this is the cheapest one i would buy and it's ok but you'll need a few minutes because the high temp and  the high speed together isn't super hot id say it's just barely acceptable but it won't dry out\/damage your hair right away if you hold it a moment so that's good. like i said, barely acceptable, it was cheap though so no complaints","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Corners were cut","reviewDescription":"So this is an inexpensive dryer. What are you giving up versus a more expensive model? Two mainly:1. There is no foam mesh dust filter. This allows dust to build up on the inner wire mesh (the one you can’t twist off and clean). eventually enough dust will build up to burn out the dryer. You can try using a q-tip to painstakingly clean the inner wire mesh, or add the missing washable foam filter (if you have one laying around. See photo.2. See that nice matte white finish? Con air cheaped out and used paint that’s not heat resistant. The finish will start cracking and flaking off, starting from the hot air end. In addition to looking beatup, this hair dryer will leave lots of little white flakes in your home\/hair as it looses its paint. See the other photo.This hairdryer is still usable, but be aware of the compromises Conair made.","isVerified":true,"ratingScore":3,"reviewReaction":"11 people found this helpful","country":"United States","date":1677542400000}
{"reviewTitle":"Bad concentrator","reviewDescription":"I love the dryer itself. It’s relatively quiet, dries my hair quickly, and works great. That being said…the concentrator is awful!  It pops off every few minutes.  It’s so frustrating and very disappointing from a company like Conair!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Not hot","reviewDescription":"The power of this dryer is great. However, on the highest setting it warm at best. It’s a good thing I have fine hair.  If you have thick hair., plan on taking a while.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Awkward","reviewDescription":"Very awkward to handle. Light weight yet very hard to keep a good grip on. Control buttons on handle get in the way and changes the setting while dry my hair.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Good bang for the buck, but not very high power","reviewDescription":"This is a great hair dryer for the $ but isn't very strong in terms of drying power.  It works well for what it is.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"A more travel worthy alternative","reviewDescription":"It is not powerful and best for short hair and maybe a travel hair dryer. Reminded me of what you would find in a hotel bathroom.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Its peeling","reviewDescription":"I bought it last year in march and it’s been peeling, this isn’t recent, and I don’t even use it often. But it’s Ight","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Short cord","reviewDescription":"Performs fine but the cord is short. Should be a foot or more longer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Not very impressed","reviewDescription":"My hair dryer of 18 years finally needed to be replaced. I bought this one in hopes of a good replacement. Sadly, I'm not very happy with it. The only things that I feel it has going for it was it is nice looking and light weight. The issues I have is the cord isn't very long. Can't move around very much while using. Another issue is it doesn't get very hot. Warm temp is much the same as hot. This causes it to take forever to dry my hair and hard to style it. The other issue is the large buttons. They take up most of the handle so you can't really grab it or you are constantly pushing buttons. I ended up buying a different one. Since I threw the box away for this one, I am stuck with it. Will have it as a back up if needed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665619200000}
{"reviewTitle":"Good for the price","reviewDescription":"Not the best,, but works for me","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Peeling paint","reviewDescription":"I’ve had this hairdryer for about 4 months. Initially, I was very pleased with it except for the fact that it had a strong smell. It was kind of like a new transistor radio or new electronic smell, but it was much stronger than I’ve ever experienced with a new product before. As I anticipated, the smell has diminished over time but is still noticeable. The other problem is that the paint finish on the handle is peeling off and leaves little white flakes on my hands and sometimes face and hair. I’ve decided to try and scrape it all off and put an end to it, but buyer be warned! See photos.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1682812800000}
{"reviewTitle":"No cumple con la 3 funciones de calor.","reviewDescription":"El producto es aceptable en cuanto a precio pero no cumple con la función de las 3 temperaturas o calor. El frío funciona solamente si presionas el botón azul. Por lo demás aún no he tenido problema.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Good Dryer","reviewDescription":"Good dryer. Easy on hair. Wish it got a little hotter. A little too big to travel with.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Conair Double Ceramic White Hair Dryer","reviewDescription":"This Conair Hair Dryer is well made and powerful. It is heavier than my last dryer. I have not had any paint issues so far (one month). My only issue is the diffuser does not have a good attachment system and keeps falling off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"What a deal!","reviewDescription":"It just works!  Only negative is it's a bit heavy and bulky.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Wish it were more powerful","reviewDescription":"I bought this dryer because it was cost effective, but I wish I had paid more for a professional quality dryer. It does an adequate job, but I wish it was more powerful. I will probably replace it with a more powerful professional style dryer like the Chi and pass it on to my daughter.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Heavy","reviewDescription":"Does a fine job but it is heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Blow dryer","reviewDescription":"I like the look of these blow dryer but it doesn't get hot enough like I would like it too. But I will keep it and continue to use it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Short cord","reviewDescription":"Dryer is fine - settings are good.  The high setting isn't over powerful but dries well.  The only negative is the short cord.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Decent dryer","reviewDescription":"I’d probably give this dryer more of a 3.5 than a 4 rating.  It has plenty of pros and cons.  Overall it’s good for the pricePros:-reasonable price-very light weight-gets hair dry in a decent amount of time-doesn’t leave hair frizzy-I personally like the short cordCons:-the plug keeps moving in the power socket, seems loose-not very hot, infact will probably never even turn down the temp to warm or cool as hot isn’t hot-no removable vent area to keep clean","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"Dries well.","reviewDescription":"Good quality for price.  Cord a bit short but that is perhaps better than way too long. Power not as strong as more expensive models, but gentler on fine hair.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"Not as Strong Airflow as My Old One","reviewDescription":"The airflow isn't as strong as my older dryer. The diffuser on front doesn't lock in position. it twists around by itself and constantly needs to be re-aimed. The cord is too short. It feels like it's durable and well built. All in all it does the job.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Heat is ok","reviewDescription":"The temperature does not get as hot as other hairdryers I have owned. The intensity of the airflow is also a little lackluster. I need extra heat for my coarse and long hair.  But for the price I should have known.  I will probably buy a better hairdryer and keep this as backup.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Hot air","reviewDescription":"I love the heat and cool buttons but because of where the buttons are it makes it hard to hold without hitting the buttonsI end up turning the air down, or speed because there is really no where to put your fingers without hitting the buttons","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"It dries hair.","reviewDescription":"This is a basic hairdryer, nothing fancy. It doesn't seem to have much power. It's pretty though, the white body and rose gold detailing. If that's what was the main thing I was looking for in a hairdryer I'd give this 5 stars.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Weak","reviewDescription":"It looks nice, it's light, it's hot enough and cool enough.  Trouble is, it's got a very weak stream of air.  I did keep it, my hair is thin, so it's not that big a deal, but wouldn't recommend it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Dryer is decent. Packaging was shoddy.","reviewDescription":"This is how my hair dryer arrived in the Amazon box. The Cool setting is more “lowest heat” than actually cool compared to my last Conair dryer. I’m not sure if that’s specific to this model or just my product. Other than that, I’m content with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"SUPER SHORT electrical cord","reviewDescription":"I like this dryer - it’s quiet, lightweight and dries hair smoothly - but you better have an outlet above your sink, and don’t expect to turn around or move very far. This cord is barely 3’ long - SUPER ANNOYING","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Good hair dryer","reviewDescription":"Pros: I love the color. The heating power is good.Cons:  I dont like that while I am drying my hair and I am holding it, accidentally I push the buttomswith my hand  because the buttons are not flushed to the rest of the surface of the hair dryer. So while holding it, I have to be very aware that my hands dont touch the buttons.  It becomes annoying.  I have another Conair with flushed buttons which does not have this problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Conair dryer","reviewDescription":"I am not totally satisfied with this product, but I continue to use it anyway. It has \"curb appeal\" with the white and rose gold accent. The cord is shorter, so it's not for salon use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Ok","reviewDescription":"This is a ok product but not the best. I think the $10 one I got a Walmart is better but it does work ok and is lightweight for a bigger dryer","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Good, but dose not have strong enough fan speed","reviewDescription":"This is a basic hair dryer and nothing elsePros:SleekLight weightCheepCons:Short cordDoes not have strong fan speed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Disappointing","reviewDescription":"I have fine, thin straight hair and normally I love Conair products and was excited to see how cheap it was. It takes forever to dry my hair, leaves it frizzy and flat despite me not changing anything else about my styling routine. It's not bad for the price but not what I need","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"White paint peels","reviewDescription":"The blow dryer itself is great. A few months into using it, I noticed white flakes all over and could not figure out from where.I finally realized it was from the blow dryer paint- it get stuck in hair, face, hands - what a. Mess - disappointing because it’s a good dryer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Not powerful","reviewDescription":"Replaced an old Conair hairdryer. This one is not nearly as powerful as my last one. It takes forever to dry my hair. I will be looking for something better.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Underwhelming and weak","reviewDescription":"I was very disappointed in this specific hair dryer. It had the features I was looking for which included multiple heat speed and heat levels. The drying power however was very sad. There seemed to be enough force of air coming out but after 20 minutes my hair (thin, not thick) hair was still wet. I tried using the air director attachment but that did not help in the least. I recommend looking at other products and not purchasing this unless you have all the time in the world to dry your hair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672185600000}
{"reviewTitle":"Works great but quality doesn’t last very long","reviewDescription":"The power of the hairdryer is great I have been using it for about 9 months but about a month ago the paint started chipping and I can’t use it anymore because if you touch it the paint sticks to you and is a pain to get off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"It’s the ok","reviewDescription":"The cord is way too short! I wouldn’t buy again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"strange smell","reviewDescription":"hopefully the smell goes away, but it almost smells like chemicals the first few times i used this i had to air out my apartment.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Dries Hair But Paint is Peeling","reviewDescription":"I ordered this dryer less than a month ago. It works fine, but a few days ago I noticed these little white flakes on my hand after I blow dried my hair. I didn’t think anything of it till today when I had a ton of white flakes on my hand after. I realized the matte white coating on the dryer was peeling. I’ve only used this dryer maybe 5 times at most in the last month. There is no reason the paint or top coating is peeling.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1667260800000}
{"reviewTitle":"Paint started flaking off during the first use and the dryer stopped working 10 months in.","reviewDescription":"The drying mechanism itself I love.  However, within a few uses the white paint began flaking off and covering my hands and everything else I touch.  I had to cover the handle with tape but now the paint is flaking off the rest of the dryer.  I should have returned it but it actually took awhile to figure out where the flakes were coming from.UPDATE:  dryer died 10 months in of 4x week use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Cute at first...","reviewDescription":"I bought this blowdryer because it was cute, with the frosted white and rose gold colors, but what is not cute is taking out pieces of the frosted white from your hair, when you are in a hurry. The machine blow dries hair quickly, but by the time I'm done picking out the white chips from my hair and hands, it's taken as much time as my old blow drier, which I bought 20 years ago.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"Not very strong","reviewDescription":"I replaced an older hair dryer with this and was disappointed. It's doesn't blow as hard as my old one. I'd look for a better alternative.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Product did not last beyond 6 months.","reviewDescription":"Dryer was noisy, diffuser would not stay in place, and exactly six months after purchase the motor died. Product was not misused or overused (used once a day). I have used Conair blowers for forty years and never had one fail in six months, they typically lasted many years.  I’m very disappointed in Amazon’s return policy on this item and discourage anyone from purchasing it. It is a low-quality, sub standard product that should be removed from your store.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"No heat","reviewDescription":"After a year of working fine. Suddenly no heat. There was never much difference between warm and hot. Now all temps are cold. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Why toggle switches, why why why?","reviewDescription":"for some reason every time I use this dryer I end up switching it to the low setting inadvertently because my finger hit the toggle switch unintentionally.  I did see a number of other dryers that have toggle switches too but really not a fan.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"NOT ENOUGH FORCE","reviewDescription":"Nice for drying children’s hair or for someone who has little hair; but for thick and longer hair, this will not do the job!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Hot","reviewDescription":"Gets hot on the exterior of dryer during use, I don’t know if it’s because it’s ceramic but can’t use it continually until hair is dry.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Made my straight hair frizzy","reviewDescription":"This is the first and only hair dryer I’ve ever used that made my hair frizzy. I dried my hair the way I normally do. I tried it both with and without the attachment. My hair came out terrible and frizzy every time. Also, the high heat setting isn’t as warm as other hair dryers, so it takes quite a bit longer to dry my hair, too. Very disappointed and a little puzzled at the advertising that this hair dryer is designed to minimize frizz.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Paid for you received used","reviewDescription":"I paid for a brand new hairdryer, and what I received was a beat up box with a used hairdryer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"It's Not the Worst Hair Dryer I've Owned But...","reviewDescription":"its not the best, or even near to it either.  It doesn't put out a lot of blowing-power but I guess since I have fine hair, that is okay.  The thing that I really downgraded it for was the fact that the power cord is really short.  You better have a wall outlet high up or you have to stoop down to use it.  It also falls out of the wall plug really easily.  I would blame the wall plug except that this is the only thing that falls out of it.  Other plug in devices stay put.I wouldn't buy it again, and I wouldn't recommend it to anyone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Paint Chipped","reviewDescription":"The hair dryer worked just fine, BUT the paint on it started chipping and flaking off. I’ve never experienced this with a hair dryer before. Really disappointed with the quality and ended up throwing it out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Seem it really protects my hair","reviewDescription":"Seem it really protects my hair, the temperature is not too high to damage my hair.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Perfect settings and easy to hold lightweight and attractive","reviewDescription":"I love this hairdryer and multiple settings for blow volume and heat  settings. I recommend this dryer for thise of us that fund heavy dryers hard to Goldstein the drying styling process leaves my hair smooth and frizz free.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Great quality for the price!","reviewDescription":"This is easy to use, serves its purpose wonderfully, and looks super cute. It has great power and I like the size.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Blows Just Right","reviewDescription":"The power cord is 52\" long between strain relievers.  This shorter-than-usual cord is just right for me, as there's less \"cord dangle\" to snag and get hung up on bathroom cabinetry handles -- an everyday annoyance with my old blow dryer's  6-foot cord. The plug-in end of the Conair cord has a petite ground fault interrupt protector with a polarized plug. There's also a this-has-got-to-go warning label glued to the cord with caution statements about \"do not use this appliance near the bathtub,\" and \"do not remove this tag.\"The rocker switches that control the blower motor and air temperature seem easier to use than slide switches. They're smooth operating, and provide a definitive feel when switching between settings. The dryer is relatively quiet at low-volume air flow. It's louder but not completely obnoxious on the high setting. The temperature control (cool, warm, hot) provides a nice, useful temperature range. Even the cool setting has a little warmth to it, but there's also a blue snowflake button that, when pressed and held, disables the heating coils. Style a curl or wave with a brush or comb, and use this blue button for a few seconds to set the style into your hair.My previous hair dryer (a Sassoon 1875 watt) failed after 20+ years of almost daily use. Although it pained me to give up that old dryer, considering the lifespan of an appliance like this, the cost of ownership is a mere fraction of a cent per day. I think this Conair 1875 will probably last longer than my disappearing hair.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"I love it","reviewDescription":"It not really for traveling because size.But for home is good for it’s price.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Works great","reviewDescription":"This is a very stylish hair dryer. But most importantly it is one of the best hair dryers that I've had. I have very thick hair and it takes a while for it to dry. But not with this one it doesn't take that long at all. Love the design the performance. And how easy it is to hold","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Fairly quiet, light weight weight, good controls","reviewDescription":"I was surprised at how relatively quiet it was for the price.  Light in hand, won't blow your head off but plenty powerful for me, have no hair so I use for various warming and drying chores. I'm 83 and keep my mobile home at 62 over Vermont's 8 heating months so I value a warm dry after getting my hands wet in cold tap water (rinsing toothpaste remnants, coffee mugs and so on).Over 20-30 years have had a number of similar driers, this one is by far he best out of the box  Longevity is to be determined, the others lasted around 5 years of light multiple daily uses. with longer uses of 10 to 15 minutes to warm BR during showers and for \"sitting\" bathroom use during furnace breakdowns.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Conair Double Ceramic Hair Dryer","reviewDescription":"I bought this blow-dryer and I have been very pleased with this blow-dryer.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Simple and affordable hair dryer","reviewDescription":"I like to leave things out and my husband likes things to be put away. I don't dry my hair often and upon looking for my hair dryer on the towel rack where I had last hung it (it was gone). Ask my husband where it was and he doesn't remember where he put it. We both looked for a little while around the bathroom and in the basement where I find most of my treasures hidden and we still couldn't find my old one. I was very pleased to find one that was easy to use and similar to my 25 year old one and affordable too. Perfect for me. Thank you. *****","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Great hair dryer","reviewDescription":"A light weight hair dryer that does the job! I'm able to use all dryer settings daily, and my hair has benefited as a result. Haven't had an issue, and looks like this dryer will last me for a long time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"White Paint flaking off on hands & hair","reviewDescription":"This is a great little blow dryer but in less than a year the white paint started flaking off and ends up on my hands and hair. The white paint is all over my brown hair and hard to get out. It’s gross.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Low power","reviewDescription":"The voltage on the blow dryer is not high enough you have to use it on high to get any result","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Underpowered probably defective","reviewDescription":"Loved the price and now I know why.Dryer seems like it's on low power in all settings. Package was delivered not factory packed. Seems like I bought a defective and returned dryer unbeknownst to me. Seller should have disclosed this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Not very powerful","reviewDescription":"I bought this as a replacement to my old one that just stopped working. Its the same brand and watt, conair 1875 but it is way less powerful. It has all the same buttons and settings but Compared to my old one this blower is much weaker. Much quiter too but not as strong. I guess for $16 dollars this is what you get.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Weak compared to others","reviewDescription":"I guess you get what you pay for with this one. I've used the same blow dryer for several years (and when I say \"use\", I mean I literally use it every. single. day) and absolutely loved it. My son knocked it into a toilet and I was pretty sure it was going to stop working, so I ordered this one out of desperation to get a replacement quickly. I made sure the stats matched my current hair dryer (1875W Ionic), but was very disappointed by the results. This blow dryer is nice enough but will take me twice as long to dry my hair than my old dryer. Luckily my old one is actually still working. Hoping to keep limping that one along until I can get a replacement, because this one is not a good fit for me.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"Cute hair dryer, but not the best or strongest","reviewDescription":"I paid about $20 for this hair dryer. This is a cute hair dryer, but it was not the strongest - it took a long time to dry my hair with this. It claims that it helps fight frizz to bring out your hair's natural shine to make it smooth and sleek, but I felt like my hair was more frizzy after drying.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"It's plug scratches the bejesus out of the finish....","reviewDescription":"I couldn't figure out where all the scratches on my brand new blow dryer were coming from. It was completely covered in them after a week. I thought it was something in the drawer, or my nails, but it wasn't. Finally figured out that it's own plug is what was doing it! If the plug even barely touches the dryer it makes a silver scratch in the white finish. Who makes a product like that?? Super disappointed because the blow dryer itself is fantastic- I really like it. I'm returning it and going to try to find it in a different finish. I definitely do NOT recommend this one!PS. Always use blow dryers with a GFCI-protected outlet whenever possible. Most of the burning and melting and definitely the fires you see in blow dryer reviews would be avoided when using a protective outlet! Just some friendly advice!","isVerified":true,"ratingScore":2,"reviewReaction":"24 people found this helpful","country":"United States","date":1656547200000}
{"reviewTitle":"Dries well but paint chips off!","reviewDescription":"My old hair drier finally stopped working after about 17 years and I decided to purchase this Conair dryer after reading lots of reviews. I have to say that the drying aspect lives up to the hype; it has multiple settings and temps and doesn’t cause as much frizz as a regular hair dryer.Cons: it does not come with a diffuser and try old diffuser did not fit so I had to order another one. Secondly, the paint started chipping off the handle after less than 2 weeks. I could not figure out why I kept finding white flecks on my face and in my hair. After several days of this I carefully examined the dryer and discovered the faulty coating. Very displeased with this aspect!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685750400000}
{"reviewTitle":"White flecks from the housing on your hands.","reviewDescription":"I really like this blow dryer and it seems to be less harsh on my fine hair than other dryers I've had.  I've had the unit since the end of January and am now getting white flecks on my hands after after drying my hair.  It's very annoying and messy.  I've wiped down the housing, only to have the flecks start again.  It's almost like the housing is shedding.  I don't have any caustic substances on my hands, so it must be an inferior casing material that the drier is made out of.  I think I will return the unit for exchange.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"Only last 6 months","reviewDescription":"Bought this in August of 2023 and heard a pop yesterday and now it’s dead…Loved it while it lasted but I don’t want to buy again because of this.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Paint chips","reviewDescription":"I’ve used it a few times to dry my hair. Great for the price but paint chips like crazy and gets all in your hair.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Great Dryer\/Missing Piece","reviewDescription":"I liked that it was sleek looking, very easily dries, not too noisy. However, it didn't come with a concentrator piece as it advertised.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696982400000}
{"reviewTitle":"Shortest Power Cord in the History of Mankind","reviewDescription":"The dryer is very light and easy to use, however the power may be insufficient for people with thick hair.  It's also very quiet - although part of that is likely a result of the lack of fan speed.  The power outlet in my bathroom is towards the back of the wall and the cord is barely long enough to use the dryer.  The outlet is on my left, so I have to turn and face the wall to dry the right side.  Crazy!  I guess they figured they could save a lot on production costs by cutting the cord in half.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"Anemic","reviewDescription":"I needed this hair dryer asap and got it quickly. However, I threw packing away without trying it first. I would rate it anemic at best.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"White paint comes off","reviewDescription":"Works for drying hair that’s about it. Not a bad hair dryer but white paint started flaking off everywhere after about a month. It was messy and annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Not hot enough","reviewDescription":"I love the look and design of this hair dryer. However the heat is lacking. It has a Hot, Warm,Cool setting, but I can't tell much difference between the Hot\/Cool. The cord is also very short. I stand at my bathroom vanity to dry my hair, and it's come unplugged twice already. I will be keeping it, just wish I'd read this about it before I purchased.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1687046400000}
{"reviewTitle":"Decent Hair Dryer","reviewDescription":"The nozzle attachment does not stay on which tends to be annoying. I've had it for while now and bits of white are falling off around my bathroom.  I guess it is the coating from the hair dryer's color??","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Very lite!","reviewDescription":"As a license cosmetologist I've use several different blow dyers.I purchased this to use at a memory care facility it's very lite  not heavy at all. My problem is it doesn't get hot enough  to dry the residents hair and also the cord is short..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"Cord is too short!","reviewDescription":"I love the hairdryer and how it dries my hair but the cord is way too short.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"Works great, but…","reviewDescription":"It dries my hair, the dryer is light weight, it’s not easily stashed for travel though, and also the white matted paint on the handle is peeling off. Every time I use it there are flakes of paint or whatever is the matted material on the handle portion of the hairdryer, gets all over my hand, and also all over whatever I handle after I use the hairdryer! So aggravating. I hope it’s lead free paint!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"Frustrating.","reviewDescription":"This is a good dryer for someone doing a quick basic blower. However, it’s not good for “blow outs”. It doesn’t get hot enough. And the switches are in a terrible place, so I’m constantly stopping to fix the settings. Fixing the switch settings make me have to stop blow drying and the attachment falls off. And, the cord is very short. So frustrating!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"It didnt work well for me","reviewDescription":"It's good but takes time to dry out hair and they are still wet. So can't say. It's my first time using a blow-dryer so I will use it 2 or 3 more timed to update its operation.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Minimal Air Flow For 1875","reviewDescription":"The heat was strong, but the hair dryer lacked in air flow. I was underwhelmed with the air power. Would not recommend for anyone with thicker hair, takes too long to dry. Short cord. Light weight.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"Quality.","reviewDescription":"I did not like the weak motor on this model. It took me much longer to dry my long hair. The speed is weak as well. However, I decided to keep it to dry my  fresh acrylic paintings only. Otherwise I would have returned it.  I do not recommend this model at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Paint comes off","reviewDescription":"I bought this about 6 months ago and unfortunately I have to throw it away. It works fine however the paint is coming off whenever I use it. I didn’t realize what was causing the white flakes in my hair and was thinking it was dandruff when it was the white paint chips.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Low power","reviewDescription":"I have used the same blow dryer for the last 7 years and it just broke on me. I bought this one, it is sleek, the heat and cool settings worked great, however, its power is very low in comparison the the other one I used. I have returned this item.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Returned","reviewDescription":"Nice dryer but not enough of a \"blast\" cimming out.  Took a while to dry hair.  Returned.  Good returns by seller.....thanks for that !!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Peels off","reviewDescription":"Dryer's white finish flakes off on your hands as you dry your hair. The tiny flakes fall on your head as you finish drying your hair, and you need a couple extra minutes just to pick the f*ng flakes off of your hair. Not fun.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707868800000}
{"reviewTitle":"Disappointing","reviewDescription":"This is the weakest hair dryer I’ve ever used.  No power to it. It also seems to cause static electricity in my hair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"SENT USED AND PRODUCT IS NOT GOOD","reviewDescription":"I bought new but not what I recieved. Clearly been opened then thrown in box and taped shut. This is third item bought NEW that clearly is not.As for the item the power buttons are placed on the handle in such a way that I am constantly hitting them and turning the dryer off. There is a learning curve on how to hold it so this doesn't happen, but it is ackward and uncomfortable. Problably why it was returned before I recieved it. I was going to keep but had it few weeks and still is frustrating. Other thing is it doesn't get very hot or blows much air out. I have very short fine hair so drying it is usually a snap, but with this it is a chore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687651200000}
{"reviewTitle":"Loud and the color flakes off","reviewDescription":"Bought this a year ago, and my husband thinks it's the loudest hair dryer I have ever owned. The handle is also a bit long which makes it difficult to style with.The thing I dislike most about it is the white finish is flaking off and I end up with tiny white flecks on my face.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Quit working after 3 months","reviewDescription":"Worked fine when we first got it. After three months it just quit working...just makes funny noise and motor gets extremely hot....not the air cause there is no air...but the motor itself is burning up.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Short cord","reviewDescription":"Unless you want to stand right next to your outlet the entire time you are drying your hair, go with a different dryer with a regular length cord.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"Warm air","reviewDescription":"This doesn't blow hot air it's warm at best even when on the hot setting. It's not powerful either just a light breeze on your head.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Cheap, will never buy again","reviewDescription":"I own a Conair 1875 hair dryer. I bought it from Costco. It's probably over 5 yrs old. My son used it and dropped it. The nozzle cracked so I can no longer use the attachment. I bought this to replace the old one.Description sounded great. When it arrived and I picked up the box, it was so light,  I honestly thought they sent me an empty box. I opened the box, the hair dryer is in there in good condition. The body is made of cheap plastic material. Kind of reminds me of a toy. I plugged it in, and it does not have the same power as my old one.  It works, but don't waste your money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Not Hot and Not a Quick Dry","reviewDescription":"It doesn’t blow “Hot” air on any setting. It also takes forever to dry my hair because the High setting is more like a medium power. Not impressed. It looks nice but this is more of a hair dryer for the elderly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Frustrating! Needs a redesign on the attachment!","reviewDescription":"So frustrating!! The attachment nozzle falls off continuously as I blow dry my hair. The nozzle needs a tighter fit!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715385600000}
{"reviewTitle":"Very weak","reviewDescription":"It gets the job done but if you actually want to do a blow out. Get a better blow dryer","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Loved it for the first little while then nope","reviewDescription":"This hairdryer started out AMAZING. Great power, dried quickly, etc. then shortly after it started having so many issues. Doesn't dry as well, the pain is chipping off everywhere and seriously MELTS off even with low heat. It's horrible. I dry my hair and it leaves my hair, clothes and hands covered in white flakes after. Do not recommend unless you want something for only a couple months.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"It’s ok","reviewDescription":"It doesn’t get hot at all, maybe lukewarm at best. I have very fine hair and it usually only takes a few minutes to completely dry it with other hair dryers, but it took double the amount of time with this dryer. Very disappointed! The only good thing I can say about it is that it pushes out a lot of air on the high setting!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707004800000}
{"reviewTitle":"Very short cord","reviewDescription":"The electrical cord on this blowdryer is very short compared to others.  It works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"Great price, very short cord.","reviewDescription":"This looks a little better than it really is.  I usually am very happy with Conair, and as I said the dryer is nice, but unless your standing close to the outlet, you'll find it easier to use if you get an extension cord and just keep it with the dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Replacement","reviewDescription":"Bought this to replace my dryer that had burned out.  If you are left handed as I am, This product is not for you ! Holding in your left hand the on\/off switch cuts off ALL the time otherwise it works fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Mediocre","reviewDescription":"I bought this on sale and I’m glad it wasn’t full priced. I would be bummed. It’s cute, but man it is not powerful at all. I had a very old conair with the same wattage that was very powerful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"It does not blow high","reviewDescription":"This is supposed to be 1850 watts but it does not have that much power, so I have to use the high setting all the time. It gets the job done but spend an extra $10 bucks and upgrade.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Stopped working after 14 months","reviewDescription":"As a hair dryer it did everything it was suppose to and I particularly liked the cold shot feature.  However, it just stopped working the other day -- very disappointing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"One side of plug is larger!","reviewDescription":"This blow dryer is decent. It's nice that it has the hot, warm, cool and high and low settings, but I feel like it doesn't get that hot, so it takes a little longer to dry my hair. The most annoying thing is that one side of the plug is larger, so it doesn't fit inside the outlet in my bathroom.One cool thing I noticed is that there's a small loop so you can hang it. Don't think I've seen that before in a blow-dryer, but I also haven't really been looking much at blow-dryers. I haven't got anything to hang it on though, so can't really say how well it works.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Awkward control placement.","reviewDescription":"Hard to hold and move comfortably without changing the controls inadvertently.  Plug keeps coming out of the outlet as I use it.  Power is fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Air Output not strong enough","reviewDescription":"Nice little blow dryer but I feel my small travel one have more air output power.Won't purchase this again.  Does not mean that others would not appreciate.I have a lot of hair and it is thick.  So.. it's not an ideal blow dryer for me.  I will keep it and use it until I can get a new one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Travel dryer should be emphasized","reviewDescription":"While it is light weight and does dry pretty well, the power cord is too short.  An extra foot of cord would have me want to keep this dryer.  It never mentions the cord length in any description.  The amount of wind the fan puts out seems to be seek compared to an almost identical dryer this one replaced.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"it dries my hair!","reviewDescription":"I got this hair dryer because my old dryer was shorting out the GFI plug every time I used it. Figured it was time to replace it. This dryer is lightweight and it dries my hair in the time it takes to sing \"Nectarine (Part Two)\" by Mike Doughty. I wish the cord was about a foot longer, and the air doesn't seem to get as hot as my old hair dryer, but maybe my old hair dryer was blowing hotter air because it was dying, and the only way it could think of to let me know that, was by shorting out the GFI plug.So, in conclusion, lightweight, short cord, dries your hair in 2:26 minutes.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1677283200000}
{"reviewTitle":"Good, but not great","reviewDescription":"I like the number of settings on this dryer - separate buttons for heat and airflow.  I wish the airflow were stronger, though.  Also, I'd prefer a glossy finish instead of the matte one that's used because glossy doesn't collect dirt nearly so easily.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694563200000}
{"reviewTitle":"Good product for the price","reviewDescription":"This  hair dryer is good but certainly not a professional one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Great dryer!","reviewDescription":"Very lightweight and comfortable to hold, really shortens drying time. A bit loud if someone is still sleeping when you are doing your hair!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Does what it's supposed to","reviewDescription":"I like everything about this but 1 thing, the cord is too short.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Wife loves it","reviewDescription":"She loves the controls on it better than her previous dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Good dryer, with two small faults.","reviewDescription":"Overall this is a nice hair dryer. It looks good. It sounds good (not too loud). But it is not as powerful as my previous hair dryer. (Maybe blows at 80% or so of the power one would expect) Still gets the job done for me as I don't have a lot of hair to dry. Also, as some have noted, the power cord is a bit on the short side. It really should be a couple of feet longer in my opinion. Other than that, no complaints.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Lightweight and works well","reviewDescription":"I was amazed at how fast this was shipped. I was so grateful because I use my hairdryer everyday. It is lightweight ,which is nice when you have to hold it for awhile due to my very thick hair. I bought because the ceramic is supposed to be better for your hair and it was a good price. I would recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"13 people found this helpful","country":"United States","date":1687651200000}
{"reviewTitle":"Dries your hair, but the coating comes off","reviewDescription":"Conair is a brand that has been around for a long time. I like this hair dryer for its power and heat, but after about 2 weeks of using it, the white paint\/coating on the handle is flaking off. I've tried to use a rag and get off as much as possible, but it keeps coming. It's not a show-stopper for me, but just be aware that if you see white flakes on your hands, it's shedding! Otherwise, I do like it. I'm sure it will all wear off eventually.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1683072000000}
{"reviewTitle":"Paint chips","reviewDescription":"Is it worth it for the money? Yes; its quiet and dries well. However, be prepared for white paint chipping off of it and getting everywhere.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Good dryer","reviewDescription":"This dryer came on time and was exactly as described.  It works good and isn't as loud as my old one was.  Works good.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Dries well.","reviewDescription":"Lots of different heat and blow settings. Doesn't suck my hair into the air intake.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Conair 1875 blowdryer faulty part - Customer Service was PHENOMINAL","reviewDescription":"WONDERFUL Customer Service from ConAir! I own a Conair 1875 blow dryer for over 20 years and loved the product. So I finally bought one for my teenage daughter for Christmas 2022! At 94 days of purchase the \"Indicator light\" came on, the warning manual says if this light comes on stop use immediately and contact a service center. Being I just purchased this for Christmas 3 months ago I went to Amazon. The warranty says good for 90 days (I was at 94 days, grrr). SO I called Conair. The women that helped me from Conair was WONDERFUL! She spoke perfect English, was helpful and Kind! Didn't question it being over 90 days, and set me up with a replacement right away! I am in the process of receiving that replacement now! I had to cut the cord and sent in photos, but they are sending me a new one! It was probably the BEST Customer Service I have ever experienced with a situation like this! KUDOS to ConAir! Great Company! I would definitely purchase again and many other ConAir products in my life! MOST Wonderful Experience!","isVerified":true,"ratingScore":5,"reviewReaction":"21 people found this helpful","country":"United States","date":1678233600000}
{"reviewTitle":"Works great","reviewDescription":"I'm no expert in hair things but it dries my hair fast. I like the nozzle attachment and have it on there permanently. Heat settings are good and speeds are fine for my Asian hair.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"beautiful and functioning","reviewDescription":"I like this product because it looks nice and quick dry my hair.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"I like it","reviewDescription":"I like the low low heat setting","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Light weight and quiet","reviewDescription":"A lot lighter than other blow dryers. Chord isn’t very long so less likely to tangle up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Works","reviewDescription":"Works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Great value","reviewDescription":"Easy to use three speeds and three heat types. Easy to store and very good quality and easy to use","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Lightweight Dryer","reviewDescription":"This hair dryer has good drying options, has sufficient drying power and I appreciate the lightweight ease for use in styling and drying my hair.  The price is fair.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Less Frizz","reviewDescription":"This product has helped with the amount of frizz after blowing hair dry. It does not take as long to dry hair compared to the old conair I owned.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"\"Ionic\" Seems To Be Real","reviewDescription":"We bought this to replace a two-year old Jinri that had a plastic-on-plastic sound because the fan blade was hitting the sides.This wattage on this model is a bit low, which we wanted - we have an old house with overstretched circuit breakers.  But perhaps because of the \"Ionic\" function, it dries impressively well, without a ton of heat.In fact, I was concerned... this might be one of the coolest driers I've ever used.  But it dries impressively well, and my hair doesn't feel like it's getting fried.And after the Jinri, I really appreciate the no-nonsense layout of the rocker switches.  Our last unit required the switches to be \"centered\" in order to turn it off, which was always a nuisance.  This drier puts \"Off, Medium, and High\" in an intuitive order, and has never required me to look at the switches.Considering the price, this drier is an amazing value, especially if you're looking for modest wattages.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Great!","reviewDescription":"I absolutely love this hair dryer! It is powerful or gentle when you want it to be. I’ve had this for over a year and it is still working like it’s brand new!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"As described","reviewDescription":"My old Conair hair dryer started smelling like something was burning so thought I should replace it. Have had several Conair dryers over the years and they have always given me good service. I like the fact that this one is lightweight, not too loud, and has several settings for temperature and speed. I'm very happy with it and would recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Best all around Hair dryer","reviewDescription":"Because of its size this hair dryer is the best home hair dryer.Plenty of power. You can toggle between hot air and cool air by pressing the blue button which quickly stops the heat. It is a full size hair dryer. I am pleased with this dryer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"Works great!","reviewDescription":"As dryers come and go, I am pleased with this one.  Has two settings and a cooling button.  Easy to clean, in case you get makeup on it from finishing your face before drying hair!  hahaha","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"easy to use","reviewDescription":"gift for my granddaughter to go to college","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"light weight but dries like something much more substantial","reviewDescription":"I like this hair dryer a lot.  It's light weight but dries like a champ.  I especially appreciated the user instructions, which include a table with heat and airspeed combinations for different hair types.  It would be nice if this hairdryer were a little more compact.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Me encantó","reviewDescription":"Excelente calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717372800000}
{"reviewTitle":"Love this","reviewDescription":"This blow dryer not only looks pretty but works well. I have been using it for several months now and have had absolutely no issues with it. It doesn't have super high blast power like some do, but I typically only use low to medium air flow anyway, and if I feel like I need a faster dry, the high speed has plenty of air power. I like that it's lighter than my previous hair dryers, and that's one of the reasons I purchased this model. If I want to take a full size hair dryer when traveling, it ads barely any weight to my suitcase.","isVerified":true,"ratingScore":5,"reviewReaction":"14 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Perfect lower speed for thin hair!","reviewDescription":"I had a Conair 1875 that lasted me nearly 40 years! I loved it because I have fine hair and need the lower speed air flow and temp. I bought a Conair Infinity Pro and it was too much for my hair. Nearly blew my hair right off my scalp! So I looked more online. When I saw the complaints about the fan speed being too low or that it took forever to dry hair I knew this was the hairdryer for me!  I just tried it out and it's just like my old trusty Conair 1875. The lower speed combined with cool temp is perfect for a peri-menopausal woman who has thinning hair & hot flashes at the drop of a dime.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"I Like Conair Hairdryers","reviewDescription":"My last hairdryer that I had for years was a Conair and even though it still ran, I decided to replace it. Conairs are resonably priced and I really like the two dryer speeds and three heat settings so I bought this one. It dries my hair quickly, is lighter than my old hairdryer and is easy to use. The only thing that could improve it is instead of a rubber ring to hang it from which does not look like it would last, would be  a metal ring that is attached to the hard plastic body, but that would cost more to produce. I wrapped a leather cord around the handle just above the plastic ring to hang it from a wall hook. That works for me and I am still very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Works great.","reviewDescription":"I like the fact that it has a cut off switch in the handle for the heater coils.  I can turn  the heat on and off as I use it.  Makes it easy to make sure you don't durn your hair.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Great hair dryer","reviewDescription":"Can't say I've tried a ton of hair dryers but this was one great and left me with no complaints. I have super thick long hair that can be difficult to try, but this worked pretty well and it was easy to use since it wasn't too heavy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Love this!!","reviewDescription":"I love this blow dryer! The only thing that I wish there was was a longer cord! But other than that the blow dryer works perfectly and comes with everything that is listed in the description. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"I’m bald","reviewDescription":"Why 5 stars? Because my daughter’s old hairdryer died and this one arrived quickly and blew warm air on her tern head putting an end to yet another crisis. Thank you hairdryer that saved our household peace (for now)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Hair dryer","reviewDescription":"Loved it!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Favorite Hair Dryer","reviewDescription":"I absolutely love this Hair Dryer! It is wonderful to use, and looks great at the same time. Very nicely styled, easy to use, and dries my hair better than any dryer I've had before. and best of all, it is not super noisy!! Much quieter than any Hair Dryer I have used.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Great product","reviewDescription":"Light weight, very powerful.I'm very happy & highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Definitely Worth The Money","reviewDescription":"I bought this for a friend, who absolutely loved it. Said it was everything they wanted, and way better than their old one that ran its course. I don't know the particulars, so I can't describe the temperatures, etc. But my friend raved about it and went on about how this feature was better than the old one, and that feature was better than the old one... So for me, it was money well spent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Dryer is great- outside is not","reviewDescription":"I keep meaning to come leave this review. This morning I’m extra annoyed because I’m in a hurry and the hair dryer slows me down. Why does a hair dryer slow me down? Not because it doesn’t dry my hair, but because for months the PAINT on the outside of the hair dryer has been chipping off and ends up in my hair. You know how difficult it is to get tiny spots of white paint out of dark hair? It’s difficult. And extremely annoying. I bought this hair dryer after my last one finally kicked the bucket. It was the same model, just in orange and was wonderful. This one is also wonderful, except the dang paint. I don’t know if they just didn’t test this, or if mine is defective, but gahhhh it is so annoying.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"Don’t buy unless you want paint chips all over your hands","reviewDescription":"Product is lightweight, cheaply priced (get what you pay for I guess), and does operate and dry your hair well.Purchased for the color and weight. And I did like that the price was low too. But 3 months into using it on and off (I still had my old hair dryer I liked), the paint began chipping off and my hand was white with paint chips\/flecks. 😒 It was passed the return timeline, and it took me another couple months to make time to get the contact info for the company.. and then the time never came to reach out to them to get “help” whether return, etc. and then it seemed too long so whatever. I did get this dryer first for my daughter - fit her aesthetic, and she rarely blow dries her hair so I had not seen this paint chipping yet. So I bought one for myself since it was cute and worked well and was lightweight! Ugh.. regret it now. It’s been a year now and I keep forgetting to get another hair dryer, until today, I am making myself do it. At the same time am writing this review. Disappointed bc it’s an ok hair dryer otherwise.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Don't Bother with This Model!","reviewDescription":"Cheap plastic with no power. Took me three times as long to dry my hair with this dryer than with my older Conair Infiniti Pro, which I just ordered, twenty-four hours after receiving the cheap plastic version. You get what you pay for. Spend a little extra for a better product right off the bat and you won't have to go through what I am just to have dry, frizz-free hair!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722816000000}
{"reviewTitle":"Cool setting is warm","reviewDescription":"I thought my blow dryer was on its way out, so I ordered this one. Then I got my blow dryer to work so I put this one in the closet and it’s been sitting there for about six months. Well now my dryer finally went and when I took this one out I was very disappointed to see that the cool setting is not cool at all. It’s just warm. I always dried my hair on cool. There is a button that you could press to get cool air but you have to hold it down. I have very long hair and it takes my hair a while to dry and holding this cool button down the entire time ends up making my whole hand hurt. Unfortunately I can’t return it anymore because it’s been so long, so I have to go out and buy another blow dryer. They really should make the cool setting actually cool.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Would give zero stars","reviewDescription":"I have had this blow dryer and not even 7 months and it stopped working. I've tested it and I've tried different outlets I've done everything that you should do to test an appliance and it's not working. Don't waste your money on this you'll have to buy another blow dryer within a few months.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1724284800000}
{"reviewTitle":"Stopped working within the year","reviewDescription":"Bought this product under a year ago and it randomly stopped working. Been trying to contact customer service and this specific seller and no response. Id invest in another hair dryer if I were you","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Paint chips off","reviewDescription":"Every single time I dry my hair, my hands and fingers are full of paint chips.  Pictures taken are paint remaining after I washed hands once.  Also you can see how the paint is flaking off entire blow dryer","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Design Flaws Impair User Experience","reviewDescription":"Overall, I'm unhappy with the Conair Double Ceramic Hair Dryer, 1875W Hair Dryer with Ionic Conditioning and it has nothing to do with its function and everything to do with design. I've owned and used this product for the past 6 months and have used it at least 2-3 times a week in that period of time.PRO: It works and dries my hair adequately.CONS:1. Paint has started to peel and flake of off the handle and body of the unit in the last few months, leaving small specks of white paint all over my hands and clothes and also attaching to other surfaces (i.e. my hair brush, the surface of my dresser...etc.)2. The plastic nozzle attachment that is intended to channel the air to my brush does not function. It's easily knocked off the end and spins endlessly; therefore, I've stop using it because it never stays in the correct position or falls off altogether.3. The cord is just slightly too short, making it hard to dry my hair when not using a counter level outlet.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Doesn’t Last","reviewDescription":"I’ve had it for 7 months, use it 2-3 times per week. Today the reset buttons wouldn’t reset. Junk.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Paint flaking off handle and makes a mess","reviewDescription":"After using this daily for 10 months, I noticed that the white paint on the handle has flaked off. Gets on hair and hands, and is scattered all over the wire. The paint is not easy to wash off either. It adheres to surfaces and does not come off easily. I store it in a dry room as well. Such a waste. I plan to buy a new one that does not have this issue. If I find a solution to contain the paint I will keep it. In the mean time, I have this use it carefully to avoid paint flaking onto my hair. Additionally, the hair dryer developed a high-pitched yet subtle shrieking sound, also 10 months in.You might have to zoom in with the photo. The white specks on the wire are paint, and you will see the patches of flaked-off paint on the handle.","isVerified":true,"ratingScore":1,"reviewReaction":"39 people found this helpful","country":"United States","date":1700697600000}
{"reviewTitle":"Works well enough","reviewDescription":"I wanted a ceramic dryer that’s not too expensive, so this apparently is it. I was originally just going to buy the regular sized one, until I read a review, saying the traveling one is more powerful. How could that be?! I was so intrigued I ordered both for comparison. The body of the traveling one is just a little shorter, with a folding handle, see photo for comparison. Other reviewers also complained that the regular unit has bad placement of on\/off buttons. Although I personally didn’t find that to be a problem, I took a side-by-side photo for reference. Although the wattage is completely the same between the two units. Oddly, the traveling unit does feel a little more powerful than the regular unit! I don’t get it, but I’m keeping the travelling unit and returning the regular one.","isVerified":true,"ratingScore":4,"reviewReaction":"74 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Light weight","reviewDescription":"Works well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Works well","reviewDescription":"Light weight. Works well - not too hot.  I wish the cord were longer","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Love it","reviewDescription":"I love this dryer.  One thing,  though,  the on\/off switch is in the way, so when I'm holding it and drying my hair, I constantly hit the off ... it's annoying but it's an excellent dryer","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Good Hair Drier","reviewDescription":"It's a bit big in size. Good heat and great for the price, but wish it was smaller. Not suitable for travelling!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"BLOW DRYER","reviewDescription":"This dryer seems well constructed and does it's job. It may be my imagination but it seems slightly weaker in velocity than the on it replaced.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Short Cord","reviewDescription":"Good enough hair dryer, the cord could stand to be a bit longer, even standing inclose proximity to mirror the cord pulls out of the wall.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700352000000}
{"reviewTitle":"Very weak","reviewDescription":"Weak air and it takes long to dry my hair.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Good blow dryer","reviewDescription":"I like this blow dryer and it definitely heats up very well. Only con I had was I didn’t get the attachment to it but that’s okay.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Short cord","reviewDescription":"Finally took it out of the box. Works well but the cord is really short. Would’ve sent it back because of this, but I waited too long to use it so it’s past the date of return.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695772800000}
{"reviewTitle":"Slooowwww","reviewDescription":"Feels like this blow dryer has zero power. Not only does it not blow a good volume of air, it gets Luke warm. Sadly I can’t return it because I already threw away the box so this is just going to sit under my sink until I eventually get sick of looking at it and throw it away","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Spend $10 more and buy a real hair dryer","reviewDescription":"This is one of the few occasions where Amazon really did me wrong.  Based on the reviews this would be a great hair dryer but in reality it is an anemic hotel type dryer that does nothing.  Spend $10 more and buy an infinity pro...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Paint chips","reviewDescription":"I have only had this hair dryer for one year and the paint has been chipping off.  It gets all over everything.  My brushes are covered in it, anything near it in the drawer gets covered.  It is even getting in my hair.  I initially couldn’t tell where it was coming from but it’s an outer coating of paint that is slowing chipping off.  Very disappointed in Conair.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Not worth the money.","reviewDescription":"I bought this to replace a Conair that I had had for years that finally died. I thought I was getting a great deal on an exact replacement.  I was wrong.  This is a cheap feeling plastic, the cord is too short.  The warm setting is pretty much room temperature.  The hot setting is not enough to actually do anything.  And it has nowhere near the air flow of my last one, even on high.  I've tried it a couple of times and absolutely hate it.  Will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Poor quality","reviewDescription":"I’ve used for like a month and it broken","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Cheap finish flakes off","reviewDescription":"I found these tiny flecks of white on my hands and face for an embarrassingly long time before discovering their source: the handle of this cheaply made blow dryer. It also wasn't the greatest in terms of drying power  and definitely not good for traveling due to the whole flaking off white paint thing. It's not the lightest weight, either. Overall, I'd advise you pass on this one.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Trips breaker and cannot be used.","reviewDescription":"I purchased as a gift for my granddaughters birthday in February but  made the purchase in December so we could transport over Christmas and have it waiting for the birthday.  The item continues to trip the circuit breaker in multiple rooms and now in my own home.  The window to return is closed and now I am stuck with a useless piece of junk.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Do not buy . Conair has horrible customer service","reviewDescription":"Stopped working and Conair won’t replace it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"White surface flakes off","reviewDescription":"Within 3 months of using this hairdryer, the white started flaking off in my hand. Then it started flaking off in tiny bits and blowing into my hair and all over me. It’s hard to get the tiny flakes out of my hair and off if my skin. Now I’m buying a different dryer. What a waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Only lasted a year","reviewDescription":"Very disappointed in this product. Was used once or twice a week and died after 14 months.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"Sparking !","reviewDescription":"I usually swear by this product I have actually bought one and gifted her to my mom! Unfortunately mine just started sparking while drying my hair ( and I just got finished drying my daughter's hair).  I un-plugged it and it made another spark. It's going great in the garbage and I'm not buying another one from this company!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Short cord","reviewDescription":"I hate this hair dryer more than anything. It has a tiny short cord which restricts your movement. The only thing I can say about it is it will dry your hair. The cold shot doesn’t get cold enough. Compared to past driers it doesn’t make my hair as soft or shiny. It’s a waste of money","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Paint flaked off in less than a year","reviewDescription":"I bought this hairdryer in Jan 23. One morning in december I noticed white flakes all over my hair and face. Upon further examination I found the source was a faulty paint job on the hair dryer. It was all over my hands as well. So frustrating it didn’t even last a year!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Stopped working after just a few months","reviewDescription":"If I'd reviewed this dryer right after I bought it, I'd have given it 5 stars. But just a few months in, it's stopped working. I've tried every possible way to reset it, including in outlets I know are working, but no luck. Now it's a 1 star and headed for the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709424000000}
{"reviewTitle":"Leaks scary white plastic \"powder\" from handle","reviewDescription":"It gets a NO STARS rating because of the short return time, no way to contact the seller after purchase and clearly inferior and potentially dangerous product. We recently noticed a strange white \"powder\" or \"dust\" coming from the switches and buttons in the handle and where the power cord attaches! Since we usually dry our hair with our eyes closed we don't know how long this stuff has been leaking and or how long we have been breathing it in! We won't use it again that 's for sure. The are a lot of inexpensive hair dryers out there and we recommend you get a different one!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1683072000000}
{"reviewTitle":"Not impressed","reviewDescription":"Not impressed with his hairdryer. Output for drying your hair is minimal I’m just doesn’t offer a good performance. Unfortunately I don’t have the box anymore. Otherwise I would most definitely return this hairdryer. Extremely disappointed and not impressed at all. I have short fine hair would have worked for me.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"No power!","reviewDescription":"I wish i could give 0 stars! Buttons get pushed while you’re holding it. It is under powered & takes forever to dry my even short hair.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Horrible noise after a year","reviewDescription":"I bought this in Feb 2023. It worked for about a year and now just makes a horrible noise when blowing air. I cannot recommend this.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Really strange white specs","reviewDescription":"It took me a while to figure out why I was covered in white specs every time I dried my hair - The material on the handle of this is disintegrating! I've only had it a few months, and I'm going to have to replace it. What a crazy thing. I'd be covered in white specs, and it'd blow into my hair, which obviously isn't desirable, lol. It's the plastic of the unit breaking down!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"White paint coating is chipping off.","reviewDescription":"The dryer itself works great. I’m in my 60’s and have had many dryers, but I’ve never had one lose a layer of paint as I used it! I paid $60 in Feb. ‘23, not the price has dropped to $21 — probably because of the terrible paint coating. I’m too cheap to throw it away but will spend some time with a scrub pad to remove as much loose paint as I can. Unbelievable. I’ve never written a review before, but this needs one. I’ve bought Conair in the past and been pleased, but they should do a recall on this product.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1683936000000}
{"reviewTitle":"Pretty and Flaky","reviewDescription":"Love(d) the white finish. It is aesthetically pleasing. Buuuuuut, I bought it nine months ago and now the top layer white paint finish on the blow dryer is flaking off. Not just the handle, but the entire dryer. I have teeny tiny white paint flakes all over my hand, the counter, the floor, inside the cabinet. Bummed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Short cord and weak airflow","reviewDescription":"This hair dryer is not the best. First of all, the cord is so short that it comes out of the wall at least once during the drying process. Second, the airflow on \"high\" is what my old Conair hair dryer would put out on \"low\". Last, after several uses, the white plastic on the dryer itself is flecking off each time. At first I thought I had terrible dandruff...turns out, it's just plastic particles. I would never buy this product again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690329600000}
{"reviewTitle":"Not so powerful LOTS lf ceramic peeling","reviewDescription":"I bought it about 6 months ago. It isn’t very powerful but just enough for what I need it for. But the WORST is the excess peeling of the material it is made. It sticks to my hands all the time and ends up in my hair, my face, my clothes. I wouldn’t recommend buying it.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"Top speed is lukewarm breath","reviewDescription":"Perhaps seniority is why this has so many good reviews; people settling.  Old faithful crapped out so I purchased this based on reviews.  At the top speed, I can still breathe with more force a foot away than this has 2 inches away.  Decent space heater but not hair dryer.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1700179200000}
{"reviewTitle":"Paint flakes","reviewDescription":"I purchased this hair dryer in February, 2023.  It works, but the paint is coming off in tiny white flecks...landing on the black electrical cord, my hands, my hair, my face, and anything else nearby.  I'll be purchasing a different hair dryer (are they all made in China?) today.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"keep searching","reviewDescription":"there are definitely better products out there for the price- this is NOT a great purchase in my opinion. My hair is thick and this does NOT work well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"At least it blows hot air","reviewDescription":"This blower is the weakest I’ve ever purchased and used for that matter. Even on the highest setting it’s pretty pitiful. Skip this one and find another.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Lacking in power","reviewDescription":"It makes noise but lacks air velocity. I returned it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Paint flaking off after 2 months","reviewDescription":"I purchased this at the beginning of December and the paint starting flaking off after two months, in February. I can’t grab the handle without getting a bunch of tiny flecks of white paint all over my hand. They are all over the drawer I keep this in. Compared to my old Joy hair dryer, this thing puts out far less air, too, so it takes almost twice as long to dry my hair. I am so disappointed in this purchase that I will not be buying another Conair product. Now I have to drop more money on something that actually works and won’t fall apart like this piece of junk.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Not powerful at all","reviewDescription":"I have thin hair which is easy and fast to dry. I thought this blow dryer would be perfect, especially how light it is. But when the air barely blew my hair, I was surprised so I returned it. I guess you get what you pay for.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Wish the high setting blew a little more forcefully.","reviewDescription":"My old Conair Blow dryer (had it for 17 years and it just died) blew with more force so it takes a bit longer to dry my hair now. The cool shot works like a dream.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"cord is short","reviewDescription":"works well to dry my hair but the cord was way shorter than any of my previous blowdryers","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Nice","reviewDescription":"Great little blow dryer; it’s not super powerful or very high heat, but for the price it’s good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Does what it’s supposed to","reviewDescription":"Great dryer for the price. The only thing is the cord is extremely short, not much reach at all. Which is why I am giving it 4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Like but....","reviewDescription":"I really like this  light weight hair dryer and would give all 5 stars, but I am having a slight issue with the dryer nozzle not staying on hair dryer. I appears nozzle isn't fitting tightly on dryer, but I really like the power on my thick hair...doesn't take very long to dry hair (great power)","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Cute","reviewDescription":"It has a weird smell when you’re blowing the hair straight but it does what it needs to and looks good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Another good Conair hairdrayer","reviewDescription":"My previous Conair hairdryer finally died, so I looked for another inexpensive hair dryer.  This is what I ordered and I am happy with it.  It is hot, is fairly power, has both speed and temperature selections and is lightweight.  I especially like that is it the quietest hair dryer I have owned.  The only issue I have is the cord.  It is about 18\" shorter than the cord on my last dryer.  My outlet is on the left, I am right handed, and my sink is a little ways down the counter.  I have already pulled the plug out of the wall twice!  So, one star deducted. I am keeping it due to price and other features.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1699142400000}
{"reviewTitle":"Works","reviewDescription":"It works fine. The others are right that the cord is short, but if your plug is next to your vanity or dresser, you’re fine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"works great but...","reviewDescription":"Hair dryer works great, but the cord is short and comes unplugged easily","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Good drying power, but not the best!","reviewDescription":"It’s easy to use. Lightweight and convenient. The drying power is good but could have been better. Serves the purpose for me to blow dry my wet hair quite well.Pretty much satisfied with the product so far!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Just okay, doesn't get hot","reviewDescription":"I can't seem to find anything close to my older model Conair hair dryer. I like the look and feel of this one, but that's about it. I have middle-length, fine hair and it typically doesn't take much to dry my hair. However, this hair dryer is just okay. I keep it on the \"low\" option with the \"hot\" setting and it's anything but. I would say it's lukewarm at best. The difference in speeds it's pretty dramatic. High is really fast with just warmish air coming out, which is quite a disappointment. It takes much longer to dry my hair than normal. The only benefit to this is the nozzle of the hair dryer doesn't get hot and you can put it away without it having to cool off. I might return this, but it's my 3rd hair dryer (different make\/model) and I just don't feel like going through the hassle of returning it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1655251200000}
{"reviewTitle":"Good but doesn’t last","reviewDescription":"This is a good hair dryer but it only lasted a little over a year.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"It’s ok","reviewDescription":"I love that it’s not loud, but it’s not a very strong hair dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Hair dryer","reviewDescription":"using it but cord isn't long enough to move comfortably","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Lasted 14 months","reviewDescription":"Paid $20 and it lasted 14 month before it stopped working.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Hair dryer","reviewDescription":"Dries quicker and is quieter than my old one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Good but only for a few months","reviewDescription":"It stopped working after a while and didn’t have enough power","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Ok for slow dry","reviewDescription":"Not soo strong and fast ,but works good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Does it’s job but","reviewDescription":"Did the job but stopped heating up a year after I bought it. I also don’t blow dry my hair very often so it’s kind of a bummer. Can’t really complain for $20 tho.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"An okay hairy dryer","reviewDescription":"I chose this one because this was the same brand as the one I'm replacing.  I don't like it as well.  On the \"cool\" setting, it still blows warm.  I can't exactly say why I don't like it; the switches flip easily when your holding it be the handle, even though you don't intend to flip a switch.  I'd say it's adequate but not outstanding.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"Powerful and runs cool","reviewDescription":"Easy to use, doesn’t run hot or make hair frizzy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"LOVE","reviewDescription":"Oh my goodness, I LOVE this hair dryer! It is so lightweight and easy to set up. I love that it comes with an extra nozzle to really direct the heat. It has good power and heat and dries my hair within five minutes. I love that it has three different heating settings and power settings. Perfect for travel!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"Great hairdryer","reviewDescription":"I had to purchase this after my last conair finally died after 8 YEARS. The buttons are very easy to navigate to low & high, and I love the 3 temperatures with the cold shot available to set your styles. I don't know what reason anyone would give this a bad review as I'm very picky & I think it's great. And I've had no problem with scratches and I'm hard on stuff. I highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Gnomelady","reviewDescription":"I love this dryer for its style, the ability to change the controls and the quietness when using. I have been using Conair products for many years.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Impressive","reviewDescription":"When my old hairdryer finally blew out, I bought this one because it has ions and dries hair quickly without damaging it.  I have been impressed how well it works and my hair feels soft and silky.  It has a good price point as well.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Great hairdryer","reviewDescription":"I love this hairdryer it doesn’t get too hot, but it drives very fast and doesn’t damage my hair like other hairdryers","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Great hair dryer for its price.","reviewDescription":"Thumbs up for this dryer. It has 3 settings for both temperature and power as well as a diffusing attachment.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"It gets my hair dry","reviewDescription":"Several temp and air flow selections available.  Dries my fine hair quickly.  Not really a travel dryer.  The weight isn't particularly light or heavy.  Does what it is supposed to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"BUENO","reviewDescription":"El blower es bueno con un buen protector térmico. El cable es corto. La boquilla la encuentro grande.  Me tarde menos en el secado. Lo recomiendo.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Great power in this hairdryer.","reviewDescription":"The hairdryer is great, beautiful design and dries your hair so well. I like the cool level myself, terrific power. Highly recommend it to anyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Paint?!","reviewDescription":"The paint started flaking off on to my hands after a year of use. Need to get another one now that’s made of plastic without paint on it…","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Never again","reviewDescription":"The day i got this i waited to use it the next day, i showered my girls 2 & 3 yr olds and comb out the hair and used the blow dryer for the first time and out of no where it stop working.Ok i let it cool off and i disconnect it.Right now as i am writing this i have my girls in the restroom to dry there hair before bedtime and now it doesn’t work at all.This would have been my second time  using it but after the first time it stop working.Very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"White stuff melts all over your hands makes balls of white goo in your hair like dandruff","reviewDescription":"My daughter was screaming at the top of her lungs about this horrible hair dryer getting white balls of plastic melted goo all over her hands and hair. Sure enough the material of this hair dryer is not the correct thing for this type of product and the handle melts apart with each use making a huge gooey nasty mess. And to think I had developed dandruff and that is why I had white balls in my hair. It gets worse with use. The second the balls start forming return it or throw in garbage before you end up with nasty white melted plastic all over your hands like my daughter did. It was a nightmare to remove. No soap takes off melted plastic. I would like to sue the manufacturer for this nightmare. Nobody should have to go through this drying their hair.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1688342400000}
{"reviewTitle":"The paint comes off and transfers everywhere!","reviewDescription":"I am SO annoyed by this hair dryer!Pros:- lightweight- nice drying power- includes a temperature switch (hot, med, cool) and a power switch (high, low, off)Cons:- the cord doesn't wrap easily around it, nor does it retract (I haven't even been able to figure out how to wrap it a bit so it's less annoying in the cabinet)- the BIGGEST problem with this hair dryer is that the paint (white option) has increasingly started coming off and transferring to EVERYTHING! It sticks to my hands, to my brush handle, to the styling product bottles. And the worst part is how hard it is to get the small bits of paint to them come off. I am currently soaking my hairbrush in the hope that will help.I really regret getting this.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1686268800000}
{"reviewTitle":"Not very hot","reviewDescription":"I thought I was upgrading my old hair dryer but this one does not put out enough heat and the controls are situated on the handle where I'm constantly turning it off by accident.  I went back to my old hair dryer for everyday use.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Lasted two months and it’s failing","reviewDescription":"Since purchasing, it’s been used about 30 hours (30 min a day).The low blower setting results in inconsistent flow and it is squeaking as if it’s starting to fail.The heat settings don’t always work, with extreme hot air coming out regardless of setting.  It appears to be more a temperature sensor issue as you can hear the load change as you change between cool, warm, hot.  Also, the cold blast works ok, at best….more of a cool trickle with continued hot air.I may have gotten a defective one, yet it worked when new.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"The paint peels!!!!","reviewDescription":"The paint from the blow dryer flakes off including the inside. The white paint ends up everywhere. I don’t recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Junk","reviewDescription":"Bought this hair dryer for my mother for christmas. Worked great until it completely stopped working this morning. I’ve had hair dryers for half the price last way longer than this one. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Hot, medium function doesn’t work anymore after three month.","reviewDescription":"Now I can use only cool function.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Extremely Poor Customer service. I'd avoid Conair","reviewDescription":"I purchased this through Amazon. When I started noticing white flecks of something on my hands and hairbrush I finally realized it was from the blowdryer handle. Since the item was under warranty I was directed to Conair. I offered photos of my hands, hairbrush and the hair dryer handle that clearly show the problem but Conair wasn't interested. The response was to cut the cord of the item, send a pic, and then I'd receive a new dryer, likely in 10 days. I responded with the inconvenience of not having a hair dryer for 10 days. Conair did not care and did not want pics. Cut the cord, send the pic, wait 10 days. Okay. Not impressed. In fact, incredibly disappointed and will make sure I don't purchase Conair in the future. The paint shouldn't fleck off and if it does, they should view pics and send a replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1681430400000}
{"reviewTitle":"TOO LARGE FOR TRAVELING- CORD IS SHORT","reviewDescription":"This is fine for the price, it's powerful enough and has 3 heat levels. The cool level is  a bit warm for being cool. My maine concern is the short power cord. If you have long hair or the electric socket is not close to where you are standing in front of the mirror you will have an issue with this dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Short hair only","reviewDescription":"I have chin length hair in this barely blows my hair around. I don’t end up with the same kind of body that I used to with my previous hairdryer. I should’ve returned it, but I was too lazy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Good for two years only","reviewDescription":"The hairdryer was decent for the price but only lasted less than two years before it stopped blowing hot air.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Works great until it starts flaking","reviewDescription":"This hair dryer is good for the money and works really well. Except about 2 months in the handle started flaking and I had white paint everywhere and it was really hard to get rid of","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715299200000}
{"reviewTitle":"Just okay Hair Dryer","reviewDescription":"I have 2 other Conair dryers and needed another one for my gym bag. Not sure why but this one just doesn’t have any power. My other ones were about the same price but are a good bit more powerful. I gave really short hair so it is okay but I wish I would have sent it back instead of keeping it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Buttons\/controls on handle not well placed","reviewDescription":"I love the color and style of this hair dryer and love this brand. There are two drawbacks, one being the inconvenient placement of the control buttons on the handle which accidentally get pressed and switched while holding and using the dryer. The other is that the COOL selection is the same as the medium or warm selection, and the dryer does not blow COOL air which I use frequently. I would not be inclined to recommend this product, but maybe one of the same brand that is designed a little differently.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Paint flakes off","reviewDescription":"I bought the hair dryer 1.5 yr ago (Sept ‘22). The white paint on the handle recently bubbled up and started flaking off, making a mess all over my hands every time I use it. Came to reviews today just to check if others had the same issue, and yep. My hair dryer is kept in a bathroom without bath\/shower, so maybe a room with higher humidity would cause it to happen quicker (as others have reported). I like the dryer otherwise, so I might try to sand or scrape the loose paint off to expedite its “shedding”…","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Good but...","reviewDescription":"Wanted to love this hair dryer, I have used Conair products all my life and this one replaced another Conair.  It does dry my hair quicker than my previous dryer, but the electric cable is 4 foot long, which is like 2 foot shorter than the other one.  This is crazy short in my opinion.  My brother did some electrician type stuff so I am going to ask him if he can switch out the old cord for this one.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Poor quality","reviewDescription":"I bought this hair dryer to replace the one that I had used for a long time. This hair dryer does not have the power like my old one does and I do not like it at all. I had to go and buy another hair dryer and will use this as a backup if needed. I would not recommend anyone buying this if they're looking for a high quality hair dryer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"You get what you pay for","reviewDescription":"At this price nobody should complain, and I'm not really.  ConAir makes a lot of different hair dryers in the same case, I guess.  The one this replaced burned out after 10-12 years.  This one blows hot enough, they say it does something with ions?  Yeah, your hair is softer and fluffier, but I like a more powerful blower, particularly on cold.  This one doesn't do that.  The fan motor is maybe 60% as powerful as my old ConAir.  My wife likes it, though, so I gave it to her.  I'll spend a little more next time and get something more powerful.  ConAir makes good stuff, I'm sure this one will last a long time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"value","reviewDescription":"The restart button is stuck, could be a fire hazard. Return is not finished. They are  not wanting to do a refund. Very disappointed!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714089600000}
{"reviewTitle":"Fire hazard","reviewDescription":"I've only had this a couple months and it turned off by itself I push the red and yellow button on the plug to reset it and it sparked out the back of the hair dryer. This thing is a fire hazard","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709510400000}
{"reviewTitle":"Terrible","reviewDescription":"I was trying to upgrade my over 10-year-old blow dryer with this one, but it absolutely sucks. It has barely any power, took twice as long to blow dry my hair.  I would return, but I unfortunately threw away the box.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"JUNK! Stopped working after 6 months.","reviewDescription":"Hair dryer was used infrequently and stopped working after 6 month. Junk.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"POOR PLACEMENT OF ON\/OFF AND HEAT BUTTONS","reviewDescription":"The dryer is lightweight and efficient, however, my fingers constantly hit the ON\/OFF button turning it OFF and if I move my hand to another position my skinny fingers hit the heat selector button.  Really, Really Bad Design.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"not working","reviewDescription":"Just bought it 4 months ago and it doesn't work anymore. Amazon has closed the return window and returns cannot be made!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712707200000}
{"reviewTitle":"Paint started chipping off into thousands of pieces everywhere","reviewDescription":"DO NOT buy this. Only owned this for 3 months and it barely dries very well, and worst of all randomly 1 day after 3 months the paint all over the handle and near the buttons started flaking off into millions of pieces for no apparent reason. I keep it dry in and inside its box in my room 24\/7 so there's no way this is due to water damage or anything else. The paint is chipping off into thousands of pieces and I have no clue why. Of course it happens 3 months after I bought it so now I can't refund. Awesome.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"Not a good dryer","reviewDescription":"I don’t think I received a new dryer but maybe a refurbished one? Is that even a thing? I got it in October 2023, and have used it sparingly. I got it as an “upgrade” to replace the one I’ve been using for years.  It’s now been 2 months and it will not blow hot air. Don’t waste your money and stick to what you already have.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703203200000}
{"reviewTitle":"Paint chips","reviewDescription":"As others have stated, paint ships off every time I use this dryer. It gets all over my hand and forces me to rinse my hand off before continuing to style my hair. Worthless.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Fan breaks in 3 months","reviewDescription":"I bout 2 of these in the past 7 monthws. Each lasted 3 months an d then the faqn burned out. It smelled like an electrical component was on fire.  CANNOT","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"TERRIFIC HAIR DRYER","reviewDescription":"Don't let the price fool you.  This little hair dryer really packs a punch.  My hair is very thick and hard to dry but this dryer does a great job.  It is very light and doesn't pull on your arm.  The temperature settings are handy and not difficult to operate.  I'm happy and would purchase again.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Love this newer version!","reviewDescription":"I've been using an old version of this and brand for 15 years or more. I love the different temperature and high\/ low settings, especially for my three year old.Having cool, and cold blast is the best!The attachment clips in instead of cupping on, for lack of better description, so I feel it's less likely to break\/ stress the plastic, and won't fall off.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Light weight dryer","reviewDescription":"This is a nice light weight dryer that works well, dries your hair quickly. I have long thick curly hair so I added a diffuser to this dryer. Does a great job!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Nice new hairdryer!  Very happy with the purchase.","reviewDescription":"My old hairdryer was on its last leg.  I am really happy with the new Conair Ceramic Hair Dryer....it's lightweight and dries very well.  It's rather large for travel but I use it for home.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709078400000}
{"reviewTitle":"Great for the price","reviewDescription":"Great machine, Its good to keep in one's bathroom, not for travel since i consider its to standard in size to be a travel one.Does what it needs to do, and it has a cold air button to fix the hair after hot air.Sturdy good quality over all. I recommend it if your budget is low :)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Light and powerful","reviewDescription":"It is perfect for traveling because of its light weight. I used it in Florida and the Ionic conditioning kept my hair from frizzing so I bought one for home.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"THE DRYER","reviewDescription":"VERY good hairdryer...high quality.does the jobVery nice action.versatile.Lightweight but solid. Would purchase again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Didn’t know what I was missing","reviewDescription":"I really didn’t need a new dryer but my stylist suggested to get one, but don’t pay a lot. So I got the Conair as that was my last one. Ceramic really does make a difference!  The old one will go to vacation house.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Nice hair dryer","reviewDescription":"This hair dryer is light weight and seems like it doesn't blow very hard. It's quieter than my old expensive dryer. However it drys my hair great and quickly. Leaves my hair fluffy and full, not at all frizzy. Would buy again!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Great dryer","reviewDescription":"This is my second purchase of the dryer, that’s how much I love it. My first one I had for many years using daily. It’s extremely lightweight hard working has nice heat settings so you can go to cool it’s very pretty and aesthetic. It’s white but doesn’t get dirty and  easily wipeable.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Yuck","reviewDescription":"This blow dryer is a waste. 1875 watts of what?  Doesn’t blow hot just warm. Doesn’t have enough strength to blow a lot of air. I had a 2000+ wattage before. I left it in Mexico so I got this until I can go back and get.  I am so sad to say this is a piece of junk.  Don’t waste your $$$","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679616000000}
{"reviewTitle":"The Finish Is Flaking","reviewDescription":"The drying aspect is fine. My issue is that after a couple of months the finish started to flake off, leaving white specks all over my hands and everything  else every time I use it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Too plastica","reviewDescription":"İts too plastica not good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"White paint flakes off","reviewDescription":"My hands are covered in flakes of white paint after drying my hair! The handle is literally flaking off! I have no idea why others do not report this. I’ve gone back to my old dryer.Also the cord is too short and the choices for air flow are too extreme, too low and too high with no middle option.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Not powerfull!!","reviewDescription":"Not powerfull enough!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Great drying power!","reviewDescription":"I bought this dryer to replace my 15 yr. Old Conair. This one is very lightweight and dries my hair quicker! Highly recommend!Update: I changed my rating from 5 to 2 stars because the white paint around the handle is peeling which leaves white chips on your hand that transfer to your hair and face. Won’t come off of brush handle. Don’t get the white one!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"low air flow","reviewDescription":"The blower on this hair dryer is not strong enough for long hair.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Paint comes off and short cord.","reviewDescription":"The white paint is now chipping off. All over my hands, hair and clothes. Nozzle is fat and doesn’t direct properly for a good blow out. The cord is much shorter than my previous dryer. It kept getting caught on my drawer handle and none of my other beauty appliances do that. I’m super disappointed in this product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"not powerful enough","reviewDescription":"This is not an 1875W as advertised. It does not blow enough air.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Not powerful at all","reviewDescription":"Takes me forever to dry my hair using this dryer. It is lightweight and quieter than most hair dryers but it just doesn't seem like it has enough power.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Good but nothing special","reviewDescription":"It’s good but not any different than other simple hairdryers. I do like the attachment that funnels the air in one direction though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"not as lightweight as I'd hoped","reviewDescription":"The features of the dryer are adequate, but I'm not sure it's particularly lightweight.  I have arthritis in the base of my thumbs and never had any trouble with the dryer I owned previous to this.  I bought this one based on it being lightweight, but the shape of the neck is different, and at first I thought I wasn't going to be able to hold it at all because the way the weight rested on my thumb was extremely painful.  I finally determined that if I got kind of a death grip around the top of the handle, I'd be able to use it without the pain, but it's awkward.I have very short hair, and I don't know if the fact that it seems to frizz on top a lot lately is related to this dryer or if my stylist cut it differently last time.  I think most people would be satisfied with this for a reasonably priced hair dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1667001600000}
{"reviewTitle":"This one was a keeper","reviewDescription":"This is one of 3 Conair hair dryers I purchased to replace one that died, and it’s the one I kept.Pros: cord length, weight, prevents hair from getting caught in the fanCons: the switch placement and type leaves me constantly pressing buttons I don’t mean to while blow drying, the speed & heat settings are painted on and I’m sure they’ll rub off in no time and I won’t remember what is what","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Switch location","reviewDescription":"The hair dryer is good for the price but the location of the high\/low\/off switch has me hitting it with my hand frequently when using.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Paint chips off onto hands!","reviewDescription":"White paint is chipping off of dryer and onto hands. I have tried washing down plastic part with damp cloth, but it is ongoing. It seems to get worse if I wash it off It is very frustrating and I feel product is defective. I will have to return or throw away. It takes several washings to remove paint from my hands.I will change rating from 1 to 4.I contacted Conair and once I showed them what happened, they sent me a new dryer right away. So far, so good. That is why I am reserving a 5 star rating!","isVerified":true,"ratingScore":4,"reviewReaction":"49 people found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"It's okay","reviewDescription":"I got this hair dryer for my 13 year old daughter. It's a pretty color and does as it should. However I wish it came with some attachments like a diffuser. Overall tho you get what you paid for.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Dryer","reviewDescription":"For the money it is nice. Thought high setting would be more powerful but again for the price it is nice. Also bigger than I thought it would be.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"hair dyer is  great","reviewDescription":"kind of big for traveling but great for the house love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Lightweight but powerful","reviewDescription":"Purchased about 6 months ago. I have not experienced any problems with paint chipping and peeling from the handle (as some reviewers have reported). Maybe this is because I don't use any foams or gels on my hair so my hands are clean and dry when holding the dryer. The shorter cord is actually nice because it isn't dragging across the vanity. The heat settings are perfect; no frizzing or scalp burning. And it is much lighter than any hair dryer I've owned.  I only gave it 4 stars because the low speed could be lower but overall, it's a great hair dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"Cord is considerably shorter than previous models.","reviewDescription":"This is a replacement for a previous Conair blow dryer that recently gave up the ghost after several years of daily use.This new model does not get at hot as my last one which, to be fair is probably better for my hair.It is much lighter than my previous one. That's nice.But be aware that the cord is MUCH shorter than previous models. At least a third shorter. I used to be able to sit on the side of my tub to dry my hair. Now I have to stand next to the plug. Not a big problem, but if your plug is some distance from where you can comfortably use a blow dryer it is a consideration.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1683763200000}
{"reviewTitle":"Lightweight","reviewDescription":"I like that it's lightweight.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Light weight","reviewDescription":"Has high med low speed..and hot med low heat .. and light weight","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Great ionic hairdryer","reviewDescription":"This is a very nice hairdryer, though it's a larger size. Love the varied controls, but sometimes holding the device you accidently change the control buttons by pressing them.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Hair Dryer","reviewDescription":"This hair dryer works great, just as it claims! My only issue, and it’s why I didn’t give it a 5, the high\/ low rocker switch, doesn’t lick hard and is right where your fingers are and changes the power when you don’t want to! So you end up switching back and forth! My previous one had a hard lock switch! Otherwise works as needed","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"As described","reviewDescription":"Nice for travel and does dry my hair quickly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Not as hot as my old Conair","reviewDescription":"Like this blow dryer, replaced an older model","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Blow dryer","reviewDescription":"I liked the styleAnd lookOf the dryer! Works very well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"3 heat options and a cool shot button","reviewDescription":"I enjoyed the 3 heat settings (cool, warm, hot) and 2 intensities. The cool option is still warm air, but it makes drying my hair in the summer heat more bearable. I mostly use the warm setting to dry my hair.I think it does a good job at drying my hair evenly. It’s also not too heavy either. There’s a part you have to detach to clean the filter. It’s easy to remove and I found no difficulty putting it back on either.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Worth the cost","reviewDescription":"The power was adequate. The heat and power settings were convenient and easy to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Short cord","reviewDescription":"The hair dryer is good and I like the white for a change but the cord is too short.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Works great!","reviewDescription":"For the price, this is a very nice hair dryer. It leaves my hair soft and doesn’t make it frizzy or feel brittle!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"Needed (Heat), literally","reviewDescription":"Hear me out. I've been a cosmetologist for many years at like Aveda, Paul Mitchell type salons. But needed a hair dryer for an especial purpose. Bought Amazon Strong shoe glue. It stated I needed to dry glue. Only using a blow-dryer. Retired from hairstyle and I'm a dude with no hair. Should have read the fine print before I bought not cheap glue. Is there a reason it's $12 and not $1.50! Like a plethora of cheap glue on Amazon. Well I ordered said blow dryer because...heck I fancied a lot of hair in my time. But gosh as Americans I'm so spoiled. Bought a blow-dryer to dry glue. Well the shoes were not cheap and needed repairs (DIY)! Bought back memories as a hairstyle. Well kinda. Drying glue with a blow-dryer is nothing like using it for it's actual designed purpose. Well it worked mighty fine. May e I'll come out of cosmetology retirement. Hope I'm kidding. Well in closing. Needed Heat to remedy a situation and the blow dryer went above and beyond! From a cosmetologist pov...I would recommend.  It will perform just fine and heck you might need to dry some glue. Laugh!","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1673481600000}
{"reviewTitle":"Good value","reviewDescription":"Good value for the price. I’ve had this blow dryer for a few months now and it is still working great and I’ve had no issues with it. I was a little worried about the size after reading a few reviews, but find it to be the perfect size.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Lightweight but very powerful!","reviewDescription":"I love this hairdryer. It blows air very well, yet it is not heavy. It has 3 settings for heat: hot, warm, and cool, and two settings for air speed: high, low and off. It really blows air very well, especially on high. Compared to the hairdryer I replaced, this is like 1000 times better! It has 1875 for the power, which is a lot of power. I can dry my hair in about 1\/2 the time it took before. I doubt if you will find a better hairdryer, even if you pay more.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Great blow dryer","reviewDescription":"I've loved conair and used for years. My previous one lasted over 10 years. This one is lighter and heats up well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Pretty powerful hairdryer","reviewDescription":"This nice white hairdryer has more power than my last one. I own several vacation rentals so I bought five of these hairdryers to place in all the bathrooms in each of my rental homes. Guest appreciate a good quality hairdryer rather than a cheap weak one. I recommend. Has the attachments too for directional air. No diffuser though, but it has a low blow setting.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Great hair dryer.","reviewDescription":"I love how light this hairdryer is. I have used it as a heat gun as well and it overall has held up great. Very durable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Nice Blow Dryer.","reviewDescription":"I was hesitant on buying this dryer because a lot of the reviews we’re talking about the paint flaking off of the handle but I have not experienced anything like that. It’s actually a really nice hairdryer. Maybe because it’s still new it has not flaked but I don’t really see it starting to and I’ve used it as soon as it came out of the box. I really like the settings and it’s not too loud. the air is almost really soft. I’m enjoying it very much.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Looks good, so far works good","reviewDescription":"Great for the value and is an attractive color and design. I like the removable back cover to be able to clear the net to keep the airflow going. Just got it a week. I hope it lasts for a long time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Great but....","reviewDescription":"This hair dryer works well. It is not a string producer, but hair deres shouldn't be. So they tell me. This js the second one I bought. The first one was a bit messy. The white top layer of the dryer started flaking off. Eventually it wore off.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"Weak","reviewDescription":"Weak air flow even when turned up to high.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Not a fan","reviewDescription":"Not what I thought it would be. Low power and you can’t style your hair while drying. Had to buy a different dryer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"It works","reviewDescription":"My daughter said it works but she was not impressed at all, she said it was a dud.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Paint chipping off the dryer handle","reviewDescription":"The dryer itself works fine.  I liked it.  But I've had it for about 4 months and suddenly, the paint on the handle chips off in my hand.  It's the ODDEST thing.  But I have to remember to wash my hands immediately after using it BEFORE touching my hair, otherwise, there's paint chips all in my hair.  Ask me how many mornings I've accidentally done that.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688169600000}
{"reviewTitle":"Disappointing","reviewDescription":"I have used this brand dryer for decades.  This version is the most inferior.  The best part is, it IS light. But the buttons are constantly getting accidently toggled, my brush gets stuck in the screen. That has never happened before and for 1875 speed it feels so much less than my last one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Disappointed","reviewDescription":"Sooo Disappointed. Came in an open box, was missing attachments that were shown in the pictures, and takes FOREVER to dry my hair because the high\/hot button blows warm air at least. Such a waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Do not recommend-POOR quality","reviewDescription":"The blow dryer itself works fine, does what it’s supposed to do. However, after about a month of using it on a regular basis the white paint started rubbing off of the area where my hand goes when holding it. The pesky little specks of paint get EVERYWHERE and stick to EVERYTHING. Super frustrating, especially when trying to dry my hair quickly and then have to spend time trying to wipe off sticky paint specks. Poor quality. I guess I got what I paid for","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Problem with coating on handle deteriorating.","reviewDescription":"I have used this dryer for the past 11 months and all of a sudden the flat coating on the handle has deteriorated and  is flaking off. When I use the dryer I get white flakes in my hair and on my face and clothing. The handle is losing its flat white appearance and has become shiny. Up until now the dryer has been fine.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"White paint flaking","reviewDescription":"Bought this dryer a year ago and left it in AK where I knew I would be returning. The hair dryer works fine but why is the white paint flaking off with use? Never had a hair dryer do that before. I have to blow the white flakes away with each use—not good to inhale,","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693267200000}
{"reviewTitle":"Paint peels off","reviewDescription":"I've used it 3-4 times a week, for 5-6 minutes each time in the past year. Paint on the handgrip started peeling off two weeks ago. Each time I use it, I get lots of white debris on my palm. I've never seen such a problem with a dozen of hairdryers I've had.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"No power. Don’t waste your money","reviewDescription":"No power, I feel like I’m using a toy Barbee blow dryer. I hate I spent any money on it. Do yourself a favor and don’t buy this","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"It stopped working after the third use","reviewDescription":"It stopped working","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"WHAT A MESS","reviewDescription":"This white blow dryer is PAINTED white and it chips off like glitter! It took me weeks to figure out where all the tiny tiny specks of white all over my brush handles, cords, and even hands and hair came from! UGH. dryer works great but its a constant mess.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I've purchased two of these dryers in 6 months. The first one's motor blew less strong after the first few weeks, so I exchanged it for another. The second one did the same now. It takes significantly longer to dry my hair because it isn't ask strong.Waste. Of. Money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"So disappointed","reviewDescription":"After using this for 6 months, the white paint coating on the hair dryer started to flake off. It was causing all kinds of little paint chips to fall in my hair and get stuck on my hands. I tried to return it but was past the return window.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Blows Hot Air & That's The Only Thing Useful About It!","reviewDescription":"This hair dryer is not user-friendly at all.  It's heavy & bulky, the cord is so short I can't even use it while sitting at my vanity & the air concentrator falls off every time you move the dryer the slightest bit, so it's basically useless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Heat setting button will not hold in place","reviewDescription":"Overall I DID like this hair dryer but the button to make it blow hot air will not stay on the high setting unless I hold the button and try to dry my hair at the same time. I will not buy this product again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Trash","reviewDescription":"This is how it was sent in a box worst gift purchase ever","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Paint chips - not great","reviewDescription":"After a few months of using this hairdryer I found tiny specks of paint everywhere.  I like the dryer, but cannot take the continued flaking, especially after finding one in the corner of my eye!  Time to find another dryer :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Cute, but not great.","reviewDescription":"This is a cute hair dryer, but even the high setting feels like it’s on low. My hair typically doesn’t take long to dry, but because this hairdryer is pretty terrible it takes 2x as long.would not recommend this product to anyone.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Stopped working after a month","reviewDescription":"Suddenly stopped working after a month!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"DO NOT PURCHASE THIS IF YOU WANT TO USE IT FOR A LONG TIME","reviewDescription":"Mediocre blowing power (high and cool has same temperature?), white paint chipping which is a major health hazard (who knows what these paint chips are made out of?).  Consider yourself warned.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708732800000}
{"reviewTitle":"Lasted 36 days","reviewDescription":"Died on me after 36 days!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"Bad Quality","reviewDescription":"Stops working after 4 months","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1715817600000}
{"reviewTitle":"The white coating flakes off like glitter everywhere!","reviewDescription":"Initially I loved this dryer. It really dried my hair nicely. I really liked the removable filter that made cleaning out lint buildup easy. However, the huge negative was the white coating on the handle started flaking after 2 months. The little white flakes on my hands where difficult to wash off and forget about trying to get it off clothing and surfaces. I did not realize that was where it was coming from at first. I am still finding them, like glitter. I missed the return window and had to throw it away.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Surface degrading","reviewDescription":"I loved this blow dryer when I bought it, but the surface finish is now deteriorating. Flecks of white are beginning to stick to my hands, hair, floor. It is very difficult to remove them. I keep my appliance in the bathroom on a loop holder that is used in salons, not in a drawer or somewhere that it can’t cool properly after use. I’m disappointed in the quality and that I can’t return it now. It has only been since February this year, about 3 or 4 months.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"IT DID NOT WORK AT ALL","reviewDescription":"I think this item had already been returned once since the box was not sealed nor was the bag that the hair dryer came in sealed. IT did not work at all and I was quite surprised to receive something that did not work at all. I even had a friend try it out to make sure....","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Fan is hardly working!!!","reviewDescription":"I just bought this hair dryer last June and today the fan is hardly blowing. It still heats up and blows some air but not enough and it’s making a weird noise and a burning smell. My old one last me over 10 years. And this one not even 6 months. Not worth the money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Do not buy","reviewDescription":"It’s only been a month and this already blew out stopped worked and started sparking","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1713916800000}
{"reviewTitle":"Cute color but….","reviewDescription":"This hair dryer does NOT get hot enough to style hair. Might be good for someone with short hair that doesn’t use this as a styling tool. I threw the box away immediately thinking it would be fine. But now I can’t return it without the box (return instructions say pack in original box)","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"as advertised","reviewDescription":"works like a charm","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Very good hairdryer","reviewDescription":"Drying hair","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Simple, works well","reviewDescription":"The blow dryer works well and is reasonably priced. If you don't need anything too fancy this is a good one. I use the high airflow with cool air.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"El mejor secador","reviewDescription":"Multifuncional en todo el sentido de la palabra, las diferente velocidades que tiene, que tiene un boto especifico para aire mas frio de lo regular. Si estas empezando en el mundo del cuidado del cabello esta seria una excelente herramienta de calor","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Works","reviewDescription":"Not high powered but works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"It works great","reviewDescription":"Alohalike these hair dryers with very hot heatgood for hair type like mines","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Good","reviewDescription":"Stylish, seems well made, and works as it should.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Love this product","reviewDescription":"I love this blow dryer works so good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"good, basic hairdryer","reviewDescription":"There is really nothing special about this hairdryer, which is exactly the point. I just needed to replace my old hairdryer whose motor was burning out, and I needed it to dry my hair.  Check.This model has 2 heat settings and 2 airflow settings, plus a cool shot button to hold for cool air.  Does the ionic conditioning feature work?  No idea, as my hair didn't come out frizzy with my old dryer either. Does the concentrator nozzle work?  The knowledge I gained in fluid dynamics and nozzles while working towards my Mechanical Engineering degree tells me this will properly accelerate the airflow, just as you'd expect.Unless you have a dire need to color coordinate your hairdryer with the furnishings in your bathroom (which, let's face it, if you have that need, you are likely paying someone else to buy your hairdryer and not reading this review), I don't see why you'd buy a more expensive model.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"Conair Secador de pelo de cerámica doble","reviewDescription":"exelente la calidad de esta secadora estupenda","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Love love love","reviewDescription":"Awesome hair dryer. So light weight. The hot setting is not so hot that it burns your hair or head. Would recommend to everyone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Blow dryer","reviewDescription":"My wife likes it. She has real thick long hair.  Says it’s fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"The price is amazing","reviewDescription":"We love this brand and so happy we could find this on Amazon and ship to my daughter in Arizona.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"Good hair dryer","reviewDescription":"It's the same name and wattage as my old one. I was so surprised at how much more quiet it is. I like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Great Little Hair Dryer","reviewDescription":"Works great. Dries my hair really fast which works great for me, for I am always in a hurry, jump in the shower and out the door.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"a good deal","reviewDescription":"we like this hair dryer because it is lightweight and easy to use and does a good job","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Great hair dryer","reviewDescription":"I just purchased this to replace my old Chi that died. I enjoy the lower heat setting with high dryer speed. would definitely recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Lightweight and Quiet","reviewDescription":"Wasn't sure what to expect From a ceramic blow dryer, but it's probably the nicest blow dryer I've ever had. It's very comfortable, light weight and not too loud. It doesn't blow really hard but hot enough to dry my hair and not burn my scalp!!Really happy with this purchase!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"It works and a great value.","reviewDescription":"This handheld hair dryer does what it says it will do. It has two options for heat and two options for blowing power. It comes with the directional attachment. It works perfectly. It isn't rocket science. I don't see any reason to pay for a more expensive version.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Lo ame","reviewDescription":"Temperatura y caudal excelente siento que cuida mi cabello","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Perfect - Except not enough handle room - accidentially change settings trying to use it","reviewDescription":"Hairdryer would be perfect except there is not enough room on the handle to hold it without hitting the control buttons and turning it from high to med or med to low on accident, I do it 2 or 3 x every use. It's annoying","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Excellent except white flsking off","reviewDescription":"I love this dryer, its a bit heavy but works really well, smooth healthy hair. Its 5 dtars except one thing, handle white is flaking all over my hands  brush. At first I thought it was product but have realised its the dryer material","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"It's ok","reviewDescription":"The power is the same as my old one. I was disappointed in the length of the cord. The shortness of the cord requires me to keep close to the vanity and the electrical outlet.A longer cord allows for more flexibility.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Not very hot","reviewDescription":"This dryer is not the greatest. It doesn’t get very hot and seems like it takes me double the time to dry my hair as it did with my other smaller dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Good hair dryer","reviewDescription":"I want to start off with I do like this hair dryer. I am right handed and I feel like this is more designed for lefties. It’s kinda awkward when blowing out another persons hair. The cord is not very long either. It kept coming unplugged when giving a blowout. I do like the design and how quickly itdries. It is not too hot; as someone stated in the comments the heat feels like a towel coming out of the dryer. I do agree. I would recommend but until I work out the kinks I wouldn’t purchase again. 4\/5 stars. I got the full size also.Edit to add: I have had this for a few months now and I still hit the buttons to turn it off by accident, but I do like it. I hate that it comes unplugged so easy also. I would purchase again. 4\/5 stars still stands in my opinion.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1667779200000}
{"reviewTitle":"Short cable","reviewDescription":"I don't know why Conair decided to cheap out on the power cable. Im 5'7\" and my power outlet is one of those near 1 foot above floor level. I can just barely get the hair dryer over my head! I'm pretty much just around average height. What about those who are taller? They would not be able to use this without getting an extension cable... Real shame this was where they decided to do some cost saving. Other than that the hair dryer works great.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"Good product bad shipping","reviewDescription":"I have used Conair for years. This is my go to for hair dryers. I'm surprised it isn't broken because it was shipped in its own Conair box which was smashed, punctured and not even tightly sealed. Amazon should be ashamed of this packaging. I'm just assuming hair dryer is undamaged because it worked when I turned it on.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Pretty and doesn't dry hair","reviewDescription":"This is the prettiest blow dryer I've ever had. The white with a touch of bronze is so lovely. Functionality is also very effective. My hair doesn't feel overheated when I'm styling it and there's no frizz on the ends from heat exposure. My only complaint is that I wish the electrical cord was a bit longer. At 5' it's just a tad too short for my comfort as I'm used to one that's 6' long. Guess everything is getting reduced these days.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"Works great","reviewDescription":"Have it as a gift and she loves it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"Works Great","reviewDescription":"Thanks","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705104000000}
{"reviewTitle":"The spray over paint it terrible. It's EVERYWHERE!!!!","reviewDescription":"The blow dryer itself is great. I do wish it would fold and has a cord that sucks in. However, the biggest irritation about this dryer is the paint. Literally the white pieces are coming off and getting stuck onto everything: my hands, the counter and I find it in my hair. I was hoping that it wouldn't be such a bad thing but it's really bad. Not sure if I can return it or exchange it but it sucks that I would just rather buy another dryer if I cannot replace this one.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1679097600000}
{"reviewTitle":"Used twice","reviewDescription":"I only used it twice and the white came off in tiny pieces onto my fingers and in my hair.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Devolución","reviewDescription":"No, cumplió con mis deseos lo devolví ya que el calor y la potencia no eran lo que esperaba....","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Pain chips come off this hairdryer EVERYDAY","reviewDescription":"Seems this is a typical conair problem which is insane.  The paint they use chips and comes out on my hands and my hair.  It looks like lead paint honestly!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Stopped working after a month","reviewDescription":"The hair dryer blew air at a very low rate to begin with but I kept it thinking it was fine due to not needing to use it often. I’ve had the hair dryer for a month and maybe have used it 5 times and now has completely stopped working but smells smoky when plugged in. An unfortunate waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Peeling everywhere!","reviewDescription":"I usually love Conair products but I hate this “ceramic” dryer. After using it for a few months, I would notice white paint chips on my hands after each use. If you look closely at the picture of the dryer, you can see where the outer layer is peeling away. The white chips get on everything- clothes, skin, etc. i wish I didn’t choose this model.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Paint flaking off?!!","reviewDescription":"The paint seems to be coming off of the handle non-stop and gets stuck in the back of the blowdryer and sticks to EVERYTHING (hair, clothes, hands, walls, etc) - seems poorly crafted.It also doesn't seem very powerful compared to other dryers I've had in the past. Sadly the return window closed literally right before the paint started to chip and flake otherwise I would've tried to return it. Never buying this model again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1685664000000}
{"reviewTitle":"I bought this and it is broken in few days","reviewDescription":"It iş very cheap product","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Clearly used dryer","reviewDescription":"I received a used dryer. Price has now increased and return requires label and trip to ups","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Cheap Knockoff!","reviewDescription":"This isn't a real Conair. It has a fraction of the air and heat output. The cord is very short. The white plastic started sluffing about 3 months after we got it blowing small hot white pieces of plastic all over me and the bathroom!  I bought a real Conair and threw this junk in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Stopped working after 1.5mo, right after return window closed","reviewDescription":"If the price seems too good to be true… it’s because IT IS. Received this product in perfect brand new condition. It worked well given the price - aka not very strong airflow or high heat, but that is to be expected for this price point, and was good enough to get the job done. HOWEVER what I did not expect was for it to stop working shortly after the return window closed. On full speed the air flows as if it’s on the lowest setting and feels warm at best. I’ve tried resetting my outlet and the hairdryer plug, and even trying it in a different outlet, all to no avail. I might as well be AIR drying my hair. Such a disappointment, and really appalled at the quality of such a well-known and respected affordable brand.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1703894400000}
{"reviewTitle":"Breaking after 4 days, dangerous","reviewDescription":"The motor for the hair dryer is going off while using it  and then  suddenly starts up again. I am concerned that it is NOT  safe and will have to toss it. This was a replacement for same  design and size Conair hair dryer that was pretty old ,  but the cord  got frayed . It worked great till then.I would return this Conair dryer I  but threw away packaging because I could not imagine it would break in a week!I think it is dangerous.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"WHITE FLECKS EVERYWHERE!  Not Original ConAir Corp","reviewDescription":"Purchased this white ConAir blow dryer mid September 2022.  Tested immediately and it worked well in terms of heat and drying the hair.  Yet, I don't use blow dryers often being I prefer to air dry my hair.  However, there are times a blow dryer is needed. I pulled this model out after 3 months and white flecks are flying everywhere making a mess!  In my lifetime, I have owned a fair amount of ConAir products.  The items always performed and held up very well.  I never had to return the product or throw it in the trash.I tried calling \"Con-AIR\" now owned by American Securities since 2021, and each time I was on the line holding.  After 17 minutes my calls were dropped.. The website does not list their hours of operation.I wish I had read the 1 and 2 star reviews.  More junk from ......you know where and more refuse for our landfill!! UGH!","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1680739200000}
{"reviewTitle":"Chipped peeling paint","reviewDescription":"Like another review has mentioned, the white paint chips off in my hand while using. This happened shortly after purchase, I should have returned it. Poor quality design, switching to revlon for my next blow dryer.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"Do NOT buy!","reviewDescription":"I unfortunately waited too late to return this item but I regret the purchase. The paint on this hair dryer flakes off and sticks to your hands and then when you touch your hair it comes off in your hair and it’s hard to get out. I walk around with random white paint chips in my hair sometimes without even knowing it until I see it later in the day. It’s pretty much going in the trash as soon as I purchase a better one.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1712102400000}
{"reviewTitle":"This poor thing didn't last 3 months.","reviewDescription":"The hair drier died after 3 months of use.  I used it on most days.  The company did offer a new product as there is a 2 year warranty.  The new replacement will arrive in about 2 to 3 weeks.  I will have to buy a different hair drier to cover those weeks I have to wait for the replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716163200000}
{"reviewTitle":"Stopped working","reviewDescription":"Had this for 7 months with infrequent use. Completely stopped working one day. Things aren’t made to last anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Paint chipping","reviewDescription":"So at first I really liked this hair dryer other than first noticing that the cord was shorter than my previous hair dryer but I was okay with that because it was less cord to tangle\/store under my bathroom cabinet. After a month of using, the paint around the handle began chipping. It got so obnoxious that there were little white paint chips in my hair and all over my hands. It was never in a bathroom with lots of steam\/condensation so I can’t imagine what this would’ve been like if it had been. It dryers great and I love the low medium high heat functions but this paint chipping is unbearable. My advice: keep looking","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1703635200000}
{"reviewTitle":"VERY DISAPPOINTED - Paint Chipping","reviewDescription":"PAINT CHIPPING DISASTER. I'm deeply disappointed by the quality of the product I purchased. Unfortunately, the paint on the item chips off excessively, making it an unpleasant experience every time I use it. Even the simple act of using a blowdryer results in paint chips covering my hands, which is certainly not what I expected. It's evident that there is a significant issue with the product's design or materials.What adds to my frustration is the lack of responsiveness from the Conair team. I've taken the initiative to reach out to customer service three times in hopes of finding a solution, but regrettably, I haven't received any form of assistance or even acknowledgment.I had higher expectations from Conair, given their reputation, and the absence of support has left me genuinely let down. I hope my feedback reaches the relevant parties and sparks some attention to address these concerns.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Box opened and damaged","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Fire hazard","reviewDescription":"Used maybe 8 times And the other day it started smelling like smoke…Tried again today and it immediately started melting something inside!!!had to take it outside😱I’d rather have an expensive dryer that works. Than one that will burn itself up!!! 🥹","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Do not work","reviewDescription":"I had tried so many times and just found that this dryer didn't work at all. I had to pay the money to return it back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Matte coating comes off in flakes like dandruff while you dry","reviewDescription":"Ugh loved the matte look of this but it comes off so easy onto your hair and hands during a dry that it looks like you have dandruff. I hate this thing and will have to buy a different hairdryer now","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"White paint is flaking off","reviewDescription":"Functionally the hair dryer is excellent.  Unfortunately shortly after purchase, the white paint or coating began to flake off.  I first noticed the flakes sticking to my hand after using the dryer.  I found that I had to wash my hands to remove them.  I tried cleaning and scrubbing the dryer, but to no avail. The more I scrubbed, the more flakes appeared. With the concern of environmental microplastics which can be non-biodegradable, I didn't want to risk exposure.  I simply replaced it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Not very powerful","reviewDescription":"Very weak. I sent it back. Got a refund no problem.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Finish is falling apart","reviewDescription":"Don't buy this dryer if you don't want to have little white specks all over your hands, face, hair and everything that your hands come in contact with.  I have had this dryer for exactly one year and about the 10 month mark, the white finish on the handle is breaking off into little flakes and sticking to everything.  Now I have to buy a new dryer, so frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"Began peeling immediately","reviewDescription":"It works fine it just began peeling within the first few uses. It’s worse than the photos even show. I should have returned it but never got around to it. Very low quality and not worth your money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Very cheaply made","reviewDescription":"The white paint on the body started flaking off after 2 weeks of use and the air is weak, it takes double the amount of time for me to dry my hair with this product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Coating melts off and gets stuck to your hands","reviewDescription":"This hair dryer sucks. It gets hot and then the plastic coating melts off onto your hands and gets on everything.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Not powerful","reviewDescription":"I noticed even on the highest setting it is not nearly as powerful or effective as some with the same wattage","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Not quite good enough","reviewDescription":"I had been using a Conair hair dryer (the orange one) that had worked great for years. I wasn’t a fan of the color, though, so when it finally gave out, I selected another Conair of equal power (1875 watts). This one does the job, but the motor sounds a bit tinny, and the cool down button isn’t really cool air. It’s less warm, but because it’s not cool, it doesn’t “set” the curve or smooth effect I’m trying to achieve. I’ve had the dryer for several months, and I  think I’m finally going to try something else, probably Conair again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Love the hair dryer but the cord is too short!","reviewDescription":"Live the hair dryer, various settings, but the cord is too short.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Settings work good","reviewDescription":"I read all the reviews on this before purchasing but wanted this 1875 model as it is similar to previous model which is still working fine. I just needed a concentrator and must have lost it as I never used a concentrator previously. After reading so many reviews of basically all hair dryers shorting out, burning up, etc., decided to go with the cheapest one lol. The finish is a very matte finish yet people complained that it chips off. Not sure if they changed the finish but it is not shiny. We will see. Having said that, had seen a video that shows finish getting scratched and she determined (and showed) how it was the metal prongs on the plug that scratches it. I will be careful in storing it in a way where the plug isn't rubbing on the dryer. I do hope it doesn't start to flake as that would be so annoying. What I like about dryer:- Lightweight.  I find it very light and easy to hold. I have RA so that is important to me.- All control settings seem to work well. The cool setting is actually cool. Cool shot works well also.  For my thin blonde hair, low and warm will work well, with occasionally medium speed blowing.  Not sure why some said it does not get hot. The hot on mine is hot! Too hot for my hair.What I don't like:- I do think they shortened the cord a little although I didn't measure. It still works for me as my outlet is  counter height.- It is not super noisy and is quieter than my previous one.- My hair is smooth after drying with a natural bristled brush.For me the price of $20 was worth it since reviews of all price ranged dryers seemed to have issues. Overall I do think Conair's quality has decreased a bit, as has everything else. At the same time I've used this brand all of my life so safest bet for me. I will update if any real issues arise.","isVerified":true,"ratingScore":4,"reviewReaction":"77 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Less heat and less air forced through equals quieter","reviewDescription":"I just used this hair dryer for the first time this morning.  The buttons on my old one stopped working so I had to replace it.  I chose this one based on its price.  Bargain priced for sure.  First impressions:1. It has less intense heat than my old one.  I used the highest setting and it didn't feel hot.  Not cold either but you could definitely feel the heat with my old dryer.2. The cord is shorter than my old one.  Not a major problem for me but if you need a long cord, this may not be for you.3. The amount of air forced through for drying didn't seem to be as great as my old one either.That being said, there was NO DIFFERENCE IN DRY TIME BETWEEN old and new dryers.  That was weird.  I thought that with less air, it might take longer, but it didn't.  You should know I have fine hair that dries easily anyway.Furthermore, IT IS MUCH QUIETER than the old one.  This is a BIG DEAL to me.  I had originally searched for the quietest hair dryers out there but they were all quite pricey.  This one is much quieter than expected so I feel like I have a win on my hands here.  I would say the sound is still slightly higher pitched than ideal, but I think I'll disturb the rest of the house less with this one.You will see people comment about the finish and that it will flake off.  Can confirm that it will probably happen.  It happened with my old hair dryer too which had the same matte finish coat.  But I'm the only one who uses it so I don't care too much if the finish eventually flakes.Overall, I would recommend this hair dryer.","isVerified":true,"ratingScore":4,"reviewReaction":"61 people found this helpful","country":"United States","date":1681171200000}
{"reviewTitle":"Buen tamaño","reviewDescription":"Tiene buen tamaño para transportarla y es cómoda de manejar, aunque un poco débil la potencia del aire.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"It’s okay","reviewDescription":"It’s a nice looking hairdryer. I don’t feel like it blows air out powerful enough for my liking but  it works okay.  I’ve purchased several in the last month and I’ve decided to keep this one","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Good dryer but needs a re-design","reviewDescription":"I like this dryer very much - dries well, hot enough and fairly lightweight. My only problem is with the design of the switches - they are rocker switches and are placed on the handle exactly where your thumb goes when holding it. I find myself turning it off or lowering the heat without meaning to. I'm trying to train myself to place my thumb on the heat setting set on high to keep in place. Conair - either change these to sliding switches or move them.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Bonito","reviewDescription":"La compre para un regalo; aunque no es la mejor secadora calienta muy bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Works well for me and my needs","reviewDescription":"I like everything about it, albeit, it's still new to me, so I'm still developing a relationship with it.  It's lightweight, and that's a big plus for me.  I also like the temperature settings as well as the airflow speeds.  Seems we'll get along quite well.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Works Great","reviewDescription":"It works great.  I wish the selection buttons were slides instead of flips because I end up flipping them by mistake while I'm using it.  Also wish the cord was retractable.All in all -- I got exactly what I ordered and I'm satisfied with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Died quick","reviewDescription":"I bought mine in February, today is June 22nd and the motor seized. It did give me a warning a few days ago getting noisier the hotter it got. Today it just said goodbye 😥Beside the rapid departure, the air it blows has no power. I had to use it on high all the time to move air around.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Hair Fryer","reviewDescription":"Velocity too low. Heat too high. Resultant damage, dryness, and frizzy frazzled hair.It would probably be great to reheat a cheesy pizza.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699920000000}
{"reviewTitle":"Poor quality","reviewDescription":"Had this product for 9-10 mosStarted making funny sound a week agoStarted smoking and sparking this AMWent into the trash!LWWL","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Forever to dry","reviewDescription":"This blow dryer is nice looking but my God it takes forever to dry hair. It sounds like it’s on lower than low","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700006400000}
{"reviewTitle":"Died after 5 months","reviewDescription":"Worked great, until now. Died after 5 months. Overheated in normal conditions and flat out died. Had no reason to overheat. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"It was good until","reviewDescription":"The blow dry was great until white remnant from the dryer started getting in my hair and all over my hands. I don't know if the paint is beginning to come off of the handle but I can't use it anymore.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Okay","reviewDescription":"This hair dryer is not very good.  Doesn’t get very hot and takes longer than usual to dry my hair","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Unreliable","reviewDescription":"Broke after 1 month use don't buy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Didn't even last one year.","reviewDescription":"Bought in November 2022. Now I'm looking for a new hair dryer and won't re-purchase this one.  Won't start after light use. It was also a little slippery and easy to accidentally hit the off button while using.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"Wrap dryer","reviewDescription":"Air does not get hot enough or blow hard enough. It takes a long time to blow dry hair. In addition, the condenser does not stay in position so you have  to keep putting it back in place.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695427200000}
