{"reviewTitle":"Always offline","reviewDescription":"Never stays connected and always offline. Unplug and plug back, resetting, even repaired a few times and by the next morning, big surprise, both offline. Less than 10 feet from the wifi and always offline. Returning them asap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"What do I own that is expensive Plug worthy?  I really don't know...","reviewDescription":"Not that it doesn't work or that it does, I have no idea if it works or not.  I got it bundled with the Dot and I keep looking at it and wondering what I should plug into it.  Honestly I have no clue what I should plug into it.  I can see well at night and don't need to plug it into a lamp.  If I plugged it into a TV or computer I would still have to turn those only manually.  I'm not about to become the clapper commercial so I really don't know what all the cost is worthy of the very expensive plug.  I think that is half the problem I paid so much for the plug I'm not thinking that I don't have anything that is plug worthy.  Maybe I'll just put the stupid thing on Craigslist or Ebay.  I don't really see the need for this thing.  The only thing I can think of is a lamp and have the light come on when it gets dark out or when I'm out of town so it looks like someone is home but I don't know.  I have close neighbors who keep tabs on my house so I don't know.  I would plug it in the radio but I have the echo dots that can wake me up with music that I actually want to listen to.  I also have an echo that I can use as an alarm clock even though I have never used an alarm clock.  I know when I need to wake up and  I wake up at the appointed time.  Maybe someone in Amazon land can give me an idea what is expensive plug worthy of the expensive plug.","isVerified":true,"ratingScore":1,"reviewReaction":"48 people found this helpful","country":"United States","date":1572739200000}
{"reviewTitle":"Poor quality","reviewDescription":"Neither of them work for a year. They both dies within 8 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Too expensive, but it works.","reviewDescription":"Works ok, but the price is too high. I recently found alternative wemo for only $2 each.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"I Don't Know Which Sucks Worse...","reviewDescription":"5\/29\/2023: ... Your lights and your plugs both suck at doing their job, along with your app, so it's a really a toss up. On any given day I have at least five or six devices go offline that cannot be restored. I've started buying regular bulbs. I'm tired of the app, the non-integration with Alexa, and wasting my money on pure garbage. BUYERS BEWARE. DO NOT INVEST IN KASA'S SMART DEVICES!! I have been trying to use them since they first came out and all they do is fail. I refuse to give Kasa any more of my money.The only thing as bad are the WYZE cameras, which also fail as regularly as KASA'S. I'm finished with both companies until they get their act together, which I seriously doubt. Hours and hours and hours of my time wasted trying to get them back online. NO MORE. I'm done here.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1685318400000}
{"reviewTitle":"Not as advertised","reviewDescription":"When the power goes out and comes back on, but the internet isn’t working afterwards, these don’t automatically function. Per tp link support they are supposed to only require internet to setup but then should continue to function without internet. They said this “may” be fixed with a firmware update, but they couldn’t provide a definitive answer. They weren’t to work if you have no issue with power or internet.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Wasted my money, time, and patience!","reviewDescription":"This looked like a great idea.. just plug it in, hook up to Alexa, and I'm good to go!WRONG!First, I'm vision-impaired. Using my browsers magnification and Windows Magnifier I can do anything on the laptop.But the gene-damaged incompetents at TP-Link force you to install an app on your smartphone.. which I can barely see to use - and hook up the device, set up an account, and everything from there. I'm still waiting on my account activation email after spending an hour trying to set up an account!Screw this pathetic piece of misbegotten, pathetically-designed and horribly implemented trash heap of a product.And 'compatible with Alexa'? Well, she did her best to help me, so no dings on Amazon for this one.  TP-Link bears every iota of blame for this abortion of a product.I'm blogging about this, and it's going on Facebook.  Nobody should have to deal with all this crap just to use a product.  I had both my Dots working in less than 10 minutes with zero heartburn!And don't bother emailing me, TP-Link.  I'll delete anything you send, you've twasted enough of my precious time as is.  Your entire dev team deserves a punch in their collective noses!","isVerified":true,"ratingScore":1,"reviewReaction":"74 people found this helpful","country":"United States","date":1572912000000}
{"reviewTitle":"Sounds Like a good Idea","reviewDescription":"The construction of this product shows some real thought went into it.  Especially that you ONLY use one plug in and not block the other one.  It really does work.I was excited to see this since I have one lamp I refuse to remember to turn off until I am in bed.  This is an ideal thought.I thought I was buying a Kindle, Alexa, Amazon product and found out you have to load the app for this unit for it to work, no big deal, got my Kindle HD10 v9 all set to go.  NOPE, Nyet, no, ain't gonna work.YOU MUST LOAD THE APP from your cell phone. PERIOD.  Just so you know I DO NOT USE CELL PHONES.  Land lines, faxes, internet, on either my Kindle HD10 or the landline.So, either I go out and purchase a cell phone and service to be able to turn off one lamp or I say to hell with it and turn it off by hand.Amazon was very gracious about refunding the price.Why do all the \"brilliant geniuses\" think everyone uses cell phones.  How much effort would it really take to port from the cell phone app to a Kindle Tablet (HD10 in my case).","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1604534400000}
{"reviewTitle":"Apple HomeKit integration does not work","reviewDescription":"I have another old smart plug from the same vendor that didn't work with HomeKit, so I decided to upgrade my setup and bought these plugs (Tapo P125) that supposed to have the Apple HomeKit support. Although they work perfectly fine with Amazon Alexa and the Tapo app, I was not able to add these plugs to my HomeKit for some reason. I tried to adjust my router WiFi security settings, device reset, adding directly from the Apple HomeKit app as well as the Tapo app, using both my iPhone and my iPad but to no avail.Firmware was updated to the most recent version, both my Apple devices have the most recent iOS version as well. It is really frustrating since the main reason to buy these plugs were the Apple HomeKit support that don't work in fact.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"Requires separate app and online account","reviewDescription":"Just another app collecting way to much data and emails to sell to data brokers then I have to hire a company to remove my data from.Really sick of this corporate greed where I purchase a product and then become a product (my data) for them to sell.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711238400000}
{"reviewTitle":"Seamless","reviewDescription":"Used this product for outlets in the garage.  Connects easily to HomeKit and works smoothly in that system.  Big improvement over other brands I have tried.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Very good 2nd purchase","reviewDescription":"Compatible with Google and easy to set up and use and I can schedule in advance very good quality more than I expected 😊","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Super easy to install","reviewDescription":"Super easy to use, it also works great with window air conditioners,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very Easy to Set Up","reviewDescription":"These plugs were very easy to set up. If you already have HomeKit there is no need to download the manufacturer’s app. Plug the unit in, scan the QR code and you’re off in no time.If you need to put these in a tight location, no problem. Plug in to a more accessible outlet and move it to where you need it after set up. They even come with extra QR labels so you can affix one on a more suitable part of the plug.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"What the doctor ordered.","reviewDescription":"Works well, I can control the switch 1000 miles away from my iPhone, worth the money you spent.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"It does the job perfectly","reviewDescription":"Timer is great, quality looks very well made but most importantly it’s does show you the energy consumption.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Easy to Use Smart Plug","reviewDescription":"This plug connected seamlessly with Apple Home, and works great. I had it up and going in just a few minutes.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Easy setup, easy addition to Apple Home","reviewDescription":"Plug it in, scan the QR code on its side (or scan the extra code supplied in the box), then let Apple Home–on an iPhone–recognize it. Then follow the steps through 'add an automation' to set up an 'on\/off' schedule. That's it. If you need to use the item off its schedule, just ask Siri \"Turn on the (item).\" Simple. You can take control of those 'always on' things–anything that uses a remote, for example–that are silent energy zombies.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Works with HomeKit","reviewDescription":"Excellent value. Took me 3 minutes to set up with HomeKit. Slender design. Recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Óptima solución smart","reviewDescription":"Óptima solución S-Mart con excelente aplicación problema para sincronizar con Apple HomeKit pero con la aplicación de tapo no he tenido ningún problema, respuesta rápida y producto de calidad","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Constant reset required","reviewDescription":"As much as I would like this to work, it only does it for about 3 to 5 days in a row before I have to reset it.  I can’t recommend it based on my experience.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1674864000000}
{"reviewTitle":"Waste of money","reviewDescription":"App would not download.  I was unable to install.  Never got as far as integration with Alexa so not sure how that would work.  I would not buy this product again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1665878400000}
{"reviewTitle":"Failed after one year","reviewDescription":"Never connected to AmazonOnly worked via TP Link app.Only work for one year, then died.I would not recommend buying anything from TP Link ever","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1684540800000}
{"reviewTitle":"Trash","reviewDescription":"This product is garbage, it has a 4.5 star rating which is baffling to me. Anyway it’s not “for humans” as they lead you to believe. It won’t connect with my iPhone, not sure if there was an update involved or not. Just save yourself time and frustration and spend a few more $ and get one made by Amazon and not some third party scammer piece of garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1613779200000}
{"reviewTitle":"Not worth it - never worked","reviewDescription":"Went around and around and finally threw this in the bottom of a drawer. Came up when cleaning just now and see it still doesn’t work.  Save your money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1667779200000}
{"reviewTitle":"Don’t waste your time or money!","reviewDescription":"I’ve had my “smart” plug for 6 months now and have never been able to use it. I’ve tried several times to connect this to my WiFi, & for whatever reason, it will NOT work. I have several echo dots, a smart tv & another smart plug (different brand) that all work together No problems. It’s too late for a return so in the trash it goes!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1596931200000}
{"reviewTitle":"Stopped working pretty quickly","reviewDescription":"I bought this pretty recently and used it for my TV. Worked well for about a week and then my echo told me that the smart plug was not responding anymore. The connection was strong, so it wasn’t that. Today, I decided to try to use it somewhere else in my house, but now the plug isn’t working at all. No blue or orange lights or anything. Just completely dead. Definitely wouldn’t recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1581033600000}
{"reviewTitle":"Actual Garbage, don’t bother","reviewDescription":"absolutely ridiculous. first of all you can’t connect to “public wifi” and they don’t tell you ahead of time, BEFORE you spend your money, that you need a wifi with a password. so if you’re in a dorm or if your apartment building offers free wifi, forget it. and after all that I still had trouble connecting it when i went to my mom’s house with a password on the wifi. waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577750400000}
{"reviewTitle":"Don’t buy, it will not connect","reviewDescription":"It didn’t work for me. It is advertised as easy to set up, not true! It doesn’t work. After downloading an app, having to create a new account and being forced to give my location (why?), it is still not recognized by either their app or Alexa. For the record I have multiple Alexas and devices in two countries, so I am not new to the Alexa ecosystem.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1581811200000}
{"reviewTitle":"12 tries - no connect = returned","reviewDescription":"While not an expert, I have successfully set up a fair number of  alexa \/ wifi controlled  devices  like this smart plug from other manufacturers. This one, no matter how I tried and how many times, it failed to connect with our wi-fi. sent it back and purchased another Amazon smart plug.  I have 4 and have not had a single problem with any of them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1574640000000}
{"reviewTitle":"Great With Homebridge not HomeKit","reviewDescription":"I bought these to replace some older beefy Belkin WeMo outlets that were so bulky they covered up the second outlet. I choose these for their compact size and direct HomeKit compatibility, compared to my old WeMos that were connected via Homebridge. They’re very easy to setup in the Tapo app which discovers the device, added it to the app, updated the firmware and working within minutes. After you add them to the Tapo app, you can select them and add them to your Home app via the QR code. That process was also very straightforward and they were controllable via Siri and my Apple ecosystem as a whole both inside and away from home.Unfortunately they only stay connected for about 16-24 hours after which they disconnect from both HomeKit as well as the Tapo app. Unplugging and plugging them back into the wall got them back up in seconds, but must be done once to twice daily. I’m a network engineer and no amount of reconfiguring my network would keep these online, 16-24 hours is all I would get. So I setup the fourth outlet but this time only added it to Tapo, not HomeKit and that one plug never went offline while the other three were still a problem. So I searched the Homebridge plugins and they indeed have an up to date and maintained Tapo plug-in (homebridge-tp-link-tapo, added as a child bridge). So I reset the other three, added them all back to Tapo, skipping adding them to HomeKit directly, and added them via the plugin, and all four have been solid ever since and work perfectly in HomeKit via Homebridge now. I have a few HomeKit direct devices and none of them have any issues, so I don’t know if this is a flaw in HomeKit or the Tapo implementation but thank goodness for the Homebridge community.My main reason for these plugs are their compact size so I’m ultimately happy.","isVerified":true,"ratingScore":4,"reviewReaction":"20 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Bueno","reviewDescription":"Muy util","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"DIfficult setup on good home wifi, works well now","reviewDescription":"I bought this for a specific purpose - to be able to power cycle our smart TV when it became unresponsive, without needing to get to the outlet behind the TV. Once set-up problems had been resolved, it does this very well through the app. I haven't yet set up Alexa integration, so can't comment on that.  Setup appears simple - plug in, and use the app to guide through the stages, following flashing lights on the unit. Despite following to the letter, it kept stalling at the stage when the app was trying to communicate via the wifi network to the smart plug and (I think) trying to establish direct communication with my phone via its own SSID. It kept getting stuck at that stage, taking me down one of two routes,  the app asking if I could see blue and amber alternate flashing and if so, trying to select its SSID on my phone or otherwise doing a reset. Neither were successful. I sent the first back, suspecting a bad radio after talking to support. Same with the second, and having decided that it was unlikely I received two bad units, I spoke to TP Link support directly. They were very good, considering the low price of this item and got things going after a router and phone reset and a long (30 sec) reset of the smart plug.  However there is nothing odd about my network - a single Linksys WRT series 802.11ac device or phone (Pixel 4). So why was this so difficult? A puzzle given the large number of excellent ratings.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577836800000}
{"reviewTitle":"Very Easy to follow Plug in-structions!","reviewDescription":"I bought this for my mom to use to help her turn on her Bedroom light with Living room Dot. So far it has done everything expected. Alexa always seems to have delays or forget devices still, but in an attempt of the AI in the consumer baby stages. I believe there is much hope and endless possibilities to the future. Unboxing and syncing them both were very easy and understandable instructions and steps. If you remember to keep all IoT devices on the same network Alexa becomes more manageable. However, I notice the more I put into my Automation the more delays in between using devices becomes. ATT is so fragile and empty promises for 2 years now to offer Fibre, so 50 Mbs and my devices are bottlenecked at such an Overrated price. Makes the Future have the appearance that The Big Carrier's can not handle what the future offers at a reasonable price, or that their price gouging of American Citizens for simple things is more of a priority than meeting a 20 Years customers needs. Amazon it seems is stepping up to the plate and I believe may offer internet connectivity at the best price of all of them in the future thus Claiming the Crown in Total internet Subscribers... for the long term.. We will See if I am correct as I will continue to order more automation from Amazon thus far a satisfied consumer. I wouldn't even mind testing their Items as New Egg and other companies offer consumers like me.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1580774400000}
{"reviewTitle":"Clever gadget.......","reviewDescription":"Used to control fans.  A pain to install compared to Alexa.  Trying to forget it, but If I remember right, you need a cellphone to set up a Kasa acct (I'll never need that again, had to borrow the wife's phone just for the install), and then go into Alexa's acct to let her know about the new device (easy and quick).  A few minutes to install?  No, not always.  Took me much, much longer, maybe an hour because I'm  cellphone illiterate.  Once working, Alexa handles the switch with no issues, or it can also be easily turned off\/on on the wall.  A good substitute for a device without builtin remote control.  I love our Alexa, her friends not so much.  Without Alexa I would not have purchased this switch.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1635638400000}
{"reviewTitle":"Fun gadget for the right area","reviewDescription":"I got two of these with Echo dots I bought as gifts. Gifted the dots, kept the plugs as the dot recipient wouldn't have used them anyway. Purchasing with the echo brought the price down to about $5 each which is fair. I think full price is too much. To use these you do have to install the Kasa App which at first I didn't like till I realized I can now operate the lights from my phone and can also create \"groups\" of devices which can be operated all at once from the phone. I used one plug to operate two lamps in one room and the other plug for a lamp in another room. Using the phone or Alexa I can turn them on and off. Using the phone only I grouped them and can turn all off and on at once if needed. I wouldn't bother with fixtures that are readily accessible but these are great for out of the way fixtures or lights in more distant rooms. It's nice to walk in and just say turn on the lights. My girlfriend likes that she does not have to walk into a dark house.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1577836800000}
{"reviewTitle":"I keep buying more","reviewDescription":"They work well. I have them on just about every plugged in light and always use one on the Christmas tree and the outdoor version for lights. It is so much easier to ask alexa to turn on the tree than to crawl under and plug it in. The timer function great for not only turning the lights on an off but also a good way to turn lights off late at night if someone forgets to turn them off. The sunrise and sunset options come in very handy and these have replaced all my mechanical timers.The wifi setup is the only downfall. It isn't too complicated but not straight forward either. I had to set a couple of these up for a coworker who was ready to give up and return them. If you happen to change your wifi password the update process is more difficult than it has to be.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614902400000}
{"reviewTitle":"Learning curve.","reviewDescription":"Learning curveIt took a while to get connected to Alexa, but once I did they are working well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Perfect","reviewDescription":"Easy to install and works perfect","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Updated Rating - Now works.","reviewDescription":"I am updating this rating from the poor rating I gave before. I ended up purchasing a new router and reset my two Kasa smart plugs. They are now working again. I will monitor them for a month or so and if they still work will review my overall rating again.Set up device and it worked fine for a month. Then it stopped working. Called Kasa support and ran their trouble shooting advice many times nothing worked. The lights on the device were not working per the device specs. Finally I was told to contact my internet provider to reset my modem. However, all our other home devices work fine including another TP-Link mini plug. Therefore, I am hesitant to reset my modem. I asked for a replacement as I am still well within the warranty period. Tp-Link refused to honor the warranty. Instead, I will just stop using this device and not purchase other TP-link products. It is my opinion that this is a bad product backed by a poor company.","isVerified":true,"ratingScore":4,"reviewReaction":"29 people found this helpful","country":"United States","date":1583884800000}
{"reviewTitle":"Everything is fine until it isn't - I'm debating whether to get rid of all Kasa devices","reviewDescription":"I have a number of these switches and for the most part they work well. But, I have one out of 5 in use that intermittently disconnects from the network for 15 minutes or more and then magically reappears. This is not a WiFi problem with my home network. The switch is only 20' away. I swapped this switch with another that works ok and no matter where I plug this one in, it intermittently fails. I've followed Kasa's instructions to open an RMA and their website uses another domain\/host for RMAs and guess what? It times out.The timeout is not due to my network either. It happens when my cell phone is on LTE with a strong signal. I'm looking at replacing all my Kasa smart devices for another brand. Middle finger to Kasa TP-Link.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1662508800000}
{"reviewTitle":"Recent firmware and KASA app changes make it impossible to connect plug to Alexa","reviewDescription":"I spent 3 hours trying to get alexa to find this plug AFTER it was set up and functioning with the KASA app. After doing some time searching the internet and the KASA forums i found MANY MANY posts that the new app and\/or firmware do not allow the plug to be placed in anything other than \"local use\" mode. Previous versions could be toggled to remote usage and then it would be discovered by Alexa. That option is NOT in the latest KASA app. This appears to be a new glitch with most posts starting March 2019. There is no fix at this time. (Yes i downloaded the latest firmware\/software).  My greatest frustration is with Amazon listing this as an \"Amazons Choice\" item... but I guess that is just because they must be paid a promotion by the company. I have a number of the Amazon branded smart plugs that all set up easily and continue to work like a charm.","isVerified":true,"ratingScore":1,"reviewReaction":"159 people found this helpful","country":"United States","date":1575072000000}
{"reviewTitle":"What they fail to tell you: Requires INTERNET Connection via Wi-Fi","reviewDescription":"1) I use my phone as a mobile hot spot for my home internet connection. It works great. 2) I use a WiFi router to share content between devices. For example, I watch movies downloaded on my phone on my TV using the WiFi router. That also works great. I do not use my WiFi router as an internet connection router. I understand that the Kasa mini requires a connection to a WiFi router. It says so right in the product details. What it does not tell you is that your WiFi router is required to be connected to the internet or you can't even set the Kasa mini device up. If all I want to do is turn an outlett off and on without getting out of my chair, tell me why on earth should that require an internet connection? This thing should work with the WiFi router to allow me to turn the outlets on and off without needing the router to be connected to the internet.  Conclusion: I bought two of these things and for my situation they are 100% useless.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1625443200000}
{"reviewTitle":"Use once - but do not ever move it to new Wi-Fi network","reviewDescription":"Worked fine.  But when I had to move it to a new wi-fi network it got suck in \"local\" mode.  This switch works with Alexa *only* if \"local\" is turned off.  TP-Link's app used to have a switch to let the user turn off the default local mode, but that switch has been removed from the TP-link app.  That makes the plug useless - it can no longer be controlled via Alexa (although it still responds to TP-link's Kasa app.)This is a widespread problem.Tried all the suggested cures - resetting, moving to another network to clear the flag, etc.  None worked.So this thing, after a year of service, is heading to the electronic recycling bin to be replaced by a non-TP-link smart plug that can work with Alexa even after moving to a new Wi-Fi network SSID.Why TP-link made this change to their app that removes the ability to explicitly turn off \"local\" mode is beyond me.  Otherwise this would be a fine product.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1601251200000}
{"reviewTitle":"Resets connection often","reviewDescription":"I bought two of these items for Christmas and a third for a gift.  On setup, it looked to work fine. Had a little trouble with my main wifi router, but I have a second network setup that seemed to work fine. After a few days the plugs would go off for about half a second then back on. The light on the plug would blink as if they were just plugged in.  The app showed everything offline.I emailed tech support and they asked about the house wiring (all new, just built the house 2 years ago) and if the signal was strong (it was). He said to do a factory reset and try again.  Each email took 2-3 day turn around.No solution was ever found. These plugs are now useless to me.  I bought a 4 pack of a competitors plug (round ones, can't recall name now, app is called Smart Life). I put them on the same network and used the same plug and had no issues.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1582502400000}
{"reviewTitle":"Nope! It doesn’t work with apple homekit","reviewDescription":"I don’t want any third party app when it advertises that it works with apple homekit. I don’t want to download an app, create an account, setup a password to use this. Nope. Sorry. This is useless. It doesn’t work with apple homekit. Accessory not responding or something. Nope. Take it back and fix it and fix the advertisement.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Trash","reviewDescription":"This thing is garbage don't waste your money. won't turn off or turn on anything that I plug it into Has not  worked for a lamp, Xbox, TV, computer, toaster, or any plug I'm my house.  I am very savvy when it comes to technology.  I got to say I can't believe they got me with this trash.  I am not going to even ask for a refund because I bought 4 of these as gifts for  4 different people and none of them work not even the one for me. Tech support says I need 4 newsmart plugs. I just bought ( 4 no joke) and asked if I got the warranty. I'm sure my grandma and mom and aunties that I bought these for are not going to know how to ship it back. I spent enough gas\/time and plenty of embarrassment going to each of there homes to try and get these to work.  thanks for nothing.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1589932800000}
{"reviewTitle":"Updated - Plug it in... connect... and control!","reviewDescription":"12\/27\/20GARBAGE!!!Stopped working. Can't even connect them to app now. Contacted TP-Link 3 times and they couldn't figure it out. I bought 5 of these and they all stopped working at the same time. Look elsewhere. You would think after having them for just a year they would replace them or something since their Technical Support people couldn't even figure out what was wrong with them. They got off the phone with me and sent me an email saying they will look into it and follow up.These were my best working smart plugs until they failed.  My worst experience with other plugs was just having to reset and reconnect to app. At least I was able to do it with the others in less than 5 minutes.Lastly, I purchased 5 in total at different times. We will see if TP-Link ever gets back to me to resolve.1\/15\/20Works as described. Easy install. Easy connectivity. So far so good will buy many more!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1576454400000}
{"reviewTitle":"Too many steps","reviewDescription":"Setting up this smart plug is entirely to difficult you have to download extra apps and link them to Alexa. It's a lengthy and difficult process. Do not recommend it for Alexa platform.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"Run Away!","reviewDescription":"I've got 9 Kasa devices and have the same issue with all of them.  They frequently disconnect from Alexa. I am not having an issue with my other 40+ devices of various brands, just Kasa.  I bought them because they were inexpensive.  You definitely get what you pay for in this case.  They have not released a firmware update in forever which makes them a target for hackers.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Not easy plug and use. Returning","reviewDescription":"Wanted to use for easy on off Christmas tree lights. Total waste not easy to connect with amzon. Peice of crap. Returning for refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638662400000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working after about a week","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1664150400000}
{"reviewTitle":"Worked for one day!","reviewDescription":"Set it up as recommended. Worked for one day! Went to youtube thinking I had done something incorrectly. Repeated my steps as shown on youtube, didn't work. Un plugged it and put it away..won't be buying this product again. USELESS!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Amazon’s Smart Plugs are way better","reviewDescription":"The Kasa Smart Wi-Fi plug failed in less than year. It just died. The Kasa set up is nowhere as easy to set up as Amazon Echo\/Alexa smart plugs. Stick to Amazon’s smart plugs .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1593475200000}
{"reviewTitle":"The price is good, but just doesn't work!","reviewDescription":"I was hoping to like the plug, but it just wouldn't work.  I tried everything.  Looks well made, but all the hoops it put you though to make it work, and still doesnt.  Staying with amazon products!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578355200000}
{"reviewTitle":"Useless","reviewDescription":"Doesnt work with tvs. If what you are plugging this into doesnt turn on immediately after you plug in  this wont work. Only able to use alexa to turn 99% products off. Wont turn anything on except maybe a lamp.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1572998400000}
{"reviewTitle":"Limited Automations","reviewDescription":"This plug was easy to setup but it is limited to 3 automations which makes it unusable for my intentions (AM on\/off Christmas Lights and PM on\/off Christmas Lights). Not ideal.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1607126400000}
{"reviewTitle":"Not easy","reviewDescription":"Could not link to home wifi, despite repeated tries. Ad for item seemed to indicate easy Alexa add on. Not that either.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1638835200000}
{"reviewTitle":"does not work with alexa","reviewDescription":"I tired several times to get this to work with alexa, had someone who is highly technology advanced and could not get it to work with alexa either. HIGHLY not recommended if you want it to work with alexa","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577664000000}
{"reviewTitle":"Trash","reviewDescription":"Doesn’t work what a waste i have other devices synced up to Alexa that works perfectly fine but this never worked at all writing this review was a reminder that i need to just throw it away","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1583798400000}
{"reviewTitle":"COULDNT CONNECT TO HIGHEST SPEED INTERNET","reviewDescription":"Customer service was very good. BUT the product did not work and here we have it going to the ecycling bin. Maybe others can offer better advice.  We tried everything. They did replace but the second one has not been better","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1610668800000}
{"reviewTitle":"Don’t get the bundle not worth the deal","reviewDescription":"It was put in a bundle deal with an echo dot 3rd gen . Unfortunately it hasn’t really worked for much else then an outlet clap on clap off situation . Not very smart and no instructions that are worth a second look .","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1597968000000}
{"reviewTitle":"The WORST. DONT BUY","reviewDescription":"I have tried and tried to connect these plugs to my home network.  I am an experienced home automation homeowner.  I have Connected hundreds of items over the years and these plugs just don’t work.  I have five useless plugs.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1594598400000}
{"reviewTitle":"producto de no muy buena calidad","reviewDescription":"lo instale y en minutos lo volví a quitar ya que cuando no esta en uso permite el traspaso de corriente por el dispositivo y no es lo que esperaba.Cuando no esta en uso me deja los leds encendidos a muy baja densidad","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1593388800000}
{"reviewTitle":"Worst cusstomet svc I have ever experienced","reviewDescription":"Could not connect to Alexa.Never couldtalk to anyone in customer svc.Communicatedwith a computer on their \"live chat\".Fist timeI have EVER had to return a product to AmazonKind of shameful for havingto do so.When I say terrible customer svc.I am refrring to Kasa.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1585785600000}
{"reviewTitle":"Waste of money at any price.","reviewDescription":"Worked for awhile. Now it won't connect to alexa. I tried to update the firmware and it fails, tried resetting and still nothing. Don't water your time.Check out the latest user reviews. They are all bad.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1606694400000}
{"reviewTitle":"Plug cannot work with Amazon FFS at all","reviewDescription":"Alexa Plug's WSS over BLE works well with echo dot, but by using the same echo dot, Kasa Plug cannot setup via FFS ( WSS over Wi-Fi). already link the skill and save the pwd to amazon cloud. still cannot work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1596672000000}
{"reviewTitle":"Good while it lasted!!!","reviewDescription":"While connected it worked great then after each day when I woke up it wasnt connected anymore had to go in the livingroom reset my router... I mean this happened for 4 days straight.... So I returned that bad boy no wonder it was so cheap..🤨","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578009600000}
{"reviewTitle":"Product sucks and support is non-existent at website.","reviewDescription":"This plug wouldn't connect to my home wifi despite multiple attempts.  Contacted the support at website, which seemed to be a robot who gave me same directions as the start-up and the FAQ that I had already followed.  This is going back!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1585267200000}
{"reviewTitle":"Crashes my WIFI network","reviewDescription":"It does not work. My entire network crashes when I connect it to my WIFI. As soon as I unplugged it my network came back up. It is not compatible with WIFI 6 (802.11ax). The box says 802.11b\/g\/n. 802.11n is 2 generations of WIFI ago (2009).","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577404800000}
{"reviewTitle":"Won’t connect to HomeKit on newer routers.","reviewDescription":"Upgraded to a newer mesh router and all Tapo outlets stopped working. Could control them through the Tapo app, but none of them would respond to HomeKit commands. No response from accessory. No amount of resetting or re-adding fixed it. Replaced them with Eve outlets, which worked perfectly.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Goodbye Kasa, Hello Shelly Plug","reviewDescription":"I've purchased 8 of these over the years.  Their build quality and reliability are great.  When they first came out you didn't have to create a Kasa account, but I am tired of fighting TP-Link and their overbearing insistence on- Forcing users to create an account with them. (No more local access.)- Storing data in the cloud.- Closing their previously open API for \"security concerns\" (my understanding is they did back down a little.)- Not providing browser access to the plug (Phone app ONLY.)- They consider other control apps like Home Assistant \"unapproved\".I'm going to ditch all of my TP-Link Kasa plugs for Shelly Plugs (also available on Amazon.)  Shelly plugs- Do not require an account.- Can be controlled locally or from the cloud IF you want to turn that on.- Have a browser based interface as well as a phone app.- Have an open API (for those of us who are geeks.)- Work well with apps like Home Assistant.I think the TP-Link plugs were some of the best out there. Too bad they are forcing their buyers into a closed system.  This just isn't going to work for me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Limit of 3 smart actions is terrible","reviewDescription":"I’m writing a review so others are aware that the Kasa app only allows 3 smart functions for all plugs.  Not 3 per plug, 3 for all.  This is such a flaw I can’t believe they released the product like this.  Completely terrible.  For example - I was using 2 plugs, one for exterior Christmas lights and one for my inside Christmas tree. I wanted 2 actions per plug - turn on at sunset and turn off at sunrise.  Total of 4 actions.  Due to Kasa limitations I could only have 3 smart actions toggled on at the same time.  Completely inadequate.  In this age of the smart home the actions should be unlimited. Luckily I just ran the 4 routines through Alexa as a work around.If not for this my review would be 4 stars. Cannot give 5 bc the product is so bulky. Also bc Amazon sent me one plug that had already been configured elsewhere (I assume it was a return).  I had to run the reset on the Kasa app 4 times before it worked and allowed me to connect the plug to my network (about 15 minutes of wasted time).  I also don’t care for the blue light that stays constant.  What is its purpose?  If I want to sit in a dark room, for example in bed about to go to sleep and am using the plug to power a fan, I don’t want a blue light in my face.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1606867200000}
{"reviewTitle":"Looks good but difficult to get HomeKit working","reviewDescription":"Overall I really like the product especially how small it is and it looks well constructed. However using it with HomeKit was not as smooth as I wish. I got an error that the accessory has been added and I have to remove it first. This wasn't the case for me. I couldn't figure out where the accessory is added.I had iOS 16.2 with upgraded HomeKit architecture. All the firmware has been upgraded to the latest.Eventually I kinda chanced upon the solution. I pressed the button (the one single button) for 10 seconds to hit a factory reset and set up everything again. HomeKit works right away.I hope this helps someone having trouble with HomeKit. Good luck.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"Updating the WiFi & e-mail address is abnormally difficult.","reviewDescription":"As I recall, this was somewhat easy to install, and link to Alexa.  Generally, a good device.However, for various reasons it took me an hour to link the device to another WiFi address as it couldn’t detect my new networks.  Completed after much troubleshooting.Next, I tried to update my Kasa account e-mail address as I had an ISP change.  I was startled to discover that their instructions are to remove all devices from the prior account, and then start a new account!  This is ridiculous!  I should be able to update the e-mail address associated with this account versus going through this process yet again!  I doubt I will ever buy this product again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661385600000}
{"reviewTitle":"If you are buying this to work with Alexa, you should know .....","reviewDescription":"If you are buying this to work with Alexa, you should know That you are going to have to setup a second account with Kasa that then enables you to connect it to Alexa.It also uses an old school method of requiring you to use your cell phone to use WIFI to directly connect to the device during configuration to set it up to talk with your hone WiFi network.I’m an IT guy so while this stuff comes easily to me, the setup failed several times until I restarted the device. The setup process is painfully slow compared to the Alexa devices. You might want to buy the Amazon smart plug instead. This purchase was a promo one or I would likely have purchased the Alexa plug to avoid multiple online accounts.","isVerified":true,"ratingScore":3,"reviewReaction":"91 people found this helpful","country":"United States","date":1576368000000}
{"reviewTitle":"Product okay. App stinks.","reviewDescription":"This product works fine.  Be aware, though that you will need to set up an app to run the devices and, after putting a dozen devices on this system, I needed to change my email address.  THIS CANNOT BE DONE. Kasa said to delete my account, make a new account, and install the devices on the new one.  Who has 100 hours to do that?  UGH!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1652832000000}
{"reviewTitle":"Requires online account with full data access","reviewDescription":"The plug does what it does.The reason for the low rating it the app you are required to download and install.In order to get anything to work, even with alexa, you HAVE to create an online account with the Kava app and the EULA says they can basically sell all your data.There is no reason at all for the online account once you have it connected to alexa.After you set it up and connect it to Alexa you can delete the app or sandbox it on the phone so it can't do any more damage to your privacy.For some reason it requires location access to get to the WiFi.BE WARE: If you have a firewall app installed, be sure to turn it off while you configure the plug.  it needs to switch wifi networks to get to the plug.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1578441600000}
{"reviewTitle":"Working, but with a big privacy caveat","reviewDescription":"The device is working, is fairly easy to setup, and the app is decent.However, I need to emphasize that the whole Kasa app\/cloud comes with a big privacy caveat.First of all, the app needs your location data in order for it to setup a new device, ie. a new smart plug. You can’t get pass it, though it allows you to disable location access after setup. This is completely unnecessary.Second, it stores your WiFi password in the app and possibly online. This does make setting up easier, but again, unnecessary.Third, there’s no way for you to tell TPLink to delete these kinds of sensitive data without also deleting your account.So, be aware of these before you make the purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1606608000000}
{"reviewTitle":"Version 3 does not work, but Version 1 works","reviewDescription":"5 stars for Version 1 (Made in China) and 1 star for Version 3 (Made in Vietnam).I have been using these smart plugs for over a year, and recently bought more. But the new ones cannot connect to my home WiFi. It actually interferes with my modem\/router, and my home WiFi disappears on all my other devices.After several calls and emails with the Kasa tech support, it turns out that Version 3 (Made in Vietnam) is not comparable with my Netgear modem\/router, but Version 1 (Made in China) works perfectly fine.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1603411200000}
{"reviewTitle":"Great Convenience!","reviewDescription":"Though I use the Kasa smart bulbs in most areas of my home, I bought this plug to use for string lights (no on\/off switch) that are on top of my upper cabinets in the kitchen.  The plug for the lights is in a cabinet above the microwave, and was a pain to turn them on and off.  Installed the smart plug on that outlet and now only have to ask Alexa to turn them on and off, and no longer have to get the step stool out and move things around to access the outlet in the back of the cabinet to plug them in\/out.  \"Smart anything\" is a great convenience in our homes, but in hard to reach areas these make so much sense.  And set up is a breeze!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1602979200000}
{"reviewTitle":"Ease of use","reviewDescription":"I've used a lot of variations on Smart Plugs over the years. Some of them you have to set up to your Wi-Fi. Some you have to scan. But, these? These are the first plug and play devices I've tried. Now, it probably helps that I already had an older KASA device in my home (a plug that was not as easy to set up), but what that does mean is I already had the App installed on my phone. But, as soon as I plugged one of these new plugs into the wall, Kasa already had it set up and Alexa instantly knew what it was. I'm not a big review writer...but this plug and play ease of use inspired me to sit here at my computer and type this up. Well done.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1607126400000}
{"reviewTitle":"Easy DIY","reviewDescription":"I purchased 3 of these and I like that it's easy install and integration. 1 of the 3 wasn't working but I figured this out because the others worked (so perhaps by at least an extra one and take advantage of amazon 30 day return). Though it's mini, May not be as mini depending on where you need to place it. It hampers the blinds that's close to the socket from closing properly (blinds are about 1.5\/2 inches in front of socket). I have not integrated with Alexa.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"Good smart plugs","reviewDescription":"I use these smart plugs to control lamps around my house.  They work very well both automatically by schedule or manually.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Easy set up","reviewDescription":"Easy to use. After downloading the Kasa app and setting up the plug on my wifi, it set itself up on Alexa.Plugged my bedroom lamp in and now I can turn it on\/off from the phone app or via voice w\/my Alexa dot.Honestly only purchased because Amazon offered this device for 99cents. Really good value. Unsure if I'd spend the almost $20 listed as normal price for 1 smart plug. I only have Alexa devices in my bedroom. Personally I don't find it that difficult to manually turn the lamp on and off. This was honestly the only item in my room that I can use the plug with. Biggest benefit is I don't have to get out of bed at night to turn off the light.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1604275200000}
{"reviewTitle":"They have worked flawlessly for over a year.","reviewDescription":"Ive used these switches all over my home for the lights I have the plug directly into the wall.  Being able to tell Alexa to turn those lights on is lovely, especially when you are lazy after a hard day haha.  I have used these switches around my home for over a year now, and have not had a problem with any of them.  They are easy to setup, and simply forget about.  Which I absolutely love.  The Kasa app allows you to control what ever is connected to this switch from anywhere you have an internet connection.  The app is intuitive and simple.  Personally I think these are the best Alexa outlets on the market.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1611964800000}
{"reviewTitle":"Worked like it was supposed to.","reviewDescription":"I have a few devices that are Alexa controlled. These work as expected.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"Well that was easy.  .  .  .","reviewDescription":"So I needed a new smart plug (because my TECKIN quit working after 6 months) I looked at a few videos and decided on this one.  I plugged it in and was working through the app when my Alexa Show 5 said it found a new device.  I stopped working on the new software and opened the Alexa app.  Sure enough there it was.  I renamed it and tested it's functions.  It worked with no problems.  Sooooo so far I'm happy it works with the group settings and by itself, so it's doing exactly what I wanted.  If it messes up I'll do an update to this, but so far it's the easiest plug I've used yet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1607212800000}
{"reviewTitle":"Don't mess with in-wall wired smart outlets and just get this","reviewDescription":"I have the KASA TP-100 in-wall, wired smart outlets which work great. But these work just as well, are cheaper and can be moved without having to unwire and rewire an actual outlet. I thought I wouldn't like how it isn't part of the outlet and you can tell 2 things are plugged in.. But I was wrong.. I would have bought 10 of these and not any smart wired outlets if I could do it over again.I use this with our 2nd Christmas tree that sits upstairs in front of a window. We never go upstairs so this was so easy to just plug it in and set a schedule to turn the Christmas tree lights on and off at night.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1608422400000}
{"reviewTitle":"I LOVE it!","reviewDescription":"Easy to install, versatile programmibg. I purchased 3 and glad I did! As a person with low vision,, I don't have to stumble into a room and fumble for lights! I can turn them on - and off - as I desire, right from the app! Also, when I arrived home after my old-time timers were already off, I was entering in the dark. Not so with Kasa; I can turn on inside lights while I'm still in my car!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1643932800000}
{"reviewTitle":"For reptile owners: it’s worth it!","reviewDescription":"So I actually use these for my gecko’s tank, and they work fabulously! Once you get the settings on the app for them adjusted for when you want certain gadgets turned on and off they’re fantastic! I love that I can have the lights in sink with when the sun rises and sets, keeps him in sync with a decent sleep schedule ♥️It’s not hard to figure out how it works, in fact the instructions are pretty straightforward and the app that they’re attached to is fairly easy to navigate.As for how well it works with Alexa, I don’t know. I don’t own an Alexa, yes I still live in the dark ages, so sad.But past that, for the price you pay for them,  these are overall some very handy little gadgets to have as a reptile owner!You never have to worry about lamps being left on or off for too long if you’re not home. Just set the sockets to be in sync with when the sun rises and sets, and you’re solid! 🤘🏻","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"Stupid simple and work extremely well.","reviewDescription":"Nothing ground breaking, but integrate seamlessly into HomeKit.  Super easy to setup.  Very inexpensive.  I don’t need anymore, but I want more of these little cubes!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"Imaginativo","reviewDescription":"Es muy fácil de instalar y de programar y practico para manipular","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714176000000}
{"reviewTitle":"Best smart plug out there.","reviewDescription":"Replaced all my old vont smart plugs with these tapo plugs. The new plugs are extremely easy to program,and the app is easy to use. These are as close as you're going to get to a Plug and Play application . Don't hesitate in buying this product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Really good! Big step up from Kasa.","reviewDescription":"I remember buying Kasa products, and they were pretty good. I wish they had HomeKit support, but then I heard TP-Link released a new line of products called Tapo. I heard it had HomeKit support for most products, and as a person with tons of TP-Link products, I decided to give it a go. It works seamlessly with HomeKit, Alexa, Google Assistant, and the Tapo app. It’s very responsive in HomeKit, and I’m very pleased with my decision. Not only do these smart plugs work a whole lot better than Kasa, it’s also smaller, and is in a lot nicer form factor. I believe that Tapo is great, and if you’re looking for a new smart home devices, Tapo is great. Especially these smart plugs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Blows away WEMO...","reviewDescription":"After growing frustrated with how pathetically bad WEMO is, I opted for this less expensive option. And I'm so glad I did. The WEMO devices, of which I have 3, were a headache to get installed (and this coming from a tech guy who is the one everyone calls for help setting things up...yes, WEMO is THAT bad, that even if you know what you're doing, it still involves a bit of luck to get it set up properly). The Kasa mini plug (and the same goes for the RGB bulb by Kasa I also bought) was a BREEZE to set up. Seriously, if all tech were this easy to set up, my family and friends would leave me alone with all the \"can you come help me set this up\" calls I'm routinely bombarded with.Within 5 minutes, I had set up the app and installed and used both the mini plug AND the smart bulb AND had already integrated them with Google Home (can't speak to the Alexa setup since I don't own one). It's THAT easy. Super impressed. If the durability on these devices is good (I'll update if I ever have any failures or other issues) then seriously, Kasa are the smart devices everyone should be flocking to.All-in-all...color me impressed. Will DEFINITELY be adding more Kasa devices in the coming weeks and months. Thanks TP-Link for an amazing set of devices. :)","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1607040000000}
{"reviewTitle":"A+","reviewDescription":"If you’re new or old to smart devices this is ABSOLUTELY worth the purchase. This isn't an Alexa household but it works well with Siri and Home app, without a hub.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Life changing","reviewDescription":"I’m a big fan of timers but we had the old school ones. These are amazing! Makes setting up automatic lights on and off super easy from your phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"KASA mini-smart plug, works with Google Assistant and Routines.","reviewDescription":"I got several of these to use with non-smart lights around the house, including two strings of Christmas lights and an overhead lamp.  The plugs are easy to set up in the Kasa software and to import into the Google Home app for use with Google Assistant.  the plugs also have a manual on-off switch on the side of the plug for when you don't want to use voice control.  I've had a couple of these for two years and use them on a daily basis.  The only thing that could be better is that they are wide and if your plugging into a power strip they may cover up other outlets (depending on the orientation of the outlets on the power strip), but that's easy enough to work around.  T-P Link is a decent brand and the price is right on these -- since every brand of device will likely require its own app to set up and manage them, picking one brand and sticking with it is a good idea.  Once you have it set up in Google Assitant or Alexa, you probably will only need to use the Kasa app if you want to re-set the device, just fyi.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1613001600000}
{"reviewTitle":"Kasa plugs are the best","reviewDescription":"I have had several different smart plugs and Kasa are by far the absolute best.I don't understand why people are saying it doesn't work with Alexa, my Show picks it up as soon as I get it on the wifi when first setting it up and adds it in. Google got it easily too, I just relink Kasa and it's good to go.I have a Wemo that's just about useless (it wouldn't update last year and I gave up trying) and a Samsung plug that is so sad with no features...But the Kasa never fails. Stays connected to the wifi and connects back quickly if the power goes out, I can tell it to turn off or on at sunrise\/sunset, the timers actually work, it always does it's firmware updates, and works after the updates. Kasa has never given me a problem.It's big, yeah, but one plug doesn't take up the whole outlet (they're smart plug\/wifi extender I got a few years ago does... Which I hate). I really have had the best experiences with Kasa (we got a smart bulb too, so my son could change the color of his bedroom light, I'm going to replace another company's smart bulbs with Kasa bulbs)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1607904000000}
{"reviewTitle":"It is an OK device.","reviewDescription":"While it works, I did like that it needed its own app on my phone to set up.  I would rather have it work as smoothly and easily as the Amazon plug.  I know it costs less, but I'm not sure the savings are worth the cost difference between the two.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580515200000}
{"reviewTitle":"Works great. Only one slight hickup","reviewDescription":"Love it. Works like 99% well. Very rarely i gotta unplug it and replyg it in to reset it due to it not being responcive to alexa. Its so rare tho its not exactly a deal breaker. I wouldnt trade it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613952000000}
{"reviewTitle":"Pretty good","reviewDescription":"Easy to set up, although I had to try multiple times to get it to detect and connect to my network. Unfortunate that there is no HomeKit integration. I use the widget to toggle it off and on.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607299200000}
{"reviewTitle":"Kind of hard to set up","reviewDescription":"It's dropped wifi and too much trouble to set back up","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633824000000}
{"reviewTitle":"Easy set up","reviewDescription":"This is the second i have from this brand. They are easy to set up with their app and alexa is able to find the plug with no issues","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1613520000000}
{"reviewTitle":"Works","reviewDescription":"Works as represented. Easy to set up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633046400000}
{"reviewTitle":"Satisfied","reviewDescription":"The product works fine but their tech support was useless and frustrating.  I had to call Alexa support to get it installed which was easy once it was explained.  I will purchase more for other rooms in my home.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580083200000}
{"reviewTitle":"Perfect smart item","reviewDescription":"If you want an easy smart item to set up and use, I highly recommend it. However, do not buy if you need it in a tight space.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607904000000}
{"reviewTitle":"Plugin","reviewDescription":"It was easy to setup. The plug is small so it doesn’t interfere with the outlet above it. I have a lamp plugged into it. It goes off and comes on exactly as I have it set.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578787200000}
{"reviewTitle":"Really like this product!  Will be buying more.","reviewDescription":"I really like the Kasa Smart plug mini is great to have , It works great ! Except for at times the WiFi signal is weak but other then that I am glad I bought it !!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Unable to get my internet connected to this plug.","reviewDescription":"I don't think my issue was the actual product I think it had to do with our internet carrier....","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Alexa will not work it","reviewDescription":"Won't work with Alexa. So not as convenient as it could be.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1601251200000}
{"reviewTitle":"Helpful","reviewDescription":"Yes","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623024000000}
{"reviewTitle":"Connection","reviewDescription":"My daughter said the only thing she don’t like is it want connect to her roku","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"There are no instructions","reviewDescription":"Still not sure how to use it. More instructions would be nice","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1587081600000}
{"reviewTitle":"Ease of use for a non techie. The JUST FOLLOW THE INSERT DIRECTIONS WERE LAUGHABLE.","reviewDescription":"I could o ly get one of the smart plu to pair with Alexa.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576627200000}
{"reviewTitle":"little difficult to install on the app","reviewDescription":"work fine at first but had to reinstall couple times with alexa","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1583107200000}
{"reviewTitle":"Doesn’t work","reviewDescription":"It won’t connect to the WiFi so it doesn’t work at all.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1581465600000}
{"reviewTitle":"Big smart plug","reviewDescription":"Hard to connect to wifi but works ok once you do","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584144000000}
{"reviewTitle":"Not worth it","reviewDescription":"Way too much work to get this to work with Alexa.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1580515200000}
{"reviewTitle":"Kasa plugs no longer work with Alexa app","reviewDescription":"multiple kasa plugs worked fine for two years, and now do not connect to the Alexa app.  all firmware is updated but alexa app only recognizes 1 out of 4 plugs.  not sure if this is a kasa problem, or an Alexa problem, but these are now worthless plugs.  I've also had problems recently where Alexa \/ Amazon are having more problems with third party \"skills\". is Amazon making it more difficult for third party products to integrate?  they seem to make it difficult for music apps to integrate well - most likely due to being competitive with Amazon music.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1592611200000}
{"reviewTitle":"TP link should boldly state they are NOT weatherproof","reviewDescription":"I have 2 dead Smart-miniplugs...both died when used outside, and there is no recovery for them.  They did work briefly for powering my pool pump and spotlight, but then they failed.  I now have to spend $40+ for an all-season outdoorversion (at least it controls the two of them).  The consumer needs this info because they are following this pattern and wasting the indoor one on outdoor use and then having them fail. My winter climate is wet with near-freezing temps.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579046400000}
{"reviewTitle":"Bulky","reviewDescription":"I enjoy this alot, works well with alexa, couldnt get google to work with it but alexa does so its fine. I do not enjoy how big and bulky it is tho.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615075200000}
{"reviewTitle":"Mh","reviewDescription":"It was hard to set up and sometimes unresponsive. Amazon’s smart plugs are so much better.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Wifi","reviewDescription":"This product was helpful for what I needed it for","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615766400000}
{"reviewTitle":"No era lo esperado","reviewDescription":"Nunca se sincronizó","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Good product but difficult smart options","reviewDescription":"Difficult smart function need to improve lot.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614124800000}
{"reviewTitle":"Needs smaller","reviewDescription":"Needs to be a little bit smaller I have it on a six-prong but then to my wall and I can only use three of them due to the size of this.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"Great for gift giving","reviewDescription":"A Xmas present","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612051200000}
{"reviewTitle":"Not my thing","reviewDescription":"Haven’t found useful yet. Thought it may be too high tech","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1608422400000}
{"reviewTitle":"Not As Good As The Amazon Brand","reviewDescription":"This plug is not the quality of the one that Amazon normally pairs with Alexa. I'm disappointed in this brand. It's more tricky to pair and work with.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"Installation is frustrating with provided instructions","reviewDescription":"Everything worked until I upgraded my phone and since I am having difficulty synchronizing the switch’s to Alexa","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1609977600000}
{"reviewTitle":"Great product though unable to use it","reviewDescription":"I thought it can be use on 220v since some reviewers said it can be plugged on a 220v but its actually up to 120v only.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Great for someone savy","reviewDescription":"I am not gifted with technology so I had to get help using the plug in","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610236800000}
{"reviewTitle":"Not an Amazon product.","reviewDescription":"Thought it would integrate with Alexa and other Amazon smart products. Does not. Actually thought I was buying an Amazon product. Be careful.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579824000000}
{"reviewTitle":"Great at first","reviewDescription":"Worked for a couple months and then stopped.  It still acts like it is turning on, but doesn't power up.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1586131200000}
{"reviewTitle":"Disappointed","reviewDescription":"It won’t work with fans. I won’t turn the fan on but it will turn the fan off.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1595030400000}
{"reviewTitle":"Ugh","reviewDescription":"doesn't start connected to my wifi. Worked great for a week. Haven't used it since.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1599436800000}
{"reviewTitle":"Scheduled on\/off seems broken in Kasa app","reviewDescription":"Turning on at sundown and off at sunrise does not work.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1611619200000}
{"reviewTitle":"Not as promised","reviewDescription":"Really hard time getting integration due to wicked weak signal, even though only 12 feet from Alexa and router","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579305600000}
{"reviewTitle":"Works well, good price, but...","reviewDescription":"So we got this to work with our Alexa. For the most part it is great. The setup wasn't crazy easy, but it was simple enough. What I don't like is that I have to have a completely separate app on my phone to set it up before it will connect with Alexa. Also, when we changed our wi-fi password, it was easier to delete the whole device and set it up again than to change the current one. That wouldn't be a big deal except we had that device in a couple Alexa routines, so those had to be re-done. Overall, for everyday use, it's great. Just a couple minor inconveniences.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1616112000000}
{"reviewTitle":"Works with Smartthings, but you need the Kasa Smart app first","reviewDescription":"I looked for reviews that said whether or not this integrates with Smartthings before purchasing, but didn’t find any, so I’m writing one. The Smartthings website seemed to say that it would integrate without issue. I just got it yesterday and went to connect to Smartthings. It does work, BUT you must install the Kasa Smart app first and you need to connect the device through that app in order to get Smartthings to recognize it. The Kasa app was relatively straightforward and I was able to get it hooked up pretty quickly. It’s not the end of the world. It works. I got it set up with a timer, etc, but I wish you could add it straight through Smartthings.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1607644800000}
{"reviewTitle":"The product is decent and does the job","reviewDescription":"The product works but is probably a little bigger than it really needs to be and makes a rather audible click when changing from on to off. Greatest complaint is probably the software which for most will probably be a set and forget if your connecting it to a hub. The software looks nice but experiences tons of extremely frustrating bugs. I have 3 and 1 set up perfectly with no issues took like 30 seconds the next two though... they each took 5 to 10 minutes of just closing the app and running through the entire process again until it just magically worked.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609632000000}
{"reviewTitle":"Difficult to set up - but great when it is!","reviewDescription":"Could never have set it up myself - I am not techy.  My daughter set it up and it took her quite awhile.  I suggest the manufacturers make installation quite a bit easier if they expect to sell more of these in the future.  I’d bought a second one but my daughtet is in no rush to open the box!!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1632009600000}
{"reviewTitle":"I have this in my Kasa and works really well","reviewDescription":"ME KASA or your KASA these bad boys work really well with my lamps and electronic air freshers to turn them off at certain times well done. connected to my wifi and Alexa  integration was a snap.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"Works after difficulty setting it up","reviewDescription":"It took forever for the app to work for me.  Once I finally got it to work,though, I love how I can turn on & off lights from my bed & schedule it to randomly turn on lights when I'm out of town.  I bought another so I can also have a radio playing when I'm gone but am still trying to get this one set up!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1614729600000}
{"reviewTitle":"Talking to your appliances is weird","reviewDescription":"i kinda have a love\/hate relationship with these plugs. \" Most \" the time they work however its always when I'm in bed and I ask Alexa to turn something off that they malfunction. Getting outta bed to reset them completely defeats the purpose. Would I buy them again ? Yes. Would I pay more for superior ones ? Yes.  they still are nicer than NOT having them just wish they were more consistent in their functioning.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1595980800000}
{"reviewTitle":"Great product.  Ok Alexa integration","reviewDescription":"Sets up easily and works great when working directly with it.The Alexa integration is USUALLY great. But if it’s in an Alexa Group that has a dimmer, it’ll sometimes turn on when you tell it to or sometimes require you to tell it to set the group to 100. It might be this device or it might be Alexa. I haven’t figured that out yet.Still a great product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607731200000}
{"reviewTitle":"They are good","reviewDescription":"They work good but you have to set everything for them in the Kasa app not the Alexa app","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1661904000000}
{"reviewTitle":"It works","reviewDescription":"We've set it up as then intermediary connection for the hot water pump that sends the hot water to the far reaches of our house (MBR). It's been a Godsend for that purpose. On a couple of occasions we've had wifi connectivity issues, but that's been rare.  I haven't used the timer function, but I may buy a couple more of these to use for lamps, etc. for when we travel. Good product though so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1592784000000}
{"reviewTitle":"it can be peace of cake, or goin no where set up","reviewDescription":"it works with alexa,  but you have to download Kasa to set it up. I personally think the kasa set up has a flaw.  I have the Note 20 and I can't set up with that. Every time I tried to connect the WIFI to my network, the app would find and connected to my phone,  then my would lost internet and the connection to Kasa is lost. render the purpose of connect to network WIFI.  going no where. spent hrs of time to ried over and over. Call  CS, they just ask me to move to different place. which doesn't make sense, because I'm right next to the Router.  They sent me another one to replace, and it does the same thing. I'm exhausted, finally I tried with older phone and yes! it find my WIFI connected to WIFI conneted to Kasa, but has connection error. even though it finished the set already the apps still trying to connect to my WIFI.  At this stage I just exit the set up and the device will be in Kasa app, and Alexa automatic detect if you have Kasa app link to Echo.  I will not buy again. its a nightmare to set up.I'm not sure if Kasa app will update this issues.  I worried down the road that the old phone no longer available and I have to change WIFI station  I would not be able to use it again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1608163200000}
{"reviewTitle":"Ok purchase but not what I am looking for","reviewDescription":"It is not compatible with the apps I already used. I will be returning it. Not trying to download on more app. I bought a different brand, cheaper and compatible w the app already issuing for another device. Not only that but the other smart plugs fit well in the socket. I can fit up to two at the same time.You can only set up one of these smart plus in the socket at home.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577750400000}
{"reviewTitle":"OK but no homekit","reviewDescription":"These are ok. They don't want to connect, and are hard to get going. Once connected, I have had zero problems. The worst part is they promised homekit support then said, oh, naw, we have a new roadmap, one that doesn't include a major player in smart homes. So no more of these for me.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1607126400000}
{"reviewTitle":"Too big for just one outlet","reviewDescription":"This smart plug works perfectly. The low rating is because I didn't realize how big it is. For the size of the block you'd think there would be at least 2 plugs. If it was like a half inch wider I'd say 3 plugs","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"Works okay","reviewDescription":"It often disconnects from the Alexa app and I have to reset it. Otherwise works okay. Does not work with Smart Life App, which is unfortunate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Works amazon plugs are easier to set up","reviewDescription":"This product works but the amazon plugs are easier to set up .","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579996800000}
{"reviewTitle":"It works well","reviewDescription":"It works well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576540800000}
{"reviewTitle":"Worth 99 cents i paid","reviewDescription":"Nice plug, can't get it to sync with alexa. Works with app on phone.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610236800000}
{"reviewTitle":"Works okay","reviewDescription":"Works okay.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607817600000}
{"reviewTitle":"Al principio bien, ahora a cada rato se desconfigura y no sirve","reviewDescription":"Sirvió por una semana y ahora se desconfigura una vez cada dos días, por lo que se vuelve prácticamente inútil","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1639526400000}
{"reviewTitle":"Not user friendly","reviewDescription":"I was unable  to setup after 7 attempts. I give up. I waited too long to setup and can’t return. Anyone want them?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1647734400000}
{"reviewTitle":"Can't connect to an open network","reviewDescription":"Unfortunately, I found out a too late that this smart plug cannot connect to an open network. Also, I have an open network so it's useless for me. YMMV.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1634428800000}
{"reviewTitle":"Smart plug brand matters....","reviewDescription":"This Kasa smart plug is not a mini. Also the plug makes you download an app to use it alongside the dot (unnecessary).Whereas the \"Amazon smart plug\" was integrated to be used with the Amazon echo. Much simpler no hastle to set up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1575763200000}
{"reviewTitle":"Does not work with Alexa app!","reviewDescription":"Does not connect to Alexa app.  Worthless.  Sending back!  Most frustrating part is I purchased as a package with a new echo device. How ridiculous that they would sell this without integration with the Alexa app.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1595721600000}
{"reviewTitle":"Failed to connect to home wifi network.","reviewDescription":"Did not connect to home wifi network. No trouble connecting other Alexa home products, i.e., Echo Show and Dot, but kept smart plug kept displaying failed - try again later. The process to install is not complicated, but I would recommend going with another brand.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1574553600000}
{"reviewTitle":"Grinding my teeth.","reviewDescription":"Nothing but frustration. Alexa discovered two of mine initially. Then not so much. Initially linked directly thru Alexa. Later not even Kasa app could discover. Spent hours. Want to just chuck these.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1616457600000}
{"reviewTitle":"Pain to install","reviewDescription":"Dont like the fact you must have a password & an additional app to operate it, alexa app should be the only app to use it but its not & who wants even more passwords just to turn a light on & off","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"After 2 great years won’t turn on","reviewDescription":"I loved this. It was amazing and now after 2 years I tried to update the firewall and it won’t turn back on. Super sad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1642464000000}
{"reviewTitle":"It burnt lol","reviewDescription":"I got like 3 of these and 2 burnt and had to get it replaced. The last one I just couldn’t connect it via Bluetooth 😮","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1638576000000}
{"reviewTitle":"So frustrating!!","reviewDescription":"We had nothing but trouble with this plug. Every time the power went out we had to reset it. Now it won’t connect at all.  It’s now in the trash.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1616630400000}
{"reviewTitle":"Good Product","reviewDescription":"Took a minute to set up but works like a charm","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578009600000}
{"reviewTitle":"Works good","reviewDescription":"Had an issue at first setup but now works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"App needed","reviewDescription":"Works great, but you have to have the Kasa app.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"connection is unstable","reviewDescription":"Falls out of connection with Alexa every 3 uses.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1582588800000}
{"reviewTitle":"Great product","reviewDescription":"Nothing to dislike, Turns on and off my lamps","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578787200000}
{"reviewTitle":"I like it","reviewDescription":"I like this product is very easy to use.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578441600000}
{"reviewTitle":"Does as advertised.","reviewDescription":"Does as advertised.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1599436800000}
{"reviewTitle":"Good.","reviewDescription":"Good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1597795200000}
{"reviewTitle":"It works","reviewDescription":"Does what is says it does","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1583712000000}
{"reviewTitle":"Good product","reviewDescription":"It is a good product for lights","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578096000000}
{"reviewTitle":"Pretty easy and reliable","reviewDescription":"I have quite few Kasa devices around the house as well as some other brands. I like Kasa because they seem to be reliable. I don't seem to have the connection issues I've had with other brands. I like that I can just give it a name and then tell Alexa to control it by name. It makes it easy to set things up for my wife in a way that she will remember and actually use and lets her replace all the old style rotary timers she was always asking me to tweak. Plus we have enough of them around the house these days that it's easy to make the house look occupied when we are away.I like this particular model as it's smaller than some of the earlier Kasa outlets I have but other than that thery all work pretty much that same and that's been pretty good for me so I'll probably be back if and when I need more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1612828800000}
{"reviewTitle":"Works good","reviewDescription":"Very helpful with the Alexa app","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705449600000}
{"reviewTitle":"EASY, WORKS","reviewDescription":"Easy to set up, easy to install, easy to integrate with apple HomeKit, and al intuitive to understand and feel confident as you perform all the actions mentioned above.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"No Hassle install Works with SmartThings","reviewDescription":"No Hassle install is simple to install on the Phone app similar to WeMo.  Longtime TP-Link user of multiple routers and switches in my home.  Decided to Jump from WeMo's newer Plug being it does not work with SmartThings.  Ordering Kasa Dimmer switches today since WeMo has the same issue now.  (my older WeMo gen plugs work).  I use Samsung Smart Things to manage all my Automation of turning on and off vs having to manage all of the different device apps.  If it is not supported on SmartThings, it goes back.  And WeMo seems to be stuck in the Mud and all of their newer Gen devices are not supported.  I returned the Plugs.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"It is the best!","reviewDescription":"It is easy to install and works just great! I can control everything with my phone now!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Great Automation Plug!","reviewDescription":"Excellent product, it does what its supposed to do, hope it'll last long, im using it for my iPhone to longer its battery life. Automatically turns off when it reaches the set charge limit. A great quality product.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1689984000000}
{"reviewTitle":"The best smart plugs you can get imo.","reviewDescription":"These are my fav smart plugs. They have always worked and have never given me a single issue. Can use it for a fan or can use it for a lamp and go into the Alexa app and change the \"type\" setting from a plug to a light, which will allow you to control the plug as a light in your Alexa-enabled group-\"Alexa, turn on the lights.\"Highly recommend these plugs from TP-Link.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"Best smart plug we've tried!","reviewDescription":"So far this is the absolute best smart plug that we've used!  The setup is insanely easy and it works perfectly with Google Home.  I cannot attest to Alexa integration because we don't have her in our home.  But I highly recommend these plugs.  In fact, not only do I use only these Kasa smart plugs but I also use Kasa smart lightbulbs.  They too are the best I've used and I have tried several manufacturers!  I know I sound like a walking billboard but that's because I really love Kasa's products.  I did not get paid in any way to say these things - their products are just that good!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"great product - easily control when away","reviewDescription":"bought this 3 weeks ago. Went on 2 weeks vacation and was able to remotely control lighting on\/off in my house. Love it! easy to install and operate. Much better than those mechanical light timers from the old days...lol","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Best smart plug I've used yet","reviewDescription":"The Kasa smart plugs have all been very reliable and easy to set up. I bought them after throwing out(returning but seriously wanted to just chuck them) multiple Wemo minis. Not sure if it's the particular mesh router I use(eero) but I just could not get the Wemos to work. Not with the Kasa smart plug. It easily set up on first try, and was rock solid throughout. I use them for my bedside lamp and set a schedule to have them turn on around bed time so I never go up to a dark room. They also worked like a champ for indoor christmas lights and random lighting when I'm out of town. I haven't gone all out with smart home products, but if you just want a couple here or there for lighting, this is such a great product, no fuss and rock solid reliable.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1582675200000}
{"reviewTitle":"Recomendado únicamente para equipos de bajo consumo","reviewDescription":"[ACTUALIZACIÓN]La descripción del equipo dice que soporta 1800w, un tiempo lo usé con un equipo de 1500w y debo decir que no fue buena idea, genera tanto calor en su interior que la clavija que estaba dentro del enchufe es imposible tocarla, y lo sé porque me rozó la mano y me quedó ardiendo por horas. En las fotos podrán ver las grietas que tiene el plástico del conector y el color amarillo de la clavija que estaba conectada. (Lástima que no tenía el termómetro a la mano)Recomendado únicamente para artículos de bajo consumo.——Son muy buenos y tienen el tamaño ideal, los he estado usando para resolver diferentes problemas en diferentes ubicaciones y es genial poder gestionar todo desde una misma App.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"Mexico","date":1691971200000}
{"reviewTitle":"The plug did not work","reviewDescription":"The smart plug was the third Kasa device I bought.  The 2 smart bulbs worked for a couple of months and then stopped so they function only as a standard light bulb when manually turned on and off.  The plug never worked at all with Alexa.  My fault for buying 3 times and expecting a different result.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1605484800000}
{"reviewTitle":"Don’t buy it!","reviewDescription":"I wouldn’t not waist your money on this. I got this part of a bundle with an echo with the clock and I ended up sending it back. I spent bout and hour and moving around my house, plug to plug, just to get it to connect to the wifi and nothing. Honestly just buy the Amazon’s smart plug. So much better!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1589414400000}
{"reviewTitle":"TERRIBLE","reviewDescription":"Will not stay connected to the network, I’ve had these plugs for a time now and have fought with them every month.  Did I say JUNK, that’s right they are JUNK!  Buy the Amazon plug, connects easy and STAYS connected.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1646611200000}
{"reviewTitle":"Reliability","reviewDescription":"This item is entirely unreliable! When you need it, it is offline. It drips the WiFi connection regularly.  It really needs a good firmware programmer to figure why it drops the WiFi connection without reason. I sit right next to my router and it still drops WiFi.  Don't buy it until you get some positive responses and this problem is fixed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Does not work","reviewDescription":"At first this worked. Could turn on\/off an appliance away from home. This is not the case anymore. If they brought back this feature I’d buy more. Also item is over priced Costco has a 4 pack for 35-45 bucks. So it’s a no for me!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1637280000000}
{"reviewTitle":"No longer works with Alexa!","reviewDescription":"This plug no longer works with the Alexa app. I have 5 of these plugs and they all stopped working. Alexa support is non existent concerning these plugs. They tell you to turn off the internet and reload the Kasa app and nothing works! DO NOT BUY THESE PLUGS IF YOU HAVE ALEXA!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1609459200000}
{"reviewTitle":"Tossed it","reviewDescription":"this is my 6th KASA device, 5 wall switches and now this min plug HS-105.  I've tried multiple time and even with factory resets it will no work.  At least the wall switches have worked.  (Will not connect to WiFi network)Just ordered Amazon smart plugs, hope they work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1608940800000}
{"reviewTitle":"Doesn't work","reviewDescription":"I must be the only person who has ever bought one that doesn't work. :(  TP-Link site verified even the model number printed on the side of item doesn't exist, so there is no connecting the app with the product.  Don't want to waste my time or money exchanging or trying another failure.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1601164800000}
{"reviewTitle":"Spend $5 more and get the Amazon smart pllug","reviewDescription":"I found the included directions very hard to follow, and was never successful in connecting the Kasa smart plug with Alexa. I finally gave up in frustration and returned the Kasa smart plug. I then spent just $5 more , buying the Amazon smart plug, and was immediately successful in making the connection with Alexa. My conclusion? Beware of false bargains!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577059200000}
{"reviewTitle":"Doesn't stay connected to iPhone","reviewDescription":"When it works it is fine, but trying to control the same plug from 2 or more devices, iPhone and iPad, one or both will lose track of the mini plug. Have had to try and reconnect more than 6 times so far. Not a good App.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Works as should","reviewDescription":"Works as should. Set up wasn't too bad. Works great with Alexa. But if buying for Alexa\/echo, buy the official Alexa plug. Setting those up is a lot quicker.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577664000000}
{"reviewTitle":"Makes life easy","reviewDescription":"Super cool, especially with the holidays... made turning on and off the Christmas tree as easy as possible. Cant wait to see what else I can use it for","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577232000000}
{"reviewTitle":"Convenient but user experience could be better","reviewDescription":"Nice product but seems this could be two outlets very easily... Also the directions for connecting to Google AI we're outdated and made connecting to Google account somewhat complicated","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1575158400000}
{"reviewTitle":"Good Device.","reviewDescription":"It works very well. The setup was a little easier than a wemo plug.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610064000000}
{"reviewTitle":"Plug","reviewDescription":"Didn't really know what it was for, but when I found out it works great. Could have more than 1 outlet though","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1592956800000}
{"reviewTitle":"Love it","reviewDescription":"I tried to set it up with Alexa and it kept telling me it didn’t recognize the device. Other than that worked GREAT! I love it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578700800000}
{"reviewTitle":"Good Alexa plug","reviewDescription":"Worked easily with Alexa, not something that all plugs we’ve tried have done. Occasionally needs resetting but not more than every month or two","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1583798400000}
{"reviewTitle":"Works as intended but had trouble with WiFi connectivity.","reviewDescription":"Works as intended. Dont really need set up instructions, just has a little trouble getting it to connect to WiFi. Took it a few trys.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576800000000}
{"reviewTitle":"Excelente, pero ocupa bastante espacio.","reviewDescription":"La única desventaja que vi fue el tamaño, crea dificultad al intentar enchufar otras cosas alrededor. Toma dos espacios en vez de uno.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581638400000}
{"reviewTitle":"Decent","reviewDescription":"Took awhile to connect to my wifi even with a good signal","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1610496000000}
{"reviewTitle":"Absolutely useless","reviewDescription":"This was free with the purchase of an Amazon device. I didn't have a use for it for about 2 years so it sat in it's box.Today I decided to use this for some outdoor lights on my patio. I set this up after installing yet another app, another account, and another skill for Alexa. It went ok, and supposedly linked to my Alexa app. However, every time I use Alexa to turn this outlet on or off it disconnects the skill from my account.I threw this right in the trash, uninstalled the app, and sent an email to their support to delete my account. Alexa \/ Echo's are janky enough without adding an extra account\/app\/step, especially with it working intermittently. Pointless junk that couldn't handle a simple task.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1627171200000}
{"reviewTitle":"Do not buy","reviewDescription":"First off its huge, it only has one outlet\\plug but is a monster.Second, you have to download yet another app supposedly to manage just this one huge outlet hogger. I haven’t seen anything else that this app could use to make it worth taking up the space on my phoneThird is its expensive compared to competitors.I have no idea what Amazon pushes this when really don’t waste your money Get a belkin \\ wemo that can manage everything in your house and don't waste your time trying to download yet another app for a single monster of a plug.So I didn’t set it up to test it, but I have belkin that work great, so didn't want to waste my time and effort on this.","isVerified":true,"ratingScore":1,"reviewReaction":"60 people found this helpful","country":"United States","date":1585353600000}
{"reviewTitle":"Inconsistent Connection","reviewDescription":"I purchased a total of four of these to work with my HomeKit setup. All four of these have the same issue of not remaining connected to the network and needing to be reset at least once a week. No matter how many Wi-Fi and network settings I tried changing, this device would not stay connected to the network consistently. I wish I could return them and get my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1685491200000}
{"reviewTitle":"Be careful what you get.","reviewDescription":"This plug was easy to integrate with Alexa. But this is where all its good features have ended. I plugged into this smart outlet small heater, so I could voice control warming up the bathroom in the morning.So one day I came back to the bathroom in the middle of the day and found my heater running. Ok, I thought that I left it working, forgetting to turn it off. But a few days later the same thing happened. And then again and again. The sudden starts were happening very sporadically. So, finally, I removed it and replaced it with the other smart plug, smaller shape and so far without such an \"expensive\" malfunction. I think it was happening when the unit was losing wifi connection.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1586217600000}
{"reviewTitle":"These were $9.99 not even 2 years ago - NOW THEY'RE TWICE THE PRICE?!!!  Also disconnects frequently","reviewDescription":"Bought 5 or 6 of these not even 2 years ago and they were $9.99 each.  Now they're twice the price at $19.99 each?!!!  INSANE RIP OFF.  And don't tell me it's \"supply chain\" - this is extortion plain and simple.  Also, these frequently lose connection from my router (Xfinity Gigabit) every week or so, and require to be unplugged and plugged back in to reconnect.  AVOID.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665532800000}
{"reviewTitle":"Far way too complicated to setup for remote control","reviewDescription":"If you would want to be able to setup TP-Link\/KASA smart plug devices for remote control outside of your home network (e.g., from the Internet, outside of home), BE PREPARED to mess up with your broadband modem\/router's firewall, DNS, and\/or DMZ configurations. If you are not an IT or network guy (of which, I am) that are well versed on these, you may find the TP-Link\/KASA smart plugs to be TOO FRUSTRATING AND\/OR COMPLICATED to setup for remote control. Even TP-Link's support techs will tell you to do things that CAN COMPROMISE the security of your home network (e.g., they will tell you to DISABLE your router's firewall). This device is certainly not for average (or even above-average) humans, setup-wise.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577836800000}
{"reviewTitle":"Dumbest smart bulbs on the market.","reviewDescription":"Would you like to ask Alexa to turn a light on or off, only to be told the device “isn’t responding?”If so, Kasa products might be for you.We’ve got a few Kasa smart plugs and bulbs, and they fail to perform as requested more than half the time. They mysteriously drop their connection at random times throughout the day with enough frequency that at this point, it’s more common for me to flip a light on the old fashioned way, rather than the “smart” way.Do yourself a favor and look elsewhere for smart lighting. Kasa was a bad choice for us.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1613174400000}
{"reviewTitle":"The only brand I have that consistently often fails to function...","reviewDescription":"The only brand I have that consistently often fails to function, both my other mixed brands work 100%. This one either won't turn on or off 3 out of 5 times I try it, and I have to plug it in and out. Even in the same room as my router 12 feet away! Not worth the trouble to go through to return. I will make sure now to buy this brand again...","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1659830400000}
{"reviewTitle":"It’s NOT an AMAZON plug. Third party junk.","reviewDescription":"This thing IS NOT an amazon plug. It requires you to download a third party Vietnamese app, give it access to all your information and location. The outlets took over 10 minutes to connect and then require you to use a third party app to use. The whole point of having this capability is so I don’t have to use multiple apps.I’ve always purchased the AMAZON plugs as $5 add-ons with other Amazon purchases. I’m not sure why but they sent me this piece of junk instead of actual AMAZON plug.Don’t waste your time. It’s not the same.","isVerified":true,"ratingScore":1,"reviewReaction":"139 people found this helpful","country":"United States","date":1576022400000}
{"reviewTitle":"Doesn’t work","reviewDescription":"I could never get the plug-in to work. I even contacted the brand again to ask for help and couldn’t get it to work and couldn’t really get someone at the company to want to help. Got an Amazon plug and it worked right away no problems. Will never purchase a Kasa product again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669593600000}
{"reviewTitle":"so far so good","reviewDescription":"purchased these to replace the meross that seem to fail within two years.Download the manufacturer’s app and add the devices. Then open apple home and add as a new device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Connects quickly","reviewDescription":"Plug connects quickly and Alexa controls the commands to turn the item in and off in a flash!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Good upgrade from Kasa","reviewDescription":"Kasa...TP-Link...Tapo...they sure make things complex with the names. Either way, I had Kasa lights and plugs integrated with Alexa in my home. All have worked decently, but they were pre-Apple HomeKit. Got these so I could control everything from HomeKit on-the-go and with my family, but also to be able to handle things through Alexa as needed. Boom -- that's what these plugs enabled me to do. Pretty easy setup, I like doing things without a hub.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1719878400000}
{"reviewTitle":"They just work","reviewDescription":"Don't have Alexa, we use the apps (iPAD & phone) to control. They work, no problems. Schedule is great, used for Christmas lights, fire and forget. We also use one for our printer, no need to walk to the next room, just turn it on from your tablet, wait a few seconds, and print.  Have 3 of them and they have worked with no problems.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"I love having these!","reviewDescription":"I love this product. I put it on one of my fan and one on my light they work great I love them. I haven’t decided if I’m gonna get more or not. I also have an Alexa on the fan in the living room. It works. OK she worked great too. Sorry no photo.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Amazing product!","reviewDescription":"These were on sale and I grabbed 3 boxes of them and so glad I did.  They installed flawlessly, updated themselves immediately and have given me zero issues at this point!  Work perfect with Apple Home.5 star item!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Love it","reviewDescription":"Thought I’d finally give this a try. Love them. A little big but with a surge protector with lots of space, it’s no big deal. Will order another set.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720051200000}
{"reviewTitle":"Works well with Apple HomePod","reviewDescription":"The setup was a little redundant because you first needed to use the manufacturer's app and then pull it into Apple Home. But once I understood how to do that, it wasn't bad. Overall, I'm happy with the product and will probably buy more.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Excelente","reviewDescription":"Controlo desde home kit sin problema. Demora Max 1 segundo en apagar o encender.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Works great but is mistaken by Alexa as a light source","reviewDescription":"These smart plugs have some useful features thru its app, such as Scenes & Timers. It is compatible with Alexa.I can set an \"aromatherapy\" Scene to turn on all oil diffusers. Using the Timer feature, I can then set the diffusers to auto-shutoff in 2 hours any time it's been used. I can use Scenes or Timers to have lamps turn on at a specific time on certain days, or everyday at sunset, then shut off at sunrise or what not.They do jut out from the wall quite a bit (almost 2 inches), but you are able to use 2 of these onto a regular 2-plug outlet with no space issues. If you use them on a surge protector\/strip or on an outlet with regular cords plugged in next to it, this can get in the way, depending on the surrounding cord's bulk. Most regular 2-prong cords (lamps etc) will fit next to an outlet with this plugged in, some will be a tight squeeze next to each other. (Air fresheners & 3-prong cords will definitely not fit next to this.)These don't work with devices that have an auto-shutoff or timed-shutoff safety feature, but that is more of an issue with those devices and not this smart plug. For instance, my bed warmer & light-therapy lamp won't work with any smart plug. Think of it this way: if your device is powered on & you have a power outage, does your device kick back on automatically when power is restored (like lights do)? If not, then it won't work with ANY smart plug.These smart plugs do NOT offer any other special features such as energy-use monitoring, parental controls, etc. It merely turns an existing outlet into a wifi-enabled smart outlet without having to do any electrical wiring.Alexa will, however, be able to give you energy use estimates thru its own app, but that is an Alexa feature, not the smart plug's.The only issue I had with these is that Alexa mistakenly sees them as a light source even though I have it set up to NOT be listed as a light source. For instance, I use these on an oil diffuser and a desk fan. When I tell Alexa to turn on the lights, it turns on the diffuser and fan as well. I then have to tell Alexa to turn off the diffuser and fan individually from there. But this is more of an issue on Alexa's end, not the smart plug.Overall, I've bought several of these and it works great for what I need, plus they're very affordable!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1625961600000}
{"reviewTitle":"Waste of Money","reviewDescription":"When I ordered this smart plug, I mistakenly thought it was the Amazon plug that I had previously ordered as it was bundled with an Echo Dot purchase. I couldn't have been more wrong. This plug doesn't communicate well with our Wi-Fi Extender made by the same company that makes this plug, and 90% of the time, Alexa says that it's not connected and we have to either manually turn the lamp off at the plug or go to the Kasa app to turn it off. We've done everything short of throwing it out the window, which is coming pretty soon...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1595289600000}
{"reviewTitle":"Does NOT connect to HomeKit","reviewDescription":"You can install the device using the top-link app. But this device does not connect to HomeKit.I’ve no idea why Apple allows these OEM to use HomeKit logo. I’m sending this device back.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Junk, stay with the Amazon original smart plug for your sanity.","reviewDescription":"This plug was unable to find and connect to my Alexa Show or the WiFi. Stay with the Amazon plug it connects easily with a quick snapshot of a code included in the box.This piece of frustration needs you to download another app, play with the lights, search over and over for a connection and never does.  Worked with a customer service rep and we still couldn’t get it.The replacement was a Amazon Alexa plug and setup was as easy as plug it in, add new device on Alexa app, scan code, name device, “done”.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Needs a smart phone to install","reviewDescription":"This is for the Amazon Echo.  I have seven plugs from different manufacturers and they all were easy to setup with Alexa.  Not this one.  It requires a smart phone, not a computer and not a tablet for the initial installation.  This is not mentioned in any of the verbiage.  I tried downloading the app to both and it wouldn't download.  Pretty packaging though.  The unit is 1.50 x 2.50 x 2.50 inches.  The box is 3.50 x 3.50 x 5.50 inches and could hold six plugs.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1577491200000}
{"reviewTitle":"It's Just Not Worth It","reviewDescription":"My Kasa Smart Plug has been nothing but a pain in the butt since I got it.  Compared to my Nooie plugs, it's just not worth the hassle.  It's a pain to set up, gets disconnected from Alexa, setting it on a schedule doesn't work and now after being disconnected again it won't take my login.  Absolutely none of these things occur with my Nooies.Life is way too short to deal with products as poorly designed as this.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1618444800000}
{"reviewTitle":"Doesn’t actually work with HomeKit","reviewDescription":"Tried all 4 smart plugs, and turns out none of them are discoverable via HomeKit. You can only use the Tapo app or set up Shortcuts on iPhone. I wanted to use these to control my lights with Siri, unfortunately it isn’t that simple with this brand.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1672099200000}
{"reviewTitle":"Does not function with Google Home","reviewDescription":"TP-Link Chat Support Says that you Cannot install these plugs without installing the Kasa App.This is listed as one of the Seamless Setup devices. Google Home wouldn't recognize the device and when I spoke with support on chat, two separate tech support reps said that it cannot be installed without installing the separate Kasa App.  I then spoke with a rep on the phone and they also confirmed that it cannot be set up without the Kasa App.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626048000000}
{"reviewTitle":"Waste of Money!!","reviewDescription":"What a WASTE!! I got this with my Alexa device so that I could set a routine to turn off a light in a room. I spend over 2 hours trying to set it up and the stupid thing couldn’t even connect to the internet. Tried resetting the router. Nothing. The plug’s app kept saying there wasn’t a “suitable network.” Which is a joke. All our other smart devices connect to our TWO networks with ZERO issue. I’ll be looking into getting a refund. Don’t waste your money on this crap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1585180800000}
{"reviewTitle":"No Longer Works with Alexa","reviewDescription":"I bought this a few years ago and it was great, but I moved recently (new wifi network) and now it won’t work with Alexa, even after going through all the trouble of downloading a separate app and creating an account (didn’t have to do that before).  I’m disappointed that they made this separate app requirement. This thing is now just junk and going into the trash.  I hate that the product has 4.5 stars because of how it USED to function.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1594166400000}
{"reviewTitle":"Most worthless as set-up fails","reviewDescription":"I was so looking forward to this product as I own a TP-Link router that is EXCELLENT. This \"smart\" plug, frankly, isn't. The app you are required to use never did allow me to \"log-in\" nor would it find the plugs.What I don't understand is why I could not use my otherwise excellent, TP-Link app, Tether (for my router), to control these devices. I'm going back to my manual timers for some lights in our home.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1611532800000}
{"reviewTitle":"Great accessory for echo dot","reviewDescription":"Easy to use via WiFi app","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580342400000}
{"reviewTitle":"Excellent","reviewDescription":"Loved it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1593475200000}
{"reviewTitle":"Live ut","reviewDescription":"It works great with Alexa","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581379200000}
{"reviewTitle":"Kasa Smart Plug Mini","reviewDescription":"Easy. Straight from the box!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581206400000}
{"reviewTitle":"Great device","reviewDescription":"A bit hard to figure out","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576108800000}
{"reviewTitle":"It works very fast","reviewDescription":"The product works really well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579392000000}
{"reviewTitle":"Good product","reviewDescription":"This is a good item","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579046400000}
{"reviewTitle":"Plug it","reviewDescription":"Fast to set up","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579996800000}
{"reviewTitle":"Easy to integrate","reviewDescription":"Works as expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1582761600000}
{"reviewTitle":"Good product","reviewDescription":"Works well, watch for imitations","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1575676800000}
{"reviewTitle":"Bulky design but awesome functionality!","reviewDescription":"We bought this as an addition for our 2 pack we previously bought. Set up was a little more cumbersome than I remembered but still easy. Perfect for the holiday season and our Christmas tree. We use the schedule feature to have our Christmas lights on when we arrive home.It's a little bulky and hard to hide behind large furniture once you have a plug plugged in. Close to 2-3 inches total.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1575676800000}
{"reviewTitle":"Great timer function.  Easy to setup","reviewDescription":"Easy to setup.  Only caveat is we have to have a common account for two of us to control the outlet.  Unless I’m missing something on how to share this device with others in the household.  Replaced a difficult to use manual timer.  If this continues to be solid, I will order more.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608336000000}
{"reviewTitle":"Great. It took a while for setup. But it was easy.","reviewDescription":"I had some issues setting this up. I got it as a bundle with a dot. I thought it would come preloaded to work with alexia, like the last bundle, but it wasn't. The tip was to download the tp app. It was easy from there. The only reason I give it 4 stars is the setup. Otherwise it works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Easy to use with Alexa, not HomeKit compatible","reviewDescription":"No complaints with the ease of use of the smart switch. It was quick and easy to set up. One major downfall of this product is that it isn’t HomeKit compatible. I received it as part of a bundle or I wouldn’t have chosen it. I’ll stick with Wemo plugs in the future as they are both Alexa and HomeKit compatible","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579132800000}
{"reviewTitle":"Needs separate app from alexa","reviewDescription":"I don't like that you have to download another app to use this with the Echo Dot, but that's more my problem than the product.The set up is simple and all the steps are provided.I would probably purchase the amazon ones from now on because I dont have to download an extra app for those.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579478400000}
{"reviewTitle":"Works pretty well","reviewDescription":"Works great when it works.  I especially like the ability to coordinate the on time with sunset. Only problem is that it occasionally gets hung up and has to be reset.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1618963200000}
{"reviewTitle":"An idiot must have written their \"documentation\"","reviewDescription":"It's really a fairly decent product, but they are a PITA to install. Totally not really intuitive. Supposed to be easy, but clearly not designed for average people. I'm guessing \"engineers\" decided what easy should look like. So vexing. Terribly bulky packaging.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"Maybe It's Just Me","reviewDescription":"These plugs are easy to install initially but if you ever have to unplug them and reinstall, it becomes a bit more complicated.  Alexa doesn't really like these.  She refers to them as \"an outside application\".  LOL!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608249600000}
{"reviewTitle":"Works as advertized.","reviewDescription":"I was able to set and use this switch without much trouble.  The Android apps gives less trouble than Wemo and Google home integration works.  I just wish these products were more standardized.  I'd prefer not to need a vendor-specific app.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1608076800000}
{"reviewTitle":"Perfect!","reviewDescription":"Perfect!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652400000000}
{"reviewTitle":"Timing is everything when you’re in need of something you really want.","reviewDescription":"I like our herbs and spices, it’s very important to me to have my roots and spices naturally. I work out 3 to 4 times a week. I do the best to take care of Myself. It’s important that we all stay healthy. We have herbs and spices to take care of everything that’s needed for the body and for the brain also for her skin and hair. We have herbs and spices to cleanse our bodies. It’s very important to cleanse our body. I order just about every year anything from Amazon.com I ordered all my car parts interior and exterior, also engine parts.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578009600000}
{"reviewTitle":"Easy to set up AFTER you read other reviewer downfalls!","reviewDescription":"Reading everyone else’s ups and downs really helped me set up my plug as a timer. Plus, since the app interface isn’t super user friendly a few days into its use it really clicked for me how to use as a timer. Must set up 2 entries stipulating turn on time, then 2nd to turn off time. All good once that was established!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1640563200000}
{"reviewTitle":"Works great with apple home","reviewDescription":"This product works really well with Apple home and I love it. Had a lot of problems with other products. I would recommend this for you to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1680048000000}
{"reviewTitle":"Work great.","reviewDescription":"Easy to use and integrate with smart devices. The app is easy to navigate.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Makes my life easier","reviewDescription":"I use it to set a timer to have my lamp turn on to wake me up in the morning. I love how well it works with Alexa. I have two,  one for my desk lamp and another for my bed lamp. I honestly can’t remember the last time I actually touched the light to turn it on because all I do is say “Alexa turn on the light”.  Makes my life so much more simpler. It’s also so easy to set up. Get the app, scan and done! Easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1610323200000}
{"reviewTitle":"Works great; setup was a breeze","reviewDescription":"After the problems I've had with some of the other apps I've set up to work with Alexa (most notably, Hunter Douglas blinds), I was skeptical that this would have such an easy setup and work so well but, as you can see, that was indeed the case. Very happy. Great price. I'll have to see what else in the apartment I can get to work with this kind of plug.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1616284800000}
{"reviewTitle":"Works like its supposed to!","reviewDescription":"We use this on a lamp, that enables us 3 ways to turn it on:  1) while we was away, I used the app to turn on the lamp, 2) before we leave the house, we tell Alexa we are leaving the house, and based on your geographical location, she will turn on the lamp at dusk, and 3) while u r home, tell Alexa to turn on the lamp, and tell her when u want it turned off, and she will turn it on when requested, and turn it off when requested.  So far, no problems.  Luv it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1578355200000}
{"reviewTitle":"So easy to set up!","reviewDescription":"Brand loyalty is not typically a thing for me.  I look at individual products, but in this case, I have tried these plugs, and several other smart connectors from this manufacturer, and they work so flawlessly.  Pairing is beyond simple, unlike many of their competitors.  There is no struggle to find the right WiFi frequency, etc.  The app finds them without effort.  I bought several to try out from this and other brands.  The others are already back at Costco.  These, I will keep, and have ordered more.  Thanks for such a simple setup!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1576368000000}
{"reviewTitle":"Handles higher loads","reviewDescription":"I have purchased two of these.  I have one set up with a fan and another with a space heater.  Both of them are able to handle the heavier load (15A) that these items produce.  Other plugs that I’ve used that are adequate to switch on lights were blown out by the higher loads fans and heaters produce..Works great with Alexa.  “Alexa, turn on the fan.”I use the timer with the space heater warm my bathroom before I get ready for work.  I can also say “Alexa, turn on\/off heater.”","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1579219200000}
{"reviewTitle":"FUTURE HOME","reviewDescription":"I freakin love these things. They kinda drive my GF nuts because I have so many things hooked up to them, but I love not having to think about turning lights on when the sun goes down and being able to control all these parts from afar. Of the smart home type products I've used so far, all the TP link ones have hands-down been my favorite. The app is intuitive and has a lot of great options.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Terrible experiencie inaccurate description","reviewDescription":"Where does it say that it doesn’t connect to 5G? What a asta of time and money because these sre not cheap","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"I am visually  impaired  I need help","reviewDescription":"I am visual  impaired  and I can't get my economy to work and I do not know who to speak to I need help so I put my economy back in the box until I can get someone to walk me through the set up I want a live person to speak too","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1594684800000}
{"reviewTitle":"Not Really Integrated Well","reviewDescription":"When I bought this I thought I was going to be able to quickly add an Alexa Skill and set this up.Nope, it requires a Kasa account, which you then link to your Alexa\/Amazon account.Why go through this when I can get a direct Alexa plug without that extra setup, that gave me issues?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1580342400000}
{"reviewTitle":"Trash","reviewDescription":"Complete waste of money.  Threw it in the trash can after trying 4 times to set up an account and link the “trash” to my Alexa.  I have 4 other smart plugs by a different company and they work great.  Disappointed that amazon would pair this trash with their echo dot in a daily deal..","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1576713600000}
{"reviewTitle":"Avoid Giving your neighbors free Wi-Fi with this plug","reviewDescription":"I would say that this thing works great because it does what it says. However, I don’t like the fact that it leaves it open hotspot for all of my neighbors to suck off my Wi-Fi. This This is exactly why I gave it a low rating for Wi-Fi signal. I would definitely not buy another.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Doesn't Work on Open Wifi","reviewDescription":"This product would not connect on my open wifi network. It's not their job to force me to secure my network if I choose not to do so. I would be fine with it giving me a warning, but for the device to tell me it won't support what I bought it to work on is ridiculous.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1576886400000}
{"reviewTitle":"You had one job","reviewDescription":"Within a week, all plugs had lost wifi configuration. They retain the settings during install but are not accessible with the app. Can't recover the connection with reset.  App gets stuck on device's wifi connection & basically won't reinstall onto wifi network. Complete junk software.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1608336000000}
{"reviewTitle":"Won't Connect","reviewDescription":"We moved houses and this product won't reconnect to Wi-Fi.  It's worthless.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"nope","reviewDescription":"it's not a \"plug in and go to the Alexa app to set up\" you have to download another app to your phone, create an account only to discover that it doesn't connect to Alexa.  This would be my third smart plug and it is by far the most difficult to set up.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1575763200000}
{"reviewTitle":"Doesn’t work!","reviewDescription":"Piece of junk! I don’t know why Amazon decided to bundle this Kasa plug with the Echo Dot instead of the Amazon plug (that actually works). It won’t connect to my home network. That pretty well makes it a useless waist of money. Oh, and good luck trying to get technical support!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1579219200000}
{"reviewTitle":"EXCELENTE","reviewDescription":"Un buen producto ya probé todo y funciona genial y lo más importante que lo quería para HomeKit de Apple y todo bien… llego a tiempo a Perú","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"Great little product …","reviewDescription":"This device more than lived up to my expectations.  I did not use the “free” app download-which has a subscription.  It’s simply not needed. While it may have greater granularity, I have every thing I need by using only the Apple Home App which was already available on my iPhone. I control my outlets by voice (SIRI), or by the Home App. The Apple TV and Home Pod I already own can act as a hub, but my phone works well too. So fulfilled my needs that I ordered two more to control some hard to reach outlets in my home. Definitely recommended for very economical entry into home automation.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712448000000}
{"reviewTitle":"Muy útil","reviewDescription":"Mi vida ha cambiado por completo desde que los tengo, antes era una molestia apagar y prender cosas como mi ventilador, pero desde que lo tengo y usándolo con Home Kit de Apple, me funciona perfecto y se integra bastante bien con Siri, por lo que me hace la vida mucho más sencilla. Algo a tener en cuenta aunque supongo que pasa en todos estos productos es que funciona con una red de 2.4.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Awesome","reviewDescription":"Connect to my Apple products quick and easy and works amazing","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Work with Siri","reviewDescription":"It works with my Siri perfectly, the installation is very smooth, attach it, scan the code, it can be ready in less than one minute","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Great product","reviewDescription":"I love setting up my house to be smart accessible. This was a great product. It did take some time to set it up.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Nobody ever says this on these plugs ~ but I will ~ This Works With a 8000BTU Window AC!!!","reviewDescription":"Yep ~ I tried 2 other smart plugs with my Alexa Echo Dot ~ and I searched for any mention of such smart plugs being specifically able to handle an AC Window Unit  ~ of Air Conditioner Window Unit (I am typing it both ways so folks can find this plug!)  Both of the previous plugs gave up and went back to Amazon ~ so I researched some more ~ still hard to find (google) clear specific recommended smart plugs that can handle a Window AC ~  And then I came across mention of the TP-Link Tapo P125 ~So I will type it here one more time ~.  The TP-Link Tapo P125 can handle a Window AC Unit ~ at least up to 8000BTU (like the one I have).  You're Welcome!~~~ I use the plug to be able to turn off my AC when I leave my small apartment for the day ~ and about 30 minutes before I head home I tell Alexa to flip on the AC ~~~  and I return home to a nice cool place.  Sweet!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Connects quickly, no issues with HomeKit.","reviewDescription":"I was super excited to find smart plugs that are HomeKit compatible for such a great price. I’ve only connected 2 of 4 so far but they worked perfectly from the first try with no issue. I use them for holiday lights and so will be using all 4 during Christmas. It’s really nice to come home and say “hey, Siri turn on Halloween” and the scene is set without having to reach behind cabinets to plug the lights in or unplug them before bed. They’re also compatible with Matter which is quickly becoming the universal smart connectivity “hub” so when Apple converts we’ll already be ready to go. They’re smaller than the usual plugs and though they only come in white they’re still less obvious or intrusive. The QR code to connect them is on the plug itself so you don’t have to keep the box indefinitely or struggle to remember which plug is which. Highly recommend these.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Works well, easy to set up","reviewDescription":"The plug works well, and is easy to set up.  It integrates with my SmartThings and Google Home so I'm happy.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1716076800000}
{"reviewTitle":"Easy set up","reviewDescription":"Super easy to set up, works great with my HomePod . Just scan code on side of the plug. Wait a minute to  uploads then you name that plug and you tell it what to do. Exactly what I wanted. On a couple of them it took me a couple tries for it to connect to the Internet when i  scanning the code. I figured out if you unplug it and plug it back in and turn it back on. It works pretty much every time for the upload process, but after that, you’ll never have to do it again. and they work flawlessly for me. So good luck be patient if you’re one of those that give up after the first or second try. Just don’t be in a hurry and try it again it will work. and after you do a couple, you’ll know how easy it is. Super happy with mine.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"I love my smart plug.","reviewDescription":"I use my smart plug for my lights. It really helps me because I am disable. D but it helps me to turn on and turn off. I just love the product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Easy to install","reviewDescription":"I use this on my espresso machine to pre-heat the machine. Works great. I need to figure out how to make it turn off automatically after so many minutes. I’m sure that it can do that","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Very helpful","reviewDescription":"Have it set up with my alexa. When had my surgery I just ask alexa to turn on or off and did it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Easy to install","reviewDescription":"These work very well with HomeKit, and are very easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Love it esp. with the price","reviewDescription":"Great product with great price. Highly recommended.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Stoopid-easy to set up and use","reviewDescription":"I continue to be impressed with the TP-Link lineup. These (and the cameras I purchased a while back) were ridiculously easy to set up using the app and then add to Apple’s Home app as accessories. If you’re into using Siri for home automation (as I have for quite some time), you’ll like these.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Matter support is great!","reviewDescription":"This is perfect now that a firmware update added matter support.  Don’t need a second app to control it or link to HomeKit.  It just works.  Very responsive to commands via iOS Home app.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"App crashed","reviewDescription":"I have used the Kasa app for over a year.Later it started to ask me for my password even if I exit and then go right back it.Now, it just deleted every smart plug I own.  Virtually everything electric in my house and office is controlled by the app and now all gone as far as control goes.I asked for help three times via the Kada app and each plea for help goes unanswered.It is like once they got my money, now no service.  Come on tech support, how about support after the sale?Check your emails and help a customer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1665446400000}
{"reviewTitle":"Very Easy to connect to Alexa","reviewDescription":"I have a bunch of different plugs and lights that are smart, and this one was one of the easier to connect. I still have to get the app for it but once I connected it to the plug it automatically connected to alexa. I think you have to store your wifi password for that to work, but I find the integration very simple.I am not a whiz at this stuff, I am 60 years old so not great with all this new stuff, but this to me was pretty easy. I also liked that they let you put a picture of whatever you are controlling into the app so you can look at the photo plus the text name. This was nice to identify....in case you have a bunch of outlets that might have similar names it just makes it a little easier.Thanks for reading my reviewBecky Brooks","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1576454400000}
{"reviewTitle":"Wifi plug,  without one more sign up, just discover with alexa and go","reviewDescription":"There is zigbee and zwave, and you can buy plugs with this technology.  But I find their mesh networks collapse,  probably due to range.  This device is wifi based.  It does not have a range issue and because it is plugged in it doesn't have a power issue.What I really like about this device... my alexa discovered it without using the kasa app.  It's like a zigbee device that you don't need to sign up for another service to use (and pay later... wink wink) but it has the range of wifi win winI only have one caveat for the reader.  I got this black Friday as a package with an alexa show.  So maybe they did something to pair it to my account first  I also have a kasa wall switch... no such joy, I'll need to sign up to get the wall switch to work.  Come on Kasa!Your mileage may vary","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1609459200000}
{"reviewTitle":"nice Echo accessory","reviewDescription":"Quite a hassle to set-up. It took several tries. Seems like its WiFi signal is weak. Works OK once set-up and installed. Of course it eliminates local manual control of the device - kind of annoying.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578355200000}
{"reviewTitle":"Uses wifi to connect","reviewDescription":"Use it with an routine paired with echo dot. Turns off lamp just like a lamp should be turned off. Like a lamp. A lamp that is smart. SMARTER THAN ANY LAMP!....... it works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580774400000}
{"reviewTitle":"I’d get more soon.","reviewDescription":"Excellent little device. Though I had to move it near the router for initial setup. It’s normal operation is flawless a decent distance away...so I dunno why it was fussy about the setup signal.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Decent item","reviewDescription":"Great device but Alexa has issues understanding commands to utilize the plug.The plug and plug app seems to work just fine.  I have had no issue with the plug","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1584057600000}
{"reviewTitle":"Simple, effective","reviewDescription":"I like it as a simple smart plug. I don’t like that there isn’t a quick reset button though, I had to go through the whole process after changing my WiFi password.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576972800000}
{"reviewTitle":"To use","reviewDescription":"Want to buy a smart socket all the time, pretty good, cabinet does not occupy a space, do not affect other plug, connect smart stereo very good!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1591488000000}
{"reviewTitle":"More of a Dot problem","reviewDescription":"Sometimes the Dot in the kitchen hears the command from the bedroom instead of the Dot in the bedroom, but when the right Dot hears the command it works great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580515200000}
{"reviewTitle":"Works well for a table lamp","reviewDescription":"Seems to work very well with Alexa and the table lamp we installed this on.Set up was simple.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1603756800000}
{"reviewTitle":"Good one","reviewDescription":"I like the timer function in this . Had little trouble with Alexa integration first. Later figured out on that","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1604534400000}
{"reviewTitle":"Kasa plug","reviewDescription":"Works fine with its own app, but I have had a little trouble syncing with Alexa.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1609804800000}
{"reviewTitle":"Connection sucks","reviewDescription":"Won’t connect to my inverse internet. Tried for 4 days.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1582329600000}
{"reviewTitle":"Short term use","reviewDescription":"Whilst didn’t work very long syncing to Alexa","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1581120000000}
{"reviewTitle":"Plug","reviewDescription":"Doesn't seem to stay connected","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1583452800000}
{"reviewTitle":"Don’t know","reviewDescription":"Can’t get it to work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1582761600000}
{"reviewTitle":"Works ok but a bit pricey for what it is.","reviewDescription":"Pricey","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1593993600000}
{"reviewTitle":"Difficult to link to internet","reviewDescription":"Difficult to link to internet","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Ok","reviewDescription":"Difficult to set up","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576281600000}
{"reviewTitle":"👍","reviewDescription":"Works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1584057600000}
{"reviewTitle":"Customer","reviewDescription":"Not bad","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1575849600000}
{"reviewTitle":"Why a new app? What's the advantage over Kasa?","reviewDescription":"I've been using Kasa switches and outlets for a few years. It's very concerning that TP-Link is releasing a different line of hardware with the same functionality.Setup wasn't as smooth as the Kasa outlets. The functionality seems identical though. My use case is for my grandmother to be able to turn on and off her tree using Alexa. They are a great value for the price though!I'm unable to evaluate the Apple HomeKit functionality.","isVerified":false,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1671408000000}
{"reviewTitle":"These make Life easier","reviewDescription":"Bought this for my lamp in living room. Now i just tell alexa to turn on living room lamp and its on. Loving it. You can also turn it on when your away from your phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1678320000000}
{"reviewTitle":"Works great, easy to use","reviewDescription":"I bought this to control a light.  It was super easy to set up and worked exactly as advertised.Exactly as I expected.  5 stars.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1682380800000}
{"reviewTitle":"A must have.","reviewDescription":"I got one last Christmas and never used it, but this year I thought about buying smart bulbs for the electric candles in the windows and they were too expensive.  Then I saw the one I got last year and plugged it in and set up the timer on my iPhone and it worked perfectly.  So I bought one for each window on both floors of the house.  Now we don't have to go up and down to turn them off each night.  I also just bought 4 more for our oldest son and they love them as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1610064000000}
{"reviewTitle":"A worthy purchase","reviewDescription":"Works well with the Apple APP and easy to use and install","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Great Once Setup","reviewDescription":"I was a little bummed by the complexity of the setup. Definitely not doable for someone just getting an Alexa (which what it was bundled with). At first, I had some trouble with the distance to the router and having to download another app ) the Kasa app) to setup. However, once up and running it works flawless. You can either speak to Alexa and have the outlet go on\/off or control it via the app.The nice part with the app is it boots right to the screen that allows you to turn the outlet on or off. So, there is no digging through screen to turn on a light, etc.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1579305600000}
{"reviewTitle":"Turn On Lights From Another Room","reviewDescription":"Love that I can turn on a light from downstairs. Currently using for a bedroom lamp - so easy being able to turn on before going upstairs with a toddler or baby. Also can turn off the lamp from in bed so I don't disturb my husband since the lamp is on his side. Will be getting more to use when out of town to have lights turn on and off at random to make the house look lived in. Setup took about 5 minutes including the time necessary downloading the app. Haven't tried with Alexa or Google Home yet but seems like it should be easy there as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1577232000000}
{"reviewTitle":"great product.","reviewDescription":"it never fails . I love them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Works well","reviewDescription":"I like automation.Have one on a desk light, used daily. Has a plug-in slide dimmer on a wire between it and the lamp, so it turns on on a command, and dims from a wire.Have one on my motorcycle trickle charger. I can just turn it on timer for an hour or two to top off the battery, if I feel the bike has not had enough use. I have not 'scheduled', but would imagine that works well, also.Used it on the Christmas tree, too. \"Alexa, turn on plug Tree\" worked great! (Go Brooklyn!)The enclosure could be a little less real-estate hungry...","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1584489600000}
{"reviewTitle":"Let it glow, let it glow, let it glow!  Enter the smart outlet!","reviewDescription":"This smart plug is a great way to enhance your home without complicated or expensive installation of switches or a hub.  It uses the kasa app (downloadable to your phone) and can respond to google (and alexa, but I have not tested her) to actuate your outlets.  We used it for our Christmas tree since the outlet was buried behind gifts and decorations.  The set-up was easy and they seem to work well.  You can also program them to turn an outlet on and off at scheduled times.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1611446400000}
{"reviewTitle":"They Work","reviewDescription":"No problems with set up or Apple Home integration.  One of the few smart home products that I have found to work straight out of the box","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1681084800000}
{"reviewTitle":"Easy set up. Love it.","reviewDescription":"After spending 4 hours trying to set up the last plugs I ordered  which I returned this plug is EASY PEASY.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1574899200000}
{"reviewTitle":"Very useful ..","reviewDescription":"I have about a week using it an I’m loving it .. If anything changes I will update my review ..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1577318400000}
{"reviewTitle":"HAPPY CUSTOMER!!!!","reviewDescription":"Just received my smart plug today and I so love it..Very easy set up I will be ordering more smart devices...","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1577750400000}
{"reviewTitle":"Great purchase","reviewDescription":"Connects easily to Amazon devices. Makes turning lamp on and off convenient.Has a little delay longer than the Smartplug.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Love it fir christmas tree","reviewDescription":"Works grea wish i didnt have 3rd party app","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1607299200000}
{"reviewTitle":"Works good but a bit big.","reviewDescription":"The product works very well with Alexa.  It is a bit too large for my liking.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580860800000}
{"reviewTitle":"Love","reviewDescription":"Never knew about these until I got my echo and don't know how we managed without them.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579392000000}
{"reviewTitle":"Easy!","reviewDescription":"Easy to use app. Easy to set up with Alexa. I haven’t used the timer function yet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580169600000}
{"reviewTitle":"Really easy","reviewDescription":"It was really easy to set up and connect to alexa. Also really easy to control through alexa.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1574553600000}
{"reviewTitle":"Not having to go back down stairs","reviewDescription":"Loved it going up thr stecan turn them on over my phone ps I turn them off","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576886400000}
{"reviewTitle":"Buggy as a Certified for Humans product","reviewDescription":"When I tried the Wi-Fi simple setup, Alexa can find the device named \"First Plug\", but when I got back to Kasa App, the device name was \"Second Plug\".... Really confusing... I think there must be some bug.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1605657600000}
{"reviewTitle":"Good Product...Slow down if not technically savvy","reviewDescription":"Difficult for me to understand the integration of the TP link and the need for its installation to get things moving.Called customer service....Referred a couple of times to someone and then the phone went blank.Worked hard got things going.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1582070400000}
{"reviewTitle":"Alexa Dot","reviewDescription":"Ordered item because I ordered the alexa dot and for some readon it was cancelled?  I did not cancel order and want it reissued on my Alexa Dot.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1596326400000}
{"reviewTitle":"Almost a great gadget","reviewDescription":"I have one that works perfectly with my TV and Alexz. However I have two others that I can't get connected to my app or my WiFi system. Should be simpler to sync.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1580428800000}
{"reviewTitle":"You have to set up an account for this","reviewDescription":"I didn’t like having to set up an account for this. The Alexa one literally took me 15 seconds to set up. This one more like 10 minutes. I wouldn’t buy it again.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1578009600000}
{"reviewTitle":"Doesn’t work with Alexa","reviewDescription":"Okay, so not yet compatible with Alexa? Idk why it was given to me in a bundle with my echo dot. I had to download the Kasa app to use this plug.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1579392000000}
{"reviewTitle":"Not worth it","reviewDescription":"Worked for a little while product just stop working can not figure out why it stopped can not get it to work again","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1610150400000}
{"reviewTitle":"Not bad","reviewDescription":"Good idea and works when on, but for some reason it shuts off completely and I have to unplug and reconnect once a week.  Maybe I have a bad mini plug.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1577404800000}
{"reviewTitle":"No w power strips","reviewDescription":"It doesn't work with a power strip. It doesn't work with a salt lamp because it has a dimmer on it. The 2 places I can't reach and needed it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1581724800000}
{"reviewTitle":"I had to reset my device often","reviewDescription":"I love the product however about once each week it stops working and I must unplug the device and then plug back into the A\/C outlet, so mine is not dependable.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576713600000}
{"reviewTitle":"Intermittantly drops network connection.","reviewDescription":"Intermittantly drops network connection and I have to unplug and then plug back in. Otherwise works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Know your wi-fi setting","reviewDescription":"I ordered this plug with my Echo Dot.  When I tried to set it up, I discovered it requires a secured wi-fi.  Mine wasn’t secured, so I tried to set it up with a password and something went wrong and I was locked out of my internet connection because the password I was sure I set up wasn’t working.  Thankfully, I was able to reset it.  Now, most people probably have a secured account and will not experience this issue, but wanted to mention it in case anyone else has this issue.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1590537600000}
{"reviewTitle":"Once it works it works","reviewDescription":"Difficult to connect and not totally in tune to Alexa.  It may take a couple rounds to set it up.  I have them throughout my house, and once you figure out the kinks, they are great.  These help me if I am running a bit late to take the dog out.  You can turn on the lights remotely.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615939200000}
{"reviewTitle":"It works, but beware.","reviewDescription":"Easy to install and performs as advertised. Package had previously been opened and configured before I received  it, meaning someone else tried it and returned it. Paid for new, got used instead.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641427200000}
{"reviewTitle":"THIS ONE IS KIND OF TRICKY . . .","reviewDescription":"THIS ONE GAVE A VERY HARD TIME TO INSTALL IT . . .I WAS ABOUT TO RETURN IT 'CAUSE I THOUGH IT WAS NOT WORKING . . .FINALLY, I FIGURE IT HOW TO MAKE IT WORK . . .NOT MY CHOISE FOR RE-PURCHASE . . .P.V.ТикоСтар☆☆☆☆☆","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617062400000}
{"reviewTitle":"Requires a Kasa Account to use with Alexa","reviewDescription":"I didn’t like that you had to download another app to use this plug.  It works okay but the Amazon smart plug doesn’t need any 3rd party apps that require you to create another account, elsewhere.That being said, it works well and it costs about half of what you’ll pay for the Amazon device.  You just risk more of your data being out there having to create a Kasa aacount.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1578355200000}
{"reviewTitle":"I had a hard time getting it connected to the wifi....","reviewDescription":"....but once I did, it has worked fine.  I was disappointed by the app allowing me to schedule when to turn the plugged in item on, but no timer when to turn it off.  I had to manually turn it off (when I remembered).  As I got this at a Black Friday price it was a great value.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1576800000000}
{"reviewTitle":"Timer function stopped working","reviewDescription":"The timer function only worked for 3 months.  I tried several times unplugging it, deleting and reinstalling the app but the timer function stopped working. It works perfectly with Alexa commands and the app on my phone but only bought it for the timer function. Going with an actual Amazon plug.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1601856000000}
{"reviewTitle":"Good plug, with its own app, but doesn't work with Alexa","reviewDescription":"I wanted to use this plug so that I may control a desktop lamp remotely. I can get the plug to work with the Kasa app, and Alexa says it's seen, but communication breaks down and Alexa app cannot control the plug.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1595894400000}
{"reviewTitle":"Not so easy","reviewDescription":"Not so easy to get setup. Nothing intuitive about it. I had to rename it 3 times to get ALEXA to recognize it.  But 45 minutes later I did enough to get it working. So 3 stars","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1606608000000}
{"reviewTitle":"Simply doesn't work with Apple Home","reviewDescription":"I'm thinking about upgrading my 10 year old Smart Home setup to be based on Apple home and tried this as a starting point. I was hoping with Apple's typical polish, it would not be PITA to set those things up and it would keep working. Boy, how wrong I am! It's a maddening experience. But I did get this to work, through triangulating in the dark. Here we go.1\/ there's bunch of QR code label in the packaging, I thought I can maybe just scan any. But that doesn't seem to be the case. You need to scan the bar code on the outlet. I guess it might have seemed to be obvious, though why include those barcode to confuse people!2\/ It seems I need to put the device in reset\/pairing mode to connect with Apple home. That seems to mean I can't connect it both to Tapo and Apple home as both need the device in the \"pairing mode\" (blue\/orange light alternating).3\/ It seems you need to \"properly\" set the device in this pairing mode. It seems you need to keep pressing the power button for 10+ seconds. The button would first start to flash, then it would sound the outlet's turned off\/on with a clicking sound. I kept holding it down after that for maybe 4-5 seconds just to be sure.4\/ Since I do need to scan the QR code on the outlet itself, and once it's plugged in, it's not easily accessible, I first scanned with the outlet in my hand, then plugged it in. You need to wait the device to start up. I think the flash pattern's first blue\/orange alternating, then blue flashing, then after a while, moved back to the blue\/orange alternating.5\/ If the pairing is to work, it would work fairly quickly. So if you are stuck at \"connecting\" (in my case scanned the wrong QR code), or \"setup\" (in my case, I feel it's started the pairing when the outlet's not in the right mode), it would just be stuck there forever until several minutes' later, it just fail.6\/ And then you can give it a name in the Apple Home app, and well, it asked you to pick what type of device it is, even though it knows it's an outlet. So once I chose the \"lighting\" as this outlet is to control a string light. Well, if you pick that, the pair would seem to be successful, but won't work.7\/ Now, after all those hurdles, you get it working! Congratulations! I'll see how long it keep working as some reviews indicated the connection is flaky...Will update this review after a month of use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Nice Apple HomeKit Integration but One Caveat","reviewDescription":"Update after 2 months:One of four units has failed.It simply turns itself off and on rapidly whenever power is applied. It ignores attempts to manually control it or reset.Former Updates:It seems reviews are merged for P125 and P125M units, which are different.The P125M seem much easier to connect to the Tapo app, but once you connect them to HomeKit, you will have reset them to do that so make sure you update the firmware before you move from Tapo to HomeKit.Update 2:These seem incompatible with my WiFi as they are all 4 refusing to talk to an access point a few feet away. I have reset these several times and they work for awhile and the fail to connect. Not worth the effort nor the price.Update:All four units purchased dropped off my network while I was away on vacation. They do not want to reconnect butI will start over and see if they can be restored to service.—-First, the one issue I see with this design it the front-facing outlet. When placed behind furniture this can be an issue because it increases the cleaner e needed between furniture and the wall. A down-facing outlet might work better in behind-furniture installs.Apple HomeKit integration is fast and easy and the units seem to be very good in staying connected. I am pleased with this item and would buy it again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"There's better products out there for the price.","reviewDescription":"Purchased these for some lamps to add phone and automation control. The setup process required a seperate app than the just HomeKit and I was finicky to pair even in the native app. HomeKit was even harder and I was not successfully able to get both plugs to pair or recognize in HomeKit even with TP-Link support. A return for me.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"Not reliable","reviewDescription":"The matter protocol is highly unreliable. I have tried several brands and the only one that seems to work is Eve. Could not maintain connectivity with those smart plug (not even with its own app). The reason is not the WiFi but really the protocol which is not yet properly done","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Does not stay configured; requires un-plugging and restarting","reviewDescription":"I want to use these on an outlet that is behind furniture and hard to access. I don't want to have to manually intervene once plugged in and configured. That has not been true for this smart plug. I have to physically access and power cycle it after 2 or 3 weeks of use.I have updated to Firmware version 1.1.0 (230920) with no better results.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Not great Apple Home support","reviewDescription":"I got this model so I could it directly with Apple HomeKit because I didn't want to install a third party control app, create an account, connect the apps, etc. Out of the box, the plugs wouldn't connect in the Apple Home app. Updating the firmware fixed the issue but to do that, I had to install the Tapo app, create a TP-Link account add the plug in the Tapo app first.After updating, it connects in Apple Home but it's buggy. I can turn it on but it's on\/off state doesn't sync with the app very reliably, so sometimes I can't turn it back off. But if I test an automation that turns it off, it works regardless of what the app thinks the plugs status is.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"I don't recommend this product","reviewDescription":"We already use several smart plugs but needed a high capacity one. Unfortunately Tapo app constantly had offline issues. To troubleshoot if it was my wifi i bought BN-Link high capacity plug to compare and I've had no problems whatsoever with the BN-Lnk smart app going offline and it handles the high demand perfectly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Very finicky","reviewDescription":"They work great when they stay connected to the network. But I have 4 of these and they are constantly disconnecting from the nextwork and show as unreachable. I have to unplug them and some times that doesn’t work so I have to completely reset them and do the whole setup again. Will be looking for an alternative.Update: Total garbage. Still disconnecting every few days. Now it won’t even connect to my network at all. Would not recommend. I’ve used other smart plugs with no issue but I liked the design of these so gave them a try. These are not good. Will try the Amazon branded smart plug and see how I do with those.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1651363200000}
{"reviewTitle":"1 works, 1 doesn't","reviewDescription":"Well, fiddled with one for 10 minutes to find out it was DOA. The other one connected to homekit within 5 minutes and is working great. Was on hold with TP link for 20mins then they hung up, customer support is bad..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"First impression... Can't set it up, APP doesn't work.","reviewDescription":"Chatted with TP-Link Tech support, typical request to uninstall\/reinstall (It was just installed fresh already)Same issue, then wants me to try another phone device (???), but I'm done already, all my other smartlife, broadlink, and Alexa apps work fine with all my 30+ smart devices, why waste my time with anther app that isn't fully working.  Gonna have to send them back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674086400000}
{"reviewTitle":"Good product.","reviewDescription":"Works great after you can get it synced.It’s a process to get it synced up.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Works with Alexa and lights.","reviewDescription":"Product worked fine. However did not need for purpose intended.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1596240000000}
{"reviewTitle":"Nice Plug","reviewDescription":"Need to download  another app to use with Alexa. After that works great","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578700800000}
{"reviewTitle":"Works","reviewDescription":"Took around 20 attempts to get it to connect to my galaxy 10.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Great","reviewDescription":"It’s good now I can see to get in my room at night","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1579651200000}
{"reviewTitle":"Good product","reviewDescription":"Good product just didn’t work for my purpose","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1594771200000}
{"reviewTitle":"Will have to download a separate app to work with echo","reviewDescription":"Works good didn't like downloading a separate app to work with echo.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1578700800000}
{"reviewTitle":"Works great with Alexa","reviewDescription":"Works perfectly with Alexa and in a remote area of our home.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1576281600000}
{"reviewTitle":"Easy to set up","reviewDescription":"Use it for a lamp in the living room","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1583798400000}
{"reviewTitle":"Great Smartplug","reviewDescription":"Fantastic device. Connects easy and works very well. No issues.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1581292800000}
{"reviewTitle":"Havin't a clue how to use it. My fault and problem.","reviewDescription":"I haven't figured out how to use it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578096000000}
{"reviewTitle":"Not as good as WEMO.","reviewDescription":"Could not get it to work with Alexa.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578096000000}
{"reviewTitle":"Connection issues","reviewDescription":"Wanted connect","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1596499200000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Couldn’t get to work, waste of money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578355200000}
{"reviewTitle":"Bad","reviewDescription":"Can't get it to work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580342400000}
{"reviewTitle":"Too complicated instalation.","reviewDescription":"Could not get to work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578960000000}
{"reviewTitle":"Item returned","reviewDescription":"Item returned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580601600000}
{"reviewTitle":"Sent Back","reviewDescription":"Not what expected","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580169600000}
{"reviewTitle":"Won’t connect","reviewDescription":"WiFi won’t connect","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1577664000000}
{"reviewTitle":"Not worth having yet another account and app on my phone for a one-off event","reviewDescription":"I did manage to get it up and running - time consuming but not difficult.  I have an aging smart phone that I use as a burner.  No data, just wifi. So that's a plus.So to turn a light on and off with Alexa was sort of fun.  Reminds me of the old \"clappers\".  But what I didn't like outweighed the sale price I paid:1.  I had to download another single-purpose app to my phone that I use only as a burner phone to install single-use apps.  There should be a Fire tablet or amazon compatible app if the device is claimed to be useable with the Amazon ecosystem.2.  I had to set up another account with a new company for a single device.3.  I had to merge that third party account into my Amazon account.Most of this was nothing too much different than the Blink camera I tried.  I just have no use for a plethora of apps and accounts to run a lamp, a camera, a speaker.....  My wired surveillance system required zero accounts and I did the wiring myself.  There's something to be said for analog.The bright spot is that I got it just before Christmas and can always put it in the Dirty Santa basket.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1606003200000}
{"reviewTitle":"Im sure a good plug but im sticking with the Amazon  plug","reviewDescription":"I bought these because I thought they would work with my Alexa without a problem, and if I had more technologist understanding and abilities and skills then I probably could’ve made it work for me I’m sticking with the Amazon plugs.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1589068800000}
{"reviewTitle":"Poor setup instructions","reviewDescription":"The Kasa Smart Plug Mini device works fine. But the instructions to install and configure with the Kasa Smart app are totally inadequate (on paper and from the app).  I had to reach out to Kasa (tp-link) tech support and they were very helpful.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1574726400000}
{"reviewTitle":"I am not the best evau","reviewDescription":"Did not work with echo dot. Wanted a connection\/download to ?connect? Directions. I could not find them.To fully disclose I am not good with computers or tablets. More like a rank of F to D.So I need it in the LCD.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580256000000}
{"reviewTitle":"Works for a while","reviewDescription":"I bought these in 2019. In the beginning they worked flawlessly. Now they work only 50% of the time with Alexa. Something this expensive should maintain quality performance. Not ready for Prime Time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1601856000000}
{"reviewTitle":"This one may disconnect","reviewDescription":"Disconnects often for days without being able to get it back online.I have 2 different plugs & this one always gives me problems","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623196800000}
{"reviewTitle":"5g wi fi","reviewDescription":"It is not compatible with 5G wi- fi I could not set it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637280000000}
{"reviewTitle":"Defective plug.","reviewDescription":"this plug did not work from the first day it was received.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636416000000}
{"reviewTitle":"Meh","reviewDescription":"I liked this when I first bought it but it has failed many times when I needed it to work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623628800000}
{"reviewTitle":"What’s the point?","reviewDescription":"I don’t get what’s special about this. What am I supposed to do with it besides using at as a plug? Seems wasteful. I don’t know.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1599868800000}
{"reviewTitle":"Works most of the time.","reviewDescription":"Alexa has trouble co trolling the device sometimes she cant fully turn off the lamps and only dims them. Sometimes they dont come on after she acknowledges the command.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582848000000}
{"reviewTitle":"Stopped Working","reviewDescription":"Initially, I had four that all seemed to be working fine, but then two of them stopped working after less than a year. They just wouldn't come on, and I can't get them set up again. I have two working, so I know that I'm doing it correctly. The IP shows up, but nothing can connect (Kasa App, Alexa app, Home app...)","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671062400000}
{"reviewTitle":"kasa","reviewDescription":"the first time i used it on my christmas tree it was great but this year i go to use it with my alexa like last year and i will not sync with alexa i even had called the tech they were so nice but they could not get it to do it either so i had to shut it off via the kasa app not my alexa so for this reason i will not buy this again :(","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1641081600000}
{"reviewTitle":"Nice remote control but NOT smart complaint","reviewDescription":"I purchased this on a whim because Amazon had them on sale for $.99. I overpaid. It works great if you want to use your smart phone as a remote control but neither Amazon nor Google can find it for voice control. Glad I didn't spend more but I'm sure the sale is over by the time you read this hopefully I'll save you some money.","isVerified":false,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1605312000000}
{"reviewTitle":"Sto working after a while","reviewDescription":"Stop working after a while and unable toUpdate","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671926400000}
{"reviewTitle":"2 of 4 Died","reviewDescription":"2 of 4 died after power fluctuations and short outages by the local power company.  All 4 are connected to power surges and now the 2 can't connect to wi-fi.  Looking for better alternatives again.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652486400000}
{"reviewTitle":"Not compatible with smart life","reviewDescription":"I was disappointed this doesn’t work with Smartlife and you have to download a separate app for it. Which just makes it inconvenient because everything else in my house is on the smart life app","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1608595200000}
{"reviewTitle":"Almost impossible to interface with wi-fi.","reviewDescription":"This may be a great little plug-in but after 3 hours of working with it I just gave up. Forget about any instructions or being easy to get started. Alexa never did recognize that the plug was on line.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1612569600000}
{"reviewTitle":"Difficult to pair","reviewDescription":"Very difficult to pair. Can only get it to work with app and not Alexa. 2nd one just won't connect.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"Do not buy","reviewDescription":"Could not get it to work","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625184000000}
{"reviewTitle":"Wouldn't connect to any of my alexa units, old or new","reviewDescription":"Could never get connected to any of my alexa units.  Old or new.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614556800000}
{"reviewTitle":"Hard to install, back in the box","reviewDescription":"Could not be recognized by my Alexa","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619740800000}
{"reviewTitle":"Haven't got it to work","reviewDescription":"I've never now it to work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619395200000}
{"reviewTitle":"Problemático","reviewDescription":"Todavía no encuentro como conectarlo a Alexa ni cómo funciona.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1593993600000}
{"reviewTitle":"Smart Plug","reviewDescription":"Stopped working, would not turn on the lamp that was plugged into it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1583452800000}
{"reviewTitle":"Does not support 5G wireless...what year is this?","reviewDescription":"Who makes a product that doesnt support 5G wireless? Its 2019 get your act together","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1575763200000}
{"reviewTitle":"Don’t buy.","reviewDescription":"Don't buy unless you have a new android phone, required android version not listed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579046400000}
{"reviewTitle":"No 5g support","reviewDescription":"Device won't connect to 5g WiFi so pretty I can't use it. Very Frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577577600000}
{"reviewTitle":"Worst setup\/app ever...","reviewDescription":"Setting this up I almost threw it out a window.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1591401600000}
{"reviewTitle":"Sad","reviewDescription":"Stopped working in 6 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1596240000000}
{"reviewTitle":"Annoying yo","reviewDescription":"It takes too long or will not connect to Alexa.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578182400000}
{"reviewTitle":"Failing to maintain connection to wifi","reviewDescription":"When it works it works like a charm. However, now it does not keep its connection to Wi-Fi: need to replug it almost every three days. Very disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Save your money if using with alexa.","reviewDescription":"This is NOT the alexa outlet. I ordered three combos over christmas break and two came with this and one came with the real alexa outlet. This was a pain in the neck to connect to alexa and the alexa outlet gave us no difficulties. Spend the extra couple bucks and get the real alexa outlets. Dont buy this stupid thing. This hunk of junk requires you to download THEIR app before you can make it communicate with the echo dot. Absolutely not worth the effort if your goal is to combine everything onto alexa.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1579564800000}
{"reviewTitle":"Could not get this product to sync with Alex","reviewDescription":"cust serv claimed to be experts tried to have me download app to fix...support person said I was the problem because he was trained to explain how to make this work...after several tries and time-wasting I elected to not use the product...I had prev bought a smart plug from amazon that was already set to mate with alexa...basically plug-in the socket and it worked within 1min...  Why waste time buying from a sellar who is not selling already integrated parts","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613433600000}
{"reviewTitle":"Keeps losing connection according to Alexa","reviewDescription":"I have it setup with Alexa but it works half the time. I have Alexa turn my christmas lights on and off but half the time she says \"Christmas lights is currently offline. Check the wifi signal or make sure it is powered.\" I also have the Amazon brand smart plug and it's never given me problems. This Kasa smart plug is problematic. I'm not he only one that has this issue. My friend also has the same issue.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608595200000}
{"reviewTitle":"Not great.  Avoid.","reviewDescription":"Setup was easy enough, but you have to install the Kasa app - it doesn't work directly through the Alexa app.The main issue is that when it's on the plug cycles itself off and then instantly back on at random intervals.  Not a big deal if it's plugged into a lamp, but that could mess it things up if you had it connected to a coffee maker or something running a timed cycle that resets when the power cycles.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1582934400000}
{"reviewTitle":"When they work it is great, when the fail toss them","reviewDescription":"If they drop off your network save yourself a headache of a doing loops in the app, toss it out.  The loop is, add item, can not find item, search for item..... repeat.  I think their secret goal is to have enough of a failure rate that enough units have to be replaced to keep up sales.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617408000000}
{"reviewTitle":"Couldn’t get it to work.","reviewDescription":"I couldn’t get it to work. I found my solution was a simple remote control \/ smart plug (found on Amazon)  is absolutely simple and doesn’t require you to install any app or use your any wifi . Now I can just click a remote to turn my lamp off remotely.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613088000000}
{"reviewTitle":"Meh. Not a Fan.","reviewDescription":"After 3 attempts of trying to connect this darn $10 plug through the Alexa app, I decided to return this item. In addition, I do not like it's bright red and blue flashing. I don't know if this stops when it is not connected, but I'm very sensitive to light when I sleep and this was disturbing.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1590364800000}
{"reviewTitle":"How it works!!","reviewDescription":"Came with no directions on how it is supposed to work.  Just to plug it in.  But it does nothing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649980800000}
{"reviewTitle":"Be Careful if You Want to Use with Amazon Alexa","reviewDescription":"Wasted several hours trying to get this to communicate with Amazon Alexa. Even held the phone\/app 3\" from the plug with no success. The \"Smart Plug Works\" product communicated automatically and you get 4 for about $25 rather than 1 for $16 and you'll save the headaches IMHO.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1584144000000}
{"reviewTitle":"Does not work with the Fire tablet\/Alexa install.","reviewDescription":"I had to return because it was not compatible with my fire tablet and I don't have a smart phone it requires.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607817600000}
{"reviewTitle":"Meh","reviewDescription":"I bought it, was on sale.. it’s in the box still I’ll likely give it away.. impulse buy and it isn’t amazon brand so I’m not downloading an app to use a plug.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1605398400000}
{"reviewTitle":"Privacy Network Issues","reviewDescription":"This Smart Plug is just okay with limited functionality. However, be aware there are extreme privacy issues with any TP-Link product and the data they gather from your network. The Belkin Wemo Smart Plug has extensive scheduling availability and no privacy issues.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1576368000000}
{"reviewTitle":"Not great","reviewDescription":"This really doesn’t work for us.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1581724800000}
{"reviewTitle":"There’s better stuff to use","reviewDescription":"Even as an advanced IT person, it is Not easy to setup. Not Amazon Alexa stuff.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607472000000}
{"reviewTitle":"Love Them!!","reviewDescription":"I had to replace my Wemo plugs that don't work anymore.  The TPLink app to run these is kept up to date. The setup was very easy and connecting to my voice assistant was simple as well.  I'm so happy with this product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"Love these!","reviewDescription":"No more fighting who has to get out of bed to flip the light switch.... \"Alexa turn off the light\"No more having to reach back in the awkward corner to plug in the Christmas Tree... \"Alexa turn on\/off the Christmas Tree\"No more having to run upstairs to plug in the Christmas lights on the hand rail... \"Alexa turn on\/off the Christmas lights\"No more having to toggle the light switch hidden behind the door in my office... \"Alexa turn on\/off the office light\"Alexa app could be a little smarter. You can set up a group in Kasa (such as Christmas) but the app isn't smart enough to recognize the group \"Alexa turn on\/off Christmas\" to turn on\/off the group. (This is available in the Kasa phone app)","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1575763200000}
{"reviewTitle":"We Love our Kasa Smart Plug!! Easy to install too!!","reviewDescription":"Love our Kasa plug!! Was simple to install!! First place I used was on our Christmas tree lights that before I would have to bend down behind and under the tree to search for light switch on our power strip! It’s been a regular saying in our house now to say “Alexa turn on Christmas Tree” Even my husband who still has a flip phone😜 loves the Kasa Plug!! Just need to buy 2 more for lamps in our house that I could program to come on before we get home in the dark or turn on from my phone!! I had bought the smart light bulbs too but still have not installed cause they are way too complicated to install.  The simple plug is the way to go!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1580860800000}
{"reviewTitle":"Reliable","reviewDescription":"Very good. I use it remotely turn on various devices around my home.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"a good product","reviewDescription":"came in a timely manner and does what the seller said it would do","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"The bomb","reviewDescription":"What a great simple solution for those things that do not have HomeKit support built in","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Excellent","reviewDescription":"Works instantly with HomeKit. Replaced my Koogeek plug.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"Nice Smart Plug for the money","reviewDescription":"This Smart Plug does everything you need it to do.  I bought this for $5 on a Amazon deal.  I always thought these were gimmicky items and never saw a need for one but I couldn't pass it up for the price.  Used it for first time for our Christmas Tree.  Its pretty convienet to just tell Alexa to turn off the lights to the Christmas Tree instead of having to get down on all fours and fumble with the hidden surge protector.  I like to hide all my cables and surge protectors so they are out of sight.  This allowed me to keep everything hidden.  For $5 dollars its not a bum deal","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1587600000000}
{"reviewTitle":"Take control of your lights","reviewDescription":"Let me tell you... this device; amongst other similar devices comes in handy! When I leave out of the state I can still control the settings and pretend as if I or another family member are still at home.So funny story... my daughter was on restriction and sometimes she likes to sneak and watch TV while I am not home. What did I do? I turned that light on with my phone and watched her (hidden cam in livingroom) get startled, jump up and turn that TV off and shoot straight to her room to get in bed. Lol.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1618876800000}
{"reviewTitle":"So far, my favorite Smart plug!","reviewDescription":"I’ve owned a lot of smart plugs over the years, and I think I can safely say this is the easiest to set up (took...maybe 2 mins...maybe less?) and has so far proven to be the most reliable.  It also has a very nice small footprint.  Why on earth anybody still uses Wemo smart plugs (bulky, unreliable, often decide they don’t want to be controlled by Alexa anymore -  “unresponsive”, and take a really long time...and a prayer... to set them up), is anyone’s guess. But I have finally given up on them, and will probably use this brand from now on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1611705600000}
{"reviewTitle":"worked then didnt","reviewDescription":"worked great for months then got new wifi and could never get to work again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625011200000}
{"reviewTitle":"Doesn't work right","reviewDescription":"We have had nothing but trouble with it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"Does not accept change","reviewDescription":"Originally this was great. Then we moved it to another room and the name change will not update on the Kasa app.  Will not purchase again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580860800000}
{"reviewTitle":"My wifi never would connect","reviewDescription":"My wifi never would connect","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637539200000}
{"reviewTitle":"Wasn’t aware the app and phone is required","reviewDescription":"To use device you have to download a few apps and talk to the app so your phone has to be near","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1582502400000}
{"reviewTitle":"Bought several still cant hook up !!","reviewDescription":"Very hard to install even with help. Directions poor and Not simple to follow, ☹","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1608249600000}
{"reviewTitle":"I Was there and happy that the plug would not connect.","reviewDescription":"I never could get it to work at all. It just did not want to connect no matter where I put it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1580515200000}
{"reviewTitle":"Device doesn't respond","reviewDescription":"Unable to use with  Alexa","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627776000000}
{"reviewTitle":"Did not work with Alexa","reviewDescription":"Could not connect to Alexa. This device does work with it's own app though. Not what I was looking for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1577404800000}
{"reviewTitle":"Stopped working after a month","reviewDescription":"The plug was easy to set up and worked really well for about a month. It stopped working randomly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1578355200000}
