{"reviewTitle":"Great for work lunch","reviewDescription":"Super cute and heats up well, easily portable for work. I put whatever I'm eating in the inner bowl with the lid and stick it in the fridge overnight. Then put it inside the crockpot part to take it to work the next day where I keep it on my table and plug it in around an hour before lunch break. I get a hot meal without having to go use the crappy breakroom microwave. The inner lid can be a little tricky and is just plastic which kind of threw me off, but so far it seems to work well and it easy to clean.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"20 oz crock pot portable food warmer","reviewDescription":"I recently bought the 20 oz. Crock-Pot portable warmer, and it has exceeded my expectations. This compact and versatile warmer is perfect for keeping my meals hot on the go. The size is ideal for single servings or small portions, and it fits easily into my bag or lunchbox. The variety of colors available is a nice touch, allowing me to choose one that suits my style. It heats evenly and maintains the temperature effectively, ensuring that my food stays warm throughout the day. The durable construction and easy-to-clean design are added bonuses. I highly recommend this portable warmer for anyone needing a reliable and stylish solution for keeping their meals hot and ready.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Amazing mini crock pot warmer","reviewDescription":"This mini crock pot has been absolutely amazing to use. The microwaves are crap at my work, since using this thing I've had a piping hot meal every single day. I found with the microwave at my work the top would be super hot and bottom still cold as if it came out of the fridge. When using this the food is hot from top to bottom. The bowl size looks small but it's really deceiving, I'm a bigger guy (230lbs) and the portion size is perfect. The lid to seal the bowl seals really well, but it is easy to think you screwed it on properly and it isn't, you know that it's not on properly when you go to heat it up, then maybe 30 minutes in the lid pops off and makes a pretty loud noise, but no big deal, I screw it back on properly and it continues to go to work. The light on the exterior of the pot is nice so that you know it's on and working. I would say to get the food to it's hottest point you gotta leave it plugged in for about 2 hours. But I've found 1.5 hours heats it to about 90% which is still good enough. Washing the bowl is a little tough once the pot is off it gets cold pretty quickly, I'd say in 10-15 minutes, if you don't wash it right away the food will get hard and stick to the side of the bowl, and it can be a hassle to remove, but not impossible by any means, just need some elbow grease. Other then that I have no complaints with it, I absolutely love it and it's been a game changer for work lunches. Definitely recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"150 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Great for artistic swimming knox","reviewDescription":"I got this to keep knox warm for my daughter's artistic swimming team. This does not disappoint! The knox stays hot, clump free, and is easy to apply. The only downside is that it's really hot so we have to be careful when applying. I will never go back to making knox without the crockpot!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Handy and easy to clean","reviewDescription":"This little Crock Pot lunch box is so handy for heating left overs or canned soups.  Use it only for heating.  It does not reach a high enough temperature that uncooked foods will heat to an internal temperature of 165°F.  Because it is a lower temperature, food does not burn, and it cleans so easily.  I also like that I don't have to stand and watch over it.  It takes a while to heat the food, but i can do something else while I wait.  The cord is not too short.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1722124800000}
{"reviewTitle":"Perfect for a hot lunch at work","reviewDescription":"I plugged it in about 30 minutes before lunch and it heated it up perfectly. Definitely make sure you pop the streamer valve when you plug it in. I love the way it has a plug holder for the cord - super easy to transport . Nice, light and well made with a good handle. It won't close if you don't notch the hold with the tiny post (see picture). I made vegan butter chickpea (testing a recipe).","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1723593600000}
{"reviewTitle":"Worth the money!","reviewDescription":"I have had this little crockpot for over a year now and it is the best thing I have purchased from Amazon!  I do not like to use the breakroom microwave and this allows me to plug in my lunch when I get to work and it is hot at lunch time.  I have put everything in this from soup to pulled BBQ Beef. If I put anything besides soup in it, like leftover lasagna or BBQ beef then I add a little water for moisture and it comes out perfect!  Reheating rice is amazing - the microwave dries it out but this little crockpot creates steam which keeps it moist.  There is no smell until I take the lid off.  I have so many compliments from others in my office that I have no doubt that I have sold a few more for Amazon....I should get a commission!I do have one design improvement.  The power cord is meant to be rolled up on the bottom and stored under the crockpot.  I do not know why but after a few months it is too lose.  It won't stay attached and falls off when I pick up the crock pot.  Better clips or a retractable cord or something would be better!I highly recommend this little pot!  I bought for my daughter who is an athletic trainer and she loves it as well.  She can take her dinner and during half-time or practices she has a hot meal to eat without needing a microwave.","isVerified":true,"ratingScore":5,"reviewReaction":"22 people found this helpful","country":"United States","date":1718928000000}
{"reviewTitle":"Impressive!!","reviewDescription":"I've had my little Crock-Pot in my office for a little over a year now and I have grown to love it more every time I use it. While my colleagues are going out for lunch and spending $12 to $15 for a sandwich for lunch, I'm sitting in my office having a hot lunch for a fraction of the cost. Today I heated spaghetti sauce and frozen meatballs, prepared my pasta in the microwave and by lunch time, while they're all gone searching out sandwiches, I'm eating a hot lunch of spaghetti and meatballs. Tomorrow I'm making shrimp, green beans, coconut milk and I'll have that over rice. I am so impressed by what this little Crock-Pot can do. I chose the blush pink. The only problem I'm having is getting the inner lid off after my food is hot. I'm sure it's me and not the machine. However I do have a hard time getting it off. For me it's extremely hard to twist off. I don't actually see any threads as to how the lid seals. It does seem to twist on, but I can't untwist it to remove it. That does not stop me from using it nearly every day. I live in the North and it's wonderful in the winter months not to have to travel out during lunch time in search of food. I prepare at home, the night before and have a nice hot meal without having to go into the snow, looking for an expensive sandwich or cold lunch. I recommend you get one, or two... your family said it's okay","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1721779200000}
{"reviewTitle":"Best lunch accessory","reviewDescription":"This has helped me so much in not eating out for lunch. I always want quick and easy, but also hate some of my food reheated in the microwave.This is the perfect size to take for lunch, no spill in the car. I can plug it in while I finish my morning appointments and it’s ready for when I want to eat. Highly recommend if you are trying to stay in a budget or keep from eating out but still want hot good food. Works good with meal prep as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Saves me a Ton of money!","reviewDescription":"I have been using a \"Lunch\" crock pot for about 5 yrs.  Prior to that I would spend at least $15 per day for lunch on foods that were expensive and not good for me. Now some may complain about price of this pot but compared to buying lunch working in downtown Manhattan, N.Y. its chump change! Over the last 5 yrs I have saved a ton of money average $15 per day x's 20 days per month which is $300 x 12 months =  $3600 x5yrs came out to $18000.  Yay!  😁🤑","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"I love\/loved my older model, this newer version is terrible and I do not recommend it","reviewDescription":"This is a terrible replacement for my previous model and I deeply regret purchasing it. I regret even more that I was so busy I didn't test out the replacement till the return period had closed. I was ok with replacing my older verion when it was getting worn out, especially because I thought \"oh good, I can still use the old pot\/liner in the new device so I have a backup and can pre-pack 2 lunches at once\".WRONG. I was wrong, the new one is awful. And not just that- it's pretty obvious to me that this new items was deliberately designed to make it impossible for me to use the older pot\/liner with the new device.The new thing has a pin sticking up from the rim, and the new pot insert has a little hole for that pin. The old pot cannot be used because it doesn't have that hole in it. (Though I can use the new pot with the old heater, since the pin\/hole doesn't appear to do anything at all but cause a problem, so the machine works fine without it.) And the pin sucks even with the pot it was designed for. Both models of this item I own have hotspots in them (which is pretty common for electronics in this price range, so I coped). To balance that out, I'd spin the inner pot in the middle of the heating cycle to try to keep the heat even and prevent scorching. It took like 2 seconds and didn't require me to make contact with the food. I can't do that anymore, I have to open the lid and stir with a spoon\/fork.Basically I wasted a chunk of money on a new item which is in EVERY WAY worse than the older model, and is deliberately worse. If you love your older model crockpot lunch heater, DO NOT expect this item to be as functional or useful. Here's hoping this review saves someone else the money and frustration I've wasted on this thing.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Very Cute But….","reviewDescription":"I really liked this crock pot lunch warmer. It is spacious. It takes a little while to actually heat the food which isn’t a problem. The reason why I give it three stars is because after the first use the color faded around the top of the bowl.My friend has the greenish one and hers was just fine. I don’t know if it’s this particular color that does that or the one I had was defective. The bowl is easy to use. It’s very easy to open. The lid seals nicely. There was no leakage. It’s lightweight. The outside doesn’t get hot so it won’t burn you while it’s heating. It is very safe to use. If it didn’t start peeling I would have kept it and gave it 5 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Hard to open","reviewDescription":"It certainly warms veggies quickly, but it's far too difficult to open in general and even harder once hot. There's a prong to keep the inner liner from turning but on the second use the encasement broke, making the prong useless. Trying to use the carrying handle didn't help as it's kinda flimsy and that popped out. There's no way to get a grip enough to open it when it's time to eat.I'm requesting a refund and going back to thermoses.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"The Pop scares me to death","reviewDescription":"I've used mini crockpot heaters for almost a decade now and they are progressively needing! I be replaced more often. This one is smaller than the one I used to get, but I can still fit lunch in it. The biggest issue is the lid makes a loud pop sound when heating. I'm not sure what's causing this but it scares me and makes me jump unexpectedly every time it happens.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"On the smaller side","reviewDescription":"This is absolutely adorable, but is smaller than I anticipated. I purchased as a gift and it's still in the box due to size and unsure what exactly to even put in it due to size. Love the idea of this though, just wish it was bigger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Loved it! Till it broke","reviewDescription":"It was great for the first 3 months and then it just stopped heating at all. The light would turn on and nothing would happen. Even tried multiple outlets. Would have given it 5 stars, but for almost $40 I expect it to last more than 3 months.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Too small","reviewDescription":"I didn’t realize that it was so small","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"take to long to heat it up","reviewDescription":"take too long to heat it up","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Caught fire at school","reviewDescription":"My daughter is autistic and won’t eat school lunches and also requires warm food. This was perfect until it caught fire in the classroom. The teacher said she left the room for two minutes. I’m so glad no one was hurt! This crockpot has always been plugged in by an adult. Very scary!","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Nice while it lasted","reviewDescription":"Very nifty and great for hot meals on the go. I gave it to my boyfriend for one of his Christmas gifts. He actually reads instructions haha. Used it a few times, then last week he went to eat his dinner, overnight 12 hr shift, and the main lid wouldn't come off, he said he tried everything and had to throw the whole thing away ☹️ it broke my heart my man was hungry all night.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Doesn't warm food","reviewDescription":"I bought this for work.  Due to personal reasons didn't get a chance to use it until now.  It Does NOT heat up food (soup) from a shelf stable box of soup.  Hence, it wasn't food that was cold from fridge it was straight out of the box of soup.I plugged it in as soon as I got to work at 6:30am...lunch at 1pm and soup was barely plateable or warm.If I could return, I would.  Waste of Money!!!Guess it will go in the donation bin or trash can as it doesn't warm up basic chicken noodle soup let alone try other foods.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Design flaw.","reviewDescription":"Use this every day at the office to warm my canned soup for lunch. I plug it in at 9 and the vegetables are soft by noon, but not melt in your mouth soft. It doesn't boil my soup. At any rate, there is a design flaw with this product that took me a while to figure out. Namely, the bowl is made of metal but the screw on lid to the bowl is made of plastic. The result of this is that the heat expands the plastic lid much more than the metal bowl thereby creating a tremendous seal by the expanded lid. It makes it very, very hard to unscrew the expanded lid while my soup is still warm. Before I realized what was happening, I had to carefully use pliers to unscrew the heat expanded lid. Not safe. Now I just lay the plastic lid on top of the metal bowl. Even then, it is sometimes still hard to get off due to it expanding more than the metal bowl. The concept is good but the design is flawed. I would not buy this product again.","isVerified":true,"ratingScore":1,"reviewReaction":"20 people found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Sliced fingers trying to open inner lid","reviewDescription":"The lid to the inner container is very difficult to screw on, and is almost impossible to remove after food is heated.  The metal pin doesn’t hold it in place, so you have to remove the (hot) inner container from the outer plastic one and struggle with it on your lap in the office when all you want is your lunch. I managed to get it open finally, but got deep cuts on my fingertips from something sharp inside the rim of the inner lid.  This is a cute item and I was happy to receive it as a Xmas gift, but my fingers bled thru 3 bandaids and all over my desk, so I’m not able to recommend this product.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"A Waste.","reviewDescription":"I used it one time, and it didn't work the second time. Unacceptable.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"I have a major issue with this item...","reviewDescription":"...I gave  5 stars for portion size, leak proof and easy to clean but overall only one star for a specific reason...after cooking the threaded top is so tight that you can't just spin it to release it...because the inner cylinder\/lining also spins requiring you to place pressure on the hot outside edge of the cylinder next to the top to hold it in place creating a burn issue...you either have to use some sort of a potholder or maybe a wadded paper towel to place pressure on the outside inner lining edge which is a poor design. I tried to lubricate it using olive oil but the top is simply too tight. Clearly a safety issue for burning your fingers. There should have been something to lock the inner cylinder\/lining in place to avoid the issue. I'm surprised to one mentioned this. As far as I'm concerned this is a serious product defect.","isVerified":true,"ratingScore":1,"reviewReaction":"33 people found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"I HATE that I'm giving this a one star review","reviewDescription":"I love this product. It's the perfect size, it's the perfect heat, it's perfectly convenient. The problem is that the plastic part with the metal post on the base spins around if you have to use even a little bit of force to untwist the lid from the pot - the agony of being hungry for lunch and not being able to access the food sitting right in front of me. I ordered a replacement, praying this was just a quality control issue. LO AND BEHOLD, I am now sitting here once again, hungry and unable to open my food because the plastic base just twists around and around as I try to twist the lid off.","isVerified":true,"ratingScore":1,"reviewReaction":"19 people found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Way too tiny","reviewDescription":"My latte wouldn’t even fit in this crock pot. Deceivingly tiny.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"wrong description","reviewDescription":"Crock-Pot Electric Lunch Box, Portable Food Warmer for Travel, Car, On-the-Go, 20-Ounce, Black Licorice | Keeps Food Warm & Spill-Free | Dishwasher-Safe | Gifts for Women, Mennot for travel or on the go,and I cant even buy a port for the car, selling on FB marketplace","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716249600000}
{"reviewTitle":"Inner lid is stuck, can't even open.","reviewDescription":"Crockpot is cute and I'm sure I'd really enjoy using it if I could just get the inner lid to come off.  The outer lid came off with no problem, but the inner lid that seals the food\/liquid inside absolutely will NOT budge.  Will have to return for a replacement, unless someone else had the same problem and can tell me how to remove the inner lid?","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Very small lunch box","reviewDescription":"This is a baby size lunch box. The lunch for an adult will not fit.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Fits right in the shop.","reviewDescription":"I like that it is small and portable. Love to toss mt soup, chilli or whatever else I want in it to warm up while I work. I don't have ti share the microwave and wait for the guys to get done. No fishy, pizza dinner for me. Deffinantly recommend this. It must be plugged in to be warm. Stays warm for maybe an hour after it's unplugged. Precooked what your making in it. Doesn't work like a normal crockpot.... not for cooking just warming.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Cute and Convenient","reviewDescription":"This is too cute and compact!Not the most quality\/heavy material but not the worst and cheap feeling. Threw in my leftover potatoes immediately, started cleaning, came back after 45 min and it felt like I microwaved them for about 4 min, piping hot. The lid locks nicely. Perfectly fits a can of soup or chili. All metal parts around the rim do get pretty hot.It’s my fav for lazy cooking, nothing too instant, love multi-tasking while warming up food.UPDATE: Been using this for about 5 months and I still use this nearly every day. I’m super forgetful and hitting the microwave over and over again gets annoying\/ruins the food. Also, everything's still in good shape. Handle is strong; sometimes I grip the handle go help twist the cap off and it’s pretty strong. Inner metal bowl looks the same. The outer silver paint scratched off a little bit but not too noticeable and on the exterior (I move it around A LOT btw). Probably one of my most used appliances rn, highly recommend! 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Works so well for blue collar worker","reviewDescription":"This little crockpot is so well made! I have bought my husband at least three of the cheaply made portable warmers here on amazon, and this Crockpot blows them out of the water. Its much more sealed, which causes less wear and tear over time, and means the unit doesn't smell bad\/burnt like the cheaper versions do.The size is smaller, so it doesn't fit huge lunches but its perfect for soups or curry [anything more liquid] and doesn't spill a drop! It heats evenly as well. Love this model and the affordability of it.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Works great at work!!!","reviewDescription":"I don't like sharing the community microwave at the office and this was a brilliant idea I had - to purchase this and heat my foods up at my desk where only my germs are on this cute crock-pot. The portion is perfect, not too much, not too little and it heats up pretty fast. I only wish maybe their next model will have a temperature setting.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"I LOVE THIS!!","reviewDescription":"It works awesome, and it's definitely worth the money.Things to consider:1. You can eat out of the metal container, but a metal utensil is like nails on a chalkboard.  I am looking for bamboo or reusable plastic options.2. Heating food for too long is a possibility, so you can't leave it on all morning.  3 hours was too long for a hefty serving of jambalaya.  (Mushy rice.)  2 hours was just right for a serving of homemade chili.I used a timer plug from IKEA to turn the cooker on two hours before lunch for my chili, and that worked perfectly.  I think the type and quantity of food you're reheating makes a difference in how long it takes, so experimentation may be needed.  It's worth the effort, though!  Fantastic little appliance!!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1704585600000}
{"reviewTitle":"Perfect lunch pail","reviewDescription":"I see clients in my office for the first six hours of the workday and that includes lunch.  This is so much better than a thermos for keeping soup hot!  Every single bite is hot, not matter if it’s soup or stew or spaghetti or chili or whatever!  Every bite is as hot as when it was first ready.  I used to take a bite or two, see the next person in line, then my food is cold.  Not anymore!  I’m so tempted to buy a few for home so we could enjoy hit food to the last bite.  The capacity is huge for even fairly thin broth.  Super stable on my busy desk. I’ve not idea how long it will last but my other Crock Pot is 32 years old so I’m pretty confident it’ll last.  Hope this helps you decide.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"Love this thing","reviewDescription":"I've only used this a few times but I love it so far! My office is in a yoga studio and there is no kitchen. I have a mini-fridge in my office and usually try to bring my lunch but don't have a way to heat anything up. So I either have to bring cold things like salads or sandwiches, or eat things like leftovers cold. I'm so excited to be able to have a hot lunch. This is so convenient and will save me money by not having to go out and grab something on my lunch break.Today I brought some leftover soup I had in the freezer.  I put it in the crock pot when I got to work and it was ready in about 2-3 hours. This gives me so many more options for my lunch. Another good thing is you won't smell the food odors like you would with a microwave. I am very happy I purchased this!","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"Blue collar boyfriend loves it!","reviewDescription":"Got this for my boyfriend (union electrician) and he loves it because it is a regular outlet plug in lunchbox. When he's on job sites he normally has to park far away from the building, so he doesn't have time to go get it out of his truck and let it charge in there. This one is perfect so he can plug it in in the break room and leave it there. Perfect portion size, love the steam release, nice color. He said the temperature it heats the food to is PERFECT!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Amazing!","reviewDescription":"I'm a teacher which means I have 30 minutes to eat lunch from the time my class walks out until the next one walks in (that is if they aren't picked up late or dropped off early). We aren't allowed to have microwaves in our rooms and even if I could my lunch usually takes at least 4 minutes to heat up and then I have to walk down the hall and not spill it. I was eating a small salad every day but now that it's colder, would like something hot once in a while. I got this crockpot, brought in cold soup, poured it in and plugged it in. When I opened it to eat lunch 3 hours later it was so hot I couldn't eat it!!! I used to use a thermos and my soup would barely be warm when I opened it. This is a total game changer!!! Worth every penny!","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"Keeps Food at the Perfect Temperature","reviewDescription":"The challenge with traditional crock pots is that they overcook what you put in them, even on the \"warm setting\".  In contrast, this machine is designed to keep food warm only, not to cook it.  This makes it the perfect container for merely keeping food warm, without overcooking it.  Crockpot should make larger versions of this appliance!  Of course, added benefits are the portability, leak proof, and easy to clean but the number one attribute, again, is being able to keep food warm, without cooking it to death!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Daughter used it maybe 2 times","reviewDescription":"Daughter used 2 times and the internal part separated from the base.  Would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Lid not easy to close","reviewDescription":"It’s such a cute product! However, the lids do not screw close easily. Getting a good seal is frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703808000000}
{"reviewTitle":"Not sure","reviewDescription":"Package box is open not sure if the product had been use or not will return it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701648000000}
{"reviewTitle":"Food taste like plastic","reviewDescription":"The rubber band of the inner lid doesn’t seem me a safe plastic for food. It changes the flavor of the food and caused me cough and throat irritation.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"A taught it was bigger","reviewDescription":"Dislike take too long heat up wasn't money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"I like this product it feels rugged and well built.","reviewDescription":"I gave it two stars because it is too small for a decent size food warmer. The other reason is it is pricey for it practical usage. I returned it but Amazon replaced it with same, and after speaking to customer service why the replacement they told me to keep it and I will be refunded since it was re-shipped without my consent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683590400000}
{"reviewTitle":"Container lid doesn't seal that well","reviewDescription":"After a couple weeks of use, the lid on the portable inner container started to twist past the threads instead of latching on tightly and was spilling food in my bag on my commute. The good news is that CrockPot still has good customer service and sent me a replacement product (different model) that works well.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"Disappointing size","reviewDescription":"Smaller than expected. I was nervous of the possibility of the crock pot being too big, however,  I was even more disappointed at tiny pot I received for almost $30. The size is Not worth the cost. It works perfectly with whatever type of food you choose to use it to keep warm.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684800000000}
{"reviewTitle":"Want to love it….","reviewDescription":"I want to love it but the inner lid that is supposed to seal, stopped sealing after only three uses. At first, it seemed perfect but the last time I ended up with soup all over my bag. I thought maybe I forgot to scare it on but nope…no longer screws tight. Big bummer.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Cute little pot, but impractical to use","reviewDescription":"I hesitated ordering this, and now wish I had not.  It takes much too long to heat the food; 45 minutes for lukewarm stew (?!)  Ridiculous; my dinner was an hour later than I planned. Ended up using a saucepan on the stove.Gimmicky item that isn't worth the money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675123200000}
{"reviewTitle":"Too small","reviewDescription":"Cannot fit anything that I like.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671667200000}
{"reviewTitle":"Sent the wrong color but love the product.","reviewDescription":"Works great.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673481600000}
{"reviewTitle":"Looked great but too small for my needs","reviewDescription":"Looked great but too small for my needs","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657756800000}
{"reviewTitle":"Poor construction","reviewDescription":"Lid broke less than three months after purchase, and the handle is very flimsy.It does heat food, but the poor construction is unacceptable.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Waste of money","reviewDescription":"It warms really well but since I first got it, the lid sticks. It doesn’t matter if the plug is up or down. It’s like it is warped. A co-worker mentioned having to pry her’s with a fork. Shouldn’t have to do that.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Mini crockpot","reviewDescription":"Certainly not as pink or rose gold as pictured. Clearly a cheap made product that I’d return if I didn’t tear the box up when I opened it","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Please redesign the threads, we want to like it!","reviewDescription":"We really wanted to like it, but ended up sending it back. The problem is the lid design. It has two lids. A threaded lid that screws down and a \"top\" lid that snaps into place. The threaded lid frequently pops off after it heats. At first we though it was user error and we were cross threading it when we screwed it down. But after multiple attempts, that's not the case. We'd tighten it down, look at it from the side to ensure it wasn't x-threaded and more often than not the lid would \"pop\" off quite loudly as it heated up. We found ourselves plugging it in earlier than we wanted to ensure it heated and wouldn't pop off after leaving. We'd come home several times to find the lid off and then you question whether or not the food is safe to eat. We just decided not to keep it. If the lid were redesigned we'd love to get another, but it actually popped off more than it didn't.We do love the portion size, the level of heating and the convenience...the lid was the dealbreaker.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"No es tan lindo","reviewDescription":"El color me gustó, pero si está como defectuoso para el costo. Lo compré porque me imaginé una mejor calidad","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"Mexico","date":1700092800000}
{"reviewTitle":"Muy pequeña","reviewDescription":"Muy pequeña","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"Mexico","date":1665532800000}
{"reviewTitle":"My personal Crock Pot.","reviewDescription":"I love my new crock Pot, it is just the right size for me, I can take soup, leftovers and so many other things to work and enjoy a hot meal instead a sandwich. It is easy to use and easy to clean. I bout it on sale and the price was right.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Love it!","reviewDescription":"This is a wonderful concept. I bought this so i could have soup in the winter time when it was cold. Plugged it in and in an hour and a half i had hot soup.  Great product. I told my friends and they bought some too.  Easy to clean and store away.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Crocpot lunch box","reviewDescription":"Great for RV visits","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Perfect chain wax pot","reviewDescription":"I needed a small crock pot to heat up the wax for my bicycle chains. This is the perfect size, heats the wax up fast, works very well.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"A must buy","reviewDescription":"For Christmas I purchased one for my wife and one for me. My wife was a little unsure but has come around to loving it. As a school teacher you never know what is going to happen at lunch time. There have been times when  I put it on at 9:00am and did not get to eat until 2:00 and it was not over cooked.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Easy to carry","reviewDescription":"I love the color and quality of this that you can bring anywhere.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Mini Crockpot","reviewDescription":"This is my second one of these little warmers. I use it for lunches and it works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Handy item","reviewDescription":"I got this after someone was using this that was working on our house. I have used it a couple times at work & it heats up perfectly. You do need to give yoursef time to heat up. The item I heated up took about 45 min.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721606400000}
{"reviewTitle":"Absolutely love love love","reviewDescription":"I love this product, does exactly what its supposed to do. It doesnt stink up a room with heated food smell. Its compact and adorable, the color is consistent, the texture is nice and smooth, matte so it doesnt look cheap at all. Theres only one temperature setting but i dont have an issue with that at all. I lost the cord to this and wasnt able to use it, i messaged crpckpot asking to buy a new one and they just sent me a free one. 10\/10 customer service. I even bought a second (a third?) to gift to my teacher friends to use in their classroom!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Worked perfectly","reviewDescription":"Was a gift for my boyfriend for his lunches at work. Works super well to heat up his food <3","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Cheaply made","reviewDescription":"Extremely small and cheaply made mostly plastic.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703635200000}
{"reviewTitle":"Damaged box","reviewDescription":"Box was damaged when recieved with a huge hole in the side.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Doesn't work","reviewDescription":"It doesn't heat the food.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"It's SUPER SUPER TINY!","reviewDescription":"The bowl is soooooo small.  Big enough to heat up cat food, not my food. Returned.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Broken.","reviewDescription":"Bought as a gift for my husband, when he opened it the handle was broken off 😔.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Not worth it","reviewDescription":"Both Lids are difficult to secure.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Not pink!","reviewDescription":"Calling this pink is laughable.  Tan at best maybe.  I trusted it was pink bc the box says it is.  Disappointed when my daughter opened it for her birthday (outside of return time frame).","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"Useless","reviewDescription":"It’s work great for 3 days!! Then just diside to NOT WORK!! Paid for NOTHING","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"DOESN'T WORK","reviewDescription":"Doesn't work, at all... I gave it to my hubby as a gift and he finally tried using it at work, sadly after Amazon's return window for it... And it didn't heat up at all... Crockpot is usually a reliable brand, so I wasn't worried about testing it right away...","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1671753600000}
{"reviewTitle":"Lid doesn’t screw on properly","reviewDescription":"The outer lid doesn’t screw on properly right out of the box. Is there any quality co tell checks before sending out this product? Disappointed, will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1696118400000}
{"reviewTitle":"Didn’t warm the food","reviewDescription":"Spent 30 minutes and the food was cold","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Item sucks!","reviewDescription":"Pros: None.Cons: This item is designed do only ONE thing (warm up food) and it failed miserably. Yes, it warms food but it shouldn’t take hours, it shouldn’t take more than 15 minutes. Also, all of a sudden, the top refused to screw on so I had no choice but to throw it away.Save your money. Bad purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1676937600000}
{"reviewTitle":"If you returned it, never going to get your money back!","reviewDescription":"Never buy from this store.  I bought a product in June 27. I returned in June 30.  To small for a hardworking man. It does not have electric connection for a car or a truck. Today October the 8,  I have not get my money back. The store has July, August, September and now October. Probably I am never going to see my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1665187200000}
{"reviewTitle":"Broken \/used\/not as advertised","reviewDescription":"Broken  looked used had grease stain on the outside and poorly packaged","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"This is NOT Stainless STEEL Its Aluminum","reviewDescription":"I did some research and the interior portion of the crock pot to hold the food is aluminum and not stainless steel. Cute but not cute enough to compromise my health and well-being. This product will be returned!!!","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"SO SLOW","reviewDescription":"Takes more than an hour to heat through something like pasta or pot roast. Pretty useless. Right now I plug it in an hour before my lunch period start, and its still cold in the middle. Wouldn't purchase again.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"The item arrived broken","reviewDescription":"This was to be a lunch pail, however arrived with a broken handle.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702425600000}
{"reviewTitle":"Not pink. Muddy brown color. Way too small","reviewDescription":"Well it wasn’t pink. It was an ugly muddy brown gray color. If it were pink as featured I would have maybe kept it but it’s too small. I never plugged it in. I just repackaged it and returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1688774400000}
{"reviewTitle":"Not for car use as it stated","reviewDescription":"It said use for car so I assumed it came with a car adapter and it does not  Very misleading","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1700956800000}
{"reviewTitle":"Incorrect wattage in description. NOT 1500 watts.","reviewDescription":"Description indicates this is 1500 watts, however the bottom of the crockpot indicates 50 Watts. After 2 hours, the crockpot heated to 130 degrees, and didn't get any hotter after 2 1\/2 hours. So it is being returned.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Great for lunches","reviewDescription":"Definitly worth it to heat up lunches. The inner container is removable for cleaning and seals well. Ill store it on its side with liquid in it and never had it leak.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Ready for lunch!","reviewDescription":"My man loves his crockpot! Plug in at work and your lunch is hot by noon. It seals up with lid and extra cover to protect from leaking. He has not had any problems whatsoever. No leaks or burned food. It heats evenly but do not use raw food as this is not meant to cook food .Great for leftovers and a nice change from deli meat sandwiches! Hot lunch is much healthier!Highly recommended","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"MY FAVORITE NEW GADGET!","reviewDescription":"I seriously LOVE my new mini crock pot.  At work, we have one microwave and many times, there's a line for heating up food, which cuts into your break time.  And I almost always eat soup or a hot dish, so I thought this was perfect for me.  It is.  No thought, just plug it in, and enjoy at break time. One of the other reviews before I purchased this said that it doesn't heat it too hot so that you have to wait for it to cool down.  I actually like my food that hot, but I found it is definitely hot enough to enjoy.  I also worried about the drier foods like rice burning, but it heats all food perfectly.  I have also put frozen prepared foods right in, and again, it is heated perfectly.  Negatives?  although 20 oz is a good size, I wish it were just a tad bigger. Like 24 oz. or so.  That would truly make  it perfect.  Also, once you heat the food, you cannot just twist the lid off. Even if you open the steam valve. I always had to pry it off with a spoon.  So now, when I plug it in to heat, I leave the lid open and just slightly off center on the pot.  No more issue.  If you are a lunch bringer, this is a game changer.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"Hot meals","reviewDescription":"I hot this fir my 16 yr old student because she complained that the school meals were bland and at time wouldn't eat because the taste was nasty and would rather wait to eat at home. So she asked if she could take cold lunch to school but I thought my kid should get a hot realtor. So saw this and used the brand as a kid when I was her age. Granted we only used the crackpot for making beans and soups. So I felt that I could trust the brand. I git it and when it arrived to my home it was easy to use. And she now takes hot meals to school. When she just has to remember to plug it in in class before lunch so she can have a hot meal. But she has no complaints. So neither do I.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"My coworkers are jealous","reviewDescription":"I use this every day at work. Being a follower of Ayurvedic traditions, it’s imperative that I keep my Agni\/digestive fire up. So having warm food instead of cold, dead food throughout my workday is paramount. And using a microwave and killing all the nutrients in my food is just not an option. So I’m so thankful for crockpot for making this cute little lunchbox.I had this as number one on my Christmas list and also got one for my niece who is a school teacher. And she absolutely loves having this at work. I can put my leftovers in an hour or so before I’m ready to eat just so they stay warm and not cook. It keeps the same temperature and it’s just devine. This is great for my digestive system by having warm nutritious foods at the ready. This is  making my Ayurvedic journey that much simpler","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Cute & practical","reviewDescription":"This mini slow cooker is the cutest & so convenient. It keeps the temperature very hot & it’s easy to take it anywhere like work. The quality of the design and function is great. Ideal for one serving.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Obsessed with this","reviewDescription":"I am a teacher and this is perfect for my lunches. I plug it in an hour before, and my lunch is hot and not overcooked. The inside comes out for easy cleaning in the dishwasher too. I use it almost every day.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Crockpot","reviewDescription":"Love using this for lunches!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Keeps lunch hot!","reviewDescription":"Bought for wife cause she only has 1\/2 hr for lunch so by the time she goes to break room heats up lunch she has 10 min to swallow lunch.  I felt bad she couldn't have a nice hot lunch, was going to buy a thermos type for her food but all review said only holds heat for 2-3 hrs and so you would have to heat up first then put in thermos in the morning.  This way she takes her little crockpot plugs it in when she gets to work at lunch has a HOT meal.  loved it so much she bought two for gifts for daughter and Sister who are both teachers like her and have no time for lunch.  they loved them 100%.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Love it","reviewDescription":"Gave as a gift for Christmas and they still love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Really impressive! (Just ordered a second!)","reviewDescription":"Update: I love this thing so much I'm ordering a second to take with me since this first one lives at work!  You can definitely forgo whatever metal this container is (they say it's stainless but it's a weird matte metal which FEELS like aluminum, but what do I know)-- I just use sealable oven safe glass 1- or 2-cup containers to transport soups and other food. The provided container does work to transport liquid, but it still terrifies me, so this option relieves me of worrying about it incessantly. That said, it's perfect for a roll on the bottom, then the 1c lipped glass above it.Everyone is right about the thread\/lid\/seal- simply when heating, unscrew the lid and just prop the outer lid back on if you feel so compelled. There really is no odor issue, to the point that I think it's not heating since I cannot ever detect any odors.I like my food REALLY hot, so I give it at least 1.5- 2h. And I don't bother stirring anything. Maybe I'll flip if I cram a roll or flat item in there. Makes a perfect bread\/roll warmer too.Also it IS annoying that you have to unplug it, but I'm considering plugging it into a strip with an on\/off switch.This second one I ordered will be the 'blush' model. I had no peeling\/melting issues w the black, but it seems that the pink and other colors are terrible with the color chipping\/peeling\/washing off. (But why are you washing the exterior?)For these reasons and cost I'm not giving it 5 stars, but I do love this thing and it has made my general life better by providing me effortless hot food working on a freezing winter day\/night. I'd give it a solid 4.25. Plus I bought this with gift cards and credit rewards points.First review:I'm REALLY impressed with this little thing! Something happened to the shipping on the first, so this was the replacement. I ordered it to my work, then had frozen my Thanksgiving dinner into the container (busy cooking all day, so was too stressed to eat it when it was all ready!), so today I brought it frozen, back to work. After about 5h transit back, I placed it into the exterior pot and plugged it in-it was still pretty frozen. When I returned to it hrs later (5-8p), it was perfect! (I had a little CP dipper which I loved and wanted to use for this purpose, but that didn't have a removable container.)I think this would have been ready much sooner, and now that I know this, I will check sooner!The only thing which bothers me is that I'm not sure what kind of plastic this is (PTFE? PFOA? BPA-free? Though the food doesn't touch it, it would be nice to not have to be concerned about fumes which would kill pet birds immediately.)It would also be nice if there were an on\/off button, but I'm not complaining!The size is, frankly, huge for the amount of food I would eat in one sitting, especially at work (20 oz?!???)-- I think I ate about 6, maybe 10 on a hungry\/busy day. But great for soups, I imagine. I'm going to try out something of that sort and update.The pot itself is much smaller than I expected, which is great since it's pretty inconspicuous. I'm not sure why there's a handle, since I'm not planning to carry it around like that.","isVerified":true,"ratingScore":4,"reviewReaction":"42 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Super cute and mostly does it's job","reviewDescription":"I was I'll so I went from the hospital into an acute rehab center. They refused to heat anything up for us. I love carrot ginger soup but with them refusing to heat it up, I was looking for something where I could heat up my own soup. This did the job but didn't really make the soup hot. Just a hotter lukewarm. It was hot enough that I could eat it but it could be hotter. I even put my soup on to hear the night before but it was still the same temp. If you want a truly hot meal, don't buy it. If your okay with it on the cooler side, than go nuts. It's cute, convenient and does the job. I took away one star because it doesn't get things super hot lime a real crockpot would.Make sure and twist the inside lid on strait or it will pop off during heating. You'll get the hang of it. Easy to wash and handle.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1724371200000}
{"reviewTitle":"La satisfacción de una comida caliente","reviewDescription":"Compré dos loncheras, una para mi hija y la otra para mí. Una rosada en el exterior, que sería para ella, y para mi la negra con verde biche. Resulta que la rosada trae un sistema, creo, menos moderno en la tapa interior de la ollita, esta se enrosca a la vez que entra a presión, y tiene una pequeña válvula. Es muy difícil desenroscar esa tapa interior y más cuando está caliente la lonchera, casi siento que podría romper el mango de la lonchera al intentar destapar el contenedor. En cambio, la negra con verde tiene un sistema distinto en su tapa interior, esta entra a presión en el recipiente y, al calentarse, se levanta sola, entonces es muy fácil, solo es quitar la tapa externa. También es más práctico el cable de la lonchera negra con verde ya que está conectado en la parte de abajo y se enrosca en la base. Tuve que coger la lonchera rosa y dar a mi hija la lonchera negra, para mí fue chistoso, en cambio mi hija se sintió un poco desilusionada. En general, en ambos casos me pareció excelente inversión, calientan bien y si, muy satisfactorio comer el almuerzo caliente como recién preparado.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722556800000}
{"reviewTitle":"Great product to bring to work","reviewDescription":"I use this travel sized crock pot for work, perfect for heating up leftovers or warming up soup.I guess the only reason why I dropped it to 4-stars was because there were a few times when I was warming up soup. The inner lid that seals the metal pot will sometimes get stuck and would take a bit of time to pop open. One time I was struggling for a few minutes to get it open that I had to really pull on the lid and some soup spilled on my clothes and that frustrated me for the rest of the day.But this crock pot heats up my food well, so when it comes to warming up food instead of using the company microwave, I would say I’m content with that.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"Bought for husband","reviewDescription":"Bought for husband's lunch. He plugs it at the office or in the truck with an adapter. So far no leaks and portion control is right for him since he is trying to lose weight. He packs soups or other items. I am deducting one star because it is not convenient to store the cable under the pot. It is hard to store and husband is very forgetful so i have to put the cable right on top so he won't foget it. Also some areas of the outside pot have started peeling even though i clean it with a mild spray and a rag. It is not a big deal since it is on the outside and it doesn't affect the performance of the pot or makes it unsafe because the inside is metal. So far happy with the pot after 6 months of use.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Crockpot lunch box","reviewDescription":"Get it for my wife who is a school teacher and after using at school she loves it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Nice color","reviewDescription":"Smaller than expected","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Excelente calidad","reviewDescription":"Miu buena calidad cumple las expectativas","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Seems great","reviewDescription":"Bought used off a seller and came without the directions although it came in the original box. I’ll update review as soon as I use it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Bought three:  one is defective","reviewDescription":"I bought three of these. They are very nice except that one is defective. With a one out of three defective rate, I am taking away a star. It still works, but it will not be as longAlso, it can be very difficult to take the lid off of these at times. There have been times. I didn’t think I was going to get it off at all without breaking the thing.Despite the above, it does heat up very hot to have a nice lunch at work. I can plug it in and have a moderately hot meal about 75 minutes later. If I return to my office 75 minutes after that for a total of 2 1\/2 hours it is blazing hot though not boiling. I have not checked it between the 75 and 150 minute mark due to my work schedule. Somewhere between there is what it takes to get food super hot as it had just come off the stove.Definitely a worthwhile purchase. There are just some quality control issues and they need to figure out a way to get the inner lid off better.Also, the instructions say that the outer lid is not dishwasher safe. This is weird. You should be able to put both the inner and outer lids in the dishwasher. It does not explain why you cannot do so that tells you to clean it by wiping it with a soft cloth. I only discovered this after one of them through the dishwasher a couple times","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Leaks all the time","reviewDescription":"I deeply regret this purchase. This thing leaks often, no matter how careful I am to make sure the lid is on correctly and the vent is closed. It barely warms the food at all and doesn't hold enough. The lid is nearly impossible to remove after it has been on for a while, which is very strange considering how easily the soup finds it way out, time after time.  DO NOT BUY!!!","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"This is NOT STAINLESS STEEL","reviewDescription":"This is not stainless steel and even if it is it’s of a very poor quality and looks more like aluminium or an alloy. I love the size and look of this however, I care about my health so I’m returning. There are like a million metals listed in the description but it would be helpful to name which is which instead of misleading the buying.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1705017600000}
{"reviewTitle":"Vacuum seals in contents","reviewDescription":"The first time I used it this week to heat a can of soup I couldn’t get it open to eat my lunch. The spoiled soup is still in there, and I can’t get to open to clean it out and return the item. When I continued to try to open the mini crock, the outer casing moved instead of the inner lid. Vent doesn’t release the vapor lock.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Does not work!","reviewDescription":"On first use, I followed the instructions in the manual, and it did not heat at all. The red light came on, and after nearly 2 hours, my food was not warmed AT ALL. Currently working with manufacturer to get this replaced.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Looks nice for the small portion but overpriced","reviewDescription":"Does not have any special features- no timer, no auto shut-off... Looks nice in the beginning, but clearly overpriced.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Doesn't stay hot.","reviewDescription":"I'm really disappointed why isn't there a chargeable cord for USB or a button to turn on without a cord? I turned on put my food in getting ready for work. Came out to lunch and my food was ice cold!!! My yeti would've kept my food hot for 24 hours. What the heck Crock Pot??? Great idea poor execution. Doesn't work without leaving it plugged like any other crock pot. So upset this one! The picture is deceptive!!!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Defective and dangerous!","reviewDescription":"I tested it by heating water in it, and after 30 minutes the entire unit was overheated and the sides bulged out, detaching the top metal ring from the body. Everything smelled like toxic melting plastic. It's a fire hazard and your food is likely contaminated with toxins.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Defective item","reviewDescription":"Product didn't work. And they didn't give me my full refund. Don't buy From them","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717113600000}
{"reviewTitle":"Overheats","reviewDescription":"Barely used and it overheats","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717891200000}
{"reviewTitle":"False advertising","reviewDescription":"Not portable at all requires a plug to even work and it's so small a literal microwave makes this obsolete.. only useful if you need barely a serving of something at soup temperature that has been premade before hand or you have a big container to refill constantly. They way oversold this plastic garbage.. portable my rear end","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Life saver","reviewDescription":"Having a hot breakfast when it's 40 degrees in the back room makes me happy😁","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Hot Hot Hot","reviewDescription":"As a nurse who is on the move and all over a 7 floor hospital all night, this is the best purchase I've made. I love it because it doesn't dry out my food. If I have to run to a code mid meal, I just put the cover back on, leave it plugged in and when I return, my food is still hot.  Microwave just cooks the food more and dries it out (if it's not soup) So far, no problems. Easy to clean and store.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"It's perfect","reviewDescription":"The look is beautiful and it does what I need for it to do","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Your food will stay hot","reviewDescription":"I love this so much. I use it at work and my food stays hot.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Fantastic!","reviewDescription":"This mini crockpot is fantastic! It doesn’t cook your food. It just makes it really hot. It’s convenient. I love everything about it.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"So handy","reviewDescription":"This is the perfect size to take your lunch to work or just a single person.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Excellent product","reviewDescription":"Exactly what the description stated. Excellent quality that is expected from crock pot. Can't wait to use this at work!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Crock pot lunch box is handy.","reviewDescription":"I have used this for taking soups, dips and pasta without and leaks or problems.  It is very handy.  Hope they will come out with one that is a little larger and has compartments.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Dad Loves It!","reviewDescription":"Got this for my dad on Christmas and he loves it! He works in the office and loves the convenience of the product due to it being light weight and easy to transport. He said it warms up his food quickly and it’s very simple to use!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"I will never be without one of these","reviewDescription":"I thought this was just a fad thing, but once I started using one, it was not. It heats my food to a perfect temperature and has never burned anything. I have piping hot meals without having to worry about microwaves. I am a teacher, and the 5 minutes it takes to get to the microwave, heat the food, and get back to eat it is enough to warrant buying this alone. I am also a big guy and eat significant portions. It holds plenty for me. I've had everything from soup to brisket in this thing over the years, and it heats them all perfectly. I've had my current one for about seven years, and I plan to order another one to keep on hand in case this one stops working.It is a little tricky to clean sometimes, but I just hand wash it every day. The inner lid doesn't stick like it used to, but it is 7 years old at this point. Still, you need to take care if you have some liquid.Overall, it was a great purchase, and I will continue to have one as long as I have lunches to heat up at work.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"color not the same as shown","reviewDescription":"when you order pink and get a taupe piece.. that is not even on the selection list!! no where near the color depicted and no instructions included with product info.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Used 3 times and it no longer heats up","reviewDescription":"Love the size and look hate that I only received three uses from it.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"Not great","reviewDescription":"Upon first opening, it looks junky. Just came in a plastic bag. Possibly used. You get what you pay for. Unfortunately it is made in China. Would probably have been better quality if it was made in the USA.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"Worked twice and has now stopped working","reviewDescription":"I'm highly disappointed in this product.  I was super excited about it. I have used it twice.  And now today, I brought food for it and it stopped working.  The light isn't lighting up and it is not heating.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"Replacement  exchange","reviewDescription":"I like the it , bring my lunch to work. The handle is broken and the light goes on and off","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Arrived DIRTY","reviewDescription":"Hugest disappointment! I received this crock pot used, food still on it and paint rubbed off of it on some areas. This color is so hard to find so I was beyond excited and waited over a week to get this. BEWARE!","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1670457600000}
{"reviewTitle":"Inner lid gets stuck","reviewDescription":"Inner lid is difficult to twist on and off, most of the time it gets stuck. Burn hazard if pot is hot then trying to get the lid off.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1690070400000}
{"reviewTitle":"Difficult","reviewDescription":"I cannot get the food container lid off!RETURNED‼️","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Arrived broken","reviewDescription":"I’ve been waiting for the blush to come back in stock. When it arrived the box was intact but when I opened the box, the handle was broke and little plastic pieces were all over the inside of the box. Such a bummer.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1668988800000}
{"reviewTitle":"Lid won't shut, cheap outer material","reviewDescription":"I couldn't use it because the outer lid won't screw on. It's just flimsy plastic. I'm returning this item.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"Too small","reviewDescription":"Too small for any meal","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1667260800000}
{"reviewTitle":"It is not what it looks like !!","reviewDescription":"The main and most important issue I have with this thing since day one is the the lid DOES NOT WORK PROPERLY ! It just spins but doesn’t tighten at all, I have to make sure I put a piece of tape to keep it secure from opening every time, which happened to me a few times and dropped all my food on the floor!!Oo and it definitely doesn’t look like the one they’re showing I the picture","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Broke after 3 uses","reviewDescription":"I can put the food in and get it hot, but can’t get the food out to eat it without two people holding it with hot its because the inside lid is defective and is so difficult to get off, the entire inner housing spins.  I used it about three times and Amazon won’t replace it.  Don’t buy this product, at least not from Amazon","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Never worked!","reviewDescription":"Very very disappointed, the warm light came on but it never heated up or got even slightly warm","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Can’t use to cook food","reviewDescription":"This is not just a small crock pot as we were led to believe by its name and appearance.  Instead, it can only “heat up” leftover food.  Microwaves are much more convenient than lugging this around, or, turning on hours before you need to eat.  Don’t waste your money like we did.","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Spare liners are no longer available","reviewDescription":"My first one was amazing, I bought enough liners to make lunch for a week. You can no longer buy the liners, which makes this product 100% less user friendly.","isVerified":false,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Do not buy","reviewDescription":"The inner pot is a BIG LIE.it is not stainless steel.Aluminum.It leaks into foods.They should be honest.  BIG scam.","isVerified":false,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Never warms my soups","reviewDescription":"This Never makes my soups warm! AFTER 40 minutes Very barely starting to get Slightly warm!","isVerified":false,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"I was absolutely in love until it stopped working","reviewDescription":"I absolutely love my crockpot! It was the perfect color. As a teacher it was very important to me to have hot food that I did not have to put in the microwave because we don’t have time. I came up with the perfect schedule so that I can heat my food up and my crockpot just stopped working on me. I take care of this thing because it is literally one of my favorite appliances. I am so distraught that it is not working anymore. I was just gifted this for Christmas and here we are three months and it will not heat at all. I wish it lasted longer!","isVerified":false,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Plastic inner lid, not good","reviewDescription":"I,wanted to love everything about this Lil crock pot but I just sold it at a garage sale for $5. When it's heating up your soup this plastic lid that isn't even bpa free is so hot that it's becomes soft and bendable easily. Plastic shouldn't be melted or heated like this. If they can change the material to something safer I'll buy another. But cute design, heats up soup well and doesn't leak or smell up the office. Love it when I had it. **change the plastic lid to a safer material!!","isVerified":false,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1660780800000}
{"reviewTitle":"Defective","reviewDescription":"Bought this for my friends birthday. She loved it but it has come apart and it has only been 30 days. Would’ve been great if it had been more solidly put together.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Not worth it.","reviewDescription":"This item is difficult to open especially when hot. It burns your food","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Amazing product, yet vastly overpriced for what it’s worth","reviewDescription":"This product is a very good product however it is totally overpriced. Bought as a Christmas gift for my mom on her request. She didn’t realize it was 70$. She thought it was less. The product works well but is certainly overpriced for the options. She actually wanted me to return since it seemed like a rip off. I did insist on her keeping it since she really wanted one for her work as they don’t have a microwave. However disappointing that pricing is so steep and did seem to waiver based on color?? Would love to leave a great review as all other aspects of the product are great, yet the price is just not what it’s worth.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Warm Food","reviewDescription":"Crockpot warmer works nicely for soup or leftovers.  However, after one use and washing with mild dish detergent the inside of the insert looks terribly discolored.  Also, I ordered the blush color and was disappointed to see that the rose gold is colored plastic not metal.  The rose gold plastic is wearing after one use.  Wouldn’t order this color again if I were to ever reorder.  So overall warms nicely, but faulty insert.","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"Orden incompleta","reviewDescription":"La olla llegó sin cable para poder calentar, tendré que retornar el producto,  xq eso debió llegar completo","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Disappointed","reviewDescription":"I have been waiting for over a year to order one but I finally did and it came out of the box with a broken valve and spots all over the metal lining. Needless to say, I'm disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"The pink one is faulty","reviewDescription":"Pretty disappointed it broke after just one use. Buyer beware the pink one seems to have issues.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Lid issues","reviewDescription":"At first I really loved this crockpot. It was small enough to carry with me and hide away at my desk. Lately I’ve been having issues with the lid that goes on top of the metal bowl. I LIGHTLY turned the lid to close up the container for it to heat up my lunch…I’ve not been able to get the lid off for TWO DAYS. It’s completely sealed shut and I can’t get it open. I’m not a weakling at all but I refuse to break my thumb to get it to open. I even tried to heat the crockpot up to loosen the rubber on the outer lining and it won’t budge. Be cautious when closing this little one.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1665014400000}
{"reviewTitle":"Lid VERY difficult to get on and off.","reviewDescription":"I love the way it heats. I love the handle for transporting. Then there’s the lid for the food container. Very difficult to get in but almost impossible to unscrew when you want to eat. Flawed design.  Beware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"Upsetting crock","reviewDescription":"I purchased this for my husband to take to work with lunch in it but it is not a lighter adapter only electric","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"AMAZING","reviewDescription":"OMG, I love this so much. I've been eyeing this for a while and my friend peer pressured me to get it. Food was so hot and not dried out. Cabbage, rice, and chicken; I added a little oil because I was afraid it would stick. My new favorite thing!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Love","reviewDescription":"This is the cutest thing ever and so convenient. It keeps food hot and doesn’t take up a lot of space. This is great for if you’re going to a picnic or packing food for kids when you go out. You don’t have to only bring cold foods anymore.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Convenient","reviewDescription":"This is great for work when I don’t have time to leave my office for lunch. I keep a can of soup for last minute lunches and use my warmer to heat it up. Tastes better too than microwaved food.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Works great!","reviewDescription":"I was hesitant to buy it, but I’m so glad I did! I put leftovers in it in the morning, plug it in when I get to work, and it’s perfectly heated by lunchtime. I even cut up frozen taquitos and put them in and they were still perfect!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Best mini crock pot ever","reviewDescription":"Absolutely best thing since sliced bread, perfect size for one,  first time I used it, I put in raw salmon, brown rice and miso soup, plugged it in the morning at work , and it was cooked perfectly, come lunchtime and you can eat it straight from the pot. I’m also from New Zealand, so if you are in New Zealand you will need a reputable adaptor, worth every penny !!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Love it","reviewDescription":"I use this almost dailyIt’s the perfect size for making a small batch of soup or just about anything else that you don’t want leftovers from","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"U can Carry this little Crock Pot on the go !","reviewDescription":"This lil Crock Pot is so Cute.. it's great to Carry to Work to heat your Lunch or use when Camping etc. I brought 2 one for my daughter to use at Work and one for myself when I go Camping with my Son and his family. I love this Crock Pot and so do my daughter the perfect Size for on the go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Little croc pot","reviewDescription":"If you have a big croc pot then you already know croc pots are the best I use it almost everyday for my lunch at work Iv gotten a couple as gifts for my family and friends and they love it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"My favorite purchase","reviewDescription":"Don’t use microwave so this comes in super handy. Heats fast and well. Easy to clean. Highly recommended!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Perfect size","reviewDescription":"I needed these for a dinner party for some warm dips.They worked out perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Love it","reviewDescription":"Bought this for my husband to take his lunches as he's on the road and hesting food is near impossible. Smaller than expected but work as intended..","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Best Gift Ever","reviewDescription":"Food is always warm and ready for me on the go!!! Everyone at the office is jealous of me!!! 😉","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Nice for lunches but...","reviewDescription":"When I first got this crockpot, I really liked it.  However, now the internal lid will not screw on tight.  Even though it is dishwasher safe, I have only ever hand washed it.  It feels like it starts to tighten but will immediately loosen up.  Almost like it's going on crooked.  However, it won't tighten up.  I fear this is causing it to not seal and isn't heating the food up very efficiently.  It's unfortunate because I really like this for heating up lunch as a teacher with a very short lunch time.","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1668729600000}
{"reviewTitle":"Good stuff, Menard.","reviewDescription":"Finally got to test it out at work this evening. Campbell's Chunky soup heats up in a little over 2 hours. Insert is aluminum, not surprising since aluminum transfers heat better than stainless steels, and is already stained from first use. Maybe the stain will disappear when washed in the dishwasher. Still had some leftover room from the max fill line with an 18.8 Oz can, insert capacity was 20 or so Oz, if I remember right. Does great at reheating soups or chili if you're in no real rush to eat.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1667779200000}
{"reviewTitle":"Convenient Lunch Warmer","reviewDescription":"This is the 2nd food warmer I purchased from Crock Pot. Their first model was slightly larger and easier to open. This new style is a bit more compact and the new colors look sleek. Overall, it’s a great product and works well to warm food. I turn the lunch warmer on 15 minutes before I eat to warm stir fry, chicken or veggies. To warm soup takes a little longer and I will allow it to warm 30 minutes. Food is always perfect temperature and not too hot.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1670198400000}
{"reviewTitle":"Best\/Most used purchase","reviewDescription":"My fiancé is always takes lunch to work but he’s a bit of a hardy eater so this lil thing has been PERFECT. Honestly this thing gets used about 4 times a week. Great for leftovers!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680912000000}
{"reviewTitle":"Very convenient!","reviewDescription":"I love this little crockpot and use it just about every day at work! The only reason I didn’t give it five stars is that the inner lid it doesn’t screw on tightly, but when you heat food up in it, it’s almost impossible to take that into a little off without prying it open with a fork or spoon! I do love that it heats up my lunch quickly without a microwave.  It takes only 20 minutes to heat up food.","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Does the job","reviewDescription":"It is small but perfect for a daily work lunch for soup. Generally leak proof, leaked once when I didn’t put the lid on correctly, so that was my fault. It heats up the soup nicely.  Very easy to clean. I wish they would come up with a container that doesn’t need a cord when using it at work and maybe could be charged when not in use when you are home, kinda like charging your cell phone. Just an idea.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1674172800000}
{"reviewTitle":"Cutest little crock pot","reviewDescription":"Love the item, however there was a extra plug missing, I assume it would be the cord to plug into the car.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"This is great, especially for teachers!","reviewDescription":"I am a teacher, so I bring my lunch to school everyday. I was tired of my food drying out in the microwave, so as I was looking for an alternative I found this! I plug it in during my prep time, and by lunch it’s ready to go! It makes my food taste much fresher that way. It’s one of my favorite products!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1677110400000}
{"reviewTitle":"No going to the breakroom!","reviewDescription":"Perfect little crockpot..  I just plug it in 30 minutes before my break and my lunch is ready 😋.  The colors, the size, the seal, and the self contained cord are all that makes it perfect.Note:  tablespoon for reference.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Me encanto","reviewDescription":"Calienta súper bien, es linda y tiene el tamaño perfecto para mi. Me encanta la opción del comportamiento para el cable cargador.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Perfect Office Gift","reviewDescription":"Got this for a coworker and my sister as a birthday gift, the both love it .perfect for winter hot lunches","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Just as described","reviewDescription":"So cute and perfect size for my lunch at work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Heats food up great!","reviewDescription":"I like my lunches hot and this did the job nicely. I plugged mine in 2 hours before I ate and it was the perfect temperature. Enough room in the compartment for my leftover dinner. Highly recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Hot lunch to go","reviewDescription":"Bought this little gem so I could have a hot lunch without having to use the disgusting microwave at work. I plugged it in when I got to work and at lunch time I had a hot meal ready. Love it.  🥰","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"Excellent","reviewDescription":"This is excellent!! Keeps food hot!! I purchased this for my daughter since she works long hours at the hospital it keeps her food very hot all day until she gets a chance to eat, I recommend this product wish I can give it 50 stars","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"If you’re a teacher, GET THIS","reviewDescription":"I got this for Christmas after having it on my wish list for a long time. I really underestimated how much I would like and use this!! I though…yeah I’ll use it to heat up soup…but no. I use it for everything I possibly can!!!I am a teacher and get 20 mins to use the bathroom and eat lunch. Not having to wait for a microwave to heat up my food has at least saved me ten minutes that I can actually spend EATING and not either waiting for my food to cook or to cool down, or having to stir or blah blah blah. I plug in my little pot and when it’s time for lunch, I can sit down and eat my food with no steps in between!  Not only do I not have to wait…but it’s actually the right temperature when I go to eat it! The microwave is always leaving my food not cooked enough, or cooked to much so that it’s blazing hot!! There’s usually no medium! With this little pot, my food is hot and ready to eat, but not so hot that it’s burning my mouth!  I don’t have to wait for it to cool down like I do with microwaved food.Whatever I have leftover from dinner, I pack in my little pot. The lid vacuum seals and is spill proof.  I have put Chinese leftovers in there, sloppy Joe, soup, rice, BBQ pulled chicken, noodles, etc. I’m constantly trying to figure out what I can cook for dinner that will heat up well in my pot. The only thing I have found that doesn’t work well is bread items, bc it gets too soggy. I feel silly being so passionate about a mini crock pot, but it’s actually that awesome. I’m buying as gifts for all my teacher friends!","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Hot food","reviewDescription":"The lunch box is small but big enough to hold a bowl of soup.  It's well made.  Easy to clean. Directions say not to put raw meat in it s it doesn't get hot enough to cook.  My food was hot at lunch and I put it in cold in the morning.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"It's just the right size.","reviewDescription":"I love the look, size and quality.  I am using it at work for the added convenience of heating\/cooking my food and not waiting for the microwave.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Great product!!!!!!","reviewDescription":"Great productPros keeps things very warm for a long period of time.ConsDo not attempt to lean it to the side with contents, it will spill out.But great product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"IT ONLY WARMS FOOD.","reviewDescription":"I should’ve read the description better because I thought it would cook food, but it only warms it up so it would be for taking it to work where there’s no microwave. The problem is it would take a while to warm it up. Not sure what the point of that is then?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Little Crock","reviewDescription":"Nice size for small portions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712707200000}
{"reviewTitle":"Cute","reviewDescription":"Stilling lunchbox, warms up fast within 15min at least. Not made to cook raw food FYI","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Good","reviewDescription":"So far this seems to be working just fine. Size was not what I expected but so far it’s good for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Easy use for lunch","reviewDescription":"I purchased this for taking my lunch to work. Works great, no complaints.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"One hour to reach 165 temperature","reviewDescription":"I placed approx 12 oz tap water that started at 66.4 degrees, and plugged in device. At 30 min it reached 130 degrees. At 45 min. It reached 157 degrees. At 60 min. water reached 166.5. It’s cute,  but it will take time to warm food, especially 20 oz which is its capacity.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Works great!!!","reviewDescription":"Love this unit.  Perfect for lunch on cold day.Only thing I would add is a second inner stainless container, so I don’t have to wash it every day","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"Muy conveniente!","reviewDescription":"Esta perfecta para el almuerzo, 2 horas nada más para el recalentado y a comer!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Nice for heating up soup","reviewDescription":"Nice little crockpot. It can be difficult to open but works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Doesn’t get very hot","reviewDescription":"I like my food piping hot. Unfortunately, mine doesn’t heat up food that hot. I’ll put soup in there for over an hour while I’m at work, and it doesn’t get as hot as I like it. Not sure if mine is defective bc my coworker says hers heats up very well. Love the portability though.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"It's REALLY small!!!","reviewDescription":"Yes, saw the pics, but you don't realize how small this really is.  Going to give it a try as I'm still working on losing a few more pounds, but it is really, really small.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Took a long time to heat","reviewDescription":"It was good size. It did take a long time to warm the food.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"could be better quality","reviewDescription":"cute color options, nice quality of life improvement as opposed to a microwave, and deceptively large inner bowl. however, the exterior could definitely be better quality, some of the exterior silver paint has chipped from just a couple uses in being brought to work for lunches. also- its not leak proof. soup leaked everywhere, on everything. would not recommend that aspect, adding liquids for travel will need to be packed separately and added when ready to actively plug in. the lids on this travel crockpot are not leakproof at all and was very disappointed with the unexpected mess caused.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"It won't cook your food","reviewDescription":"This was definitely one of those Tik Tok made me buy it moments, so I guess social media advertising works. The color of the green mini Crockpot was so nice and the whole aesthetic of this thing is appealing, but when I think of Crockpots I think \"slow cooker\". This thing doesn't cook, it can only warm food. So it's basically a small food warmer that is still slow. I wanted to use this to upgrade my office cooking, but I returned it instead. If it can't cook food why would I want to just keep a tiny amount of food warm for a long time? It's so much easier to microwave your chili the moment you want to eat it and enjoy nice hot food.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Smaller than it looks","reviewDescription":"I never used this. My fault I didn't measure what this holds. I was looking for something to keep Queso warm for a dinner. The max fill line is nearly to the edge of the metal insert. Stirring without spilling would be impossible. I would say max this really holds 16 oz of anything if you plan to stir.  This is more suitable for heating a single serving of soup to eat at work.  For that I think a coffee mug and microwave are a much better option. For me it is just too small to use for anything.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"More inserts!","reviewDescription":"I like the product, but without being able to buy additional inserts it limits its usefulness.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Not a crock!!","reviewDescription":"I purchased this, expecting to get a mini crock pot that I could use to make overnight oats. It is not a crock. There's a little metal pan liner. It may be fine for reheating leftovers for lunch, but that was not what I needed it for. Will be donating it. I suppose the pictures make it obvious, but silly me. Something from the Crock-Pot brand I expected to be a crock.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"The lid is very hard to put on...","reviewDescription":"I was so excited for this and finally being able to pack my husband hot food for lunch. It works well and he loves it but the lid is extremely hard to get on right. It's very frustrating when you are trying to pack food quickly in the morning. It seems like the lines are not matching up correctly or something. It does warm up quickly and the food has been great. Maybe it's just a design flaw?","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Cute one-person thermos","reviewDescription":"This is very cute and for one person. It is a thermos and not a cooker. Only meant for warming food. Do not over fill. Not dishwasher safe and copper-like paint is coming off with one hand wash.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Nice crockpot","reviewDescription":"Works well, if you place cold ziti in the pan, it will definitely take the full hour to heat. I recommend having your food room temperature when placing in unless it needs to be refrigerated when going to work. Having the food room temperature and then heat up your food would save you time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706400000000}
{"reviewTitle":"Perfect for cold days!","reviewDescription":"Warms up soup perfectly! It looks a bit small, but it's actually a good amount of soup. I bought one for myself and then one for a friend. She loves it too!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Microwave alternative","reviewDescription":"It's hard to get into the microwave at work with so many people vying for its use.  This little crockpot makes a nice alternative. I liked it so  much I bought one for a xmas gift too. It heats pretty well, although it doesn't get as hot as I like. It will be good for work.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"It works","reviewDescription":"It’s not 100% stainless steel. I did the magnetic test on my inside food container and only the top half have passed the test, the bottom did not.  My friend at work brig hers directly from the crockpot company and hers passed the magnetic test. I kept mine and just put parchment paper inside to protect my food. I noted after about a week use, the food heats up super fast. Love that! It does a good job.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1702684800000}
{"reviewTitle":"Perfect for teachers","reviewDescription":"I am a teacher and this has been wonderful to just throw something on to heat up before our lunch time. I love that it is done and ready when I want to sit down to eat and I don’t need to reheat anything. It is pretty quick at heating up and keeps things warm for a long time. It is small enough to carry around but definitely doesn’t fit in a lunch box if that is what you were expecting. Fits nice on a desk and doesn’t take up much room. It is easy to wipe down and clean. I love this and can’t wait to use it throughout the school year.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Review","reviewDescription":"After using it a few times it no longer works. The inside lid would get stuck after heating food (even after opening the vent). Now something is loose between the outside (plastic part) and the inner metal.I had really enjoyed using it and for the amount paid it should really last longer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Compact","reviewDescription":"I love the concept of this item. The inside comes out to be washed separately which is convenient. I did however, expect it to be a little bigger than it is it’s quite tiny. It could hold a bowl of soup but not much more. Perfect for a warm lunch. Perfect for melting chocolate","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Daughter Loves it!","reviewDescription":"This was a Gift ...Daughter was thrilled, she loved it, Would have loved it MORE if she had received the  Right Color ... I ordered the Pink ... Of course she was Happy Anyway, BUT I wasn't ... This is Not the first time recently that You can't seem to get my orders right.  I have ordered several of the Wool Dryer Balls recently and you can't seem to get the GRAY SHEEP right. They were ordered for a reason! I have recv'd Dinosaurs INSTEAD ... So they have became Gifts ... I checked my Orders and they were ordered correctly. Thank you for reading, I hope!  Thank You ,SJ","isVerified":true,"ratingScore":4,"reviewReaction":"12 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"I love this lunch box!","reviewDescription":"What I don’t love is the detachable cord. Twice I have gotten to work and forgot the cord. Kind of defeats the purpose.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"I Love This!","reviewDescription":"I have wanted something like this for so long! I love soup, its my favorite meal and I had always used thermoses to keep it warm, but as the day goes on it would still get cool. This keeps it the perfect temp without continuing the cooking. I have gotten so many compliments on it at work. My one big complaint is that the plastic lid gets stuck so easily and with the matte material on the outside, it can be a headache to get a good enough grip to get it open. Worth the hassle though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702684800000}
{"reviewTitle":"Small; Not for Quick Use","reviewDescription":"This product does not work well for me as it takes more than one hour to heat and prepare one package of ramen noodles. It is also really small.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"Bad Design","reviewDescription":"The stainless steel bowl does not have adequate threads to retain the lid. The very first time I brought it to work the lid fell off and leaked all over my bag.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Arrived Broken","reviewDescription":"This item arrived broken.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698364800000}
{"reviewTitle":"Was good for 2 days","reviewDescription":"Used for work lunches. Plugged in about 1hr before lunch. Stopped working after 2 days. Power light comes on but no heat. Wouldn't recommend","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Lid hard to open","reviewDescription":"I loved the look of this unit.  However, I couldn't open the lid to the container.  Otherwise, I would have kept it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"No","reviewDescription":"It takes forever to heat up.I’ve had it on for an hour and my soup is still cold","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Not easy to open","reviewDescription":"We are returning it after my wife couldn't open it several times.  It needs a better design so it does not get stuck.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1675987200000}
{"reviewTitle":"PINK IS NOT PINK","reviewDescription":"I ordered the pink color.  Be aware that the pink is not pink, it is a washed out tan\/brown!","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Size","reviewDescription":"This thing is big as the size of my hand. Looks more like a kids toy","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"No lo are","reviewDescription":"Para mi lonche pero. No me agrado es muy chico","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1690156800000}
{"reviewTitle":"Convenient and easy to use - if you can remove the lid","reviewDescription":"I love how quickly it heats up and with no food smell as that was a concern of mine.  What I wasn't expecting is how difficult getting the lid off would be.  I have average arm\/grip strength and struggle to open this product.  It's not hard enough to stop me from using it, but I did wonder if I was doing it wrong at first.Someone with arthritis, or \"weak hands\" will most likely not be able to open without assistance.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"Small but good quality","reviewDescription":"Takes time to heat up. Good for those who are on a diet ‘cause it’s quite small :)))","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Nice product","reviewDescription":"Bought this as a gift. Works well, I would recommend this product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Works for my purposes, heating up cat food","reviewDescription":"Yes, I bought this to heat up cat food. My cats eat organic cat food that comes frozen and I wanted a easy way to warm it up (not in microwave) to where it is not freezing cold for my cat to eat. Out of all the things I tried, this one works. However, my lid does not screw into metal insert bowl so it is probably defective...but for my purposes it doesn't matter to me. What I like is I can put cat food in it, turn it on, less than 5 minutes later it is warm to feed the cat (like in the natural) so it has saved me putting the food out 1\/2 hour before covered each time with it still somewhat cold at feeding time. This is easy to clean, easy to use. No temperature setting just plug in and it is on so there is not an on or off switch, no low \/ high setting. I could definitely see myself using it. Works for warming up cat food out of the refrigerator.","isVerified":true,"ratingScore":4,"reviewReaction":"58 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Great","reviewDescription":"It warms up your lunch and tastes better than the microwave. I wish the capacity was a bit bigger, but overall I'm glad to have it. So.far I have reheated soup and curry and I made oatmeal in it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Great Product! I just wish extra bowls were available..","reviewDescription":"This product absolutely rocks for those on the road with an AC outlet available in cab. It warms thawed lunch in less than 45m, slightly frozen lunch about 1h15m. The ONLY downfall is that extra and\/or replacement bowl inserts are not available?!?! WOW CrockPot is really missing a $ making opportunity here, I'd buy 1 extra and maybe 2. If a load of dishes isn't done every day I'd have a backup and wouldn't have to wash the same bowl everyday.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1705363200000}
{"reviewTitle":"Works well","reviewDescription":"I purchased this for taking lunch to work while our microwave is replaced.  Works well , it took about 1 hour to heat soup out of the refrigerator.  I like my soup real hot. If it had been at room temperature it would likely be faster.I gave it 4 stars for practicalities.  Unless you are having a soup or stew, I don't see the use for it. Mac n cheese  or mashed food also may work. Or a burrito bowl.Otherwise,  it worked well. But takes a time. I get 1\/2 hour for break. So if you forget to plug in ,your lunch will be done before you can eat.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Makes Lunch Warmer","reviewDescription":"This nifty electric lunch box turns lunchtime into a warm, spill-free culinary adventure, wherever you are! Imagine a portable, mini kitchen genie that heats up your meals in the car. Goodbye, cold spaghetti! And when you're done? Just pop the center bowl in the dishwasher. No scrubbing needed. This gadget is more than just a meal warmer; it's a statement of foodie independence. Flaunt your hot lunch style and make every meal a moment to savor, no matter where life takes you.The only wish I had for this was that it was like a large crockpot. This only heats it.","isVerified":true,"ratingScore":4,"reviewReaction":"34 people found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"Christmas gift and he hasn’t used it yet","reviewDescription":"The only thing I wish it had was a car charging port that came as an option with it. The person I gifted this to drives heavy machinery for his job and has to be able to have a car charging port end to even use it while at work.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"Works as it should. Light weight for easy carrying","reviewDescription":"Works great 👍 love how I don't have to zap my lunches.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Soup pan warmer","reviewDescription":"Love the color and nice product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Hard to open","reviewDescription":"I really like my little crock, I use it everyday for work. The only issue I have is when I try to open it. It's hot and very hard for me to turn and open. I have to get someone to help most days.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"The bowl size seems for little kid's meal","reviewDescription":"love the healthy idea but the bowl size is too small for adult & some part can’t go dishwasher.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"The Advertisement Shows Soup, Because That’s The Smartest Thing To Warm","reviewDescription":"This crockpot takes forever to warm up food. Although it does warm it up to a decent temperature, it takes about an hour to get there with typical foods such as rice, vegetables, chicken, potatoes, etc. So if you want to eat and know you’ll get hungry, plug in the pot an hour or more in advance because it won’t heat up in even under half.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Perfect size, easy to use & clean","reviewDescription":"Great. Easy to use. Like that it has a lid for travel. I also like it has a separate dish that pulls out, which makes it easy to clean. Great for parties, football games. This would make a great gift.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"It takes about an hour to heat food through","reviewDescription":"Love the convenience of bringing leftovers .to work for lunch.  It heats them up really well.  The only downside is that it takes about an hour to heat through.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"Cord doesn’t stay…","reviewDescription":"I bought this pot because I loved my old one, but wanted one that looked more stylish!!!  Well, I don’t like that the cord doesn’t stay in place. It seems like the cord is just a little bit too long to stay wrapped. So when the cord is wrapped around the pot it won’t sit flat.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Are use this portable crockpot when I travel!","reviewDescription":"I use this portable crockpot when I travel I use it in hotels and on cruises to heat up my leftover food. It’s low temperature and takes about an hour to heat up the food but I’m satisfied with it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"no on or off button","reviewDescription":"i LOVE this little thing! it saves me trips to the staff room microwave. i eat soup with my lunch. i’ll turn it on as soon as i get into the office and it’ll be hot by lunchtime. recently i started trying cup noodle in it and it warms it up perfectly!my only qualm is it not having an on and off button. i have it plugged into a surge protector so i can turn it on and off without unplugging it every time. hope in the future they make one with a on and off button and a timer.","isVerified":true,"ratingScore":4,"reviewReaction":"36 people found this helpful","country":"United States","date":1684972800000}
{"reviewTitle":"Glad I bought this","reviewDescription":"This thing is so simple yet so awesome. It literally just warms your food up overtime it’s nothing special but I legit hate microwaved food I don’t know why I just do and so when I get to work I plug this thing in with leftover soup or whatever and by the time I take lunch it is hot! I have yet to experiment with other foods but I’m excited to try. The only thing I wasn’t too impressed with is the cleaning. Food tends to get stuck underneath the Vent hole and after I think it’s clean I’ll wipe it and still see soup color so it definitely holds onto the food that’s the only thing. I would not recommend putting it in the dishwasher because that’s how they get warped and then no longer fit properly. Overall awesome little item!","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"Same issue with lid as others updated","reviewDescription":"Disappointed with this as some other reviews stated the inside lid after first use became loose and will not seal I had to call crockpot as Amazon did not have a replacement it’s been 2 weeks still waiting on them to replace it I mentioned they should check their reviews as this seems to be a known issues and they are like well we will report it but nothing I hope the replacement is better but I do not have high expectations update crockpot sent a new one they have completely changed the deign issue is not they have a top that snaps on and the only way to get it off is to touch hold the outer lid part that is hot it is now a safety hazard and very tight so does not come off easily I am so disappointed in this I called customer service they have not solution","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673308800000}
{"reviewTitle":"Disappointed","reviewDescription":"The size. I thought this was bigger and for so much money. Bought for my mom to get her meal warm... disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Dj","reviewDescription":"I can’t really say much about this. I have not used it yet, but it’s cute.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"Disappointed in Packaging and Size","reviewDescription":"I planned to have this Lunch Crock Pot as an item in a  fundraiser silent auction. I'm disappointed it is packaged in a brown box rather than in a box with pictures like you'd see in a store.  Also, it is much smaller than expected.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"It's ok...","reviewDescription":"My husband trued it but it doesn't heat up fast enough and it's an inconvenience to have to plug it in, would be better with a push button. Might return....","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Okay small","reviewDescription":"Smaller than I thought","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"It Was Delivered in a Branded box! WTH!?!","reviewDescription":"Gets 3 stars b\/c it arrived in a branded box, gave away the surprise as it was a gift.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702166400000}
{"reviewTitle":"Doesn't last long","reviewDescription":"Inner lid stopped catching on threads and locking in place after about 2 uses.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Insert Lid","reviewDescription":"I bought this and use one day and the insert lid was so tight that I have a hard time opening.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Brown not pink","reviewDescription":"I have the blue one which is pretty and i use it a lot. Decided to get a second one for my daughter. Its not pink, its actually a beige color. No pink at all. I will return for a black one.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1691193600000}
{"reviewTitle":"Best thing ever for introvert lunches!","reviewDescription":"Got leftovers? Need warm food but the microwave is in a room with other people? This thing is easily the BEST purchase I've made in years. Plug it in when I get to work and have warm food by lunch. It's easy to take just the insert home and wash each night.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Teacher approved","reviewDescription":"If you’re a teacher and lunch time is limited, buy this. You will not regret it! Easy to use, easy to clean and take back and forth to school. Just buy it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Awesome","reviewDescription":"This thing is awesome. Works so good. Real nice to have warm for when driving truck","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Great for Husbands Work Lunch","reviewDescription":"I bought this with the hope that my husband would start taking some at home meals to work with him and it did just that. He loves this little thing. Will plug right in to any outlet at the job site or into any converter in his truck. He loves to take frozen soups with him in the winter, so he plugs it in 30 min before his lunch break and it’s hot and ready by the time he needs it! Easy to clean, great size for proper portions, great quality and super easy to use!  Great buy! 100% recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Neat Little CrockPot","reviewDescription":"I got this for work, and it does what I need it to do: Warm up food.  You'll notice there is no buttons or settings, it's either on or off simply by plugging it in or unplugging it.It takes about 20-30 minutes to warm soup up to eating temp (165 or so).","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Perfect Gift","reviewDescription":"For this one I was unable to take a photo or video as it was a present for my sister and we do not live in the same country. Her words: “I am unable to take it to work for my lunch as it is not permitted, but I love it because when I go to the boat with the family we can bring it to reheat the food as we spend the whole day at the boat away from home”. She stated she loved the color - I knew she would! That’s why I picked the pink. She stated she tried it at home and it worked as expected to be able to reheat her food.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713139200000}
{"reviewTitle":"Genial","reviewDescription":"Sirve para mi hijo lleve su almuerzo calienta bien a veces es algo complejo que destape la tapa interna pero sirve para no permitir derrames","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Use this frequently to take leftovers to work for lunch","reviewDescription":"I've seen other nurses rave about this little Crockpot lunch pail as being perfect for warming up hot food from home instead of buying junk from the cafeteria or a fast food restaurant. I bought one as a Christmas gift for myself and I absolutely love it. This does NOT cook food like the big Crockpots, but it warms up previously cooked food very easily. I just plug it in when I get to work and then my food is perfectly warm by lunchtime. It's easy to clean - the food container part is completely removable from the unit and can be washed. The cord is detachable and rolls up under the entire unit for storage. I really can't recommend this little Crockpot enough.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1713225600000}
{"reviewTitle":"So Cute And Useful","reviewDescription":"I purchased this for my trips home every year on the train, I will pre make a couple of meals and freeze a few days before I leave and pack them in my padded lunch bag and heat them for dinner, food is so expensive for pre-made microwave garbage. I just hope no one around me complain about soup or a chicken dish heating up. I love the convince, ease and especially the color and the feel of the pot not that either one of them helps to make a great meal, but I'm sure people will ask about it and I'll probably tell them it's a Crock Pot that is used only for heating and keeping your meals nice and warm till dinner time. I highly recommend it, really so convenient and will be easy to pack in my carry on...LOL I'll be all set for the 2 nights and 2 days travel.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Great for construction workers","reviewDescription":"This lunch pot is the second one so bought for my husband after his last one was lost. They made some upgrades to the newer model like a screw on lid and the cord can be disconnected. He’s a construction worker and often works without power so he plugs it into his Milwaukee top off in the morning and he has piping hot lunch by break time. It looks small but can fit a lot of food and the stainless steel pot is easy to clean.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715817600000}
{"reviewTitle":"Doesn’t work well","reviewDescription":"It takes a very long time for it to reheat your food (about 1 hour when filled up).","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"New Color is Designed Different. The Inner Lid Comes Loose!","reviewDescription":"Returned for design flaw\/faulty unit.Unlike the other variations, the licorice color crock has an inner lid that threads into place. This inner lid is supposed to seal the unit and prevent leaks, but it does not thread at all. The lid just comes right off, along with whatever the contents happen to be. The other colors have a different design.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669161600000}
{"reviewTitle":"Interior lid is complete trash","reviewDescription":"Had a previous version of this that was great. This one has a sorry interior lid. Good luck removing with hot product inside!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Stopped working after one use!!!","reviewDescription":"I just bought this cute little thing and was super excited about it. Used it at work on Saturday, worked great and my meal was delicious. Tried it again on Sunday, now it won't even heat up! The light turns on, but no heat. It's useless! Definitely returning this. Bummed out now because my food is cold :(","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1649548800000}
{"reviewTitle":"Cover Issue","reviewDescription":"This is my second mini crock. I opted for the upgraded twisting cover in order to prevent spills in transit. However, it seems that getting the cover to screw on is a hit or miss event.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670112000000}
{"reviewTitle":"Lid is impossible to get off","reviewDescription":"Received this item as a gift. The outer lid is nearly impossible to get off. Brought soup to work and couldn't get the lid off, even tried prying it off. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"Crockpot didn’t last","reviewDescription":"This crockpot was a Christmas present. It’s the end of February and it didn’t last. My husband loved it for work. I’m disappointed it didn’t last long.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1677456000000}
{"reviewTitle":"Lid leaks","reviewDescription":"I LOVED this product at first, got it for my hubby as a father's day gift. Well after a few uses the lid that hold all the food doesn't lock anymore and it leaks...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"No me gusto","reviewDescription":"El material no es de buena calidad","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689465600000}
{"reviewTitle":"Blush pink is a taupe color","reviewDescription":"I paid a little extra for the blush pink crockpot but the one I received was more of a taupe color.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Effective, but has flaws","reviewDescription":"This is an amazing little kitchen gadget! It’s perfect for packed lunch as a teacher. You can put your lunch in in the morning, turn it on, and it will be hot and ready by lunchtime! However, Ive had this product for a little less than a month, and with near daily use, the rose gold paint finish has begun to chip off. I really love this product and how versatile it is for all different types of food, and it does get the job done for sure!!","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Nice food warmee","reviewDescription":"It really make your food hot as advertise but it will take you at least an hour to fully heat up your food","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Works well","reviewDescription":"I mistakenly thought it plugged into cigarette lighter in vehicle but wasn't a deal breaker. My husband says it worked well and that's all I needed to hear!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Does the job","reviewDescription":"This is a great product for soup lovers or small portion eating individuals. The color is great and it is built to last.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Convenient","reviewDescription":"I love how easy it us to use. Just plug it in 90 mins before lunch and its ready when you want to eat. Just make sure the food isn't too dry and if you want to keep your food crispy this product isn't it. I've had rice harden and stick to the bottom and vegies get soggy. But overall happy with the product.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Perfect, I love it!!","reviewDescription":"I  am a technology teacher and have a very thigh schedule, the teachers lunchroom Is far from the computer lab, so I eat lunch in my classroom, was tired of eating sandwiches and salads every single day, I love love love this mini Crockpot, heat up really fast and it fits perfectly in my lunch bag. REASON FOR 4 STARS:  It  left  an ugly mark line after the first used,  washed  it by hand and still there, but other than is a nice crockpot, I highly recommend it!!!","isVerified":true,"ratingScore":4,"reviewReaction":"53 people found this helpful","country":"United States","date":1696291200000}
{"reviewTitle":"Adorable","reviewDescription":"This is the cutest little crockpot I’ve ever seen! Although I wish it had the capability to hold a tad more contents, it works extremely well and I am overall happy with it. It definitely does the job!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Great product.","reviewDescription":"Works amazing. When u have a short lunch and you don't have to waste time warming your food. I love it. Fits nice in my lunch box. Very durable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Nice but to small","reviewDescription":"To small","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"It’s great","reviewDescription":"Warms food up great and timely","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704758400000}
{"reviewTitle":"45 minutes and my soup is BARELY warm","reviewDescription":"Man I really needed this to work. If you don't have access to microwave this would have helped out a lot but it's 45 minutes in and the precooked soup is barely warm. I bought a different electric rectangular lunchbox from Amazon as well and about 25 minutes in, that one had warmed up the soup. I guess I will have to plug in this one, one hour before I am ready to eat so I'm not sure I will be keeping it. This one did not come with a car adapter.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"AWFUL Makes food lukewarm","reviewDescription":"First off I thought crockpots are meant to keep food HOT throughout the day but this did not even heat up water it made it this weird lukewarm temperature. Like the metal plate itself was hot but the water\/food would never be hot itself no matter how long I left it covered and heating.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"Not leak proof.","reviewDescription":"Is it cute? Precious!Is it a pretty color? Darling!Does it work? Eh,Is it leakproof? NoIt's 20 Oz and unless you have something super hearty like chili or eat smaller portions it will be too small.Do I recommend? No. It's better to take your soup in a container and cheaper.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Mine was defective. Hot extremely hot!","reviewDescription":"In the instructions it says that it takes awhile to heat up. I did not find that to be the case. My soup was boiling in the matter of 2 hours. It got so hot that the base finally came apart. I had it for a week and used it everyday for lunch. I even found that plugging it in for 45 minutes the soup was really hot. Again I don’t think they’re supposed to heat up that fast or get as hot as mine did. I did return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702598400000}
{"reviewTitle":"Good at first","reviewDescription":"Whenever I first got it, it wouldn’t heat up my food within 15 minutes but it was okay with me. Over time I noticed that even when I would release the heat, it would be very difficult to take the lid off. To the point where I could hurt my hand. Now I’ve noticed that it doesn’t heat my food at all. The light will be on when plugged in but no heat. I pretty much used it everyday during the work week for 2 months but not it’s done🤷🏽‍♀️","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"Bonita y todo pero cuesta para que caliente","reviewDescription":"Me gusta porque es pequeña ideal para un almuerzo pero cuesta que caliente y por más tiempo  que la pongas no calienta mucho además cuesta para desenroscarla","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Internal capacity disappointment","reviewDescription":"So, I know it reads 20 0z capacity-but reading that and seeing that....are 2 different things. Although 20 0x of food might be adequate, room to stir and eat from the container are different. Also on me, I didn't realize that the inside is metal, not ceramic. Oh, well....","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Smaller than it should be","reviewDescription":"The product does not heat up quickly. It takes a long time to warm food","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"Takes forever","reviewDescription":"The size is great for our use, however it takes at least 30 minutes to just get warm and if you want hot soup that could take at least 3 hours, would not buy again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"Safety concern","reviewDescription":"The lid is EXTREMELY difficult to get off once the food is warmed up. Pulling the vent does nothing.  This is a major safety issue waiting to happen as someone is going to struggle with the lid, it will finally come loose, causing contents to splash everywhere, burning the person.  The pot also runs extremely hot. The outside of the pot gets way hotter than the older model use to.  If replacement inner pots were sold, I never would have gotten a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"All part not always included","reviewDescription":"Mine arrived today without a charger with it. Very disappointed","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"too small","reviewDescription":"It’s too small,I think no one adult would eat with it and feeling full. Definitely don’t  worth it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1669507200000}
{"reviewTitle":"Not worth it","reviewDescription":"I have nothing more to say.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"Missing part of order.","reviewDescription":"I received the small crockpot but didn't received the griddle.  I am waiting on my refund due to I reorder the griddle.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1659657600000}
{"reviewTitle":"Suction of lid either won’t tighten or it gets too tight.","reviewDescription":"Suction of lid either won’t tighten or it gets too tight.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1666310400000}
{"reviewTitle":"Missing parts","reviewDescription":"Arrived without electric cord so useless.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1684627200000}
{"reviewTitle":"Tried multiple times. Would not heat up.","reviewDescription":"Never could get it to warm up. Left it plugged in for 4 hours.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1663718400000}
{"reviewTitle":"It's extremely cheap material. EXTREMELY CHEAP.","reviewDescription":"This a very small container.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1668211200000}
{"reviewTitle":"Do not buy it","reviewDescription":"Trash","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660780800000}
{"reviewTitle":"Did not turn on when plugged in. I tried multiple outlets.","reviewDescription":"Defective. Wouldn't turn on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1669161600000}
{"reviewTitle":"Not totally convinced","reviewDescription":"I got excited when I saw this warmer for the first time. I thought it will be perfect to pack lunch and take it to work but there are a couple of comments I want to express:1- the lid is difficult to use. I have to go around multiple times to close the warmer completely. It doesn’t seal easily. I had to give it a bit of pressure to close it.2- I know this is a “slow cooker\/warmer”, but if you would buy this, you have to plant to connect the warmer hours before you want to eat. It will take long time to warm up the food. Literally, I needed more than 2 hrs to start warming up.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Tiempo","reviewDescription":"Demora mucho tiempo en calentar","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Lid stuck crooked…","reviewDescription":"It is so perfect in looks, size, concept. But when just out of box I opened it, put kid in, and it seemed to be slightly crooked. Then it would not come back off with serious trying by me and by my husband. Would have loved otherwise.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Leaks","reviewDescription":"Only used a handful of times and now the lid doesn’t thread on right. Now leaks if tipped a little on its side.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Jossy","reviewDescription":"Es cómoda pero dura muchos para calentar pero me gusta","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699142400000}
{"reviewTitle":"Takes 30 min to heat up","reviewDescription":"I mean maybe It’s different for everyone, but mine took me about or up to 30 min for my food to be fully heated. That’s almost all my lunch break. It heats up the outside of ur food but not the inside - so you have to keep mixing as it heats.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1689033600000}
{"reviewTitle":"Awesome","reviewDescription":"Awesome for construction worker.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"It's ok","reviewDescription":"I use this item regularly and it works well. It'll hold about a bowl of food and is small enough not to take up so much room in the office. It will warm your food but it takes about an hour. Most of the time, the food is still cool in certain places.  It's nice to have but if you're thinking about getting it for your 30 minute lunch break, this isn't the item for you.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1680998400000}
{"reviewTitle":"Some changes, both good and bad.","reviewDescription":"This is different from the previous version.  There is now a pin to keep the pot still while you close the inner lid. The inner lid is VERY hard to close and open. The outer lid is too easy to cross thread.  The power cable can detach.The fitment is poor.The best part is that it holds liquid better.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1683936000000}
{"reviewTitle":"Works great but…","reviewDescription":"The inside lid gets stuck. Almost impossible to get off. Besides that, would have given it a 5.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Easy lunch!","reviewDescription":"I saw this cute little pot and bought it for my daughter. She is doing a meal plan and always has left overs. She uses this little pot everyday! She loads this thing after she eats dinner and it is ready to go the next morning. She tells me it is the best gift ever! It does take some time to warm up so she plugs it in first thing. It never gets so hot that the food dries out, even when it’s been on for a long time. Great time and money saver because most of the leftovers are used!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Perfect for those who want to avoid microwaves!","reviewDescription":"I was initially hesitant to buy this, based on some of the other reviews. I reached out to Amazon, and they calmed my fears. I am so glad that I bought it! I’ve even put leftovers in it, and refrigerated it overnight. When I got to work, and plugged it in, the food was hot enough to eat in an hour!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714262400000}
{"reviewTitle":"Good electric crock pot !!","reviewDescription":"Needed soemthing for taking hot lunch for day ski classes for my kids and gave this a try .It is good for the portion size I was looking for and kept the food warm. Was able to warm the food from car power just before lunch breaks and kids loved the warm food after 2-3 hrs on snow.No leaks and easy to clean .Looking at the crockpot my friends also bought one and had convenience and fun during ski season .Happy with purchase as I bought this one after quite some research .Would recommend.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Compact and Portable","reviewDescription":"Love the convenience of this little crock.  Works well at work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Nice look","reviewDescription":"CHRISTmas gift for my niece...she likes :-)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Perfect for work lunches","reviewDescription":"I got this product to avoid using the microwave at work at it works wonders! I plug it in when I get to work at 8:30 and my food is perfectly heated by lunch time.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Handy little Guy.","reviewDescription":"Really handy for a quick meal.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"Great for lunches","reviewDescription":"So versatile. Not just for soups. Great for spaghetti, chicken pot pie, Chinese food . Basically anything that has moisture. Heats evenly","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Yesss","reviewDescription":"I love for this crockpot. It’s amazing. It’s cute. It’s small enough to put certain bags and heat up really hot. If you leave it plugged in the steam, the heat will suction your lid and you won’t be able to open it very easily but love it","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"WARMER FOR FOOD","reviewDescription":"PLEASE! If you do not have the access to microwaves at school or work, buy this immediately. I always plug it in 30 minutes before lunch ( as a student ) and everytime the food will come out very warm. Sometimes i even switch out food if my boyfriend needs to warm up his lunch as well. Take good care of it and DONT LOSE THE CORD!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Product was returned due to Aluminium cup used for storing food & heating","reviewDescription":"Color : exactly as shown in the picSize : convenient size for a good portion, neither too small nor a huge cupCleaning : easy to remove the items & clean itHeating : I didn't try with food but with water & it got warm quite quicklyCharging : Detachable chord & easy to plug-in \/ plug-outWeight : Not too heavy, easy to carryCons: the storage container holding the food is made of Aluminium. So the Aluminium container heats the food & it's a big NO NO. Hence I had to return it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Too long to heat","reviewDescription":"The product is really nifty and can be used to heat a number of different foods.However it takes a really long time to heat food. I have to remember to plug it in at least an hour before I want to eat since it takes so long to heat. (nb. my food is store in the fridge so its cold when I plug in) and depending on the type of food; like meat i have to put it on for 1 and a half hours.but once warmed the food is thoroughly hot and remains so as i eat (unlike microwaves which heat the food but then the food cools quickly)","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"The lid doesn't suction","reviewDescription":"I love this product but I'm so bummed because after one month the lid no longer seals and stays on. It now just sits on top. This causes the room to smell when warming up the food. I'm so disappointed because I love not having to warm up my food every day in the microwave, but this isn't great either now. Several of my coworkers have the same thing and none of them seem to have this problem, so maybe mine is faulty? Their seal also looks slightly different, even though we bought them at the same time.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Missing some essential features","reviewDescription":"Overall I like this product, but I felt like at this price I would've expected some more basic features that weren't present.  I would've liked some kind of temperature control, but I can understand that not being there.  The thing that I don't understand is there not even being an on\/off switch.  If I want it turned off, I need to unplug it which is a bit annoying.  I'll keep using it now that I bought it, but I probably wouldn't buy this again if I needed another.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Why does it leak everywhere????","reviewDescription":"I wish it fit like 2 oz more to hold my soup I eat on my diet, but i can deal with that. The problem is, I plug it in and it starts leaking EVERYWHERE after like an hour. It didn't come with any instructions, If I happen to go to lunch before it starts leaking all over my desk, its leaking when I walk with it...and I work in a hospital, so obviously I can't ignore the fact that I'm leaking fluids everywhere for someone to slip on. I'd rather not spend my 30 minute lunch cleaning up chicken broth.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Lunch box","reviewDescription":"This lunch box is very cute!  It is also cute and comfy for travel purososes However, it really works like a slow cooker.  You need to give your food about 2 hours to get it really warm.  I expected it to work faster\/better being it is a name brand product.Suggestions:  I wish it had a car plug, for long travels","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Takes a long time to heat up","reviewDescription":"This has been really nice to have at work when I don't want to waste part of my break heating my food, but you have to remember to plug it in an hour beforehand. I tried just doing 30 minutes, but it would just be lukewarm or still cold by that point. Most of the time a whole hour is needed for it to be the best tempertature.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Not worth the cost","reviewDescription":"$30 is too much for this.  $20 is about right.  Convenient for my desk at work, I leave the shell and bring the liner.  Made my chili seem a bit more watery, and after first use, left marks inside the inner liner pot (again on 2nd use).  Best feature - I don't have to trek to the microwaves and wait in line.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Too small","reviewDescription":"Not like in the picture","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"Good Product, Bad Paint Quality","reviewDescription":"The crockpot heats my food really well so I love that. However, the paint has started to chip off and I just bought this not even a month ago. The paint started to chip off after 2 uses without using any cleaning products. Wish the quality was better for this color.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"I did get to use it yet because it is too small for me","reviewDescription":"Too small","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670457600000}
{"reviewTitle":"The gold trim melted and leaked everywhere.  Will have to return.","reviewDescription":"The trim melted and leaked everywhere","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1651104000000}
{"reviewTitle":"NOT FOR “ON THE GO”","reviewDescription":"It doesn’t come with any adaptive plugs for autos.. so it’s not for “on the go” until you spend another 20$ for the conversion plug.. Not Cool…Pretty sure I could have found one that came “born” that way, if I’d noticed.. my fault!","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Loved it, until it broke","reviewDescription":"I received my lunch crock as a gift a few months ago. It was great for lunch at my office, I’d plug it in about an hour before lunch and my leftovers were piping hot and ready to eat. I noticed as soon as I got it that the lid was pretty difficult to open, especially once the food was warming up. But with the little pin, I could manage to use the leverage of the outer crock to open the inner lid. This worked until today, the metal inner part of the heating element turned with the inner bowl and lid. The outer plastic is now sticking out and exposing the heating element, and I don’t feel comfortable using any longer. If this design is improved, I’d definitely consider purchasing another.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Slow and Steady Cooker!","reviewDescription":"My boyfriend got me this for Christmas and I love the cuteness of it even though it really takes a looooong time to heat soup and left overs. You literally have to wait like 2 hours or so eat whatever you put in here so I think this is good for when you know you’ll be hungry in 3 hours so might as well start heating it up early.The design is great - there are a lot of parts to it to clean and be mindful of- like the top and actual warmer and then there’s another top over the top.There should be an on\/off option for this or a timer since it’s just plug in and that’s it.Also since it has to be plugged directly into an outlet, the cord should be a lot longer to accommodate the a decent distance from the wall.Overall it’s cute and compact - just needs a few options to make it less complicated to use.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"It's okay.","reviewDescription":"I love the concept. I have an older version and I love it! That's why I purchased another one, but I like the original much better. After the food is heated, the suction to the lid makes the lid difficult to remove.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1671235200000}
{"reviewTitle":"It may leak by design","reviewDescription":"Firstly, this is adorable. And it heats soups and stews very nicely. And it's small, so you don't feel like you're eating from a trough at your desk.Sadly, it can be a little messy. There's the outside cover, which seals pretty well; and the inside cap cover you twist down on the food bowl. This does not seal, intentionally, probably(?) to allow it to let off a little steam.  As long as you know this, and rinse your used vessel out before tossing it in your tote, you might not get the remnants of your chili on that work you had to take home with you.The cord wrap is nice, and carefully engineered, but I don't have the hang of it yet, so a couple times I brought the food but not the cord, so it was pointless. I can't decide why I haven't bonded with this, because it's great to have tidy, hot food at my desk, and cleanup isn't bad, but I wanted to like it better.I will edit if it grows on me, or if I discover any tips to share.","isVerified":false,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1670716800000}
{"reviewTitle":"Crockpot does not sell a replacement inner lid!","reviewDescription":"I like this little crockpot, but I misplaced the inner lid and the pot will leak without it if not kept completely upright. Hard to believe the company does not offer a replacement to purchase.","isVerified":false,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"Está bien","reviewDescription":"Funcional perono deja la comida caliente, solo tibia.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"Mexico","date":1702425600000}
{"reviewTitle":"Scuffed and scratched","reviewDescription":"Returning my item because it was scuffed and scratched","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"smaller than the pictures.","reviewDescription":"Smaller than it looks in the pictures. Alot smaller.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"SIZE .....TOO SMALL","reviewDescription":"I REALLY WAS EXPECTING THE CROCK POT TO BE BIGGER. IT WAS NOT WHAT I WAS LOOKING FOR BUT WILL MAKE IT DO FOR MY TRIP. TOO SMALL FOR WHAT I NEEDED IT FOR....","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684108800000}
{"reviewTitle":"Container","reviewDescription":"No me gusto porque se demora mucho para calentar punto!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Love it but lid doesn’t tighten after 2 uses.","reviewDescription":"At first the inner lid stay on tight. I used it twice and hand washed both times. Now the inner lid just spins and doesn’t get tight at all. Is there a way to get a replacement lid? I use mine for soup and soup without a tight lid is a bad combo.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"Good, not great","reviewDescription":"Product works well enough, I bought it for the crockpot name mostly because there are so many variations of heat up lunchboxes now. It does heat up well and get it food smoking hot, however the lid does not stay tight at all and it is far from leak proof. Do not tip over! Wish they would’ve just made the lid metal and truly leak proof.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1667088000000}
{"reviewTitle":"Nice","reviewDescription":"The inside does not hold a lot of food","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683936000000}
{"reviewTitle":"Lid wont seal tight","reviewDescription":"I wish I could love it. Unfortunately, the inner lid doesnt tighten. No matter how hard I try the lid doesn't seal (with or without food). It' just so stinking cute, but useless if I want to bring soup.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1668384000000}
{"reviewTitle":"Smaller than I thought","reviewDescription":"It arrived well packaged, but there was a piece broken off where the cord is supposed to tuck in for storage, so I sent it back and decided not to reorder.  I bought it as a gift.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1668470400000}
{"reviewTitle":"Cute, BUT the paint wipes off at the slightest touch","reviewDescription":"I was super excited about this little crockpot, it's adorable and works well. However, the first time I tried to clean some soup off the outside the paint started to flake and rub away in places. Super disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1673395200000}
{"reviewTitle":"Takes way too long to heat up","reviewDescription":"I plugged it in in the morning so my soup would be hot by lunchtime. It was only warm. Waste of time and money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Waste of money","reviewDescription":"This thing is totally a piece of garbage. I wish I had not purchased it. I tried to heat up lunch, and after an hour, my food was still lukewarm. I threw it into the garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Couldn't Open It","reviewDescription":"I was so excited when this item arrived, but I could not for the life of me take the lid off.  It is seriously sealed shut.  I had a few friends take a run at it and no one could get the lid off.  I guess I have to send it back.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Arrived damaged","reviewDescription":"The handle was broken. Although the damaged box was completely taped shut, the pieces of the broken handle were not inside.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"I bought this for my daughter for Christmas. She went to use it for the first time today (2\/20\/24) and it doesn’t work at all. Unfortunately it is out of the timeframe to return.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Waste","reviewDescription":"Waste of money. The term portable makes you think… you know.. it’s portable? Bought this for my husband who works outside all day. I assumed this was something that could be charged and used.. portably.. Wrong. You must have it plugged in to work.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Cute as a decoration","reviewDescription":"Please do not purchase with intent of heating up left overs or for soup, or what have you.I purchase 3 for Xmas gifts for my work besties.NOPE. False advertisement!They can't even hold 2 cups of liquid let alone meal.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Used","reviewDescription":"I did not know it was used it’s very dirty has greasy finger prints all over it. Not pleased with this outcome. I was very upset that it was used, this was a Christmas gift, not pleased it was used & dirt. It’s what she wanted but not used!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Damaged","reviewDescription":"Product came damaged. The side seams was bowed out in two sport. Really disappointing. Returning & trying for a replacement. Hoping it isn’t the same way.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1708041600000}
{"reviewTitle":"Fire hazard","reviewDescription":"Used product one time and it started smoking, smell of burning plastic etc. Amazon no help in refund return.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Overall this is great, just a minor complaint","reviewDescription":"I bought this Crock Pot food warmer about a month and a half ago, and have used it quite a bit for lunches at work.  It works as advertised, heating up your meals, having them ready anytime you are.  I've made soups, stews, and similar things in bulk. refrigerated or frozen them, and then reheated them in the mini crockpot.  My only complaint, which is a minor one, is the finish trim color around the upper base of the unit, which is apparently painted plastic, is coming off (see pictures).  Not really a big deal.  It's not in or around the inner container, so I'm not worried about that getting into the food.  But it's something that could be improved ,","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1707091200000}
{"reviewTitle":"Takes a while to heat up","reviewDescription":"Got this to take to work. It took over a hour to heat up food. Now I know to plug it in right away in the morning. I like having the option to take stews\/soups to work with this.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715040000000}
{"reviewTitle":"Great","reviewDescription":"Great item, heats things up a little slower than my other similar crock pot but does the job.The lid is also very hard to remove but that is most likely to keep the contents from spilling out. My wife loves the color and likes the size and durability.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Great gift idea","reviewDescription":"This compact food warmer is a lifesaver. It allows you to carry leftovers to work, saving you money from buying fast food.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"The cutest little crock! Easy to store, easy to use","reviewDescription":"As I sit here eating my lunch from the cutest little crockpot, I felt compelled to write a review. My favorite feature of this crock is that you can keep the item at work and bring home the inner chamber to wash and return back. I have found that it works better and faster with soups and liquid-like foods than items such as pasta, which take a bit longer to heat up. I have heard of using it to keep butter melted for parties, which is genius. It is a great item (and the cutest little crock) to have if you bring your lunch to work regularly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Good product","reviewDescription":"I love this crock-pot a lot. I really enjoy a hot meal for lunch when I'm at work. It's also good to make instant noodles as well. However, I don't think it is quite well built because the case is already a bit out of shape after a few days. It still heats well though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Great little good warmer","reviewDescription":"So far this thing does exactly what it supposed to. It does a great job in reheating food. If I have bone in chicken and mashed potatoes, it usually takes about 45 minutes to an hour for the food to get hot hot. So this is my second mini crockpot I had one years ago, and there are things I prefer on the new one and then other things I prefer on the old one. I love that the lid on the new one screws on Now. I don’t have to worry about food spilling out of the bowl.  The cord on the new crockpot is detachable now, not an improvement I’m my opinion. I suppose it’s for ease of storage or maybe so it’ll wrap nicer but for the life of me I cannot get the cord to stay wrapped up. It’s like the cord is just a hair too long so the plugs don’t stay in their designated spots. They are forever popping out. That is pretty frustrating.  I’m usually carrying a handful of things from my car to office every morning and having to put it all down to pick up the cord that fell off the bottom of my food warmer halfway through a fleet yard is not joy. I think I’m gonna try Velcro. See if I can’t find a way to make it stay. I love the color of mine. I got the green one, but the paint on the small gray rim that the lid screws into it’s already wearing off and I’ve only had this for about a month now. I don’t really wash the base of the mini crockpot but I spot clean it. The paint hasn’t rubbed off from excessive wear and tear or too much of anything like that. It’s just doesn’t stick that well I guess. This item lost a star because of the paint and the cord issue.  It works great and does what it supposed to do and it’s not giant like the other food warmers I’ve seen.  overall happy with my purchase..","isVerified":true,"ratingScore":4,"reviewReaction":"122 people found this helpful","country":"United States","date":1685750400000}
{"reviewTitle":"Perfect.for my noodles","reviewDescription":"Perfect for my noodles and the size.fits my lunchbox","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Good Purchase","reviewDescription":"This is very cute and functional. Although, it does take quite a while to heat up your lunch. If you have the extra time it would be great for you.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713398400000}
{"reviewTitle":"Great for single servings","reviewDescription":"I use mine for lunches at work. It heats well and is easy to clean. The cord storage is iffy, Not sure how long it is going to hold as it does not snap securely in place.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Awesome!!","reviewDescription":"Hard to open the lid without spilling.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Very good","reviewDescription":"No longer have to use the nasty microwave at work. I’ve put everything but soup in this little thing and as long as I remember to plug it in, I get a hot lunch. The only complaint I have is screwing in the lid to the inner container. Mine seems to have a hard time going on straight. If I did take soup, I’d want to screw the lid on tight and it’s kind of a pain to get that lid off if you get it on tight. I do wish I could purchase an additional inner container. Sometimes I’d like to just put it in the dishwasher instead of having to wash it every day by hand in order to take my lunch. I also wish it had an on\/off switch instead of having to plug\/unplug it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"Overall good purchase","reviewDescription":"This is a very convenient \"lunchbox\" if you don't have access to (or don't like using) a microwave.  It doesn't cook food, just reheats.  This holds a lot of food (at least two cups).  I haven't put any compact foods into it, mainly soups\/chilis and loose pasta like spaghetti or soba (no lasagnas or casseroles). Some stuff requires just a little bit of liquid to help with the reheating. My only two complaints: 1.) You have to loosen the internal lid before you start cooking, otherwise it tend to get stuck.  The last thing you want to do is fight with a lid that's holding back hot food.  This happens with or without that little black venting plug on the top. 2.) After the first use, my power indicator light stopped working.  I tried the unit and it still heats, so this isn't a deal breaker.  Reheating time takes some trial and error but once you work it out, it's easy to use.  I like my soups really hot, so at max capacity, it was 1 to 1.5 hours from refrigerator cold.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"So far so good !!","reviewDescription":"I’ve been eyeing this for a while now and finally got around to getting it. The idea of having a hot lunch without going to the microwave in the office break room sounded appealing to me. Anyways, last night I added some leftover chicken congee (rice porridge) into the metal container and covered it with the plastic cover that came with the unit and left it in the fridge. Grabbed it on my way out of the house. When I got to the office, I plugged the crock pot into the wall unit at my desk. After about 4 hours of working I started to get hungry so I opened up the crock pot and man oh man was this thing hot !! I had to use a napkin to hold the side of the metal bowl down while I tried to pop off the plastic cover (hence the 4 stars). But once that lid came off and I can smell the garlic and chicken I knew this was going to be a tasty lunch. The fact that my congee was piping hot the whole time I was eating was nice. Cleaning everything was a breeze. I love how the cable disconnects completely from the unit and that I can keep it hidden while still on the unit. I can’t wait to try this again!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Nice","reviewDescription":"Super cute and easy to use. BUT they sent the wrong color.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Received as a gift and then bought 3 more as gifts to others!","reviewDescription":"This is fantastic for a nice, homemade, warm lunch that isn't dried out or unevenly warmed up from the microwave! The temperature is evenly hot throughout and the food retains its moisture! I do love it! The only criticism I have is the inner lid is difficult to remove when the food is warmed up because the inner grip is too short and doesn't allow enough torque to twist off.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Not too hot, in a good way","reviewDescription":"I have used mine mainly for soups at work. Fill it up and plug it in. Soups on in an hour! It doesn't get steaming hot but it does get a sufficient level of hot, at least for what I personally prefer in food temperature. No burning the roof of my mouth or tongue.Took some leftover Carabbas chicken pasta in to work and it heated up perfectly! It does take about an hour and I forgot about it and it heated for 2 hours. My pasta wasn't stuck onto the metal container, it was great.Tonight at work we had make you own burritos catered in the studio. I got to the food late so it was cold. I filled the bowl with chicken chunks, black beans, crushed tortilla chips and cheese. Heated it for an hour and it was great!All my coworkers are jealous with the exception of the two who ordered their own after seeing mine4 Stars for the handle. That things gonna break if it ever meets the pavement on accident.Cleaning is a breeze!","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"Great product for lunches\/dinners.","reviewDescription":"I had  gotten one of these during christmas one year and ended up losing it. I bought this newer version and enjoy it a lot more.PROS: It's a nice thing to just easily heat up your lunch\/dinner while you're working throughout the day (or nacho cheese). I do like the screw-on lid (also a CON) compared to the order model where it just was pressed in. NOTE though, you do need to stir your food every now and then to make sure it heats up as fast as possible. :)CONS: Only two things, the screw-on lid (for the one with the bowl) to me tends to be a major pain on getting it undone every now and then. It's like I have to wait for it to cool a bit. The second, as mentioned by other reviewers, is that the power cord doesn't stay well with it being wrapped up. While I haven't had it fall off yet; it's not exactly secured to it. (the prong side)It is a great product and I would be another one again if I thought I needed to!","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1703116800000}
{"reviewTitle":"Great to avoid microwave jams in office","reviewDescription":"This is a great little gadget for heating lunch at the office.  Sometimes reheating soups or pastas can get messy in the office microwave, and while I don't mind cleaning up after myself, I'm not cleaning up Betty's exploding lasagna from last week!  I usually try to give it at least an hour and have always had my food nice and warm-even heating from frozen.  I keep the base in my office and use the inner container to transport my lunch. I've not had an issue with leaks and that's honestly my one complaint.  I don't know what science rule I'm missing, but sometimes it is a STRUGGLE to open.  Even with the little spiget popped, I was worried I was going to break it trying to fight whatever forces had created the perfect seal. So my lesson learned is to make sure the inner lid is not screwed in too tightly, barely twisted, to make it easier to open.  All that to say, I love it and use it about 2x a week.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Way to small for ys","reviewDescription":"The quality was good. Not worth the price for our family as it is very small. If it wasn’t so pricey it would work great for cheese dip at a party.For work it wasn’t practically because I really have no where to keep it warm all day before lunch.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Little Lunch Pot","reviewDescription":"The little thing is cool. I take it to work with me for lunch, it works amazingly and it’s better than putting my food in a microwave. I do fight with wrapping the cord at the bottom base trying to get it to fit right. I gave it 3 stars because you see in the photos the lip on the pot is wearing off. I don’t rough handle the little thing, but the lid seems to give it its wear. I’ve only had this for 2 weeks so it’s sad to see it’s starting to wear.But in all, it’s cute and it does the job when I’m ready to eat my lunch.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Good for Heating Food","reviewDescription":"This Crockpot works fine to heat foods. Takes about an hour and 1\/2 to heat my lunch. I gave it 3 stars because the inner lid doesn't fit well. Sometimes I have to pry it off. Also, the cord storage is very inconvenient. I don't enjoy using it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Not long lasting","reviewDescription":"I have only used this crockpot about 10 times and it just stopped working.  I was very careful not to get any electrical parts wet and used as directed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"portable","reviewDescription":"Takes L O N G  as in many hours to cook food just heating up leftovers took 2 hours.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Fell apart after a few uses","reviewDescription":"I don't have a dishwasher so I washed it by hand and after only a couple of weeks use at work (not every day) the outside pink lining was separating from the metal bowl and now the lid won't go on bc of it. I guess I'll check out those warming lunch boxes that everyone's trying now....","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"paint is cheap","reviewDescription":"This little crock pot is worth it to take to work.  It warms up my food- roast, chili, soup.  Perfecto!  There is only one button, so no warming feature.Now, I've washed it a few times and the paint on it has come off easily.  The durability is in question because of this. Would be 5 stars if it wasn't the paint and if it had a warming option.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Very cool but gets hot fast","reviewDescription":"Plugged it in at 9:30 AM and by 11:00 it was too hot! Works good but I recommend waiting until about 1\/2 hr to 45 mins to turn it on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Food container is made of ALUMINUM.","reviewDescription":"I love this little food warmer, however, I discovered the interior food warmer is made of aluminum! I don't heat and eat out of aluminum. Could you PLEASE offer an alternative stainless steel or even glass. Preferably stainless steel. Otherwise it works perfectly and is fast to heat. The size is perfect for me.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Great Product, Bad Lid","reviewDescription":"This crock pot functions as listed, and comes in fashionable colors. However, I’ve had two separate occasions where the lid becomes stuck and won’t come off. On this days, I don’t get to eat my lunch :(.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Definitely NOT blush pink","reviewDescription":"I bought this lunch crock because it’s supposed to be blush pink. The one I received is nowhere near pink. It looks like a dark taupe color. Other than being super disappointed with the color, I’m sure it will be fine for heating up lunch items.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Adorable WARMER (does not cook)","reviewDescription":"I really like the color, size, and convenience of this portable warmer. I thought I was purchasing an actual mini crockpot cooker though. It does not cook, but I am able to take soup, rice, etc. to heat up for lunch at work.  As long as you know that it’s not a cooker, you won’t be disappointed.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Great way to carry lunch","reviewDescription":"I have been enjoying this pot. I only have difficulty with the inner lid. I wish that it screwed on, sometimes I can’t get it on tight enough. Other than that, it works and it heats up my meal in less than 3 hours.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Just what it seems","reviewDescription":"You still have to precook whatever you plan on putting in it, but it is an excellent way to have a warm or hot meal at work.  Small, compact and can hold enough food for one person for one meal.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691971200000}
{"reviewTitle":"Very convenient","reviewDescription":"I am on the go for my job and this makes lunch a no Brainerd. It does take a bit to heat up your food but I expected that from a mini crackpot. It does the job well and evenly heats your food","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Color is off","reviewDescription":"Cute little  warmer but it takes a little longer to warm up the food. So prepare a head of time.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"Perfect gift for hot lunch at the office.","reviewDescription":"This is a gift for a friend.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Convenient","reviewDescription":"This is very convenient and a great idea.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Great little product for making soup for lunch","reviewDescription":"This works great for heating up soup for my lunch.  It works well, and it’s very portable.  There are 2 problems…. 1) I cooked broccoli soup in it, and the smell of broccoli was retained in it.  I can’t get that smell out.  2) As it heats up, the lid gets tighter.  So I have a lot of difficulty removing the inner lid when the crockpot is on.  Since it’s plastic, I am concerned this life is going to break.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Even heat = better lunch","reviewDescription":"So I've only had this thing for a couple of weeks, but so far it is wonderful. I've only used it for things like pasta and chili, but that's not unusual for my lunch. Unlike microwaving it, I just plug this thing in an hour (actually it's been closer to two hours because I'm afraid that I'll forget about it until the last minute).When it's lunch time, I have a meal that isn't half frozen\/half mouth-burningly hot. Rather it is all uniformly hot without me having to stir it, put it back in the microwave... etc.I don't know why, but the texture of my pasta isn't as bad as when I microwave.","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1665878400000}
{"reviewTitle":"Not just plastic, also metal","reviewDescription":"The description states it is made of plastic. The outside is plastic, but the inside is metal. What kind of metal is it??Thanks, Becky","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1694044800000}
{"reviewTitle":"Takes a long time to warm up.","reviewDescription":"Takes a long time to warm up and it does not warm the food enough.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1671753600000}
{"reviewTitle":"Smaller then you think","reviewDescription":"If for a kid good but this thing is small can’t even hold a full meal for an adult","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668470400000}
{"reviewTitle":"Tiny size","reviewDescription":"This is MUCH smaller than expected! Being returned! Don’t need a crockpot for soup- about all that would fit!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"Tiny","reviewDescription":"It was pretty small for a man size portion of lunch","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"Leaks badly","reviewDescription":"Lids are not leakproof. Tiniest tip of the pot causes it to leak, and right into the base potentially damaging the unit.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Cute but small","reviewDescription":"I wishlist was a little bigger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678060800000}
{"reviewTitle":"Takes too long to heat up","reviewDescription":"Holds a can of soup fine just takes forever to heat up. Fine if you have plenty of time to wait.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667433600000}
{"reviewTitle":"It’s not 12 volt","reviewDescription":"It’s not one peice and it’s not 12 volt for truck drivers with a seal proof lid tight lid","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662768000000}
{"reviewTitle":"Disappointed","reviewDescription":"Does not heat food evenly or hot enough. I was very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671840000000}
{"reviewTitle":"It’s really small","reviewDescription":"Too small for our use","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677110400000}
{"reviewTitle":"It works great!","reviewDescription":"Absolutely love! It works great and is perfect for on the go or in the office. I love that it can fit on a desk and doesn't give off food odors. It also has a container with lid so you can store your food. Will be buying another!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717977600000}
{"reviewTitle":"Love, love, love this","reviewDescription":"As a teacher, I am picky about items I use in the classroom. This fits the bill! It holds a good amount, heats my lunch well, and there is NO smell to fill the classroom while it heats up. I'm not crazy about the detachable plug because it doesn't stay where it should for storage, BUT- I solved that by keeping the cord at school instead of lugging it back and forth. It's nice to have my meal ready at lunch and not have to que up for the microwave. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"I love this little crock pot","reviewDescription":"I'm a teacher, so I keep this at school in my classroom.  It's so easy to clean and tote.  I bring the innards with me in the morning, place them in the croc and they are ready by lunch.  It cools down quickly as well.  I have used it every day since I bought it more than a month ago.My only complaint is sometimes the top doesn't come off, and I have to use a key to break the seal.  I worry about that over time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"Great for daily lunches.","reviewDescription":"I use this in my office almost daily!  Great for leftovers, or preparing simple precooked meals. I load it up with whatever I have in the fridge or freezer play it in and by lunch time it’s hot and ready to enjoy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"So impressed","reviewDescription":"Wow I really impressed by this food warmer. Not only is it compact and the blush pink (more mauve) is pretty, it holds a good amount of food, and heats food in 1-2 hrs.Just tried it for the first time at home and it warmed my rice porridge to very warm in about 1.5 hrs. The food is hot but a comfortable hot for eating. I added some soft tofu and sauce on top after my porridge finished warming. Also tried it with my vegan mac and cheez chili and it took about 1.5 hrs to warm.I like that keeping it plugged in, I can slowly eat my food without it going cold. I have a bad habit of eat food over a long span of time if I’m preoccupied.The only issue I had with it was taking off the inner container lid when I first opened the package. It was wouldn’t come off. My bf was able to get the inner lid off the inner container with his strength. Since then, the lid has come off without problem.","isVerified":true,"ratingScore":5,"reviewReaction":"37 people found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Love This Crockpot","reviewDescription":"This is my first and only Crockpot electric lunch warmer and I love it. It heats up my meals and keeps them warm. I've heated homemade soups, and fried rice, and it took my soup about 35 minutes to get hot after removing from refrigerator (only inner pot needs to go in refrigerator). I've even heated scrambled eggs that I made the night before and had them for breakfast at the office the next morning with coffee and avocado toast. 😉Don't let the size fool you, it holds a good portion.I purchased the blush pink and  it's a really pretty color.UPDATE:I bought this little Crockpot back in May 2023 and it is now December and I am using it to heat up soups and other meals a couple times a week since it gets now cold in my area (NC) and it is still working great. The inner pot does get a little stained but not a big deal. I always hand wash the inner pot and lids and just wipe the outer sides of the pot if needed. I've never had any leaks but then again, I always make sure not to go past the \"max fill\" line. I carry it in my cute 😍 lunch bag (also from Amazon) and it fits perfectly. I love my Crockpot.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1695168000000}
{"reviewTitle":"The pink color is not as shown in the picture, and it is ugly.  Works great, however.","reviewDescription":"I bought the pink one. I regret that now the color isn’t really pink it’s the sort of ugly gray yuck.  I am OK with Dusty Rose, and this is not dusty, rose. The metal band around the middle is the correct color but the plastic need some help.  Aside from the fact that it’s ugly it works very well.  I had a little bit of trouble getting the inner lid to screw on exactly.  In the end, it’s sort of kind of on and  is good enough.  Certainly not leak proof. Washes well In the dishwasher. Adorable little carrying handle and brilliant way to wrap the cord around the bottom.  You can use the lids or not while heating. Obviously that will speed it up. The unit does get a little bit warm, but certainly not hot on the outside.  I would not put it on top of a laptop or some thing, but it’s probably fine on the counter.  I really enjoyed not having to use the communal microwave. I really love how well it heats up in three hours food from the refrigerator, including big pieces of potato.  I love how you can use the lid or not, I love how there is exactly 0 buttons to break. If it’s plugged in, it’s on, if it’s not it’s not.  I love how adorable it is.  It’s a decent portion for one adult.  You obviously can put less in it if you choose. Now I’m on the hunt for extra inner bowls and lids.","isVerified":true,"ratingScore":5,"reviewReaction":"107 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"Amazing, works great!","reviewDescription":"My husband works outside for the union in the freezing cold temperatures off the water of New England winter. It’s always looking to save a few bucks and get a warm meal in his belly at lunch. This was super easy for him to run off of his Milwaukee battery ports. Everything else we tried had too high of a wattage and wouldn’t work. This the best thing ever he’s been using every day for months with all sorts of variety of things even cuts up pizza, meatballs, lasagna, soup, dips with breadsticks. There’s so many options. Great value","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Perfect for work!","reviewDescription":"I love the concept of this crock pot. I take lunch daily for work and it’s very quick and easy to use. I prefer not to warm my food up in the microwave so this is very handy. It’s also very easy to clean and travel with.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"My Co-Workers are Super Jelly!","reviewDescription":"The Crockpot Electric Lunch Box has single-handedly revolutionized my lunch routine at work! Gone are the days of waiting endlessly for the office microwave to free up. Now, I simply sit at my desk, plug in this marvelous gadget, and in just an hour, voilà! I'm indulging in a piping hot, delicious meal that tastes ten times better than anything zapped in the microwave.What truly sets this lunch box apart is its ability to retain the flavors and textures of my meals. I've experienced a noticeable improvement in the taste and consistency of my food compared to using the office microwave. Whether it's warming up my favorite homemade soup or reheating last night's pasta, the food comes out perfectly warm without any sogginess or uneven heating.And let's talk about the convenience! Its compact size fits neatly on my desk without taking up much space, and the secure closures ensure no spills during transport. Plus, it's a breeze to clean—the removable stainless steal crock is dishwasher-safe, making maintenance hassle-free.But the real game-changer here is the absence of any lingering food odors. I can't stress enough how amazing it is to warm up my lunch, like my \"aromatic\" riced cauliflower, and not have a whiff of it lingering around my workspace, offending those around me! It's as if the lunch box magically erases any food smells while keeping the flavors intact.In short, the Crockpot Electric Lunch Box is a lifesaver for anyone seeking a superior lunchtime experience. If you're tired of the microwave shuffle and want to elevate your meal game, this is hands down the ultimate solution. Highly recommended for its convenience, taste preservation, and odor-free warming!","isVerified":true,"ratingScore":5,"reviewReaction":"167 people found this helpful","country":"United States","date":1701043200000}
{"reviewTitle":"Heat time","reviewDescription":"The item looks nice but I give 1 start for heat-up time. 1st I have cold food and plug-in 15min. Still cool ( I mean cool) and at 2nd time I plug in for 35min. Still a little warning ( compare with microwave 45-second heat time) I would not recommend to anyone trying to buy this item for heat up food. I have no idea what is this one purpose for.🤷‍♂️","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Don't waste your money","reviewDescription":"I had this for about three months when the plastic piece on the insert disappeared. Not sure if it broke in the dishwasher or what happened to it. So I contacted Crock Pot through Amazon, who wanted pictures of the item - the item number - the date code - the sticker on the bottom - proof of purchase...seriously? I just wanted to know if I could replace the piece of plastic. I'm throwing this out and buying something better.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Too long to heat","reviewDescription":"Takes too long to heat.  Very small no on\/off button.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709510400000}
{"reviewTitle":"Pot doesn’t work","reviewDescription":"The pot worked a few times but it doesn’t get hot anymore i don’t know what happend it was working good until all the Sudden it’s lifeless….very disappointing I was hoping I could use it every day….","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"No me sirve muy pequeño","reviewDescription":"No lleno mis expectativas y mis necesidades","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Top doesn’t fit","reviewDescription":"Seems like a good design, but no way to know if it actually seals. The outside top wouldn’t screw back on no matter how many times I tried.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Disappointed","reviewDescription":"This is not for someone who a senior who has limited grip strength in their hands. I should have paid more attention to the ratings that mentioned this fact.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Needs Manufacturing Process Help and Quality Inspection","reviewDescription":"1. Color says Pink but is actually tan.2. The inside lid does not fit on the pot.3. Not sure how safe these materials are.Returned","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"Used it a couple times!!!","reviewDescription":"Just got it for Christmas and now it is broken!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Very mini","reviewDescription":"Rice cooker used once, rice burnt.  Will not work anymore.  The button would not stay down in cook mode.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"What? I just don't get the appeal.","reviewDescription":"I got this on a 50% off deal and still feel it was way overpriced for what it is. I returned the item knowing I wouldn't ever use it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670025600000}
{"reviewTitle":"Easy to use but has a few flaws with the lid","reviewDescription":"It’s easy to use and easy to clean overall. But minus one for the lid being a bit hard to adjust\/close. Another minus one for the speed, it takes about 30-40mins to actually start getting heat up.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"Stopped working after 3 months but customer support made it right","reviewDescription":"I really loved having this small crackpot to warm up food, however, it stopped working after only intermittent use in 3 months. Contacted customer support to troubleshoot the issue. They are in the process of sending a new one. I appreciate the company trying to make it right.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1658620800000}
{"reviewTitle":"Small Crockpot is Small","reviewDescription":"You really can't fit a human sized portion into this crockpot.  I loved the idea, just disappointed with my portion size I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670371200000}
{"reviewTitle":"3star","reviewDescription":"I have used one of these before and loved it. My only issue with this one is that I never received it. My order info still says delayed… 4 months later","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666137600000}
{"reviewTitle":"Too small for my use.","reviewDescription":"Cute and convenient device. I should have paid more attention to the serving size, it's too small for my use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669075200000}
{"reviewTitle":"This is not a blush pink color, It is a taupe tan color!","reviewDescription":"It is not a blush pink, which is why I ordered this one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678579200000}
{"reviewTitle":"20 Oz is too small!","reviewDescription":"I really like the crockpot but the size is too small! It can fit maybe a small cup of soap but not a meal.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672099200000}
{"reviewTitle":"I received the product without its original box and paperwork","reviewDescription":"I received the product without its original box and paperwork","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"So small","reviewDescription":"Could allow for a larger portion size.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669248000000}
