{"reviewTitle":"Stopped working after a year","reviewDescription":"I truly love Anker power banks, I’ve had one since 2019 that still works great, although it’s now taking longer to charge. I purchased this one in January 2023 for an upcoming trip and it worked fantastic. Charged well, was able to recharge my iPhone 2.5 times before having to recharge the bank. It never overheated. It was a little heavy, but the usefulness was primary over the size and weight. I had used it regularly, once or twice a month since to charge my phone. Unfortunately the power bank will no longer recharge.While I'm glad it worked when I needed it, I’m sad that it’s basically dead after 14 months. Hopefully the next one will last longer.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Changed the Model","reviewDescription":"We bought one two years ago and loved it. It took a long time to charge up, but held the charge for a very long time. Very happy with that one. We could charge two iPhones from below 20% quickly and it would have between 50-75% battery left.We just bought two more and the quality has definitely decreased. They don’t hold nearly as much charge as the older models. Now if we charge one iPhone that’s below 20% it takes the same amount of battery as charging two used to.I don’t like paying the same price for something that has dipped in quality. With that being said I still think it’s a decent power bank. Just not as good as it used to be and we will explore other options in the future to try to find the original quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Powerful Power Bank","reviewDescription":"Holds charge for along time... Happy with the performance!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Keep with me all the time","reviewDescription":"This is my second Anker “brick” charger - they are the best.  I can charge 2 phones at once with this and it holds a solid charge for about 5 days.  The only reason I gave it 4 stars is because the charging lights are very small and somewhat hard to see, the older charger had larger bright blue  lights on the side.  Anyway, still happy with the purchase, can’t go wrong with Anker.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"Very useful as a power bank","reviewDescription":"This is very useful as a power bank.  I've charged up my phone with it several times, and used it to keep one of my drone controller from discharging so fast while it was being used.The one thing that makes this a 4-start rating is the user manual.  It's very sparse and gives no detail to things such as how long it may take to charge it fully.  All it says is \"Recharge using the USB-C or Micro USB port.\"  In multiple languages.  That's it.  It doesn't even tell what the lights on the button mean while charging -- you have to guess they mean the charge amount.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Cargador","reviewDescription":"Muy bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"A powerbank","reviewDescription":"I just bought this powerbank and it really shows it got some juice inside since its weight is heavier than the other powerbanks I used such as the Incipio Cell Phone power bank.The only problem I have is when charging the powerbank, I have to lift it to see how many dots it has since when you look at it from the side, you can't see it nor glance at it. You have to grab it yourself or get in a right angle to check how many dots it has charged.Will update in about a year or two on how this beast would serve me.UPDATE 3\/31\/23 (1 month use)I used the powerbank for about a month now and it charges pretty fast, even with the trickle mode, you could charge your phone up to a 100% granted that you don't use it while charging.If you charge it without using the trickle mode, it still charges and boy it does charge for a long time, it took about 5 days before it reached to 3 dots on the button which is great if you're traveling somewhere that does not have any outlet.The cons that I experienced besides the viewing of the dot thingy is the lack of other options of using a usb. You have to use a usb-a, you can't use usb-c since that part is only charging the powerbank itself. Search for another product if you want an almost universal charging port or charging your mac even.Overall, its pretty good for use while traveling to charge your phone while having a lot of juice so you don't have to worry about charging your powerbank for a while.will update in a year this time.UPDATE 3\/22\/24With the advent of USB-C, I would look for other power banks other than this. It's a good backup power bank but there are better alternatives out there. You can hand carry this power bank with other power banks such as the anker powercore+ on airports. I wouldn't return this power bank if you bought it already since again this can be a good backup power bank when your good ones run out of power since 20k is alot.Otherwise return it or look for a better one.","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1675209600000}
{"reviewTitle":"Lightweight and packs a lot of juice","reviewDescription":"It’s small form-factor and weight makes it easy to fit it and carry around on long walks. The massive 20,000mAh cell capacity provides more than 5 charges for my iPhone 15. I could simultaneously charge 2 phones with the help of 2 USB A ports. I wish it had USB C output ports instead for charging phone. It also comes with lightening cable so one less cable to buy if you’re still using iPhone with lightening ports.For other android based users and devices that need usb c compatible ports, you’ll need A to C cables.I would recommend white over black but go ahead and grab this before it gets sold out. this particular model provides best value for money among all.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"The US-C port doesn't charge","reviewDescription":"I love the product but the reason for the 4 stars is the US-C port doesn't charge. I use the US-C cable to charge my phone and iPad I am very disappointed I wonder why I use the Anker cable.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Don't buy accept used\/refurbished battery chargers.","reviewDescription":"I received a \"used\/refurbished\" Anker PowerCore 20k battery as a warranty replacment after product failure, which after testing several times does not perform as required.  This battery charger does not hold the charge for very long and depletes very quickly.  I am not impressed with the performance of this \"used\" item and very dissatisfied at this point.  I purchased this item for travel originally, but now it has been almost useless on my trips.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Didn’t last 2 years","reviewDescription":"I take very good care of my batteries. And this one wanted a whole lot. I loved it when it worked, but about two weeks ago it stopped taking a charge. So it’s completely useless. The reason I’m leaving the review now is because I had to order another battery. Definitely not the same. Try one that’s less than half the price that has better reviews. So we’ll see.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Great for the 6 months it worked…","reviewDescription":"I am so disappointed because this portable charger has a great capacity and is conveniently shaped for travel. I wish the output had a usb-c option but that wasn't a deal breaker for me. Now, 6 months after really liking this charger it has stopped charging my devices.I have Anker cables because they are honestly the best but I’ve tried 5 different cords (some different brands), tried troubleshooting with resets, but nothing is bringing it back to life. I love Anker so this is very heartbreaking.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Only lasted 2-3yrs","reviewDescription":"This was a great portable charger for 2-3yrs.  But the capacity to charge performance started to dip after that.  The unit has swollen and has cracked the case.  Now it’s good for maybe 1 charge on my iPhone.  I expected more longevity and durability from the Anker brand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Causes Phone to Glitch","reviewDescription":"I bought this to replace a Ravpower charger I had used for many years but would no longer charge. Initially it didn’t seem to be charging my phone (it would disconnect) but I realized it was that my charging cable was broken so I bought a new one. This also revealed to me that while it does have a USB C port, it can only be used to charge the battery but can’t be used to charge your phone from the battery, which seems extremely stupid to me, since I would prefer to use USB C to charge since it charges faster that way. I didn’t have another USB cable so I had to buy a new one. Another thing is that this battery cost $60 which I thought was pretty pricey. The Ravpower one I had previously was not as powerful since it was 16750 mAh and this is 20,000 but I spent $32 on it back in 2017 so spending $60 on a 20,000 mAh battery in 2021 seems very overpriced. In fact I only bought this one becasue I tried to order from Ravpower and they took 2 weeks to just cancel my order. So I figured whatever, Anker is supposed to be a good brand so hopefully it will be worth the extra money (almost double the price.) But the biggest issue is that when using this battery to charge my phone, it becomes very difficult to use my phone. I was trying to take photos and videos in Instagram at an event and I had this plugged in to make sure my phone didn’t die, and I literally couldn’t use my phone. It causes the phone to glitch and freeze and there will be long (10-20 seconds or even more) delays between clicking on something and the phone responding. My phone doesn’t do this when not using this charger. I’ve noticed it comes and goes, and sometimes my phone is fine while plugged in, and other times it slows down and glitches but it’s happened enough times that I am sure it is this charger\/battery that is causing this. For such an expensive item I’m pretty upset at it’s performance. I wish I had stuck with Ravpower which is cheaper and hasn’t let me down in the past. What I will say is that it does hold a lot of charge and recharges my phone relatively quickly, which is nice but it’s what I expected. I did not expect the downsides.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1633305600000}
{"reviewTitle":"Worked for a while then had issues","reviewDescription":"It worked great for about a year. Then, like a lot of other reviews on amazon, the battery pack swelled and cracked the outer shell. I stopped using it due to a possible fire hazard.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Good Brand but mine was defective","reviewDescription":"I ordered this powerbank in the beginning of February since i lost my old one (same one as this one)The first thing i noticed when i got the package is that they dont come with the bag anymore. That stunk cause i used that bag to hold my wires in and i dont have it scattered everywhere.Secondly. After a month and a half of light usage, it doesnt hold a charge anymore. I charge it and the battery indicator says its full or close to it but as soon as i unplug it, it wont work\/charge my devices. This was a real bummer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713571200000}
{"reviewTitle":"USB-C doesn’t work","reviewDescription":"I bought this and the usb-c didn’t work, so I returned it and got a replacement and it still doesn’t work 😩","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Does not provide fast-charging","reviewDescription":"The unit I received did not provide fast-charging on my Galaxy S10, my daughter's Galaxy S10e, or my wife's Galaxy S22.  The listing makes it clear that it is meant to provide this feature.  I contacted Anker support directly and they instructed me to conduct an exchange through them.  Do not do this.  The process took over a month from start to finish and ultimately ended with me receiving a replacement unit that came in a package that appeared to have been previously opened (might have just been the same unit I sent in that was returned directly back to me) that still did not provide fast-charging.  Now the Amazon return window has closed and I have to go through their customer service process to hope for a refund.  Hopefully they can deliver on that at least.Update: Anker's Customer Support replied to my request for a refund and only offered a 10% refund and to have me keep the unit that doesn't do what it advertises.  That's a terrible solution.  I contacted Amazon to explain the scenario and they were able to issue a full refund the way it should have been done by Anker.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"No rapid charge","reviewDescription":"This does not have a USB C port for my new iPhone rapid charger.. only slow charge USB.  Had to return","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Lasts a year","reviewDescription":"Good until it stopped working out if nowhere less then a year after purchase not worth 40 bucks","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Good","reviewDescription":"It works but it has low storage of battery.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Overall good","reviewDescription":"Been a good battery back up, just over 4 yrs old. Case is cracking now so battery is obviously swelling, battery going bad.  It can & does happen especially from cheap ones. Not going to use it anymore due to being a fire hazard now.  Posting info for FYI to buyers of any battery.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"Great buy","reviewDescription":"My sister had this, she let me borrow it. We charge three phones throughout the whole day. The battery didn’t even go halfway. It’s great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713484800000}
{"reviewTitle":"Buen cargador","reviewDescription":"Tiene buena carga, es transportable, es un poco pesado, el usb C solo es para carga del portátil no sirve para cargar otros equipos como dice la descripción","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Too heavy for my preference","reviewDescription":"It was just too heavy for my preference and needs. I returned it and got a 10K unit.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"Overall a good battery - Slow charging time but long life.","reviewDescription":"I like this battery overall.Likes.1. size for 20K mAh2. Price3. Reliable4. Typical good quality from AnkerDislikes1. Slow charge time. I use an Anker Intelligent charger and it takes a long time. Again, its 20K mAh battery2. USB C port is for charging the battery only.3. Hard Plastic case sides. totally susceptible to damage if it falls from bag onto floor.4. Ports should have rubber caps that peel away to keep debris out when the battery is rolling around in you \"travel\" bag or truck box.Overall, its a plus for the money. I trust that the cells will last a very long time as Anker made the battery; but it has very few other features. So, a basic battery that you can use on the job, traveling or off the motorcycle, its a winner. Dont expect to charge it back up quickly.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Best portable charger, but it is heavy","reviewDescription":"The battery life lasts for a long time and can charge an iPhone multiple without depleting the battery life. One downside is that it is heavy, especially when you're using it for travel. It also sometimes turns off while charging, but it wasn't a big issue because it only sometimes did that. Just make sure you check on it a few times when it's being used","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Pretty solid charger overall","reviewDescription":"I bought this charger for a 3 day trip to Disney World, and to my surprise it has so much capacity I actually never needed to recharge it once. And that was for a fairly thirsty Samsung Galaxy S21 Ultra. My only issue is that it doesn't seem to do fast charging, so I had to keep it connected to my phone longer than expected when recharging. But apart from that, it worked great and I had no issues with it. It's a little heavy but will easily fit in most backpacks and larger purses. Would recommend unless you need something to charge in a hurry.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699920000000}
{"reviewTitle":"Lots of charges, buy your own charging cord","reviewDescription":"Purchased this for a 7-day vacation in a foreign land. Worked great, charged an iPad mini and iPhone several times over the week, without needing it's own charge up. Once home, plugged it in with the cord that came with it. Checked it after 8 hours of charging, but no change so left it overnight. Next morning, still showed no increase in it's power bank. Long story shortened: Had to use a higher capacity charging cord from a different device to get it to recharge. The cord that comes with this device isn't meant for its own charging.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701734400000}
{"reviewTitle":"Fire Hazard | Swollen Battery","reviewDescription":"I’ve had the charger for about 6 months and the battery started to swell inside of the battery pack.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Disappointment","reviewDescription":"UPDATE: Anker customer service has contacted me and they have been wonderful in rectifying this issue. Very cordial, professional and helpful.  Top kudos for their customer service team!I recently ordered this Anker battery pack again because I was so satisfied with the first one I had that lasted me a few years. The first one has simply run its course. I did not hesitate to buy another one that is exactly the same.What a disappointment. Perhaps it is defective, but it simply does not work. I hook it up to my phone and it does not charge it. The charging icon does not appear at all. (Yes, the battery pack has been fully charged.)I went to start a return process only to find that Amazon states it is not returnable due to components of the battery pack, which is odd because I have returned other items before and was simply provided with an additional label about the contents of the package.There is a link to contact customer service, but the link goes no where. I attempted to request a refund from the seller, but that leads to a notice that I have no eligible returnable items from said seller.I am good about making sure that I have free returns when purchasing from Amazon and this time I let it slip, but I had no reason to look for that stipulation with this order because I was confident that I would be satisfied with it given my previous purchase.Lesson learned; proceed with caution.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Died after one year","reviewDescription":"It worked fine for approximately one year. Then it simply stopped charging my small electronics. One year isn’t bad, but my last charger lasted three and was still going strong when I lost it. I would not recommend this product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Updated: Doesn’t work","reviewDescription":"Update: the Seller takes consumer concerns seriously. I was contacted after this review and offered satisfactory options. So I am changing from 1 star to 3 stars to reflect that.Original review: Doesn’t work. Waste of money.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Worked great for 4 years until it died","reviewDescription":"Bought this in 2020 and 4 years later, charge capacity was still great but out of nowhere the battery started swelling up and cracked the outer plastic and had to instantly get rid of it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Not for long BP trips","reviewDescription":"Tested:  3 days for iPhone and Apple Watch.  One bar left on return home.  UL yes.  Wilderness tested… prob not the best choice.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Great Battery but doesn’t last","reviewDescription":"This battery has worked great for me. It holds charge well and is a good size! However, I seldomly use it and store it in a cool, shaded cupboard, and after 3 years the lithium battery has expanded to the point that the case has cracked, which is concerning. Anker only provides warranty for up to 18 months and recommends disposing of it. So quality and longevity of this product leaves something to be desired.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"Battery expanding after years","reviewDescription":"The battery was a good source of extra charge for a few years, but over the last few months, the internal battery expanded and it broke the outer shell. Obviously this is not safe and I haven't used it since then. For the price that I paid, I won't complain, it's just a shame as I was recently going to use it on a trip but remembered that it was broken and had to purchase a different one.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Disappointed with Anker","reviewDescription":"Anker has always been our family's favorite brand. Their products have been reliable and long-lasting. However, I'm extremely disappointed that this large power bank lasted less than 6 months.I gave it a 4 for charging power and would have given it a 5 for quick charging power if only it didn't break down on me.  Loved it while it lasted. Too disappointed with Anker.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Decent but broke in less than 1yr use","reviewDescription":"This charges fast and holds a lot! A bit chonky and heavy, and the one USB-C port it has is for charging the battery itself and not other devices so do what you will with that info. Today mine had sadly stopped working for no reason, I did not drop it or anything and i mostly kept it on my desk or bed. I will replace it with a different product or brand, this did its job as advertised but did not last long enough to justify the price. The previous anker portable charger I owned lasted 4yrs through multiple countries and rough use(including deployment so it had literally survived the battlefield),but this broke in less than1\/4of that time. With 90% stationary indoor use. Not totally unacceptable but disappointed. If you’re rich and can replace it often go for it ig.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Disappointed, Not What I Expected","reviewDescription":"I was excited and looking forward to getting this Anker portable battery charger. When it came I could’nt even use it as the cable didn’nt fit in any of the cables I already have.I knew that it didn’t come with a wall charger, but I have already an Anker wall charger? but again the accompanying cable did not fit. I called Customer Service & wanted to order a compatible charger, gave suggestions but said I have to order it from Amazon.Alright. I ordered the Anker Nano Power111. got it working with the charger. Now, my disappointment— I saw the same product with the same Model No1281 that comes with the same Nano power 111 wall charger.WHY WAS THIS NOT GIVEN TO ME INSTEAD?I thought I was saving money for waiting for Prime Days ( I have Prime), but when I add the cost of the Nano charger that was ordered separately, there was really no savings at all considering this combo with the wall charger is a lot cheaper than the supposedly prime deal I got without the charger.Alright done is done. I don’t like returning things unless defective. This one so far seemed ok.Now I want to know if I can purchase the short cables (about 6-8 inches that works with charger - Apple I phone connection.My neighbor lend me his portable battery charger during the tecent snowstorm when we had several days of power outage. It was an Anker with included 2 short cables that I could easily connect battery to IPhone. He told me to get it saying “Anker is the best!” & said Amazon sells it for 49.99. These are the cables that I am looking for and want as I do not like long cables when connecting battery to phone. I also chose the small Nano wall charger because of its portability for travel & even for home use.Where can I purchase these short cables like the short cables that came with my neighbor’s Anker battery charger? I am so annoyed I want to return what I have & forget about it.Incidentally , I also bought another Anker portable battery for a relative Model A1268.There is no problem with hers as she can use the portals with the included cable to charge & her phone cable to attach to her phone.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1603238400000}
{"reviewTitle":"Previous version had full circle of white lights for more accurate battery life detection","reviewDescription":"I almost returned this because after 12 hours of charging it still only showed a faint 4 blue lights, while my nearly identical older model of this charger (which I love) had a full circle of brighter white lights for easy detection of how much charge the bank had left.  I double checked and 4 lights is all you get on this.  It does have a USB and USB C option for charging itself which adds flexibility.  I will see how well it charges relative to the older model which has been terrific and why I bought this one on a lightning deal.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Good quality","reviewDescription":"Anker makes very good portable chargers,this one has the trickle charger as well.  Good value","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Product did not work, was sent replacement","reviewDescription":"Just received the product, and it doesn't work. The portable won't charge, the lights aren't showing up, and I cannot charge my phone. Disappointing for Anker, as I haven't had issue with Anker products before.Update: Contacted their support and was quickly sent a working replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687910400000}
{"reviewTitle":"It is an Anker nuff sed","reviewDescription":"I love Anker and their products. The only drawback to this is that the USB C is input only and not for USB C charging. I wish I would have read the description more throughly but it will still work for us.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"Works pretty good","reviewDescription":"What can I say. Seems to charge all my junk pretty well. Only 4 stars because I paid for a new one and got an obviously used one instead.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"Doesn't offer the best charge times.","reviewDescription":"I hate that this says that it takes 2 hrs plus to charge my Samsung Galaxy s10+. While the older 10000mah power bank takes way less time than that.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Excelente producto","reviewDescription":"Cumplió 95% mis expectativas. Sólido, muy buena terminación y carga muy bien. Debe cargar al menos 3 veces un Samsung s21. Todavía no lo puedo comprobar porque lo cargué 1 sola vez y realicé 1 carga. Si cargara un poquito más rápido sería 5 estrellas. Igual es 100% recomendable","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"one of the best chargers out there.","reviewDescription":"I own several of these chargers. I also have some solar chargers but to be honest they are too slow to charge. This one will charge fully in a few hours and charge my phone 3- 4 times.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Good","reviewDescription":"Only thing I don't like is it's heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Good reliable charger but battery expanded and cracked the case","reviewDescription":"Full disclosure, Purchased the charger back in later 2020.Now two years in, the charger still works fine.  It charges well but there is one noticeable flaw.  The case has developed a crack right in the center along the full length of the case.It looks like the battery expanded inside, this is a notable safety issue.  If this is indicative of the life span, then the span is just under 2 years.","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1678838400000}
{"reviewTitle":"Cord doesn’t work","reviewDescription":"Great battery, but iPhone cord that came with it was useless. Thankfully a different one worked. Overall worth the price","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"Great battery charger!","reviewDescription":"Battery charger works great! The only thing is the battery status light. It’s so tiny that you barely see it! Hard to tell if it’s fully charged or not.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1686009600000}
{"reviewTitle":"Great for travel.","reviewDescription":"Overall, I was quite happy with this device for charging while traveling and didn't have access to power next to the bed where I was staying. Next time I travel with it, I would make sure my charging cable was specific to my device (Samsung Galaxy) and I think performance would improve.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680480000000}
{"reviewTitle":"Holds a lot of charge capacity","reviewDescription":"Like the item, takes awhile to charge. That’s why only 4 stars but probably will have a long life because it charges slow?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687737600000}
{"reviewTitle":"No case","reviewDescription":"Ordered this last year and it was so good that I decided to order a second one this year.  This year,  it did not come with the mesh\/cloth carrying case.  Otherwise,  appears to be same model.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1682985600000}
{"reviewTitle":"Great for small devices, not for laptops","reviewDescription":"I use this to power my GoPro Hero 10.  Has enough juice to record for many hours.  2 USB-A ports to power multiple devices, haven't tried that.Not for laptops, however.  Won't charge Dell Latitude 5420 laptop, which uses a 65w USB-C charger.  You'll get an \"insufficient power\" warning and it won't charge.Still a winner in my book.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"Heavy and slightly bulky","reviewDescription":"This battery does charge your phone more than once. The only thing is that it is heavy, and slightly bulky.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"Acceptable","reviewDescription":"Charger works fine, instructions are not thorough both in the package and website.  I do have questions I cannot find answers for, the questions are simple.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683849600000}
{"reviewTitle":"It can charge your phone like 5-6 times before needing to be recharged.","reviewDescription":"My only complaint with this thing is that you can only use the usb to charge. i suggest looking into this companies newer portable chargers.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684195200000}
{"reviewTitle":"Good, but no Charged status","reviewDescription":"Great charger, but does not show charger charged status. Still a good product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687824000000}
{"reviewTitle":"Nothing fancy here but it works well","reviewDescription":"Charges up OK and see,s to charge my iPad a couple of tomes before it needs a recharge. Good quality case and looks OK. Anker is a good brand and I expect it to last awhile.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"It doesn’t have the mAh capacity printed on it","reviewDescription":"While it’s a great battery, it doesn’t have the mAh capacity printed on it, so I can’t use it for my international travels.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Kind of heavy, wish it had usb-c output, but lasts forever","reviewDescription":"Like others have written, this power bank is a bit heavy, so may not be your best option if you're planning to take it backpacking or are concerned about weight. You can charge the power bank itself with a usb-c input but weirdly, there's no way to charge your phone if you use a cable that has a usb-c adapter for output. You have to use a regular usb charger for it.Upside is that when it's fully charged, it lasts forever. You can charge two phones at the same time with it, too.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Best portable charger i’ve found to date","reviewDescription":"This is the best power bank I have ever bought. It’s the only portable charger I’ve been able to find that charges my iPhone XR and my MacBook Pro 13. Other chargers I’ve had in the past have a very low charging rate, but this one charges quite fast and without any issue. The one thing that happened was that the usb connection got loose and can’t charge with usb cable anymore, but the usb-c cable works fine. It’s also not huge and fits in my backpack well without creating too much weight. Additionally the battery life isn’t too bad. If the charger is at 100% and my phones at 5%, I can get it to 100% in an hour or two. If you want a charger that is quick and charges your phone and computer, give this product a try and I’m sure you won’t regret it","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1685836800000}
{"reviewTitle":"Works fine, takes forever to charge","reviewDescription":"So far happy with charger. Works fine with my phone and iPad. Holds a good charge. It is sturdy and travels well.  However, it takes forever, I mean hours, even a day to fully charge it. I’m also nervous letting it charge overnight. I’ve tried different charging cords and so far no difference. Hopefully I’ll find a compatible cord.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Doesn't support fast charging","reviewDescription":"Doesn't support fast charging on galaxies . Ok though","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Doesn’t charge my iPhone 12","reviewDescription":"I took this power charge bank all the way from US to Italy to use it when I needed extra power to find out too late that it doesn’t charge my iPhone. I couldn’t figure it out after some frustration. I don’t think I can return the item as I don’t have the original packaging any longer. Didn’t think that it would be a problem but lesson learned. Now I’m stuck with a brick and worth about as much as a paper weight.Update: upon returning my purchase, Anker made contact and was helpful in replacing my order. They were quick to respond and took care of my issue. Thank you Anker for your great customer service!","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"The PowerBank of this bran are the best","reviewDescription":"nothing bad to say about this brand of batteries except that I needed a type c input to charge the devices","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"Great overall, just not a fan of having to press button to turn on charging","reviewDescription":"Previous banks Ive used never required button press to turn on device. If you like to keep it inside a bag while traveling, youll have to open your bag to start charging every time you connect your phone.Other than that its a great power bank","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Kept me charged!","reviewDescription":"This charger worked well and the price was great! No problems at all! The only reason that is was not 5 stars is that it’s a bit “clunky and heavy”. I like to travel light in my purse.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Seems like a good product","reviewDescription":"Haven't used it enough to rate charging, battery life, or use during travel. Main issue when it arrived was that the directions for charging and use were not very clear. The user manual can definitely use an upgrade. You would assume such a device would be simple and clear; but it really is important to illustrate clearly how to connect the device to charge it; and how to use it to charge other devices.After I've used it a few times, I'll be back with a review addition; but for the moment, I think the above is important to know.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643241600000}
{"reviewTitle":"Disappointed!","reviewDescription":"Unfortunately, this takes over 24 hrs to charge up fully and then it takes forever to charge my phone! I was hoping to use this for my outdoor adventures but it will only charge my S22 twice, I needed it to charge my camera also! I've had much cheaper banks perform much better! Disappointing for sure!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1672876800000}
{"reviewTitle":"It did not charge my phone an iPhone 14 pro","reviewDescription":"It doesn’t charge my phone and I want to return it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"Does not work for iPhone 13 charging wire","reviewDescription":"What I don’t like about this charger is that it says it’s for iPhone 13 pro max but the wires that come with the phone is not compatible with the portable. It fits in the slot but it doesn’t charge my phone unless I have the regular iPhone charging wire. I spent all this money on a portable so that I can use it with the usb-c wire and for it not to work. The battery life is amazing but I want my $70 charger to charge with the wire that comes with the iPhone 13","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644451200000}
{"reviewTitle":"Disappointed","reviewDescription":"I bought this one because my previous one was so good. This one not so much it takes much longer to fully charge my phone","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Does not fast charge devices.  Good otherwise.","reviewDescription":"Overall, a good battery pack.However, I bought this specifically for going to amusement parks because my battery runs out and now with covid, they want contactless everything thru the park apps, so I need my phone to be powered up and working.Unfortunately for me, it's not a speedy charger.  I was at 20% and my phone said it would be at 100% in about 2 hours.  Wall charger was about 1\/2 that.  It's fairly clunky to charge because there's the battery pack and the cord and the phone -not easy to work with in the park.  It's okay, if it can be left in a locker while riding a ride\/waiting in line.It did take a bit of time to charge.  So plan for that.  And it will power things and charge them while using, but again it's slower than I was hoping for, for my use.","isVerified":true,"ratingScore":3,"reviewReaction":"17 people found this helpful","country":"United States","date":1594339200000}
{"reviewTitle":"Attractive Design, Quality You can see and feel, Fast Charger,Perfect","reviewDescription":"I Like everything, looks nice, feels nice, not bulky like other 20000 powerbanks, i just love it, now i guess i need more, since everybody in my home loves this lil guy, everybody wants to use it, just perfect lil device, i always recommend what i really like and trust, and what i dont i always take the time to write a review, so take it from me, you cant go wrong with Anker in any of their Products, i had been using anker for years and until today i keep on getting their stuff  and keeps getting better and better, they always come out with something new, just try it and you wont be dissapointed and of you trust other brands after trying this  you will change your mind, and if you have any issues you will love their customer service, is just great, Anker You Are Just The Best.....!!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1596326400000}
{"reviewTitle":"It's great but Anker needs to have one for USB C output","reviewDescription":"It charges for a while and that's alright, I usually leave to charge when I'm out or during the night, but I hate that it doesn't have a USB C output. Like come on. But other than that, it's solid. I take it everywhere I go and isn't that heavy. Comes with a little bag to carry it in.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649030400000}
{"reviewTitle":"Useless instructions","reviewDescription":"I am not sure how good this product may be.  I have never purchased a portable charger before.  Obviously some of the functions are maybe intuitive for seasoned users, but for me it is frustrating.  The instructions are useless.  There are four lights that may a may not light up, what do they indicate?  Can I use both charging ports at once, one appears to not work?  They need to provide done simple instructions as to how to most effectively use this device rather than just showing pictures of the device.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1630454400000}
{"reviewTitle":"Usb-c only for input.  Not fast charge.","reviewDescription":"Expected newer tech","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Died after 8 months","reviewDescription":"Lasted 8 months and stopped working. When it did work, it worked great.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Input failed after 5 months","reviewDescription":"Holds charge well and very sturdy. Product did however, fail to charge after only 5 months of use. One of the inputs will not charge the device so I though that was very disappointing since I am not an iPhone user and do not use their “Lightning cable” to charge the maker device using spare input","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"Damaged","reviewDescription":"Took 2 weeks to arrive and it was damaged when it did arrived","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701216000000}
{"reviewTitle":"Not Their Fault?","reviewDescription":"I bought this power charger because my neighbor raved about how great it is - for travel, for everything. So, when I received it, I immediately put it on charge. After charging the unit for more than 24 hours, the unit (battery) only charged to 40%. I then tried it on two different outlets (as recommended by the manufacturer) and still, only 40%. I sent it back with no trouble. I think this unit sat on a shelf for years (they do have a shelf life) and just lost its mojo. There is NO place on the unit or the box it came in that gives a manufacturer date. To be fair, I've bought batteries from Amazon before and they were in similar stages of ineffectiveness. I think these batteries just sit for too long in warehouses. However, I did not replace it for fear of the same issue.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1613865600000}
{"reviewTitle":"So so heavy","reviewDescription":"My old power bank was several years old and only charged my phone to 50% before dying so I was looking for a replacement and have had good experiences with Anker products. While this product is an improvement, I definitely didn't expect it to be so incredibly heavy and big. It almost defeats the purpose of having a portable charger since it's so heavy I don't want to carry it around. It also takes all night to bring the bank to full charge, though once it is charged it can charge my phone several times over.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1651795200000}
{"reviewTitle":"Died (see update)","reviewDescription":"Worked great until last week then died. Support was kind and very responsive but since it was 3 months past the 18 month warranty, no help. A discount or coupon code for another device would be a good idea as now I will want to find another brand to try… this was too expensive to last only just past warranty period.Update: tried a different “cord” and it works 🤷🏼‍♀️ so far so good…","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1653868800000}
{"reviewTitle":"Slow charge speed. short battery life, don't work well on type C amazon charging cable.","reviewDescription":"Slow charge speed. short battery life, don't work well on type C amazon charging cable.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"Heavy","reviewDescription":"I don’t know if it actually works because it was too heavy for me to travel with so I didn’t take it on my trip.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Choose a Better Product","reviewDescription":"Save your money, this particular Anker does not last long. I purchased it on Sept 20 & for the last week the charger itself will NOT charge past the 2nd level. And in the middle of charging my phone, it just stops charging. No warranty that I’m aware of AND its outside of the return window. Currently searching for a more reliable product with longevity.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1669766400000}
{"reviewTitle":"Not exactly as advertized","reviewDescription":"My wife bought this because it is supposed to have two ports for charging devices this it only had one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Bought for travel","reviewDescription":"I think we might have received a defective item.  Only one of the port works, so we could y use it the way we u tended as two people traveling and using it to keep phones charged because we take so many photos.  I like this item in theory,  it arrived fast, and it works good enough, but it’s still disappointing to receive a defective item.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1687910400000}
{"reviewTitle":"Only lasts less than 10 months","reviewDescription":"Great for multiple charges while it lasts.  Less than a year","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Not very impressed","reviewDescription":"It's a nice compact size, but the charger take a long time to charge. Using it to charge a phone takes at least twice as long as plugging into the wall, which surprised me since it was advertised as being a fast charger. It works, but it's very slow.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Lighter and smaller","reviewDescription":"Long charge than other brands","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Defective","reviewDescription":"Charged only up to 40%. This happened once before as well with one of their charges I purchased before. Returned.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"Battery expanding and cracking case","reviewDescription":"I have had this charger for a little more than 2 years.  Now the power bank battery has started to expland and cracked the case","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"EHHH NOT THE BEST","reviewDescription":"I went back and forth on if I should get this charger for when I camp or just as a backup if my phone dies. I'm not super tech savvy  so based on reviews, when I needed it and price, this is what I chose. It holds it's charge for a long time, but doesn't seem to actually charge my phone unless I hook my phone up to it and not use it while charging for many hours. A few times I noticed that my charge was actually going lower rather than higher while hooked up. It's not reliable that's for sure. It's heavy, but I expected that. I keep it with me even though it hasn't really worked well in case of an emergency and hoping I can get a couple bars if needed, but I'm looking for something better, more reliable, and lighter. I would not recommend this one.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1656201600000}
{"reviewTitle":"I was fooled...","reviewDescription":"The usb-c port is only to chrgae the portable charger, it's not an output to charge my phone. That's kind of trash...","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Did't work as wouldn't charge my devices  Took overseas and now too late to return","reviewDescription":"Bought to charge devices while overseas but wouldn't charge them.  Now too late to return as I would like a refund  Company was very good in contacting me and credited me with a return","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"Can’t be charged with USB C cable","reviewDescription":"A bit heavy because of the capacity so keep that in mind. Lots of ports, however, can’t be charged using USB C, only outputs.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Misleading description","reviewDescription":"Yes, it is BIG and it is HEAVY--those unwelcome features are known and understood.  BUT...NOTE THIS MISDIRECTION QUOTE FROM WEB SITE:  \"With both a USB-C and Micro USB input port, you have more options over how you recharge.\"  This leads the reader (if s\/he is not a lawyer) to believe they can use BOTH USB C and Micro to charge--just as you can \"discharge\" two devices at once.  YOU CANNOT FIT B-O-T-H Micro and C male charging jacks into this device.I have it on a special \"fast charger\" now, and we will see if it is at 100% in 10 hours--if not, it's going back.","isVerified":true,"ratingScore":3,"reviewReaction":"31 people found this helpful","country":"United States","date":1657843200000}
{"reviewTitle":"Not compatible with IPhone 15 pro max","reviewDescription":"Not compatible.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Takes long to fully charge, don’t know the battery","reviewDescription":"Takes long to charge, charge does not last long","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"The cons definitely outweigh the pros.","reviewDescription":"Pro looks good and has a lot of power.Cons heavy and for the price to only have a USB C for charging the battery isn’t great.I sent it back and bought a cheaper battery with USB A and USB C charging ports.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Slow to charge","reviewDescription":"If you dont have and Iphone the charger is very slow","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692144000000}
{"reviewTitle":"Only 50% charged after 48 hours!!","reviewDescription":"Update: even though the return window had passed, Anker saw my original review & immediately reached out to me to offer a refund or replacement. I wish all Sellers on Amazon had this level of customer service![original:  When charged up, this charger worked great. After 4 months, it won’t charge farther than 50% no matter how long I have it plugged in.  For the price, I’d expect it to function better.]","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1675296000000}
{"reviewTitle":"Quality Lacking","reviewDescription":"First thing I noticed was a rattling sound coming from inside the case. Within the first month, the case has started to bulge as the battery expanded. While plugged into a device to charge, the battery will turn off and stop charging and I have to press and hold the battery's button to resume charging.That aside, it will fully charge my phone about four times on one charge. It also seems to hold a charge and cleared TSA.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674345600000}
{"reviewTitle":"Not like their other products","reviewDescription":"I had another anker portable charger that I could use like 4 times in a row to charge my phone or tablets. For some reason with this model I only get one charge out of it. It doesn't even hold a charge either. It goes dead after a few days of not in use. I'm a big anker fan, but this particular model does not cut it. I wish I could trade it in and get a magsafe anker charger instead.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1666224000000}
{"reviewTitle":"AS OF RIGHT NOW DON'T KNOW IF DEFECTIVE OR JUST PROBLEM WITH SOFTWARE. :(","reviewDescription":"I stay in area where bad weather (tornadoes) occur often so experience power outages several times out of the year. I purchased this a while back and all has been good until...I recently purchased some airpods pro and the charger is not working with the airpods. Is my only apple product so far and the airpods don't come with wall charger and this Anker charger was my only hope to charging the earbuds but unfortunately when I plug them in, the Anker charger doesn't even recognize them.And now I'm on Amazon ordering other chargers in hope those will solve my current problem.Also have an iPad on the way so I will test that to see if that charges, but as of now it seems the port does not work and will probably have to order another charger for those outages","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1624665600000}
{"reviewTitle":"It’s ok","reviewDescription":"I’ve used it twice and it barely charges before it shuts off. It comes in handy but definitely not worth the price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"Not as described","reviewDescription":"This power bank won’t charge with USB-C to USB-C cables. Which are the standard cable Apple provides. Therefore it won’t charge your iPhone 15 or newer iPads. The website should have this highlighted much more prominent. Because they also state on the page that the power bank offers versatile recharging options with both USB ports. Which is vague in itself since everyone just assumes it’s to recharge our devices and not the damn Anker thing.I’m giving a 1 star because I’m out of the country now and won’t be back in time in the window to return it. So essentially I have to keep it when I already have an older model. I bought this specifically to be able to charge my iPhone 15 without the need to buy more cables. Grrr","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Buyer beware!  These chargers can possibly explode!","reviewDescription":"So I purchased this charger back in 2021.  I used nothing more than an Anker branded desktop charger that I purchased from Walmart to charge this device on my nightstand next to my bed as well as Anker branded cables and the lithium ion battery inside the charger has swelled so bad that it cracked the case completely and is not usable.  The case is made of cheap plastic so you might not want to not get the higher capacity chargers and get the 13,000 ma one.I reached out to anker warrnty support for a replacement and they won't honor it as they only give an 18 month warranty even though it is a defective unit.  I ALWAYS used to buy Anker products but after this happened I won't anymore.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Barely made it a week.","reviewDescription":"Idk if this review will be posted or not because they don't want people knowing the real issues. But I bought this portable charger for my mother in law that lives in a care home. We thought that this would be easier for her since she can't do a lot of walking or reaching. Her phone\/ tablet dies fast so we thought this would be easier for her. She got it on the 23 of April and it stopped working 4 days ago and only used it 3 times in that.My mother in law just had surgery 2 wks ago and has been moved to Cali for a few months for physical therapy. When the nursing home aides packed her stuff for her trip to Calif. they didn't pack the portable charger because it didn't work.We contacted Amazon and they told us to contact Anker so I did I received and message where they wanted me to send them a bunch of information which I did that including the temp address when my mother-in-law is staying until the middle of Aug. So I just got a message back where they want to send more information and then at the bottom of the email they tell me that I could have my mother in law send them a picture of the charger and that they have to get the defective item back before they can give her a replacement charger. They completely disregarded everything I had written them in the first place. They didn’t even pay attention to the fact that I had told them my mother in law was out of state and didn’t have it with her. It’s sad that they do this kind of thing to people and refuse to help them when their product fails. We only wanted a replacement product not a refund but now we will be contacting amazon again in hopes that we can get this settled.We mainly only purchased ANKER  products in our home but now we will be finding a new brand to support.","isVerified":true,"ratingScore":1,"reviewReaction":"65 people found this helpful","country":"United States","date":1620000000000}
{"reviewTitle":"Incredible, incredible design flaw!","reviewDescription":"This expensive product suffers from an incomprehensible design flaw: unlike all USB power banks I’ve been using in the past ten years, this power bank turns the outputs off when itself plugged to a charger. This is incredibly stupid as it means the product is useless as a pass-through power device that sits in between an intermittent power source and a consuming device that must be kept running. A case in point is a camera that can be connected to one of the output ports while the input port is connected to a car’s cigarette lighter powered USB power source. When the car’s power is on, the power bank should charge itself while still powering the outputs. When the vehicle is off, the camera keeps working, as it is now powered from the power bank only. When the car power turns back on, the power bank tops itself up, and the camera that is connected keeps being powered, undisturbed. This is how all the power banks I’ve owned so far work, but this Anker product turns the outputs off as soon as its input power is turned on, as a result the camera is no longer being powered and completely depletes it’s own battery. You have to unplug the power bank from it’s charger in order to turn the outputs back on. This is an example of an extremely short-sighted design decision that makes the product completely useless for some scenarios that are\/were perfectly covered by existing, older and often less expensive products that don’t try to be too clever and allows charging and consumption at the same time. Using-while-charging is an extremely common scenario: every phone can do that, every tablet, every camera, and every USB power banks I know except this one can do that. I wonder what the Anker engineers were thinking when they though it was OK to turn the power off when the bank gets charged. The output power should never be interrupted for as long as there is power in the internal battery. If the charging current is less than the consumer current then the bank’s will of course get depleted, but at a slower rate. I’d give minus TEN stars for this shortcoming. I’m now left with an expensive $50 brick.","isVerified":true,"ratingScore":1,"reviewReaction":"69 people found this helpful","country":"United States","date":1596585600000}
{"reviewTitle":"Defective and will not take return","reviewDescription":"Received yesterday, charged the product and then tried charging different devices with different cables but not releasing charge.  Seller website claims \"For 30 days after the date of purchase, return your undamaged Anker product and receive a full refund for ANY reason.\" This order was placed through \"Anker Direct\".  I now ordered a new charger from the official \"Anker Store\" through Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Junk - ZERO STARS","reviewDescription":"If i could give this zero stars…This charger is junk! Bought this in April, used it twice and now we can barely get it charged just to use it!  It’s been plugged in for the past 2 days and only charged 3 dots worth. It is also VERY slow at charging a phone. Of course the return date was May. 😠 We have bought these for our kids in the past and have had no problem. DO NOT buy this product!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721174400000}
{"reviewTitle":"Died just outside warranty","reviewDescription":"This was a weighty but very large (in terms of battery capacity) power bank that saved my and my traveling friends' devices on many a trip when we were far from power outlets or had yet to pick up a charging adapter. It's a little inconvenient to use with no USB-C charging input which tripped me up on one vacation when I'd only packed USB-C cables, but relatively easy to remember to just bring full-size USB cables. However, at 25 months of ownership, I one day saw the battery was bulging and it was definitely no longer safe to charge and keep using. In my time owning it, I never dropped it or pierced it with anything, so this was disappointing. I purchased a different battery bank and have owned it for almost three years with minimal power loss and no physical damage occurring. I like Anker for their charging products, but probably won't get another battery bank from them again.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1712620800000}
{"reviewTitle":"Button broken, Not charging.","reviewDescription":"I ordered the Anker Portable Charger Power Bank 20,000mAh battery pack with PowerIQ and it doesn't charge. The singular button interface also doesn't work. The process to return is not through Amazon but through Anker (AnkerDirect). What a rip-off. I don't think I'll ever see my money back.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724889600000}
{"reviewTitle":"Really Anker?","reviewDescription":"I used to think Anker products were decent. This one doesn't work out of the box. Cannot charge my phone. Thanks for wasting my money and time. Will look for other companies now that I know Anker is selling trash","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Will fail when you need it the most","reviewDescription":"It only worked for a year and a half before it started dying. Holds a full charge but will not power up until you “jump start” it by plugging it into the wall first - then it shows a full battery. Worthless because I need this to be mobile. Found out the hard way with almost being stranded overseas due to low battery on my phone. Anker sold out and is no longer a reliable quality brand. Waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"Capacity not as advertised","reviewDescription":"Battery capacity not as advertised. It only took 18000 mAh after a full discharge and did not charge at the 2.0A listing in the manual. False marketing. Used tested Samsung OEM 3A charger with a quality cable to ensure it wasn't the limiting factor.Update: ran 2 more full discharge and charge with same results.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1630540800000}
{"reviewTitle":"Super fast charging but died after 8 months of minimal use","reviewDescription":"This battery charger charges your phone at lightning speed. However, device stopped working after 8 months of very minimal use. Do not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670716800000}
{"reviewTitle":"Power not working","reviewDescription":"veey bad quality","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Very disappointing","reviewDescription":"This battery pack is a brick.  It's extremely heavy and for no good reason.  It charges slowly and only a few times before dead.  It takes longer to charge the pack then it provides battery life.  I am a huge fan of other  Anker products which I why I purchased it.  I used it for a few weeks and returned it.  I will try another Anker product and hope for a better result.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1585785600000}
{"reviewTitle":"Lasted 7 months","reviewDescription":"We have 2 of the 325 Power Banks.  The last one we purchased, lasted 7 months.  The other one is about 1 1\/2 years and still works.  When it charges, it is 5 stars. When it is dead, it is trash.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646179200000}
{"reviewTitle":"I ordered a like new product","reviewDescription":"It did not come with the charger cable or the sleeve.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681344000000}
{"reviewTitle":"Does not have quick charge for samsung","reviewDescription":"The description says it supports Samsung, and it goes on and on about quick charge, but it cannot quick charge Samsung devices. They should make this clear and include a link to the ones that do. Very frustrating, and now I have to return this and wait for my money back in order to get one that actually works for me.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1619395200000}
{"reviewTitle":"Charges very slow.","reviewDescription":"Very slow charger","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Works for 2 weeks","reviewDescription":"It started off great, but after two weeks or so, it was only able to charge an iphone in full two times before being at zero battery. So I'm not sure if this is what's expected of an external battery but I'm pretty sure everyone else said it should charge a phone at least 3-5 times.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1622592000000}
{"reviewTitle":"ANNOYED!","reviewDescription":"Didn't come with a cord to charge or connect to my phone. Now I have to try and find one or return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658620800000}
{"reviewTitle":"Solid, but a bit heavy","reviewDescription":"A bit bulky and heavy to carry around in a smaller purse.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Decent product. Overall good value.","reviewDescription":"Slow to charge itself, but seems to retain its charge for a long time. Lack of USB-C port for charging new iPads a bummer. Will need to purchase, yet again, another adapter. Overall a good deal.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"Plenty of capacity in a compact size.","reviewDescription":"I have always been a fan of Anker products, And this power-core portable charger is no different. The battery pack has an amazing capacity to recharge your devices on the go with the option to trickle charge smaller devices such as AirPods and your Bluetooth devices. It’s great to have the option to charge the battery pack with both standard charging option and USB-C charging for fast charge. The sleeve provided with the battery pack helps to carry battery pack and all the necessary wires along with it and also protect it from scratches. Only thing I wish that this device should have came with is a LED to use it in emergencies but its no biggy. I have only had this battery pack for roughly 3 months and it’s working great so far.Update Jan 2024 - Its been few years now using this and still going strong. I actually dropped it couple of times but nylon sleeve gave some protection and prevented it from cracking.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1609286400000}
{"reviewTitle":"I love anker products but…","reviewDescription":"…with this one the only thing that would have made it a 4 star product is a usb-c outlet.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"We could charge two cell phones and one hearing aid once on a charge.","reviewDescription":"It took a while to fully charge then charged our things one night.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Convenient","reviewDescription":"After a full charge,  we were able to recharge our phone 4\/5 times.  Great asset for use during vacation","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"Seems fine but","reviewDescription":"Fine charger but give me a MICRO USB and not a type C? Comeon guys","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"So far so good","reviewDescription":"So far so good. Bought this for a music festival. Lasted 5 days with no additional charge. Charged two phones during those 5days to 50% or higher just to get us by. Passed airport security fine (I have TSA PRE CHECK). Make sure you push the USB port in all the way to get a good connection. Charges super fast if you put your phone on airplane mode (30% to 50% in 20mins or so). It does take long to charge the bank, but I don’t see that being a problem…. Charge it at dinner time and by breakfast you should be good. Other reviewers have complained the bank stops working after a month so I will come back and give an update then.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1659225600000}
{"reviewTitle":"SO FAR SO GOOD STILL NEW","reviewDescription":"SO FAR SO GOOD STILL NEW","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"Decent","reviewDescription":"Would be good if it could charge using a usb-c cable.Otherwise it’s not bad","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1694304000000}
{"reviewTitle":"Not as long lasting as I thought.","reviewDescription":"The charge of the battery but self doesn’t last that long. 3 or 4 charges of my phone and it’s dead and it takeS almost 15-16 hours to recharge itself fully. Quite bulky. This is my first external charger so maybe I don’t know enough about them, but I wish it had one more charging port on it but I guess for the price it’s a good deal. I needed up buying more charging cables to keep at work\/in my car\/around the house Because this would die too quickly to be a “main source” of charging. Would’ve liked more if it were solar because it’s only good in places you don’t have a plug.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1593734400000}
{"reviewTitle":"Does NOT charge ipad","reviewDescription":"Pretty decent, however I found out on my vacation that this device does not have the juice to charge my iPad Pro even when not in use. What’s the point of 20k battery if it charges everything so slow. The battery itself takes alll day to charge plugged up to my 96 watt MacBook fast charger. For the price I expected better.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1652227200000}
{"reviewTitle":"Takes 3 days to fully charge device!","reviewDescription":"I’m grateful to have this as a backup power to carry with me but it takes 3+ days to fully charge this device.It’s been like this the entire time that I’ve owned it and has not gotten any better.Even just charging up to the next level (from 3 bars\/dots to 4 bars\/dots) takes over 24 hours, it’s insane.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1652659200000}
{"reviewTitle":"Slow Recharge Time","reviewDescription":"I have always liked Anker products and when I needed a new power bank, I turned to them. But here is the problem I have. It arrived with 1\/4 charged and it took 29 hours to fully charge! In addition, I just finished charging my iPad and it's now down to half charge. For the price I paid for this charger, I think I'm better off getting a 10,000 mAH one for a much lower price","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1641254400000}
{"reviewTitle":"USB type B cable!","reviewDescription":"Everything is okay with this charger but are you kidding me? They put a USB type b cord with the device? Dear Anker if you are reading this please send me a USB type c. I love your products for many years","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1659916800000}
{"reviewTitle":"Too big and heavy","reviewDescription":"Bigger and heavier than my phone. And did not come with the stated C cable. Came w another cable. Am returning.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681257600000}
{"reviewTitle":"Cumple perooooo","reviewDescription":"Cumple con lo que dice, llego con dos pinto de luz y me dio para 4 carga, soy iPhone X. Pero el cargador que trajo no lo quiere cargar. No se que hacer","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1667260800000}
{"reviewTitle":"Died in under 2 years","reviewDescription":"Battery started bulging, enough to crack the case on both sides, then stopped functioning, in under 2 years.  This is the second time I had an Anker battery fail prematurely.  I did buy the identical unit as a  replacement and will give Anker one last try.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1659225600000}
{"reviewTitle":"Awesome!","reviewDescription":"Jan 2022 Charges devices fast, but don’t like how long the actual power bank takes to charge. 10+ hours. Love everything else about it, works great!Update: 9 months later. It takes 2 entire days to charge now and only charges about 2.5 full charges for iPhone 12 Pro Max. Still use it but only bc it was so expensive, and can’t spend on something better at the moment","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1642377600000}
{"reviewTitle":"Expensive","reviewDescription":"I'm an Anker fan. I've bought many of their products. Chargers, speakers, etc.But I was very disappointed to receive this charger. Small in size. Big in price. Beware.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1667779200000}
{"reviewTitle":"Won't charge ipad","reviewDescription":"Seems to charge phones ok, but won't charge my iPad. I don't understand why. It took a long time to charge this power bank. Approximately 10 hours or so right out of the box. Only giving it 3 stars because I needed it to charge all my devices.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Doesn't charge fast","reviewDescription":"Overall product is good but does not charge my samsung galaxy s23 ultra fast","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"Specs not clear","reviewDescription":"Looks like a great product, and works well, except that the USB-C port is an input port… can’t use my iPhone charger to charge my phone… only to charge the power bank itself.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Eh","reviewDescription":"You can't charge your phone via USB C. Lame","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1701561600000}
{"reviewTitle":"Charges kind of slow, battery life is ok","reviewDescription":"The charging speed is slower than I expected. It will however charge a Galaxy 23+ 3 from dead 3 times on one charge.Also it takes forever to charge, like 16 hours","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"Could be better","reviewDescription":"It’s a great item and it charges quick but the one I got only lasted a few months and then just died on me. I love and trust the brand but I rather tell people to maybe stay away from just this one.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686787200000}
{"reviewTitle":"USC to USC cords do not work","reviewDescription":"My son and I use these for our out of state track meets. There's only one thing that is very frustrating. The Type C port does NOT work on these.  It has to be a manufacturer problem. I bought one a couple  of years ago and the Type C port does not work. I bought another one last week and the Type C port does not work. Only the USB port to Type C devices works. The other port works fine. Such an inconvenience, especially since I bought new cords thinking the same probably wouldn't exist 2 years later.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675814400000}
{"reviewTitle":"Case cracked in only 2 years!","reviewDescription":"I love this external battery charger. But I'm so disappointed that the case is already cracking only after 2 years! That's why I gave it three stars. Otherwise I would give it five stars. It's my go-to external battery and I loved it, but now I have to buy a new one.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Anker is slacking","reviewDescription":"Highly disappointed that Anker no longer gives a mesh bag with it's power banks. The last three I have ordered did not have them.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Weight","reviewDescription":"It is to heavy to carry around in a purse or pocket.  Wished I hadn’t purchased it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"I wanted to like this charger","reviewDescription":"I live in an area that inexplicably has power outages when there is any kind of thunderstorm. If the sky goes boom in any way, I lose power. So basic emergency preparedness dictates that I needed a way to charge my phone during these outages. I charged it the way that I was instructed, but it doesn't take a charge. I have generally had a good experience with this brand, but maybe I just got a lemon?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696377600000}
{"reviewTitle":"Great product, false advertising for fast charging","reviewDescription":"Works great except right on their own page here it says under feature: FAST CHARGING.. this is not a fast charger just a basic charger so therefore you get 1 star.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Takes forever to charge your phone","reviewDescription":"Got the charger. It is big and beefy, which I do not mind. Quality of the battery pack feels solid and well built. Read the reviews that it takes a while to charge the battery pack itself - I left it charging all night, which I do not mind since it supposedly provides multiple charges to your device. Going on a trip in two days, so I thought I would try it out today. My phone was at 32 percent. Started charging my phone and took a nap. I woke up two and a half hours later, and the phone was only at 60 percent. Yes - two and a half hours and only charged 28 percent. Phone is a samsung S21+, and I was using the charging cable that came with the phone. On a plug in charger, it can charge the phone from 1 percent to 100 in about an hour. I would not buy this again for the price","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1628208000000}
{"reviewTitle":"Only charges about 33%","reviewDescription":"The power bank only charges to 4 blue dots in, about 1\/3 of the way around.  I had the same issue with another ankner power bank that started after two years and was disappointing, but this one is doing it right out of the box.  I tried all the trouble shooting advice and nothing worked.  I’ll exchange it for a new one, but any issues with the replacement and that’ll be the last anker product I ever purchase.Update 6-4-2022:  another defective one, same exact issue.  I went through trouble shooting with Anker directly and they confirmed that the unit was defective.  I really want one of these to work but I’m getting sick of returning them, I’ll try another brand.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1653955200000}
{"reviewTitle":"Deadness","reviewDescription":"Only used it a couple of times and now it's completely dead. Previous Anker power bank also died sooner than I expected. The one before that lasted years. Seems like their quality is going downhill. Shame as they were my trusted brand for power accessories.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Stopped working \/charging after just 2 uses.","reviewDescription":"Stopped charging after just 2 uses. We bought the power bank right before our travel knowing we have a long flight ahead of us, fully booked days with adventures and exploring. The first time we used it we were so pleasantly surprised - the power bank charged both my android and my girlfriend's iPhone in just a few hours - full charge. Then the battery died right before we moved to another Airbnb. We were able to only partially charge it since full charge requires 16 hours. We used the 2 dots we had and then the battery died. We plugged it in to charge again and it's been \"charging\" for 3 days now. We chacked the outlet on other devices - works, we checked the charger itself on other devices - works, yet th empower bank is not charging and keeps blinking 1 dot. Without any changes. 50 bucks for two uses? Nope, returning it now! Don't buy","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1630627200000}
{"reviewTitle":"Not Up to Par","reviewDescription":"I don't know if I received a faulty product or what, but the day I received this power bank, I immediately plugged it in to charge.  18 hours later it indicated it was fully-charged and ready to go.  A week later, the power went out during a wind storm and I needed to charge my phone, so I pulled out the power bank and it was only at 25% charge!  How did I lose 75% charge from just sitting on my desk not in use??  I charged again when power was restored, checked the charge status 4 days later, and once again it was at 50% capacity despite being unused.What good is a power bank that discharges itself even when not in use?? Since I'm now past my return window, I'm now stuck with a rechargeable brick.  😕","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1575676800000}
{"reviewTitle":"Does not work on iPhone 12 and 13","reviewDescription":"Brought this for our upcoming international trip a couple months ago, didn’t bother to test it, just tried it on our iPhone 12 and 13 pro max, didn’t work on either, read through the instructions, did everything right, but still not recharging the phones, not sure if this is a defective battery or just not compatible with our iPhones.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Garbage","reviewDescription":"The one I got must be a lemon because the previous Anker charger I got lasted me days and weeks but this one is called after just a few days. Haven’t even had it for more than a year.  So disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"A powerbank is a Lithium Ion battery","reviewDescription":"No stars because I haven't used it yet. The powerbank came in a package with alarming notices that it contained lithium ion batteries and could not be transported on a passenger aircraft. There was no such info in any product description I read anywhere. What I learned is that this powerbank IS a litihium ion battery and may only be taken on a plane in your carry-on. Too bad about the missing info on Amazon and everywhere else!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"It melted 😔","reviewDescription":"I personally am never buying anything Anker ever again, it's a liability. One morning I woke up and there was the Anker power bank plastic was melted... scared me. I immediately threw it out, lasted less than a year.  There are other good power battery banks out there like voltaic, please invest a little more and get something safe.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1700092800000}
{"reviewTitle":"Damage charger !","reviewDescription":"after 2 months it has died doesn't charge my iPhone something definitely wrong with this piece I have bought anker before and this is the first one thats done this.. now I cant return nor exchange it either...!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Stopped working","reviewDescription":"Product bob longer works","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Producto no funciona","reviewDescription":"Es una estafa producto que no sirve di una ves ya intenté de todo y no funciona solo se carga pero no da energía a otros dispositivos","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"USB-C does not work","reviewDescription":"Incredibly disappointed as Anker has generally been a good brand. Charging a device via USB-C doesn't work and I tried all of the troubleshooting steps provided on the manufacturer's website. I've had a RAV power bank for years and it is infallible. I would look elsewhere for a power bank if you're thinking about this one.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Power bank dead after first charge","reviewDescription":"This is the first time I’ve an issue with an Anker product I’ve purchased, wrote to Anker support and just awaiting a response. Will update once I hear back questioning if I should use a large power bank like this or keep with using a smaller PB due to how much damage these larger units can cause if there is ever a fire.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Not made to last","reviewDescription":"Ordered this product for international travel.  Used a few times a year.  The unit died in less than 2 years.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"The usb c on this is input only. No output 💀","reviewDescription":"The usb c on this is input only. Many other battery bank can be charged by USB C AND charge your phone through SAME USB C port. Oh and it can't pass through charge meaning it cannot charge other device while itself is getting charge all my other random banks can do it. Come on anker!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Quit charging at 14 months","reviewDescription":"I know stuff doesn't last forever,  but 14 months? You have a reputation. Do better.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707004800000}
{"reviewTitle":"Read the product description carefully! NO RETURNS","reviewDescription":"I've purchased multiple portable charging solutions and all have been returnable with the exception of item purchased here. Product is very heavy and bulky and by no means portable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Don't buy this - it doesn't hold charge and takes forever to charge","reviewDescription":"I bought this for a trip overseas. I charged it before I left and had the device off. When I arrived it was already at 25% battery. I again charged it at the hotel - it took about 6 hours to build up to about 75% battery at which time I left on a trek. I took it with me and used it to only partially charge my phone a total of 2 times, at which time the battery was dead. For how little charge it gave it is not worth the weight or price","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Charger","reviewDescription":"Turns off by itself while charging, takes forever to charge phone. Shipper sent wrong model , product.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"waste of money","reviewDescription":"very bulky, heavy, only lasts for few hours even when fully charged. I want to return","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Doesnt charge","reviewDescription":"So I bought it last feb 2023 and I didnt use it until this month of may 2023. Its not charging, I have 23 percent and instead of the batt percentage going up its going down 22 then 21. I wasnt even using my phone I turned off everything even put my phone to airplane mode but didnt help. I prolly got e deffective one cause I had 2 anker before without prob and its charging fast! Im just dissapointed with this one and I wasted my money now cant return it cause its past the return window.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1684195200000}
{"reviewTitle":"Stopped Working","reviewDescription":"Stopped working almost exactly one year after purchase. Very disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Easily Damaged","reviewDescription":"This was my 4th  product by this company and it was my worst experience. The super slow charging was a pain but then the ports got loose. The USB-C port failed to work from day 1 and after the charging port became damaged and stuck I tossed it away. This didn’t last 3 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"End cap is incredibly thin and cheap plastic.","reviewDescription":"I was sitting in my computer chair, ready to plug this into my phone, when it slipped out of my hand onto the floor, a 20\" fall. Well 90% of this device is covered in very tough plastic. However, the end cap, which in my case is where the charger landed on, is pathetically cheap, and busted apart.I now have a mostly unusable charger from what I had assumed was one of the Premier electronics accessories companies.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696896000000}
{"reviewTitle":"Charging rate is super slow.","reviewDescription":"I used to have RAVPower power bank and lasted 2 and a half years which isn't bad.  When it broke down, I bought this expecting Anker power bank will be as good or even better due to its popularity.  I was wrong.  I tried charging my Samsung Galaxy S21 5G with different cables.  It takes 4 hours to charge with original Samsung cable.  It takes 2 and a half hours with Aukey cable.  Even with Anker cable, it takes 3 hours.  I tried all these cables with an original Samsung wall plug and they charge at least 2 times better.  I am tech savvy.  I had Fast Charging on in battery settings.  I even tried turning on Super fast charging with no luck.  I trusted Anker products all my life but this power bank let me down.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1622160000000}
{"reviewTitle":"Loses charge within 2 weeks when not used","reviewDescription":"I charged my mobile just once with the battery bank on full charge. Then left it unused for about 10 days. The noticed that it has lost almost all of it's power, and needs to be charged again to be usable. This has happened multiple times now. Sometimes the lights showing charge level are always on as well, even when no devices are connected, with just the cord inserted!Haven't seen these happen with older Anker power bank models. This model seems defective.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694736000000}
{"reviewTitle":"Worked for 10 minutes","reviewDescription":"I initially let the battery charge overnight. Tried to charge my phone which was at 50% just to see how fast it would charge. After 10 minutes the battery pack turned itself off. I tried to press the button and it just flashed at me would not turn back on. I unplugged my phone and plugged it back in and the lights came back on and charged for about 5 minutes and then died again.  I replayed this scenario about three times before deciding to return it.  I expected more from the name Anker.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1680480000000}
{"reviewTitle":"Is a 4-hour cellphone charge acceptable?","reviewDescription":"When I plug my Samsung note20 ultra in, it says \"Charging 1h 55m until full\" for about 15 seconds, then the estimated time jumps to 3 hours and 58 mins! Im not using the phone or anything while charging, and the note is 6 months old. Is this an acceptable charge time? I've found it very impractical over the first few months of use as I've traveled.I'm disappointed Anker, please let me know if I have a defective bank or if I spent $59 on the wrong power bank for the features that matter to me. :\/","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638489600000}
{"reviewTitle":"Not compatible","reviewDescription":"This is not compatible with apple usb-c cords. It will not charge my Apple Watch.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695340800000}
{"reviewTitle":"It is huge, but has major flaws.","reviewDescription":"It is the largest that can be carried on a plane, so that is good, but it only outputs on USBA, so it is slow, and too large to carry on a daily basis.  It can charge mini USB or c, but cannot discharge c-to-c. We kept it for the size, but for the price I expected more out of Anker.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1655856000000}
{"reviewTitle":"❌ Doesnt work with USB-C outlets","reviewDescription":"this powerbank has all 3 outlets as USB only, no USB-Cs, so you wont be able to charge airpods or watch if you have got USBC cables for them.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"Issues","reviewDescription":"This does not fast charge.Also, other review photos and videos shows this battery coming with a little bag.  There is no bag anymore with this device.Very disappointed.  For $50 I really expected more from Anker.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Incredibly long charging time, for okay battery life.","reviewDescription":"Simply put, this was disappointing. It takes almost a full day to charge to max, but lasts far less than that, just to use it to charge my phone. I'll use it for now, but I regret choosing this particular product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674691200000}
{"reviewTitle":"Does not fast charge.","reviewDescription":"Just got my powerbank thinking it fast charges and its just a regular charge. False advertising when they mentioned its a fast charger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"It lasted just 6 months. Its dead now. Does not charge or turn on.","reviewDescription":"It lasted just 6 months. Its dead now. Does not charge or turn on.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1694131200000}
{"reviewTitle":"But why do they keep breaking?","reviewDescription":"This is my second Anker charger. These things aren’t cheap, so I’m not sure why I have to keep replacing them. I bought my current one in June suddenly it won’t take a full charge anymore. It only charges to 3 out of 4 bars. Honestly, if you’re going to throw money down the drain for a charger you may as well find a cheaper one, because this one breaks just the same.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1639180800000}
{"reviewTitle":"Compatible with apple phone","reviewDescription":"It is not compatible with my apple phone. I was disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694649600000}
{"reviewTitle":"Not what I expected. Awkwardly big. Short life.","reviewDescription":"I have purchased two other versions of Anker battery packs and love them!!! And they are half the price of this one. I assumed this was the best of the best. I am not impressed. It is very big and awkward. It overheated my phone the first couple times I tried using it. IT DOESNT LAST MULTIPLE CHARGES!!!!! For the size.... I expect more life in this thing! I am not happy with this purchase and wish I would’ve bought one like I’ve had in the past. Way better and way cheaper.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1616112000000}
{"reviewTitle":"TAKES FOREVER TO CHARGE","reviewDescription":"Heavy. Slow to charge. Both ways.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Not fast charging S20FE","reviewDescription":"I have several anker battery products and i like the quality of the cell, how ever i noticed this 20000mAh battery pack is not a fast charger. I have an anker 10000mAh battery pack purchased 6 year back, which is a fast charger though.  Who want to buy a regular speed charger these days! Disappointed with this battery pack.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638748800000}
{"reviewTitle":"Not charging","reviewDescription":"I had a maker charger before and I loved it and I need a new one for traveling but I’m being nice by giving it a 2 stars I have been charging this portable ever since it got to my house which was yesterday afternoon and I checked again this morning and it was barley charge 😭😭😭😭 . I have being using anke for years and I will still buy from them but I’m sad .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607126400000}
{"reviewTitle":"Make sure you got everything in the box","reviewDescription":"Mine did not include a charging cable and mesh bag that its supposed to have. My friend order the same thing from same url, received his today as well, and he got both. Disappointed in not getting what I paid for!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1664150400000}
{"reviewTitle":"Product stopped working after 1 year","reviewDescription":"Love the size, perfect for travelling.  However, 1 year after very light use (I probably used it 10 times max for travels) the battery is no longer working.  For the price range, I expect better durability.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1654646400000}
{"reviewTitle":"Worked and then stopped","reviewDescription":"Worked for about six months and then the charging capacity broke. Now it takes about six hours to charge my phone, no matter the cable I use. Very frustrating as this was not cheap and I've treated it well","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664928000000}
{"reviewTitle":"Heavy","reviewDescription":"Too heavy to walk around with","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Stopped working…","reviewDescription":"Bummer that it stopped working after a few months…","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Stopped working at first charge","reviewDescription":"It keeps turning off at the two dots when trying to charge something. Not sure what's up with that but it is only week one first charge.  Always have had great luck with Anker not sure what is up.  Looking into returning","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658361600000}
{"reviewTitle":"Worked great until it didn't","reviewDescription":"This was great while it lasted.  I could charge my phone around 4 times before I needed to charge up the bank again.  Last month however it stopped charging my phone.  It'll still charge itself, but can't pass that charge along to my devices.  Kinda blows that it didn't last a full year even.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634947200000}
{"reviewTitle":"Not as Expected","reviewDescription":"Charges slowly.  Heavy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Look for something else","reviewDescription":"Just received 2 days ago. I like the solid feeling in hand. It seems to be of quality build. But 1)you need to reconnect the USB side of the cable each time to charge your phone; 2) No LED display of existing power; 3) Can not charge phone while being charged. 4) Charging and being charged is slow which is no big deal to me since I’ll charge it before I go to sleep.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1616803200000}
{"reviewTitle":"I'm afraid it will explode","reviewDescription":"I've only had this for about a year and now it's cracked and expanded and I have to throw it away. I'm glad it didn't explode though. While I had the battery pack it was pretty good it charged my phone multiple times but I'm sad it didn't last more than a year.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1637884800000}
{"reviewTitle":"Slow charging","reviewDescription":"This doesn't fast charge like my last one did. DISAPPOINTING!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Can't give 5\/5","reviewDescription":"Battery lasts really long. really really long. 5\/5.Slightly heavier than I expected. 4\/5.Can't charge my ipad well enough. 1\/5. If I'm using the ipad and charging in parallel, the battery keeps going down, and eventually gets turned off. I have to stop using the ipad and charge. Don't like it - my previous battery with 10000mA current could charge it to 100% while I was using the ipad.","isVerified":true,"ratingScore":2,"reviewReaction":"9 people found this helpful","country":"United States","date":1605484800000}
{"reviewTitle":"Works for few weeks","reviewDescription":"This is unfortunate. I thought it was a good product. It stopped charging after few weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685836800000}
{"reviewTitle":"Issue with using type C charging cable","reviewDescription":"I bought this portable charging battery for extra power supply while on traveling. It good enough for couples of charges.  There is issues with type c charging it’s only used for the usb to C but for my battery it doesn’t work from typec to iPhone charging","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649808000000}
{"reviewTitle":"Boat anchor heavy no wall outlet cord included","reviewDescription":"This thing is very heavy and perhaps useful for charging laptops but to carry this thing around with you in your pocket for your iPhone noway, don't go there. No wall outlet cord included therefore if you are in a hotel with out a USB jack you are out of luck in charging this colossus.  No instructions included what so ever.  Once you open it you have to figure it out by searching google.  It maybe a useful battery but its negatives outweigh its strengths for me","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1575849600000}
{"reviewTitle":"Disappointing","reviewDescription":"I've had Anker products in the past and they have been amazing, this one however isn't as good as previous models, it hardly charges my pixel 6 and one of the outlet ports is broken out of the box.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1657065600000}
{"reviewTitle":"Okay for the money","reviewDescription":"I have had  a more expensive anker charger for over 6 years and it can charge my s22 ultra like 4 times no problem but this one only seems to charge it maybe twice before needing a charge and it takes forever to fully charge. Like I plug it in at bedtime and it is still not charged when I wake up and my other anker is and lasts longer. But since this one on under $40 and my other one costs like $60, I guess you get what you pay for.Update: seller contacted me and was very helpful to correct the problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688515200000}
{"reviewTitle":"USB-C Port Provides No Output and Quite Heavy","reviewDescription":"It is a large and heavy battery. USB-C provides no output, only input. Most Apple cables now come with USB-C adapter on one end and and Apple adapter on the other. This battery will not work to charge Apple products with this type of cable. It is difficult to see charge level unless almost looking directly at the button. Overall, a solid battery, but without some important features that prevent me from recommending it or buying it again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"The LEDs are unreadable outdoors","reviewDescription":"When using outdoors (which seems like one the major use cases) I can’t read the LEDs to see how much power is available or whether it is even charging. It’s a pain.  It has a lot of power and seems to get the job done. The price was right.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Great little backup battery on the go","reviewDescription":"I love Anker products, so I don’t really have anything bad to say about them. This is a great battery backup that’s easy to pack in a bag. Only draw back I see is it doesn’t have a USB-C output. I should’ve read the specifications more closely. Works great as a battery for an in-luggage charger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Not good for newer phones","reviewDescription":"Wish I would've shelled out the extra 20 bucks for one with fast charging. Works well for charging gadgets; we primarily got it to keep in the diaper bag when we forget to charge the stroller fan which it does well. But when either of us plug our phones into it they charge super slow; like if you're thinking you'll plug your phone in for ten minutes at the bar and you'll be good for another hour, don't buy this charger.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"I have mixed feelings about this power bank","reviewDescription":"This power bank has a lot of capacity and can charge multiple devices before it needs charging. However, I have noticed that whenever I use it charge my phone, my phone battery runs out much faster than if I had charged it with my regular wall charger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"Last long but bulky","reviewDescription":"The charge lasted a long time on this but the weight of it was heavy for my intended use. Wanted to use for a backpacking trip where weight matters.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1699660800000}
{"reviewTitle":"Lasts quite a long time but takes for ever to recharge. Wonky USB connections","reviewDescription":"So initially I really was looking for a heavy duty battery for a full day of walking around where I might not have access to an outlet, on that front it did very well charging even two phones. My gripe with this however is two fold, both of the output ports are USB-A and the input ports are Micro USB and USB-C; either this battery is really old or someone has their priorities mixed up. I need at least ONE USB-C output as well, and had to suffer around looking for old school USB-A cables to really use this thing. Lastly it takes darn forever to charge even with high-amp\/rapid charging blocks. Not the quality I expect from Anker, really. Poor design decisions make this a less than ideal choice.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677628800000}
{"reviewTitle":"Doesn't fast charge my note 9","reviewDescription":"I was looking for a replacement for my Aukey 30000mAh portable charger and thought this one would be sufficient. Unfortunately, even though it advertised as such, it does not fast charge my phone. Charging is slow to normal at best, which is not what I was looking for.EDIT 6\/28I did revise my review score. Customer support reached out to me immediately upon my initial review and insisted on rectifying the issue. They honestly went above and beyond to try and diagnose, and when the issue could not be resolved they offered to either replace the item with one that would work or provide me with a full refund. Completely hassle-free and have left me a satisfied customer. I'm leaving this particular product at 3 stars sldue to the fact that it didn't work as advertised for my phone, HOWEVER, I would definitely purchase another product from this company.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1654560000000}
{"reviewTitle":"NOT SUITABLE FOR IPHONE OR APPLE DEVICES.","reviewDescription":"This portable charger would be perfect for any other phone. Excellent charging power & battery life. Great for traveling. Can charge multiple devices at once. BUT IT RUINED MY IPHONE BATTERY.  I used it maybe 7-8 times during my 2 weeks trip to Europe. And after that I noticed my iPhone 13 Pro requires more frequent charging. Battery life depletes faster than before. I got the phone last year when it was launched. It’s in perfect condition. Instead of getting the Apple certified Mophie Powerstation from Apple store, I got this one after watching lots of videos\/reviews. And none of those reviews mentions that it compromises the batteries. If you have Apple devices then get the portable charger from Apple Store. Those are Apple certified and compatible with Apple devices. If you have Samsung or any other brand it would be an excellent choice!","isVerified":true,"ratingScore":3,"reviewReaction":"16 people found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"Anker Portable Charger","reviewDescription":"I found this charger by trying to look for the more expensive option since it’s a charger and didn’t want to cheap out. I am happy I went that route!! I’ve been amazed with the quality of it, it’s heavy and not cheap which is good because that means it will be resistant to drops and stuff. It is about as big as my phone. It is simple to use and works amazing. The battery life on it is great and I like how it doesn’t use battery if you have nothing on the other end of it so I can leave my usb in and as long as it’s not plugged into anything it won’t waste battery I think that is good for keeping my usb with it. My only concern at first is that my usb wouldn’t fit in all the way but I realized it was just right because it was new and I pushed it in harder and it fit. Which is a good thing because that means your usb will not fall out and it will stay in there and not keep falling out and being annoying. It uses usb 3 and it says “IQ” technology on it and it must be way better than a normal charger because this thing charges fast and has amazing battery life at the same time. I also like that it has 2 inputs (how you charge the battery itself) it has usb micro and usb C inputs which is cool. My only complaint is that it doesn’t have usb outputs espcially since the newer iPhones come with that type of charger. I’m so happy I picked the Anker charger and didn’t cheap out!!! Great product!!!","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1697068800000}
{"reviewTitle":"HUGE battery capacity","reviewDescription":"I've bought 2 of these power banks now: 1 as a gift and the other for myself. This is the perfect power bank for traveling since it is able to charge my phone multiple times before it needs to be charged back up. It's a bit on the heavy side, but I'm also able to walk around with it in my back pocket as needed if I'm charging my phone on the move. It does not have quick charge, so my phone won't get back to 100% as fast as my wall charger, but it's nice to not have to be tethered to a wall as well.I have tried using this power bank to charge up my Macbook Pro and didn't have great success charging and using it at the same time. It might do just fine if the computer is sleeping, and will need to test that at some point.As someone who doesn't do a ton of traveling, I still use this power bank quite often even around the house. Moving my phone from room to room with the power bank is much more convenient than having to remain close to a wall outlet. It's really an impressive battery for its size and I would definitely recommend this for anyone looking to keep multiple devices charged or who does a lot of traveling.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1704931200000}
{"reviewTitle":"Worth the money","reviewDescription":"Anker products are great. Very well made and always function well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Work Good.  Good amount of power storage.","reviewDescription":"Fast charges my son's iphone 13.  doesn't fast charge his watch though that may be the magnetic base that limits charging speed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Best charger on the market!","reviewDescription":"The Anker PowerCore 10000 is a compact and lightweight portable charger that offers excellent performance and value for money. It features a 10000mAh battery, which can provide up to two full charges for most smartphones or one full charge for most tablets. It also supports Power Delivery, which means that it can charge your devices at up to 18W, which is significantly faster than traditional portable chargers.  While specs promise 2 full charges it seems like I will often get 5 or 6.In my testing, the charger was able to fully charge my iPhone 13 Pro in just over an hour. It also charged my iPad Air 4 in about two hours. I was also impressed with the charger's efficiency. It was able to charge my devices for a longer period of time than other portable chargers of the same capacity.I primarily use the charger to keep my smartphone charged as I am streaming my daughter's softball games.  It can stream a 2-day tournament with out even worrying about the cell phone running out of juice.In addition to its excellent performance, the Anker PowerCore is very well-built. It has a durable plastic casing and a cross-hatch texture that makes it easy to grip. The charger also comes with a USB-C cable and a travel pouch, so you can easily take it with you on the go. Strangely enough the pouch is extremely handy and one of the best features of the charger.Overall, the Anker PowerCore 10000 PD Redux is an excellent portable charger that offers excellent performance, value for money, and build quality. I highly recommend it to anyone looking for a reliable and portable way to charge their devices.Pros:Compact and lightweightSupports Power Delivery for up to 18W chargingFast charging performanceEfficient battery lifeDurable constructionTravel pouchCons:None that I can think ofOverall rating: 5\/5 starsRecommendation: I highly recommend the Anker PowerCore 10000 PD Redux to anyone looking for an excellent portable charger. It offers great performance, value for money, and build quality.","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1699574400000}
{"reviewTitle":"Excellent battery pack","reviewDescription":"I bought two of these for camping. They work great for charging ours phones and headlamps. We have Galaxy S22's and get 4 full charges easily off each one. The smart charging works great, shuts off the battery pack when the phone or other device is fully charged.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"The perfect charge!","reviewDescription":"This charger is awesome and lasts forever! Although it can feel a little heavy it is exactly what you want to have on hand when traveling or going to festivals! You’ll never be worried about having a dead battery with this charger!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"This thing has saved my life","reviewDescription":"This is the best travel companion I’ve ever had. I used to be constantly stressed about preserving phone battery and whatnot while waiting for trains or flying or just walking around - no more. It’s got such a nice form factor, slips in anywhere, and it feels like I never need to top it up until I’m back home. Writing this review from a train station while charging from it.I would get the one with a USB C output next time, but I would never consider a different model.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1724025600000}
{"reviewTitle":"I use this power bank a lot!","reviewDescription":"I love this power bank, although my only complaint would be its bulkyness and the fact that all my type C chargers have type c charger endings but that isnt this chargers fault. Ive had this charger for now about 2 years? And I have dropped it a lot and only about a month ago did i break an outside peice. So its very durable! Its battery capacity is amazing and can last for a long while! (abour like average 4 days for me or longer) Its display for the battery life is good as well! It tells you how much battery the charger has left!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Still holding a ton of charge, useful during travel and power outages","reviewDescription":"Bought this a while back and it still is trucking right along. Holds about 4-5 charges worth of my iPhone SE. Very useful during travel and power outages to keep your stuff topped off.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Worst charger I have ever had from Anker.  Got it in December getting rid of it 3 1\/2 months laater","reviewDescription":"Got it in December getting rid of it 3 1\/2 months later.  Wont charge half the time.  Waste of money","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Charger Stopped working in some inputs after 2 months","reviewDescription":"Charger worked fine in all inputs the first month after I bought it. The second month it stopped charging my iPhone in some of the inputs. I went to the store and they tried new cords. It still didn’t work. I was traveling and desperately needed certain inputs to work. This charger’s quality is POOR, UNSATISFACTORY for some of the inputs.  Buyer beware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Stopped charging after two years","reviewDescription":"Bought this in July 2021. I don’t use it that much, maybe once or twice a month. Now when I try to charge it , it won’t charge past the second blue light. When I try to use it, it dies after charging my phone for about an hour. Tried charging it through both inputs, same result. A little disappointed, it’s a really good product and I wish it lasted me more uses.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1691625600000}
{"reviewTitle":"Don't bother","reviewDescription":"I purchased the Anker power core 10000 in 2018, which works great and completely charges a smartphone in about 20 minutes. So I expected that the same brand, twice as powerful, twice as heavy, twice as big, would be just as, if not better.Nada.As in, my smartphone has been plugged in for 8 hours, and has gone from 20% to 30%.Total waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Typically Love Anker","reviewDescription":"I bought this for my grandma who loves Facebook more than I do, but needs her phone to have enough battery to take endless photos. I purchased one in June 2022 and it recently stopped taking a full charge and would only get up to one light charged. I figured she had worn it out, so I purchased another one on February 5th, it has already stopped taking a full charge and she can only get up to two lights charged no matter how long she keeps it on the charger.  I have an Anker power bank that I purchased over 3 years ago and it’s still working just fine, unsure if it’s just this specific product or if the quality has gone down.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Takes way too long to charge","reviewDescription":"I don't know what accounts for the disparity in time, seeing a lot of reviews saying theirs charged in six to ten hours, but mine took a full 24 to charge for the first time. Which just isn't reasonable or efficient for \"on the go\" use. Using it to power one single device, however, quickly revealed that the wait was not worth it as it drained half of the battery in a few hours. Can't even imagine trying to power 2 at the same time.I don't recommend it at all. For 40 bucks less you can get a bank that will charge much, much faster and be more useful and practical to take on the road. For 40 bucks more, you can get a full-blown portable power station with a lot more features\/uses that will hold a lot more power.I can't think of too many situations where this brick will actually be useful. Don't recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1649894400000}
{"reviewTitle":"Does not charge while charging","reviewDescription":"So my old anker power bank I bought in 2013 charges while it was being charged.I could plug my devices into the Anker to charge while the Anker was plugged in to a charger in the wall, go to sleep and wake up to everything with a full charge.I’ve only had this one night and both my phone and ipad still need to be charged this morning.I paid twice as much as my old Anker and lost functionality!I’m absolutely frustrated! Now I got to go, and use the power bank first thing this morning.What am I going to do at 2 o’clock when I need it again?I called customer service, only for him to confirm that they took that functionality away. That function is no longer available in any of their power banks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653523200000}
{"reviewTitle":"Stops Charging","reviewDescription":"From the beginning, I thought I was doing something wrong. But now I don't think so. Connected up to my Apple watch or iPhone it just stops charging. The hardware being charged isn't charging completely. You have to push the button on the bank to get it to start charging again. Not a Happy Customer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Did not charge","reviewDescription":"I have a Samsung s22 ultra. I charged this portable charger completely so that I can have enough battery to take videos and photo. Did not work at all. It stated USB connected but no indication of a charge. Very dissatisfied.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Not what I expected from anker","reviewDescription":"Normally when it comes to electronics, anker is hands down one of the top, but this product came completely defective. I tried to give it time to see if maybe changing cables was the problem but the charging is too slow, and it constantly stops charging and I need to unplug and plug the cable. When I do get to use it for at least an hour, its battery gets my phone maybe to 60% (from 0) and then the battery pack is dead. Defective from manufactury","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"SOOOOO FRUSTATEX!!!! Outstanding product and customer service!!!","reviewDescription":"I bought the first one of two of these in December 2020. By January the device itself would not charge. I wrote a review and anker customer service emailed me and offered to replace! Customer service was top notch! However, this second charger the same thing just happened again. The device itself won’t charge. It is wonderful when it works but I will not buy another anker charger. I am not hard on this charger at all. If I’m using it, it’s either in my lap ( I’m in a wheelchair) or sitting on a table. I haven’t dropped it or anything. It looks brand new. SOOOOOOO FRISTRATED!!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1613865600000}
{"reviewTitle":"Malfunctioning usb-c port","reviewDescription":"This charging unit will work great for my travels, unfortunate the usb-c port does not charge any of my devices. Talked with customer service and they suggested an anker usb-c cord that was supposed to be compatible but it still won't charge and I need it for our recent travel. The USB ports work but for the money felt like they should all work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645401600000}
{"reviewTitle":"Takes awhile for a full charge","reviewDescription":"Initial review:  Arrived within Prime delivery window.  As noted by other reviewers, the Power Bank takes a LONG time to fully charge.  Out of the box, the indicator lights showed 25 percent charge.  To get a full charge using a USB-A cable powered by a wall charger, it was approximately 24 hours until the light indicator showed a full charge.  If you're going to need that much backup power available, make sure you start the recharge process early!Haven't tested it's ability to recharge or run devices yet.  Will post a follow on review after using the device.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1614470400000}
{"reviewTitle":"hard to tell if it is charging","reviewDescription":"My biggest complaint with this charger is that you cannot see if it is actually charging without looking at the very tiny lights inconveniently located on the bottom of the front face. I've had this brand before but not this model and my other one had a very large readout on the that displayed the remaining charger life as well as telling you it was operating. This one is very, very difficult to see if it is actually on and charging.That's a huge negative for any devices that are 'touchy' and don't always take a charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618185600000}
{"reviewTitle":"Amazing charge, but possibly faulty to soon.","reviewDescription":"Had to return. Usb c to usb c stopped working. Tried troubleshooting for about two weeks before return window nearly closed.This battery pack is definitely amazing. Bisbee the main feature I wanted in a battery charger for my phone didn't work after just two weeks.Regular charging ports worked fine still. Could get super charging speed and adaptive fast charging on Android products. Wife used on iPhone and could get a quick charge as well. Worth looking at if you need a roughly 4 phone charge battery park.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1621728000000}
{"reviewTitle":"Charging phone is slow.","reviewDescription":"Charging a Galaxy S21+ from 37% to 100% took close to 4 hrs. Tried several other times and decided to send back for a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1677888000000}
{"reviewTitle":"Item returned: Underpowered for my needs","reviewDescription":"Bought it to power my HTC Vive Pro wireless kit, charged it (takes ages), connected it, it didn't have enough juice, repacked it, returned it.Note: they never advertised it for this use. It's probably ok if you want an inexpensive battery bank for your iPhone.Bought the Nimble charger instead (more expensive brand), super happy with how quickly it charges up and the fact that it can power my headset longer than the controllers can hold a charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628899200000}
{"reviewTitle":"Trust Anker!","reviewDescription":"I originally had the square model but apparently the charging port was damaged and I had to shell out money for another one. No doubt that I would go with another Anker! Their chargers are worth the money and last quite long. I use it for travel and throw one in my purse for an emergency charge. It's great that all Anker chargers come with a bag, which is really helpful in storing a charger cable with it. I wouldn't go with any other portable charger. You won't regret buying from Anker.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1616371200000}
{"reviewTitle":"Doesn’t Charge Phone via Fast Charger","reviewDescription":"I thought this charge would be able to charge my iphone via my type c cord but it doesn’t.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"I don’t see the wrap.","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Lasts a long time but heavy","reviewDescription":"Only negative so far is the weight - this thing is noticeably heavy in your pocket. Despite that, charge lasts a long time and powers up phones quickly. Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"It is Heavy.","reviewDescription":"I should have read the specs before assuming I could include this with carry-on.  It is heavy for even check in I would imagine.  Maybe the battery life and charging power are perfect for those who have more need than I.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"A Smart Buy.","reviewDescription":"Purchased this to use at an all day amusement park in Florida (which will not be named). We recharged two iPhones twice as we worked through 10 hours of fun, rides and and park apps. Love the looks, speed of charging, ease of use  The little carry pouch expands just enough to slide in the cords. I purchased the white and it still looks brand new, wipes off easily. Only one dislike, a bit heavier than expected.  My cousin liked it so well she tossed hers and ordered one on Amazon, caught it on sale!","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1659225600000}
{"reviewTitle":"Great power bank","reviewDescription":"I have 5 Anker power banks (different sizes).... This was a gift !!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686700800000}
{"reviewTitle":"this works","reviewDescription":"I purchased this charger during a power outage that lasted 4 days and it became very annoying to be going out to my car to charge my phone. My neighbor recommended this charger. At first I was upset when I realized the cord sent with the devise did not fit my iPhone 8; I then remembered she had an Android. It doesn't matter though as a USB port is always a USB port,  I realized I could my USB cord from the charger to my phone. Perfect fit. I have been using the Anker charger now for several weeks and I find it very convenient. once charged i can use it for a full week to keep my phone charged. No regrets and I would recommend. Too bad the charger didn't  come with 2 black cord, one for iPhone and one for Android users. That would have earned it 5 stars","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1612051200000}
{"reviewTitle":"Good Power","reviewDescription":"Can fully charge my cellphone 2-3 times. Just wish it had a carrying bag like the last one I purchased.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684368000000}
{"reviewTitle":"good charger but too heavy","reviewDescription":"This is a good power bank but it is too heavy for travel. I had to return it and bought a small and lighter one. Not sure about the battery life - i didn't try it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678752000000}
{"reviewTitle":"Split Open and Melt","reviewDescription":"Item defective, but waited until after return period to show up.  Bottom of unit has split open and appears to have leaked material under crack which is discoloring the plastic. If I had it to do over again I would’ve returned upon reception: the item was packed without any padding to protect it from being bang around during shipping, and it seems like it certainly was, no drops since purchasing it! :(Edit: was contacted within a day by Anker customer service, who handled this brilliantly and immediately shipped me out a new unit along with a prepaid label to return the old one.  So far the new one is working fine; I've used several Anker products and this is the first with which I've had any problems, so I will chalk this up to a defective unit and call it good.  Will update to five stars in the future if it works as good as the rest of their stuff has in my experience.  Thanks to Anker for quickly sorting this out!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1589673600000}
{"reviewTitle":"Great powerbank, but no C Type","reviewDescription":"No C type charging. A little old compared to today's tech.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686873600000}
{"reviewTitle":"Didn't Receive a Storage Bag","reviewDescription":"Took 16 hours to charge to full capacity.  Fits nicely in the hand and not too heavy.  Charged my cell phone in about an hour and half.  My biggest con...very disappointed I didn't receive the nice bag with my purchase and is the reason I didn't give it five stars,","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Burst into flames! Could have lost our home or worse!","reviewDescription":"It was a good charger for about a year. Yesterday, my husband - THANK GOD - heard a crackling noise and went towards noise to inspect and witnessed it go from sparking to actually bursting into flames! He panicked and never having had experience with how to put out a lithium battery fire, tried dousing with water. The house filled with smoke in 5 seconds. Fire finally went out and FD came to follow up. They recommend smothering battery fires in the future. No problem! Will not be buying this or any similar device again. Just not safe.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Bad news","reviewDescription":"On the 33rd day it only charged to 75% it would not charge further 😢","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Don’t buy! Fire hazard!!  ☢️","reviewDescription":"Although I’ve owned this for over three years, this shouldn’t happen.  Recently it developed a crack and started bulging out on both sides.  This is a definite hazard!  It could start an electrical fire if you continue to use it.  Please be careful.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Not good item","reviewDescription":"I have written twice explaining that it doesn’t charge and still waiting a respond","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Junk","reviewDescription":"Ordered this power bank because of solid reviews.  Bottom line… this piece of crap won’t charge my iPhone 15 Pro or my iPad Pro (2nd Gen). Tried different cables. Every time I plug it into either device, message pops up and says “Cannot Use Accessory.  This accessory used too much power”.  For whatever reason, my devices think this Anker PowerBank is an accessory.  Don’t waste your money on this one. Look for a different powerbank that will actually charge your devices.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Dangerous","reviewDescription":"I have loved Anker products and purchased a wide range of cables, external batteries, and speakers from them. They have seemed like excellent value for the price. Unfortunately, I will no longer be purchasing their batteries. Last night while it was charging, this battery almost exploded and could have started a fire while I slept. I purchased it in Nov 2020. This time I’m actually writing a review and posting pictures, but it has actually happened before. I purchased a similar battery from them in July 2014 and a few years later it did the same thing. I didn’t write a review because I thought it was a one-off thing, but after this second incident I now see it’s an issue with their batteries. While those incidents did happen years after purchase, batteries should just get worse at holding charge as they age, not create dangerous situations by almost exploding.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"It never worked","reviewDescription":"This is my 2nd Anchor charging pack. The 1st one I had worked great. I used it for about 5 years before it died. I bought this one thinking it would be as good. The thing has never worked. I’ve tried everything including new cords, plugging it in to a different outlet, etc.I think part of the problem is that it came with no instructions and no charging cord. It has 2 USB-A ports and one regular one. I’ve tried using each to charge it and nothing happens. I’ve tried pushing the button when I plug it in, holding the button down, and nothing works. I let it charge for different amounts of time even. Very frustrating since this one was more expensive than my other one. Because of that I’m trying a different brand when ordering a new one.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Broke out of box","reviewDescription":"Will  not turn on Don’t buy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Do not biy","reviewDescription":"Do not buy this item. The battery life lasts a long time. However it has two inputs Micro and USB-C. Only the USB C can be used to charge the item. It has two USB-A outputs. Only one of these works. So you can only have one item plugged in at a time. It is vastly over priced for only half of it to be usable. I would find a better product by a different brand. Do not waste your money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Stopped working suddenly, but was great before that","reviewDescription":"I typically wait a while to review a product, and this is why. I purchased this device 7 months ago. Before today I would have given the power bank a glowing 5 star review (the product worked flawlessly, reliably, and would charge many devices for several days before needing to be recharged itself). However, today it suddenly lost the ability to recharge itself. I thought it was the cable so I switched out to a new one. When this did not work, I tried a new usb plug. This did not work. I then tried a new cable and plug on a different wall outlet, which also failed to correct the issue. Perplexed, I tried a different device and it was able to charge. After this I realized it was the anker. I then tried the usb type c input port on the device, thinking the micro USB port that I had been using to recharge the device had failed. The usb type c port would not work either. So, it appears that something internal had failed rather than the input port (otherwise the notion of both ports failing simultaneously seemed too coincidental). This is an unacceptably short life span for a device that has remained stationary on a counter and been properly cared for. Anker needs to work on their products to address this issue, because I am not alone in my experience with their products.","isVerified":true,"ratingScore":1,"reviewReaction":"24 people found this helpful","country":"United States","date":1627862400000}
{"reviewTitle":"Well designed, compact, easily fits in pocket","reviewDescription":"This is a good charging brick and can charge a phone from near dead approximately five times without being recharged. This is my 4th Anker product and I have not gotten a bad one yet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Anker IS the standard","reviewDescription":"I only buy anker because it works and lasts!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Excelente","reviewDescription":"Excelente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great powerbank","reviewDescription":"This is a great powerbank and I've used it many times and it keeps my phone and tablets charged","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"It's reliable","reviewDescription":"I won't have to worry about my phone running out of charge.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Excelente compra","reviewDescription":"La he utilizado ya hace un tiempo y realmente es muy buena, no tengo ninguna queja, la recomendaría totalmente.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Best charger ever","reviewDescription":"2 years almost 3 going with this charger and it’s been the best. It’s kinda heavy but for the charge and durability, it’s worth it. I now have a small issue now because the battery started to swell( I taped it up) and I’m not too sure about keeping this one, so I need to buy another one. I have recommended this portable to so many people and will never stop","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Great, charges my phone fast","reviewDescription":"Probably holds 5-6 charges of an iPhone 13, and charges it very quickly.  I use it around the house just to not have to be tied to a wall outlet, because it is faster than the wall too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Powerful","reviewDescription":"We bought this for our European vacation, and it didn’t disappoint. I’m not sure why but when we were on the plane and traveling out of country our phones did not hold their charge for long as they normally did in the states. This charger recharged our phones, and headphones very quickly and still had a lot of juice left. We’ve heard bad stories about compromised charging stations abroad, so it was especially nice to have our own powerful charging station!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718496000000}
{"reviewTitle":"Excellent Power Bank","reviewDescription":"I purchased this power bank back in 2020. I absolutely love this power bank. It charged my iPhone X, and iPhone XR multiple times on one charge. I now have an iPhone 15 and it charges that phone multiple times on one charge as well. 2 years ago I dropped the power bank at the airport. As you can see it cracked the case. It still works just as good as the day I purchased it off Amazon. I highly recommend this power bank if you’re in the market for one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Long lasting","reviewDescription":"I think it would be nice if it had usb c too but it works fine.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"Anker Power Banks are the BEST!  Perfect for remote travel","reviewDescription":"I used these power banks for extended camping in the Sahara.  They have never let me down.  They hold power for a very long time (probably years - certainly long enough for a month long trip).  They deliver the charge to my phone quickly and hold the amount of charge they are listed for.  They do take some time to get charged up - so plan ahead to get them set up and charged prior to travel or planed use.  I charge a iPhone 14pro with them.  Reliable and hold the charge they are listed for.  (note - you must carry these battery packs in your carry on only - they can't go in your checked luggage)","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"I AM THE MACHIIIIIIINE!!","reviewDescription":"Bought this for a trip to Hawaii with the wife, and what more can I say?  IT'S A BEAST.  I charged it in early January, used it for the whole trip (usually, I'd carry it in my pocket and keep my aging S9+ topped up, since its battery is slowly dying), occasionally charging earphones or other devices, and recharged it once in two weeks.  Got home and put it away, since I don't really need to use a battery bank per se.  I dragged it out a week or so ago, and it was still fully charged.  I charged my S9+ a handful of times, charged earphones again, and charged my IPhone 12 for work at least three times.  I lost ONE dot on the charge indicator!  I am, needless to say, please with its performance.  It's TSA-legal (obviously), and although you definitely won't forget it's in your pocket, it's nice to know you've got power when you need it!","isVerified":true,"ratingScore":5,"reviewReaction":"23 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Great power bank","reviewDescription":"I use this mostly to charge my Galaxy S21 Ultra while I'm at work. I usually start to charge my phone around 50% and take it off at 100. So far I've gotten 5 charges out of it in one day with the power bank still having 1-2 bars of juice left (out of 4 lights total). So about 3 or so full charges and still power for another I believe.It does take a long time to fully charge, several hours, but it's worth it.I wish I had waited 1 day to buy it though. I bought it for $50, and the next day it was on sale for $36, so maybe wait for a sale, even though $50 still isn't a bad price for it.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1693094400000}
{"reviewTitle":"Fantastic power pack","reviewDescription":"This is working really well! It hold its charge even when it's not being used. It doesn't drain on it's own. It lasts a long time and is a life saver!! Thanks!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Love this, never had any problems!","reviewDescription":"This is the fourth time getting an Anke Power Bank! They work exactly as advertised. I love the new improved power rating and take it with me whenever I leave the house!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Seems like a quality product","reviewDescription":"Relatively compact for the amount of power stored.  Does take a long time to charge from low level - says 10hrs and probably correct.  Can charge android phone from 1-20% at least 4-5 times.  For more power consuming devices obviously not as many - from 3 lights (~75% of power) completely drained charging a 10\" paperwhite Onyx Boox Tab Ultra at 20%.  The Anker 20kmah replaces an old (7yr) smaller battery pack - slightly heavier but not that much larger.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"Great Power Bank","reviewDescription":"Very impressive power bank, holds a charge for a very long time.Can be stored for months without losing much power, also charges back up pretty quickly,","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"So far it’s great","reviewDescription":"This battery is powerful and has held its charge while  recharging my phone several times . I have not had it long but it seems to be a very good product.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709424000000}
{"reviewTitle":"Great product and good quality","reviewDescription":"Great product and good quality","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Great product highly recommend","reviewDescription":"Great product highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"UPDATED July 6, 2020: The jury's no longer out","reviewDescription":"REVIEW AS OF JULY 6, 2020:If you read my older review, below, you'll see I was not really convinced this was the charger for me, nor was I pleased it had, in my opinion, no \"operating instructions,\"  and having read other reviews that indicated it took forever to charge up, etc.  After I wrote that review, the seller contacted me via email to offer any support, but I had already formed my judgment (not a good thing) and blew it off and never contacted them (okay, okay, I get it; judgmental and stubborn - working on it). HOWEVER, I decided to plug the USB in to just let it charge until I saw the 4 blue steady dots, assuming the unit was then fully charged. And then I took it to our camp in the Maine woods, off logging roads where extended network roaming is the norm and electricity is had only when the generator runs, usually maybe once a day. This Anker unit kept my phone charged (Galaxy S8), my daughter's iPhone charged (and she's on it a lot more than I am), and it charged up our Bluetooth speaker unit so we could take it out on the lake and listen to tunes while boating. To say the least, I was more than pleasantly surprised; I was amazed. I now keep this Anker unit with me and make sure it's ready to go when we head out ~ which with all the COVID crap going on, is as often as we possibly can head to the woods! I keep its charging cable right in the little case it comes in so that when the generator is going, I am able to recharge it in an appropriate AC plug.LONG STORY SHORT: I highly recommend this unit, and I'm sorry I was quick to judge it so harshly previously.OLDER REVIEW BELOW:Okay, full disclosure. I'm not really much of a techie, I just want to buy something that works for me and then plug and go, as it were. So, once I got this, I tried to read the \"instructions,\" but found just a few pictures and most of what was written was in other languages. The pictures really didn't tell me what I needed to know. Do I plug it in to charge it before I use it? Is it already charged (it does have a couple of blue lights but never seems to get to the third one or higher)? The cord that comes with it is apparently for charging it, which is great, but, again, I have to either purchase a charging cord\/connector for my Galaxy S8 or use one I've already got stashed for other places (like my car, my bedroom, etc.). I bought this because we have a camp that's off grid, where we have a generator that we may (or may not) run for a couple of hours a day, and we have a variety of phones between us, iPhone, iPad, Galaxy, etc. I don't really want to wait until I get to camp this summer to find out this isn't going to work for me. I even went to the website and called up the unit (Anker 20000) but still don't feel like I got any better, understandable information. So, I guess we'll see whether it's workable for my situation or not, as soon as I feel sure I'm not gonna blow the thing up because I don't have clear instructions on how to get started.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1585094400000}
{"reviewTitle":"Lots of power","reviewDescription":"I always have it with me whether commuting to work or traveling","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"Reliable","reviewDescription":"Charges quickly from the wall, then quickly charges my iPhone. This power bank seems to have plenty of charge left after completely charging my nearly dead iPhone, so I do believe its claim that it can charge your phone at least three times.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"Power Bank","reviewDescription":"It came very fast. Easy to use,lite weight. Will purchase again","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"this is greatest","reviewDescription":"this is the best charger","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Long-lasting","reviewDescription":"Great quality. Lasted me almost 4 full iPhone charges.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721088000000}
{"reviewTitle":"Great quality","reviewDescription":"Does what it should. I have never had an issue with any anker product","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Anker Portable Charger","reviewDescription":"I used it when I travelled in Japan. It's helpful a lot. Long time to charge.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Efficient and compact","reviewDescription":"Charged my phone quickly and it’s light enough to carry around all day","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"keeps the device alive","reviewDescription":"I have always supported Anker. I have use many of their devices over the years and have yet to complain...until now.The (charging life is very long). I you need to charge multiple times then this is good for that. When plugged in, it only keeps the device alive while in use and it's very slow to charge. I have used several different style cords.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Great charger but stopped working after 1 use","reviewDescription":"I’ve used this charger before through a friend and I decided to finally buy it since my friend has had it for such a long time I knew it was going to be a great charger. Unfortunately after 1 use the charging light doesn’t turn on and I’ve tried different cables to charge it but the light just won’t turn on to indicate it works. I don’t know if I got a defective one but I’m just upset because I know these are great chargers but I got stuck with a bad one.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1665273600000}
{"reviewTitle":"This thing sucks","reviewDescription":"Maybe i got a defective one but this thing sucks. I usually love anker products and I purposefully look for their products whenever i need something like this (phone charger, cables, outlets, etc.) but this one is a huge miss. For the price point, you'd expect it to do better. It cant charge my phone(iphone 13) while I'm using it. It'll barely keep it at the charge but if its plugged in and I'm using the phone, it will not bring up the charge. Ive tried different cables and everything. It just is a miss","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664236800000}
{"reviewTitle":"Terrible Instructions","reviewDescription":"The Anker PowerCore Essential 20000 arrived today.  Opened it up and pulled out the \"User Manual\".  What a piece of trash.  The 2 1\/2\" x 3 1\/2\" pamphlet (certainly not a manual) contains instructions in 10 languages, all written in 4 point font.  As close to totally useless as you could find.Then I see there's a web site for support, go to it and what do they have, the same pamphlet the only difference being you can increase the screen size.So I thought I'll go to UTube someone must have a \"how to use\" video out there.  You will not believe how many videos there are showing the viewer how to \"unbox\" the Anker.  I hope this thing works better then the crappy instructions.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Not practical","reviewDescription":"After only 3 months of using the power bank, it keeps shutting off out of the blue. Not sure why, so I need to keep pressing the button to start the charging process again. Also, it takes 10 hours to recharge it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Good but heavy and bulky","reviewDescription":"I used this at Disneyland. It did the job of charging our devices well. The only con is that it is heavy and bulky for my average size pockets. I hated having to hold it in my pocket with my phone. It was heavy big and inconvenient to have with me while walking all over Disneyland. Besides that annoyance, it did its job of charging our phones all day. So if you don't need to lug it around this should be perfect for your needs of long lasting charging of multiple devices.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Not compatible with iPhones!","reviewDescription":"I bought it to charge my iPhone while traveling. The battery of this power bank lasts a long time. However, not only it's very heavy, but the ports are not compatible with iPhones. I had to use an extra USB to Type C adaptor to connect the iPhone cable to the charger. What's the point of that? I would have preferred to buy a lighter and smaller charger if I had to use the adaptor anyways or just buy a charger really compatible with iPhones. This is a misleading advertisement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"Charger","reviewDescription":"Doesn't charge s22+ Samsung... at least mine it didnt. ... charges everything else. Charged it.  Rode  1000 miles on my harley. Rolled into a gas station....quick charge..... NOTHING... Just me,  use your best judgment... might just be me.  Things I've seen in youtube... their not ready.... your call.. wasn't there for me when I needed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1688083200000}
{"reviewTitle":"Decent charger but very outdated. Not recommended","reviewDescription":"It’s a good charger if you have any older devices that don’t use USB-C. It will charge my Apple Watch but that’s it. You cannot charge anything that has come out within the last few years as most electronics have switched to USB-C. Unless you want to downgrade your fast charging cable to standard usb to lightning cable or to usb c.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"Disappointed","reviewDescription":"I purchased this product because it had USB-C and Micro USB ports however those ports are for charging the device - they are not output ports. Sending back and looking for a more useful product.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Heavy","reviewDescription":"It is much heavier than I expected.  I thought it would be the weight of a cell phone but it is close to twice that weight.  It has a couple of USB A ports for charging your electronics.  It has a USB C port and a micro usb port for charging the unit from a power source.  A cord (USB A to Micro USB) is included to charge the unit.  It's really too bad they didn't include a USB A to USB C cord instead.  Then you could charge the charger with that cord and then reverse the cord to charge you phone with the USB C end.  The instructions allude to several charge rates for phones and tablets and a slower one for earphones.  There is a button and some blue lights but how they work is not well explained.  They suggest you visit their support page for more information.  I did that and the only thing you get is the included manual as a PDF.  No additional information. So to summarize it is a heavy unit that will definitely charge stuff if you can figure out how to use it.  It could be made better by substitution of a different included cord.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1675382400000}
{"reviewTitle":"Questionable longevity","reviewDescription":"I purchased this product in August 2020 and have been using it regularly to charge phones and other devices. One great feature is the ability to recharge it using either a micro USB or USB-C cable. However, the power output is quite basic, and it doesn't support any fast charging technology, which is expected given its affordable price of under $20 at the time of purchase.Unfortunately, I noticed that the battery started expanding or bulging recently, so I decided to stop using it. Interestingly, I also own another Anker battery pack that's even older but has been used just as frequently, and it's still functioning perfectly. So, the performance may vary from one device to another.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"Sad it didn’t work like it claims for iPhone 15 Pro Max","reviewDescription":"I had to return this but wanted to give my ultimate review. I heard Anker products are amazing and had to try. It said it would work for my iPhone 15 Pro Max but when charging or attempting to? It said it was too powerful for my phone and would not charge, so ultimately had to return and am on the hunt for a portable charger that will charge my phone and my husband and son’s devices (iPhone 13 mini, iPhone XR).","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Disappointed with this one.","reviewDescription":"UPDATE 10\/28\/20:  A couple weeks Anker saw my review and was kind enough to send me a different version of the PowerCore Essential 20000.  The new one is functioning the way I hoped it would - I've charged my phone from 20% to full two times and most of the indicator lights are still lit, reflecting that I should be able to charge my phone at least 2-3 more times before the Anker needs to be recharged.  I'm very happy about that!  Thank you, Anker!ORIGINAL REVIEW: In 2015 I bought an Anker® 2nd Gen Astro E5 16000mAhthat I used ALL THE TIME.  The only reason I replaced it was because I gave mine to my daughter and bought myself a new one.  She uses it and despite being five years old it faithfully is able to charge up her phone 2-3 times before it needs to be charged itself (when I first got it I could charge my phone 6-7 times in between charging the charger, which was outstanding).Back in April 2020 when I purchased this charger, I imagined that buying a higher-powered, brand-new charger would enable me to once again charge my phone at LEAST 5-6 times before needing to be charged itself.  Unfortunately, that is not the case.  I have a Galaxy S9 and if I'm able to get 3 charges out of this new battery, I'd be surprised.But that's not all.  My daughter can fully charge the charger in 4-5 hours, and I'm stuck having to charge mine overnight because it takes twice as long.The new charger is frustrating - it actually performs THE EXACT SAME as the 5-year-old Anker that I gave to my daughter, despite being a better and brand new charger.  Very disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1602720000000}
{"reviewTitle":"Great but","reviewDescription":"Some of the ports already don't work and it's only been 6 months. It's been in a case and isn't exposed to the elements. I can only use the 2 USB ports and not the others. Worked great when I first got it but I can't use one charging cord that I have that was the reason I chose this charger to begin with.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703203200000}
{"reviewTitle":"no Apple charge cord","reviewDescription":"The charge cord\/plug for the device is an Android plug. Standard USB plug. This means you must carry and fuss with yet another different cord.  That said 92 hours of battery life is great. I will keep it but the no standards for plugs is sooo frustrating!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Failing after only 6 months","reviewDescription":"I bought this 6 months ago and it's already starting to fail. The micro USB port you charge it through is starting to fail and has become very unreliable. It's a shame because otherwise it's very good.Update: Anker gave me a full refund for this item. Thanks","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702944000000}
{"reviewTitle":"Great battery, only had USB charging","reviewDescription":"I saw the usbc 's on this thinking it could charge from there too but that is for input only. I have way too many devices now that come with usbc cords, not USB","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Beware! This no long includes a carrying case and a USB to USB-C cable.","reviewDescription":"I just bought this Anker recharger pack for a fourth time. I bought one in 2022 and two in 2021. This time, however, I found it no longer includes a carrying case and the second cable, which was USB to USB-C. Be wary of what they say in the small print as to what is included. It's annoying not having the additional items I received in the past. Is Anker starting to cut corners with shrinkflation?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Not for planes?","reviewDescription":"Anker makes great chargers and cables. I was hoping to use this one for ALL travel including airplane. Talk on the site indicated it would be ok. However when the package arrived it said in bold letters on the label, that it is not legal to use in aircraft. Too bad, it seemed like a nice charger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Instructions Not Clear","reviewDescription":"Product worked with the charge that came from the factory, but would never take a charge after that.  Finding info online about the LED colors and meaning is a hassle.  Finding a product manual online to help with understanding the product not easy either.  They are dying to sell you a powerbank, without a manual, without a charger, that's hit or miss as to whether it works or not.Update: I eventually figured out how to work this thing and all is OK.  Would be a good idea for Anker to include a quick start guide to get a customer started.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1646611200000}
{"reviewTitle":"USB C port not working","reviewDescription":"11\/18 Update: They just reached out to me for a refund, I will use that money to purchase from Anker again because I genuinely love efficiency!  Thank you! I’ll try an even newer power bank with higher charge and more costly, this is how you keep me coming back!The multi use Anker 🔌 is amazing btw! 👏 what other company works this fast??11\/15 I bought it in June and it worked great, but lately the recharge time is much longer and the usb C port doesn’t work ! This is such a disappointment considering I’ve been recommending this battery to all my family and friends to get especially for traveling ! Now contemplating should I buy Mophie instead …","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636934400000}
{"reviewTitle":"Not for Ring.com Stickup Cams. Otherwise fine.","reviewDescription":"This does fine with my iPhones, and in fairness, that's all Anker advertises. This would NOT charge my Ring.com stickup cams.  I suspect the voltage is just a tad too low for Ring.What's interesting is that Anker's smaller 10,000 unit (i have 2) WILL charge Ring cams wonderfully.  Apparently those put out just enough extra voltage","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674432000000}
{"reviewTitle":"FAR fewer charge cycles than a Smartphone.  Dichotomy!","reviewDescription":"These packs last only a year or so.  Compare that to your Smartphone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691020800000}
{"reviewTitle":"sure its got capacity, but its a slow charger","reviewDescription":"its a similar size to my phone, but twice as thick, and a little heavy, but it has a pretty good capacity.but the thing that ruins this is how slow it charges. tried diff cables, including ones that are fast with other sources of power, and everything charges very slowly. my phone estimates that it will take 4 hours for it to get to 100% from 15%.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1670889600000}
{"reviewTitle":"Bad customer service","reviewDescription":"I bought it two months ago and never hd a chance to use it. Two weeks ago, I tried it and found one of the USB port was not working. I tried two chargers, two cords, and two devices. It failed to work. I contacted Amazon customer service and a lady gave me the company's link and let me filed an online inquirary. She said the company will contact me in two business days. Two days later, no one contacted me and I called Amazon again and asked a replacement. Now, two weeks passed and the company still did not contact me.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646352000000}
{"reviewTitle":"Didn’t last..","reviewDescription":"I got this product June of 2021 and it was great. Charged amazingly, was fast charging, gave about 3 charges + before needing to be charged. However before even hitting a full year the charger stopped charging and would just blink on the first light. I really liked the charger but it stinks that it didn’t last long term despite I only used it maybe 10 times.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1657152000000}
{"reviewTitle":"It charges my phone, just REALLY SLOWLY.","reviewDescription":"This charger is too slow.Previously, I had the smaller Anker charger (10000 mA) purchased in 2016. It charged my phone really quickly, like 30-45 mins from almost empty to full. It kept working right up to the day it got lost, a few weeks ago. :(So I got this even bigger one, and I was hoping for the same speed and just more charges.This Anker model (with 20000 mA) so far holds a charge. No fire worries, which a few other reviewers mentioned. But it is SO SLOW to charge my phone, and also to recharge itself. It took 24 hours to fully charge up this battery when I first received it. It took all night to charge my phone with it (from 20 to 100%). Also, it is longer and of course heavier than my previous model.All this to say, I recommend getting the older smaller model.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607644800000}
{"reviewTitle":"Unsafe Traveling","reviewDescription":"A few months ago, I had purchased this product and both times they came with a mesh bag. I expected the same exact product this time, since I chose the link to buy it again, but there was no mesh bag.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1676764800000}
{"reviewTitle":"The charging cord did not work for my Apple 12 mini","reviewDescription":"It’s ok with the right charging cord but it’s heavy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"A lifesaver.  Great as a Gift.  A must have.","reviewDescription":"We have purchased several Anker battery backup devices.  And very happy we did.  They make a great gift.  The charge is very good.  You get a good quick charge.  It does take a while to charge; so I recommend you charge overnight or during the day when you don't need the emergency power.  these power supply devices are critical in today's heavy device environment.  Don't leave home without one.  Just make sure you have the right mini usb charging cord with you at all times.  Very versatile; works with almost any portable device.  I will definitely buy again if I need.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Powerful Charging in a Compact Package","reviewDescription":"I can't believe how many devices I have that are battery powered and how often I pick them up and realize I forgot to charge them before putting them away or aside. Those devices include especially phone, ipad, and multiple vapes(cannabis is legal here!). This battery pack has repeatedly come to my rescue. It is small but quite powerful and will charge my phone multiple times and my ipad once or twice. With usb c, it recharges in a fairly short amount of time. I have found Anker products to consistently be among the most rock solid electronic auxiliary makers of the dozen brands I've tried.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"great charging quality","reviewDescription":"i been using this 20kmah power bank for abou 6 months now and i love how it has been holding up. i got the black color option. i normally use it to change my iPhone 13 mini which has a small battery compared to the main flagship devices today. i don't always keep track of the number of times i charge through a cycle but i rarely run out of juice from the powerbank before i have to recharge, so that is a good thing. if i were to guess how many charges i would get out of the 13 mini, it would be at least 9 full charges. which gets me through at least 2-3 days without recharging the power bank, depending on usage. the recharge time for the powerbank isn't too bad. it takes about 4-5 hours to fully charge from 0%. i normally recharge the bank whenever i go to sleep, so i never worry about the battery life throughout the day. i do charge two devices at the same time but not regularly. when i have to, it still holds up. obviously, it is gonna drain quicker but this is a stable and quality product. this has to be the best overall powerbank i have ever used. i dropped it once on cement, i have a few scratches and it is still going strong.overall, i would recommend this to anyone looking for a portable sized powerbank that isn't heavy for travel. 20kmah is plenty enough for 1-2 devices for daily usage. 5\/5","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1680566400000}
{"reviewTitle":"Works as expected","reviewDescription":"This suited me for what I wanted:  a way to recharge my phone a few times in the event of an extended power outage.  Once this was fully charged, I was able to charge my Samsung S22 four times from a single charge.  It claims to have fast-charging capabilities, and that appears to be true.The 'charged status' indicator is a bit vague:  there are only indicator lights, each equal to about 25% of battery.  That's how you know how much charge is in it, by the number of lights lit up.  Something with numbers in maybe 10% increments might be more useful, but... it's not a deal breaker.  I just know if my phone is down to about 15% and I recharge using this, one indicator light on this will not be lit, so it uses about 25%.The weight feels slightly heavier than my Samsung S22 in its case, and probably twice as heavy as a Samsung Galaxy S7 that is NOT in a case.  Not something I would carry in my purse but definitely would carry well in a backpack.  The size is about the same as my Galaxy S22 in its case.I have charged my phone and a Samsung tablet with this satisfactorily but not simultaneously.  It has two output connections for charging two devices simultaneously and has two different input charge options (micro USB and USB-C).Overall satisfied.  It fit my requirements for a reasonable price.","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"Works with hearing aids","reviewDescription":"This works like a typical charger and will work with low draw hearing aids too. Most do not as they will turn off because of the low draw. Very happy with this.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Perfect!","reviewDescription":"this is a great back up battery. You can get five or six charges out of it.Great for traveling or at work where charging traditionally might belimited.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"A bit slow when charging devices, but very sturdy and reliable.","reviewDescription":"It's a bit hard for me to review the product because I stupidly bought it used. Don't do what I did, you'll end up with a significantly lower capacity power bank. Mine only holds about 13,900 mAh when it should hold 18,000 to 20,000. Entirely my fault. But it works very well. I feel like it takes ~6 hours to charge with a 20 watt USB charger (all power banks take a long time to charge).I've run two phones off it simultaneously and it kept them running just fine. It's physically sturdy and it has never gotten even warm when charging it or discharging from it.My only complaint is it doesn't charge devices very quickly. For both my phone (Google Pixel 4a) and tablet (Amazon Fire HD 10) this power bank can only keep up with power usage of the devices when they are on and active (e.g. you're actively using them while charging). Neither device battery gains power in that situation, but they don't lose it either. When your devices are idle, it's pretty decent. Closer to wireless charging speed (this doesn't have wireless charging capability, that's just a comparison).If you want a power bank that charges your device as fast as your wall charger does, look elsewhere. This isn't that expensive of a power bank. If a somewhat slower charge time doesn't bother you then this is a decent power bank for the money.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"It lasts, it's slim and it's the best you'll get for the price","reviewDescription":"Lets keep it short and simple for those that are looking for a good battery bank. Anker is the best brand you'll find out there. Any of the products they sell are worth the money. This one's great because it can trickle charge for those using BT Earbuds and can fast charge a phone like as if you plugged it into a wall outlet. It has four notches like most battery banks and just casually using it barely puts a dent into the battery.I've tried cheap-o brand battery banks, and durable ones like Halo but couldn't find one that was slim enough to keep in a back or front pocket to charge on the go. My friends and I play Pokemon GO during big events at local parks and such; and anyone who has played it know how draining it is on a mobile battery. If you're at a long event you'll be stopping to charge up or have one or two battery banks on you at all times. With this? I barely put a dent into what it has for 3-4 hour events. For the longer 12 hour events? I still had one notch left with it running the entire time. I even shared it with a friend during one of our 30 minute breaks too. It's the best I've had and the only one I'll ever continue to use unless I want to go bigger.","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"It is a very good unit but does not have an \"always on\" feature","reviewDescription":"I like this unit very much.  Very solid and well-made.  It has a very high capacity.  I can find nothing wrong with it except that it does not have an \"always on\" feature.  This, if you plug-in a device such as a cellphone, it will charge the phone.  Then, the power bank senses the phone is fully charged and it will turn itself off.In my case, I need the power bank to be on all the time as the phone is simply used as a Bluetooth device in my car and needs to be plugged in 24\/7.  Unfortunately, the phone would charge, the power bank would then shut off, and the phone eventually would discharge completely.  Despite being plugged into the power bank, the power bank won't auto-start again to recharge the phone.Thus, while this is a very good unit and I recommend it to others, it will not work for the application I have in mind.  Also, BTW, there is no \"press the button 3 times\" thing, as often is mentioned online.  I have tried everything, including emailing Anker (who were very helpful, BTW) and they confirmed what my testing revealed.And, yes, I could build a circuit and all that, but instead, I found another unit that advertises that it is always-on.I returned this item to Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"29 people found this helpful","country":"United States","date":1670803200000}
{"reviewTitle":"Great for traveling.","reviewDescription":"Bought this for my boyfriend. He’s able to take this on the go. To keep his cell phone, tablet & Nintendo Switch charged. When you can’t get to a power outlet while traveling or in case of power outages during storms this thing comes in handy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"Not working with iPhone 15","reviewDescription":"I bought this charger back in Feb and it’s been a great changer. I tried the USB-C charging port on my iPhone 15 and I was surprised that I got a message saying that the power source is putting out too much power. I guess I’ll have to find a portable charger that works with the iPhone 15. Still a great charger.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"Good purchase","reviewDescription":"This is the second one I've purchased. The only reason I'm buying it is because I lost my previous battery pack. The build is solid. It has enough texture to be useful but not enough to be annoying.  After a year of usage, it does not rattle and seems to hold its battery capacity. As with Anker's other products I've purchased and used, I would recommend this one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Works great but slaw to charge the battery pack","reviewDescription":"This really works great. Get many recharges of an iPhone on just one charge of the battery pack. However, it takes several hours to recharge the battery pack, even using USB C charging port. Would get 5 Stars if it charged faster with USB C.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"Great power brick","reviewDescription":"It seems to hold up well to charging a couple devices at one time and doesn't get overly warm. We may have gotten the wrong type but wish it took USB c to USB c for charging devices. Also wish it was a little quicker to recharge as well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Amazing Power Bank, especially for Quest 2, just not the one I wanted","reviewDescription":"NOTE: I bought this one by mistake, as I meant to get the one that had PD output through USB-C, so I'm returning this one. I still liked it though.This thing has a TON of battery. I'm sure you can guess that by it saying 20,000 but its no exaggeration!When using it to charge my Galaxy S20FE, it only did normal charging, but that's still good either way. (The newer model fast charges it, which is why I wanted that one)Using my Quest 2, the battery doesn't go down at all while playing. I plugged it in at 9% (took a while to find a decent cable to use) and while slow, it never went under that. It gradually got higher. After say 2-3 minutes, it went up a percentage. Sounds a little bad, but trust me! It would extend the playtime by HOURS! So if you're interested in using this thing as a Quest 2 battery, it's perfect! And the weight is perfect to use as a counterweight when attached to the back of the strap (just don't insert it in between your head and the strap. That will just introduce more stress on your head lol)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1620950400000}
{"reviewTitle":"Revised review","reviewDescription":"I earlier wrote a very negative review,  born out of frustration.  The item does work well, now that I know it doesn't come with the correct cord for newer phones. I still think that the instructions could be clearer. They did offer me a full refund,  which I declined as it does what I ordered it for.Anyway apologies for the negative review.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Exactly what I was looking for","reviewDescription":"I ordered this for the dual USB charging ports.  It's much bigger and powerful than my other Anker chargers.  I can use this for two devices.I do wish the USB c port was an output instead of input.  At least I can use my USB charger to charge it though.I also wish the LED charging lights were a little easier to see.  On my other Anker chargers they're blue and easier to see.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"Too heavy","reviewDescription":"Totally understand there is a correlation between the mAh and the physical size, but this crosses my limit on how much weight I want to carry around. It's so damn heavy. Otherwise, I own 2 other Anker power banks and they're good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Good back up tool.","reviewDescription":"I’ll make this short and sweet:Charging power: Good\/great for phones. Not really good for my IPad Pro M1 11 inch, though it keeps the iPad battery from draining.Battery life: I’ll put it this way, i bought this and went on a 2 week roadtrip in august of 2021. Didn’t recharge it after the trip. Left it in my bag without touching it until late April 2022, still had more than half battery and charged a friend’s phone at a music festival (very hot day).Overall Cons:Need a big pocket or a small bag to carry it on you.USB-C & micro USB port is for charging the pack itself, not to charge devices.Small charging cable for the pack itself (but you can use any micro-USB to USB\/USB to USB-C to charge).Don’t expect a significant charge for a tablet, stick to the wall outlet for that- or buy a more powerful portable battery pack.Conclusion: Great back up pack, not for heavy duty charging though.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1654128000000}
{"reviewTitle":"Very good customer service (will not charge with less than 2A wall charger)","reviewDescription":"I was about to return the second one of these and left a bad review on Amazon. Anker reached out to me to correct the problem.  I was using a 1A wall charger to charge the unit and it would not work. I obviously did not read the manual, and never will, but the battery charge light will flash like it's charging but it will not actually charge with less than 2A.  Can't say how good the item is yet, but I was very very impressed with the level of customer service. For that alone I'd buy from Anker again.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1681516800000}
{"reviewTitle":"Worked briefly","reviewDescription":"Loved it while it worked, great amount of ports and even though it wasn't super fast it did the job! I only bought for a trip and had it used\/stored in a hardshell case where it stayed in my purse; using it sporadically now and then once I returned home.It sits on my couch, never dropped or transported after that but has a crack now somehow. I live alone and not sure how it happened. I'm writing this review because I first reached out to Anker as I have always liked their brand and have spent a significant amount on their Eufy line of cameras and security products for both home and work as well as a preferred choice for power strips\/cords. Unfortunately they have never responded after two direct attempts as well as a 3rd attempt via Amazon. One star reflects the lack of response even though the item did work well for the week I needed it.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"Junk","reviewDescription":"Bought 2, after about a month 1 would not charge got a replacement. Now the replacement stopped working and so did the other one! So three all went to crap in roughly 4 months.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Defective Anker charger","reviewDescription":"This device will not charge using the C. port. Unfortunately for me this device does qualify for a return or replacement, so I’m out of the money I spent . I will never buy nor recommend an Anker product again.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714780800000}
{"reviewTitle":"Appears problematic with iPhone 15","reviewDescription":"If you use this to charge iPhone 15, the iPhone sees this as a device to charge, not be charged from. Check the web for a charger compatible with iPhone 15.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Terrible Product Never Worked","reviewDescription":"This item was purchased for a trip where charging would be less accessible.In the past I have been very satisfied with Anker brand, but this product never worked despite charging over night and the LED light functioning. After reading many other reviews I understood that I also received a poor quality product that I was unable to return due to the time limit on amazon returns after my trip.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"MIcro-USB jack is defective on 2 Successive Orders","reviewDescription":"I have owned one of these 325 power banks for 6 months and love it. HOWEVER, I ordered two more this week and both had defective MicroUSB jacks on the battery. These 325 power banks will only selectively accept micro-USB cords while my original purchase does not have the problem at all. I have owned many ANKER batteries since introduced,  and have NEVER experienced a battery charging failure. This must be a product defect, beware if you rely on infallible charging.PS Anker customer support was very responsive and immediately offered refund on defective product","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Does not work","reviewDescription":"I was excited to receive this charger. Unfortunately, after fully charging, it will not charge any of my devices.  I have tried several cords and nothing has worked. I have contacted customer services and no one has responded only that this item cannot be returned. Very frustrating. This is the second Anker product I have bought that does not work. With many  of the reviews being positive I thought I would give it a chance. Never again.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1702771200000}
{"reviewTitle":"Died after 3 weeks","reviewDescription":"I bought 3 of these power banks since they were on sale. I gave 1 away as a gift. I charged another with the supplied USB cable. Worked great with charging my iPhone and I depleted the power bank. Tried charging the power bank again and left it plugged into the wall for about two weeks. One day, noticed the max charge little lights were not lit anymore. Now, it does not turn on, does not charge anything, and will not react to being charged with it’s included USB cable. It’s a brick and just shy of my return window with Amazon. I hope the one I gave as a gift does not also die after a few uses.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1684713600000}
{"reviewTitle":"No charger or charger cable included","reviewDescription":"Charged power bank for over 10 hours using my own power block & power cable.  The battery light indicated it was charging but it never showed more than 4 lights lite up around the indicator lights.  Did not charge after over 12 hours of total charging!??? Verify that my charger and cord works properly but ANKER did not work or charge properly.  this is my 3rd Anker power bank.  The only one that actually worked correctly is the second one I had.  Concerned about quality control with these units??!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697068800000}
{"reviewTitle":"Don’t buy","reviewDescription":"I love anker products but this charger is horrible. Doesn’t hold a charge and does not work with iPhone 15.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Power Pack","reviewDescription":"I got the power pack for a heated Vest this power pack seems to keep its charge for a long time its usually about 3 days I will need to charge it again but do note I don't use it 12 hours pr day I use it for about 3 hours off and on pr day.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Works great and charges fast","reviewDescription":"I love Anker products and have been purchasing many since I can remember. They are very durable and long lasting. This works so great, got to one for my sister too.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Tech Support Resolution","reviewDescription":"My unit failed after a couple of months. Anker support tesponded quickly when called to arrange for a replacement. This power bank holds lots of charge when functioning. We use many Anker products. All reliable.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710547200000}
{"reviewTitle":"Holds a charge seemingly forever","reviewDescription":"A good backup battery plan for the phones if the power is gone. Also gifted one to a friend who lives in a remote area where power is often down in the winter. Quality product. Anker products keep getting better and better. When looking for electronics, batteries, or cables, I always try to find and Anker first.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Fast Charge! Best portable charger of several I've tried!","reviewDescription":"My phone died at a dance competition and a friend lent me her charger- which charged my dead Apple 14 unbelievably fast and got me through the last leg of the evening! I was shocked at how fast it worked- in less than half an hour, my phone was more than half way charged. Small and easy to toss in my bag, I am thrilled with this purchase and would highly recommend the Anker brand. I now carry it with me at all times!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"Love the convenience.","reviewDescription":"My first experience with an external battery and loved its ability to keep my phone charged on a long driving trip.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712534400000}
{"reviewTitle":"4 lights not blinking and it’s charged!","reviewDescription":"Last a very long time and very compact","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"Super útil","reviewDescription":"Muy buena compra, un poco pesadita pero acá en Honduras tenemos cortes de energía de hasta 8 horas y con éste power bank cargo mi celular y uso una lámpara al mismo tiempo, me ha salvado en varias ocasiones","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Great power bank!","reviewDescription":"I won't repeat all the good stuff about it rather I will make people aware of how to properly use it (and avoid sending cringe videos not using the product properly).First, the product has a micro USB and a USB C, labeled INPUT ... this is to charge the bank itself. Not your phone or other devices.Second, to charge your device you have 2 USBs labeled IQ. You will NEED an adapter if your device does not charge with a USB. Simple as that but there are people who do not get this obvious thing.Third, make sure you really stick the USB in the socket or else it will not charge.Finally, for charging the bank, if pull power from a wall, use a fast charging block because it will take a very long time.Hope this helped a few folks here.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Great charger for devices for travel!","reviewDescription":"Got this for overseas travel, so that we can always charge up our devices if needed, while traveling. For example, on an overnight trip to Europe- if you don't charge your iPhones, they will likely run out of power later the day of your arrival. We charged up our two iPhones while we slept (or tried to sleep) on the flight and they were fully charged and good to go all day when we landed.  Took it with us on day trips in case we ran low.  Highly recommend. Worth the investment for peace of mind. Good value.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699833600000}
{"reviewTitle":"Beware - Died and Anker warranty functionally impossible","reviewDescription":"My error was I bought as a gift too far in advance of a birthday.  One charging port was defective, but when the defect was discovered (90 days after shipment) seller would not take it back and Anker made it impossible to use their warranty process.  it was crazy.  Won't go into detail, but I just gave up after dealing with them couple of times without any luck.  I expected more from Anker, frankly - Lesson learned - buy only low dollar Anker items, check them immediately, don't gift them, and definitely not buy anything with just a 90 day seller return policy.  There really isn't an Anker manufacturer warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1713744000000}
{"reviewTitle":"Don't Buy*","reviewDescription":"I take a lot of photos and videos with my iPhone 14 pro when on vacation.  So I always bring an extra battery.  I was \"influenced\" by a travel influencer to purchase this battery, and I was optimistic based on the lower price point.  Sadly it didn't work at all on my trip.  I should have tested it out before we left.  I charged it over night so it was ready to go and then didn't work on the vacation at all.  I tried 2 different iPhone cables, and tried it with my friend's iPhone 15 pro too and it didn't work for hers either.  I tried to make a return on AMAZON, but apparently it's non-refundable.  Save yourself some grief, and pay extra for a better battery.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1712188800000}
{"reviewTitle":"It says charged because it doesn't charge my phone!  Worthless","reviewDescription":"Purchased this charger in Oct 2023 to take on cruises with me.  After leaving plugged in overnight, this thing did not even charge my phone 30%.  I've tried numerous times over the past few months to use this charger and am just completely frustrated with it. I've never had a more useless Anker product and I've bought my share of Anker products.  Do NOT recommend this charger.  It's big and heavy and will not completely charge my Android phone.  Barely keeps my phone usable throughout the day.  Trickle charges.  I'm past the return period and have never left Anker a negative review but this charger deserves it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Waste-cannot return","reviewDescription":"I guess I didn’t need to find print that this cannot be returned. I’ve had this plugged in for two hours and it’s only halfway charged. If it’s this slow charging the device, I can imagine how slow it is charging the phone.Quick charge? I don’t think soFalse advertising","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"Doesn’t charge","reviewDescription":"I have purchased these before and loved them. I am not sure what happened with this one. Purchased in March and for the last month, I cannot get it to charge. Just stays as 1 bar and blinks. It’s past the return window and I need it for travel so I guess I’ll have to purchase a new one. Disappointed in this purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Doesn’t keep a charge long.","reviewDescription":"Very disappointed in the performance .. within a year of buying the device wouldn’t stay charged and would take forever to build up any charge .. it became pointless to use. Do NOT recommend this device.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Answers no response","reviewDescription":"I have contacted them twice sent them pictures. The charger just stopped holding its charge after charging it all night go to plug it into my phone and it’s dead. I haven’t even had this year and I get no reply from them not good Anker. this is terrible Customer Service. I’m never gonna buy your product again. It’s not even a year and it doesn’t work and you’re not doing anything about it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Fire hazard after using it for a few months only","reviewDescription":"I have been using Anker products for many years and this battery bank is a major risk. I was using an Anker wall charger with my Android phone's stock USB C to C cable to charge this battery. After a few times, burning smell came out from the USB C port  with burn mark as seen in the photos. I stopped using it right away and contacted Anker but they gave me a hard time. So don't buy this battery if you don't want your house to be burnt down...","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"I loved this but it stopped working within 6 months!","reviewDescription":"Stopped working & it was expensive.  Very disappointed. I assume an Anker product would be good quality","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Powerbank died after 3 months of use","reviewDescription":"I bought this power bank in September for a trip in November. It was used from November to the end of January with no problems and then it would no longer charge. I tried the resetting method different adapters, different cables and contacted Anker for warranty support. I was outside of my three months of use because it sat on my dresser for a month and a half before my trip. They would not replace it so I basically spent $37 on a brick. I would not have bought it if I knew it was only going to last three months, buyer beware!","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707782400000}
{"reviewTitle":"Tech support misadvised. Truth is that it will NOT work as a power supply that remains connected.","reviewDescription":"Tech support gave bad info. I purchased the Anker as a power supply to leave connected to a GPS tracker. The tech said the Anker battery bank would deplete first, then the GPS tracker battery would deplete second. The technician was wrong.  What actually happens is the Anker automatically turns off and stops being used as the primary battery source, despite that it remains connected and despite that there is lots of charge left on the Anker. The truth is that you must manually push the button on the Anchor begin a new charge cycle. Not practical for the purpose of leaving connected as a power supply. WORSE, since my test took longer than 30 days to discover the bad information from the technician, they would only refund 80%, which I still have not received. Not cool.","isVerified":true,"ratingScore":1,"reviewReaction":"58 people found this helpful","country":"United States","date":1583193600000}
{"reviewTitle":"Portable charger","reviewDescription":"I plugged in the usb c to the portable charger to my iPhone 15 pro max and it doesn’t charge it just says “it uses too much power” please help","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Bad mui","reviewDescription":"an ad that is described is not the same this product does not charge iPhone I want one that charges iPhone and it is not the one that arrived I will beat Minnie The product arrived and it does not charge it only has a plug","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"The IQ is so low. Can not be charged fully.","reviewDescription":"The size and weight are perfect for travel if it works as described.I tried many chargers to charge the battery. When used 5V1A, 5V1.5, 5V2.2A,5V2.4 changers, it got charged to the 4th light quickly. Stopped charging around 10 mins. When check the power, it shows 100% changed with 4 lights on. but when used the battery to charge the phone, it dropped to 1 light in few minutes and stopped charging. Called Anker customer service. Told to use a 5v2.0A changer. I found a Samsung charger with output as 5V2A. It indeed charged the battery for long time from 2 light to 4 light. Then I tried to use the battery to charge my phone. It only charged my iPhone XS Max twice. I do not believe it can charge iPhone xs 5.4 times.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1616630400000}
{"reviewTitle":"Potentially Unsafe!","reviewDescription":"Item worked great until the battery inside started to swell. It became so swollen that it cracked the case. This battery is running the risk of explosion. Of course this happened a few months out of the 18 month warranty. I have purchased many Anker products and they have all been great. This one was a dud and potentially dangerous. I do not recommend this product. I will be looking for an alternative brand for replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1684368000000}
{"reviewTitle":"Stopped charging after 6 months despite relatively minimal use.","reviewDescription":"Used it probably twice a week to charge a phone for 6 months. Wont charge past 1 blue dot, 2nd dot blinking on charge for 48 hours now... Other reviews mentioning this company not being what it used to be. I have an old power bank from them that has been run through all kinds of travel, works like a charm still. Too bad.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"Doesn’t work and vendor won’t take return","reviewDescription":"I bought this portable charge for an international trip. Packed it in my luggage to use, and once I got to my location I found it didn’t work, I then tried using it with another charger and found it worked for maybe 3 minutes, but then found it started draining my battery instead of charging it. On top of that, the seller won’t accept my return so it was a complete waste of money. I would not recommend at all, total disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1669161600000}
{"reviewTitle":"Super disappointed","reviewDescription":"I have been experience difficulty in charging the power bank. One day I I kept this power bank charged over night and it still didn’t charge. Light sometimes turn green and sometimes it doesn’t even blink. I’m really upset that this stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Do not buy for USB-C powered products","reviewDescription":"This power bank does not charge my iPad Pro with the usb-c at all. The only reason I purchased this.  I’ve waited HOURS until this product is at maximum charge  then plug in my iPad Pro only to have the iPad’s battery drained. It’s at max power HOW is it draining my iPad ? Why is it not charging it at all? I’m using Apple’s usb-c\/usb-c cable it’s the biggest waste of money. The only reason I didn’t return it when I got it is because it’s handy for my iPhone. Today I’m FURIOUS it doesn’t work as there’s a massive power outage and we’ll be out of resources all day!  Additionally the battery life is less than it states and takes longer to power devices up","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1613347200000}
{"reviewTitle":"Horrible","reviewDescription":"This was the worst thing I ever spent money on. It would not hold a charge. Less than 2 weeks having it after I got it charged it died and I couldn’t get it to charge again.I will Never buy this product Again!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698451200000}
{"reviewTitle":"Great product highly recommend","reviewDescription":"Great product highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Quick Charge","reviewDescription":"I have used this for travel recently and love how long the battery lasts even after charging my device through the whole day. The only thing is that it is a tad heavy which is why I rated it a 4 out of 5 for traveling. Otherwise this is a great product for someone on the go.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Excelente inversión","reviewDescription":"Me ha parecido buenísima esta batería, es quizás un poco más costosa que las demás pero ha sido la mejor inversión porque en viajes tomar fotos y videos descarga super rápido el celular y con esta batería puedo cargar el iphone unas 6 veces antes de tener que cargarla nuevamente (la carga de la batería para estar nuevamente a full capacidad toma varias horas pero vale la pena).","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Super long charge","reviewDescription":"Love this! Have been using it for the past year and took it on many trips! The charge on this thing is insane! It’s a bit on a heavier side, but small enough for portability. I throw it in my purse and it is easy to use. Very durable. Love that there is usb and c charger option.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Pros & cons","reviewDescription":"Pros:1. Simple and easy to use. (as they should all be)2. Solid casing, nothings loose,  feels great has some weight to it.3. Seems to charge devices fairly quick even while in use during charge.4. Large charge capacity as advertised.Cons:1. Comes at half charge and takes 12 hrs just to charge it from half to full charge. so be prepared to charge it for a full day!2. Sometimes it simply won't turn on :( .....luckily if you plug it into a charger for just a second it will wake up and start acting as it should again provided you're in a location where you can do so after all........ Which could negate the need for having it in the first place for some ppl idk.... also may occasionally need to Use the same chords to plug into its input and output simultaneously for roughly 5 seconds to reboot it so if it doesn't work right away don't panic.I love the device personally I believe it's well worth the price. I may buy two to counter the long charge time due to the fact I sometimes forget to charge devices not because I need too.If the device is damaged look to see if amazon packaged it in non bubble wrapped envelope. As they did mine. So cringy trying out a new product delivered that way wondering if it's gonna work at all.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Great product","reviewDescription":"Use all of the time it has long life and works flawlessly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Useful","reviewDescription":"Great buy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"Exactly what I needed.","reviewDescription":"I got this for when I'm traveling or outdoors and want to charge whatever is with me. It does exactly that.I can keep my phone, speaker and friends stuff all juiced up, no problem. I haven't paid attention to see how many times it can completely charge my phone, Samsung S23+, but I have no complaints with its capacity or time to charge something.It does take a bit to charge the power bank, but you know, just do it before bed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Charging","reviewDescription":"Does a great job","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"My 3rd Anker Power Bank","reviewDescription":"I purchased this power bank December 4, 2021. This was my 3rd purchase of an Anker product.  I was so impressed with the Anker PowerCore+ 26800 and the PowerCore Essential 20000 PD that I decided to purchase this unit.  With this purchase the family was able to quit fighting over having a portable charger to use.  To this day this product works like new. Over the years I have continued to return to Anker for my charging needs. I have purchased 5 Anker charging devices and have been extremely impressed by the quality, durability and longevity of each one.With other brands you may pay less but with Anker, you get the best.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"Lousy product, lousy response","reviewDescription":"Fully charged, it could not sustain an increasing charge in my phone. And the USB port is broken, so the cord just falls out. No mesh bag. No C cord, just micro.  Weird since I have bought the exact item before. It took Anker two weeks to agree to a return, after Amazon said it could not be returned.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712016000000}
{"reviewTitle":"35 degrees doesn’t charge!","reviewDescription":"I decided to buy the Anker because of the quality and the dependability that it’s supposed to have. Compared to all the other brands that does power banks. But, I was fooled. I went to work in the garage yesterday on my barn doors and it wouldn’t maintain a charge on my iPad. This was at 35 degree temperature. It would start to charge and then after a few minutes it would then just stop. After about an hour. It went from 70% charge to 8% charge. With the iPad plugged into the power bank. What a disaster! To test it I brought it into the house. And then after a couple hours I tried to charge it with the same set up; power bank and cable used in the garage— it worked. Then I tried it on my iPhone and it also worked inside the house. What’s upsetting is I bought this just in case I have an emergency if I go into the mountains of Colorado. And then I could use it as a back up. Or when I go hiking\/backpacking in the mountains I could use it to charge my phone. But I guess I won’t be able to. What a waste of money! Need to find out if they take returns.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1643846400000}
{"reviewTitle":"USB-A!!","reviewDescription":"A \"new\" pack is still using USB-A. Who the heck still uses USB-A?!As a gift this product is just awful because I don't have a USB-A to lightning cable.It has USB-C *IN* to charge it but to use it I must buy a new cable.Oh, the writing on the pack is unreadable.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1714953600000}
{"reviewTitle":"JUNK.","reviewDescription":"Took overnight to charge this unit to full. Okay.  I decided to see if it could change any device asap and… NADA.  Not an iPad or an iPhone 11 Pro. Tried every cable and switching ends. Watched a few videos but nothing on troubleshooting. Guess nobody can be bothered.No support number to call. The so-called instruction booklet is meant for a dollhouse. Done in teensy sized print in 40 languages so that nobody can read the info.Obviously no quality control by Anker. Just wasting more of a customer’s time to go through all this, plus initiate a return, print up a label, pack up a box, and drive the package to a return center. That’s an hour extra right there at minimum.  I’ve bought cat toys that worked better. Good thing I didn’t rely on this “life saver” device.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"DOES NOT CHARGE USB-C","reviewDescription":"I was sorely disappointed with this power bank. Yes, it has a USB-C port, but that is only for changing the power bank (input, not output). I tried to plug in various USB-C cables to see if it would charge anything from the USB-C port. But no. You cannot recharge anything that has a USB-C cable on the other end. It’s dumb.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Don’t Bother","reviewDescription":"I have 4 other ankers and this one is the worst I have ever purchased.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Is this dangerous","reviewDescription":"After 4 years, it seems broken. Is this going to  A fire hazard?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Doesn't work, don't buy","reviewDescription":"I bought this for a 3-week trip overseas. It never charged and therefore could not charge my phone and accessories. Too late to return. DON'T BUY THIS.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Less than a year, it won’t work","reviewDescription":"I wanted this to work, came recommended. I used it for traveling and not even a year when it no longer charges things. Can’t refund because of time. But save your money. I used it maybe a total of 5 times on trips.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715126400000}
{"reviewTitle":"Didn't work","reviewDescription":"Did not work for both IP 13pro max & 15 pro max even full battery","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Stopped working 6 months after purchase","reviewDescription":"Randomly stopped working. I understand these products don’t last forever but purchasing a new one every 6 months is out of the question. I expected a more reliable product from Anker. Lesson learned.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710979200000}
{"reviewTitle":"DO NOT BUY THIS PRODUCT!1 Swells up and starts to crack open shortly after the warranty expires!","reviewDescription":"About 6 months after the warranty expired on this product it started to swell and finally started to crack open on the back. I called Anker customer service to get advice on whether the device was safe to use in this condition, they said definitely not. Throw it away and buy a new one was their advise. I asked if 18 months to 24 months was months was the life expectancy for this product and he said yes that was the normal life expectancy for Anker battery products! Seriously? You you buy an Anker battery product I guess you just have budget for a replacement after the warranty has expired. I have several other brands of charger batteries that are over five years old and still going strong. And they were lower in price! I guess you don’t always get a better product by paying a higher price…","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1659657600000}
{"reviewTitle":"Stopped working after a month","reviewDescription":"This just stopped working after a month","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1717718400000}
{"reviewTitle":"USB C feature does not support powering your phone or other devices, only for input","reviewDescription":"This device has a decent rating for power and has a USB A and a USB C port.  However, its USB C port is partially disabled and will only allow you to charge the battery not to then use the battery to power your phone or other device.  This is very surprising and you may order it like I did just assuming the USB C port works like all of the other USB C ports out there, but it does not.... so I returned mine.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1698710400000}
{"reviewTitle":"Outdated Charger and No Refunds – A Letdown","reviewDescription":"I'm frustrated with my recent purchase of this portable charger. It's baffling that it still uses USB-A output, which doesn't match up with most modern devices. Worse still, the company doesn't honor refunds, even after their products fail to meet their advertised claims. Buyer beware: outdated technology and poor customer service make this a purchase you might regret.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Dead on arrival will not charge","reviewDescription":"Item dead on arrival only partially charged and stopped. Item non returnable. Complete bs...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"USB is getting out of hand and this product is a good example of it.","reviewDescription":"TLDR; doesn’t support charging over the USBC port.Anker is a great example of what is wrong with USB. This power bank does not have power delivery over the USBC port, only with the regular USB type A ports.This means that if you bought new Anker chargers, and cables, you cannot use them with this power brick. Basically if I want to travel with anker products, to charge two products (phones\/tablets\/laptops):1 gen 2 GaN charger which has two USBC ports1 power bank4 USB cables, two USBC to USBC and two USB type A to USBC.Just make everything USBC capable already. This product is a perfect example of what is wrong USB in general. Never mind the fact that you have no idea what which cable is capable of in terms of data transfer and charging speeds.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"WONT CHARGE IPHONE 15- PLEASE HELP!","reviewDescription":"So I bought this in 2020 and I got a new phone recently in 2024 and it DOESN'T CHARGE MY IPHONE 15 pro as advertised. CAN YOU PLEASE HELP? Did the product change over time from 2020-2024? Or why doesn't mine work?!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705708800000}
{"reviewTitle":"DONT WASTE YOUR MONEY","reviewDescription":"I specifically bought this to take to Disneyland on a trip. I am 30 minutes away from Disney so I go all the time and I preferred to buy one off Amazon versus their rods.Upon receiving this, I charged it and it was ready to go. When at Disneyland my phone was dying so I tried to use it and it did not work. I have a new phone therefore I have a new charging wire and it did not work, I tried my sister’s new charger did not work. I even tried an older wire, did not work.Literally attempted to use it the first day and it does not work. I don’t know why I waited so long to leave a review and it’s probably too late to return it and I’m pretty sure at this point I can’t but if I can warn you all to not buy this, I am happy with that.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1642636800000}
{"reviewTitle":"Terrible","reviewDescription":"Product arrived in sketchy packaging and did not work. Read the 1 star reviews, common problem. Also, the product is labeled as \"highly returned\"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Long crack like other reviewers - possible fire hazard","reviewDescription":"Less than 50 charging cycles, approx 3 years before a crack started to show.My best guess is this is the internal battery swelling, which would be extremely dangerous and a huge fire hazard. A common negative review is this crack, all saying they purchased sometime 3ish years ago.Stay safe, and discharge your battery to less than 15%, the lower the better and consider recycling it.I will update this review if i bother opening it up to see the cause.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"Broke within a year","reviewDescription":"This product was great, until it died recently. It took less than a year. I usually expect more from Anker as a repeat customer. Hope they make it right.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"6 month later","reviewDescription":"I don't understand how something so expensive can stop qorking after hust 6 month, no reason, not a fall, it didnt get wet... just normal use, i even bought the special fast charger and cable from the same brand... got a more potent power bank, and just one week later this one broke.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Buyer Be Careful **Potentially A Hazard","reviewDescription":"I have been a fan of Anker products (I have bought many charging banks and cables) since 2014. However, the quality of the products has dropped significantly. Ankers products used to have much longer life expectancy's, better builds and I was more likely to have one stolen (lol) than it becoming dangerous to use.-This particular one has become \"bloated\" \/ \"swollen\" and has a long crack in the back (see picture). As a result, I no longer think its safe to charge. To be fair I bought the product March 2020 and now its Janaury 2023 so it being inoperable is understandable however, being hazardous is unacceptable!-In addition one of the USB ports stopped working 6 or 7 months in. Another observation I have noticed is this model and many others USB-C port never works for whatever reason. Lastly, am I the only long time Anker buyer that's observing a slower charge rate in the newer products? I am more than likely going to look into another brand at this point. No hard feelings!","isVerified":true,"ratingScore":2,"reviewReaction":"8 people found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"Short life span","reviewDescription":"Stopped charging after the first week.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"USB-C is only to charge pacl","reviewDescription":"Buyer Beware... the USB-C port can only be used to charge the battery pack, it cannot be used to charge your desired device. Trying to return item but it says it cannot be returned. Waiting on seller to contact me to resolve this.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1707350400000}
{"reviewTitle":"Great functionality, But bulging after 2 years","reviewDescription":"Battery is now bulging after 2 years of use. I expect it to become unsafe soon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"Performance is Uncertain","reviewDescription":"After a very long full charge and five days just sitting in a warm room, it would not charge an iPhone at all😩.  I’ll try a few more cycles before returning it than update my review.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Whoops","reviewDescription":"I bought this for an upcoming trip.  Maybe it’s a good product but I couldn’t tell you.  The key word is compatible.  The cord sent, charges the product only and does not connect to my iPhone 15k nor does the end of my iPhone 15 charger fit in the product.  So you have to buy a separate cord unless you happen to have one laying around which I didn’t.  I am considering sending it back.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Worked well, but now has a bulge and crack","reviewDescription":"I purchased this new in October of 2020. I am most certainly a fan of Anker products, as their reliability has been excellent over the years. This product has worked well since I've had it, and still works as it should. What's troublesome is the bulge and crack that have developed. The crack started small, but has now grown to almost half the length of the product. For the record, I have always kept this in a protective case when not using or charging it, and none of my other power banks have had this issue. I'm discontinuing my use of it, just to be safe.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"I LOVE it.","reviewDescription":"I have this power bank with me all the time. It’s the perfect size to bring on hiking trips and to just throw in my Fanny pack.It’s held up great and I’ve had it for months. Still charges pretty quick to full battery and will charge my iPhone 13 like 3 times and maybe a bit more than that. I don’t use it as much to charge two things at once but it does good with that feature as well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Great charger! However","reviewDescription":"This is a great charger. The reason I giving it 4 stars instead of 5 is because I got the iPhone 15 pro and I needed a new battery package that had a C charger spot So I can charge my new phone. I got the battery and it didn’t charge my phone when iPhone c cord. I had to buy a new cord that has one end usb and the other c in order to use this battery pack. I do not know why the C port isn’t work. If anyone knows why please let me know. You just have to have a cord with a usb end and the other a C end. Other then that’s it’s great!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"Go to charger","reviewDescription":"This power bank will charge your phone fast and you can get multiple full charges from a single charge of the power bank. I wish it had a USC output instead of USC input. I like the 2 USB outputs even though I have only use 1 most of the time. But it is there if I need it. It does have a little weight to it but not heavy to the point of you can't hold it for long periods of time. This is my go to travel charger. I never leave home without it especially if I know I'm going to be using my phone a lot. It has a sturdy feel\/ look to it. I have 1 other ANKER charger that I've had for 2 years that I still use.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Great for the cost!","reviewDescription":"To be honest I got this on sale but it works great! I have charged my phone multiple times and the battery life has barely gone down. Great for fast charging too and long term use. Only thing is that to charge the portable itself is a pretty slow but makes sense for how long the battery lives.Only possible con is I didn't realize I couldn't charge c-port to c-port, but that was buyer error for not paying attention to details.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1702080000000}
{"reviewTitle":"Works as described & such a great back up charger to have for traveling ( or teenagers on the go )","reviewDescription":"Update: the first battery charger I received must have been defective because Anker sent me a new one and it works perfect! It does take Approx 18 to get a full charge on the Anker once it’s dead but it charges my devices multiple times before I have to charge it again. Great customer service. I will definitely recommend this charger !Original post : Super disappointed in this powercore but I’m assuming I just received a defect item. I received this In the mail yesterday and it took approximately 18 to get a full charge. As soon it was it was fully charged, I wanted to test it out and charge my daughters iPad And see how it works before we leave on our family Disney trip( which is why I bought this). Are use the power cord that they sent me and the iPhone adapter square thing for the plug. It took about 4 1\/2 hours to charge the iPad And it drained the battery on the anchor to 50%!!! Based on all of the other reviews I expected it to charge it quicker than that and to barely Use any of the battery up. Super disappointing as I had hoped it would charge multiple devices if we need it at the Disney parks.  I then plugged it into my phone (Which was at 75%) Just to see how much it would drain the battery on the Anker. While my phone was hooked to it it stopped charging multiple times and I had to keep turning it back on. I definitely think I received a defective device based on all of the rave reviews. I immediately emailed the company & put in for a replacement. I will mail this one back, Fingers crossed the next when I receive will works efficiently. I will update this review once I can try out a new one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1583107200000}
{"reviewTitle":"A Life Saver! I used my Phone for 3 Days with this handy charger!","reviewDescription":"I recently purchased the Anker Portable Charger, Power Bank, 20K Battery Pack with PowerIQ Technology and USB-C (Recharging Only) for my iPhone 15\/15 Plus\/15 Pro\/15 Pro Max, iPhone 14\/13\/12 Series, and Samsung Galaxy. I absolutely love this charger! It has a sleek, modern design and it’s really easy to use. The 20K capacity is great for my long days off the grid and the PowerIQ technology ensures that my devices charge quickly and efficiently. I also really appreciate the USB-C recharging port, which makes recharging the charger super fast and hassle-free. All-in-all, I highly recommend this charger. It’s a great way to stay powered up on the go!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Very long battery life","reviewDescription":"I purchased this for a cruise, and it worked great.  It has a very large capacity, and so takes quite a while to charge fully.  However, I charged my Pixel twice from under 10 to over 90% and still didn't have to recharge it.  Charged my wife's iPhone once, and then recharged it.  Now, I carry it with me anytime I'm not sure how long I'll be without being able to top off my phone.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702857600000}
{"reviewTitle":"The USB-C port works fine! STOP SAYING IT DOESN'T!","reviewDescription":"I've seen some video reviews giving this power bank a bad review saying the USB-C port doesn't work when charging their device. IT WORKS FINE! People don't read the manual! The USB-C and micro USB ports are INPUTS. Meaning you use either of those two ports to charge the power bank. You cannot connect a cable to the INPUT ports to charge your device. The other two standard USB ports are OUTPUTS. Those are the ports you connect to in order to charge your phone, tablet, etc. Stop giving bad reviews saying the USB-C port doesn't work. Those people aren't using the power bank properly. After many uses, the power bank holds up and works fine!","isVerified":true,"ratingScore":5,"reviewReaction":"27 people found this helpful","country":"United States","date":1698192000000}
{"reviewTitle":"Quality battery bank","reviewDescription":"I am impressed with the battery life.  Got this to provide portable power for my sp-404 and it's honestly more than I needed, but I'm definitely not complaining.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"A Great accessory to have.","reviewDescription":"I like that it is very handy to have.  Sometimes I'm without any source of charging my phone for hours.  Nice and compact. It definitely serves its purpose.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Very Heavy","reviewDescription":"I put this in my purse in order to have a charge available when I needed it. The charger was so heavy I had to take it out.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"It works as advertised!","reviewDescription":"I just returned from a week's vacation  with a tablet,  a phone and a set of ear pods and never once required a wall outlet! A good product from a company who live up to their reputation!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"LOVE this","reviewDescription":"I take this with me every time I'm driving anyplace! The charge holds great! 4 stars because it is a bit heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Lasted 2 years","reviewDescription":"I repurchased this battery pack. My 1st one lasted just under 2 years. I continued to use it for an additional 6 months, before ordering a new one. This is my go to charging device.  I use it daily. For the price, and amount of use I got out of it, I'm not upset that the battery swelled and cracked the case.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1687219200000}
{"reviewTitle":"Better than expected","reviewDescription":"Its pretty sturdy and seems to  do what its supposed to. Id really like there to be a USB-C out port for charging my phone but the 2 USB ports work well.Reasonably fast charging also.I have Anker headphones so thought Id try some of their other products.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689206400000}
{"reviewTitle":"It's does what it is supposed to and it's not too large","reviewDescription":"My only grip is that the two output ports are USB A.  The input charging port is USB C.  With many devices moving to USB C, I don't see why this doesn't have a USB C output port. Other than that no issue so far.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"USB-c input","reviewDescription":"Edit: Anker made this problem right and for that I am thankful.  This may or may not be the backup charger that you want...but in my opinion anker is the brand that you should consider.This is probably my fault but what I was originally looking for was a large portable battery that offered usb-c output for more rapid charging.  I have sense realized that the usb-c is ONLY for charging the battery.  I might also add that from empty using usb-A connections be prepared to wait a long time for it to charge.  If you are considering this unit you really need to make sure that you have a usb-c charging cable.  I purposely charged it and then let it sit for several weeks.  The lights still indicated that the battery was full, but I wanted to see how it actually performed.  It surprised me just how well the battery performed.  The battery does have some heft.  It charged an iPhone from 20% to full and while being used and then charged an iPad from 7% while streaming video. The storage and performance is good...but I guess I will have to wait to find one with usb-c output.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1581811200000}
{"reviewTitle":"Great service, even better products.","reviewDescription":"I honestly was taken aback by this product.  I've been an Anker customer for years because of their usual superb quality, and I needed a replacement battery pack; so I ordered this one.  The battery has been charging for hours  on the same charger I use for my battery, and nothing.  This is very strange, and concerning as I needed it for travel.  Who ever is reading this, I would not recommend this product.Edit:After spending some time on customer service and telling the assistant my issue, she issued a replacement.  The customer service was phenomenal and the company held its ground as one of the best in my eyes.  Even after the replacement package was stolen, my assistant Sophia sent yet another package to compensate.  Great experience and I would definitely recommend.  This is my fault but I thought that the portable batteries all came with the usb c to usb c power delivery but I was mistaken, disappointed because now I have to buy the 26800 plus pd variant of the charger.  Even worse, I saw the upgraded variant of this with a pd system for cheaper than I bought this unit, that was definitely a bummer.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1584057600000}
{"reviewTitle":"Very useful charger!","reviewDescription":"Lots of capacity to charge devices while on the go. Product is more compact than expected but note that it is a little on the heavier side","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Another Anker product","reviewDescription":"Purchased this larger power bank after having three others.  First down side is no bag for it. Also considering the price, it doesn’t seem to hold that much more. Not sure why they wouldn’t offer a bag","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"LOVE THIS POWER BANK!!!","reviewDescription":"We have been purchasing Anker products for about five years, preparing for our six week vacation to Europe, we knew we needed to purchase an Anker Portable Charger, Power Bank, thinking ahead that we may need to charge our cellphones and iPads after a long flight and while on the train traveling from country to country.The power bank is a little heavy to carry in my purse, but it wasn't a deal breaker because had it with us when we needed it. We were able to charge three cellphones, and a couple iPads with one charge, and there was still enough charge for a second and maybe a third round.Not sure, how long it takes to charge 100%, but it didn't matter because I would charge it at night, when one light was left.Excellent product. Totally recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697673600000}
{"reviewTitle":"Has made life so much more convenient","reviewDescription":"First, this product has been wonderful. I originally purchased it for an upcoming camping trip. It did everything I could have asked for for camping and it was so useful I started incorporating it into other areas of my life.It is amazing for traveling. It is nice to know, that no matter where I go, I am set for all of my power consumption needs while traveling. It is the size of a phone but slightly thicker and about twice as heavy as a larger phone. I have found it invaluable for when I have forgotten to charge my phone as it easily fits in my pocket and is the same size as my phone.Finally, the battery life is outstanding. It does take several hours to charge but that battery goes a long ways. I can definitely charge my phone from zero to full twice, and I frequently use it to charge my other battery powered devices.If you are on the fence at all, I would highly recommend this device. It is well built, long lasting, and extremely useful. I would definitely buy this product again.","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Holds a lot of extra power","reviewDescription":"I love the fact that it comes in white. When shopping at the store, they were all black. I recently used mine on a short trip, then put it away for several months. I took it out to make sure it still has a lot of charge, and even though it's been months, it was still fully charged. I still have an old phone with games I like to play on it, so I like that it has a C charger port as well as the old style.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Best Power EVER!!","reviewDescription":"This is my second Anker and it never cease to amaze me how impeccable this product is. My first Anker power bank which I had for a while, my GF saw it and asked me to loan it to her. Instead, she kept it. That you don't have to recharge constantly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711584000000}
{"reviewTitle":"Blows the competition out of the water!","reviewDescription":"I have another brand of this same 20,000mAh battery. I thought it was very good -- it charges well, holds a charge well, and would charge my Samsung S10+ and my Garmin Instinct four times each before it ran out of juice.I got this one in prep for the same 60-mile trek to Mount Whitney, knowing my older one probably wasn't up to the task of fully charging the same devices it had the year before. Excellent decision!This one charged the same devices my other, older one charged, except the Garmin was getting two charges a day due to an aging battery. When I got home from my trek, this battery still had three more charges left in it! And it was slightly lighter in weight! Double win!Summary comparison: Older similar 20,000mAh battery: 4.5 charges each for Samsung S10+ and Garmin Insight. This 20,000mAh battery: 9 charges for Garmin Insight, 8 charges for Samsung S10+. So double the charges, for less weight and the same price.","isVerified":true,"ratingScore":5,"reviewReaction":"20 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Worth Every Penny","reviewDescription":"Charge day before you will need to use. It takes a while to fully charge device but that’s because it last a long time. i can charge my dead phone and only use 1.5 notches. I had the version that was a step down and it was clutch for about 3\/4 years and had I not lost it, i’d still have it. Great product and price for device! 10\/10 recommend!!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708473600000}
{"reviewTitle":"great device","reviewDescription":"It keeps the charge long, charges multiple devices on one charge","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Very handy tool.","reviewDescription":"Recharge overnight.  Good for multiple usage while away from home.  I didn’t realize I needed a bank, until I bought this!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1712966400000}
{"reviewTitle":"Works really well, charges fast!","reviewDescription":"Okay, I originally did a review saying it didn’t work. Turns out it was user error, I can admit when I’m wrong! I go into San Francisco to walk around and take pictures with camera for hours or even for baseball games and I used my phone a lot to take notes or where I took pictures, get videos of the spots a I took pictures for social media, FaceTime\/call my best friend, post on social media. I say all this to show I’m using my phone constantly and this charger helps my phone still have battery when I’m on the train headed home. Highly recommmend, I’m actually thinking of buying 3 more to give one to each of my siblings!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Solid Portable Charger","reviewDescription":"This product has performed beautifully! Most Anker chargers and wires have been amazing to be honest. Their BT speakers, Not so much! Stick to their Chargers and wires!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713312000000}
{"reviewTitle":"Did not charge more than 25% after 36 hours of being plugged into electrical current","reviewDescription":"I have charged this portable charger for 36 hours and still haven't gotten above 4 lights of charge.  I need to take this with me on a trip where I'll have no access to electricity.  Sending back.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1678320000000}
{"reviewTitle":"Defective Anker portable charger","reviewDescription":"I am unhappy with the fact that every time I connect the charger to my phone, it doesn't start charging until I take out the cord from the charger and reinsert. Once that's done it works fine but that extra unnecessary step is highly annoying. I obviously got a defective one. It's also heavy so if I throw it in my little back pack when I go hiking I can feel it's weight back there and it's a bit uncomfortable not to mention putting it in my jacket. I don't recommend this if you're going to carry it at outdoor settings or while waking around.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1613433600000}
{"reviewTitle":"NOT A HIGH SPEED POWER BANK","reviewDescription":"I had high hopes as I have had an Anker 2nd-Gen Astro E5 High-Capacity 16750mAh since 2015 and it works like a champ and it is FAST.  This model, however, is very heavy and is NOT a high speed charger.  I returned it and am still looking.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1666137600000}
{"reviewTitle":"Not typical Anker quality","reviewDescription":"It stopped working in less than a year.the lights come on but do not charge. Takes a long time to fully charge and is a bit heavy. I would not recommend. I wish they still sold the older version. That one lasted years","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1661299200000}
{"reviewTitle":"USB-C is only for charging the charger!","reviewDescription":"I got this because I thought it would be fast charging but it's not.  Output is only USB-A , not USB-C.  What happened to Anker? They used to have good products... Even the USB-A is pretty slow. It's like .5A or something.  Yeah it'll eventually charge your phone but you have to leave it attached for an hour or two.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649289600000}
{"reviewTitle":"Doesnt work after only few uses","reviewDescription":"Doesnt work. Poor quality","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Great product but mine died after  uses","reviewDescription":"I kept trying to charge it and then bring it somewhere and use it in my phone would never charge and I couldn’t figure out why. All mine does now is blinks three blue dots. I have a friend who recommended this product and she loves it and hers is still going but mine died","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"A fully charged device can only offer 12000-14000mAh battery capacity to your devices.","reviewDescription":"I have purchased Anker PowerCore Essential 20000mAh Power Bank! I have tested this product in multiple ways (charge and discharge; charge ~ 17630mAh, discharge:1A ~ 14350mAh, 0.5A ~ 14390mAh, 0.25A ~ 14530mAh). As determined the capacity does not correspond to the technical specifications (27.3% less).Anker customer support answer:Usually an external battery could supply 60%-70% power to other devices. Approximately 30-40% of the battery capacity is lost in circuit heat and voltage conversions. a fully charged PowerCore Essential 20000 can only offer 12000-14000mAh battery capacity to your devices.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1620000000000}
{"reviewTitle":"Wrecked on cost","reviewDescription":"$62 for prime and the moment the order went in, the price dropped to just over $42... not cool. I would not recommend this product. I am not going through the hassle of returning it over $20 but this kind of business practice just isn't cool with me. 2 stars.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659225600000}
{"reviewTitle":"Overheated and burned itself out after 4 months","reviewDescription":"Such a disappointment to see so many glowing reviews and have this one literally overheat when not even plugged in and then not work after that. It could have caused a fire.Great concept, super convenient to have it all in one unit, but I would be super cautious.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1649980800000}
{"reviewTitle":"N\/A","reviewDescription":"The product ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Nice charger","reviewDescription":"This is a great charger once it’s been fully charged. I took it on holiday and it charged my phone and watch for 4 days. When I plugged the charger in to recharge it it took a very long time. More than 10 hours. Not sure the exact amount of time. I gave 4 stars because it took what seemed like forever to recharge. It does seem to have a great capacity and did a great job charging my stuff though. I recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1662595200000}
{"reviewTitle":"Apple Iphone XR","reviewDescription":"I’m not computer or phone savvy so when I received this charger, I didn’t realized I couldn’t use the USB with my Iphone XR.  It comes with the input USB that of course, I didn’t even know what that meant at the time. So, I was so annoyed because I was about to go on a long hike. After searching all over the house for all kinds of USB that would work, I finally found one.  It seems the cable from my Apple Ipad worked; connected XR Phone to charger.  Too bad I couldn’t just use the Apple USB to also charge the Charger; so pretty much, I need both for now.  I would have given it a 5 star if I didn't have to find something else to make this whole thing work.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1616716800000}
{"reviewTitle":"Weight","reviewDescription":"This charger seems awesome, but boy is it heavy! I need something just quick  and in my purse. This makes my bag extra heavy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680739200000}
{"reviewTitle":"Heavy, doesn't hold a charge (updated)","reviewDescription":"(update). Ankers customer service is second to none.  They contacted me and quickly addressed the issue.  Changed from 1 star to 4 stars.I've had this for a year but haven't used it too much.  The battery itself is as heavy as a brick, and it performs like one.  Runs out of power after about 2 iPhone charges.  Super disappointing.  Anker usually makes great products, but this isn't one of them.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1647734400000}
{"reviewTitle":"iPhone 13 USB-C issue","reviewDescription":"The product is great according to battery life. I use it all the time for my usb charger cords on the road. The charge lasts long and it’s also fast when I use it. I just recently upgraded to iPhone 13, and unfortunately, the type C connection doesn’t work. New cord, new phone etc. Maybe double check before purchasing. Not sure if this happens with newer devices..","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1669939200000}
{"reviewTitle":"It has a large charging capacity.","reviewDescription":"I want to use the power bank to charge my phone and kindle when traveling. It takes a long time to charge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"Worth the purchase","reviewDescription":"This power bank as really proven itself to be useful. I have been able to use it to fully charge my two phones and still have power to spare. Its reliable, convenient and definitely worth having on hand for when u cant charge your phone normally.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"great product","reviewDescription":"lifesaver when stuck in airport for 8 hrs","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"Satisfied","reviewDescription":"Good product","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685836800000}
{"reviewTitle":"Keeps my electronics running!","reviewDescription":"I bought this to use while camping. My phone and watch lost power the last time I went camping and all I had to charge them with was my car. That wasn't a horrible option, but the problem was I have to keep the car on to charge. No thank you. So a friend of mine told me about these so I decided to check it out.I wound up having to charge my phone twice during a three day camping trip. It constantly checking for a wifi signal (forgot to turn that off after the first charge) drained the battery quickly a second time. I also had to charge my watch once. This little charger was only drained of one of four blue battery indicator lights. I'm impressed. I figured three charges would have cost it at least two. This thing would keep me going for awhile and is for sure becoming part of my regular camping gear.Note: it does take awhile to charge the unit itself. But if you keep it charged, or plan accordingly, it isn't really a big deal.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1657411200000}
{"reviewTitle":"I trust Anker","reviewDescription":"Another good experience with an Anker product. I trust their quality and reliability, and they never let me down.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Amazing device","reviewDescription":"While a little heavy (not too unexpected for the capacity) this thing is amazing.  While it does take a bit to fully charge (also not unexpected for the capacity) it was able to keep both my wife's phone as well as mine fully charged on a long car ride where we were both constantly using our phones (as riders of course, do not operate your mobile devices while driving)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701129600000}
{"reviewTitle":"My favorite","reviewDescription":"I never leave home without this power bank! I use it daily and it was a game-changer for me. Anker is always my go to!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711411200000}
{"reviewTitle":"Wonderful product","reviewDescription":"It lasts about a week for me which is perfect. I usually forget to charge my iPad for school but then this product saves me every time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Anker its a great brand","reviewDescription":"Powerful and dependable portable power","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"Perfect for my intent: long solo hikes","reviewDescription":"Best product, imo, for hobby of long, solo hikes in remote terrain. A bit heavier than previous charger that I used for 10 yrs. But tech has changed and this device give me and lovely bride piece of mind. Keeps phone\/Garmin Inreach Mini2 for multiple days. 69 yr old retired Navy vet.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Great","reviewDescription":"Keeps battery going","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714089600000}
{"reviewTitle":"Perfect","reviewDescription":"This is a fine piece of equipment. Use it a lot. Everyone have one.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"The best","reviewDescription":"I have had this charger for about a week and so far I am REALLY impressed!!!  I charged it fully when I got it.  Since then I have inflated a 12 inch tall twin sized air mattress and topped it off a few times, as I have broken the mattress in and needed to add more air.  I also charged my Galaxy Note 9 to a full charge once.  The charger still has 4 lights on, which is the max and I have not needed to charge it a 2nd time.Inflating the air mattress was the most impressive, because the directions mentioned that if the charger was not powerful enough, it would not inflate.  Not only did it inflate all the way, but it did it in a matter of minutes, with plenty of charge to spare.It is a little heavier than my last charger, but I feel it is really worth it given how powerful it is and how long it holds a charge.I highly recommend it!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1657670400000}
