{"reviewTitle":"No documentat","reviewDescription":"This turned my TV and read that I have cable on HDMI one and Apple TV on HDMI two, so I could switch between the two. But there’s no guide how to hook up my Bose sound bar, or negotiate my Apple TV. I stupidly threw out the box it came in, so I can’t return it, although it was inexpensive. I don’t know what this is capable of doing, so buyer beware.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Clicker","reviewDescription":"The description in Amazon said the clicker works with all Samsung product but it did not work for my blue-ray 3-D player. I am sending it back. It looks great and received it very quickly .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Didn’t work for my tv","reviewDescription":"Even though the model number matched for the remote it didn’t connect to my tv , but now it’s a great toy for my daughter who loves remotes 🤣 a win is a win","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Crapped out after 4 months","reviewDescription":"Remote was ready to use when I received it. It worked well for 3 months then started glitching and only working when it was close to the TV. Then at 4 months it stopped working all together. I tried to repair and change the batteries but it's dead! It was also in a room that isn't heavily used which is why it surprised me when it started acting up. Defiantly would not recommend, unless you want a temporary fix.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Only some buttons work as expected","reviewDescription":"I have several Samsung TVs. This remote only partially functions, even with simple commands, like entering numbers.  Avoid.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Okay","reviewDescription":"I only received the remote. There were no instructions on how to program to my tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Did not work, no instructions.  Useless.","reviewDescription":"Did not work, no instructions.  Useless.  Got it fast.  But can't use.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Only Samsung","reviewDescription":"It was marketed as \"universal\" but only works with Samsung brand tvs","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"No Instructions","reviewDescription":"I like the fact that it turns on my tv. But that's about it. And there's no instructions. I know it's pretty straightforward but for some reason it's not working with my TV so there is no way for me to troubleshoot it. Unless I want to look it up online. Which I'm going to have to. But yeah I would think that instructions would be something that should be included.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Difficult to manipulate","reviewDescription":"This is our second remote; we thought the first one was just a dud.  The buttons are near impossible to push to change the channels. It just doesn’t work. It was the exact same issue with the first remote. We have to go to the tv guide and SLOWLY scroll through the channels to pick the one we want. It is very frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"I didn't have time to evaluate.","reviewDescription":"I had hoped to have this remote work on (image attached) this Samsung TV. I put two new Maxell AAA batteries in it. I used it to turn on TV. Discovered that the Closed Caption button was able to be used after some decisions. The remote I got with the TV in my room was limited.This new remote was used for 20 minutes.The next day; it failed to turn on TV.I replaced the new Maxell AAA batteries with equally new Maxell AAA batteries.Still nothing.The other remote works as before.Thanks.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"It works when it works.... frustrating","reviewDescription":"This replacement remote is so frustrating. Sometimes it works, most of the time it doesnt. The volume will stop working and if i press pause then play, the volume will work again. I thought the battery are losing power but when I replaced with a new one it is still a frustrating remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Bought 2. Battery compartment won’t open on either","reviewDescription":"Comes in a small plastic bag with no information or instructions.As mentioned in other reviews, the battery compartment will not open on either one.Will just eat the cost, as it’s not worth the time or gas to drive to a return drop off location.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711756800000}
{"reviewTitle":"Don't buy this one, get an actual Samsung remote for the same price!","reviewDescription":"Technically it \"works\" but it's VERY cheap. When I first got it I immediately thought it felt cheap and light, and it had to pointed DIRECTLY at a very specific spot on the TV. Even slightly off that spot and it wouldn't work. It's also not responsive. I would have to hit buttons multiple times - to the point that I thought something was wrong with my TV due to the lag. This remote is also missing the little \"bumps\" on certain buttons which make it easy to know which buttons you're touching without having to look at the remote.  Within just a few moths the battery cover would no longer stay on, despite no visible damage. I finally decided it wasn't worth the trouble and looked for another replacement. I found an actual Samsung replacement on Amazon for just $1 more than this cheap one. As soon as I took the new Samsung made remote out of the packaging it felt DIFFERENT, heavier, more solid and substantial. The new remote weighed more than this one without even having batteries in it while the this one had them. This is cheap, flimsy, does not work well and quickly fell apart. And most importantly, you can get a MUCH better one on here fro practically the same price. This one is going into the trash now.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"El control no funciona con Smart TV","reviewDescription":"Que debo hacer para que funcione con mi Smart TV. Entendí que solo le.pomgo.baterias y listo. Pero no funciona con Pantalla Samsung Led Smart Full HD Modelo Un43T5300","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Inferior Product","reviewDescription":"I sent this remote control back for a refund because the buttons don't work right. They are either sluggish or don't work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Didn't work","reviewDescription":"I was never able to program it to my TV, I changed the batteries several times and it didn't work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Remote buttons don’t work","reviewDescription":"We have not had the remote very long but there were main buttons that didn’t work well to begin with, but a month in now many don’t work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Came broken","reviewDescription":"Go for something more expensive this doesn't work at all, it's a paperweight","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710979200000}
{"reviewTitle":"No booklet to help","reviewDescription":"I received the remote with no pamphlet to help me to set up the remote. How am I suppose to use this product with no instruction?","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Delivered on time","reviewDescription":"Have not had a chance to charge to see how they work. One was ok. The other was a tangled mess. Spent an hour trying to straighten out the slippery cord for hanging. Not thrilled","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Button operation very inconsistant","reviewDescription":"I sit 7 feet from the TV. This new remote was connected as soon as I installed the batteries. However, after using it for 3 weeks, I am about to buy another brand because with this one, the buttons seem to be failing to control the TV about half the time. Aiming is not the issue here either.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1707696000000}
{"reviewTitle":"Works but not the best","reviewDescription":"After purchasing this, 2 days later I purchased the original Samsung remote which was surprising cheaper than this one. The Samsung was just not showing up high in my search results so I ended up with this one. The buttons on this device are mushy and you sometimes really have to mash them to get a response, the batteries are not secure and I often had to open the back and reseat them. And lastly the hand feel was a bit sharp. The original Samsung has a smoother feel.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"Remote won’t let me do what I need it to do","reviewDescription":"Can’t get the remote to do all the functions I need!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"SOME BUTTONS KEEP PRESSED AFTER YOU RELEASE THEM","reviewDescription":"SOME BUTTONS KEEP PRESSED AFTER YOU RELEASE THEM","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Batteries Loose","reviewDescription":"The remote is fine except daily I need to take off the back cover and push the batteries back into place.  There is only my wife and I, 76 and 77, so the remote is not being abused.  Kids are not using it.  The batteries just pop out.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Delay on switching mode","reviewDescription":"The product work fine so far. Its have a couple seconds delay whenever i try to switch mode.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"Good price, but it stops working after a short time.","reviewDescription":"I gave it three stars because the remote has easy-to-use features and is small and lightweight. The problem with it was that after exactly five months it stopped working. I put new batteries in because I thought they had run out, but it didn't work.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"So far so good","reviewDescription":"Just received this today and so far so good. I would have opted for a slightly different design as this one is long and you generally have to look at it to eas the keys where as with a smaller remote you can u your senses to feel for your most used buttons without batting an eye. But I haven’t had any issues so far, the price point was good, arrived next day so what more can one ask for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Samsung remote","reviewDescription":"This product does not work all the functions on my 55\" Samsung smart TV","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1700006400000}
{"reviewTitle":"There are zero instructions.","reviewDescription":"This remote is incredibly cheap. It came in a plastic bag with zero instructions. Zero codes you have no idea how to get this remote connected to your TV do not buy this waste of money. I will be returning it ASAP.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Worthless junk","reviewDescription":"Worthless... I put new bats in and it worked Only to turn the TV on and then stopped working after that. Don't buy it!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709942400000}
{"reviewTitle":"Pice of crap","reviewDescription":"Works then doesn’t. Garbage. Amazon stopped taking returns, imagine that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1711065600000}
{"reviewTitle":"Horrible remote control - I want my cash back!","reviewDescription":"First of all there’s no lights on this remote so if you’re in bed watching TV and it’s dark you’re not going to see what you’re doing you have to turn on lights in order to change the channel or search anything so I have to say if I can return this I will.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Did not work","reviewDescription":"This remote did not work on Samsung TV, tried it on three Samsungs, did not work on any of them. It looked just like the original remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Very poorly made!","reviewDescription":"It came with no instructions so we can’t even use it! Cost more time than it’s worth to send it back than to just keep it!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Did not work","reviewDescription":"I bought this when we lost the original remote. Of course I found the original as soon as I ordered this one. I kept this one as a back up. When my dog chewed up the original, I pulled this one out, but it did not work. It's too late to return, so I am disappointed. I double checked the serial number and it should have worked.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700438400000}
{"reviewTitle":"Not a functioning remote","reviewDescription":"It doesn’t respond when trying to use it. If you hit it slightly, then it will work. You have to push the buttons several times or get real close to the tv to make it work, defeating it’s actual purpose.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"No  working","reviewDescription":"I bought this remote control  about 2 months ago, and it's stop working  I replace the  battery still not working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"No instructions!","reviewDescription":"I am a senior. Many of us need a word or two to activate the device. NOT A WORD OF  INSTRUCTIONS.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706918400000}
{"reviewTitle":"Buttons too loose","reviewDescription":"Have to press the button too hard","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614470400000}
{"reviewTitle":"Trash","reviewDescription":"Buttons got stuck in the remote ASAP","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627862400000}
{"reviewTitle":"Mail along with instructions to program it","reviewDescription":"It didn't come with instructions.I had to look up YouTube videos to figure it out.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613779200000}
{"reviewTitle":"No instructions included!","reviewDescription":"Couldn't get it to work on my TV.  Absolutely no instructions.  Returning.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1614816000000}
{"reviewTitle":"Remote","reviewDescription":"Very tiny buttons","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627084800000}
{"reviewTitle":"Cheap","reviewDescription":"Will have to order another remote for TV, very cheaply made.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1594425600000}
{"reviewTitle":"Cheap","reviewDescription":"Too thin, material not good enough","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1600992000000}
{"reviewTitle":"Light weight just doesn't feel the same as the older one....takes a few presses to respond.","reviewDescription":"It's slow","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627430400000}
{"reviewTitle":"Not satisfied","reviewDescription":"It takes couple of pressings to get a movement.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1581292800000}
{"reviewTitle":"Review","reviewDescription":"El control después de semanas o meses dejo de funcionar hoy no sirve si sirvió al principio pero hoy dejo de funcionar no sirve😡","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"It doesn’t work","reviewDescription":"I brought this remote and it did not work at all","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Only works sometimes","reviewDescription":"Only works sometimes, tried another set of new batteries didnt heip","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Useless For My Purpose","reviewDescription":"Had to return this item, it's a great remote but it was useless because I have a color display unit and not a TV, which I realized that I did not need it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Not universal","reviewDescription":"Wasted money. According to its own Q&A the only way to know if it works on your tv is to buy it and try it. Comes without any instructions. It is not universal.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Not that good","reviewDescription":"This remote does not work well.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Does not work on Samsung.","reviewDescription":"Description Says it will work on any Samsung tv. Well I have a Samsung flatscreen manufactured in 2013, 2021, and 2023. This remote does not work on any of them. If there is some way you have to program it the remote didn’t come with any directions at all. It came in a clear plastic sleeve.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Total junk","reviewDescription":"This is a total pice of junk. did now work. could not return it as I had no return address. I just put it in the trash. don not buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Faulty!","reviewDescription":"Did not work!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708819200000}
{"reviewTitle":"Does not work and no instructions.","reviewDescription":"Samsung tv","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708214400000}
{"reviewTitle":"No funciona","reviewDescription":"","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"It didn’t work","reviewDescription":"I could not get it to work; maybe because it’s an old model","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"The remote is trash","reviewDescription":"The remote doesn't work, it doesn't even blink with the new batteries","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705190400000}
{"reviewTitle":"Broke after 6 months","reviewDescription":"Remote worked great for a bit, but was very disappointed when after 6 months the device started to fail. The buttons along the bottom - the arrows, select button, play\/pause\/ff\/rwd - very important, most-used buttons, stopped working all together.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"NO INSTRUCTIONS!!!","reviewDescription":"Arrived in a clear zip lock bag with no instructions!!!!!!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"Garbage","reviewDescription":"Stopped working in just 2 months. Garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Poor touch response","reviewDescription":"Buttons are difficult to use and have to be pushed in repeatedly and wait for a response","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702339200000}
{"reviewTitle":"How’s the remote diff from original.","reviewDescription":"Well tbh it doesnt work. Also yiu cna its a copy one and not like how it functions like the orginal. Sometimes it takes a while for it to move when ur usin on TV.If your not patient person I’ll recommend not to buy this product cuz it will make yo patient rn out tbh. Even I sometime got angry cuz it didn’t work wel as I try to change the channel or make ◀️🔼▶️ So also if u might not notice at the bottom of the remote it DOESNT SAY ‘Sumsung’ like the original!.It’s lighter than original, slower, functions weird too.Well tbh it doesnt work. Also yiu cna its a copy one and not like how it functions like the orginal. Sometimes it takes a while for it to move when ur usin on TV.If your not patient person I’ll recommend not to buy this product cuz it will make yo patient rn out tbh. Even I sometime got angry cuz it didn’t work wel as I try to change the channel or make ◀️🔼▶️ So also if u might not notice at the bottom of the remote it DOESNT SAY ‘Sumsung’ like the original!.It’s lighter than original, slower, functions weird too.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1619049600000}
{"reviewTitle":"Horrible","reviewDescription":"This remote is crap.  It only works if I stand 2-3 ft or less from the tv.  Don’t waste your money, just get a real Samsung remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"25 times and it still does work","reviewDescription":"I’ve been trying to pair this remote for 3 days and it still does work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Dead Remote","reviewDescription":"I purchased this remote for my Samsung Smart TV. The remote is defective. I tried 8 new batteries, and it does not work. The seller guaranteed that it would work on Samsung Series TV. The eye on the front of remote did not light up while pushing buttons.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Gets the Job done but Cheap Quality","reviewDescription":"Obviously you get what you pay for, but we lost our one remote and bought this to compensate considering the official Samsung ones are a little pricey. It works fine but you really have to push the buttons decently hard for it to work. And it is also very light and feels cheap. But if you do not care about those qualities and just need a good TV remote that’s universal, this is def the most affordable way to go and it works.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"It works, which is essentially all it needs to do","reviewDescription":"I picked this up not because I lost my current Samsung remote, but because it's starting to act up and not work all the time, even after I've put new batteries in it.  I feel like it's going to die on me pretty soon.  So in comparing the two remotes, they both seem to be pretty much the same, with a few minor differences.  But this remote definitely feels much more cheaply made.  You can feel it in the weight.  It works though, and that's all that really matters.  How long will it work?  Who knows, but just be prepared to probably replace this one too after a while.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Works well enough","reviewDescription":"Got this to replace a relatives old Samsung remote for their tv. It works well enough so far. Only problem is, it doesn't (or can't find) the pointer button the old remote has. So if you need to move a cursor on the tv this one wont be able to do that I don't think. Just hope this one last's vs the others.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Affordable and Compatible","reviewDescription":"Great buy for the money, but Mute button stopped working after 16-months.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"No Instruction it will star working independently","reviewDescription":"This is how it come… no instructions needed.  Just start using it. So fart good 😊","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1710720000000}
{"reviewTitle":"Works!","reviewDescription":"I popped in 2 aaa batteries and immediately worked fine. Was nervous after reading some reviews. Aren’t a lot of tv controllers cheap and lightweight? I was replacing the solar powered one after it died, unable to recharge after only 2 months. This works great, and am buying another for my mom.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"works","reviewDescription":"good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Samsung tv controller","reviewDescription":"The price is very good and the tv control works, and when it expires its useful life its low cost makes the replacement do-able.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Does weird things with my TV","reviewDescription":"Some of the buttons don’t function as expected on my Samsung TV even though our model is listed as working with this remote. I needed an IR remote so I could program my SideClick remote with it. I couldn’t do that with the remote that came with the TV as it only uses Bluetooth. The Back button seems to take me to the Samsung Home Screen, and the Input button brings up the settings pane instead of input selection.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1705536000000}
{"reviewTitle":"I am on our 4th one.","reviewDescription":"It's great when it works but every year we buy another.  Buttons no longer work or battery doesn't read new batteries.  We use it for two separate TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"The worst buy I ever brought","reviewDescription":"The remote don't work with my TV","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1637884800000}
{"reviewTitle":"Not well made","reviewDescription":"Low quality, no instructions, and you have to push the button to many times before it responds.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1620086400000}
{"reviewTitle":"Not worth the hassle.","reviewDescription":"It kinda worked for the first few minutes, but stopped working very quickly. I wouldn't waste your money...","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1618185600000}
{"reviewTitle":"Button pressure","reviewDescription":"activate button.  It is not the batteries.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632441600000}
{"reviewTitle":"No instructions included","reviewDescription":"No instructions were included on how to set it up or pair it with the tv","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1619481600000}
{"reviewTitle":"looks the same but feels cheap","reviewDescription":"very cheap quality compared to the original. After little use the buttons have stopped working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620864000000}
{"reviewTitle":"Very cheap knockoff","reviewDescription":"Hard to push buttons. Short distance needed to work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"Meh","reviewDescription":"\"Worked\" right away, no set up needed. Buttons need to be pushed multiple times to get movement. Remote lags. Sending it back.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1581811200000}
{"reviewTitle":"Below expectations","reviewDescription":"Very poor quality but serves purpose.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1617840000000}
{"reviewTitle":"Waste of money","reviewDescription":"Worked for 5 minutes","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634515200000}
{"reviewTitle":"Amazing!","reviewDescription":"Simply said, this product does what it's supposed to do and does it easily and well. Received it quickly and the price is great. I put in two batteries, pointed it at my Samsung TV and it works like a charm! Does exactly what I needed it to do.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"No programming needed!","reviewDescription":"I was annoyed there were no directions included with the remote. Turns out I didn't need any! Put the batteries in and hit power. Works like a charm! My only regret is dealing with the quirks of my old remote for so long and not getting this one sooner!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"It works and was cheap","reviewDescription":"The original remote stopped working.  I went on Amazon and they had the exact same remote for only $6.  Got it in 1 day and works perfectly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711324800000}
{"reviewTitle":"So easy to set up.","reviewDescription":"This  remote works right out of the box. No programming necesary. Has all the functions on it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Replacement Remote","reviewDescription":"Received it a day early which was great. And it’s working great! Had to replace my other remote because the power button wasn’t working anymore.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Great replacement remote for a great price","reviewDescription":"Remote works fine. Just like the original at a wonderful price.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"BEST REMOTE EVER! NO PROGRAMMING REQUIRED!","reviewDescription":"Quite literally took seconds to operate with my Samsung TV. All I had to do is add batteries, then point and operate.So awesome, especially for the price, I'm going to try to see if they make one for my other brand of television.Ignore the one stars by people who didn't even attempt to operate it because there are no instructions\/directions explaining the obvious.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"Replacement remote","reviewDescription":"At first it wouldn’t wrk then I ask someone about it . I was dum I had to program it so looked it up on google. It works !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Worked with my tv!","reviewDescription":"Worked great with my tv. I had purchased on elsewhere and got home and couldn’t get it to work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Works great","reviewDescription":"The perfect replacement for the limited function remote that can with the tv.  Hard to believe that this great remote was less than eight bucks. Inserted two batteries, pressed on and it did the job. The return (to last channel) button is great - remote that cam with tv didn't have that feature - really?","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Remote","reviewDescription":"The remote did not work with my Samsung TV, even though it said it was compatible with my TV model.  Unable to return the remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639785600000}
{"reviewTitle":"Not worth the money","reviewDescription":"Remote controls looks like original but it’s not. It is slow to command TV and you have to press the buttons hard for it to send signal. Original cost few dollars more. Not worth it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631059200000}
{"reviewTitle":"Cheap but works","reviewDescription":"It's lite and feels cheap, but it does work. The biggest problem is that you really have to mash the buttons!!! Easy for adults but not for kids🤦","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1636070400000}
{"reviewTitle":"Doesn't work well","reviewDescription":"Sometimes it does not want to work. Will have to smack it a few times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648080000000}
{"reviewTitle":"Wrong Back","reviewDescription":"The remote came with a battery cover\/back that doesn't fit. Remote works, just with no back","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1644278400000}
{"reviewTitle":"Cheap Replacement Does The Job","reviewDescription":"This remote control looks almost identical to our old one. The main problem is that the back where the batteries are located likes to slide off so we had to tape it shut. Definitely cheaper than buying a Samsung replacement.  You literally put the batteries in and it works.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1610841600000}
{"reviewTitle":"Buttons hard to push.","reviewDescription":"Buttons are hard to push, takes 3 or 4 tries to get it done.. cheap feeling.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643846400000}
{"reviewTitle":"It doesn't work","reviewDescription":"Can't use this item, doesn't work","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1658966400000}
{"reviewTitle":"Doesn’t always work...","reviewDescription":"Remote works decently. Arrived before expected shipping time! There have been a couple times when it didn’t want to work, but for the price, it’s decent. It’s only not worked 3 times, and will usually start working again in about 30 minutes or so. Feels light and cheap.... but it’s better than nothing!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606348800000}
{"reviewTitle":"Batter cover tab broke immediately upon arrival.","reviewDescription":"The tab holding the battery cover broke off immediately. Don't care enough to send it back, so I just used some electrical tape. Probably should have bought another brand instead, but this was cheap and does the job.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618531200000}
{"reviewTitle":"Not with it","reviewDescription":"Only works when it wants too 🙄","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635724800000}
{"reviewTitle":"It's trash 🗑","reviewDescription":"It's spotty at best.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639353600000}
{"reviewTitle":"Fita the purpose!","reviewDescription":"It is a good remote control. Works as expected, however, you might have some issues with the keys. It will not be as smooth as an original Samsung, however cost 1\/9th of the price. Fits the purpose!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1600992000000}
{"reviewTitle":"I could not get the battery door to open","reviewDescription":"Could not open iy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1640563200000}
{"reviewTitle":"Good replacement remote at a good price point","reviewDescription":"This item looks exactly like the manufacturer's original remote and functions like one also.  The only complaint I have is that you need to press deep to use the remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1606780800000}
{"reviewTitle":"Lost function.","reviewDescription":"Remote already broke ... enter button does not work (The most important function ) but every other button works so had to toss.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1614211200000}
{"reviewTitle":"Es bueno y facil de usar","reviewDescription":"Llego en buen estado","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1635638400000}
{"reviewTitle":"Works, But...","reviewDescription":"Battery compartment is not snug enough to maintain a good connection. Annoying","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621555200000}
{"reviewTitle":"ok","reviewDescription":"ok","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639440000000}
{"reviewTitle":"Nice device, but where is the instructions?","reviewDescription":"Nice device that resembles the original remote control however, there are no directions on how to use or pair the device","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1607040000000}
{"reviewTitle":"Bare bones product","reviewDescription":"The unit arrived in a small ziplock bag in a padded mailer. No documentation was provided. No batteries either.For <$10 I guess it’s worth it.It works with my Samsung TVs but does not support my sound bars (all non-Samsung).I chose the wrong unit as I intended to consolidate remotes. Mea culpa.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1665705600000}
{"reviewTitle":"Not very accurate changes channels 2 at a time, more buttons than necessary.","reviewDescription":"It works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682380800000}
{"reviewTitle":"Broke after a couple days","reviewDescription":"This worked right out of the box, but seems to have broken after a few days.  We did the standard IT Crowd level of support and threw it away when we finally found the old one.  Well, we kept this one so we can refer to the buttons as 100% of the buttons on our original remote have the ink worn off.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1663545600000}
{"reviewTitle":"Junk","reviewDescription":"Don't waste your time or money on this piece of junk. It's true that it connects to the TV right out of the box. After two days it was working worse than the worn out one I bought it to replace. I must edit this as the situation has changed. The seller contacted me in an effort to make this right after I posted this review. Before I could take any action the remote suddenly began to work properly. So far it has continued to work as it should. I have no explanation for this but I am happy to see it working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1634688000000}
{"reviewTitle":"Not the Real Deal","reviewDescription":"Purchased this as a replacment for my Samsung TV.  This unit wouldn't even power my Samsung TV on and off.  I ended up ordering the real Samsung remote for less than two dollars more and am now in business.  Be sure to pulling the exact model number you want and order direct from Samsung.  I tried to save money and wound up returning this item.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649203200000}
{"reviewTitle":"You get what you pay for","reviewDescription":"I got 3 of these remotes, 2 are still working fine but the 3rd one quit working after almost 2 months just after the return date so I stuck with a broken remote. The other 2 work fine & no setting up was needed just put in batteries and go. I’m still happy with the other 2 I got & for the price guess it makes up for the other that stopped working","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Annoying","reviewDescription":"It works but this has to be the dumbest remote layout ever. Not easy to use in the dark you will need to study this remote. It’s responsive and the price is right.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1670457600000}
{"reviewTitle":"It came fast and no set up needed","reviewDescription":"This is like my 3rd one I keep breaking them but that's just a me  thing these r awesome and save my life lol best part is they work with no set up confusing crap","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668729600000}
{"reviewTitle":"No trae todas las funciones","reviewDescription":"No trae todas las funciones","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1677542400000}
{"reviewTitle":"Very goodbye for the money","reviewDescription":"Very goodbye for the money","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"Only Works Sometimes","reviewDescription":"Was difficult to get set up since it didn't come with instructions and when it did get set up, it only worked maybe half the time. Sending back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1649030400000}
{"reviewTitle":"Should have more buttons on this","reviewDescription":"Had to buy another one to work better","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666656000000}
{"reviewTitle":"Unfortunately did not work with my tv","reviewDescription":"I believe my tv was to old for this remote","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660694400000}
{"reviewTitle":"Feels cheap but works","reviewDescription":"It works fine, but feels extremely cheap compared to the actual Samsung remote. I didn’t even mean to buy this one but I clicked on the wrong one, silly me. I’m sure it’ll work fine until my son throws it in the toilet or hides it for two months again, at that point I’m going to get an actual Samsung replacement. (Again)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1612051200000}
{"reviewTitle":"Not the same as original","reviewDescription":"It was cheap which was nice but it’s missing some buttons that the original had making it slightly more of a pain to use.  Also pretty sure some guy just 3D printed this in their basement based on the way the plastic looks.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1628121600000}
{"reviewTitle":"Subpar quality. Decent price though so I’m not too mad.","reviewDescription":"Dog chewed up remote that came with TV. Ordered this as replacement. Easy to set up. Worked well for a month or so. Now it’s very finicky. Have to press buttons multiple times to get it to register and sometimes it lags and will register multiple button clicks. New batteries so that’s not the issue.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617148800000}
{"reviewTitle":"Quality of remote not the greatest, but it did work right out of the box.","reviewDescription":"The battery cover could not be opened without using a knife, the number keys are very small, and there were no instructions or any other paperwork for the remote in the package. Also, remote has a very light\/cheap feel in my large-finger hand. Still, it worked right away out of the box on my 6-yr old Samsung HD flat screen without any programing needed.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1608336000000}
{"reviewTitle":"Got what I paid for :)","reviewDescription":"The remote works but is very light weight compared to an original. Almost had to break off the back to get access to the battery tray. The buttons have to be pushed very hard and it has a significant delay, but hey it's usable and I got what I paid for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618617600000}
{"reviewTitle":"Returned item","reviewDescription":"Didn’t need after all so returned it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660262400000}
{"reviewTitle":"Buttons To Small","reviewDescription":"Often hit two buttons that once","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661385600000}
{"reviewTitle":"Remote","reviewDescription":"Work great. Put batteries in it and worked fine","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"arrived quickly and safely. no surprises, as advertised","reviewDescription":"It replaced the old one, no problems.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Nothing","reviewDescription":"Ok","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Works good","reviewDescription":"Works good as an original","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Good remote","reviewDescription":"Liked the fact that it's already reprogrammed. And it even worked with the Firestick. Only downside is the buttons are a bit sensitive.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Same as original","reviewDescription":"Same remote as came with tv when newly","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702512000000}
{"reviewTitle":"Just like the original remote.","reviewDescription":"Just like the original remote.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"It doesn't work on a sanyo","reviewDescription":"Like it doesn't work on my tv remoteIt didn't work on my tv","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1704672000000}
{"reviewTitle":"Does not work with Samsung soundbar HW-C450 when using Optical cable.","reviewDescription":"It is a great remote for a Samsung TV but not a Samsung Sound bar.  I have the Samsung 6 Series TV connected to a Samsung HW-C450 Sound bar connected with an optical audio cable and the remote cannot control the volume of the sound bar.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1701388800000}
{"reviewTitle":"Value Priced","reviewDescription":"Got the remote as a replacement for a slightly older Samsung TV. Considering both were Samsung brand there was no setup involved. Installed batteries and it was working immediately. I have another Samsung in storage, might buy another remote for that one too. I was willing to return product if it didn’t work do to compatibility issues, I suggest for those with less patience to check and match model numbers. Takes 2 AAA batteries not included.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Works, but not like original.","reviewDescription":"Our original remote got something spilled on it and died.  This replacement remote works, but it is very picky about where you point it.  We used to be able to point the original remote in the general direction of the TV and it worked great.  Now, we have to point this one exactly at the TV sensor eye.  EXACTLY.And worse than that, it has a substantial delay between the moment you press the button and the response on the TV.  It can be quite frustrating because you think it didn't register and so press it again.... and then suddenly it jumps two or three inputs ahead.  I would not buy this remote again, but it will do for now I guess.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660780800000}
{"reviewTitle":"Remote control","reviewDescription":"Not good quality.  Have trouble getting it to work have to hit a couple times.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"Adequate","reviewDescription":"No bells or whistles. It is what it is.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Cheap","reviewDescription":"I thought I was ordering a decent remote, once received it felt cheaply made.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1684281600000}
{"reviewTitle":"Easy hook up","reviewDescription":"Replacement","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691193600000}
{"reviewTitle":"It works, but ...","reviewDescription":"It works but it's not a quality replacement for the original remote that came with my 32-inch Samsung TV.  It pretty much has the same functionality of the original, but it's much smaller and lighter.  The buttons are small and close together making it more tedious to use.  It also lacks a backlight, so it is essentially unusable in the dark.  Bottom line: An O.K. cheap replacement for any occasionally used TV.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"Good for the price","reviewDescription":"It broke really fast but my kids threw it a lot. Probably would’ve lasted longer if my kids didn’t touch it. so.. I gotta buy another one  😭","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Basic remote","reviewDescription":"It works. Fine for the price.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686182400000}
{"reviewTitle":"junky battery cover","reviewDescription":"The remote works fine although the buttons need more pressure to work.What peeved me was I had a hard time getting the battery cover off. So, the tab that holds it in place at the top snapped off and now it rattles around in the remote. I put black electrical tape on it to hold it in place as the remote works and I'm leaving the TV it goes with behind for whomever buys this home.Never had such a hard time getting the batt cover off as I have a similar remote for a different Samsung but it's a 'smart' type TV. Same battery cover which easily pushes off. No need for me to return or buy again. I just don't care.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629504000000}
{"reviewTitle":"It works","reviewDescription":"We just got a new Samsung Smart TV. Our dog destroyed the remote. I ordered this remote on a whim not knowing much about remotes or how to program. I was just hopeful it would work out good. I got it today and had a working remote again in the amount of time it took for me to put batteries in and press the power button. No programming. No syncing. No googling instructions. Nothing. So easy. The remote is the exact same as the one my dog destroyed minus a few different buttons. Makes zero difference though.Update: A week later and the remote has stopped working with certain buttons. Can’t use the guide or punch in numbers for a channel. Very frustrating. Power, volume and the central hub button work so we still have a working remote but short term only. We are going to buy a better one from Samsung.","isVerified":true,"ratingScore":3,"reviewReaction":"10 people found this helpful","country":"United States","date":1608336000000}
{"reviewTitle":"No batteries & no instructions on how to operate!","reviewDescription":"No batteries included & no instructions on how to operate !  What’s my next step?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1638835200000}
{"reviewTitle":"Stiff remote","reviewDescription":"I’m disappointed I have bought two others from Amazon but this one is extremely stiff you have to keep pushing the buttons really hard to get it to function.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Meh","reviewDescription":"Toddler lost the remote.. again. This one was cheap and came fast, but it's not great. Buttons are spongy and don't always work the best, but it was like $10 so who really cares.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615334400000}
{"reviewTitle":"Push that button","reviewDescription":"feels totally different from OEM a lot lighter. I think the button need to be press harder than OEM","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629331200000}
{"reviewTitle":"Harder to use than it should be.","reviewDescription":"Buttons require extra effort in most functions. Using on a Samsung smart tv using YouTube tv and Roku (which has own remote).","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621814400000}
{"reviewTitle":"Button","reviewDescription":"I bought this remote a few weeks ago and the Exit button is not working.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1628899200000}
{"reviewTitle":"Works","reviewDescription":"Works fine but very lightweight and has no bumps on the kesy to tell what's what's in the dark.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622160000000}
{"reviewTitle":"Rough around the edges","reviewDescription":"Needs a little sanding due to sharp edges\/seams. Buttons need to be pushed hard for it to work.  For the price it's adequate.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616803200000}
{"reviewTitle":"Nice","reviewDescription":"Works good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646352000000}
{"reviewTitle":"Works but buttons are hard","reviewDescription":"Works perfect but the buttons are so hard. Have to push down hard and a lot toUse a button","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620000000000}
{"reviewTitle":"Easy to use.","reviewDescription":"Works the first time out of the box","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Function","reviewDescription":"Perfect Replacement","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Remote control","reviewDescription":"Very easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Easy","reviewDescription":"It worked right away","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Best replacement Samsung remote","reviewDescription":"Works good and lighter","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Great","reviewDescription":"Works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Samsung Replacement Remote","reviewDescription":"Easier than I even thought.  Delivered as expected to my front porch. I opened the package and the remote was in a ziplock bag.  I opened it, put the AAA batteries into the remote (FYI, batteries not included).I walked upstairs to my office and pointed at my Samsung TV and clicked on the power button on my new remote.  BAM!  No programming, nothing. It worked perfectly, instantly.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Worked immediately","reviewDescription":"I opened the package put batteries in it, pointed it at the TV and it worked. I bought a Samsung TV wit ha Roku box, but I had no way of controlling the volume or power on\/off. This remote worked immediately out of the box and I am very happy","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"Perfect for older Samsung TV’s","reviewDescription":"Just put batteries in it and pointed!! My tv is 17 years old and I was a little concerned the remote would not work. But no worries. The one thing is that this remote is not back lit like the original one. Happy with the purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703116800000}
{"reviewTitle":"It works on older Samsung flat screen tv.","reviewDescription":"I really appreciate this remote for years I had a remote that just didn't work some bottons didn't work but this new remote I got really works even to go on menu or source botton well everything works out battery in automatically works no setting up needed buy it it worked on my older Samsung that is about 12 years old it's worth it because it sucks when you you come home from work and you just want to relax and watch TV and your remote don't work.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"works with old and new tvs","reviewDescription":"I guess I'm just old fashioned.  We love Samsung tv's.  But our new big screen in the living room came with a remote with no channel buttons.  The voice search is convenient, but I like channel buttons.  And our new smaller tv in our bedroom came with a remote with app buttons, that we accidentally hit in a dark room.  I found this on sale and bought 2 of them, to replace the 2 mentioned above.  They both work on all our tvs.  I noticed it felt a little lighter than the Samsung, and it is .7 ounces lighter.  So we'll see how they hold up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705968000000}
{"reviewTitle":"Perfect replacement","reviewDescription":"Perfect replacement","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"This remote works","reviewDescription":"Much better than remote that came with the TV.  Original remote you needed a manual to operate the TV.  This remote  Is easy to you.  The price is great.  Recommend highly","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Works","reviewDescription":"So far it works. No bells. No whistles. But it changes the channels. So far I recommend it.  Price is right too","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Excellent Replacement","reviewDescription":"My TV came with the strangest remote that had like 10 buttons.  One button for Netflix, one for Hulu, which is stupid bc I don't subscribe to either!  It also didn't have any number buttons.  Whoever designed my remote should be fired tbh.  This remote is excellent and for $6 you can't beat the price!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708128000000}
{"reviewTitle":"remote for tv","reviewDescription":"works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"This is a Samsung brand specific universal remote.","reviewDescription":"I didn’t realize that when I purchased it. I’m returning it but not through any fault of the product. In fact, I’m sad I didn’t get to use it as I was excited to try it.It has a nice sleek design and wasn’t awkward as some remotes can be since I have small hands. If we had even one Samsung TV in our home we would have kept it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706745600000}
{"reviewTitle":"Muy util","reviewDescription":"Gracias muy util","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Worked immediately!","reviewDescription":"Just like the remote I'm replacing.  Worked right away!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Worked with old Samsung TV","reviewDescription":"Was able to access the TV settings and other functions using this remote.  The Samsung TV is a UN55D6000 (55 inch LED).  No setup required, worked out of the box.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Great!","reviewDescription":"Easy to use. No setup required.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"SAMSUNG OEM REMOTE CONTROL","reviewDescription":"Great product and fast shipping,  made for a overall great experience overall. I can recommend this seller for future purchases.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Nice","reviewDescription":"Does the job!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Universal remote control","reviewDescription":"I needed only to put the batteries into rthe emote and use it. It is perfect. Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Perfect replacement & easy to install\/activate.","reviewDescription":"Replacement for Samsung Smart TV original remote.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Remote","reviewDescription":"Works great, no programming.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Functional remote- put in batteries and it works perfectly!","reviewDescription":"When my Samsung plasma TV remote stopped working a few years ago, I did not replace it as I thought I didn’t need it.  When I recently decided I did need one as I could only get one tv channel, I first got a cheaper one— it didn’t work.  When I got this one, I could scan for channels and now I can get 16-20 channels.  I am very happy with this remote.  It is a bit lighter than the original, but it seems well- made.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1703030400000}
{"reviewTitle":"Worked with my TV right away!","reviewDescription":"Worked with my TV right away!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Good Product","reviewDescription":"Works as expected","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Great! Added batteries, worked immediately","reviewDescription":"It woks great no problem, no programming","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Fit well","reviewDescription":"Fit well","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678147200000}
{"reviewTitle":"Almost Identical","reviewDescription":"Almost identical to the original.  All the buttons in the same place.  A bit lighter weight than the original.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1671840000000}
{"reviewTitle":"Battery in and works instantly! Samsung TV","reviewDescription":"It was a pain to get the battery lid off but once i did that, easy peasy! Works as soon as the batteries were in. All buttons did as intended. Its not a high quality remote and you can tell the difference between the official and this but it works! Quick and cheap.I got a Samsung 5 series 4k TV (yea, yea I know. It's old and I'm cheap! Lol) believe. No problems. Should work for","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1639526400000}
{"reviewTitle":"Good remote","reviewDescription":"Good remote. Connected to my TV as soon as I put batteries in.  No code required.  Wish it had lights behind keys for nighttime usage. And sometimes I jave to press the enter key a little hard so it will read but other than that a really good buy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"Works good, but the button action isn't as good as the original","reviewDescription":"Buttons don't have quite the sweet action as my original controller-they seem slow to move-they require more effort to depress than my original controller. Also there are some sharp edges on the outside of the controller that aren't quite as comfortable as the original. However, if you didn't have the original to compare it to you wouldn't know the difference.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1652227200000}
{"reviewTitle":"Works Great","reviewDescription":"This worked right out of the package with no programming required for my Samsung TV, despite the tv model number not being listed in the description. It is very straightforward and easy to use. I knocked off a star because the buttons are not backlit and it can be very difficult to find the ones I'm looking for in a dark room. Otherwise, the remote is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1643673600000}
{"reviewTitle":"Easy and cheap replacement","reviewDescription":"Got a TV open box that didn't have a remote included. Naturally I was frustrated. I got a different replacement for it that didn't work well and was very frustrating. I eventually went ahead and got this one. Much better. Simple to use, does what it needs to do. One issue I find is that I often have to press the same button more than once for it to register. Not the worst thing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1634169600000}
{"reviewTitle":"Great 😊","reviewDescription":"Good 😊,tv","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673568000000}
{"reviewTitle":"Preprogrammed for samsung","reviewDescription":"Great replacement item that is super easy to use right out the box.No programming needed as it works with Samsung TV","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1664928000000}
{"reviewTitle":"It controls remotely. Does what it says. Easy to use.","reviewDescription":"There were two TVs and this remote wanted to control them both. So be aware of pairing.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1666483200000}
{"reviewTitle":"Looks and feels like a toy. Skips channels","reviewDescription":"Skips 2 channels every time you push the down button","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700092800000}
{"reviewTitle":"How do you program?","reviewDescription":"This remote came in a small ziplock sleeve. No instructions or anything. There’s no brand on the remote to be able to look up how to program online! The first one I had was used 3 or 4 times a month to adjust volume on some apps the sound is much louder. It worked about 4-6 months before I had to reorder. It maybe be ok, but no lights come on and I’ve tested the batteries in it. It may simply need to be reprogrammed, but I’ve got zero idea how to program it!!!! There are some tiny model #s on the remote I’ll try googling. Here’s hoping! I shouldn’t have to scour the internet to figure out how to program it, it should have come with instructions! It claims to be new, but I’ve got my doubts. It also says it’s a Samsung universal remote, but no where on the remote is the word Samsung. I’d think they’d what their brand or logo on their remote, right? Spend $15-$20 and skip this. Now I’ve spend nearly $20 on two remotes and can’t use either at this point! I may return it if I can’t find out how to program it!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1653696000000}
{"reviewTitle":"I love that it was truly an easy connect, put the batteries in aim, and enjoy!","reviewDescription":"Love that all I had to do was put in the batteries, aim and play. I wish the remote control had a little bit more texture and weight to it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Not good","reviewDescription":"Tried to work all the tv should do and remote doesn’t respond to the commands. Want to just punch in the channel and it goes to a different app.No easy instructions that come with it or Digimarc answers to my questions.Not worth the trouble","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695081600000}
{"reviewTitle":"Doesn’t work with DVD player","reviewDescription":"I bought this universal remote, because it worked with our TV. We recently canceled Dish TV, because most of what’s on TV these days is garbage. We were being forced to take 120 channels, when we only watched five or six channels. I was hoping I could use this remote and not have to keep two remotes and clutter up part chair, side table. It turns out, that I have to use this remote to turn the TV on, and I have to use the DVD remote to play videos. so this remote doesn’t work like a true universal remote.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680912000000}
{"reviewTitle":"Meh quality.","reviewDescription":"These things work for my TV but they don't last. I would say I got my $ out of it though. It is a little different than the original as far as buttons go. Last one lasted about 25 months with less than average use. One last note, on the last one, we used to have to slap it around to get the volume to work. We had to slap that thing around almost from day one. So with daily beatings, I guess it was over average use, but we only beat it because it essentially arrived faulty.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1679875200000}
{"reviewTitle":"Works but doesn’t work amazing.","reviewDescription":"Gotta hit some buttons multiple times. Relay time is a bit behind about a few seconds.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"It's like slow comparing to Samsung ones","reviewDescription":"Slow but do the job","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Lasted 3 months","reviewDescription":"Loved the first one so ordered second remote for bedroom television that lasted almost3 months then died. Ordered a third one to replace that,so far,so good.Otherwise loved how easily it worked well immediately out of the box.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1686960000000}
{"reviewTitle":"Feels like a toy.","reviewDescription":"I was annoyed with this remote control. it does not click smoothly. It looks like a plastic toy. I had to buy another one in store at Walmart which is super smooth and of good quality.I regret not returning it. it just lies here at home unused.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1683504000000}
{"reviewTitle":"Why did I wait so long","reviewDescription":"This worked great out of the box. The TV is 5 years old. If you need one get it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"works","reviewDescription":"I mean it's a remote and it works","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Exact Replacement","reviewDescription":"Most all of the print was worn from the original remote's buttons. Received this remote, inserted batteries, and I was off and running!! No complaints.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Works Perfectly ...","reviewDescription":"... and it's nice to be able to see the buttons again. After wearing all of them off, I had no clue where to buy a brand-specific remote. No need; this thing is terrific.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"great product","reviewDescription":"Works perfectly and I am always misplacing my remote so this is a fallback.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"easy to use","reviewDescription":"replaced old remote","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Worked on my older TV","reviewDescription":"I ordered this for my Samsung tv that has to be atleast 10 years old and it worked!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Works great for an older Viewsonic LCD TV\/Monitor","reviewDescription":"I wasn't sure if this worked any longer and the remote was missing + no external power switch. I was able to use it after entering the 1st programming code. I was happy to discover that I had a good Hi-Res TV\/Monitor! Thanks Amazon","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"Works great!","reviewDescription":"Arrived quickly. Popped in 2 AAA batteries & that was it- So far, it works great!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Universal remote .","reviewDescription":"I love that I was able to get a replacement for my remote that quit working.  This one seems to work great, and it arrived very quickly.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Remote for Samsung TV\/Monitor","reviewDescription":"I looked for a compatible remote for the monitor now being used as a television, and found this remote control.  The remote was available from Amazon for a great price.  Worked out of the box without any setup.  Very happy with the remote.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Simple to use controller","reviewDescription":"The POS enhanced voice activated remote that came with our 75 inch Samsung was a total pain because we do not choose to use the voice option. Samsung parts shows compatibility only with it for our model that we are having volume control issues with. Took a chance on this universal remote, just arrived and works great, I missed the ability to just type in the channel number to go where I wanted and this does it.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"It works","reviewDescription":"It arrived quickly","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Good replacement easy to install","reviewDescription":"Works well with my old Samsung TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Worked perfectly","reviewDescription":"No problem connecting remote to Samsung TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Quick delivery","reviewDescription":"Great service. Great product. Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Great","reviewDescription":"I opened the remote put batteries in it. I turned to the TV and it was instantly connected. Never had a remote I didn't need to setup.Great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Great","reviewDescription":"Works great!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Great Product","reviewDescription":"I purchased this remote as a replacement for our Samsung remote since my kids keep losing the one we got with the TV. The remote looks very similar to the Samsung version and works just as good. I don't think I can say anything negative about this remote. I haven't had any issues with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706832000000}
{"reviewTitle":"Great for the price .","reviewDescription":"works well .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Happy","reviewDescription":"Love That it works straight away loving it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Universal remote","reviewDescription":"Open the package, point and click. Nothing to set up.👍","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1685577600000}
{"reviewTitle":"Not bad","reviewDescription":"Sometimes I have to move the remote around to get it to change channels but for the money, I would say it’s not bad.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678233600000}
{"reviewTitle":"It's does the job intended","reviewDescription":"I was given an older Samsung TV with no remote, so I took a chance on this universal remote.  It has worked out fine.  It is obviously not fancy, with no bells and whistles, but it is enough to do what I need as a simple user.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1675036800000}
{"reviewTitle":"great but no sleep control","reviewDescription":"Only thing my last remote had a sleep feature do not see on this one?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678665600000}
{"reviewTitle":"No raised dots...","reviewDescription":"This was a replacement for my Samsung remote that came with the television. The only problem i have is that there are no raised dots on the center buttons (the 5 button and the Enter button in the center of the directional arrows) which make it easier to use in the dark. So for a quick fix I swapped out the button pads between my old and new remotes, problem solved. Old remote with the new buttons on the left, new remote with old buttons on the right","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1657411200000}
{"reviewTitle":"Worked but","reviewDescription":"Worked right out the box but was a input delay","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1682812800000}
{"reviewTitle":"Was good replacement for original","reviewDescription":"Dog chewed up remote, or rather several. There are minor differences from the original Samsung remote.  So far no complaints as in the quality etc will update if needed","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Works","reviewDescription":"Replaced a non working remote on a small Samsung TV. Just needed to be able to turn on\/off. Roku box takes care of streaming. Also needed sound level adjustment ability.  Remote worked OK for that. But I needed a screwdriver to open the battery case. Fortunately the screwdriver worked to get it open.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1668297600000}
{"reviewTitle":"Great value and replacement","reviewDescription":"Easily programmed remote. Works as expected. The only downside is that it lacks a sleep button. I have to run through the settings menu to set the sleep timer. Great product for the cost.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673049600000}
{"reviewTitle":"Could have been better","reviewDescription":"Got the remote within the expected time, which was awesome. But there were not instructions on how to connect it to the tv. Just a remote. glad to know the people selling this just wants your money and not satisfaction.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"can without instructions or manufacturers packaging","reviewDescription":"Good price but I’m not sure if I will be keeping it. It arrived in a ziplock bag with no programming instructions or manufacturer info. Going to see if I can figure out how to program it, if not I will be returning it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Frustrating to use!","reviewDescription":"I would save my money and buy a Samsung universal remote.  This one is so frustrating to use!  You have to push the button 3-5 times to get it to do what you want, it is cheaply made…cheap plastic feel and the buttons come off easily!  Waste of money!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1674864000000}
{"reviewTitle":"Doesn’t work","reviewDescription":"The remote doesn’t work.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"Wouldn't sync to my tv","reviewDescription":"I have a Samsung Series 6 television and this remote says that in order to sync it there is a button on the bottom left of the TV that should begin thr sync process. Well, my tv has only one button and none of the toggle options worked. Maybe it's just my specific version, but for whatever reason it doesn't work for my tv, so I wouldn't recommend this remote if you have a Samsung Series 6.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Universal remote BN59-01199F","reviewDescription":"This remote is junk! People state it comes working after installing, batteries well tried 3 sets of new AAA batteries. A coincidence I don’t think so JUNK. Don’t waste your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1683331200000}
{"reviewTitle":"Power button stopped working after a few months","reviewDescription":"This remote was great back in January, 2022.  We have 3 Samsung TVs and it worked on all 3.  But then, the power button started to act up and then stopped working all together within a few days.  I am looking to replace this remote now as my wife does not like the universal remote that is filling in.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1660694400000}
{"reviewTitle":"It was not automatic","reviewDescription":"During a move, our mover packed the remote for our Sanyo TV where we could not find it. I searched for a remote and found one that advertised it was compatible with all Sanyo TV's. I ordered it and it came within two days. Out of box it did not work with my TV and there were no instructions that came with it. It was a waste of time and money among all the other problems we were experiencing with our mover.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1626307200000}
{"reviewTitle":"Quit after 2 months","reviewDescription":"Never did work great from the beginning. Totally quit after 2 months","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"This product came defective had to return","reviewDescription":"I have ordered many of these in the past it’s the first fire stick that was defective","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"Works well","reviewDescription":"I bought this over a year ago now and it still works.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"No SETTINGS button","reviewDescription":"Instead of the SETTINGS button that on other remotes is located below MENU, this remote has a TOOLS button. I thought it would bring up the tv settings but it does not. When I press it a small window appears on the center of the tv, saying \"not available\". To access settings I have to go through the Smart hub menu. Since I don't need to update settings often anyway, I gave it 4 stars, because everything else works fine with my tv.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Good buy except…","reviewDescription":"Works perfectly fine. The only issue I have is that the back part of the remote is very soft and slippery that it slides in my hand from side to side. Wish it had a grip.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Easiest set up","reviewDescription":"Just needs batteries and works right away. No tedious setup. Sensor is a little touchy but overall good replacement for cheap","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"Better","reviewDescription":"This is better than the one that came with my TV. By a serious margin.  I do recommend if you want a better cheap plastic remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"It changes the channel....","reviewDescription":"If you have an attached sound system\/bar you might need to still control that with its remote.  My Bose sound bar is not controllable with this remote, it does work with the original limited button Samsung remote.  When trying to set this one up the same way I get an error on the screen saying it is not an original Samsung remote.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1699488000000}
{"reviewTitle":"Funciona","reviewDescription":"Bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702252800000}
{"reviewTitle":"Worked well as a replacement","reviewDescription":"The only issue we had is one button that no longer works easily. Other than that it was a seamless replacement.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699056000000}
{"reviewTitle":"Not a solid buy","reviewDescription":"I had this remote control before and when I accidentally ordered this one again I was reminded why I gave the last one away to someone I didn't care about very much.The original Samsung remote has solid \"feeling\"buttons, compared to \"squishy\"feeling buttons with this remote.I have to re-press the button with more force.It works but not like original!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693180800000}
{"reviewTitle":"Great Replacement Remote","reviewDescription":"I got tired of the dumb round selection control that the new Samsung TV's come with. Not all apps in the smarthub (apple, netflix, prime) made it easy to exit the app with this type of remote. I always found the cross or plus sign arrows easier to use and select features and buttons.  This remote did that plus it was already programmed to my tv, I did not have to set it up.  I run sound through my stereo so the volume features are not necessary.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Gets the job done. Hard to press buttons","reviewDescription":"This remote control gets the job done. It is very affordable and fairly functional. Biggest gripe about this remote is that the buttons aren't very responsive and you have to press them fully and firmly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696291200000}
{"reviewTitle":"samsunf universal remote","reviewDescription":"It works with my samsung led tv. all the buttons respond like volume, channels and it takes 3aa battery.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Works instantly no need to program","reviewDescription":"Works great did not need to program just insert batteries and go however it is a bit slow and the buttons don’t always register still great though","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696809600000}
{"reviewTitle":"wish it was easier to see","reviewDescription":"need bigger buttons but all is good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700179200000}
{"reviewTitle":"TV does not recognize all functions of this remote","reviewDescription":"like the layout of the remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"Works","reviewDescription":"Works for samsung TV","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"no manual - does work","reviewDescription":"I have a new UN50CU7000FXZA tv.  Not too crazy about the provided remote so found this one.  Even though not listed in compatible list of tvs it worked with mine - no issue at this point.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692057600000}
{"reviewTitle":"Gets the job done","reviewDescription":"This has gotten the job done but it made of cheaper plastic I think than the original because it’s already chipped not sure how lone it will last just grateful that it works. Thanks!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Worked with no set up","reviewDescription":"Add batteries and hit power - that’s it. Got my old Samsung TV working","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Easy operated","reviewDescription":"Like easy simple operation","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697587200000}
{"reviewTitle":"Stopped working","reviewDescription":"Stopped working in less then 1 month . Do not purchase!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694304000000}
{"reviewTitle":"Didn't work","reviewDescription":"This did not work with my tv as described. Returned","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"No instruction, doesn’t work","reviewDescription":"I cannot get it to work. No instructions on how to connect to tv.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692489600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"I was excited to get this in the mail. As soon as I received it I put new batteries in and it wouldn’t turn on the tv. So I figured I got a bad remote and asked for a replacement. They immediately mailed me a new one which was awesome on their part. As soon as I got it I put in new batteries and it turned the tv on once and that’s all it did. I can’t turn it off or change channels or volume which is so frustrating. I was hoping to finally have a working remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1632873600000}
{"reviewTitle":"Doesn't  work.","reviewDescription":"It doesn't work and no instructions were included.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Works about 10% of the time","reviewDescription":"Very cheaply made crap that went days without working, and for no discernible reason.  It didn't matter if you changed the batteries, this piece of crap has its own mind.  In the current state its in, it's only slightly less effective, and that's not hyperbole.  I wouldn't suggest this remote to anyone... unless you too want to walk to your TV to turn it off... and\/or to see if you can snap yhe remote in half with your hands in a fit of rage.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1643673600000}
{"reviewTitle":"Garbage. Absolutely. Positively. Garbage.","reviewDescription":"It doesn’t work. It turns it on but nothing else. Literally can’t do anything else. Total garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Do Not Buy!","reviewDescription":"Waste of money! Did not work AT ALL straight out the box. Do not buy.If you are trying to find a replacement for your Samsung TV remote, try this remote instead: RCA RCRBB05BHE 5-Device Universal Remote Control.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"Didn’t work","reviewDescription":"Cheap knockoff product it seems like. Doesn’t even turn on","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695168000000}
{"reviewTitle":"Didn't Work","reviewDescription":"Some  buttons produced no results and others produced wrong results.I returned the item for credit, which I promptly received from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688428800000}
{"reviewTitle":"remote control","reviewDescription":"i have no idea what the oem remote looked like.. this has all the features.. but buttons small and not intuitive.. but all the features work.. guess i have to get used to the tiny buttons and their placement.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648339200000}
{"reviewTitle":"Worked well intially","reviewDescription":"This worked well for the first 2 months. Then has a short and had to be hit against something to make it work. Unfortunately as it worked well initially.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1649376000000}
{"reviewTitle":"Not backlit","reviewDescription":"My remote quit working after 8 years saw this and purchased it.  It does work we like an original.  But if you want to use at night you have to turn the lights on as it’s not backlit.For a spare it works in a pinch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1629417600000}
{"reviewTitle":"Works for a while, but broke in less than a year","reviewDescription":"It works out of the box. Mine broke within a year. Spend a bit more and get something that will last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1664582400000}
{"reviewTitle":"Not a samsung remote","reviewDescription":"Shouldn't claim to be samsung remote. Should looks like samsung.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1673827200000}
{"reviewTitle":"Have replaced this remote 2 times already!","reviewDescription":"Poor quality - I'm on my 3rd remote. Seems to only have a 2\/3 month life. Keep replacing because of price and lack of other options.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1652313600000}
{"reviewTitle":"Hard buttons","reviewDescription":"You have to press hard on the buttons for them to work","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1668729600000}
{"reviewTitle":"Stopped working","reviewDescription":"I was expecting it to work better but the on and off button stopped working within just couple months .. changed the batteries thinking it might be batteries but no !","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1640044800000}
{"reviewTitle":"Broken plastic piece movie around inside remote.","reviewDescription":"Product came broken. If you move \/ shake the product it sounds like a plastic part broke off inside. It’s annoying every time you move the remote. If you could unscrew the remote to free it then it would be ok. Unfortunately it is a sealed unit.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620950400000}
{"reviewTitle":"Left button stopped working in 2 weeks","reviewDescription":"The left button stopped working after 2 weeks. Cheap but you get what you pay.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1655856000000}
{"reviewTitle":"Useless","reviewDescription":"Came with no directions nothing just a remote in the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703289600000}
{"reviewTitle":"No instructions on pairing remote.","reviewDescription":"Can’t get the Samsung remote on my Samsung TV","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"This is the worst remote","reviewDescription":"This is the worst remote I ever used. Nothing works. It worked Ok for few months then all the buttons not working","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"does not work","reviewDescription":"Did not work with my Samsung tv, did not work on the Samsung tvs at Best Buy.  Rip-off","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698883200000}
{"reviewTitle":"Did not last","reviewDescription":"Ordered this in May 2021, it's now Dec. 2021 and the main button on it, the middle selection button, is already failing and requires very hard pressing to register on the TV.The remote does function in every way to the original TV remote, it just didn't last very long and now we have to purchase another one  :(Update 12\/5\/22:  Changed from 3 star to 1 star because the last remote we ordered in August is already failing.  The buttons that we press the most started going out a month ago and make it difficult to do anything on the TV.  They're just total junk and unless you plan on ordering a new one every few months, just avoid this garbage product.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1639353600000}
{"reviewTitle":"Not good item","reviewDescription":"I could not remove the back to put batteries in. It got broke trying to remove the back","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Wish it would have worked.","reviewDescription":"I had hope when I received this remote that it would work well, but unfortunately that hope turned into hate. You have to press as hard as you can on the buttons in order to get them to work. Yes, it does eventually cause pain in your fingers having to press so hard. I even tried 2 different sets of new batteries. So, yes the remote does work but plan on finger pain in order to use it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1677369600000}
{"reviewTitle":"Exact match but doesn't work","reviewDescription":"This was an exact match of the remote I had, but it didn't work at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701475200000}
{"reviewTitle":"DOA","reviewDescription":"I didn't get a chance to use the product for a couple weeks and when I tried to use it, it was DOA. Tried multiple sets of batteries with no luck and of course missed the return window by 1 day.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Quit working after a month","reviewDescription":"It stopped working already and we’ve only had it just over a month.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697846400000}
{"reviewTitle":"Not as good as the oringal that came with the TV","reviewDescription":"Did not have all the features, as the clicker came with the TV","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1635206400000}
{"reviewTitle":"Stopped working","reviewDescription":"Worked great for 6 months and now the buttons don’t work any more.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633219200000}
{"reviewTitle":"Couldn't get it to work","reviewDescription":"I could not get the remote to work even after several online tutorials","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633132800000}
{"reviewTitle":"Cheaply made","reviewDescription":"Placed batteries in and the clip broke to the back..they are very light weight. Not what i was expecting.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Not mad, just disappointed","reviewDescription":"When it worked, it was fine…..when it worked. It has completely stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1632182400000}
{"reviewTitle":"Cheap quality..Buttons are not good.","reviewDescription":"The buttons\/keys are not good for this remote. They are kind of very cheap. Whenever I press a button it goes into the button hole.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595721600000}
{"reviewTitle":"Keys don’t work","reviewDescription":"I’ve had it six months and the volume key won’t work. Buying a new one from elsewhere.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625616000000}
{"reviewTitle":"It half the time want work.","reviewDescription":"It half the time don't work the volume does not work  ,the back keeps coming off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1625616000000}
{"reviewTitle":"Don’t do it","reviewDescription":"Remote works, however buttons keep popping off and everything is loose so when you press a button it feels like it’s going to fall apart","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1595116800000}
{"reviewTitle":"Worked fine but died after 4 months","reviewDescription":"Worked great for 4 months then stopped working.  I tried new batteries and watched youtube videos of possible fixes but they didn't work either.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1612828800000}
{"reviewTitle":"Perfect replacement remote.  Lightweight, no set-up required, compatible with my television.","reviewDescription":"Perfect replacement remote.  Lightweight, no set-up required, compatible with my television.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Listo y facil de usar","reviewDescription":"Lo facil","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680220800000}
{"reviewTitle":"Simple and functional.","reviewDescription":"When the TV remote arrived it was simple synchronize it to the TV. It has most functionality of the original remote except it is not lit and is missing some functions that were handy on the original.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1667952000000}
{"reviewTitle":"Keys r just like what I replaced it for.","reviewDescription":"Plastic body could be a little nicerTo open for batteries was slightly difficult.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678406400000}
{"reviewTitle":"Easy to use, once programed","reviewDescription":"Fast to program","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"Does the trick","reviewDescription":"Looks exactly as expected and works perfectly.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Ready for use no pairing.","reviewDescription":"Some of the buttons are not the same shape as original","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"I don't have to get out of bed to change channels","reviewDescription":"Bedroom  TV is hard to reach. Really enjoy not having to get up to change channels. Very easy to use.  It would be nice if it were a bright color instead of black.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1665878400000}
{"reviewTitle":"It works","reviewDescription":"that's it... It works.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Terrific!","reviewDescription":"Exactly what I needed!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711929600000}
{"reviewTitle":"exactly what I needed","reviewDescription":"Very happy with purchase","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Remote","reviewDescription":"Perfect for my Ssmart 17\"  Samsung TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Great","reviewDescription":"Just like the original one that I had misplaced","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"No Setup Needed!","reviewDescription":"Put the batteries in, pointed it at the tv and worked immediately as if it were the original! Couldn’t be happier","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Perfect","reviewDescription":"I was so stressed when my remote broke. I don’t even know how the buttons on my tv work, coming from someone who remembers not having remotes at all. I ordered this, it was here very quickly, and was super easy to use!No installation necessary. It turned my tv on the first try after batteries were installed. Looks and feels exactly like the old one from the manufacturer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Remote","reviewDescription":"It works well!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Works with Samsung tv.","reviewDescription":"Easy setup and great response. Even does sleep delay.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710892800000}
{"reviewTitle":"Perfect match","reviewDescription":"The remote worked right away without any issues. I was very pleased.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"The perfect replacement!","reviewDescription":"This remote is just what I needed!  I purchased a new Samsung Crystal UHD TV model CU7000 and it came with the worst remote ever. No number buttons or the typical option buttons etc., so I purchased this Samsung Universal remote to replace it.  It was perfect!  I kind of freaked out when I first received it because there were no instructions included.  But I had read a previous review on this remote that said it worked right out of the box, so I put in a couple batteries (not included) and gave it a try.  First I turned on my TV with the original remote. I expected some kind of \"new device\" notice or set-up screen to come up but there wasn't any, so I decided to just try the buttons on the new one. I adjusted the volume, changed the channel, used the previous button etc.  They all worked!  Even the Guide button brought up the program guide!  I don't connect my smart TV to the internet.  I use an HD antenna, and I didn't even need to reset the Source.  It detected all the settings on my new TV without me having to do anything except turn it on and go. In the attached picture, the original remote that came with my TV is on the left.  My new remote on the right.  This is the easiest remote to use, I am soooooo glad I got this new remote! I would definitely recommend it to anyone who has the 'so frustrating' remote that comes with a new Samsung TV.","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1700870400000}
{"reviewTitle":"Good price and works just like original.","reviewDescription":"Great replacement remote after my dog chewed ours apart.  Would never know it was not the original.  Easy to use and good price to replace","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Inexpensive and works great. More bang for the buck, than buying a new TV.","reviewDescription":"Works as it should for an older flat screen tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"Funciona perfecto","reviewDescription":"Excelente producto. Funciona muy bien no importa la dirección en la que apunte, recibe la instrucción en TV.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Working wo any programming","reviewDescription":"No batteries. Uses 2 AAA.Added batteries and it works.Three minutes later it became a temporary puppy chew toy. Bottom is now the vented model.Still working.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Remote","reviewDescription":"Barely used the original remote and when I needed to, batteries rotted and ruined original remote! Found this and it worked perfectly!!!!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Works well","reviewDescription":"Didn’t have to program it onto my Samsung TV, it was easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707782400000}
{"reviewTitle":"Remote control","reviewDescription":"Remote control  perfectly matched to the TV","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707868800000}
{"reviewTitle":"Replacement Controller","reviewDescription":"It works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Works as Expected","reviewDescription":"I purchased this remote to replace the original remote control that came with the Samsung TV. It is exactly like the original remote. Works as expected. Was surprised no instructions came with but after quickly reading thru other reviews that mentioned the same issue, we were able to connect to the TV without any issues. Simply insert batteries and point at the TV. Helps if you point it toward the infrared receiver on the TV. Mine happens to be located bottom right of TV where there is the (hidden) on\/off switch.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1702166400000}
{"reviewTitle":"Perfect!","reviewDescription":"It did exactly what it was supposed to do. I put in 2 aaa batteries and my tv turned on! No programming needed! Couldn’t have been easier!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1706659200000}
{"reviewTitle":"Add coffee ☕","reviewDescription":"Weak and some had more cream and no coffee the flavor was all cream on coffee ☕","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1669852800000}
{"reviewTitle":"More Buttons Than I Need","reviewDescription":"Everything works as advertised. I don't much care for the layout, but there's a button for every function on my Samsung and the transport controls are helpful with some of the more stubborn\/funky apps. Good value, overall.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1659830400000}
{"reviewTitle":"Much easier to use than the remote that came with the tv","reviewDescription":"This remote control is much easier to use than the so-called Smart Remote that came with the tv. I don't use the Smart Remote any more.4 stars instead of 5 for the following reason: At first, the remote control worked intermittently. The fix was to bend a spring in the battery compartment to make reliable electrical contact. After this simple fix, the remote control works very well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1633996800000}
{"reviewTitle":"Good Samsung Remote Replacement","reviewDescription":"The batteries leaked in the original remote.  This Samsung television remote is a great replacement.  The remote worked directly out of the package with no setup required.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660435200000}
{"reviewTitle":"Remote","reviewDescription":"Not nothing near the original you can feel and see the cheap material but hey I looked here for a cheaper deal and plus it does the job done for now.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1653523200000}
{"reviewTitle":"Super easy to use\/setup. No fuss","reviewDescription":"Super easy setup for Samsung tv. Insert batteries and like magic it works without all those extra steps for syncing remote. Great buy","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1662422400000}
{"reviewTitle":"Its s good remote for general use","reviewDescription":"It’s a simple  remote","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1670284800000}
{"reviewTitle":"It works!","reviewDescription":"Comes with no instructions, but there was no need to program.  Just put the batteries in the remote and turn the TV on. It works!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1658880000000}
{"reviewTitle":"Not that easy to use","reviewDescription":"This remote is good but only problem is how the actual branded remote wherever u face it’s infrared connect to your tv and work but this doesn’t work in that wayYou have to face to the tv receiver light then it works and I hate thatBut still in this price not bad at least better then nothing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1628899200000}
{"reviewTitle":"Great replacement. Fast delivery","reviewDescription":"I lost my remote during a move. This replacement was delivered quickly and I could watch my favorite shows.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1660003200000}
{"reviewTitle":"Not true that the remotes work on all smart samsung TV's","reviewDescription":"We have three samsung smart TV's and the purchased remotes only partially operate them. The number keys on the remotes have no effect.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1604880000000}
{"reviewTitle":"Good value, a little hard to use.","reviewDescription":"I don’t like that I have to push hard the buttons to operate it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613174400000}
{"reviewTitle":"Not sure","reviewDescription":"Works good but the buttons pull out so not really good","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1616025600000}
{"reviewTitle":"Cheap material.","reviewDescription":"everything works, but it's really cheap material. bad fake.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1618531200000}
{"reviewTitle":"Poor quality and doesn't work like original.","reviewDescription":"Poor quality.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625702400000}
{"reviewTitle":"Nice","reviewDescription":"Nice","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1625270400000}
{"reviewTitle":"Cheap","reviewDescription":"Okay product","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1622160000000}
{"reviewTitle":"Too early to tell","reviewDescription":"at this time it works as expected from a remote control","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1592352000000}
{"reviewTitle":"Remote","reviewDescription":"Buttons stop working; very hard to press","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1595030400000}
{"reviewTitle":"Works well just have to press a few times","reviewDescription":"Hard to press buttons","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1611964800000}
{"reviewTitle":"Stopped Working","reviewDescription":"Although it worked great for the first few months, it has now stopped working. It will not let you change the channel unless you're extremely close. We've changed the batteries, still no luck. It was a cheap remote but I wish I wish I would have gotten more than a few months of use out of it. I will not be buying again and next time I'll buy a more expensive one that will last longer.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1634083200000}
{"reviewTitle":"Feels like a toy.","reviewDescription":"It has no weight to it  compared to the exact one that I replaced it with. Night and day, and the keys I really have to work at pressing them in firmly. Sometimes twice to get a connection.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1659571200000}
{"reviewTitle":"Okay remote.","reviewDescription":"It’s hard to switch to apps & control the volume.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1672358400000}
{"reviewTitle":"Shipped a used one","reviewDescription":"I was shipped a used one with rusted batteries installed.  Replaced batteries and works OK.  Thinking about returning and exchanging for a new one.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1662508800000}
{"reviewTitle":"No instructions","reviewDescription":"The remote is not specific to any television, and there were no instructions on how to program it for Samsung TV's.  Misleading. Made in China","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1666915200000}
{"reviewTitle":"It is What it is","reviewDescription":"It’s a remote that looks just like the old Samsung remote, except for the light-up feature the OEM had. It came with no instructions, but thankfully didn’t need programming. I still don’t know what the A, B, C, and D buttons are for, but it works.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650931200000}
{"reviewTitle":"It doesn’t work all the time. You have to push button multiple times to get it to work.","reviewDescription":"Doesn’t work. You need to push button multiple times to get it to work. Very troublesome. I wouldn’t buy it again. I don’t recommend it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654732800000}
{"reviewTitle":"Remote had a 1-2 second delay","reviewDescription":"This remote looks identical to the remote our tv came with. Please note there is a delay if you are using a smart TV. If you are trying to type something with it there is like a 1-2 second delay. We ended up buying another one but this one will do the work if you only want it to change channels.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1622851200000}
{"reviewTitle":"Not easy to use when lights are off in the room","reviewDescription":"Remote is hard to use when room is dark. It has not lights on it but I knew about it. Not the Seller's fault. There are some other Remotes easier to use out there","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1650931200000}
{"reviewTitle":"Buy App Instead","reviewDescription":"I really thought it was going to work well. I should have just paid for the app on my phone instead smh. You have to push the buttons hard and sometimes it doesn’t even register or it registers super late. Definitely regret buying. I give it 3 stars cuz it does work, just have to have patience.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1623369600000}
{"reviewTitle":"Exactly for my tv","reviewDescription":"I didn't have to program it. Just add batteries. Love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Size of remote","reviewDescription":"Works great but  buttons are small for elderly eyes & fingertips","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Easy to use","reviewDescription":"Had to replace my old remote, so tried this. Works great!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"The remote control works great","reviewDescription":"I just put the batteries and it worked like a pro","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687996800000}
{"reviewTitle":"Good product","reviewDescription":"Very","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Remote","reviewDescription":"It works original found. There is a difference between the 2 types. Original has a more rapid response time the extras seem as though they need new batteries. But they great extras.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681516800000}
{"reviewTitle":"Easy to use","reviewDescription":"It works right away I didn't have set up or program anything. I was glad cause I have older Samsung TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680739200000}
{"reviewTitle":"Good vendor, product has changed","reviewDescription":"This was a replacement for my original samsung remote.  The vendor did fine, the remote appears to be a genuine samsung replacement, but the manufacturer changed some buttons, eliminating the dedicated \"sleep\" button.  I need to find that one in the dark, and the new arrangement requires several layers of choices.  Not happy about that.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1673222400000}
{"reviewTitle":"Works great so far","reviewDescription":"Works great so far. Comes preprogrammed so take out of package and ready to go.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683763200000}
{"reviewTitle":"Just Fair","reviewDescription":"Having lot of buttons can get confused","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687132800000}
{"reviewTitle":"Great for replacement","reviewDescription":"Works well easy to program","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Works great","reviewDescription":"Worked right away! Easy TV replacement remote!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Remote control for tv","reviewDescription":"Liked","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710720000000}
{"reviewTitle":"Worked as Expected","reviewDescription":"Very easy to use and navigate.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Works perfect!!","reviewDescription":"This remote worked perfect and synced up and didn’t have any issuesLooks like the original","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Remote","reviewDescription":"Use it for a tv.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"Newer model works much better than oem.","reviewDescription":"Samsung TV came with BN59-01315J remote and found that I had to mash the buttons really hard to make them work and often repeatedly. I barely have to touch the buttons on this new remote for it to work properly. Price was excellent too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Works like the original","reviewDescription":"It works just fine!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Does the job, plus more than I expected…","reviewDescription":"We replaced all our older bedroom and major room TVs equipped with Fire Sticks with Amazon Fire Smart TVs. One of the old TVs is a 32 inch Samsung (at least 12 years old) that was still in decent condition but no longer had the original remote. I decided to put this TV in our bathroom lavatory area and use one of our old fire sticks with it. I ordered this remote and it was programmed to work with my TV as soon as I put batteries in it…even better was that the remote also automatically controlled the old Fire Stick, which I was NOT expecting. Now I only have to use one remote for this TV. Not a bad deal at all!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"Great replacement","reviewDescription":"It works. No problems. It feel lighter than the remote I had.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"meh","reviewDescription":"It looks and feels like a 3D printed remote. It’s super light weight, has a funky texture and sometimes the buttons stick. It’s not the beat but it does the job and that’s all I can ask for.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614729600000}
{"reviewTitle":"Looks identical! But pass","reviewDescription":"Was super stoked to find an identical remote. But it did not work. Put the batteries in, tried it. Nope. But placed it down and went about my day. Came back to see the remote still flashing. Defective.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1613520000000}
{"reviewTitle":"Receipt not the best","reviewDescription":"That band with makes it hard to change Chanel’s and I’m only five feet away from my tv...Where as the original controller changes the Chanel no matter where I am standing.This piece is not original","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614556800000}
{"reviewTitle":"Only lasted two months","reviewDescription":"When we first received it, it work fairly good. Now, the buttons do not work well at all.  This is only two months old, need to find a better on.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1605312000000}
{"reviewTitle":"Undesired effects","reviewDescription":"When I first started to use the remote control; it worked great. It's been about two months and already I'm starting to have problems. It's not connecting with the infrared on the tv","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1616457600000}
{"reviewTitle":"Button pops out.","reviewDescription":"After sometime 2weeks button pops out","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653350400000}
{"reviewTitle":"not very happy","reviewDescription":"it was ok it had rattle in the remote whwn I received it and the some of button s seem to be broke along with the back that holds the batteries","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614988800000}
{"reviewTitle":"Lasted a month at best","reviewDescription":"Cheap quality!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658620800000}
{"reviewTitle":"Not as I had hoped for.","reviewDescription":"This was supposed to be smart tv ready, but it has very limited compatibility. I will buy a different brand that is more like the one that came with the Tv.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1610496000000}
{"reviewTitle":"Only 4 month lifespan","reviewDescription":"Bought in September...just stopped working in January.  No issues for the 4 months it worked; but just quit working one day (it wasn’t the batteries like I hoped)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1611273600000}
{"reviewTitle":"Idk","reviewDescription":"It comes on but it's not programming to the tv. I don't know if it's me not knowing how or what but it didn't come with instructions","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1638662400000}
{"reviewTitle":"the buttons are not designed proper.","reviewDescription":"the buttons are not designed proper. its painful to press the 4 navgation buttons and the ok button as its designed badly. they are lower than other buttons and as u press them, ur thumb pains.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1628985600000}
{"reviewTitle":"Very light cheap plastic","reviewDescription":"I thought I ordered the same remote that I ordered earlier in the year. Everything looks the same except this remote is not the same quality of the first remote I ordered for the same price. It's very light cheap plastic. Not going to last long at all.  I did recieve the remote very fast though.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1607558400000}
{"reviewTitle":"Damaged","reviewDescription":"I received the controller with scratches on the back and it was partly opened on the side. The bag it came in was ripped. Not sure if it was the manufacturers fault or the amazon delivery. It didn’t work at all, even bought new batteries for it.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1593993600000}
{"reviewTitle":"Not so good","reviewDescription":"Pros: you don’t have to program it. Just buy a battery and place it.Cons: you have to press the keys very hard. If you have to decrease volume from say 70 to 10, it takes a long time as the response time is also too low.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1591574400000}
{"reviewTitle":"Third replacement","reviewDescription":"The button that advance right gets stuck sometimes and doesn't work. This is the 3rd time I've had to replace the remote. Price is great value.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1633392000000}
{"reviewTitle":"Worked short time","reviewDescription":"This product worked for only 4 months and it's already broke. Some of the bottoms don't work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1644883200000}
{"reviewTitle":"Won't work to control my Samsung TV , Roku, sound system","reviewDescription":"Okay to turn tv off and on","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661126400000}
{"reviewTitle":"No Manual","reviewDescription":"Received, No problem. but no manual or instructions on how to  program it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1650067200000}
{"reviewTitle":"Stopped working after 9 mos","reviewDescription":"Cheap quality but Sonia the price. Stopped working after 9 mos.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658188800000}
{"reviewTitle":"It works... Barely","reviewDescription":"The best thing i can say is that it works. The buttons are wonky and 2 came off.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686960000000}
{"reviewTitle":"No directions","reviewDescription":"It had no directions in how toPair it up..","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"Stopped working after one month...","reviewDescription":"Easy to use but stopped working after one month.Disappointing...","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Not long lasting","reviewDescription":"Worked great when we first received it but it didn’t even last 2 months. We were watching tv and heard a loud popping noise. Couldn’t figure out where it came from. Eventually realized what it was when the remote wouldn’t work.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Can’t use number buttons for channels.","reviewDescription":"I thought I would be able to use the channel buttons to change the channels but it doesn’t work.  I can only use the < > buttons.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679184000000}
{"reviewTitle":"Es duro en los botones","reviewDescription":"Es mejor comprar otro que funciones bien","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688083200000}
{"reviewTitle":"It came in a plastic bag, which it’s fine, but no instructions just the remote.","reviewDescription":"No instructions on how to set up for my tv.It’s universal but needs to be set up with a specific code, which did not came with it.So for now it’s useless.I’ll have to go to YouTube and hopefully find a way to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672704000000}
{"reviewTitle":"Weird packaging","reviewDescription":"No manual on how to program and no qr code to send you to a manual.  I guess the expectation is for the customer to guess? Frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"Lousy Remote","reviewDescription":"It works, but barely. The buttons are terrible quality and feel, you have to press the buttons repeatedly to register a single push. Very frustrating to use and disappointing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677888000000}
{"reviewTitle":"Universal Remote Control for Samsung TV Replacement for LCD LED HDTV 3D Smart Samsung TV","reviewDescription":"Had to Return wouldnt work with my Samsung TV. Can't write a review on something that Never worked wouldn't reccomend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678492800000}
{"reviewTitle":"Didn't work for my Samsung","reviewDescription":"They stated that it works for all Samsungs  without even being programed but it didn't work for mine","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Cheap","reviewDescription":"Cheap don’t waste your money","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"Do not buy. So disappointed!","reviewDescription":"No directions or anything in the box...How are we to program this thing? And it is cheaply made.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Samsung TV and Nothing Else!","reviewDescription":"So not only was I disappointed in the lack of packaging I was disappointed with the remote itself. It is not a Universal remote! It does work for the Samsung TV but that is it and nothing else.  Which makes me wonder what all the buttons are for because it will not operate anything else.  No box, no instructions...not even a bubble wrap bag! Good news is it worked immediately after putting batteries in.  Bad news is as a universal remote I wanted to pair with my surround sound and could not. Completely useless to us.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1643155200000}
{"reviewTitle":"Does not function.","reviewDescription":"The remote arrived and new batteries were inserted and the remote did not respond. I do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Would not sync","reviewDescription":"Just what the title says. Tried multiple sets of batteries and tried multiple methods of syncing with tv. None worked. No instructions came with product and no website for assistance was provided. I would suggest selecting a nother remote.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1684972800000}
{"reviewTitle":"Remote Buttons Broke within a Month","reviewDescription":"The arrow pad and selection buttons on the remote stopped working within a month. The buttons stopped sending signal to the TV and only work when banged on a surface. Not ideal. You definitely get what you pay for with the low price.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680480000000}
{"reviewTitle":"No Instructions Provided","reviewDescription":"Be prepared for a Google search or 2 to try to find the instructions to install to your TV. If I had known, I would be more inclined not to buy it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1685491200000}
{"reviewTitle":"Hardly works","reviewDescription":"I have to click the button 100 times and it’ll only work 20% of the time I do not recommend this","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"Don’t bother","reviewDescription":"I order a universal remote. Hooked right up with my tv. Only the up button sometimes works and sometimes acts as the select button. So I ordered a replacement. Same issue.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1687651200000}
{"reviewTitle":"Can’t connect","reviewDescription":"Does not come with instructions","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704672000000}
{"reviewTitle":"Really?","reviewDescription":"Product came in a ziplock bag with no packaging or instructions. I have no idea how to program it. I guess I can google, but why should I have to do that? At least print up some instruction cards and put it in the ziplock bag.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1692921600000}
{"reviewTitle":"The remote is slow!","reviewDescription":"When your using this remote you can tell the difference between this remote and the one the tv came with! It’s very slow! Sometimes you have to push the buttons a few times until it works.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693872000000}
{"reviewTitle":"Cheap","reviewDescription":"Power buttons popped off both remotes we bought after 2 months","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"Doesn't last long :(","reviewDescription":"Bought this to replace a TV remote for the family room.  It worked for less then a month and then all of a sudden wouldn't work.  Tried testing it with new batteries and still nothing.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Kind of works","reviewDescription":"Clear quality difference between this and the samsung remotes.  Buttons do not work well and sometimes not at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692921600000}
{"reviewTitle":"Not That Good","reviewDescription":"Did not like that the backlight doesn’t light up the complete device and some of the features seem not to work properly or have a function and awkward to Use","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"se queda pegado","reviewDescription":"cada que mi peque quiere un nuevo canal debo ir ayudarla porque no funciona, no importa si precio a suave o pone presión tarda bastante para cambiar o simplemente no cambia de canal. es una lata tener que ir asta el ups para regresarlo.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684886400000}
{"reviewTitle":"Died shortly after return window closed.  Perfect timing..","reviewDescription":"Samsung replacement remote worked for two months. Waste of money.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Very disappointing","reviewDescription":"Useless without some written directions. Besides it did well on turning the TV on and off there was no help in getting to and from TV to movies and back.  People are not born knowing how to operate these devices.Ex.  What does A  B  C  D  buttons mean?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678924800000}
{"reviewTitle":"Bought one for each rv","reviewDescription":"We have several Samsung tvs and bought one for our family room tv. .. works so well I bought one for each Samsung tv we own","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708300800000}
{"reviewTitle":"Wonderful product","reviewDescription":"Work really good and didn't need to program it.. l like it","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Sansung remote control","reviewDescription":"I use this for my Sansung TV and works great and came on time.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Price is great","reviewDescription":"Didn’t have to fiddle with it. It works great!!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Dependable","reviewDescription":"Remotes are very important in today’s world.  We want  user friendly, dependable remotes to work without effort or problems.  This is the one.  Put batteries in it and it’s ready!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Easy very easy to use","reviewDescription":"The best quality easy, nothing to set up just put the batteries in place and voila! Ready to use.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"Works as it should","reviewDescription":"Purchased this remote for a Samsung TV that didn’t have one, definitely works as it should.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Outstanding product that works like the original","reviewDescription":"This remote works also perfectly for the Samsung. It's simple and easy to use.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708387200000}
{"reviewTitle":"Awesome remote","reviewDescription":"I lost mine so I bought this replacement. It's great. Worked right away and works in every way","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"This did the trick","reviewDescription":"I was looking for a way to save some money and decided to switch to antenna tv. Unfortunately, I couldn't get it to set up correctly without my original Samsung TV Remote, which of course I couldn't find. I had a universal remote, but it wouldn't set up correctly using it.  This was the best 10 dollars I've spent this year. This remote works just like the original Samsung remote I had misplaced years ago. I didn't even have to set it up. I literally put in the batteries and it automatically connected to my TV, then setting up the antenna was done in a flash. I am impressed. I have saved quite a bit of money by switching from cable network and using my antenna. I get LOTS (and I mean LOTS) of channels (even local stations) by using it. This remote helped me get there. Works like a charm!! I highly recommend it.","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"POS junk","reviewDescription":"Dec 29, 2021. Dropping down to one star. I changed the batteries which helped it work for another month and a half. Today, it stopped working altogether. I thought, \"Okay, people commented that it drains batteries, I'll put in new ones.\" It literally drained one of the batteries. Battery acid all up inside of it. Throwing this trash out. What a waste of money.Original review, posted Nov 2, 2021: (Two Stars) The remote was delivered Oct 5, 2021. Today is Nov 2, 2021. I noticed yesterday that the remote wasn't working properly. I've had to smack the remote a few times just for one press to register, then it stops working again. Looks like I'll be buying another replacement.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1635897600000}
{"reviewTitle":"Only works sometimes","reviewDescription":"This was an”Amazon choice” product. Thinking I could trust that. But sadly not. I’m not sure what is wrong with this remote, but it works only sometimes. It rattles and you have have to shake it,  hoping it works. I won’t be buying a remote control online again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1688601600000}
{"reviewTitle":"Don't waste your money!","reviewDescription":"This is the 2nd remote that went  out within 30 days.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Save Your $$","reviewDescription":"Beyond frustrating. This works every 19th time you press a button when remote is located in the exact geographic location and angle. No bueno.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Sucks","reviewDescription":"There’s like a three second delay and now my TV also has problems. I think the laser or whatever doesn’t communicate correctly","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694649600000}
{"reviewTitle":"Not a universal remote","reviewDescription":"The remote was not a universal remote like advertised","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Quit working after two months","reviewDescription":"It worked just like it was supposed to for two months. Very light use.  Just turn TV off and on and rarely used the volume control. Then one day, nothing. Replaced the batteries but still nothing. Tried contacting the seller but nothing. DON’T WASTE YOUR MONEY!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1685404800000}
{"reviewTitle":"Irritated","reviewDescription":"This remote worked great for a minute. It worked with my samsung smart tv just fine. However it's not preteen and teenager proof. Within a month we were easily missing 3 buttons. Of course nobody did it and nobody knows who's did it. I just wish it would've been better quality. I need a new remote but I won't buy this one again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682899200000}
{"reviewTitle":"Terrible","reviewDescription":"There about a 100 useless buttons on here for a smart Tv I don’t have cable so no use for all these numbers and buttons. Every time I try to use it I wind up hitting the wrong button because they are all crammed together. Going to order a Samsung replacement remote instead it literally has 5 buttons","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"Did not last","reviewDescription":"Stopped working  after aweek","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1697932800000}
{"reviewTitle":"Buttons","reviewDescription":"Buttons.Have to press very firmly.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"works ok","reviewDescription":"it works but buttons are sticky so at times you must push more than once.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Don't turn your backwith a toddler in the room.","reviewDescription":"This remote is great. There is nothing that needs to be done to connect it to our Samsung TV, except put in batteries. I have purchased 4 of them. Why, you ask, have I purchased 4 of them. Because my demonic 2 year old keeps chewing the power button off. We have tried various ways to re-attach it, but it never lasts.  Most recently, we had the remote less than 24 hours. I got up to answer the door, and BAM! Power button gone! Now I know what you're thinking, \"Maybe he's teethin.g\" Nope! He has all his teeth in. He is just an evil little jerk.We have also kept the old remotes for him to gnaw on, but he doesn't want those. He is after the power button.So I removed 1 star for how easily the power button gets chewed off by a 2 year old. Now I am off to buy another one.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1654387200000}
{"reviewTitle":"It's a remote.","reviewDescription":"I don't have an issue with the remote. It works a lot better than the remote that came with my TV.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Maybe a Good Value","reviewDescription":"The remote was easy to set up and works well.  It seems to be made of cheap materials and I wonder if it will hold up.  The original remote (without batteries) weight twice as much as this one (without batteries).  I had no way of knowing that ahead of time.  The price was great though so I am happy with my purchase at this point!","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Control","reviewDescription":"Bueno","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"What I Was Looking For","reviewDescription":"New remotes for Samsung TVs don’t have an input\/source button so I got this. It was ready to use as soon as I put the batteries in. No programming, no set up. It’s a little bulky and the buttons are a bit stiff. Other than that, it’s great.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Almost Perfect","reviewDescription":"This remote was purchased to replace the original remote that came with the new TV. That original was dismal in design and usage, and non-intuitive. This replacement remote does what the original would not - give me direct access to Settings menus and Input\/Sources without having to navigate the multiple button presses of the so-called \"SmartHub\". And with a classic design that gives a degree of familiarity. The only negatives are that it is not backlit, and a bit on the tiny side. A good value purchase nonetheless.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1677024000000}
{"reviewTitle":"Easy set up","reviewDescription":"easy to use and worked right away no muss no fuss.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"It's a knockoff","reviewDescription":"Bought this to replace the Samsung remote that came with our TV. I didn't notice the brand (since it says Samsung in the description). It is 100% a knockoff. The quality is lower - it's lighter and the material isn't as nice. BUT it functions as a remote just fine and does the job","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1679356800000}
{"reviewTitle":"Waste of time","reviewDescription":"It does not work!!! The device does not even turn on I’ve tried 4 different sets of batteries…the item is defective.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"Buttons stop working after about 11 months.","reviewDescription":"We don't use this TV very much but the buttons stop working after 11 months.China quality, china durability.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707523200000}
{"reviewTitle":"Horrible","reviewDescription":"Universal remote comes with no codes for TV or cable box and you can’t get them online. Totally useless","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708905600000}
{"reviewTitle":"Cheap","reviewDescription":"My Samsung remote went out. I thought I'd save money buy purchasing this product. I did save money, but it is made so cheaply the buttons will glitch everytime and there was a delay that was absolutely frustrating.  It would pay off better to spend the extra money and purchase a name brand, in my opinion.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Used, doesn't work and no instructions","reviewDescription":"Used, doesn't work and no instructions","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709596800000}
{"reviewTitle":"No instructions on connecting to tv","reviewDescription":"The remote is useless. It comes with no directions on how to set it to your t v. No indicator light to let you know that it even works. It's junk","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"The remote stopped working after one month.","reviewDescription":"I bought this remote a month ago for my husband. After a month the remote stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708387200000}
{"reviewTitle":"No instruction sheet you pay cheaper isn’t always better","reviewDescription":"This isn’t universal!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"no directions","reviewDescription":"this remote looks good and quality is most likely good but with out the directions on how to set it up it's useless .shipped in a bag.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Doesn’t work","reviewDescription":"Sellers like this sell things so cheaply because they feel like it’s not worth your time returning it. It flat out doesn’t work. It’s sometimes turns on and off the TV but it chooses and picks when it does want to do that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1701993600000}
{"reviewTitle":"Decepción","reviewDescription":"Este control remoto se dañó luego de ocho días de comprarlo y usarlo.  Tuve que comprar otro, pero esta vez compré uno original.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677888000000}
{"reviewTitle":"Remote straight off the boat.","reviewDescription":"It gived new meaning to the phrase \" el cheapo\".","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683417600000}
{"reviewTitle":"Disappointed","reviewDescription":"The remote broke","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"This remote is dead after 2 years. Wasn't good remote and definitely not recommended.","reviewDescription":"Would buy a Samsung one next time.  Won't get this one again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678752000000}
{"reviewTitle":"Good remote but not working after 1 yr and 4 months","reviewDescription":"Great price and exactly what I ordered but disappointed that after such a short time the on\/off button no longer works.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674777600000}
{"reviewTitle":"Cheep But works","reviewDescription":"Incredibly light comparado to the original . Ane small metal pice few out as soon as I opened the battery  Chamber but it's working. Let's see for how long.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662681600000}
{"reviewTitle":"No instructions","reviewDescription":"Nice remote but no instructions came with it .","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1678147200000}
{"reviewTitle":"Mostly Works but Disappointing","reviewDescription":"I like that there are lots of buttons on the remote control unlike the control that now ships with Samsungs. However, the buttons are very mushy and the cursor keys especially don’t work great. I have a Roku connected. My Samsung remote will also control the Roku. This remote will not. It’s probably a good backup and useful if you must have number keys, but I’ve gone back to the remote that came with the tv.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1598745600000}
{"reviewTitle":"Power button stopped working","reviewDescription":"The remote was fine for a year, but then the power button stopped working. Unfortunately that was why I needed a TV remote the most.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667260800000}
{"reviewTitle":"Waste of money","reviewDescription":"Buttons stick very badly. Not good at all.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679961600000}
