{"reviewTitle":"Great right outta the box.","reviewDescription":"I, literally, just recieved this printer 2 days ago so I cannot, honestly, give a complete review. But, I will say this. I have owned several printers in my 70+ years and have found HP to be among the best both in quality of manufacture, and ease of setup. This printer, which i use wirelessly in my house, worked right outta the box with the help of the HP Smart app. Couldn't be happier.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Working good","reviewDescription":"Finally had to replace the old printer, also HP, and here we are. I am still working on learning everything about it so I can teach my 85 yr old parents….  So far I really like it. My next step for me is to learn how to connect my cell phone to print off of it. HP always comes through and so always loyal to HP.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very easy Setup","reviewDescription":"If I could set this up all on my own anyone can!  Nuff said, it's a printer.  A big plus, very lightweight!!  Perfect for small jobs, which is all I need.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Good prints","reviewDescription":"Great for small office","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723939200000}
{"reviewTitle":"Simple to use.","reviewDescription":"It was refurbished which came without a owner's manual. Was not able to establish Wi-Fi right away. Was having troubles getting my information considering wasn't able to print a copy of the internet. But through trial and error and a day and a half. I was able to install the ink figure out where the paper went and get it on line. Being in senior I don't do well without a manual.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"HP laser jet","reviewDescription":"This printer replaced the one I had. I purchased the same 4500 laser jet printer as I had because I had been so happy with the previous one.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"So Great","reviewDescription":"Perfection for small home office and students. 2 one in 6 years.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Recomendada!!","reviewDescription":"Me ha gustado la calidad, el empaque se ve totalmente nueva. Viene con sus instrucciones, la tinta, y cable.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Excelente producto","reviewDescription":"Facil y comodo se usar no dilate nada instalandola","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"El material","reviewDescription":"Me agrado mucho","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Good printer","reviewDescription":"Name brand printer. A bit difficult to install. Some pages didn’t print right. Tech support helped.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Great value and lots of functions","reviewDescription":"I’ve been pleasantly surprised with this printer so far. After my old reliable multifunction printer stopped working, I needed a new one and this seemed like an inexpensive option, even though it’s a factory-renewed unit.I was worried after reading some of the reviews on Amazon, but the setup wasn’t terribly difficult. The only problem I had there was with some of the questions that asked me to share more information than I was expecting with HP and deciding whether it made sense to sign up for their ink replenishment service (so far, I haven’t run out of ink). The print quality seems pretty decent, considering the price. The scanner and copier functions also seem to work well enough with a Windows laptop, though I was disappointed that the software didn’t seem to work with my Chromebook. It seems you need a Windows computer (or maybe a Mac). But the HP Smart app seems to work well on my Windows computers as well as an iPhone and an Android phone.It’s nice to have the wireless functionality, which my old printer didn’t have. The one difficulty I had during use was when my computer switched over to a different Wi-Fi network and couldn’t connect to the printer. But I figured out eventually what the problem was. It would be nice if the printer had Bluetooth connections available. There is a USB port that can be used with a USB cable and that may address some of the Wi-Fi issues some reviewers have commented on.All in all, it’s got plenty of features. I haven’t signed  up for the mobile fax service since I have nowhere to send a fax, but it’s nice to know that’s available for 2 years.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1644624000000}
{"reviewTitle":"Printer","reviewDescription":"Works well.  Had a bit of trouble figuring out how to connect to my home internet\/wifi but did get it connected.  I thought the instructions for doing that were confusing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"good working","reviewDescription":"ink read is drying HP 4152e","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Fred’s review","reviewDescription":"The printer is a good home printer. However, I was disappointed thatI saw marked on the box after receipt that this printer “was reconditioned by a professional team”. I thought I was buying a “new” device not a used one regardless of the reconditioning. I feel like i was duped","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Easy set up","reviewDescription":"Easy plug in and go set up. Skipped the whole HP insta ink set up.  Didn't set up to print via wifi, only needed to print from my pc. (direct connect cable was included) Certainly do not need HP to monitor how much I print. If I run low on ink, I'll just get more. Printed great right off the bat. Only been hooked up for a few days. Have not scanned yet, but do not forsee any issue.  Note: lid is a little heavier than my last printer. So be careful closing lid when copying or scanning.(Did not give any 5 stars, due to only having used it a few days so far)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1699747200000}
{"reviewTitle":"Solo tengo una pregunta","reviewDescription":"Yo compré la impresora estoy contenta con ella es práctica solo nos costó un poco la configuración con laptop y el cel pero después todo bien mi pregunta es sobre la garantía me dice que no abra el aparato y si necesito esta garantía por favor si me pueden contactar para resolver mi problema gracias","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"RECONDITONED NOT NEW WHATEVER AMAZON SAYS INTHIER ADS","reviewDescription":"Works well but the Amazon said \"NEW\" not reconditioned.  Would be nice to know.  HP warrantry does not apply","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Nice Printer, BUT....","reviewDescription":"Received printer, good condition.  Did not set up for a couple of weeks.  When I did , the printing did not function properly.  a Color print came thru with just a few dots of color on the sheet.  A B\/W copy came thru blank.  Tried several different sheets.  Took out each ink cartridge, and cleaned them and re-installed.  The color one functioned okay after this.  the black cartridge still did not perform.  Re-cleaned it and did the water soak suggestion as well.  Still no performance.  Ordered a new 67 black cartridge.  Arrived, I istalled and it printed.  SO  MY CONCLUSION IS THAT A DRIED UP 67 CARTRIDGE WAS SEALED AND SHIPPED WITH THE MACHINE.  I HAD MADE A COMMENT BACK TO AMAZON ON THE NOTICE OF ITEM HAVING BEEN DELIVERED AND WAS IT OKAY? .  BUT NEVER HEARD ANYTHING BACK.  I DO NOT FEEL I SHOULD HAVE HAD TO ORDER OR PAY FOR A \"NEW 67 BLACK CARTRIDGE\"  TO REPLACE WHAT WAS SHIPPED","isVerified":true,"ratingScore":4,"reviewReaction":"58 people found this helpful","country":"United States","date":1679097600000}
{"reviewTitle":"The printer does the job at an affordable price.","reviewDescription":"Dislike the paper does not stop when done printing and ends up on the floor.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Works fine when it decides to work at all, but double-sided copies are problematic","reviewDescription":"Overall it does what I want, but in the first day of use I discovered two issues.  The first one really ticked me off.  That is that the printer cartridges supplied with the printer straight out of the box only contain a bare minimal amount of ink and half way through a printing job the black cartridge ran out of ink.  I did about 30 pages and then a page or two of low ink print quality and then nothing.  The second issue that I did not realize while reading the product description is that if you have a double-sided page, it is cumbersome to print both sides as a double-sided copy.  You have to print one side first, then take that copy and reverse it properly in the paper feeded and then reverse the original in the copy feeder tray and then print it and hope that you get it all correct.  That takes awhile to figure out how to line every thing up properly.  Haven't used the fax, scan, wi-fi or blue tooth features yet.  I returned it.  The second one doesn't work any better.  I think that it is just not very compatable with a computer that still uses Windows 7.  I also don't like using smart phones","isVerified":true,"ratingScore":3,"reviewReaction":"18 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Too glitchy","reviewDescription":"9 months later I'm ready to use this thing as a boat anchor. Sometimes it does or doesn't use the document feeder to scan. Sometimes it does or doesn't put lines in my printed document. I use this for my home office and didn't get it to do too much heavy lifting, but it's still been disappointing. I guess for the price point this would be fine for your family's purposes (using the scanner glass for a page or two) or maybe printing concert ticket vouchers or something. It's been a nightmare to try to use consistently for work. And it constantly gives me \"ink low\" warnings even right after I change out the ink. I'll probably give it away to a college student or something.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Me equivoque  de impresora","reviewDescription":"Aunque cumple con su función, a veces se complica imprimir  lo deseado y comienza a imprimir  lo mismo una y otra vezQuizas sea pir mala operacion por que no soy muy diestro coneste tema. cometí un error al momento  de comprar, escoji la impresora equivocada, quería una que se pueda recargar la tinta.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Disappointed","reviewDescription":"I got this for my wife who is a teacher, here she is to tell you how she feels about this product: This printer is infuriating! I work hard and have only the evenings and early mornings to get papers ready for classes. I spend weekends fighting with this printer trying to print out copy sheets to then take to school to copy on their large printer. I will print out about 20-50 sheets of items that will need to be made into multiple copies for my classes. With no planning period, I have no time to waste. With this printer I have been wasting hours….not minutes, HOURS! I do not have time for a printer that will not wake up from its coma to print a single sheet of paper at 5:30 in the morning! Take this sucker back! I hate it. When it DOES print (few and far between moments) it is wonderful! But it will take us 1o-2 hours to get it to wake back up and work with our iPads! Maybe it is a PC only or Cell phone only printer. If so I missed that! I do not like buying electronics from the internet and this just helps to prove me right. 3 stars because when it does print, it does it well. I do not recommend to anyone who needs something done now.","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"READ IF YOU NEED HELP WITH SET UP","reviewDescription":"I was in a pickle and needed a printer FAST. During COVID, all of the printers have been limited supply so I felt I would take a chance on this one. First thing I noticed about this printer when I received it was there were NO instructions. You are instructed to download an app (HP Smart) and configure it all from there, however when I tried, the app wouldn't find any WiFi networks (when I knew there were plenty in my apartment building). THIS IS WHAT YOU NEED TO DO IF YOU HAVE ISSUES SETTING UP:1. Plug in the printer2. Place ink inside and paper in the feeder3. It will print a page (that I have attached in photos just in case) to help you set up4. Hold down the WiFi button AND the cancel button for 3 seconds until the power button flashes5. Move onto the app to continue configuring - it will \"find\" the printer and then allow you to connect to WiFiThey made this printer unnecessarily complicated to set up but once it is up, it works like a charm and you are even able to change the printer's email address. I tried to set this bad boy up on 4 different attempts and had to walk away 3x because it wouldn't connect to WiFi and I got frustrated. Happy with my purchase now, but I was about to throw it out the window for a second there... Anyways, overall, if you are tech-savvy, I would recommend this printer! I just suggest to the manufacturer that it COMES WITH the instruction sheet rather than making you print it prior to setting it up... that was odd.","isVerified":true,"ratingScore":3,"reviewReaction":"456 people found this helpful","country":"United States","date":1605657600000}
{"reviewTitle":"It prints, but lots of issues with it constantly.","reviewDescription":"It does what its supposed to do - but every time I need to actually print something.  I end up having to re-pair and re-add the device many times before it finally works.  Its a hassle.  But its also an incredibly inexpensive so you get what you pay for.  Ive probably spent a good 5 hours troubleshooting this thing through the 10 times i've used it to print something.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709337600000}
{"reviewTitle":"HP printer","reviewDescription":"It was very difficult to set up!  No instruction book accompanied the printer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Goes offline quite frequently","reviewDescription":"It seems like a reasonable good printer but my issue is that is goes offline quite frequently, like if I haven't used it in a day or so I have to go through the settings to get it working again which frankly speaking is quite annoying.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1709856000000}
{"reviewTitle":"It prints.","reviewDescription":"Had a little difficulty getting it connected wirelessly.  Once I got past that hurdle I learned several things.  It uses toner fast.  And I mean fast.  Had to replace both color and black within 1st week.  I bought it refurbished so maybe that was why because I'm still on the replacement cartridges after 2 and a half weeks. Some of my dislikes:  1) Does not print double sided.  2)  Cannot preview photos prior to printing so they're always off center, and there is always a white border of varying degrees even when selecting fill page.  Using my Samsung phone to print, perhaps that is the reason. 3)  Photo quality is very disappointing.  Select best quality and they don't come close to comparing to photos from CVS.  Maybe I chose poor quality photo paper, I'll purchase some more expensive paper and see if the quality improves.  On the bright side the fax and copy features were a breeze to set up and use. Also, I have not a single problem with a paper jam or any other mechanical issue.  For what I paid, $60,  I'm  satisfied and would buy it again.  It does what I need it to, but it sure would be nice if it printed good pictures as well as it performs other functions.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1628467200000}
{"reviewTitle":"Set up a headache but good printer","reviewDescription":"So much time...I purchased this because I’m attending classAnd just any personal papers if needed but I thought it be easy to set up but when I was setting it up it actually has no directions to the box so you have to use the buttons on the printer and it doesn’t tell you what buttons to push you have to hold the button for three seconds so I use the wireless button and held it for three seconds and the information which is the I button and it gave me something to help me set up but other than that this was an OK printer it just helps me do exactly what I just need is a quick print the ink I did not enroll into the program but there is a program that they have that you can get the free ink but so far it’s OKI had to have someone come and help me set up the printer she actually had some wireless printers so for her it was a little bit easier but it took her about 15 minutes to complete the test as well me I’m not really a computer savvy so I was not understanding certain things but I was doing everything completely right but it was certain things that she had it that I probably could’ve dead another way but other than that the set up is not as easy as I thought it would be","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1618876800000}
{"reviewTitle":"Get ready to spend money on ink.","reviewDescription":"This is an HP+ printer which means it will only accept hp ink cartridges.  Any others will be rejected, even if they are remanufactered hp cartridges.  It may seem like it accepts them and then you'll be in the middle of a print job and it will error telling you that one or both of your cartridges are bad. As far as print quality goes, and the ability to print directly from phone or tablet or computer without wires, its great, but that's where it ends. One ink cartridge with a high yield is 30.00, that is ridiculous.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"I remember when HP was the gold standard for printers... Don't buy HP!","reviewDescription":"I work in IT and once lead a project to select a printer\/copier\/fax all in one vendor for a 3 billion dollar company. I have a lot of experience with printers and HP used to be the gold standard for commercial and consumer printing. I would NOT recommend them for consumer printing anymore!The printer itself is mostly ok. Like others I've had frustrating issues with connectivity. When it works it works fairly well. When it doesn't (usually when you are in a hurry and just need to print) it is a fun procedure of powering off and back on and or resetting things.My BIGGEST issue is with HPs attempts to FORCE you to use their online services, ink subscriptions, and paper subscriptions for a device that you purchased.They also do their best to prevent you from using third party print cartridges with a thinly veild excuse about better security. Thers are no known attacks in the wild of third party print cartridges being used to exploit a printer, only theoretical research funded by.... You guessed it... HP! A better approach to securing their printers (vs preventing third part ink cartridges) would be better security in their software and firmware.Stay far far away from consumer grade HP printers or you WILL regret it!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"The cartridges didn’t work.","reviewDescription":"I had to buy new cartridges to get it to work. So money I saved was spent.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"HP should be ashamed","reviewDescription":"So the instructions left out the most important part of setting this printer up. I'm gonna say in all caps for the people in the back, after you power on the printer PRESS AND HOLD THE X BUTTON AND THE WIFI BUTTON TOGETHER FOR 10 SECONDS. It took probably 5 man hours before I called HP and had the tech walk me through the setup and I found out that was the step I was missing.On another note that pissed me off is that the NEW printer is out of warranty because its a year old so I'm not able to get tech support from HP or the free ink for 6 months.Also, this printer comes with color\/black ink cartridge's that literally have only enough ink to print out a couple test pages and then you need to get new ink. In fact the black cartridge has nothing in it. It's basically a placebo. Absolutely horrible what HP has become. This printer is going directly back without passing go!","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Prints well.","reviewDescription":"The printer used to much ink, I would not recommend this printer to anyone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"it jamed","reviewDescription":"never got to use it paper jamed cleared it jamed again","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Did not last","reviewDescription":"Worked okay at first but now it won’t print anything. I don’t know how long printers should last but I’ve had it for a little over 2 years.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Not user friendly","reviewDescription":"Got a new HP printer for my HP laptop. Used to be easy to connect the two. Not anymore! You'd think that both being HP products it would be pretty much plug & go. Instead it took me about an hour of downloading new software and jumping through hoops to get them to recognize each other. Pricewise about the same as competitors. Same with print quality, neither better nor worse.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708473600000}
{"reviewTitle":"Just nasty","reviewDescription":"Although I'm very aware that I purchased a pre-owned item. I didn't expect nor want the pre-owned filth that came with it. After opening my box and trying to take the printer out, I was discussed with the crumbs, greasiness and stickiness. It was just gross. I literally had to stop and grab lysol wipes. I definitely won't be the \"Renewed\" route again!!!!","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1706140800000}
{"reviewTitle":"Suddenly STOPPED working","reviewDescription":"We were never able to connect the wifi capability to our tablet or phone, and then after only using it 4 times (just to copy a document once-a-month) it just stopped working.  I thought it may have something to do with \"auto ink\" feature or something like that, and I ordered MORE $$ INK for it, but still does not copy (or print)!  Grrrrrrrr!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"REFURBISHED PRINTER WORKS PERFECTLY!  SAVED$80- WARRANTY PROTECTED","reviewDescription":"I GUESS 2ND TIME'S THE CHARM!  IT HAD YELLOW INK ALL OVER IT FROM THE LAST JACKASS - BUT APPARENTLY, FOLLOWING INSTRUCTIONS IS AN ART 😱I AM EXTREMELY HAPPY WITH THIS PURCHASE.EVERYTHING WORKS PERFECTLY!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"Works like a charm","reviewDescription":"Exactly what was needed for a little house printer, tickets, documents, DND character sheets, business cards basic stuff. The blue tooth connection was easier than expected. Nothing fancy but gets the job done and you can't beat the price. Oh and the ink is real easy to swap out","isVerified":true,"ratingScore":5,"reviewReaction":"18 people found this helpful","country":"United States","date":1699228800000}
{"reviewTitle":"Printer","reviewDescription":"So it has worked out great it has done everything that I needed. I have been able to print from my laptop and phone.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1708214400000}
{"reviewTitle":"Awesome Deal","reviewDescription":"Would pay full price, got it on sale, from instant ink and paper and extra\"s this is the greatest printer for home\/home office, app is amazing and easy and support top notch 💝 set up is so easy are you smarter than a 5th grader, HP Smart ! You can pay more for all in one printer 🖨️ but why cheap ink and paper delivered, and works 10 Star ✨.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"well made","reviewDescription":"in the past i learned about refurbished items from sears(tools) and k mart (electronics),probably 40 years ago.I always look for refurbished first.these items always served me well at a very big savings","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1707177600000}
{"reviewTitle":"Great quality","reviewDescription":"This printer is great for my everyday use.  Easy to set up but had to learn exactly how to print from my phone and iPad  The directions could have been clearer.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"New printer","reviewDescription":"Love it once I figure out how everything works.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Wonderful and fast printing, great for college students!","reviewDescription":"I bought this printer for college because I find it helpful for online classes to not have everything on a computer screen. I’ll print out work sheets to take notes and do drafts and transfer everything to computer later, I find it saves a lot of time. This printer came in perfect  shape, all cables, ink, nothing broken. It was a breeze for me to set up and start printing right away. It does exactly what I need it to do, I wasn’t expecting the quality from higher priced printers nor do I print pictures with it.  The ink cartridges are on small side, but the two pack of color and black cartridges is super affordable and that was one of the deciding factors for why I chose this printer. I did buy mine open box so I saved a bit of money on it. Overall I found it a great value for the money I spent and it is s perfect for what I needed it for","isVerified":true,"ratingScore":5,"reviewReaction":"53 people found this helpful","country":"United States","date":1614470400000}
{"reviewTitle":"Good Value for the Money","reviewDescription":"I enjoy the HP all in one printers. I have a larger one for my home office and I purchased this one for my small private practice.  Set up was easy, and it connected quickly with the provided wired set up as well as wirelessly. It links to the app I already had set up on my computer and with InstaInk, I don't have to worry about ordering Ink. It has been a great little addition to my office.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1679702400000}
{"reviewTitle":"Buena calidad,en perfectoestado","reviewDescription":"Me agradó la calidad del producto.Entrega con el tiempo indicado.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1712188800000}
{"reviewTitle":"HP 4155c printer","reviewDescription":"Most difficult puece hardware to make operable. 3 plus hours to get barely functional. Last HP product I will ever purchase.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1676160000000}
{"reviewTitle":"Printer ink","reviewDescription":"I only printed 2 (yes two) pages on this printer before the quality of the printed pages was unreadable, then it tell me it's out of ink... WTF over?","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1663027200000}
{"reviewTitle":"Disappointed","reviewDescription":"Disappointed. The printer came in a short amount of time. Everything was packaged nicely. Easy set up. However, the printer door is loose. Unless you hold it, the printer won’t print. I can probably rig something to make it work but disappointed it didn’t fully work right out of the box. Otherwise printer is great.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633651200000}
{"reviewTitle":"Big clunky and junky","reviewDescription":"Feels like cheap plastic, setup was difficult. It’s a ink jet. It gives an error message then it prints. The ink per ounce is more expensive than gold. Prints slow. Buy a laser printer if you do any serious printer.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"Color cartridge worthless","reviewDescription":"The color cartridge that came with this printer was useless and dried up. Luckily I purchased an additional cartridge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1669507200000}
{"reviewTitle":"HP printer","reviewDescription":"It’s a little awkward to use, but it’s HP and works","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681516800000}
{"reviewTitle":"Eh. Noisy. Hard to use.","reviewDescription":"The machine is hard to use with confusing buttons. Noisy. Poor interfacing that requires a sign in every time you want to scan something.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1660089600000}
{"reviewTitle":"difficult setup","reviewDescription":"very difficult to setup!  didn't realize it was a refurbished machine!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1678060800000}
{"reviewTitle":"Not what I expected","reviewDescription":"I bought this printer to have for my home office instead of using my work office printer and unfortunately it did not work properly without having the USB cord and OF COURSE the box doesn’t contain it. Extremely disappointed to have to go out my way and purchase additional items to get it to work.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1623974400000}
{"reviewTitle":"I should have just bought a new one..,","reviewDescription":"For the money, I should have invested in a new one… They say you get what you pay for..","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664496000000}
{"reviewTitle":"It was used and refurbished","reviewDescription":"If a product is refurbished it needs to be in extra large letters and maybe in Red. Older people don’t read all the smaller orint","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1708992000000}
{"reviewTitle":"Good printer","reviewDescription":"This printer does what it is designed to do.  However, the software sucks.  I really dislike that every HP printer I deal with now requires an Internet Connection to connect it to the computer that it is connected to by USB.  Whet I found very annoying was when I went to scan it demanded that I create an account so it could upload my scans to some HP cloud.  Took me 2 hours of going through the HP website to find software labeled \"OFFLINE DRIVERS\".  This system is used in a place where there is LIMITED to NO internet.  Next time I will buy a Brother printer or Okidata.  HP seems to forget that not everyone wants or needs the cloud.  Not to mention I have lost internet connection for days, had power, but no internet.  That would make this printer useless.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1668297600000}
{"reviewTitle":"it not what i  had expected it will not fax","reviewDescription":"this idem does not fax  my other hp printer all in one will fax they do not tell that it will not fax","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Not working well with my work wifi","reviewDescription":"and the first inks last a total of 10 pages even with fast draft black and white options checked.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"Bought new got refurbished","reviewDescription":"I ordered a new printer and I used it once then it never worked again,,,spent over an hour on phone trying to work it out,,,they said send back they will replace,,,they sent a Refurbished printer,,,,I sent that back and have yet to receive my money back🤬🤬","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1700265600000}
{"reviewTitle":"Printing quality and ink consumption leaves a lot to be desired","reviewDescription":"Could pretty easy connect and configure wifi, to use from laptop and mobile phone as well.Looks good and scans pretty good, but didn't like printing quality and ink consumption. After first 12 pages of the simple text, where 2 pages printed with highest quality it shows that there is no two fifths of the ink.If you want to see very small text on the page you have to print in highest quality, which prints very slow and consumes a lot of ink. Honestly, I wouldn't recommend this printer at all","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1687392000000}
{"reviewTitle":"Desencantada","reviewDescription":"Está muy fácil de usar. Pero molesta. La tinta no dura nada, en un día se acabó.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704844800000}
{"reviewTitle":"It’s not printing","reviewDescription":"When I followed the instructions on the manual it linked me to three different website that had live chat and were gonna help me set up the printer. I clicked on the first one and I chat with an agent than I gave them my number and they called and says they will charge me 45$ to set up the printer. I just Youtubed it and I followed the instructions I have the app on my phone and laptop. Bluetooth and Wi-Fi is connected and I see the printer on my phone and laptop. But nothing is printing. Only thing is when I click on the “i” button information about set up gets printed.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"Did not work","reviewDescription":"Would not connect to the internet","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704240000000}
{"reviewTitle":"Don't waste your momey. Not iser friendly.","reviewDescription":"I dislike the diffucult tasks of getting maintenance completed. Changing or installing ink should not be this difficult.I never got the Bluetooth to hook up to my phone.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Multifunction","reviewDescription":"A little printer with multi function. It’s easy to use it","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"HP DeskJet will not disappointe","reviewDescription":"Just what I wa looking for.Plus it looks nice where ever I put it.I have a “Tiny house “ and I’m 84 and that’s important to me. Prints beautifully , no problems at all. The only thing making me unhappy is cost of INK.You will not regret purchasing this printer by HP.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1625356800000}
{"reviewTitle":"Great product","reviewDescription":"Even though it's refurbished, it's all I needed for the amount I use it.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1677369600000}
{"reviewTitle":"Seems to work fine after it took a long time to set up","reviewDescription":"Although the \"instructions\" seemed straightforward (download software or install app), it took quite a while to get it installed. I think part of the issue was that I previously had an HP Printer and already had the software installed that I was having issues. And, perhaps, a picture of it with paper would be helpful.Once I got it set up, it works great!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1626393600000}
{"reviewTitle":"Prints Faster than I thought","reviewDescription":"I liked it nothing to fancy but it gets the job done","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1677715200000}
{"reviewTitle":"Compact","reviewDescription":"Easy to setup","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1681862400000}
{"reviewTitle":"Does it's job","reviewDescription":"But its too slow","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1683504000000}
{"reviewTitle":"Paper feed.","reviewDescription":"Works good but after 2 or 3 copies the paper jams and you have to pull it out and restart. Other than that aggravation it works well.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1654992000000}
{"reviewTitle":"Fast delivery when needed ASAP!","reviewDescription":"They did send the wrong cord with the printer but re-sent out the right one right away. The print quality is great considering the printer is priced so cheaply. Very happy with my purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1644883200000}
{"reviewTitle":"Very nice printer","reviewDescription":"Easy to install and use","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"Great for the Price","reviewDescription":"This printer is great for the price and does most of what it promises. Connecting via the app on my phone is wonky, so I do not use, which is fine by me because it's not a feature that I would ordinarily use. Conversely, set-up and from my laptop was easy and it hasn't failed me yet. The connection is pretty reliable. The paper tray is small and 2-sided printing requires flipping the paper manually, but this is a casual home printer and not a high volume office printer. For $70 I am happy.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1629590400000}
{"reviewTitle":"It works","reviewDescription":"I like the size, and ease of use","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Good","reviewDescription":"The printer works great however set up to this printer was not at all user friendly… If your not very good with technology,  then I suggest to look into a different printer","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1668643200000}
{"reviewTitle":"software is misleading","reviewDescription":"HP smart software explicitely states that the printer will not work if you dont set up an HP account, which i wont do. printer does still work though. not sellers fault, HP needs to fix that","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1663372800000}
{"reviewTitle":"Great Printer","reviewDescription":"I almost didn’t purchase this printer after the nightmare reviews about setting it up to a network. Thankfully I took a chance. It took about 10 minutes to get it hooked up and ready to print. I had no issues at all.","isVerified":true,"ratingScore":4,"reviewReaction":"23 people found this helpful","country":"United States","date":1665446400000}
{"reviewTitle":"Good printer","reviewDescription":"Printer works good but goes through ink quickly. Bought refurbished and worked fine. No owners manual though, have to download if needed. Was much cheaper then other option, good hone printer.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1680393600000}
{"reviewTitle":"easy to use.","reviewDescription":"Good value for price. Easy to set up and use after figuring out that the instructions that came with the printer were garbage. I had to sue my intuition because I am not a tech-savvy guy.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Awesome!","reviewDescription":"Like new. Very impressed.!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Downloading software went fast on my phone. Took 4 attempts to download on my laptop.","reviewDescription":"Ok for the money.  I won't use it a whole lot, few times a month maybe.It would be nice to be able to run all functions on the printer itself and not just through your phone or computer.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1656115200000}
{"reviewTitle":"Works well","reviewDescription":"Easy set up works well","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"It is quiet.","reviewDescription":"We like that it is quiet. It was hard for my husband to install, but he did it. About the same as the last printer we had.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Very finicky.","reviewDescription":"I found the instructions hard to follow.  Occasionally it just stops working.  I need to unplug it and replug.  It will then print the last job.  It is a mystery to me.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"Excellent","reviewDescription":"I would have given this 5 stars, but it was delayed and zI needed it for work?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"Value for money","reviewDescription":"Value for money.  Till now it is working in good shape.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"Printer is good but very slow to get print out","reviewDescription":"I bought this printer 1 month ago and I like this printer quality and it’s easy to use however it is very slow printer. I bought for my kid’s homework stuff so for me is doesn’t matter if it slow but if you want to buy fast one so check another printer option","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"Good printer.. a little bigger than expected","reviewDescription":"I like the printer but I had to move stuff around to make room for the back part because you have to lift up the paper holder or it won’t print properly. Other than that I love the printer. If your wifi is on the slower side it might be hard for you to get the printer to print documents through the app hp print and getting it connected.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"I do a lot of printig","reviewDescription":"The printer was little harder to setup but with the help of HP it was up and running for all five devices.And you get a 6 months plus three free inkWhat didn't know was it was a refurbished printer.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1679961600000}
{"reviewTitle":"Almost everything I need","reviewDescription":"So far so good 👍I wish that seller would wait at least 21 days to ask for feedback on something like this.  Byer can't give proper assessment in such a short time.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1681516800000}
{"reviewTitle":"Where the paper goes!","reviewDescription":"I had to call the support number from the Amazon re-new store as I did not know the correct place to put the paper so it would roll in.  the is a place in the back that i never would have guess to put paper in. This product was refurbished and sold for a great price. I am pretty sure I lucked out!","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1659916800000}
{"reviewTitle":"Good for an inexpensive printer","reviewDescription":"If you do moderate printing this is a good printer. Pictures are of okay quality. I had one that failed after just 2 years. HP tech support is no help at all.It was just easier to buy another one.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"down grade","reviewDescription":"I would not recommend. I bought this printer last year and it has never worked in a manner that I'd say was good since. The book that came with it wasn't helpful, and I bought two sets of ink cartridges just to get it to semi-print clearly, and now I have to buy more ink just to get it to print. This printer was a waste of time because I still have to go to the print store to get good printouts of my documents.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"HP did not stand behind there product. The warranty was out before I got it.","reviewDescription":"I call HP Support for help get it setup.They told me th warranty was expired and couldn't help me unless I paid $20.00.I told them I just received it that day. It didn't matter. I explained I have two othe HP products and I purchased this because I thought HP was a good company.Turns out they are not. I returned the item.I must say that Amazon helped me alot and I have no problem with them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"not recommended at all","reviewDescription":"Terrible scan quality on scan glass. When I try to scan from document feeder, it gets jammed.The color comes out completely different. When I print a simple black ink document, it comes out green or blue. Of course it doesn't magically work when I'm printing somthing with color. This issue was not resolved even after changing the ink.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Worst Printer I've ever owned","reviewDescription":"I bought one of these and returned it thinking it they refurbished it wrong. Well the 2nd one they sent me is also absolutely useless. Everytime I move more than 10 feet from this piece of junk the Bluetooth disconnects and I have to reset the whole thing. Now it won't even connect to wi-fi. I have completely used up the black ink just printing the info on how to use this garbage. I'm now attempting to print service dog form to take my seizure dog on a flight tomorrow morning and once again it will not connect, I prob don't have enough ink anyway. This is at least the 6th printer I've had in my life, some wireless others not, and I've never had one of any brand that was as completely worthless and as frustrating as this one. It was my mistake for not printing something as soon as I got it because it HAS to be Amazon's refurbishing. This printer would've been recalled if HP had sent out a completely non working printer. Since I can't get my money back now the only satisfaction I'll ever get from this thing is throwing it off my 11th story balcony. At least it will make room on my desk and I'll be able to send the video to Amazon and HP. Can't wait to watch this garbage explode into 100's of pieces","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1671148800000}
{"reviewTitle":"Unreliable and Expensive Loss","reviewDescription":"It kept disconnecting from Wifi, I had to reboot it several times each use, and it couldn't seem to print for more than a page at a time before running out of ink.  Yes, I kept replacing cartridges until i went through a pack of three when I really needed to print something and no ink every came out - black or color.  I cleaned the print heads, the printer itself and it was not clogged up according to the lint free paper towels and q-tips I was using.  So, I wrote a letter to the seller and sent them photos.  I'm out money for this printer, as well as all of the print cartridges that failed.  So frustrating. Maybe you will all have better luck.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"Connectivity errors via iPhone and HP Chromebook.","reviewDescription":"I connected using my iPhone 11 Pro Max. When I leave the house the printer obviously disconnects from my phone. But when I return I have to switch to the HP Printer through my WiFi settings. Kinda lame to have to manually switch any time I need to use the printer. Not a problem except nowhere on HP’s website is that factoid made accessible to the user...so had to find help in user subs. I tried to print some coloring pages for my child today. I used the browser files and downloaded to my photo library. Tried printing and failed. Downloaded to my docs\/files instead. Then tried printing from that destination, unfortunately it failed. Tried using the coloring pages that are available through the HP Smart App…still failed. It presumed the size I wanted printed for the document to be 4x6 in size, but refused to print on 8.5 x 11 paper. The printer would not print unless I had the correct size of paper. I tried to find the setting options within the app and on the printer itself so I could change the printer paper size that it would be printing on. I unfortunately could not find that anywhere. I searched forums and HP Help and Support, but nothing. I guess I am too old school because I remember printers not giving a damn and just printing on paper that was in the printer. But unfortunately this printer is particular and temperamental. Your loss HP. I read the reviews and though the connection issues were fluke occurrences. But this particular printer does not like Apple products or Chrome books.","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1632528000000}
{"reviewTitle":"Really frustrating","reviewDescription":"Never had a problem with my old printer but HAD to forcefully get a new one,  since I've had this one nothing but problems, it's never worked, so frustrating.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Not user friendly and want stay connected","reviewDescription":"I have had so many issues with a printer.  The first few months I had it.  It worked great.  I am an S1 in the Ms State Guard.  So therefore I do a lot of printing and scanning.  First off from the being I was not able to get my computer to connect to it, and I have an HP computer.  I had to connect to my phone first in the app.  Then log into the app on my computer.  It is not user friendly.  If you ain't tech savvy, I don't recommend this printer.  Know every time I go to use the printer I have to stay the reconnecting process.  Which is time consuming, every single time. I have the completely delete the profile on the app and start over.  I don't have time for that when I need to print something off.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1700524800000}
{"reviewTitle":"Terrible","reviewDescription":"Only had printer for a few months. Used it a couple times. Literally two times. Tried using it today. WiFi connectivity issues. Then the paper feeder was soo temperamental. Took 2hrs just to print three pages. The printer I had before got me through undergrad and graduate school - had to replace as HP no longer supported. Had to purchase a new printer. This one sucks compared to the one that lasted for over a decade!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Beware","reviewDescription":"Update. This is by far the worst printer I have ever bought. I am looking for a new one. HP quality of their products has gone down in the last few years. I had a laptop that lasted a year and now a printer that did not perform from day one I currently have a desktop that’s about four years old that slower than any computer I’ve ever had so I think HP and I will part ways.This printer gets an error every time it prints then it wants to print an alignment page every time it gets an error, so I am using paper like crazy printing alignment pages. The error flashing lights have no explanation, except error no matter how many of the lights you press they never go away if I unplug it to reset it, it will print another alignment page and if I’m lucky might print the page that I want it to print. DO NOT BUY THIS PRINTER","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1695859200000}
{"reviewTitle":"Would not reccomend, too cluk","reviewDescription":"Too Big for output!Clunky, doesn't hold much paper, doesn't line up and gets jammed easily.I wish I hasn't bought this model!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614816000000}
{"reviewTitle":"Uses way too much ink.","reviewDescription":"I have to buy ink every 3 weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663977600000}
{"reviewTitle":"Horrible","reviewDescription":"I was not told this was refurbished and it still won’t connect, I’ve tried everything.  I had 2 before this and loved it","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1622246400000}
{"reviewTitle":"Difficult to setup!","reviewDescription":"Difficult to setup!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"Bad software","reviewDescription":"Bought brand new and it can't connect to my computer well. Doesn't print when you want it to.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1627084800000}
{"reviewTitle":"purchased an inexpense printer","reviewDescription":"For in home use. will purchase a higher quality printer shortly.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643932800000}
{"reviewTitle":"Would not program","reviewDescription":"Printer would not program with my computer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1631923200000}
{"reviewTitle":"Slow printer","reviewDescription":"Print quality is good but this is one of the slowest printers I  have ever owned.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618617600000}
{"reviewTitle":"Lost WIFI","reviewDescription":"I have to make adjustments every time I need to take a photocopy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1623628800000}
{"reviewTitle":"I had issue with mine but I also bought it refurbished","reviewDescription":"I really didn't get to use it due to the fact it never worked properly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1620259200000}
{"reviewTitle":"Took forever to troubleshoot","reviewDescription":"The printer works fine for the price. It however took me two hours to get it to set up to my computer. I had to do incredible work and troubleshooting on my own to get it to connect.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661040000000}
{"reviewTitle":"Difficult set up","reviewDescription":"Came with no Manuel and directed to set up instructions for a completely different printer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682726400000}
{"reviewTitle":"Does not support my laptop won’t hook up but dose print manually very well","reviewDescription":"Doesn’t support my laptop won’t hook up ( blue tooth) but dose print manually very well","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"Worst Printer","reviewDescription":"The scanner is terrible. It takes a dozen times to try and scan into your laptop. It always says not connected to internet.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1662336000000}
{"reviewTitle":"works for only few weeks","reviewDescription":"Solo trabajo por unas cuantas semanas, comenzo con la calidad de las copias a fallar despues solo dejo de sacar copias, siempre he comprado hp printers pero esta vez me quede decepcionada que solo trabajó tan poco tiempo, dinero perdido","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1657324800000}
{"reviewTitle":"Don’t but","reviewDescription":"Printer works fine. You cannot turn off access to printer by HP allowing them to monitor usage and send ads. Although instructions indicate you can, the instructions are misleading.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1660348800000}
{"reviewTitle":"Don't buy","reviewDescription":"You pretty much use all your ink and oaee printing the configuration pages.  Constantly jammed, holds a miniscule amount of paper and ink is ridiculous.  But I should have known that I guess.  Pay attention to PPM when deciding.  Better yet, don't buy HP","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1628812800000}
{"reviewTitle":"Why are these printers so junky?","reviewDescription":"Terrible time getting connection to my wifi.  Wasted a ton of paper just trying to get it connected because all it kept doing was printing the ‘instructions’.  Come on, you can do better","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1650326400000}
{"reviewTitle":"If you have bad eye sight this isn’t for you. This window is so small we couldn’t program it.","reviewDescription":"It was too hard to program the window was too small being seniors our eyes sight couldn’t make out anything on it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1661212800000}
{"reviewTitle":"I had my last printer for 5 years","reviewDescription":"This printer use’s ink very fast and I really don’t like the quality, it’s not easy to use, I have to turn on and off several times not at all happy with this product","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1654041600000}
{"reviewTitle":"could not setup the printer ven with tech support","reviewDescription":"Tech support was friendly and knowledgeable but he ended up trying to sell high end software for twice the price of the printer so nothing got fixed and I am returning the printer.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1653782400000}
{"reviewTitle":"No me rinde lo suficiente","reviewDescription":"Mucho la inversión en cartuchos fue una mala inversión.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1669766400000}
{"reviewTitle":"look for better","reviewDescription":"does not hold a wifi connection very well.  this makes printing very difficult and frustrating.  had to return!  2nd HP printer, the 8035, is fantastic.  I had to spend a bit more to get really good quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1618272000000}
{"reviewTitle":"It's cheap. Hard to use but cheap.","reviewDescription":"Takes forever to turn on and off and set up. But it's cheap.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671580800000}
{"reviewTitle":"When to throw in the towel?","reviewDescription":"Spent hours getting this printer connected to our home network.  However, to get it to actually print, I have to unplug it, wait 10 seconds, plug it back in, and when it’s done initializing it will print my document.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1616284800000}
{"reviewTitle":"Printer not what I expected","reviewDescription":"Printer would not connect to WiFi 100%. Sporadic at best. Printing from computer was a little better. Refurbished is not the way to go, maybe.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658793600000}
{"reviewTitle":"Que funcione","reviewDescription":"No me funciono","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1680739200000}
{"reviewTitle":"Paper feed quit after a few days. I now have to push the paste feed button each time for each page.","reviewDescription":"Paper feed quit. Have to use manual page feed button per page. Atad frustrating.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Find another printer","reviewDescription":"Fine for a cheap printer but if you're needing it to function 100%of the time, find another option. I frequently have to unplug\/restart it and it skips some parts on the page from time to time.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1614902400000}
{"reviewTitle":"Extremely difficult to open print cartridge door resulting in breakage making it a useless item.","reviewDescription":"I don't recommend buying this printer. The cartridge door is so difficult to open you run the risk of breaking one of the pins that holds the door on making it useless.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634256000000}
{"reviewTitle":"Printer","reviewDescription":"Printer worked as it should","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Hp printjet","reviewDescription":"Loved product. Thank you.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Does what it should","reviewDescription":"Does exactly what it should, little difficult to hook to wifi, but all printers are finnicky about that.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1702944000000}
{"reviewTitle":"Good pricing","reviewDescription":"Product was as indicated.  Good value and good quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Good Quality","reviewDescription":"Perfect for a home printer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"Easy to set up.","reviewDescription":"The cartridges were difficult to install initially. I was afraid I was going to break the carriage. It gets easier with replacements.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1702339200000}
{"reviewTitle":"Easy set up","reviewDescription":"Easy to set up","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707091200000}
{"reviewTitle":"I use it in my office","reviewDescription":"I use it in my office so much and I waited for a long time to write so I could tell everyone how it works afterwards and it still work’s great I use it almost on a daily and more then once a day it still works great","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1684713600000}
{"reviewTitle":"Great for the money","reviewDescription":"Everything worked except the thing that you pull up to hold the paper up to feed into the printer.  It is against the wall, so that will not be a problem.  Printing and copying is great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Great buy","reviewDescription":"I've had my printer for about 2 months and it's still working great I'm happy with my purchase and it was very easy to set up :)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"Amazon & HP Steal from YOU","reviewDescription":"For shame , for shame.  Amazon didn't state that printer only works when enrolled in HP cartridge replacement program when I was purchasing the printer.  HP program is only a license to steal.  You are charged a monthly fee but don't receive anything.  When you catch on to what they are doing and cancel out of the program, they turn off the printer stating only will work when enrolled.  By the way their don't tell you that fact when you are cancelling the program.  Both Amazon and HP should refund my money for this lie.  I am stopping my Prime for this reason.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Refurbished?  I think it only had new print cartridges","reviewDescription":"The printer was easy to set up.  I installed new print cartridges (came in box) and used USB connection to dedicated PC.  Very easy set up.  Out of the box, it won't print a test page.  It only \"prints\" blank pages.  I tried cleaning cartridges, etc.  Ran through all of the setup and \"nothing\" will print.  I called and HP told me that this printer was sold without warranty.  I called Amazon and they said they can't help.  My opinion?  Not refurbished.  After refurbishment, it would have printed a test page.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703721600000}
{"reviewTitle":"Not as described,  not what I expected","reviewDescription":"I do not recommend.  It is Missing parts.  Can't print with it as it was sent..  However I was able to use the part from my old printer, in place of the Missing one (exact same model) but still the printer will not work.The paper will not feed through the printer.Unfortunately it's defective,  and Missing necessary equipment to use correctly 😕Price was good but if your not getting a product that works then I am loosing my money and my time , as I still dont have a printer and I run a small business .","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"Do NOT buy Refurbished","reviewDescription":"I have never wanted to throw a piece of technology so hard at a wall before.  I have bought many things refurbished but this should NOT have been one of them.  If you have a Mac, your set up is so complicated.  If you try to register it, you can't because someone else did.  This limits you to calling their number for help...but guess what? Their help never actually answers the phone.  So I'm having to take this $80 purchase to the dump.  Thanks a lot HP for not actually refurbishing something and giving me zero options to get it set up.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1699660800000}
{"reviewTitle":"Junk  from HP","reviewDescription":"Too much trouble to get it to work.  Worked for a day or two and now won't feed paper.  Think I'm giving up on HP products. They don't seem to last any longer.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"do not buy this printer ever","reviewDescription":"printer does not work order new ink stop working about 45 days in piece of cramp I just want to pay for shipping and ship it back to manufacture and go to walmart will not ever buy a printer from Amazon have bought 3 in last year DO NOT BUY PRINTERS FROM AMAZON","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712793600000}
{"reviewTitle":"NO CUSTOMER SUPPORT","reviewDescription":"HP’s customer support is a joke. I bought this printer specifically to take advantage of HP’s instant ink program. But my printer won’t connect to the program. I have called HP 5 times, each time I’ve been on the phone anywhere from 1 to 3 hours. Each time they tell me they have “escalated the problem” and that someone will be calling me back. NO ONE HAS CALLED ME BACK. The last time I spoke with someone, they promised me they had reported my issue to the highest level, and that someone would call me back regardless of whether or not my issue had been solved, within 48 hours. That was two weeks ago. Still nothing. Because of the refurbished deal, the printer is out of warranty, and I don’t know if I’m going to get any compensation, or get my issue fixed. HP did not give me any discount at all when I had to buy new ink at full price. I am extremely upset.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1654214400000}
{"reviewTitle":"absolutely worthless","reviewDescription":"barely used it and it broke on the fifth project with official replacement carts.  will not ever buy another hp anything","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Security Concerns","reviewDescription":"In attempting to set up this printer on my Mac desktop, I was asked for my keychain password (the place were all my passwords and tokens to access everything I keep private).  I deny it's access and check the keychain.  This HP DeskJet 4100 All-inOne Printer attempted to access the passwords to places it didn't belong, such as,  \"find my phone\" and \"find my friends\".WHY would a printer need to \"find\" your phone or friends.  In other words, HP want to tract you and access your friend's list.I just wasted $90 that I didn't have to just throw away.  I will be trashing this printer and buying one that not a spy on what I'm doing or where my friends are.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1676851200000}
{"reviewTitle":"Refurbished printer","reviewDescription":"I had already sent back the same printer I bought for $64+ because of hardware issues. I recently purchased another one at $75+ only to find out it is a refurbished printer. When I went to connect it to WiFi it said my warranty expired in July 2023. It’s 2024","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710892800000}
{"reviewTitle":"return","reviewDescription":"this model doesn't work very well. slow and the print out is not clear. I want to return if possible.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"HP setup says this is an HP 4100 printer but it was advertised as an HP 4155+ printer","reviewDescription":"It has a fraudulent serial number sticker on the back for 4155+printer so it can't ever be set up because HP needs the real serial number to set it up.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Damaged","reviewDescription":"Got this printer the packaging was intact,the lid was taped down etc. However when i removed the tape and lifted the top portion i realized the glass was smashed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721347200000}
{"reviewTitle":"HP does not support nor provide warranty! Nightmare installation","reviewDescription":"Upon opening box I found printed page saying, \"This item is not warranted by HP.\" Great.  what it fails to state is that HP will not provide any troubleshooting support either.I setup, installed ink, and printed alignment page.  Downloaded HP software.  Printer will not print, although it copies a page fine. Should printer ever decide to print, it appears every page needs to be converted to PDF form. Printer initially (must be within about 6 feet from my laptop) recognized my Wi-fi router and next day couldn't find printer.  Used HP troubleshooter that repeatedly couldn't find printer--but finally did and claimed printer was turned off!Wrong!  This printer makes non-stop noise when on! Received useless instructions to turn off router, then printer, but no change.  Virtual technical support repeatedly sent suggestions until I insisted I needed to talk by phone with support.  HP refused and advised, \"printer sold with no warranty\", thus will not help me. The only positive thing I can say is the return to Amazon looks easy as I can bring to Kohl's without worries about box--or label that I cannot print since I have no working printer!I lost 2 days time unable to print urgent documents.  The stress triggered a migraine headache that may take unknown quantity of days to resolve.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1638316800000}
{"reviewTitle":"Absolutely terrible","reviewDescription":"This printer is somehow always “Out of ink”. I’ve replaced the cartridges, contacted HP support, run through all the troubleshooting steps. But within 5 sheets it’ll be low on ink, and then shortly after it’ll only print blank pages.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Doesn't work most of the time.","reviewDescription":"If it's not having trouble connecting to wifi (wifi works just fine) it jams with one sheet of paper or 15 sheets of paper in the tray. It doesn't warn when ink is empty. Don't get me started on the quality of the printed sheet when it does want to work right (rarely) if you order this thing just throw it straight in the garbage can. You better off. Needless to say save yourself time, headaches, sanity, and money and get any other printer than this one.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1710460800000}
{"reviewTitle":"Decides when it wants to work.","reviewDescription":"This printer is nothing special and should have been easy to setup. It usually takes three attempts of turning it off and on to ensure it's connected to the network. It may print what you want it to or may not. It also eats through ink like nobody's business! Would not buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"No comprar","reviewDescription":"No ay tinta q dure 100 copias y cada v d es más lenta y empieza a fallar como si fuese viejísima o dañada","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Very Difficult to Install","reviewDescription":"My primary reason for buying this was the USB connection (there are plenty of better wifi printers, and they come with real ink cartridges).Installation was difficult -- and I'm an old repair tech.  The printer comes only with two \"setup cartridges\", which got me most of the way through the internet-based software install (note: I had to go to support.hp.com to get software that worked).  However, those \"setup cartridges\" did not support printing a test page, so the install hung.  FORTUNATELY, I had Prime'd a pair of 67-series cartridges, was able to swap them in, was able to delete the first software install, and then re-load the software -- that completed the install.I sucessfully printed from my computer.  BUT, to scan a document to file the software demands that you use an online HP account !!!  You can't scan at all offline (except as a copier).  At that point I put the printer away for the night.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1673049600000}
{"reviewTitle":"If you want frustrations, buy this printer","reviewDescription":"From the time I plugged this printer in it gave me nothing but connectivity issues. It wouldn't stay connected to my Wi-Fi and it got to the point where it wouldn't respond to buttons being pressed either. Not to mention it does not accept aftermarket ink cartridges. I've switched over to Brother and am going to give it a try. Do not buy this printer unless you want to have constant problems with connectivity, user interface, and not being able to print from your phone. This is the last HP printer that I will ever buy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Quit working","reviewDescription":"This printer would never connect wireless and just quit working. I returned it for a refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713657600000}
{"reviewTitle":"Trying to find something nice to say about it.  I can’t!","reviewDescription":"There are no set up instructions.  You are directed to look on the Internet.  This model is not in the web directions.  My son figured it out eventually.  The message every time you try to print is “out of paper”.  It is jammed…every single time…When I did get it to print a few statements that I needed, it immediately ran out of ink.  I went on line and purchased more ink.  I replaced the ink and printed about 30 pages.  In a couple of days, I needed to print another few pages.  Guess what?  It said it was out of ink AGAIN!  Sorry, fleece me once, shame on you, fleece me twice, shame on me.  It is going in the trash.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685404800000}
{"reviewTitle":"Still registered to old user","reviewDescription":"Caution: the renewed printers are still registered to previous owner. Unable to create new account with HP","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Received a 4155e not a 4155","reviewDescription":"Two stars because the printer is fine. It is working and was easy enough to set up. My issue (that I didn't notice until I had it unpacked and plugged in) is that I purposely bought this refurbished printer because it was supposed to be a 4155 but what I received was a 4155e. This means I paid more money for a refurbished printer than I could have paid for a brand new one. There were changes made to the 4155e that made it less appealing to me than its 4155 predecessor. Someone needs to fix the listing description.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"damaged cartriged","reviewDescription":"","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Pokie Joe","reviewDescription":"When i hit the print button. It takes a full 5 to 10 seconds to start printing.Slow ! Slow! SLOW.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1710115200000}
{"reviewTitle":"Don't get this printer!","reviewDescription":"Got printer yesterday. Long phone convo with support to even get it up and running. Cartridges that came with it were installed. After one day color cartridge is out of ink already and I didn't even do that much printing. Called Amazon. All AI would tell me is to return printer. Couldn't even talk to a real human! Tried replacing the color cartridge I already had - wouldn't work. And now the machine won't even power on! I will be returning it. I learned my lesson.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Good printer but had issues with scanner","reviewDescription":"Got it in and didn’t use the scanner for about a month and it didn’t work. Wireless print works good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709251200000}
{"reviewTitle":"Not impressed","reviewDescription":"Can't hook up the wifi and can't figure out what app I'm suppose to use. And it's super loud when it does print. Very frustrating","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707436800000}
{"reviewTitle":"Stopped working properly after a year.","reviewDescription":"The printer stopped working properly after about 1 year. The printing speed slowed down significantly to where it would take 30 minutes to print one page, paper jams occurred more frequently, error message came on after every print job, it bled ink on the paper and would not fully print around the borders of the page. I would never buy anything knowing that I only have a short period to enjoy its benefits w\/o getting a warranty on it but because it was so cheap I purchased it. Wish it still worked properly. Hate that I’m shopping around for another printer yet again.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1681257600000}
{"reviewTitle":"Works perfect","reviewDescription":"This printer\/copier\/scanner\/fax  works as it should.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Easy to set up","reviewDescription":"Easy to setup","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Exelente","reviewDescription":"Exelente","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Works great and good quality","reviewDescription":"I am pleased with item and quick delivery.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"Excelente","reviewDescription":"Excelente producto","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Work","reviewDescription":"Work great","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Todo está perfecto","reviewDescription":"Me encantó quedé contento la volvería a comprar una y otra vez","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"QUALITY PRODUCT FOR PRICE !!","reviewDescription":"VERY GOOD QUALITY COPIES !!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1717632000000}
{"reviewTitle":"I love my printer","reviewDescription":"I love my printer. I would definitely by it again. I love that the feeder makes it easier to scan papers. No need to purchase a scanner separately.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714262400000}
{"reviewTitle":"Took a while","reviewDescription":"The printer has to go through an app called HPSmart to work. You can't just plug in cords. I have a PC with windows 7. Didnt work at all. I used a laptop. Inconvienient because i cant type well on . But i did receive it on time.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"HP got this right","reviewDescription":"Unlike my last HP printer, this one works and prints great. Hooked right up to my WiFi and prints like a champ.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Sturdy product","reviewDescription":"Thin and light","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717027200000}
{"reviewTitle":"Easy set up","reviewDescription":"Works great with excellent price.  Use it for home office remote","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Perfecto!","reviewDescription":"Me encanto! Perfecto para lo que se necesita. Los cartuchos son los que poco duraron.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Seems to meet my needs","reviewDescription":"I had a little trouble trying to connect to my Wi-FiThe manual that I finally downloaded was extremely helpful and had me up and running in 15 minutes","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1712880000000}
{"reviewTitle":"Hp printer","reviewDescription":"The printer is nice and works well. I love that it is cordless","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Great printer with a small footprint","reviewDescription":"I’ve been wanting to get a printer to put on my desk top and this one fits the bill. It prints in color and black and white, copies, and scans.I saw lots of people saying it was hard to get set up. Mine would connect to my WiFi, but I did have some challenges with getting the iPhone app to recognize it. I had some challenges with the pc app recognizing it as well.Once I went to hp.com and setup an account, everything started working just fine. I also hooked it to my pc with a cable and that helped to get things going.Once it was setup in the pc app, setting it up in the iPhone app was a breeze and it performs great. And hp has an xl ink that doubles the number of pages I can print.","isVerified":true,"ratingScore":5,"reviewReaction":"17 people found this helpful","country":"United States","date":1659139200000}
{"reviewTitle":"Works well","reviewDescription":"So far I love it. No problems or issues.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"haven't used tech support yet. reason for 4 star.","reviewDescription":"HP always has a good selection of what I need, products are reliable and work.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713830400000}
{"reviewTitle":"My HP Printer","reviewDescription":"At 83, I continue to be impressed with the consistent ongoing quality of HP products. This cost-effective printer is quiet & efficient & replaces my former all-in-one home HP printer which performed its tasks flawlessly for more than 6 yrs.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1708819200000}
{"reviewTitle":"HP Smart software is terrible","reviewDescription":"Honestly, when the printer works it works pretty well.However, it is basically russian roulette as to whether you will be spending an hour screwing around with HP Smart software or the HP app on your phone to get the darn thing to scan.The several times I have been able to use the document feeder it has worked well.Again good luck if you aren't tech savvy. It isn't like we haven't figured out how to make hardware work with software via USB or WIFI before in this modern wordl. HP has just gotten distracted by making money selling subscriptions and not doing fundamentals well.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"Not worth it","reviewDescription":"The printer already broke…not worth your money…not even worth a fart!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Refurbished printer","reviewDescription":"Here's what I encountered.. power cord not appropriate for the printer.  Printer has scan ate for scanning but no \"scan\" control button! Where the scan button was supposed to be, there was a second \"copy\" button!  Both buttons made copiesbut wouldn't scan.  No CD included for driver upload. Online help site at HP gave message of \"forbidden \" when trying to download drivers.  2 hrs wasted trying to figure this out and then packed up and returned..","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"constant problems","reviewDescription":"This is the worse printer I have ever purchased. Every other print requires me to either completely reset the printer or push a button on the printer to get it to go. DO NOT buy this printer. HP products are known for quality and long performance. This printer has been in a failure mode since it was taken out of the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699315200000}
{"reviewTitle":"Actually got a 4100 and it's CRAP 🙄","reviewDescription":"My fault for not realizing it was a 'renewed' printer. Having said that, I received a 4100 BTW. I didn't even realize this at the time. I just plugged in, downloaded drivers, and tried to print. After a lot of work, I finally printed out a few sheets. Then a few days later I want to print something and now it doesn't recognize the printer or the paper isn't right or something else. Then I try and scan something. I actually got it to work but of course next time a start it up.. problems. This thing has been a complete nightmare from the start. I've tried several times to reinstall drivers or this or that, but to no avail. To late to send back. BEWARE !!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1649030400000}
{"reviewTitle":"Junk wish I could return","reviewDescription":"The model number on the printer and the model on the hp support sticker are not the same. Printer is a lemon - not human error. Does not register on HP app which isRequired to scan or print remotely.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Printer was entirely non functional.  Refund given, but it was a process","reviewDescription":"The printer was nonfunctional due to the serial number being are you register to another account. Serial number registration was required for the set up process , and so the printer could not be set up. Ultimately Amazon did refund me but it required several hoops to jump through.  I was charged a restocking fee and did not receive my full refund.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"A complete waste of money! Don't be cheap. Just get a decent printer.","reviewDescription":"A piece of junk. Despite trying a few cartridges, and endless tests it is still unable to print a presentable document. Everything is faded whether it's color or black & white. Unfortunately, I didn't get a warranty so I can't even get help to fix it. I might as well throw the whole thing away at this point. HP's automated support functions have been useless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692748800000}
{"reviewTitle":"Will not put paper through","reviewDescription":"Which printer works fine until you try to print something, the things inside of it that speed around to grab the paper or not working they are not grabbing the paper and pushing it through the printer to print the work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Awful printer. Don't buy it & waste your time & money.","reviewDescription":"This printer hardly ever works. Has to be reset EVERY time I use it and even then it's hit or miss if it wants to print. Goes through ink like it's absorbing it or something.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704326400000}
{"reviewTitle":"all ways loved HP printers","reviewDescription":"Only thing I wish the would print on both sides automatically","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"SATISFECHA","reviewDescription":"Llevo un día con ella y hasta el momento todo muy funcional, es perfecta para tenerla en casa, imprime y copia muy bien, estéticamente es hermosa y era lo que necesitaba.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"good color printing very easy setup","reviewDescription":"like theeasy setup and the print workis excellant 5 star","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1720310400000}
{"reviewTitle":"Mobile and easy to use.","reviewDescription":"This printer fills my needs perfectly.  As a truck driver, I need a printer that will fit in my truck and travel with me. This printer fits and preforms.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1717804800000}
{"reviewTitle":"Don't be afraid to buy \"renewed\" products!","reviewDescription":"I had to replace my old printer, and I wanted functions (print, scan. etc.), but I didn't want to spend an arm and a leg because I don't use it that much.  I bought this HP 4152 All-in-one \"renewed\" because of the great value.  Renewed products don't come with user guides or manuals, so I went online and found a manual that I studied and studied so I would be completely familiar with the printer and all it's parts..  I also downloaded the HP Smart app (this is absolutely necessary!!) to my desktop computer to enable the set up.  Be sure to find the password of your wifi source...you will need to enter it.  The printer arrived and looked brand new......no dings, dents, no scrapes or chipped paint.  Using the HP Smart app from getting it out of the box to up and running probably took about  25 minutes.  Gone are the days of \"plug and play\" but  I thought it went very smooth (the only small bump was how to put the ink cartridges in their places).  I am NOT a 20 something tech savvy person.  I am an older woman, so if I did it so can you, it's all about preparation.  Am loving my new (to me) printer that is a wonderful value for the price!!!","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Low price big work","reviewDescription":"What you need from a printer it has for home use not heavy work","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"It is my first day with the print but working good I do update in a few days","reviewDescription":"Quality , easy to install","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Very easy to setup with wireless","reviewDescription":"Bought thus as a surprise for my wife and she loves it. It was easy to set up wireless printing and has greatly used. Couldn't be happier with our purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"So far,  so good","reviewDescription":"If you're into setting it up and figuring out how it works in your own,  then it's a good printer.  Has wifi capability that's useless without tech support which there is none as this model is no longer supported or made by HP. The app\/ site was helpful for minor adjustments but there will be no help for resolving any issues that may come up or wifi connection.  Even the refurbished company's tech support is a farse as no one ever responded to my email and the number provided didn't work.  Beware.  Luckily, I'm a bit tech savvy so I was able to setup and have it work properly on my own. I just plug it in to my laptop or phone and it works fine.  It wouldn't ever connect to the wifi, it kept coming up undetectable. It came with ink cartridges and now I'm having trouble finding the same replacements so now I have to search for others that may be compatible.  I ordered cannon cartridges that said they would be compatible but they weren't so now I'm stuck with them.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1663286400000}
{"reviewTitle":"Impresora","reviewDescription":"La impresora me agradó mucho trabaja muy bien ha cumplido con mis espectativas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Not worth it","reviewDescription":"Printer cartridges Are small and run out quickly. Are pricey","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"it works","reviewDescription":"took two days of working with tech support but since then has worked well","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657584000000}
{"reviewTitle":"I can scan, copy and print with it, its good for basic tasks.","reviewDescription":"I can scan, copy and print with it, its good for basic tasks.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"OH the pain!!","reviewDescription":"I tryed several times to set it up but NEVER got it to reconize my phone, negitive, Then wouldnt reconize my computer! I could only get it to work with the USB cable. Otherwise it works great!! Even the scan does awsome on printing!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1607990400000}
{"reviewTitle":"Instructions should have been in box with the printer.  Online help was very confusing..","reviewDescription":"The printer is ok, print quality is average, tech support is awful.I wish I had bought something else!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1655251200000}
{"reviewTitle":"Dry cartridge","reviewDescription":"The cartridge that it came with never worked it was used or dried up","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1648944000000}
{"reviewTitle":"Print quality and wireless printing","reviewDescription":"What I dislike is sometimes it prints wireless sometimes it don’t","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1655164800000}
{"reviewTitle":"This printer works but paper jamming in roller a lot","reviewDescription":"What’s goin on as paper jamming a lot in printer","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1657238400000}
{"reviewTitle":"That it was easy enough to work with my computer.","reviewDescription":"It is working well with my printing and scanning needs.  The paper carrying function is a little hard to get used to.  It seems it skips over paper a lot.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1615420800000}
{"reviewTitle":"Prints ok but took all afternoon to install","reviewDescription":"So far the printer works ok. But, this was the most difficult printer I have ever installed. Every time I thought I was done, it wanted me to \"install\" it.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1615939200000}
{"reviewTitle":"Do not buy","reviewDescription":"Installation really hard. Connectivity the worst. I have had to call HP help desk twice because printer won’t connect to internet. Once it connects it stops working after less than a month and I haven’t been able to connect because of error message. This is the first time ever I am leaving a bad review but I hope I can help someone from spending their money on something that is of bad quality.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Does not work through tether or WIFI","reviewDescription":"This was a Christmas present from my husband.  The printer will make copies of already printed papers but will not connect to WIFI even with compatible HP devices.  This printer will also not connect to tethered HP devices. It alway reads printer is unavailable.Disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1705795200000}
{"reviewTitle":"Awful customer support","reviewDescription":"This is the 3rd hp Printer I’ve purchased through Amazon in the last month. The first one didn’t work. The second never shipped, and this one came with instructions, however was unable to connect to my HP laptop. The instructions I received from Amazon stated to contact support with any issues. I contacted and was told since the warranty is not through HP they cannot help get the printer setup. Quite frustrated because this is the third printer I’ll have to wait on a refund for. And I’m tech savvy…so I promise it’s not that I didn’t do my own trouble shooting.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673913600000}
{"reviewTitle":"A POS!","reviewDescription":"It came with no information except a sheet showing it is an \"Amazon refurbished\" unit.  When you try to install it, it takes you to a driver site where they want you to sign to a $9.95 a month subscription. Try going through HP & you get a \"This unit is out of warranty\" flag.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700784000000}
{"reviewTitle":"*ABSOLUTE GARBAGE!","reviewDescription":"After just a few short uses (maybe 3 or 4 pages), the PRINTER STOPPED WORKING COMPLETELY -WITH ALL NEW INK INSIDE! Never have I ever spent so much time trying to fix such a useless printer that doesn't work. How SHAMEFUL! DON'T WASTE YOUR MONEY!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"The worst printer ever","reviewDescription":"This printer doesnt work at all. It printed once and since then all it does it tell me it doesnt have paper or just prints out blank paper. Troubleshooting doesnt help, restarting doesnt help, amazon doesnt help. Dont buy. Huge waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704326400000}
{"reviewTitle":"Poor Performance","reviewDescription":"Did not work.  Continued to show error messages that could not be cleared away.  This is a 400 series so not as good performance as later models like 600 or higher","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"if i could give a zero i would","reviewDescription":"This item comes with no warranty and therefore has no customer service help to link printer to wifi or a computer. There is no print or scan option with out customer service assistance.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Worst printer","reviewDescription":"Impossible to get connected to WiFi.  Either prints only color or only black.  HP Smart app was no help at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1712275200000}
{"reviewTitle":"Paper weight do not buy hp","reviewDescription":"This is the most difficult printer to use. And HP wants you to buy their own that is incredibly expensive if you look at how often you get ink. The app takes me hours to print anything and you can't do anything without the app. Mine started flashing and nothing I've done had fixed it. When you call they just tell you that you need to replace it. Cancelled the ink plan and put my own cartridges in it but it won't accept them.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1673481600000}
{"reviewTitle":"Works well for me","reviewDescription":"It literally took me 5 minutes to set up.All you do is plug it in. turn it on. download hp smart app. have your wifi ready.connect your wifi to the printer.It DOES take up a lot of ink.it DOES work with iphone.it does Prints beautifully.I did read the reviews and a lot of them were negative but I decided to buy the printer anyway because I really needed it, and I am really sorry that a lot of other people are having issues with the printer I hope that they have figured it out or will figure it out soon. but once you get your Wi-Fi and printer connected together it’s just as smooth as butter and I was able to print directly from my iPhone I could print from my mobile email, my mobile documents, my photos, it was very easy for me but maybe it’s because I’m a tad bit tech savvy I don’t know but it just worked for me.","isVerified":true,"ratingScore":5,"reviewReaction":"70 people found this helpful","country":"United States","date":1635552000000}
{"reviewTitle":"Súper práctica","reviewDescription":"Es súper fácil de instalar !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Just what the doctor ordered!","reviewDescription":"This printer proved to be exactly what was needed for my home\/office. Kudo's to HP!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1713571200000}
{"reviewTitle":"Muy buena,me gusta","reviewDescription":"Me costo un poco configurarla,pero con paciencia,lo logré, me gusta no es tan ruidosa,estoy satisfecha,espero me dure mucho.Solo la compre para uso domestico,cuando necesite  hacer algún trabajo,Así que  esta bien.Muchas gracias ..!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Muy bien","reviewDescription":"Es un buen producto. Cumple las expectativas","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Great","reviewDescription":"It's great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Easy set up & good quality printing","reviewDescription":"I don't actually have a computer but I was able to download the app and set everything up with my phone. Supper EASY setup.  Ink and paper auto track and send is AWESOME!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Great","reviewDescription":"Easy to setup and start printing. Prefect color copies as well. Comes with a set of print cartridges.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Good for the price","reviewDescription":"Had to download updates","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"good ink price","reviewDescription":"nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Ease of Use","reviewDescription":"Easy to setup and connect. Good print quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1686355200000}
{"reviewTitle":"Work for what I need","reviewDescription":"I use it for school and does the job just fine. Only issue I have is that I have to use the app from my phone to print and upload my papers onto docs because it won’t hook up to my laptop… other than that the quality is really nice and the printer is sleek.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1635465600000}
{"reviewTitle":"Looks like almost new","reviewDescription":"Runs well once I got it setup done. Instructions were vague , but I finally got it working with HPSmart Printing.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1679356800000}
{"reviewTitle":"My first refurbished purchase!","reviewDescription":"It is a bit slow for multiple page and two-sided job, print quality is great. Cost seemed too good to be true. Based on this experience, I will no longer shy away from refurbished items!","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1655683200000}
{"reviewTitle":"+","reviewDescription":"Great for $$","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1687305600000}
{"reviewTitle":"It was easy to set up and use.","reviewDescription":"Nothing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1688774400000}
{"reviewTitle":"Printer was fine but this seller Image Warehouse is garbage.","reviewDescription":"I purchased a refurbished model and it didn't last much past 40 days. But the printer was great up until then.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1669852800000}
{"reviewTitle":"Yep","reviewDescription":"I don't understand why you ask me to do this I don't like doing this I plugged it in and filed the simple instructions and plugged it into my computer it printed attaboy Wi-Fi is not working properly in the house and it wouldn't attach to the computer Bluetooth how's that","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1635033600000}
{"reviewTitle":"RETURN HANDELED OK","reviewDescription":"ALL OF RETURN WAS TAKEN CARE OF ,  BUT ONE PROBLEM  (I CANNOT PRINT RETURN LABEL THATS WHY I BOUGHT A PRINTER  PLEASE SEND COPY OF RETURN LABEL BY USPS (U.S. MAIL) AND PUT THRU MY TOTAL REFUND","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1645833600000}
{"reviewTitle":"Shipped fast, and undamaged with full instructions, on set up","reviewDescription":"Shipped fast, and undamaged with full instructions, on set up","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1679529600000}
{"reviewTitle":"Warning! SCAM","reviewDescription":"DO NOT BUY!After a few months it will LOCK your ink so you can't use the printer unless you give them your credit card number so they can charge you for new ink. Ink is full but it is electronically locked down. Total scam.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Total junk","reviewDescription":"Nothing ever worked with this printer and it was $85!!! Paper jams, ink goes out and only printed a couple pages ( barely due to ongoing jams) no way to fix and it claimed to be refurbished but it was total junk. Do not buy this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Refurbished but did not come the password","reviewDescription":"I have no idea how this prints because it did not come with a required password for installation. The instructions that come with the printer not only does not have the required password, but wants you to go to HP support- they want 50.00 to support your refurbished machine. Getting returned tomorrow, and starting to work on my Time Machine again because that is the only way I am going to get back the three hours I spent entering, downloading and guessing how to connect the thing to my wifi, searching for phone numbers and talking to people who were no help but appreciated my patience. I really want to throw this thing in the landfill while cursing. Have to wait 5-7 days to get my money back. Grrrrrr!!!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1669507200000}
{"reviewTitle":"refurbished","reviewDescription":"I purchased this in November thinking it was new.  Unfortunately it is refurbished.  I did not get a chance to open it until today, since it was during the holidays and I spent a significant portion of the expiration window out of town.  My fault that the return window expired.  When I just looked at one part of the order, it specifically says \"refurbished\" but in another part it says \"new.\"  Moral of the story, open the box even if you're not going to be able to install it right away, otherwise you might end up with something you definitely do not want.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1680307200000}
{"reviewTitle":"Deja de funcionar","reviewDescription":"El llegó y funcionó de lo más bien, luego dejó de extraer el papel por algún motivo no lo jala, luego de pedir el reemplazo empezó a funcionar de nuevo y dije bueno lo intentamos cuando pasó el tiempo del remplazo dejó de funcionar otra vez, 😒 no llegue ni si quiera a imprimir 20 hojas.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1708041600000}
{"reviewTitle":"This is the last HP Printer I will buy; \"InstantInk\" is a nightmare figuring out how to turn it OFF","reviewDescription":"HPs \"Instant Ink\" is an idiotic program that tries to force you into estimating how many pages you will print per month and then selling you a contract based on that with a monthly fee so they can \"help you\" and send ink before you run out.  No manual and no printer driver either, both required to be online to try and find.Worse, the \"Instant Ink capable\" cartridges that come with it were both 2\/3 full after I took them new out of the sealed package AND there was NO red in the color cartridge.  I started the process of returning it based on the 1\/3empty \"NEW\" cartridges but the 3rd party additional cartridges I had already both worked absolutely fine, included the color red and were full.  Printer is fine. HP sux arse.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1661817600000}
{"reviewTitle":"This was \"out of warranty\" according to HP","reviewDescription":"When I tried to register the product, HP stated this printer was out of warranty - over a year and a half ago! I told them I JUST got it. They didn't know what to say. The colored ink wouldn't work properly. It wouldn't print red, so I bought a new cartridge. It worked, until about the 7th page and it started getting lines through the blue and fading. SCANNER DID NOT WORK. It was also flimsy, overall.  I purchased a different one, that would use the same ink, on sale from Staples. Hopefully this one will work.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698278400000}
{"reviewTitle":"Will not pair with android smartphone","reviewDescription":"I purchased two of these. The first one had a faulty cartridge receptor, so I returned it and bought another with a little higher model number. That one connected to the internet but would not complete the setup process with my android phone. Therefore, it would not print.  I spent two hours on the phone with a tech person who could not help me despite her very diligent efforts. Perhaps this would work with a computer or an iPhone, but it was a total bust with my android. I will stay away from HP in the future.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"I’d give 0 stars if I could, it will NOT stay connected to wireless network to print….and if you print an info sheet to see what the problem is, it says ‘connected to network’ in one spot and ‘not connected to internet’ in another spot….makes no sense….oh and HP support is an absolute joke, it was NO HELP at all….this is my 2nd HP printer to fail like this, I’ll never go with HP again","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Not worth the money spnt to puchase it - hasn't worked properly since day one.","reviewDescription":"This printer is the most worthless thing I have ever bought. It has not worked properly since day one.  It won't stay online and the scanner will not work. Every time I want to print something I have to run the trouble shooter which never finds the problem so I have to search the Internet to see if I can fix the problem which can take hours, sometimes no fix to be found. I have bought several printers over the years but this is th last HP Printer I will ever buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"HP Printer 4100 Series","reviewDescription":"Hard to connect to the internet.  Only holds about 20-30 pages of paper in the feeder.  Not a bigger screen to see what you are doing, not what I really expected when I ordered it.  Not really satisfied.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1672444800000}
{"reviewTitle":"Couldn’t get it to work","reviewDescription":"Printer wouldn’t recognize the ink cartridges and couldn’t connect to the Internet","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1685664000000}
{"reviewTitle":"So so printer already malfunctioning","reviewDescription":"Bought this printer less than a year ago & it is already malfunctioning","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682035200000}
{"reviewTitle":"Problem","reviewDescription":"This has only worked once. Has been not able too connect to WIFI. Junk!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682380800000}
{"reviewTitle":"very hard to set up","reviewDescription":"could not find a way to talk to someone.  no installation instructions came with.  Still can't figure out why it works sometimes and not others","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674864000000}
{"reviewTitle":"Printer sold without Color setup cartridge!","reviewDescription":"Printer sold without Color setup cartridge Cannot contact HP for receiving one as  \"Product out of warranty message\"! Printer will not work without first using setup cartridges.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667520000000}
{"reviewTitle":"Excellent. except....","reviewDescription":"Unit comes without any paperwork. You have to go on line to find out simple things, like how to load paper. Tech support are all heavy-accented off-shore people who you can't understand.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1667692800000}
{"reviewTitle":"Setup sucks","reviewDescription":"It prints well, but the setup is a horrendous ordeal. I never could get the app on my phone to work or get wireless setup to work on my pc so I had to use a USB connection. The USB cord is so short that I was not able to put the printer in my preferred location. I still can't figure out how to scan things. I guess I'll just have to be satisfied with printing and copying.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1630713600000}
{"reviewTitle":"Faulty paper feeder","reviewDescription":"It has all the features I wanted but...... the paper feeder just doesn’t work.  It will not print. Nor can I scan. You have to have an app to link it to computer for scanning. I have watched all the videos and had several techies try to get it to work. No go. I will have to return it. What a headache.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1621900800000}
{"reviewTitle":"Super Slow","reviewDescription":"This printer takes so long to print just one page of black and white. I don't know if it's worth the wait. If you need anything with more than one page, you'll be waiting for an hour it seems.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1659312000000}
{"reviewTitle":"Wifi Light is not on","reviewDescription":"","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668816000000}
{"reviewTitle":"Printer won't print","reviewDescription":"The printer won't print.  I spent money on this printer for nothing","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1643328000000}
{"reviewTitle":"Hard to work.","reviewDescription":"VERY difficult to set up!!!!  Took two days to get it working well.  No instructions, only to install HP smart app which was fairly useless.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1632009600000}
{"reviewTitle":"difficult to connect to the network.","reviewDescription":"It is very hard to connect to the network. You will need to buy printer cables.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639267200000}
{"reviewTitle":"Obtaining a user manual","reviewDescription":"Confusing poeration","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1657497600000}
{"reviewTitle":"Great Basic Printer","reviewDescription":"This was a replacement for a printer that failed (2 year old actions not the printers fault). So far it seems great for the price, but don't expect to print something quickly.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1624320000000}
{"reviewTitle":"description 0n amazon was not clear---wanted a black only printer","reviewDescription":"not like==small cartridges  and price,  how can a recycled one be only a few $ cheaper than new","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1639094400000}
{"reviewTitle":"had problems-no scan, no copy","reviewDescription":"returned-  functions not fully working. no manual and i don't have a smart phone to scan a square","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626998400000}
{"reviewTitle":"Be sure that you know what you want a printer to do before you purchase one.","reviewDescription":"It had no operating instructions with it.  Will it print double sided? I consider it a no embellished printer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626739200000}
{"reviewTitle":"It’s refurbish so I have to wait","reviewDescription":"Refurbishment","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1660089600000}
{"reviewTitle":"Item is not open yet but it is a used one and I have ordered a new one","reviewDescription":"Order is different than what I asked forI needed a new one that's what I paid for  not a used one","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1656201600000}
{"reviewTitle":"Slow to print from phone.","reviewDescription":"Slow to print from phone. It prints extremely slowly. Set up was a bit of a head ache. The scanner does print gas but immediately has a bit of a fade.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649721600000}
{"reviewTitle":"Not working","reviewDescription":"It's not working I would like it replaced it's for school","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1668211200000}
{"reviewTitle":"Information light stays on all the time, uses ink fast too.","reviewDescription":"Set up was difficult at first, then could not get the red information light to go away. No digital information display. It seems to go through ink quickly too.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645660800000}
{"reviewTitle":"Where is the printer ink that is suppose to come autmatically that is required to sign up for","reviewDescription":"As of right now the head on the black toner is broken....I am really low on ink on 2 other cartridges and NO black ink","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648771200000}
{"reviewTitle":"Have to be online to use","reviewDescription":"print quality is good you have to be online with hp smart to get full advantage of this printer will not work offline was kind of disappointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1645833600000}
{"reviewTitle":"Works great but...","reviewDescription":"Run out of ink way too quick. I printed less than 25 papers and the ink was gone. Easy to set up! works great!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648252800000}
{"reviewTitle":"There was no good documentation to set up the printer.","reviewDescription":"The documentation was not good. So it has yet to be used and therefore I am not able to give it a review.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1646697600000}
{"reviewTitle":"Works okay","reviewDescription":"Thought it would do more then it does but I guess you get what you pay for so is what it is.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649289600000}
{"reviewTitle":"Include instructions","reviewDescription":"n\/a","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1675987200000}
{"reviewTitle":"More  INFO","reviewDescription":"Printer setup needs more  info to complete","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1706227200000}
{"reviewTitle":"Problems changing to new router","reviewDescription":"Changed my internet carrier. Forgot to to change printer to it before I cancelled last provider. Turned off printer for the night, then re-activated printer to new carrier. The printer it self works great for me. Prints everything I need from iPhone.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1693353600000}
{"reviewTitle":"Slightly complicated setup","reviewDescription":"The instructions for this printer say to open the HP Smart app, and set it up through there.  The problem is, if you do this, you will not see the printer on the list of supported printers.To get mine set up, I had to use the Windows version of the HP Smart App. Even on windows it did not show up on the supported printers list, until after I connected to the printer with a USB cable and installed the usb drivers. I then had to hold the Cancel and Wifi buttons for a few seconds until the power light flashed, and it finally showed up in the list of printers to set up for wifi.  (Yes I tried this before resorting to installing the usb drivers, but it never showed up in the list of printers ready to set up for wifi.)This long setup would be inconvenient for people that want to print from tablets or their phone or whatever.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1622332800000}
{"reviewTitle":"Wifi Not Required","reviewDescription":"Truly free of Wifi requirements. Use hp123 for setup and installation without WiFi and are not interested in auto delivery for ink. Prints and copies nicely with no discernible difference between the original and the copy. Seller included universal cable cord for wired connection. Another feature I like is that the control panel is at the front for maximum visibility instead of the side. All other printers I tried this year were defective regardless of brand, model, and seller and required WiFi for setup and installation. I am happy to have found the HP 4140 and an excellent value at $65 with a 90-day warranty.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1671753600000}
{"reviewTitle":"Nice","reviewDescription":"","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Simple setup.","reviewDescription":"Gave this product as a gift for an office.  He is very pleased with the features and ease of operation.  Likes the sleek design and color.  Great price too.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1693267200000}
{"reviewTitle":"No regrets","reviewDescription":"This has been a great product for me. I’m very happy! I’ve had this printer for a while now and I have found a concern. I’m going through black ink way too often. This is just a printer used for small home use. In the short time I am already on my 3rd black ink cartridge. My old HP I changed my ink every year  or so. Usually had to change because it just dried up.  Not liking this issue.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"Easy to set up","reviewDescription":"So far has done a great job. No problemsWas 3 days late so only 4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Still not wirelessly connected. HATE HPsmart app.","reviewDescription":"I did not know that HP smart app doesn't support Windows 8, and there is no drivers for me on hp.comSpent the money to upgrade my laptop to Windows 10. Yet, the process is maddening and am not wirelessly connected.The printer itself is nice. Not huge. Works.Don't feel the black and white print outs (no photos\/images) are sharp.My PC tech says HPsmart is @RAP,  and so are most printers LOL. An EPSON I should have bought.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1679702400000}
{"reviewTitle":"Falta cartucho negro","reviewDescription":"No llegó la tinta negra y solamente imprime en colorFavor enviar el cartucho negro","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1696723200000}
{"reviewTitle":"Mal inversion","reviewDescription":"No funciona bien se tarda mucho","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1671580800000}
{"reviewTitle":"Broke after purchase but exchange was easy","reviewDescription":"Product broke three weeks after purchase but one call and exchange is on the way!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658102400000}
{"reviewTitle":"Frustrating","reviewDescription":"Printer has to be close to wifi router to work. It's like pulling teeth to print one page. Printer will not connect alot of times.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1632528000000}
{"reviewTitle":"Not what I expected","reviewDescription":"I am not happy with this  HP at all in one printer. It is not what I expected. I do not like it. I might just send it back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1628380800000}
{"reviewTitle":"Document Feeder is Terrible","reviewDescription":"The document feeder is supposed to handle up to 35 sheets, but realistically only handles 5 sheets (without error). I purchased this to save time....lmao","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1646611200000}
{"reviewTitle":"Old software","reviewDescription":"The printer software is not compatible with my computer so I cannot scan but it prints  and I can make copies","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1634860800000}
{"reviewTitle":"Replacement ink costly.","reviewDescription":"Instruction book not very helpful.  They can give this printer away since replacement ink will be costly.  I use this on my wife’s computer for occasional printing only.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1643414400000}
{"reviewTitle":"It’s cheap","reviewDescription":"Like:1.  It’s cheap2.  Good emergency printerDislike1.  Won’t print envelopes2.. Terrible two sided print routine","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1647820800000}
{"reviewTitle":"keeps failing to print","reviewDescription":"keeps failing to print","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1662422400000}
{"reviewTitle":"Not really happy with this printer","reviewDescription":"It was VERY difficult to set up and we are still not sure we are keeping it. Seems cheaply made.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1648684800000}
{"reviewTitle":"An okay printer but think it’s not worth the price.","reviewDescription":"I bought a refurbished, “like new”, printer. Everything works like it’s supposed to, it was easy to set up, and it’s easy to print from your phone through a Bluetooth connection I was still only semi satisfied with my purchase. This printer arrived DIRTY! As it’s white it looked awful, almost like a mechanic who hadn’t washed his hands handled this printer before it was packaged. It prints decent quality but it uses tons of ink. Only about 30-40 pages were printed, only 25 of those were color, and in black, white, and a sepia brown no less, and we already need new cartridges. I also am not a fan of the fact you can’t print just black and white if the color cartridge is low. Overall it’s just okay.","isVerified":true,"ratingScore":3,"reviewReaction":"86 people found this helpful","country":"United States","date":1609977600000}
{"reviewTitle":"Wish I had my old printer back","reviewDescription":"The HP DeskJet Plus 4152 has not been a success. I am in the process of trying to figure out how to fix a problem that started within 48 hours: after the printer has been on for about an hour, whether or not it's been printing, I get 4 flashing lights and an E1 message.  Every damn time I unplug it, plug it back in and it works fine for 45 minutes.  Such a pain.Also, I do not like the paper feed that sticks up at the back; with my home office set up, I have to tug the printer forward about a foot every time I need to replenish the paper.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1632614400000}
{"reviewTitle":"Refurb","reviewDescription":"After 5 hours I think I finally got everything to work. They seem to make it harder or I can’t figure stuff out as easily now.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Works fine if your device is compatible","reviewDescription":"Printer worked fine but in the end I could only get 1 of my 4 devices to actually print to it. Said my phone was incompatible with HP Smart. Two other Android devices would load the app but either couldn't find the printer or if it did would just sit there in limbo when you tried to print. The only device that I got to work was my Windows 7 PC. Returning and going to a try a different manufacturer that does a better job with their software.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1650585600000}
{"reviewTitle":"Missing","reviewDescription":"Missing power cord!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Unnecessarily Complicated","reviewDescription":"Literally I just want to print shipping labels on shipping label sticker paper. It automatically “recognizes” your paper size based on the type of paper. Why? Just let me choose my paper size & print. I had to (complicatedly) find my printer settings (which is a head ache) to adjust what type of paper = the size of paper. Ended up figuring it out.If your using it for shipping label sticker paper, you have to adjust the “large” section to size: letter 8.5x11 & paper type: specialty paper, matte & all the other paper sizes (small & medium) to plain paper.Sooooooo unnecessarily complicated!!!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1630108800000}
{"reviewTitle":"A bit disappointed","reviewDescription":"The print quality was good. I was not a fan of the software and the printer stopped working 1 1\/2 year after purchase. Bought a Brother printer and I am much happier with it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1679011200000}
{"reviewTitle":"Bad connectivity","reviewDescription":"trying to connect to wifi is terrible.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Spend the money","reviewDescription":"I needed a replacement printer and I wish I would have spent more. I have to power recycle after every print job and it won't connect for instant ink. I love hp products but I have yet to get support with the service and will end up replacing.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Watch before you buy","reviewDescription":"I am a bit disappointed because when I was searching for printers, I put NEW in the filter. I didn't realize until I opened it that it was refurbished. It seems to work so far, the colors aren't the greatest. hoping I won't have any issues.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1661126400000}
{"reviewTitle":"It's never been quite right","reviewDescription":"I bought this printer in the fall of 2020 when I needed a printer for the house. Sometimes it's used to print one page per month; sometimes 20-30 pages at a time. You know, the way normal people use printers when not running a business.The setup was as easy as following the steps in the top review, the problem was that it just never worked that well. I've spent hours troubleshooting and never got it to print a nice, lined up, page. Whether I'm printing out a calendar or 20 pages of text, it's always a little off. That's not super enjoyable and every time I tried to realign to fix it, I ended up making things worst.A year and a half later, I'm shopping for a cheap, dumb printer again. I tried to reset the printer and try to start over and now it won't even connect to wifi. I'm over it.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1647043200000}
{"reviewTitle":"Will not print everything, drops letters at random","reviewDescription":"After working with this printer for a while I noticed it will not print everything, example Zoning turned into oning. It just randomly drops letters which puts it down to a no star review. Using my old printer everything comes out fine. Gave it 2 stars because the scanner works good but the printer is a solid no stars.Price was great but since it does not work properly it get a 2 star rating, would not buy it againAfter working with it more I dropped it to a 1 star review","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"Not good product","reviewDescription":"Was hard to get set up on my computer and then paper started jamming","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"No la recomiendo","reviewDescription":"No se que hacer no concerta mas que intento llevo 3 horas intentando de todo se supone que es la mejor pero es una lata 🙃 no la recomiendo si no tienes laptop 💻","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"I Don't Recommend Purchasing Returned Printers","reviewDescription":"I purchase this printer be cared I trust Amazon.  I've bought refurbished\/ returned terms from Amazon before with no issues.  This time was not the case.  When I took the printer out of the box I noticed there was no USB cord but I though I'd just use the old one.  I opened the scanner and found someone's school document with personal information.  I immediately suspected the printer had not been checked to see if it worked before sending it to me.  It was low on ink and the printing quality was terrible, and it was very slow to print.  After printing the second page, the printer disconnected from wi-fi and I could not get it to connect via wi-fi or USB.  I needed a printer so I went to a local retailer.  I found a newer version of this same printer for half the price, brand new.  I do appreciate how easy it is to return items to Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1621987200000}
{"reviewTitle":"Not worth the money","reviewDescription":"Very little use…stopped working after just over one year.  Possibly used it 5 or 6 times. DO NOT RECOMMEND…","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Very difficult to troubleshoot \/ Ink cartridge not working right","reviewDescription":"Initial configuration went ok.Used it for a 2 months, and then it suddenly went offline.It took me hours and MANY attempts to get it back online, after which it gave me another error code.After more wasted time, I was able to fix that too. Now the printer status says it's online and no longer gives me an error code, but it's still NOT PRINTING.VERY DISAPPOINTED IN THIS MACHINE. Feel like I wasted my time and money on it.On top of it all, the ink is not printing right; I tried a whole lot of solutions, nothing really helps.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Unhappy","reviewDescription":"Hard time to connect to phone and iPad.  Really Disappointed. It printed once but nothing was on the paper. Do not recommend","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"the printer stopped working","reviewDescription":"When selecting the print option a  note pops up on my phone telling me that the  option isn't available.  At the same time an icon appeared that allowed me to print.  Where did the icon go, and why did the printer stop working?","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Don't waste your money.","reviewDescription":"Like most modern cheap printers, this is garbage.  Don't print much?  Great, you'll still get to buy ink when you eventually need to, since it lets the ink run out.  Don't worry, HP will try and sell you on a subscription plan.  Pay for ink and have it ready, whether you use it or not.One redeeming quality, it still works after kicking the front of it multiple times, though your mileage may vary.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Easy to install & prints clearly","reviewDescription":"This printer is simple to install and use from multiple devices.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1711411200000}
{"reviewTitle":"Excelente artículo","reviewDescription":"No rinde mucho la tinta, pero es buena calidad de impresión","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Happy that I took a chance!","reviewDescription":"I needed a printer fast as mine was having problems and took a chance on a Refurbished model.  When the printer was delivered and I opened it, I was pleased that it was professionally packaged, looked brand new, and had all manuals enclosed.  The printer,  being an older model and very basic, was easy to set up, and works like a charm!  Excellent Seller!","isVerified":true,"ratingScore":5,"reviewReaction":"5 people found this helpful","country":"United States","date":1688428800000}
{"reviewTitle":"Fast and easy set up was almost automatic.","reviewDescription":"Always trusted HP and never fail.me. This was almost an automatic set up, quick and easy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Good price for a printer that does multiple things.","reviewDescription":"I needed a new printer my old one broke. The only issue is that the connecting was hard to get wifi right way and its slow when printing in color.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"PrinterHP DeskJet4100e","reviewDescription":"Good quality print easy to operate, good product for for a low cost.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1707436800000}
{"reviewTitle":"Great value","reviewDescription":"This is a great value for the money. It was easy to set up and is user friendly. It does not take up too much space.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1705276800000}
{"reviewTitle":"like","reviewDescription":"Works well, very nice model","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Super fast for an inkjet printer - set-up was a snap - about 5 minutes","reviewDescription":"I bought this printer for a friend; he doesn't use the printer much, so I wanted something that was inexpensive, yet easy to use.  This printer exceeded my expectations - it is faster than my own laserjet!  Setup was easy... HP directs you to a URL where you download the correct driver (you don't have to search for it - the link is for the exact driver that you need)...set up took 5 minutes.  Print quality is good... I haven't tried the color printing yet.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1663113600000}
{"reviewTitle":"Unknown title. Not enough space for title of own own","reviewDescription":"The dislike was not much he was the idea that he did not tell me whether it came from with ink or not and it did not come with a good warranty there's no idea whether or not it will work or not I've been in the hospital so I've not had a chance to try it out the warranty that it came with was not a good one sheet and it doesn't have very much in the ink Department for the price I want to set it up to where I can get those ink but like I said I'm in the hospital and the instructions are confusing otherwise I like the look that's about all I can tell you I've not used it or turned it on yet","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1625356800000}
{"reviewTitle":"I Love It","reviewDescription":"It looks and Works great. Good print quality and printing speed. I would, however, change one thing and that is the paper feeder. I find it difficult to load and, if the table or printer get pushed out knocked back, it bends the paper and may cause a jam.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1685923200000}
{"reviewTitle":"Worth a buy","reviewDescription":"Good for the price. A bit slow print but it works well for my purposes.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Two Issues of Concern","reviewDescription":"The Bluetooth control is not very user friendly and the absence of a full local control panel is a pain. It consumes print cartridges faster than any ink jet I have ever seen. On the plus side, the print quality is excellent. I'm not certain if I would purchase this printer again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1678838400000}
{"reviewTitle":"Hp Printer","reviewDescription":"It works for our providers office. Scans, copies, & prints. Not a great printer to print many copies as it runs out of ink quite fast. It works for the few things needed. We need a scanner often to send emails so helps with that mostly.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1683590400000}
{"reviewTitle":"Nice little printer scanner copier.","reviewDescription":"I really like the HP ink club auto refills ink, but only when you need it the ink cartridge's have a link to the WIFI which notifies HP when low or just the level of ink my printer. my printer  came with some ink but smaller cartridges so very little to start. I joined the ink club and when the ink ran low I received new ink right on time as a plus the first delivery of ink was free","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1665273600000}
{"reviewTitle":"Great printer but gives you a headache at times because it freezes","reviewDescription":"To set this printer up was horrible. It took me three hours total and walking away twice. However once I finally hooked it up it works well. It prints at a nice speed and is not loud. HOWEVER it freezes a lot if you send to many documents to it at once. I sent the printer three documents that were each two pages and it just would not print them or do anything. So I unplugged it from my computer and plugged it back in after deleting my printing que. it seems you should only print one thing at a time","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1643846400000}
{"reviewTitle":"Printer","reviewDescription":"Received the printer well packaged and looks almost new. Of course there were no instruction manuals with it so just had to wing it. Also had the cables with it. Was fairly ease to set up and it is slow but for a home office , that is OK. Overall like the printer, would have liked a manual with it but will live without it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1677024000000}
{"reviewTitle":"Simple and nice printer but needs outside app","reviewDescription":"We really only needed super basic printer and this satisfies all those needs and is in compact design. But has no buttons on device for scanning all must be done through hp app. Which if you have problems downloading like I did makes scanning documents pretty impossible. Once I get app to work I will update but as for print quality and copying works great","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"This thing can be a pain but I still enjoy it quite a bit","reviewDescription":"Not meant for big printing jobs but if you need to print a few things out here and there and scan for faxes and things it’s great for that also prints photos and prints from my phone very easily. Easy to use even for a first time printer owner like myself.","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1683417600000}
{"reviewTitle":"Works Great!","reviewDescription":"Needed a new cheap printer for college since the one gifted to me didn't print any ink. This printer is great and easy to set up. All you need is a decent wifi connection (I used my phones hotspot cause college), the hp smart app which is easy to download on either your phone or laptop, and the printer automatically connects. I love this thing works great and gets the job done!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Scanner Feature","reviewDescription":"I needed a printer & scanner in a different location, just trying to pick up something inexpensive.  Only feature I don't like about this unit is the scanner.  It should be a simple press of a button on the printer to scan something.  But it's not!  It's this silly HP software that you have to download, open up and click, click to get it to scan documents.  Frankly, I think it's a pain and unnecessary technology and time consuming.  there is a simple button on printer to \"copy\".  I don't understand why they wouldn't have a simple button to \"scan\" on the printer, like my Office Jet Pro 8710.  I wouldn't buy this printer\/scanner again.. I like simple and easy and less technology & software.  But print quality seemed good.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1658361600000}
{"reviewTitle":"problems","reviewDescription":"This does not come with any detailed set of set up instructions.  It wants you to go to an HP web site.  I have had HP printers\/scanner for years, so HP recognizes my email but doesn't accept my password and I have not been able to get this set up so I can use it.  SO FRUSTRATING.  I need it for scanning and can't get it to either print or scan with the direct wired connection between the printer and the computer.  I can't even tell from looking which buttons to push for scan or print or copy.  VERY UNHAPPY.  It looked like a good deal but for me so far it is unusable.  I have had it a few weeks.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1666742400000}
{"reviewTitle":"HP is garbage","reviewDescription":"They brick your printer is you don't use their overpriced ink cartridges. This is my last HP printer. I'm done.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707955200000}
{"reviewTitle":"Pesima","reviewDescription":"La verdad que pensé que era nueva la impresora con un buen descuentos, resultó ser reemplazada y además imprime pésimo en colores azulosos y mala señal de wifi, arrepentido de esta compra","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"SLOW","reviewDescription":"iF YOU WANT A PRINTER THAT MOVES LIKE MOLASSES THEN THIS IS THE PRINTER FOR YOU","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1706486400000}
{"reviewTitle":"Had a hard time setting it up and had to contact support.","reviewDescription":"Had to contact support to get it set up and then had to connect it to the computer so no wireless.  They sent two black cartridges but one isn't for my printer.  Fortunately, I had ordered an extra color so was good to go.  They asked for my address so they could send me another cartridge but I never received anything. After a couple of weeks, all I can  say about this company is that Amazon should not let them sell as they are rather shady.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1686441600000}
{"reviewTitle":"I can't get it to print my stuff- It works okay when it wants to test print,","reviewDescription":"I love the printer, which is why I replaced the one I had before.  But not getting it to work is frustrating.I can't get it to print my stuff- It works okay when it wants to test print, but when I try to print, it will not work.  It is something that needs to be corrected, but I can't find out what to do, so it is taking up my time, trying to find it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Not the best printer.","reviewDescription":"The printer is very slow. Use a lot of ink. Would not recommend.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Misleading, disappointed  DO NOT RECOMMEND","reviewDescription":"NOT RECOMMEND! You HAVE\/MUST  subscribe to HP print in order to print. This is the dumbest thing I've heard HP has monopolized how in the privacy of your own home you can print and how much. And before you can print the printer prints two sheets in color with a printing status report. I could not returned it because by the time I set it up the allotted return time had expired.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679875200000}
{"reviewTitle":"Worked Great for 4 Months then no black ink printing","reviewDescription":"I have tried everything and after only a few months (purchased Jan 2023) black will not print. I believe it is actually an expensive part needed, as none of the suggested trouble shooting fixes it. Other colors stil print - it is only the BLACK. So, too much money ($80) even though this is a cheap printer. I am not happy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693353600000}
{"reviewTitle":"Couldn't connect wireless printing","reviewDescription":"As above","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1654992000000}
{"reviewTitle":"Hard to set up","reviewDescription":"It was tough to set up but tec suport was great","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1629849600000}
{"reviewTitle":"not user friendly","reviewDescription":"Setup was difficult, always go offline, printing is very slow and quality was so so. Not recommended.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1621641600000}
{"reviewTitle":"Hard to do printing wireless","reviewDescription":"Don't like the over all quality","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1648252800000}
{"reviewTitle":"missing parts?","reviewDescription":"It didnt come with a power cable, but did come with 2 tricolor and 1 black in cartridges.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1617321600000}
{"reviewTitle":"too Expensive","reviewDescription":"Works fine but costs too much","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1633305600000}
{"reviewTitle":"small and slow","reviewDescription":"It is okay for a $100.00 printer.  Youi get what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1620086400000}
{"reviewTitle":"Not wonderful but okay","reviewDescription":"No paper tray just holds a handful of sheets'......","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1626912000000}
{"reviewTitle":"Too many issues","reviewDescription":"Constantly breaking down during the first day of use.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1613433600000}
{"reviewTitle":"It’s a little slow but works for the minimal amount of printing I do.","reviewDescription":"It’s slow but does an adequate job.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1627862400000}
{"reviewTitle":"Nice for the price","reviewDescription":"For the price it's a decent basic printer, 9 out of ten times it prints totally fine, but I have had a smeared place for no apparent reason randomly a couple times. My main dislike is it doesn't print duplex but for the price I knew that going in. I got mine refurbished so I'll update if things change.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1663804800000}
{"reviewTitle":"Documents are great","reviewDescription":"Prints documents great, but what printer can't? But is poor with pictures. the old $30 cannons were better with pictures. pretty easy on ink so far. The scanner is amazing with scanning pictures. but kind of creepy that you need an account with HP to actually scan. haven't used the document feeder or fax yet.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1670284800000}
{"reviewTitle":"no directions","reviewDescription":"I was a bit difficult pairing with my computer and router.  Directions were very hard to find but eventually I did find and print the few pages I needed to connect.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1674950400000}
{"reviewTitle":"Por el precio es justo no es tan cara tiene su funciones scanear,copiar y imprimir .","reviewDescription":"Pues me gusta el precio,la cálida de impresión es buena , soporte muy buenos ,fácil  de instalar . Lo que no me gusto es que estaba trabada cuando use para copiar y igual para escanear, pero se pudo arreglar .","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1674518400000}
{"reviewTitle":"Lacking in intuitiveness","reviewDescription":"It works well. There is nothing intuitive about the buttons or screen on the unit itself.You have to download the driver which then makes you sign up for a (free) HP account. I realy just want to print and scan 3 pages a year. I don't want an HP account.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1659398400000}
{"reviewTitle":"How I got my printer to connect to wifi.","reviewDescription":"I had purchase this printer a few weeks back just unbox it. I am not a tech person. This took me almost an hour to get it to work but thanks you tube. Firstly the printer comes with no USB cable or instructions. I have the exact printer different model number. Deskjet 4100 is what I have. Connecting this with your windows 10. Press the wifi button on the printer and Press the Wps on your router. Also download the Hp smart app from the app store. Open that app and press add printer it will search for the printer. Once connected to the internet. Add the printer continue to follow the steps. Hopefully it works.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1620691200000}
{"reviewTitle":"Works fine, but no printed instructions","reviewDescription":"This is a remanufactured printer, which is probably why there were no instructions included. Although I don't know if a new one would have had any either, but probably at least a quick start guide. It works fine. We direct connected it with a cable until we can figure out how to set it up on WiFi.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1658793600000}
{"reviewTitle":"Like new","reviewDescription":"It’s in great shape. No Instruction manual but everything is on line.  It’s not the best HPPrinter I’ve owned and for that reason I’mGlad I bought reconditioned.  It works well. No issues at all.  Like new.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1665100800000}
{"reviewTitle":"Works great","reviewDescription":"It took a while to get it running but now it works good. I haven't been able to use all of it's features yet!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Impresora HP","reviewDescription":"la calidad de la impresión no es muy buena. El primer equipo que me enviaron no lo pude configurar a mi MacBook porque arrojaba un error. Además no puedo escanear porque parece qué hay una incompatibilidad entre la impresora HP y el computador MacBook Air.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1659744000000}
{"reviewTitle":"Printer","reviewDescription":"Aún no lo he probado solo hice la hoja de prueba y salió en perfectas condiciones","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700697600000}
{"reviewTitle":"Free Ink, NOT","reviewDescription":"I was pleasantly surprised when I opened my printer and found a black and color ink cartridge.Apparently though both were old\/dried up because the printer would not recognize it had ink. I removed and reinstalled both ink cartridges a couple of times.It’s a good thing I had ordered ink. Once I installed the new ink the printer worked fine.I wasn’t expecting ink but since you did send it you should send new ink or none at all.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1685232000000}
{"reviewTitle":"Not easy to set up.","reviewDescription":"I needed a printer for occasional use at home now that I am retired.  When setting it up, I found that the \"agreement\" was way too lengthy and not clear as to the difference between a personal user and a business user.  When I finally got to the actual setting up of the printer it was fairly fast, except that there weren't any instructions on how to insert the ink cartridges.  It took me a long time until I finally got them inserted correctly.  The picture on the printer that was showing the way to insert the cartridges was way too small to see easily and didn't show clearly how to insert them.  I've found that often I have to press the print button twice before a page will print.  Other than that I like the looks of the printer, which is good because it is right in my living room.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1631750400000}
{"reviewTitle":"quality","reviewDescription":"May return, does not feed paper right. Loads 2 pieces of paper at times and feeds crooked most of the timePaper comes out crooked all the time.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"return not a problem","reviewDescription":"printer came professionally packaged all parts complete. Installed and was able to print no problem. The issue with this printer the digital display widow which indicates what function you want or use will not illuminate. Even in daytime hard to see impossible at night. I knew it was a gamble but have now ordered a new printer from Amazon. Their return policy is the best. Never have a problem returning anything.  That is the main reason i stick wit Amazon. Thanks","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1674086400000}
{"reviewTitle":"Hard to install...","reviewDescription":"Printer itself is fine but it took over an hour of repeatedly installing the setup software to ever get my computer to operate the printer wireless.  The printer was recognizing the network but the HP install software would not recognize the printer.  I finally got it install but it was very disappointing that it was hard to get installed on my Win7, SP1 system.Once I was able to get the system to recognize the printer it works as expected. My previous HP wireless printer was simple to setup when to this distaster of a setup as the setup would constantly hang up when I opted of the haressing ads options.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1654819200000}
{"reviewTitle":"No papers with the printer.","reviewDescription":"There was no \"quick setup\" document enclosed.  It would have saved me several hours dealing with HP Smart.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698105600000}
{"reviewTitle":"Humm","reviewDescription":"Very hard to setup instructions quit small and hard to read","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697414400000}
{"reviewTitle":"3 color ink in 1 cartridge...","reviewDescription":"...Is sign of a cheap copier. Ink won't  last.  Top-feed is cheap too. I like enclosed tray feed, and 3 separate color cartridges.Get what you pay for. I generally like HP, so I returned & bought a 6978 model which had features I was expecting. Cost $100 MORE. But got 4 year warranty too. Total was just under $200, . Will last for years! No deductible on warranty too. Get ASSURON Warr 4 sure!LOVE AMAZON PRIME SO EASY TO RETURN THIS FREE AND GET WHAT I WANTED. VERY HAPPY CUSTOMER. AMAZON CUST SERVICE AWESONE- SAUCE! THANKS))🖨👑🏆🎖🎇","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1649548800000}
{"reviewTitle":"Slightly disappointed","reviewDescription":"I bought this printer for work because my job did not provide me with one. I didn't read all of the features and found out the hard way that it does not have automatic double sided printing. I was printing a 75 page document 😒. That took majority of my time because you have to do one sheet at a time. Then the ink runs out too quick. Is their a setting I can use to save ink? I was really upset with having to purchase ink so soon.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1660608000000}
{"reviewTitle":"Easy Set-up and Use","reviewDescription":"The set-up was super easy and I got it printing within 10 minutes. It comes with a tri-color and black 67 ink cartridges, I set up the printer on my phone, and then managed to connect my chromebook. Make sure when connecting your chromebook, your printer and chromebook are on the same wifi network!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1624924800000}
{"reviewTitle":"Great for small office","reviewDescription":"I recently bought this printer and it has been a life saver. Very easy to use.  Definitely recommend. Price is also affordable for all it does, worth every penny.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1645574400000}
{"reviewTitle":"Printer","reviewDescription":"Pretty simple to use after I risk confusion but works well.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1676246400000}
{"reviewTitle":".  Prints great.","reviewDescription":"I print a lot of recipes.  Took over an hour with help from HP help line.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1661126400000}
{"reviewTitle":"Average printer.  It does have a lot of features.","reviewDescription":"Nice printer.  Also serves as a scanner and fax machine.  Easy set up.  I recommend this product.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1654387200000}
{"reviewTitle":"easy set up.","reviewDescription":"good for the price so far only had a few weeks.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1676592000000}
{"reviewTitle":"installation more difficult than previous HP printers","reviewDescription":"hard to install, poor instructions for operation using just computer.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1678406400000}
{"reviewTitle":"Acceptable","reviewDescription":"Workable for my family.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1673308800000}
{"reviewTitle":"WORST DELIVERY FROM UPS I HAVE EVER SEEN!!","reviewDescription":"Product is in tact but upon delivery I found the box opened! It was opened all the way to the opposite side just enough to keep the box's appearance as sealed.  It was shipped by UPS, I as so disappointed with my delivery.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1625961600000}
{"reviewTitle":"Great wireless printer","reviewDescription":"It was very easy to set up and the print quality is great","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1662854400000}
{"reviewTitle":"Not worth the money","reviewDescription":"This printer worked great in the beginning and I could print wireless. Now it won't print at all. I was able to get a document printed that I needed, but had to hook the laptop to the printer to do it. It acts like it is printing but there is nothing on the pages. Plenty of ink. Wish we had just bought a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663891200000}
{"reviewTitle":"Difficult to program","reviewDescription":"Will not print from the computer despite multiple attempts to connect, can only use as a copier of paperwork","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Poor print quality","reviewDescription":"Solid printer. After 6 months, the quality of the print really fell off. Blurred texts. Far past the return window so I am stuck with it now.Overall, would recommend a different printer. The scanning capabilities are pretty low.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679529600000}
{"reviewTitle":"Very glitchy","reviewDescription":"Terrible. The printer doesn’t work half the time and at times it won’t print only to print an hour later. Waste of money. Now I need to purchase a new one.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1677974400000}
{"reviewTitle":"Not worth to buy","reviewDescription":"This printer spends a lot of ink, I know the price is good and it looks very nice printer but it is better to save that money and buy something else. I do not recommend this printer","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1679270400000}
{"reviewTitle":"Go with a different printer","reviewDescription":"The amount of rage that ensues in me every time I use this printer is insane. I gave up on the wireless capabilities, it rarely works when it's fully connected. I absolutely hate it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674950400000}
{"reviewTitle":"Out of ink in less than a month","reviewDescription":"The functions seem great and everything was pretty easy to set up, but the device ran out of ink in less than a month...and we rarely ever print anything. Not sure if this is a problem with the printer or we got shortchanged on ink, but it's pretty disheartening to have to cough up more money almost immediately after purchase.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1663372800000}
{"reviewTitle":"Almost","reviewDescription":"I’m returning this. Too difficult to setup and use. Had to do it from my phone for 99% of it. Took 45 mins just to print. I’ll get a different one than this","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1670803200000}
{"reviewTitle":"Not easy set up","reviewDescription":"I've had for over a month and still not working have to download drivers app not easy would not recommend","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1681603200000}
{"reviewTitle":"Used Printer","reviewDescription":"The printer arrived as advertised, clean and undamaged. I knew it was used, but untested. When I tried to print with it, the printer would not print a follow on task. It needed to be shutdown and rebooted before each print task. Amazon issued a replacement which has not arrived yet. I'll have to wait and see if the replacement is any better.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1649635200000}
{"reviewTitle":"Good quality","reviewDescription":"Works great and I love that it is wireless and can use from any room in my house","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"No funciona","reviewDescription":"Desde el primer día que llegó la instale y pues resulta que no funciona correctamente, no imprime a color, solo blanco y negro y no importa si la calibre o no, no funciono, perdí mi dinero","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1697673600000}
{"reviewTitle":"REFURBISHED UNITS ARE GREAT","reviewDescription":"I am happy with this HP printer. I now can operate this printer via my iphone","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Muy buen estado y funcionable","reviewDescription":"Funciona perfecto y estado 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Simplify of the purchase","reviewDescription":"Bought this printer with WI FY capability for a very reasonable price. It’s perfect and easily setup for my home and business needs .","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1704412800000}
{"reviewTitle":"Great","reviewDescription":"Very happy with this printer. Have used it to scan and print. Very easy to install and operate","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701820800000}
{"reviewTitle":"Printer does all I need it to. From my phone.","reviewDescription":"Prints from my phone. Easy to hook up. Doesn’t take much space.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1706572800000}
{"reviewTitle":"Good product","reviewDescription":"Works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709856000000}
{"reviewTitle":"a replacement only","reviewDescription":"did work as it should and i replace the before it died?","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706313600000}
{"reviewTitle":"As expected","reviewDescription":"Bought refurbished and seems to be working well . A little confusing to set up and HP try to get you to sign up for a monthly fee to print, fax and copy\/save! Watch out","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Do not buy","reviewDescription":"After several tries it is literally impossible to get this printer to work properly. Can't even get it on my network. It's compact, claims to have all of the features I need however, every task that is normally simple and fast, turns into printing special instructions, key in multiple codes, and best of luck sucker. I do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715126400000}
{"reviewTitle":"Connects then drops Wifi network at random","reviewDescription":"Worked for about 3 print jobs.  Since then it will not connect to the Wifi network.  Wifi network is strong don't know what is going on.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718668800000}
{"reviewTitle":"Print documents off my iPhone","reviewDescription":"Can’t get it to link up with my phone","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Does not work consistently","reviewDescription":"I have set this up to my wifi several times. When trying to print it usually says not connected. I bought it about 6 months ago and have only been able to get it to print twice. You cannot even print using the usb cable. This was a waste of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1714780800000}
{"reviewTitle":"DO NOT BUY REFURBISHED","reviewDescription":"I have been fighting with HP for MONTHS trying to get this printer to print via WiFi. Since it was refurbished, there is already an account with HP and it's set up on the machine. I've called HP customer service multiple times and they keep telling me they can not do anything for me and there is no way to delete the current account and set up a new one without doing so on the app itself, but I can not log into the app because it keeps saying the printer already has an account associated with it. Now I am past my return date with Amazon so I am screwed with a printer that I can not use. The main reason I got this was to print from my phone while on the road..","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1685577600000}
{"reviewTitle":"Wireless??","reviewDescription":"Wireless?? It stops working all the time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Couldn't get it to connect on line","reviewDescription":"First issue is that I thought I was buying this new, it was received noted \"refurbished\" and obviously not the first time it was packed. It was sealed with white duct tape. Secondly, I'm not a tech wizard but can usually get items connected and running in a short amount of time; however, I worked on getting this set up for 2 hours before finally calling the HP help desk. I was on line with them for over an hour and they were not able to get it to connect to my PC or iphone either. I was told they were going to call back after looking into the connection issue but didn't hear from them. This wasn't even worth the time or effort. I don't know if it was a faulty piece of equipment or if there was anything else but I know it is doubtful that I will buy HP again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Works… WHEN IT WANTS TO.","reviewDescription":"I get that this is a refurbished printer but for the price the least they could do is fix it so that it work. Always throws error messages, prints one good picture in color and the rest come out miss colored and distorted . If I print 5 pages it’ll print 1& half of page 2 and not the rest. This only lets you print if you’re paying for the account, as I cancelled after the trial and it threw an error message about the ink as it was the ink that the account provided and I didn’t pay for it myself but the ink cartridge is full. Very complicated and doesn’t work well at all. Save your money","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"It doesn’t print red","reviewDescription":"Well i just fixed the printer and got the first printout. And it doesn’t print red color. Cartridge was new and came with the printer packed so i dont know!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717459200000}
{"reviewTitle":"What a Pile of Plastic Junk","reviewDescription":"I'm a computer geek and work on numerous pc, phones and printers. After 10 years, my HP printer died, so I went with another HP. Oh, did I make a mistake!Get Use to It: The photo is what you will see every 25 pages. Seriously, do not buy this printer.INK: Of course, ink that comes with the printer is usually useless. I ordered (direct from HP) and just installed 2 new ink cartridges (black & color). I printed 25 text pages and 7 color pages. I'm already out of black.INK: 1 year later, I've had to continue to buy ink after 25 to 35 prints of single sheet paper. This is unacceptable.PAPER: It holds about 20 sheets of paper. That's it! I use to load a ream of paper into my old HP 4100. So, this was a true disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1676678400000}
{"reviewTitle":"Used?  Opened by someone else?","reviewDescription":"This was very disappointing.  I have never been disappointed by anything I purchased from Amazon in the past.  This was to be a new printer.  It came looking possible reclosed but as I had never had an issue with something purchase from Amazon I proceeded.  When I opened it, the styrofoam to protect the printer was broken.  There were no manuals at all of any kind in the packaging.  There was no password available to go on line and print from a computer or do anything else online with it.  I still cannot find a paper holder for it.  There were no printer ink cartridges which I bought anyway based on what was indicated on the outside of the box.  Plugging it in led to no indication of things from the device itself either.","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1617235200000}
{"reviewTitle":"Won’t hook up to my laptop or phone thru the go app","reviewDescription":"Wont hook up to laptop phone with hp smart app","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Nightmare to install","reviewDescription":"This is quite possibly the worst product I have ever purchased of any thing! It have consumed my entire afternoon trying to install.First, it needs a cable which is not included. What type of \"wireless\" product needs a cable to install. Second it now does not recognize the computer thru said cable nor vice versa. I tried even forcing the issue using the Device Manager and the Control panel - to no avail.I know what you are thinking. This guy is a computer idiot, well, not so much. I cut my teeth in tech support and moved on to writing code, so pretty computer savvy.Find a real wireless printer that will install wirelessly and save yourself the heartburn of futility.I WANT MY MONEY BACK. Anyone listening??","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1622073600000}
{"reviewTitle":"Need to work on your product","reviewDescription":"I have had 1 before didn't last even 1 year and mabe up to 2 years.  Then I ordered 1 more just got it in the mail and plugged it up. And did not work.  This is said when you get things that don't work. And have to spend 15 dollars to send it back. I usually don't make comments.  But I am really mad 😠.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1701820800000}
{"reviewTitle":"Refurbished","reviewDescription":"Mine did not work, and I returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Garbage printer","reviewDescription":"Bought this to print simple documents at home. However HP implies that you need to purchase their instant ink subscription. I signed up for the trial they send me ink cartridges that don’t work because my subscription lapsed. HP constantly sends me emails and notifications that my printer won’t print without a subscription. However you can buy your own cartridges and still print but they don’t tel you any of this when they force you to sign up for their subscription model.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"This is the WORST Printer I have ever owned","reviewDescription":"I purchased this printer so I could just perform basic printing functions at home.  The printer showed up packaged well and set up easy enough.  But, that was the only good thing about it.  The printer was not very intuitive for setting up and using the \"touchscreen\" was not user friendly.  When trying to print a test page, the printer would not cycle the paper through the printer.  It made this horrible noise which I hope wasn't the normal sound.  It was loud and sounded likes plastic gears coming apart.  I tried the troubleshooting and there wasn't anything for a new printer.  I tried online support and they gave me the same support that the online troubleshooting did.  NO HELP!!  I just gave up trying to print the test page and returned this junk!","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1615334400000}
{"reviewTitle":"Never been able to get the app to work and never been able to get a human on the phone to assist.","reviewDescription":"If the app has an error you’ll never be able to use the product. I’ve also spent multiple days watching videos and reading manuals with no luck and I’ve spent hours trying to figure ways to talk to a real human though HP tech support with no luck. Literally the worst costumer service I’ve ever dealt with as the is the first company I’ve ever seen that blocks off any option to contact them.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1694390400000}
{"reviewTitle":"not worth the hassles","reviewDescription":"Bought a refurbished printer last January, just one big headache.  I am disabled and find it helpful to be able to print copies of documents etc. The printer worked okay for first 2 or 3 months (maybe 10 copies) then it was done. I could not get it to print a page (or one sentence for that matter) if my life depended on it. Biggest waste of money. No I did not send it back, which I should have done, oh well lesson learned. Next printer will be a new one and maybe not an HP, although I had no problem with the one I had before. (It was dropped in moving.)","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1665878400000}
{"reviewTitle":"Save Your Money$","reviewDescription":"Ive probably printed 50 documents from this printer HP Deskjet 4155. It is a real piece of crap. I would not recommend anyone buy it, unless you only need 50 typed documents and some really off color graphics with lines. These HP printers are cheap and made to fail. It faded out of black ink, so I replaced the cartridge. It probably wasn't even out of ink. I feel bad for the amount of paper it has ruined. Be warned. Garbage. Im going to make a YouTube video soon and will update the link. Sorry if you have wasted enough time to read this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1674259200000}
{"reviewTitle":"Printer","reviewDescription":"Not clear printing , and it’s very slaw","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Does not work correctly","reviewDescription":"I have had many printers but this one just doesn’t work with WiFi without constantly turning it off and back on again. Major pain in the butt to deal with. The print itself is fine, uses ink super fast so if you have a lot to print it’s not the best choice….","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1694131200000}
{"reviewTitle":"Printer","reviewDescription":"Do not buy this printer , I have had HP all my life I usual buy  at staples never had a problem love HP products.  I could not set it up did not come with a book it has it where you download it the app cost money I went on chat then they had someone call me he wanted $50 dollars to help me I just got it never had to pay before I said no he goes come on it’s only 50 dollars . I hung up the phone .","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Unusable Printer","reviewDescription":"This refurbished printer gave me about 10 printed pages before falling apart - front door won't stay closed and pages come out blank IF you hold the door closed to print.  Errors galore.  This was to be an occasional printer\/scanner for my home - again I printed maybe 10 pages over the course of 4 months so you can see it was not an abused printed by any means.  Seller won't reply and Amazon stands behind the seller who sold this defective printer.  Customer service an Amazon is a huge disappointment.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1664236800000}
{"reviewTitle":"Quit working after 2 months","reviewDescription":"Purchased this mostly for the scanner. It was a simple set up and worked fine for two months. The printer works randomly, but the scanner does not scan anymore at all. It is garbage.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Junk","reviewDescription":"Only worked for a few months. Now the Bluetooth won't connect anymore.  Don't buy it!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1710633600000}
{"reviewTitle":"Quit working after 1.5 months","reviewDescription":"Had this printer for 1.5 months. I don't do a lot of printing, maybe a few documents every few weeks. Had to print something and all of a sudden it wouldn't print correctly. It was only printing every 3rd line on the document. Tried cleaning and aligning the print head and changing the ink cartirdges(even though they weren't empty). Nothing worked to correct the printing issue so I returned it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1682208000000}
{"reviewTitle":"whatever company that sells this for Amazon is a joke","reviewDescription":"My printer never worked & they have a service tele number and email -- I emailed them and the tele number has an answering machine that says they will call you back in 24 hours--  I called and left messages several times about 3 weeks ago and sent in emails and have yet to get a response--I think they buy close outs and just ship them without validating that they work-- I couldnt get the HP device driver to --this printer--I threw it away --- buy a new printer from someone else-- even if it works and you need service at some point your better off tossing it and saving the frustration--they have NO SERVICE!! Amazon needs to discontinue using them--","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1626912000000}
{"reviewTitle":"Printing made stressful","reviewDescription":"If you wake up each day wondering how can I make life more stressful than it needs to be then you have come to the right place. This printer has all the necessary functions to make life just a little bit harder. Need to print one page for school? No problem! All you need is two hours of your day to be sacrificed. Running low on paper? No problem! This printer will be sure to waste even more for you. I recommend this as a gift to that one person at work whom you can’t stand. You will sleep peacefully knowing they’re still up trying to get that one copy made.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1632614400000}
{"reviewTitle":"Don't bother if you want to print things","reviewDescription":"I've had this printer for 6 months and it has basically never worked. The wifi never stays connected and the unit errors so I have to unplug it every time I want to use it. Then it takes 15 minutes before any computer recognizes it. If it finishes before wifi stops working, it's a miracle. I just went to print again and it just dumped ink down the bottom edge of the first page and printed nothing else. I'm going to take a baseball bat to the thing and move on since I can't return it.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1646179200000}
{"reviewTitle":"Paper feeder is stand-up version","reviewDescription":"I don't like the vertical paper feeders.  I gave away another HP printer I ordered because it had this \"floppy\"  feature\" that I hate.  I guess I didn't research enough but this has the same feature.  I like a flatbed paper tray - horizontal rather than vertical. In the long run  has less jamming problems.  I am keeping the printer because I just installed it after a 3-month leave from my home to care for a sick relative.  Too late to return and looks like this is the best I can get at this price.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1626739200000}
{"reviewTitle":"Poor installation guidance.","reviewDescription":"Coming with a near-emppty color cartridge, nothing was simple.  instead of a one-click approach, we found ourselvesbeing moved from one program to another, unsuccessfully.  It hourly sessions for us, over a week.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1674172800000}
{"reviewTitle":"Very Difficult Set Up Process","reviewDescription":"I must say, this has been one of the most difficult set up processes for a printer, I’ve ever encountered. The print job is excellent and the printer does the job, but getting there is an uphill battle. There has to be at least 80+ steps you have to follow just to set up the computer. Honestly, it was easier when all you needed was a printer disk. Setting up wireless network takes you through a maze and not to mention you have to enable eWeb services just to sign up for InstaInk...It’s frustrating and yes...I’m still trying to finish set up on my Macbook Air...","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1621814400000}
{"reviewTitle":"Difficult","reviewDescription":"Having a hard time getting to print. Will only print from my I Phone 14","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1688688000000}
{"reviewTitle":"No instructions, hard to set up.","reviewDescription":"Our First HP printer, no instructions came with, hard to find them. It was hard to set up but it works well enough. Will not buy refurbished again for electronics.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1681516800000}
{"reviewTitle":"Do not buy","reviewDescription":"Never wants to connect to Wi-Fi, does not connect to direct Wi-Fi, and will not connect via USB. Waste of money, time. Tech support is just robots and will download the printer automatically several times to your computer trying to fix the problem.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1664841600000}
{"reviewTitle":"Buyer beware  !!!  Don't trust re-conditioned products","reviewDescription":"Could not print proper downloads from my computer.  Most copies printed  were not complete.  only printed half of the text from the internet.  Don't think I will ever buy another re-conditioned computer or printer from Amazon.  Products look good but performance is less than desirable ..  Stick to selling brand new products !!!!","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1643414400000}
{"reviewTitle":"Print and copy, Will not scann","reviewDescription":"This printer is easy to use and is quite when printing. Will copy items from feeder and glass. It will not scan any items. HP Smart App says the scanner is not connected. I should have known not to order a remanufacture item.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1662249600000}
{"reviewTitle":"Not what I thought","reviewDescription":"I had no idea this was a used item. I didn't receive a user manual","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1680652800000}
{"reviewTitle":"Suuuuuperrrr sloooooowwwww","reviewDescription":"When printing wirelessly, it takes FOREVER!! 20 pages took an hour to print!!! Also, when I switched my wifi, the printer would not let me print wirelessly or change the wifi it was connected to. Printing while wired is quick and easy, though, and the quality is great!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1647820800000}
{"reviewTitle":"fine printer","reviewDescription":"would prefer a printed manual to be included but online manual easy to access. Prints beautifully. Scans and copies easily. Won't be setting up fax, as I don't care about it. Wireless AOK. Hoping that this printer lasts the many years that my previous one did !","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1690761600000}
{"reviewTitle":"Printer is better than expected","reviewDescription":"Nothing I didn’t like works good pairs with my phone extremely easy to use a rare feature these days shipping was fast","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"Refurbished printer","reviewDescription":"I am very pleased with the printer I purchased. I didn't realize that it was refurbished until it arrived, but it is very good. The copies are clear and it works from my phone in the other room!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"exactly as ordered","reviewDescription":"Product works perfectly and the only minus was it was a bit difficult to go on line with but once I had it it was great.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"HP Inkjet Printer","reviewDescription":"I am truly enjoying this printer for all of my business and personal needs!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Another Fine product from HP","reviewDescription":"I donated this printer to a non-profit org. that needed a small yet reliable printer.They are well satisfied with the ease of preparing and use of it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1693612800000}
{"reviewTitle":"price","reviewDescription":"work fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708560000000}
{"reviewTitle":"Lot better printer than my previous one","reviewDescription":"I love the fact that I can print out everything from anywhere in the world, the speed is not too fast but then again it’s perfect for my use, and I have a laser printer at work so if I need something printed faster I’ll do it at work. Love the multifunction aspect of it too. Overall great printer, highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1663459200000}
{"reviewTitle":"Excellent product","reviewDescription":"Used for home.Excellent performance,","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1704067200000}
{"reviewTitle":"Bluetooth nice!!","reviewDescription":"It prints really nice. I wanted a newer up to date printer and this one here is amazing. Easy to setup and control. I love how ho has the ink subscription you can sign up for. Makes replacing ink cartridges so much easier. Love the Bluetooth feature absolutely love that I can print from my phone and tablet plus computer of course. Really nice printer get great use out of it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1651622400000}
{"reviewTitle":"Cost of refills","reviewDescription":"The product meets my needs.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1710633600000}
{"reviewTitle":"Good printer but slower than previous HP Printer we had.","reviewDescription":"Like document feeder.  Slower than previous HP printer we had and doesn't hold as much paper as previous HP printer we had.  Haven't printed any photos yet, so can't comment on photo print quality yet. Amazon's refurbishing is really good.  Printer seems able to do everything it's supposed to be do it and  with good results.R.D.Deen","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Great printer, terrible setup software","reviewDescription":"When this printer works, it works very well. The output of prints, scans and copies is excellent, though it seems to be quite ink-hungry (I burned through 2 black cartridges in 3 weeks, and I didn't print but 100 pages.) What genuinely sucks is the HP \"Smart\" (here a euphemism for \"Stupid\") setup software. I couldn't get it to work over Wi-Fi, and every time I deleted the printer and reinstalled, it did something different. I couldn't even get it to work using a USB cable. I backed up and installed HP's previous setup software, HP Printer Assistant and finally got it to work using a USB cable, but why buy a Wi_Fi capable printer in the first place if it needs a cable to work? You can't even set it up with either app without a USB cable. Both apps make you use a cable because the printer does not have a touch screen, and it says nothing about this on the outside of the sealed box, so I had to make a second trip to buy a cable. Since HP knows darn well that it requires a cable to set it up, they should include one with the printer or at least warn you that you need one. Bottom line: great printer if you don't need to run it over Wi-Fi, but seriously FAIL setup software.","isVerified":true,"ratingScore":4,"reviewReaction":"15 people found this helpful","country":"United States","date":1617408000000}
{"reviewTitle":"you need a HP account to use and install","reviewDescription":"bought  a :cheaper printer this time  and  you get what you pay for  with this printer,  hard to install  you  must make a HP account as well.  much Slower printing speed than my cannon,  over all Cheap,  and ok if your having  to occasionally print documents unless you have patients  and know what you  are doing to install  you may want  a easier option","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Did the job I needed done.","reviewDescription":"It worked just fine. Loading paper was not as easy as the ones I used before that had a bottom tray and TBE ink didn't do as many pages as I expected. Good for the price.","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1701648000000}
{"reviewTitle":"Wow! That first ink cartridge went quickly!","reviewDescription":"I didn't find set-up for the printer difficult on the app. On my laptop, it did have the spinning circle of death as the app loaded and loaded. I had other things I was doing, and it ran like that for a couple hours. While it was still doing that, I went out to the Search function for the computer, and it showed the app had already loaded and was waiting for me!I like the printer and it is doing nice work. My only complaint is similar to other reviewers. It produced perhaps 80 pages of work in black and white and I had to replace the cartridge. I have printed zero color pages except the test pages and the level was down a third. In all fairness, I just went over and looked just to verify and now it is back up to full color levels.Will see how the next cartridge goes...","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1648944000000}
{"reviewTitle":"Printer","reviewDescription":"Working well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708646400000}
{"reviewTitle":"Buy extra ink","reviewDescription":"Printer is great. It did come with ink cartridges however they only lasted for about 10 copies. Make sure you buy extra ink cartridges if you need to print more than 10.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"Use your mobile device!","reviewDescription":"just sent a different wi-fi printer back for not connecting to a desktop PC, not matter what i tried, and i tried many ways!  was getting ready to pack this up, too, but thought i'd try something i didn't do with the first printer:  use my tablet to connect the printer to the home network.  guess what?  first time...voila!now the PC knows it exists and prints remotely no problem!i had a very old epson color injet that would take literally 10 minutes to print a full page...this one zipped the same page out in 10 seconds, and it was sharp and clear!i'm duly impressed!","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1675555200000}
{"reviewTitle":"Got my money's worth","reviewDescription":"It's just unique it's true to size. Haven't used it as yet to see how well it print","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703030400000}
{"reviewTitle":"No es fácil para el usarla","reviewDescription":"Gasta mucha tinta y no me la enviaron en la caja original de la impresora  no lo devolví porque le puse la tintas  , la canon es mejor fácil de usa,amazon de la manera que recibí la impresora creo que me enviaron una que devolvieron  pero yo pague como nueva.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Choose a different printer","reviewDescription":"Very loud, slow printing and difficult to setup","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706659200000}
{"reviewTitle":"Misleading and Dishonest Advertising","reviewDescription":"I ordered another one of these printers in October, 2022.  It was new and it worked fine.  I have not used the one I just received, but I was not made aware that this printer was a rebuilt\/refurbished item.  I thought that this printer was reasonably priced because it was part of a January sale. This was very dishonest\/ misleading advertising.  I will be sending it back if it does not work properly!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1674000000000}
{"reviewTitle":"Description missing important info.","reviewDescription":"No hp warranty which hp doubles to 2 years if you use instant ink.  Does not print double sided without flipping over pages manually.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698278400000}
{"reviewTitle":"This Takes FOREVERRRRRRRRRRRand the quality sucks","reviewDescription":"I’ve been trying to print this same paper for TWENTY minutes. Internet speed is fine, connection good. It’s been like this since I bought the printer and I am SO OVER IT!!! Unless I change the quality to 1,200 DPI the works are blurry and unreadable. Why can’t I just get a printer that PRINTS like a normal printer.","isVerified":true,"ratingScore":2,"reviewReaction":"10 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Difficult to setup with Chromebook","reviewDescription":"Printer is for light use with documents on Chromebook  Very hard to setup.  HP websites hard to access and understand  User unfriendly because confusing.  Directs user to use QR code - no camera on a Chromebook!  Took a few hours and a very tech savvy son to make the printer work.  Regretted buying it.The other frustration is that I ordered 1 printer and was billed for one, received 3.  I contacted Amazon and rather than give direction on what to do with 2 extra printers, Amazon credited the dollars for the 1st printer.  No contact from Amazon or supplier since.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1636934400000}
{"reviewTitle":"JUNK Difficult setup, no instructions and does not fax.","reviewDescription":"I received no instructions, the software installation hung up and will not finish, there is NO fax function. I can print using my computers software HP print software just hangs and there is no instruction manual or support. If you need a cheap printer and are knowledgeable about computers it's OK (just) for simple print jobs but if you are looking for an all-in-one easy printer keep on looking.UPDATE: Still junk, DO NOT BUY, I am going to have to purchase a REAL fax machine. This thing is useless, had to replace the ink cartridge, took over an hour to get it working and HP DOES NOT CARE.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1632009600000}
{"reviewTitle":"RENEWED MEANS RECONDITIONED!","reviewDescription":"WHEN WE GOT IT HOME AND OPENED IT, IT WAS THEN THAT WE DISCOVERED IT WAS DEFTLY NOT POINTED OUT THAT THIS PRINTER WAS RECONDITIONED. NOW IT HAS TO BE DRAGGED BACK! VERY DISAPPOINTED THAT IT WAS NOT NEW!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1688342400000}
{"reviewTitle":"Disappointed","reviewDescription":"I recieved 2 color cartridges & contacted seller & they sent me a black setup cartridge within 2 days! Thank you but it wouldn’t recognize the black cartridge so I couldn’t set it up… I called HP & they said it couldn’t be fixed over the phone so I returned it","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1675296000000}
{"reviewTitle":"not all parts in box","reviewDescription":"personal use if i ever get it going.its missing some parts that make it go.for an \"all in one\" printer, copier, scanner hooking it up wireless is very hard for a 80 year old to do and having an owners manual to read how instead of trying to keep up with fast talking instructor is not easy and having had the Desk Jet Plus 4158 for a day still no go, a written manual and the other wire it says it has but did not would be nice.  oh and it does print nicely but only because that was next so some of it works just not when i ask it to.","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1624924800000}
