{"reviewTitle":"Impressive piece of tech with almost zero real world purpose for the average person","reviewDescription":"I'm an Apple guy. I got this watch on a whim because it was on sale and I thought it'd be a nice companion to my new iPhone and Mac Studio. I waited a few weeks before writing a review because I felt like I might've just been \"missing something\" but I think I can now admit that this tech is just aggressively not for me and I'd bet it's not for the average person either.The first thing that really shocked me was that it doesn't feature that classic Apple \"it just works\" kind of software design literally at all. I'm sure it's obviously extremely challenging to pare down all of the \"features\" to the size of a watch face, and maybe the Apple Watch is the smart watch to do it the best so far, but even if that's true, that doesn't mean it's actually good. I felt like it wasn't remotely intuitive.Once I got my head wrapped around it though, it disappointed me with the lack of exciting apps available for the device. Sure, you can get text messages and download podcasts to it, but unless you're an avid runner who somehow doesn't already have a solution to this issue, in what real-world scenario are you not going to have your phone on you at literally all times? I supposed the fitness tracking stuff is interesting as well, but to get the most out of it you pretty much have to be wearing your watch for 24 hours a day. You could take it off overnight, but then you miss out on the sleep tracking. I get you have to charge it at some point, but I bring this up to say that some of the most-hyped features of the phone, by default, aren't as helpful as they could be because of this admittedly unsolvable technical limitation.This brings me to my most damning criticism, it's just plain not comfortable. I hate wearing it. Sure, it looks cool as a fashion statement, but out of the (admittedly, very few) watches I've worn in my life, this is the least comfortable by far.Unless you already have a VERY specific use-case for one of these and you know ahead of time exactly what you need it for, strongly consider saving your money. You won't be surprised by some magical super-cool applefied use-case like I was hoping to be. It sure looks cool as an accessory to your fits, but that's about it.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1692230400000}
{"reviewTitle":"Buggy with widely variable battery life","reviewDescription":"I don’t recommend this product. I’m very disappointed.  It has been very buggy since the beginning and I end the day anywhere from 14% battery to 40% battery. My daily activities don’t vary that much.When I first received the watch about a year ago, the marketing said the watch face could stay on all day. I left it on all day and ended the day with about 30% battery life. Now, a year later, I don’t leave the watch face on during the day and barely get 14% at the end of the day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Exercise Rings are impossible to close at times.","reviewDescription":"Watch looks nice and has a lot of cool features which are customizable.  I only have a couple of complaints.  It doesn't sync to my iPhone. I don't expect it to be exact, but is consistently off by a few thousand steps.  The biggest bugaboo is the Exercise Rings.  I could run on a treadmill and it sometimes closes only 4-5 rings after 30 minutes, and sometimes no rings close at all.  I have taken to restarting my watch before each workout, but that doesn't seem to work either.  I gave it a low overall rating due to it not being able to sync with my iPhone and most importantly, the exercise ring issue. For the money you pay, and with today's technology, you would think that Apple of all companies could figure that out.  I don't run with my arms to my side but I also don't run waving my arms around like Kermit the Frog to get the rings to move.  I guess the plus is that my OCD makes me want to close those rings, so now I average like 24,000 steps a day just to close the rings, lol.  I also constantly check my watch to see if the rings are closing, causing the battery to drain faster than normal.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1700611200000}
{"reviewTitle":"Nice","reviewDescription":"The only problem I have with this watch the battery life last couple hours or a day and that's it you got to keep on charging it everyday but so do not buy it without the AppleCare","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Burned by Apple Watch","reviewDescription":"I initially purchased the watch for its fitness tracking and other health tracking apps.  I never imagined that this watch would burn my skin and leave me with a scar.  I reported the incident to Apple and they told me to stop wearing the watch.  I was also told by Apple that the “skin irritation” (burn) should have cleared up in 2 days.  Apple indicated that they knew about the issue during the questioning session to determine if it was really a burn or not.  This watch burned me.  The imprint of the burn is identical to the sensor on the back of the watch.  The skin where the watch burned me has not healed.  I gave this product two stars because I did initially like it and I found the watch to be useful.  Now, the watch is useless to me and my skin is damaged\/scarred from the burn caused by the watch.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1696204800000}
{"reviewTitle":"Time wasted","reviewDescription":"I had to return the watch because it was locked and couldn’t be paired to my phone.  It was otherwise in good shape.  Very disappointed that it wasn’t tested prior to receiving it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"Would by the cheapest model watch if I had a do-over","reviewDescription":"Apple discontinues oxygen feature.  It did not work as I had hoped anyway.  Looking for a big rebate to make up for the loss of the O2 sensor.  Not too sorry it's gone.  Did not work well in the first place.  Lawsuit give the big A an excuse.  Look at an SE watch at Costco!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Highly recommend not purchasing Apple products through Amazon","reviewDescription":"Purchased this watch in June 2023 and it needs to be charged everyday! I had an Apple Watch purchased through Apple for 3 years before I decided to upgrade to newer version!That Apple Watch (same features as current one) is still holding a charge for over 24hrs (donated to a Afib patient)","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709337600000}
{"reviewTitle":"Open my Apple Watch box","reviewDescription":"So there is no plug to put the charger in! The watch is not charged at all, so it won’t even turn on. The band is so difficult to get on by yourself and unless you’re using this band none of the health apps will work I’m so disappointed in a $400 watch that doesn’t come with all the accessories that you need to charge it. I wouldn’t know about The battery life or the mobile apps or the sleep tracking because I can’t turn the watch on without going out and figuring out where to buy a plug for it so the charger will work! Can’t believe Apple does this! You don’t get the accessories to even charge your watch. Usually most items like this will come with a partial charge so you can at least see if it works. Nope not this $400 item. So sad.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Got what I ordered…..almost","reviewDescription":"Great watch and great condition…..for a refurbished watch.  It was advertised online as a new watch.  Almost $500 for a watch that I’m still paying on. I received it in the mail and open it to find out it was used.  I paid a new watch price for a used one. Not cool. At all.  No where in the item description did it say refurbished.  Please do better Amazon.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"High-Tech and Stylish with Comprehensive Features","reviewDescription":"In terms of fitness and health tracking, the Series 8 excels. The blood oxygen monitoring and ECG apps provide valuable insights into my health, and the watch tracks workouts and heart rate with impressive accuracy. These features are particularly useful for keeping tabs on overall wellness and fitness goals.One small downside is that the battery life, while decent, typically lasts about a day with regular use. It’s not a major issue but does mean that daily charging is necessary.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Decent apple watch","reviewDescription":"Ok for an Apple product.  Apple is always difficult to deal with.  Quirky n forget customer service with Apple","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719014400000}
{"reviewTitle":"Apple watch","reviewDescription":"Has a lot of nice features.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"Upgrade From Fitbit Versa 2","reviewDescription":"As an owner of several Apple products (iPhone, iPad, and MacBook Air) I took advantage of the Prime Day sale on this watch at about a $100 savings. I was happy with my Fitbit Versa 2 as it is a less expensive and simple means of capturing your heart rate and steps in real time and can alert you to notifications received on your iPhone.The Apple watch is a bit more complicated and I found there is a learning curve associated with setting it up properly. It offers a great variety of watch faces that can be customized through setting the “complications” in the Watch app on your iPhone. By the way the term “complications” threw me off at first because it simply refers to the options you’d like displayed on your watch face such as temperature, heart rate, moon phase and many more.One issue I was aware of before I purchased the watch is that there is no easy way to capture your “steps” on this watch. Fortunately You Tube is a great resource if you get stuck with something like this and I learned the third party app Pedometer ++ will resolve this issue to some extent and you can set it up as a “complication” as I did in the photo above. Unfortunately there seems to be a lag such that, unlike Fitbit’s real time steps display, it may take a few minutes for the system to catch up. I like to see my heart rate when exercising but most of the “complications” display it with a heart symbol that you must touch to see your current rate. Another thing I noticed is on some watch face options the steps, for example, show up in a small font that is difficult to see with older eyes whereas others, such as in my photo, are displayed as a larger font. The band that came with the watch is a little small in that I have to use the last notch on the band. So, you might consider a larger band. I’ve ordered a replacement on Amazon.Lastly, while the watch comes with a charging cord, unless you have a USB C base at home, you’ll need to purchase one because, unlike my other devices this requires a much smaller socket on the plug base. Otherwise, I think I’m going to like the watch as it integrates well with my iPhone.","isVerified":true,"ratingScore":4,"reviewReaction":"52 people found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"Great watch! but be careful of an iCloud Lock","reviewDescription":"I bought this watch used as an upgrade from my series 5, as the battery life was degrading. It came with all the original packaging and everything was as if it had never been used. When I went to set up the Apple Watch to my Apple ID, it was iCloud locked by the previous owner and I couldn't do anything with the watch. Luckily, Apple has a service for this issue where I had to submit a claim and show pictures and receipts that I had purchased the watch and they were able to unlock it within a few days. Not sure if this is something Amazon can check before taking and shipping a used watch from someone.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Good","reviewDescription":"Good","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"The face does scratch, get a good case before wearing it!","reviewDescription":"I really like the watch and the fact that it has a good amount of space available, but I should have gotten a protective case for the face of it and put it on before I started wearing it.I thought that, based on the watch description, the face had a protective covering on it that would protected it from scratches, etc. I don’t think I’m that hard on watches.Unfortunately, I learned that if there is a protective cover, it doesn’t protect it enough. Within a few weeks of getting the watch it got a large scratch down half of the face. I have no idea how it happened. I went to put it on one morning and the scratch was there.I contacted Amazon to see if they offered a warranty, but they referred me to Apple.Apple said that it was not covered under the warranty because it was considered “wear & tear”. It would cost $200+ to replace the face. Which is more that we paid for the watch when it was purchased on sale.I ended up buying an Otterbox protective face cover and am now try to prevent further damage.I’m disappointed with the quality of the watch face based on the description, but I guess I should have assumed that it would need a cover. Live and learn, I suppose. 😔Other than that, I do like the watch and the band that it came with. I would recommend it, as long as you get a good face cover for it and put it on before wearing it.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"Great but needs better battery life.","reviewDescription":"So I used to have the Apple watch 4 series. I purchased this through Verizon. I had it for 2-3 years. I couldn’t do the extra $50 a month because of this. I had to pay the insurance of the watch, the data for the watch…then the extra line. This can easily add up really quick.Then I went to Fitbit. Very disappointed because it started to glitch and never turned on again. Had it only for a year. Not worth it at all.So I decided to switch back to Apple Watch again. Hopefully it will be better this time around. So, I made the big leap to try this again. Purchase this on sale from prime day.Apple Watch series 8 pros:- I love that it’s so easy to connect with my iPhone.- Apps are very user friendly.- My Apple Watch can easily be sync to my iPhone. Navigation. Text. Calls.- Great workout apps to track your fitness goals.- Great health apps. There are times in the middle of the day it will remind you get up and breathe.- Also sends you reminders of your mental cycle.- Hands free. Apple Pay.- Great for emergencies situations. Connected to your insurance card and emergency contact.- Also has the find me function. Find devices.Apple Watch S8 cons.- battery life. You have to charge it every night. Doesn’t last too long.- be careful when charging because it doesn’t get charge 100%.I’m still learning everything it does. Overall, this is a great purchase for me and my health. I’m so glad I’m back to Apple Watch again. I highly recommend this purchase. Good luck everyone.","isVerified":true,"ratingScore":4,"reviewReaction":"32 people found this helpful","country":"United States","date":1693958400000}
{"reviewTitle":"A nice Watch, not much of an upgrade though","reviewDescription":"UPGRADES from Series 7:S8 Chip:  This is basically the same as the S7 chip, with a few new integrated sensors:--Temperature Sensors:  Measures wrist temp. only while sleeping, takes five days to build baseline.  Currently only used to help retroactively analyze ovulation cycles after two cycles.  Not predictive.--High G accelerometer and improved gyroscope:  Able to detect car crashes and call for help.  (Same feature available in iPhone 14)-Different Color options: (Currently no blue or green?)That’s it.  Everything else is exactly the same as the Series 7.  The only way I can even tell them apart is by the color, otherwise they look the same.  The only benefits to upgrading to a Series 8 from a Series 7 would be the improved ovulation tracking features via nighttime wrist temperature, (though Apple warns that this is not necessarily predictive and should only be used to retroactively analyze your cycles after a couple months of use, and you would have to be wearing it at night often because this feature only uses sleep temp data), or the car-crash detection (but if you are going to get an iPhone 14, then this feature will be in your phone already).  So, if you are not interested in the ovulation data (or just don’t want to wear the watch every night- because maybe you charge it at night), and you plan to get an iPhone 14, then there is no reason to upgrade to this Series 8 at all.  The series 8 does come with Watch OS 9 which has some new software features, but all Apple Watches Series 4 or later can upgrade to this same OS 9.  (So that is Series 4, 5, 6, and 7, and SE, all support upgrading to Watch OS 9)So basically, it is hard to recommend getting this Watch Series 8.  If you can live without the wrist temp ovulation analysis and car crash detection in the watch, then I would suggest sticking with Series 7.  Even Series 6 isn’t that different in terms of performance, it and will still support Watch OS 9.  If you are buying your first Apple Watch, I would still suggest getting the less expensive Series 7.  Or you could also look into the new SE 2, which is about $150 less expensive than this Series 8, but lacks several other features like the Always-On-Display, ECG, blood oxygen and IP6X rating.","isVerified":true,"ratingScore":4,"reviewReaction":"447 people found this helpful","country":"United States","date":1663372800000}
{"reviewTitle":"Works great!","reviewDescription":"I don’t like the band as comes loose easily!Everything else is great!Learn to use the watch and all of its functions and it will work for you!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1714953600000}
{"reviewTitle":"Apple Watch - The Ultimate Companion on Your Wrist!","reviewDescription":"I recently purchased the Apple Watch on Prime Day and it has exceeded all my expectations! It's an absolute game-changer, earning a solid five stars from me.The sleek design is a standout feature—elegant, modern, and incredibly comfortable to wear all day. The display is vibrant and sharp, making it easy to read notifications, messages, and health data at a glance.The array of features is mind-blowing. From tracking my workouts and heart rate to receiving calls and messages, this watch seamlessly integrates with my lifestyle. The fitness tracking capabilities are especially impressive, motivating me to stay active and reach my goals.Battery life is fantastic, lasting through a whole day and more, and the charging is quick and hassle-free. The ease of use and intuitive interface make navigating through apps and functions a breeze.All in all, the Apple Watch is an exceptional piece of technology that has truly enhanced my daily routine. If you're looking for a smartwatch that's stylish, functional, and reliable, this is the one to go for!","isVerified":true,"ratingScore":5,"reviewReaction":"41 people found this helpful","country":"United States","date":1695427200000}
{"reviewTitle":"Fantastic 10\/10","reviewDescription":"The Watch 8 is pretty awesome !It has a sleek design, outclass performance, seamless connectivity and some really handy features like advanced health tracking and a beautiful large curved display, 45 mm being the ideal size ; not small like the 41mm or the massive 49mm. Personally, I love the beautiful always on display !The Health tracking features are outclass ! It seamlessly monitors heart rate, does sleep tracking, keeps a check on the breathing rate and the blood oxygen levels, and even detects concerning ECG changes. Temperature monitoring comes with the package.In addition it is a fantastic workout companion. It can track various types of workouts like running, cycling, swimming, and more. It keeps tabs on your progress, calories burned, and even provides real-time coaching to help you stay motivated. It's like having a personal trainer right on your wrist","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1707955200000}
{"reviewTitle":"Great watch!","reviewDescription":"Looks great and works really well with my iPhone. Great for tracking my health details as well. Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1719360000000}
{"reviewTitle":"Perfect Gift and Unbeatable Price!","reviewDescription":"I bought the Apple Watch Series 8 [GPS 41mm] Smart Watch with the Starlight Aluminum Case and Starlight Sport Band for my daughter some time ago, and it has been a fantastic purchase. Amazon had the absolute best price, making it an even sweeter deal!This watch is packed with incredible features like fitness tracking, blood oxygen and ECG apps, and the always-on Retina display. It's also water-resistant, which is a big plus. My daughter loves it and uses it every day. It’s stylish, functional, and a perfect gift.The only drawback is the battery life. It lasts about a day and a half, which is equivalent to other smartwatches, but considering all the great features, it's a minor issue. Highly recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"First Apple Watch","reviewDescription":"This is the first Apple Watch I’ve owned. I had a FitBit Versa 2 before purchasing this watch and used that pretty much every day for the past 3 years. This watch is a MAJOR upgrade. I track workouts, monitor my heart-rate, send texts, even call sometimes from it. The customization options of the watch face is absolutely incredible. My current watch face shows my heart rate, the weather, and even battery top left, but there are so many different customizations to choose from. I even use Apple Pay on it almost every time I use it. It’s incredibly easy to use and all of the different utilities of the watch are worth every penny. The sync between the watch and the standard iOS apps on the iPhone are seamless as well. Way better than my old Fitbit. I plan on having this watch as long as possible. BATTERY: compared to my Fitbit, the Apple Watch battery doesn’t last nearly as long. However, this watch charges pretty darn quick. I put it on the charger when I shower in the morning and shower in the evening and that’s enough to keep this watch charged. Overall - I’d say the charge lasts around 24 hours if you’re not tracking a workout and aren’t checking too much. When I wake up at 5:30 AM, I put the fully charged watch on, work out for about an hour, and go about my day at work. I take it off around 9 PM and by this time, I’m usually anywhere from 35-45% battery. SLEEP TRACKING: I’ve used sleep tracking a few times but not every night. I’m just not always comfortable sleeping with a watch on. But when I have used it, I’ve really liked seeing my heart rate pattern and sleep cycles. I usually get about 8 hours of sleep a night, though so tracking this was never a priority for me.Overall: fantastic watch and worth every cent. 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"33 people found this helpful","country":"United States","date":1688860800000}
{"reviewTitle":"Best Watch for Health and Daily Life!","reviewDescription":"This is probably the most useful watch to own when it comes to health related tracking. It can track everything from your heart rate, exercise, standing time, distance, and sleep. As nice as that sounds I honestly barely use those functions. I imagine knowing this information probably help if I worried about my health personally, but what sold me on this watch is the other features. Here are a few I personally found incredibly useful.1. If you are a apple household and own several products and like me tend to lose them thru out the house, for example your iPhone. There is a nifty button on your touch screen that lets you buzz your phone and make it play a loud sound till you find it.2. Lets me track my wife and kids when they wander away and leave me all alone in target. I can either use my watch like a walkie-talkie and look like a weirdo spy in the store asking for help. Or I can see them on Find My iPhone (wife). (Requires setting up the family options)(Kinds creepy stalker option)3. I know when someone text messages me without looking at my phone. I can use siri to reply back by talking into my watch. Or ignore them like I usually do. . .4. I can pick out custom faces for my watch so I can use analog and impress absolutely no one. Or set it to digital military time and do math. Or best yet, pick one that shows me the weather which is really useful to understand why you are sweating in really bad places today and should probably find AC fast.5. The band that it comes with absolutely sucks but for about 1\/3 of the price of the watch you can go to apple and choose from a crap ton of options. I honestly think they are worth the price so you don't get wrist sweat running down your hand. I do also recommend hunting down a screen protector on Amazon for your watch as well to protect the face from accidental dings.6. It has an app for that. Yep it has soooo many apps that do all the things that it can be very overwhelming. But some are really useful, like if I am listening to Spotify while jogging (walking speed but wheezing for effort) I can swipe songs I don't like and turn up and down the volume without grabbing my iphone from my pocket. Yes it isn't far but I am dying and probably drop my phone if I tried while running.7. Okay now for a more serious note. For the older generations it has a really useful feature on the newer models that allows you to monitor your heart and detects when you fall. If you fall it shows a sos button on your watch you can press to get help. If you don't move or respond after a minute or two it just makes the call for you. For the heart monitor you can set up your high\/low BPM and have it track your heart and after awhile it can detect whether or not you have an irregular heart beat and warns you. It cannot track heart attacks but it can help you monitor your heart if you have any heart conditions so you can see a doctor. Please keep in mind that there is a lot of setup involved with these processes so if you are getting it as a gift for someone elderly or not very tech savvy. Please take the time to set it up and help them out. I found it somewhat easy just a bit time consuming.8. Lastly for the kids, it has a few features that I think are good to know for parents. The find my iPhone features shows you where they are even should they get separated from their iPhone as long as they have their watch on. If they should forget their iPhone and it gets too far from them the watch alerts them that they left it behind. It has a emergency call button (hold down the button under the crown *wheel thingy*) if they need 911 and sends out their current known location should the worst happen same as the iPhone. And lastly if someone plants the AirTag on them that isn't registered to them it alerts them that one is nearby.It does a lot more then what I listed but I think the review section would implode if I tried to list them all. These are just the ones I typically found useful. Like it also has a flash light feature and a spit water out the side after you wash your hands feature. If your curious to know more about the watch, apple does an amazing job on showing you all its features on their website so I would definitely visit it before you make the purchase. Also you can see all the wrist band options they sell so you can bling it out I guess. Hope this information helps you out!","isVerified":true,"ratingScore":5,"reviewReaction":"474 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Good product!","reviewDescription":"Good product!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Awesome Apple Watch","reviewDescription":"My wife loves her new Apple Watch Series 8 - 41mm.  There are so many features with her new watch.  She uses all the fitness and health features of her watch.  She said the initial setup was fairly easy and straightforward.  We purchased a set of six colored watch bands for her watch.  She loves being able to choose a different band color each day.  We also purchased a clear screen protector for her new series 8 watch.  We are really glad that we purchased the clear screen protector because it blends in very nicely when she is changing her colored watch bands.  I'm sure the series 9 apple watch is nice, but the series 8 is just a perfect fit.  Would highly recommend this Apple Watch.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1722988800000}
{"reviewTitle":"Easy to setup, really worth the money","reviewDescription":"I love all the info i get from it.I can check my BPMs,how was my nightly sleep, my blood oxigen, ECG and much more.and it \"TALKS\" to my iphone.I am VERY delighted with it.this is my iphone 8 but the iphone ( is already on sale.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Fast delivery","reviewDescription":"Great service.  Arrived as promised.  Apple watch is a present for brother - and he loves it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Not as good as the price suggests","reviewDescription":"It’s an ok watch. The battery life is pretty short compared to other smartwatches I have owned.  This Apple Watch gets about a day on full charge. My cheap smartwatch it replaced would get about a week on a full charge.I’m very disappointed with the low number of watch faces available by default. Not really happy that I would have to pay some third party for a watch face with intricate movements.The build quality is typical for Apple. In other words, excellent.Not a fan of the watch band but after a little practice, not difficult to secure on my wrist.Overall, I am a bit disappointed. My last smartwatch was a $25 job I got on Amazon 2 years ago. It replaced my Samsung watch that was stolen. I wanted to upgrade back to a higher end smartwatch. And seeing how I converted from Android to IOS (a decision I’m happy I made), I figured I would get an Apple Watch. I guess I was expecting a watch that was as good as the Samsung. Again, disappointed with the features offered on this watch. It’s no better than the $25 watch it replaced. Other than the Mickey Mouse watch face. I love that one.To summarize:Quality of build = 5 starsIncluded watch faces = 2 starsIncluded apps = 2 starsBattery life = 1 starWould I buy it again?  No.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"Replaced a Series 5 Apple Watch","reviewDescription":"I wanted to take advantage of the enhancements available on the Series 8 watch over the Series 5.  As I have COPD (a lung disorder) the ability to have quick access to the Blood\/Oxygen level was a definite attraction.  The fall detection and crash detection were also a consideration.  Well, the watch is accurate as it gets its time from GPS signals.  I thankfully haven't had an occasion to test the fall or crash detection yet but the Blood\/Oxygen reading is a complete joke for those of us who really need this statistic.  I have found that if the actual reading is low (anything below about 91%), I will inevitably get an \"Unsuccessful Measurement\" from the watch.  For people with advanced COPD, readings below this are quite common and need to be monitored.  Not only does it refuse to read low settings but the actual reading when it is available is way too high for medical tests.  The watch will inevitably read 2 to 5 percentage points above what the actual reading is on a calibrated SPO2 sensor.  When the watch shows a 92% oxygen saturation, you probably have an actual saturation level of 88 or 89% which is well below the safe margin.  Given the known results of that test, I actually have little faith in the watch's ability to detect a fall or crash.  Overall, I am disappointed in the watch as an enhancement over my Series 5 which I found to be very useful except for the short 18 hour battery life and the Series 8 didn't really improve on the requirement to charge the watch every night.","isVerified":true,"ratingScore":3,"reviewReaction":"41 people found this helpful","country":"United States","date":1667260800000}
{"reviewTitle":"Watch face is soft","reviewDescription":"Watch is ok.  Got it for smart features and EKG.  The face of the watch is soft.  Took a month for the first scratch with normal wear and I haven’t had it for a year yet.  Apple couldn’t care less and AppleCare couldn’t either.  Very disappointed with this purchase.  I used to wear a Garmin and it was indestructible.  Wish I bought another (same features, much better build).","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1709683200000}
{"reviewTitle":"Battery life is not good.","reviewDescription":"Battery doesn’t even last a full day on one charge. I even went and turned off all unimportant notifications in my settings, still doesn’t last.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"BPM doesn't work","reviewDescription":"I like this watch for the many features to access on my wrist BUT the MAIN reason I purchased it was to track my BPM while doing my daily walk as I do climb which elevates my BPM.  It worked great when I first purchased the watch, but now it starts off with accuracy but about 1\/2 mile into the walk, it will change from 132 BPM to 78 BPM which I know isn't correct.  I have rebooted it, updated both it & my phone, and cleaned the back sensors.  So, I give it 3 stars as I use it for other conveniences such as the timer but I am disappointed I can't use it for the reason I bought it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698796800000}
{"reviewTitle":"Comfortable, informative","reviewDescription":"I waited a long while to buy an Apple Watch and had hoped that 8 would have a CGM feature as well.  Once I realized that that was still a couple of years away, I went ahead with my purchase.  I make good use of the health tracking, including the sleep feature.My only complaint? The battery dies down VERY quickly; I have to remember to charge it at least once a day and consequently bought a charger for the car in the hopes that I wouldn't run out of juice on a long day of exercise.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Watch out, you'll get a used watch. A lot missing in the description when purchasing.","reviewDescription":"This is a gift, but based on price I paid and how the product was described, I felt I was purchasing a new watch. Wasn't until watch arrived today, that I was made aware that the watch I purchased had been \"renewed\". Wasn't until I went back and reviewed my invoice that I saw that it was sold as used & in good condition. But the actual posting doesn't saying of the sort. Fingers crossed that this \"sold as new but actually used watch\" works when it is opened on Christmas day.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1702598400000}
{"reviewTitle":"Useful but not that useful","reviewDescription":"Ok, so this is a fairly expensive watch compare to a fitness tracker.It gives you more features but a fitness tracker can also provide the 80% of what an Apple Watch can provideSo it is useful but not that usefulTwo things has been bugging me:1. Battery life, you want to make sure you charge it every single day. Cuz it could really die on the second day if you forgot to charge it the night before2. The wrist band, the one came with it is not comfortable and causing itchiness on the wrist. Not sure if that was allergy or something. But watch out if you have the same problem, it may be the issue with the wrist bandAgain, it worths the bucks if you really need every single feature. But most of the time, a fitness tracker is enough for most ppl","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Flawed Applewatch 8","reviewDescription":"I had to return the watch to Amazon for a refund. The battery would hold a charge for only 4-6 hours. I took the watch to the local Apple Store. The technician diagnosed the problem as a faulty 3rd party Compass app. The flawed app would not load and would always keep trying to load until the battery was flat. I returned the watch to Amazon for a refund and purchased another one at the Apple Store. The new watch is flawless. The battery holds a charge for 48-50 hours. I might add that in over 25 years of buying Apple products this was my first flawed item.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Apple ain't what is used to be...","reviewDescription":"While the Apple Watch version 8 has some great tech packed in a small package, some of the included apps leave much to be desired. The \"sleep\" app is clunky and lacking most of the features found in the Fitbit sleep monitoring app. To approach that level if functionality, a separate app needs to be purchased. Same with the alarm app. Oh, and would it have hurt to include a USB C to USB A adapter? I had to go and buy one just to charge the damn thing.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694217600000}
{"reviewTitle":"Good","reviewDescription":"Nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"GREAT PRICE","reviewDescription":"I LOVE MY SECOND IWATCH","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714348800000}
{"reviewTitle":"Great watch and more","reviewDescription":"I was skeptical when Apple first put out their watch.  But now, when they included the ECG, that was a game-changer!  I found this watch is so useful.  I didn't need the cellular one, so went with the wi-fi one and have had no issues.  I choose to have the Always On setting, so yes, you need to charge it before bed so you are ready to track your sleep.  But that hasn't been a problem for me.  This watch is amazing and I'm very satisfied with it.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1701216000000}
{"reviewTitle":"Perfect device","reviewDescription":"Bought this watch as a gift for my aunt. She loves it. Connected to her iphone and her life is much easier now. Incoming calls, calendar, reminders and many more cool features. Highly recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Happy with the purchase","reviewDescription":"I got this smart watch because of my A1C is high. So, I committed to walk every morning. This watch counts steps, blood oxygen, heart rate\/ ecg, and my sleep pattern.  I know there is many smart watches. But this one is just like your iPhone, it tells you when you get text, call, email. Sometimes I miss call because I have my phone on mute. The watch tells me that I had a call, and I can see the weather on my watch, I can use it for timer when I cook, the timer in the kitchen is not loud enough to notify me … lol .. it comes with old age.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Works perfectly","reviewDescription":"I like using it for time and work out app works great","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713830400000}
{"reviewTitle":"Fantastic Info and Watch!","reviewDescription":"I bought this watch during Amazon Prime special. I have a Series 3 and was looking to get the extra benefits of having the newest series (without the Cellular). Watch was easy enough to set up and get going. I especially like the sleep information provided every morning. My big puppy ran into my arm one day and I got the message asking if I had fell down and should help be called. I sent no for those questions but was glad to see that if the issue presented itself, I would be able to take care of it. This watch feels like having an extra friend or family member keeping an eye out for me. Hopefully I will never have to use that or the car crash help. The “Dick Tracy” watch of the past has become a fantastic piece of the future right now.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1692576000000}
{"reviewTitle":"Excellent deal","reviewDescription":"This renewed Apple iwatch 8 came in almost perfect condition:  it had just a small nick in the very bottom corner that is hardly noticeable.  It functions perfectly, which is all that I ask.  A great deal.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1708128000000}
{"reviewTitle":"Hubby LOVES it!","reviewDescription":"My husband never wanted anything techy but with him going out into the woods and always having to pull his phone out he thought an apple watch would be a good idea but he was still on the fence about it. I bought this as a gift and he is in love with all the features, the being able to go fishing and hunting and having access to text and calls through his watch. He love the compass when he's out in the woods especially the fall feature as he climbs trees and always worries if something were to happen and no one is ever around how would he get his phone out to call. Huge plus!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Review","reviewDescription":"Exactly as described.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714867200000}
{"reviewTitle":"Bastante bien","reviewDescription":"El único punto flojo de este reloj es el mismo que todos. La batería dura muy poco por lo que a veces se me olvida cargarlo y entrenando me quedo sin batería a mitad entrenamiento. Pero fuera de eso está bastante bien. Es bastante fluido y tiene muchas funcionas que depende de uno en qué quiera ponerlo. Sobre todo lo uso para el deporte, recordatorios, mensajes emergentes y también para apuntar cosas en una lista rápida para que luego no se me olviden. Me gusta mucho y le doy mucho uso","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710374400000}
{"reviewTitle":"Apple Watch 8, 41mm","reviewDescription":"As a disabled person, I’m extremely happy to be able to call, text, and use Siri from my wrist. I also like that  my vitals (except blood pressure) are continuously monitored. If I fall, the watch will ask if I need help to be called. I also love when using the map feature on my phone. My watch also tracks and “taps” my wrist when it’s time to turn. (Constant pattern to turn right. Syncopated pairs of taps for left). I could keep going but I think I’m running out of space.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1710201600000}
{"reviewTitle":"Great watch","reviewDescription":"Performance is great and easy set up.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Seamless Upgrade: Trusting Apple's Timeless Quality with the Series 8","reviewDescription":"Purchasing the Apple Watch Series 8 for my wife proved to be a seamless transition, especially since she was familiar with the previous model. The familiarity in design made it easy for her to use from the get-go, and the striking similarity to the older version didn't compromise its appeal. However, the Series 8 goes beyond aesthetics; it's a powerful performer. While it may look like its predecessor, it excels in functionality, showcasing Apple's commitment to innovation. As always, we trust Apple products for their reliability, and the Series 8 lives up to that trust by delivering a seamless and efficient user experience. It's not just a watch; it's a testament to Apple's dedication to quality and technological advancement.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1707264000000}
{"reviewTitle":"Wonderful","reviewDescription":"Very pleased with this purchase - wear it daily","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Beautiful and easy to use","reviewDescription":"I love this watch!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Water proof!!!","reviewDescription":"This has been the best apple watch i've bought so far! I was between getting this and the ultra, but really didn't want to pay that much. The 8 seemed to offer all the key points I wanted (better sleep tracking, longer battery life, and water proof) and I cannot stress how great of a choice that was. Unless you are going to be diving I don't see the utility in the ultra. I wear this all day, everyday and during the summer I am always in the water. All I had to do was turn on the water lock and everything was good to go. Even with it submerged for a while, I have had no issue. Best apple watch for the price!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1704844800000}
{"reviewTitle":"I don't use my iPhone as frequently, AND the watch will locate my iPhone","reviewDescription":"No regrets purchasing this Apple Watch. Thank goodness for YouTube \"Apple Watch\" tutorials, because I needed them to completely set up my watch for the custom features I really wanted. Love the watch features and multiple Watch \"Faces\" feature - so I can custom create a specific \"Face\" for my different activities: ie, \"Work\" watch face vs \"Weekend\" watch face vs \"Exercise\" watch face etc. I'm enjoying discovering and learning the capabilities it has to make my life run smoother, just like I am with my iPhone. I can even take a phone call on it (by accident the first time!! :), when I've miss placed my phone in that moment. Battery life is good and quickly recharges with the included watch charging cable. It readily magnetically links to the back of the watch, so you don't have to fuss with trying to insert a cable \"end\" connector to somewhere on the watch to charge it. Lastly, I like that I can readily change out the extra watch bands I purchased separately (with no tools required), to coincide with the physical activities planned or the varied settings I'm in.","isVerified":true,"ratingScore":5,"reviewReaction":"13 people found this helpful","country":"United States","date":1695254400000}
{"reviewTitle":"Good product!","reviewDescription":"My husband lost his Apple Watch back on vacation, I ordered this one for him. It works very well, does not lag, the picture quality is good. The connection between your watch and phone can go pretty far. Answering calls and text messages on the watch is really simple as well! If your on the fence just go for it ☺️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710288000000}
{"reviewTitle":"Perfect","reviewDescription":"Just like all Apple products. The watch is perfect. I've dropped it a few times and it's never broken or scratched","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1715040000000}
{"reviewTitle":"All around good watch","reviewDescription":"This is my first Apple Watch so I have nothing to compare it to. It seems to be just fine although sometimes I want to say cuss words to it when it tells me it's time to stand up when I've only just had my first drink of coffee...lol","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695945600000}
{"reviewTitle":"One little issue with it","reviewDescription":"Moved up from a Fitbit Versa, watch is great ,easy to use \/ synch with phone, easy to set up, works great so far (have had it for a week) .  If you want to spend less $$ Fitbit has most of the same features the apple watch has and for less monies.  Only one complaint I have with the watch is that you have to charge it daily, with the fit bit charge would last at least 5 days.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"Great Watch","reviewDescription":"I had a series 2 Apple Watch and its battery was not holding a charge anymore.  The model 2 watch is no longer software upgradeable and the cost to change the battery in it did not seem to be the smart move with all that has changed in the watch.  I love the new brighter display and the \"constant on\" feature of the display.  The battery is still at 50% at the end of the day when I place it on the charging puck, so the battery life is great in spite of the constant on display.  I still use pretty much the same apps as I did before so the upgrade was not for the apps but for the battery and display.  Now if Apple only included real time glucose monitoring for diabetics, that would be nirvana and the rating would likely be 5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"14 people found this helpful","country":"United States","date":1671753600000}
{"reviewTitle":"Excellent watch, battery life could be better.","reviewDescription":"Love the watch, it does everything I need it to do and more. Sleep tracking is excellent, heart rate monitor and blood oxygen sensor are very useful. The alarm hasn’t failed me yet.The downside? Having all of those features constantly monitoring for changes drains the battery quicker than I’d like. Note that I dimmed the brightness of the display and turned off the “always on” feature. It helped a bit but to get the most out of the battery, you’ll have to turn off the active monitoring features.Low power mode is always an option if you’re really needing to conserve battery but it turns off 99 percent of features to do this.I have a charger nearby 95 percent of the time so that minimizes the issue somewhat.I‘d give it a half star back if that was an option (so realistically a 4.5 out of 5)Some people will say get the Ultra if you need a better battery, but I couldn’t justify $800.","isVerified":true,"ratingScore":4,"reviewReaction":"164 people found this helpful","country":"United States","date":1666483200000}
{"reviewTitle":"Love my IWatch","reviewDescription":"I love this watch.  It’s an amazing piece of technology that works flawlessly.  Why only 4 stars?  Battery life.  Before owning this gen 8 I owned the gen 3.  The gen 3 could go 4 to 5 days on one charge.  This gen 8 I am lucky if I can get 2 days on a charge.  I hope Apple starts concentrating on improving battery performance.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692835200000}
{"reviewTitle":"Great smartwatch","reviewDescription":"Love its interface with my iPhone.  Great apps, extremely useful","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703376000000}
{"reviewTitle":"Good watch, but it's not the best","reviewDescription":"I've liked this watch so far, as it's been pretty good in terms of noting down my sleep, tracking my fitness, along other things. One bad thing about this watch, though, is that it will collect the data for sleep and display it, but it won't relay information about the sleep itself. You need third-party apps you can get at the app store to tell you more or rate your sleep score.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Battery Life is Disappointing","reviewDescription":"Display is nice but the sleep tracking is not great at all. Bought this more expensive version to track basal body temp and can't figure out how to turn on the tracking and you have to wear it all night. Problem is, the battery life is terrible. I have to charge it midday or evening so then I lose out on the fitness tracking during that time.The larger display is really nice and overall I like it but there are some issues that should be resolved.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Warranty Issues","reviewDescription":"Yes I think it is a good watch. But I have to say that after 5 months the face surround started to delaminating.When I contacted Fitbit and sent the a picture they told sorry put that is not covered under the warranty. I willnot be buying any futher Fitbit products.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695772800000}
{"reviewTitle":"Great watch, Still fair battery life","reviewDescription":"The new HR monitoring features, and the ECG feature are nice. I like the exercise tracking and apps. The battery life is pretty limiting. I'd look at the youtub videos on various features and setup and how to try to minimize battery drain (eg background refresh, etc). An ok value, if you can get it on sale, like Prime Day or black friday.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689984000000}
{"reviewTitle":"Needs a charger","reviewDescription":"This isn’t a cheap watch, and with all the things it can provide, it’s a perfect present. Unfortunately the magnetic charger doesn’t work even if you can find the correct power connection. So buyer beware you have to also invest in a charger for this watch. Not a happy Customer","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1671926400000}
{"reviewTitle":"Hard Pass","reviewDescription":"I would warn again buying. The battery life is awful. It doesn't even last a day. The watch app on your smart phone doesn't really do anything besides set up the watch and change the watch face. I would return this if it were an option.","isVerified":false,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1679443200000}
{"reviewTitle":". Very hard to use. The battery life is two days. I got four days out of a $59 watch.","reviewDescription":"My cheap fitness watch was so much easier to use. The worst $500 I’ve ever spent.","isVerified":false,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1668038400000}
{"reviewTitle":"Battery","reviewDescription":"I bought this iphone watches series 8, 45mn on Amazon, was the worse. It came in wrong collor wrist band , battery last only 7-9 hours with a 6 hours fully charged. Features are limited such as no blood pressure check and ...etc. This iphone watch might be a copy not the real one. I will bring it to apple store to check it, if it's real.  Overal was the worse and rating was a two. I will never purchase it again.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"Product packaging is worse","reviewDescription":"The box doesn’t look new, I got this to gift someone but seeing box it’s feels like a second hand watch box.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1684368000000}
{"reviewTitle":"not bad stuff but suck delivery","reviewDescription":"I have waited for it for more than 5 days! It is so late since its estimated date was just 1 day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Poor battery life","reviewDescription":"I replaced this watch with my FitBit. It fits my small wrists well. Not great battery life. It needs to be charged every other day. My FitBit lasted up to 4 days. Pretty disappointed!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"Disappointed in a few things","reviewDescription":"Facebook App is no longer available for Apple Watches. Sleep only tracks during you sleep window. So, if you fall asleep early or sleep in, it’s not tracked.  Naps also are not tracked. My old  Samsung S2 did a better job with sleep tracking. 🤷🏼‍♀️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697328000000}
{"reviewTitle":"Does NOT come with power block","reviewDescription":"This may be the most amazing device I will ever own. But I don’t know because mine came with no battery charge at all and requires a power block with a USB-C port to plug in. It seens like as expensive as this watch is, they could include a power block with it. I can plug it into a port on my computer but that isn’t convenient.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Love! Love! Love!","reviewDescription":"Love my new series 8 watch!! So many different features.  Only thing I dislike is the battery life, it’s not a good as my series 3 was! Doesn’t last as long but I guess that’s because the screen is always on.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697241600000}
{"reviewTitle":"Love the watch but not nonstandard charger","reviewDescription":"I just upgraded from the original Apple Watch 1 to the Apple Watch 8.  I love the always-on display and all the other features but they lose a star for not shipping it with a charger with a standard USB connector.  No charger cube, PC or laptop in my house has a USB-C connector so the charger is useless to me.  Fortunately, the charger that came with my old Apple Watch 1 works with the Apple Watch 8.","isVerified":true,"ratingScore":4,"reviewReaction":"6 people found this helpful","country":"United States","date":1687737600000}
{"reviewTitle":"Apple Watch series 8","reviewDescription":"Lots of info. Good for health statistics. Battery needs to be charged every day, so that is inconvenient.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698710400000}
{"reviewTitle":"Doesn’t come with charging block for charging cable","reviewDescription":"Love the watch and even getting used to the cumbersome band that comes with it. Integrated easily with my IPhone 12 Pro Max. Doesn’t come with a charging block for the charging cable. The watch is useless without one. I knew that, but I had one with my iPhone and pad. How can Apple think that’s a fair way to do business. 4 stars for that BS!","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"No USB-C wall adapter not mentioned in description","reviewDescription":"Finally upgraded from Series 2 to Series 8.  Arrived on time but the watch battery was dead, and to my disappointment, there was no wall adapter for the USB-C cord provided. Shameful that a watch costs this much and Apple is too cheap to include everything to get going!  This definitely needs to be addressed in the lengthy watch description so one can order to have when watch arrives.","isVerified":true,"ratingScore":4,"reviewReaction":"22 people found this helpful","country":"United States","date":1687305600000}
{"reviewTitle":"The Watch itself is good...","reviewDescription":"This is my second Apple Watch. Obviously I like them or I wouldn't go for round two. My big disappointment when ordering was about band size. I need a larger one, but there was confusion around the order and I ended up with a smaller one. While I could return the whole AW order, I didn't really want to do that. Now I'm using a new watch with an old band because I can't just swap bands and buying one identical to the one I have is a ridiculous price. So I'm stuck. I bought an aftermarket band, but it isn't what I truly want. To all of you ordering, be extra diligent when picking sizes. Yes, I should have returned it, but I didn't.","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1675555200000}
{"reviewTitle":"Swimming laps","reviewDescription":"This watch keeps track of yards swam and can differentiate between the different strokes. It seems to subtract 25 yards from the total distance for about every 1000 yards I swim, so it’s not completely accurate. It is motivating me to complete yards in the pool however. It sends affirmations during the day when you complete goals, and that is also motivational.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Activation Lock- Amazon and Apple Refuse to Take Off","reviewDescription":"**** update****** Apple was eventually able to work with me to remove the activation lock but they are very particular about how to submit the proof of purchase and you need to document attempts of trying to handle this via Amazon first. Lengthy process that could be avoided if the activation lock was clear, bur happy with Apple in the end.I would buy new to avoid the time wasted. *****My refuirbished (used-like new) Watch came with an activation lock on it from the previous owner.I contacted Amazon for assistance, but they said that would need to go through Apple to get it removed and the refused to help beyond that (I was outside my return window since it was a gift months later).After submitting my case multiple times, Apple could verify the purchase I made, but can not do anything because of privacy reasons and that Amazon would have to help me (ping pong back and forth).There is no way for me to get into contact with the previous owner (obviously) and Amazon is not letting me return, exchange, or refund the item so now I just have a $300+ paperweight that would be perfectly functioning without the lock.Very disappointing financially and that the watch is now worthless.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Great until it breaks 3 months after the warranty expires.","reviewDescription":"Loved it until it stopped, conveniently right after the warranty ended. I loved the motivation it gave me to get out and walk around or workout. It was fun and informative tracking my health metrics on it too. Took it to the Apple store, called apple support, and brought it to Geek Squad, but no one was able to help. Very upset to learn that once an apple watch breaks, there's nothing apple can do for it - you have to buy a new one. Literally 3 months after the warranty expire, the wrist sensor stopped working, so I couldn't log any workouts, wouldn't get any notifications on my watch, couldn't do anything with it other than check the time and I didn't pay smart watch money to only be able to check the time.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Bad Battery Life","reviewDescription":"I purchased this about a month ago.Pros: I have to use my phone computer less which is very good.Cons: it doesn’t work as advertised. The podcast app is trash, terrible interface. And that’s an Apple app, you can guess where it goes from there. Also, it didn’t work with my iPhone. I had to buy an ALL NEW IPHONE for this thing. So it was more like a near 3000$ purchase for a glorified pace counter (the pace counter app doesn’t work, I have to use the health app and see paces in there).I do like the health features, but for this price and for how bad the battery seems to be I can get better.I’ve been buying Apple for a decade. This is my last Apple product it was such a bad experience and let down in tech.Edit: ended up selling the watch after several months.It is awful at connecting to my AirPods instead of the phone, even when the phone is not near.The battery life is so bad. It barely gets through a day. If you use the sleep feature then you have to spend almost 2 hours the next day charging it at some point. That’s so awkward and just not at all what I’d expect for the money. It’s a bad product, most the high reviews seem to be from people who reviewed it the day they bought it.I cannot reiterate enough how poorly the battery life on this lasts. Unless you work at a desk and can sit and charge it off and on all day, it’s just not good.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1698883200000}
{"reviewTitle":"if it weren't for segments, it would be the perfect watch","reviewDescription":"Bottom line:  if you sweat during a run, the watch starts recording segments at ridiculous intervals, like 25 yards.  You have to stop the run and start a new one.  Apple forums show I am not alone and it is not user error-it is wet sleeve or sweat.  It has reached the point that I am going to stop using this expensive item and buy a Garmin.  If it cannot perform the one thing I need it to, it is not worth it. I can live withtout the other feature and just rely on my phone.  Apple needs to fix this because otherwise, the watch is wonderful.  If you never work out, it might be great for you.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Apple Watch Series 8 Not What I Expected","reviewDescription":"I found purchasing the Apple Watch Series 8 confusing and not clear.  I was purchasing this for my Grand Nephew who just turned 10.  His parents and I agree that at 10 he is perhaps too young for a IPhone but the watch would enable him to call his friends who do have phones, text, and provide the ability to track his safety.  I spent large amounts of time in researching the capabilities of the Apple Watch Series 8 and purchased his watch from Amazon.  Sadly the first thing to go wrong - after a promise of a delivery date from Amazon Prime - the watch was 3 days late and not in time for his birthday.  We chose T-Mobile as our cellular provider and went in person to their store.  Just to find out that this particular watch was only WiFi enabled and NOT cellular enabled!  The watch cannot do what he wants to do --  talk and text.  The T-Mobile Customer Service Rep explained to me that this happens all the time and customers are very upset.  He said that the cellular enabled watch has a red button to indicate that it is cellular enabled.  I am now trying to return the watch to Amazon Prime and can 't seem to find a pathway to do so.","isVerified":true,"ratingScore":1,"reviewReaction":"33 people found this helpful","country":"United States","date":1688947200000}
{"reviewTitle":"PLEASE READ MY REVIEW BEFORE PURCHASING!","reviewDescription":"I have never been more disappointed with an Amazon purchase in my life…upon purchasing I thought I read enough reviews on this watch that said “it was really great..” and so on, I bought the watch new and not refurbished and it was delivered within a day at my house.first impression was it was really beautiful cosmetic wise and that it seemed like a very solid watch until the set up process happened, I’ve tried everything under the sun to get this watch to stop “unpairing” from my iPhone and have watched countless videos and have done countless research to help me ensure I have all of my (settings right on my phone and I have newest updates, charging life on both electronics…etc) didn’t do a darn thing,I guess the only hope I have left is if someone who has had this similar issue has any other suggestions as to what I should try and attempt to do.I also want to preface..that it appears in the reviews the only people who had luck with this Apple Watch from this seller was if it was the black one and not the grey aluminum.So again I’m at a loss as to what to try and do and will most likely be returning this item, what a bummer.","isVerified":true,"ratingScore":1,"reviewReaction":"14 people found this helpful","country":"United States","date":1694822400000}
{"reviewTitle":"Clunky to wear and use, no valuable features for me","reviewDescription":"I’ve had the Apple Watch for 7 months now and I can honestly say it is the biggest waste of money for me. It’s not comfortable to wear. It gives me no added functionality to my life. It got to where the only thing it was useful to me for was occasionally pinging my iPhone when I misplaced it\/it got stuck in between couch cushions. I am honestly baffled at what people get out of it… right now mine is sitting in a drawer and serving zero purpose. You can see in answer texts with it. You can answer calls on it. But none of these were useful enough to justify wearing it. I can just use my phone for all these things. Maybe it’s just me, and someone can explain why people like it so much, but for me I would not recommend nor buy again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709251200000}
{"reviewTitle":"Got a used\/defective one","reviewDescription":"Booooo! Poor form, Amazon, selling used\/defective Apple Watches. I was excited to finally get an Apple Watch and I waited for Prime Days to get a better price. All seemed well and good when I opened the Apple Watch. Then I realized it was dead! No charge at all. I plugged it in for a couple hours but it wouldn’t charge. It also wouldn’t ‘pair’. I called Apple to try to work through these issues. I figured it HAD to be me. Their efforts proved fruitless. They asked for the serial number and asked me if I bought it from the previous owner. I told them I bought it from Amazon and they told me their records indicated it’d been sold three months prior… to someone else. Needless to say, I took Apple Customer Care’s  advise and returned it to Amazon for a refund. Two weeks later and I’m still ‘pissed’ at Amazon for selling used, defective stuff. Though this isn’t the first time I’ve received a used or broken (usually both) item from Amazon, this time it seemed more infuriating. Seriously considering canceling my Prime membership and no longer giving Amazon my business.","isVerified":true,"ratingScore":1,"reviewReaction":"34 people found this helpful","country":"United States","date":1690588800000}
{"reviewTitle":"Buyer Beware","reviewDescription":"Received the item and charged before attempting to pair. Added the wrist strap and I was sent a 45mm band for the 41mm watch, wrong size. When it was fully charged, I tried to pair and the device wasn’t able to pair because it was linked to the prior owners account. Since the device had activation lock enabled, I’m not able to use the device at all. It would have been possible to submit a ticket to Apple to remove the activation lock, but Amazon didn’t send the serial number to serve as proof of purchase! It was packaged in a shipping bag with a cable and strap, no box, no paperwork. So now I have to send it back on day 1. Beware of the activation lock and also the return window. Since the item is Amazon renewed, the listing states a 90 money back guarantee but the return window is only 15 days! Buy with caution and patience. The only return option is through UPS pickup with a 30 day processing window. Would not recommend for a gift either.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"A functioning watch","reviewDescription":"I bought this watch 4\/20\/23 and it just died 6\/21\/24. Just over a year and they want to charge me 300+ dollars to fix it. Or the best suggestion was to purchase a new watch. Don’t waste your money. This is the second Apple Watch in a 3 year span to just randomly die. Save yourself the headache.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Some functions highly innaccurate, most apps require subscription","reviewDescription":"The sleep tracking is super inaccurate and almost all the apps for it require subscriptions, especially health and exercise ones! Many of the functions only work with paid subscription apps or work very poorly with apple health which then requires you to purchase a subscription for a better app. Highly overpriced for the value of what you actually get from apple. The battery life has also pretty much halved since I purchased 2 months ago, something I noticed after just a week or 2","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"heavy and uncomfortable","reviewDescription":"Wearing an Apple watch is convenient in terms of receiving notifications and monitoring movements and sleep. It integrates easily with iPhone and is easy to setup and use.One feature I really wanted was measuring blood pressure, which watch 8 doesn't have but I heard it will be available early next year. This means I will have to upgrade within a year of purchasing this one.One complaint I have is that the watch is heavy (for a petite woman) and very uncomfortable, especially during intense workout.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"unable to charge out of box","reviewDescription":"I am disappointed that I have to order additional equipment to charge my watch. It would be nice if you would advertise that it doesn't come with the adapter\/wall plug\/computer adapter to charge the watch. Yes, it comes with a power cord with the NEW type C end but not the additional item needed. If given the information with the purchase, I would have bought it. But, now I have to wait a few days in order for the additional order to be delivered. POOR CUSTOMER SERVICE in my opinion.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"Well I bought a watch…","reviewDescription":"I wanted a smart watch for a long time. Bought one and rarely wear it.  Not sure how to use it. Really wanted to use the sleep track but no idea how to use it.  I do wish it came with instructions.  Would I buy again no.  I would of sent it back but forgot to so  I’m stuck with an expensive smartwatch paperweight.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1698969600000}
{"reviewTitle":"Some apps don't work as expected","reviewDescription":"I bought this for my husband birthday. Box arrived without the sealed clear plastic and shipping time was too long. When initiating the apple watch it had problems with the operating system but we were able to install it. After a few days in use the workout app is not working as expected it stops whenever it wants and does not record workouts as other apple watch we have.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1701475200000}
{"reviewTitle":"Great watch","reviewDescription":"While I love the watch it only lasted a little less than a year. It still works but it doesn’t hold a charge like it should. I used to get at least 2 full days before having to charge it. Now it doesn’t last a full day. Very disappointed. For the money they should last longer than that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700870400000}
{"reviewTitle":"iphone software must be version 16+","reviewDescription":"The software on the apple watch 8 I received needed to be updated in order to pair with my iphone 13 pro, but I couldn't pair it because the software isn't updated.  My techie husband and I spent hours going in circles trying to pair it, but it just went in circles back to the starting point.  We tried unpairing my old watch, updating iphone software, turning off\/on, etc. Eventually, we figured out that my iphone software could be updated again to 16.0.3.  After updating the phone, the watch pairing and software updating worked.Apple support was not helpful.  I tried to make an appointment with the genius bar nearby but I was directed to a chat or call.  I called a support person and he didn't have any tips.  I also tried a chat with Apple support.  The first rep (or bot) ended the chat with a customer support survey link and then a second rep or bot asked how he could help.  If either rep would have instructed me to confirm my phone was at least version 16, it would have saved me hours of time.","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1666051200000}
{"reviewTitle":"Nice product… BUT","reviewDescription":"I bought it specifically for the electrocardiogram function, but this function is not available in my country of residence, someone who has influence at Apple release the function for the whole world","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"It’s not much of an upgrade over the Series-7","reviewDescription":"I gave away my Series-7 to a family member and got the Series-8.  It really is a very minor update over the Series-7.  While the Series-8 includes a new “temperature” sensor, the Series-7 comes with lots of color options that matches your style and taste.  In all honesty, the “temperature” feature is not even what you expect it to be, I thought it could track my actual temperature and it would tell me if I’m getting a fever or something.  It doesn’t do that, it was meant to track “ovulation.”  As a male, it is pointless, I would rather have the color options.  Additionally, in terms of accuracy, sleep tracking, and battery life, it is just ok.  It is no better than the Series-7 in terms of battery life, the accuracy of readings and sleep tracking is ok at best.  I love apple products but it really isn’t as accurate as I would like it to be.  Just keep your expectations reasonably low and you won’t be disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1667433600000}
{"reviewTitle":"You can get the same apps and workout health info on your iPhone.","reviewDescription":"This was hard to set up even though your phone 13 pro max . It must be updated we had auto update but doesn’t work if your phone is set on alarm . Free app for three months with purchase but if you are really into getting healthier you need more which you could buy for your iPhone . Water resistant is not waterproof so swimming in it seemed scary and expensive if it wasn’t. It doesn’t do anything your phone won’t . I found I really don’t need this expensive thing to worry about I have apple care on my phone","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689379200000}
{"reviewTitle":"Switched from FitBit","reviewDescription":"Switched from a FitBit which I could navigate through the options pretty easy. Apple watch has to many options that I find not necessary for me but can't remove.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698451200000}
{"reviewTitle":"Inaccurate eeg results","reviewDescription":"I purchased the Apple Watch mostly for being able to run a EEG . I have been disappointed to say the least , the results are not accurate !","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1700956800000}
{"reviewTitle":"All the hype","reviewDescription":"The watch honestly can be replaced by a fit bit . I don’t if I got a bad one but it’s not calibrated correctly . It says I’m standing when I’m not . Claims I am moving when I am not . I think it’s over priced . It’s Apple after all","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691625600000}
{"reviewTitle":"Watch is fine. Defective adspter","reviewDescription":"I loved the watch.  Problem the adaptor, I believe is defective.  Does not fit any of my banks.  I was told to return it.  However, I bought it during Prime days.  Although I can return I cannot replace, which means. I would have to repurchase which would be a hundred dollars more.  So really it’s just cheaper to purchase another adapter.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Short Battery Life","reviewDescription":"I like most things about this phone, but the heart rate isn’t correct, when I read at night the phone thinks I’m sleeping and the battery life is SUPER short! Every day the battery needs to be charged. My little Fitbit would last 3 days before needing a battery charge.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690070400000}
{"reviewTitle":"Overpriced for Functionality","reviewDescription":"Nothing special. I had a version 1 42mm that died so I got the latest version in the 45mm. I then realized that it’s nothing more than a legit, glorified watch that sends me notifications of spam emails and some texts. Regerts…. No need to spend the money on this thing for what I use it for. Should have gone with like a 5 or something.The screen is large and I can see videos and pictures as long as my phone is near which is fine but there’s not a lot I use it for. Plus I had to get an otter box case for the screen. It’s not meant for carelessness. Bang it into something and that screen is dead!","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1692489600000}
{"reviewTitle":"Looks good and very useful","reviewDescription":"I got it but they gave me the wrong size, I ordered a 45mm and ended up getting sent a 41mm but decided to try it out anyways and was good just hopefully when I return it they give me the right size.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Fast shipping, great health features.","reviewDescription":"First apple watch for me and i can say that i love the features of this watch. Only downside is that i am allergic to some metals and something in this watch is triggering the reaction (see above). I have ordered new bands to see if they will help.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689897600000}
{"reviewTitle":"Battery Life","reviewDescription":"I like the Apple Watch 8 Series except for the battery life. I literally have to charge it every night in order for the battery to last all day. This shouldn't happen, the battery should last a lot longer. Other than the battery life, I love my Apple Watch.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"No user control of apps etc.","reviewDescription":"I bought this watch to replace a 3 year old series 5 that went into a “reboot lock “, as was diagnosed by the Apple websiteThe new watch took ages to pair to my iPhone, when done it was totally confusing to use. It would constantly ask for my password, even when I wearing it.Trying to eliminate unwanted apps provided to be impossible, even with assistance from the Apple team.I returned the watch to Amazon where I had bought it.It was dropped off at UPS store Dec 2 , 7 days ago, so far no sign of my refundIt took until Jan 7 th 2023 for the refund to be credited to my account","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1670457600000}
{"reviewTitle":"Battery doesn't last long","reviewDescription":"If I don't use any of the Apps on the watch the battery lasts a long time. But I use some of the Apps and have to charge the watch in 36 hours. Very disappointing.I like the ECG, Compass and Workout Apps. I like variety of faces for watch. But I would like to choose options to display with the faces.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"🌟DO NOT PURCHASE 🌟","reviewDescription":"Posted 4 star in the hope more customers will read.  I didn’t read the one star reviews before I regrettably purchased from the company. The watch I bought was connected to another iTunes account.  You need that email and password to unlock it.  They also keep delaying my refund!!!  DO NOT BUY FROM THIS COMPANY!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1705363200000}
{"reviewTitle":"Great Watch but Not Band!","reviewDescription":"I love this Apple watch. I feel like Dick Tracy when I take a call on it. It's my first and came close to being my last, since the band (and watch) came off three times in the first few days of owning it. The last time it came off while I was working under some trees with lots of fallen leaves. Luckily I was able to locate it fairly quickly (Find My Watch\" was no help) but then I was afraid to wear it until I was able to buy a different band. The sports band that it came with hangs off on one end and is easily caught on things and comes undone and falls off your wrist. I bought a magnetic band that stays put. It even provides entertainment to any dining companions when the occasional fork or knife sticks to it like magic while I'm eating!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Important-read if it won’t charge","reviewDescription":"I couldn’t get this to charge. I followed all troubleshooting. Then texted with apple then went in person. Neither the chat support nor the in person tech mentioned this. But if it won’t charge but you know that charger works(I could actually plug my phone in right after), your charger might just not be strong enough. Please try buying a new charger before going in or returning. Apple teach your people and add this to your support page. Adding photos of issues and resolution. Hope to update how it’s going after a bit.However from the one day I used my commentary is this WAY less user friendly than a Fitbit. There are three different apps this integrates back to on your phone, health, watch (shouldn’t that be only one), and fitness. In addition I got to get more consistent notifications and did not manage to get set up as I wanted within a couple hours of work.","isVerified":true,"ratingScore":4,"reviewReaction":"8 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Apple Watch 8","reviewDescription":"I purchased the new Apple Watch 8 for my wife as an anniversary gift. She loves anything and everything apple, and I myself prefer other options.As for a review, I am comparing the Apple Watch 8 to my Garmin Venu 2.Many of the added and new features of Apple's newest watch, like SOS and biometrics monitoring, have been a staple in their competitors' products for a while now.Comparing the responsiveness of the Series 8 to the Venu 2 is quite a big leap, as the Series 8 has a faster chip and can perform many tasks, including video animations like Toy Story characters running around the screen with phenomenal clarity and resolution, which is one thing it does that my Garmin does not.Comparing the reliability, however, does show how Apple is lacking in the functionality of its watch. To start, the GPS signal in the Garmin is better than the Series 8 when out in the wilderness or anywhere where the signal may not be as great, whereas the Series 8 seems to lack a proper signal. As well as my Garmin has more accurate biometrics reading when comparing our vitals being monitored with a pulse oximetry device.Overall the build quality seems comparable to my Garmin, as both have been plunged into deep enough water, both in the ocean and in 10'  swimming pools. Neither has shown any water damage since. For impact damage, the Apple watch seems to be more resilient as my Venu 2 has a few dings here and there for it hitting desks, and normal wear and tear, yet the Apple Watch still looks as good as it did out of the box.Overall, the Apple Watch 8 is a great product for someone who likes to stay in the Apple ecosystem.","isVerified":true,"ratingScore":4,"reviewReaction":"243 people found this helpful","country":"United States","date":1667001600000}
{"reviewTitle":"Satisfied","reviewDescription":"Previous watch was just a tracker so this is my first smartwatch. Both the face and band are larger than what I'm used to but I'm adapting. I like that I can actually see the information on the watch without having to put on my reader glasses all the time. It's really convenient to see texts and receive calls although callers often say the clarity is not great. I like the tracker options and the ability to set daily goals and see progress. I'm still figuring out all of the features and likely don't use as many as I could. Battery life lasts about 36 hours for me because I don't have high usage. So far I'm satisfied with the purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697760000000}
{"reviewTitle":"Great product, but fragile","reviewDescription":"I use this watch for everyday use, after a few weeks of use, it did not turn back on after a hot tub session.  The watch would make sounds, but the display was dead.  Luckily I had AppleCare+, but I expected a water proof watch that's advertised as capable of swimming and being resistant to water to not break after submerging into a hot tub for 20 minutes.  Other than that, all of the features and apps work really well.  Find my phone is probably the most useful feature on it... If you turn off the always on display (default setting is enabled) the battery can last twice as long as the previous iWatch I had (Gen 5).  Overall, very happy.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1695600000000}
{"reviewTitle":"Works great","reviewDescription":"I can track my daily activity and get motivated to meet my set activity goalsI can track my sleep activity to try to improveI can track my hart rate to detect any abnormalities before is too lateI have use it in the water environment and still workingI can answer calls and messages without pulling out my phone from my pocket or even is not within my reachI can see images on my phone from notifications and provides access to multiple applications with the basic access to avoid pulling out your phone as oftenIt does not scratches easily and is easy to clean and disinfect after an exercise routineBattery can easily last the entire day and charges quickly, usually I do it during the time I take a shower and that is enough to last me until the next day since I do not charge it at night because I use it to track my sleep .","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1689811200000}
{"reviewTitle":"Good watch but the band is not.","reviewDescription":"The watch is good. Very helpful. However the band is really poor. Order a better band when you order the watch.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1708732800000}
{"reviewTitle":"Get different watch band","reviewDescription":"I love this watch.  It tracks your activity level which is a feature I really appreciate.The silicone band irritated my skin - caused a rash - so I switched to nylon bands for exercise and metal bands for dressing it up.Battery life is much better if your display isn’t always on.  Didn’t go all day with the always on setting but now I just usually charge it once a day if active and it goes longer on other days.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701388800000}
{"reviewTitle":"Caja abierta","reviewDescription":"No se x q la caja viene abierta si el producto es nuevo o no es nuevo?","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689638400000}
{"reviewTitle":"Can’t add to cell plan","reviewDescription":"The watch is great but u can not add it to cellular pan","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Missing Charger","reviewDescription":"Everything came with it but i was opened and my charger was missing. Very dissatisfied with this!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Battery life sucks","reviewDescription":"I have worn this watch for about 2 weeks now, and frankly, I'm on the verge of returning it. I have to charge it EVERY day.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1682899200000}
{"reviewTitle":"Battery life","reviewDescription":"I am constantly charging this thing","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1693094400000}
{"reviewTitle":"Product is Bluetooth compatible only","reviewDescription":"I bought this thinking it could be added to my cellphone account.  Instead I found it was only Bluetooth compatible at my cellphone provider.  I am now trying to return it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1676246400000}
{"reviewTitle":"Glitches after return date","reviewDescription":"Of course a few days after the return date the watch started glitching and getting stuck on certain screens. Very disappointing","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Watch Band too big.","reviewDescription":"The watch and is too big despite ordering the size that should fit my wrist.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1686873600000}
{"reviewTitle":"Poor battery life","reviewDescription":"Watch had poor battery life.  Has been returned but refund not yet recieved.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Battery last a day and a half ish","reviewDescription":"I barley use mine bc you have to charge it so often.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1687219200000}
{"reviewTitle":"Battery life is a decision point!","reviewDescription":"I bought this during Amazon Prime days and returned it after 3-4 days of use. I had to charge the thing twice a day, otherwise it would die on me when I am in the middle of a run\/long walk. It happened to me twice so I decided that it wasn't the thing.Other than battery life, everything else is great! However, I do not need all the other cool bells and whistles because I can use my phone for that stuff and I don't want to be bothered with all the notifications throughout the day.If its battery would last for 4 days, it was going to be a champ!","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1690934400000}
{"reviewTitle":"Get an Apple Watch support a good cause","reviewDescription":"I’m happy with this Apple Watch- it came brand new even though it didn’t have the original plastic wrapping on their outside box, it still had the sealed tapes. It was easy to set up and also an easy learning curve for use. The screen is perfect! My only complaint is with Apple for not proving a USB-C plug for the USB-C cord. I’m reluctantly using my iBook plug to charge the watch until i can get a new plug. This should be explained in the numerous description information and the photos. Yeah, it shows the cord- who would think it didn’t come with the plug?I’m thrilled also that Apple partnered up with Product Red so  that i could support a cause that I have a huge respect for- that of preventing HIV and AIDS. I had a family member die of AIDS and if the research and prevention happening now had happened in the early 90s then she might not have died from a tainted blood transfusion and could’ve afforded the medication protocol. So for me- this watch is not only my favorite color, but also a purchase to support a cause I feel strongly about. Product Red also helps solve Poverty, and Health Care throughout the world.","isVerified":true,"ratingScore":4,"reviewReaction":"38 people found this helpful","country":"United States","date":1667433600000}
{"reviewTitle":"Good!","reviewDescription":"I am using it for months now.. i like how it tracks sleep, exercise and heart rates.. i love using it. Only thing is i have to charge it once a 1.5 day..","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702857600000}
{"reviewTitle":"It’s a real convenient second phone","reviewDescription":"I loved it 😊 soo much but only changed it to the bigger model but other than that  it connects seamlessly very comfortable blazing fast and Ik it’s a bit pricey but being able to respond to a message without needing u phone is hand sometimes or even the maps being able to direct u from the watch but all said and done it’s and amazing purchase 😂 and me nuh normally trust reviews but diss a from a yaad man yzm peace ✌️","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"Apple Watch 8","reviewDescription":"What disappointed me most that it doesn’t come with a wall plug adapter for USB-CI had to order one so I would charge the phone for another $8.00 and another waiting dayI think it’s petty for Apple to not ncluding that with the watch, after all the watch wasn’t cheapThis is my reason for only giving it 4 stars","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"Does not come ready to charge","reviewDescription":"As a swimmer and runner, I bought this to track my workouts. So far it has been great for both, and the build in heart monitor is a nice feature. I was pretty disappointed, though, to discover that it doesn't come with all the components to charge it. As indicated, it comes with the charging cable, but it does not come with any USB-C outlet adaptor so that you can actually use the cable. For $400, I would expect the watch to come with ALL of the necessary components. At minimum, it should be made absolutely clear that you will not be able to use this out of the box without an additional purchase. For like $6 extra dollars, Apple could have made me a very satisfied customer, but instead I'm left annoyed and wishing I would have gone with Garmin after all.","isVerified":true,"ratingScore":4,"reviewReaction":"125 people found this helpful","country":"United States","date":1687824000000}
{"reviewTitle":"Great price for the watch","reviewDescription":"The delivery was the next day compared to the 2day delivery it had scheduled. Watch came in original Apple Watch box, all the seals were intact with all original apple bands and charger. The watch charge was at 85 percent and I charged it for about 30 minutes till a full charge. Had to update to the latest IOS, but was able to set up my watch prior to it restarting after update. Overall, very happy with the purchase and the product after a day of full use. However, the watch alarms are lacking were you have 2 sounds( bird chirp and bell chime). Oh, and the designer of the watch band should be fired. Would recommend new band after purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"very honest review","reviewDescription":"All I have to say is, I love the product, it’s powerful, smooth, fun to use, but the only problem I have with this device is that it’s so small, I high recommend getting the larger screen, if you’re taller than 6’1, to me it’s not bad but is it worth the price of a tiny watch and you “DONT” have cellular coverage or connectivity for your watch, I say NO unless you get a larger screen and cellular connection included, make sure to check in comments about the cellular because most comments doesn’t say anything about the cellular connection!!!","isVerified":true,"ratingScore":4,"reviewReaction":"19 people found this helpful","country":"United States","date":1693785600000}
{"reviewTitle":"Great gift idea for the price","reviewDescription":"Worked great, great price, easy connection, lots of versatility with accessories!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703980800000}
{"reviewTitle":"Great except the battery life","reviewDescription":"The only complaint I have is that the battery life is abysmal. I read reviews and didn’t think it was going to be such a hassle. I was wrong. Also make sure you have a wall adapter that has a USB C port in it, as the provided charging cable ends in USB C. I missed that during my research and had to go purchase one separately.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"No watch","reviewDescription":"Was super excited to get my watch but when I opened it the box with the watch face and charger was empty as shown in pics.  Called to get it corrected and they won’t send an actual watch. I have to wait for ups to pick up what is essentially a 400$ watch band and empty box.  Then wait for them to receive the box to then wait up to 14 days from receiving return to get refunded and ultimately figure out if I’m going to risk ordering another empty box.  In my opinion they should over night a watch once ups confirms they picked it up. I was going to utilize the EKG feature as I have heart issues and my Samsung won’t work with this new iPhone. Sham on Apple for sending an empty box for 400$ and then to follow with poor customer service that forces me to be at their whim to get my money back.  They took it faster then I can get it back for the EMPTY BOX they sent me in exchange for 400$.","isVerified":true,"ratingScore":1,"reviewReaction":"91 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Constant issues","reviewDescription":"I’ve had nothing but issues with this watch. It won’t stay connected. It randomly shuts off and freezes. It appears to be charging but doesn’t actually charge. It currently won’t charge on any of the 4 different chargers we have in the house but the other 2 watches work on them just fine. It isn’t even a year old!  My previous watches lasted for over 5 years each. I will NEVER again buy a product like this on Amazon ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1710460800000}
{"reviewTitle":"Not New!","reviewDescription":"I was expecting a new Apple Watch but it is NOT new! You can clearly see that it was opened and returned a few times. Won’t know if the watch actually works until I give it to my daughter when she graduates. Might update the post later if it seems it all works!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1715644800000}
{"reviewTitle":"Still waiting on my refund","reviewDescription":"I received this and was so excited to set it up. It was still registered to the previous owner. I called Apple and they told me that as a protection to the original purchaser I would have to have their email and password in order to set it up in my name. I returned it almost 2 weeks ago, the received it just a couple days after my return yet I am still waiting on my refund and can’t find a way to contact anyone about it other than a robot that gives me no information. I want my damn money back, it was over $300. You sure took it from me fast, why would it take so long to return it?","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Died within 3 days of arrival, called apple care, after two weeks still not shipped","reviewDescription":"Bought brand new for my wifes birthday with 2 year apple care.  Died within 3 days of arrival.  Called =Apple Care immediately but after two weeks they still had not shipped a replacement.  Called 5 times in that two week period.  Finally just called Amazon and returned product to Amazon.  Tried to cancel the replacement at Apple CAre but they could not cancel it.  It had not yet shipped, but they could not cancel it.  They have a $468 hold on my credit card even though they had not shipped it.  Apple CARE SUCKSSSSSSSS.  Do not buy.  Do not waste time with Apple Care, each call was 45-60 minutes long as it moved up to the next Supervisor who could not do anything to help.  It was the last call when the excuse changed from \"we are too busy\" to \"it is pending shipment\".  What a Clown show","isVerified":true,"ratingScore":1,"reviewReaction":"38 people found this helpful","country":"United States","date":1666656000000}
{"reviewTitle":"Quality","reviewDescription":"I only had this watch for under a month. Only charged it once and after that charge while on the charger in the morning it wouldn’t power on. I have no clue why it wouldn’t turn back on. I tried everything possible to turn it back on. I had no choice but to return it especially being a fairly new purchase.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1709769600000}
{"reviewTitle":"Not a Apple watch series 8 45mm","reviewDescription":"There was a sticker on the box that said Apple watch series 8 Gps 45mm. But it did not cover the other sticker on the box that said. Apple watch SE. (much cheaper watch) And that was exactly what was in the box. I knew something wasn't right when the box had no shrink wrap around it. When I looked inside the watch was no way a 45mm as my husband has a 45mm Apple Watch. Very disappointed. I feel they were trying to pass this off as a true series 8 watch. And maybe no one would be the wiser. Why would you even need to ADD a sticker to the box if it was a genuine series 8 45mm.  This is suppose to be a brand new watch.","isVerified":true,"ratingScore":1,"reviewReaction":"43 people found this helpful","country":"United States","date":1681344000000}
{"reviewTitle":"Wouldn’t charge correctly","reviewDescription":"We could not get this watch to hold a charge\/charge properly. We tried several outlets, boxes etc and even charged overnight (it indicated it was charging but after 12 hours it only charged 6%). We even watched several YouTube Videos to ensure we weren’t doing something wrong or there wasn’t a trick we had missed. I did read that sometimes if a watch is not charged correctly and loses its charge, it can no longer recover\/work. It came to us with only 4% battery and we plugged it in right away, so am not sure what that threshold is. Had to return it and decided to purchase at a real store to avoid a similar issue.  Clearly this unit was defective.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1695081600000}
{"reviewTitle":"Item received was damaged, but operational.","reviewDescription":"Purchased this item under the impression it was on sale and a great deal, but upon receiving I noticed the box had been opened and the Apple Watch had a very noticeable scratch on the corner from someone dropping or hitting it. There were one or two faint scratches on the screen as well, but I did not both trying to capture those, because this damage to the outer casing is more than enough to have me very upset. Due to the product being damaged, I returned it. The watch did work, but I did not proceed with setting it up to find out if there were any electronic related issues.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1699315200000}
{"reviewTitle":"Need to restart often","reviewDescription":"I’m honestly very unhappy with this watch due to the amount of times I have to restart it to get it to work. I wish I would have gotten it at AT&T again, I never had this issue before. Sometimes it won’t connect to my fitness, sometimes it won’t let me scroll, sometimes it freezes on messages. I’ve only had it since November and I’ve restarted it 9 times. I restarted my 5 maybe twice in 4 years.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706572800000}
{"reviewTitle":"Very easily scratched","reviewDescription":"You would think since this is a high-end watch, the screen would be somewhat able to endure minor scratches. However, within the first few days, I noticed scratches on the screen, and I have a white collar job offer, which keeps my other watches looking new.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"Brand new?","reviewDescription":"This Apple Watch is overall fine, but the packaging looks like it has been repackaged and doesn't seem brand new. Please see the photos.I was hesitating whether to return it, but in the end, I decided not to.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Coverage","reviewDescription":"Excellent watch. PLEASE GET COVERAGE! Amazon didn’t offer coverage, something happened and Apple will charger me the full cost of the watch to repair it. Not happy!!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1701043200000}
{"reviewTitle":"This product lives up to it's promise","reviewDescription":"This product does everything they promised it would do and more. It becomes sort of a Big Brother, in a good way and can really change your behavior. If you are worried about sleep issues (apnea) or irregular heartbeats this will track and record that. Otherwise it is somewhat redundant to your iPhone.The only real downside I see is the very short battery life. A pain in the rear end to have to recharge every night.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691366400000}
{"reviewTitle":"Love this watch; battery not so much.","reviewDescription":"I got a great deal on prime day. And I love this watch, my only complaint, and it’s directly with Apple is the life of the battery it’s ridiculous. I have to charge it every 18 hours. I don’t even get a full 24 hours out of it if you remember, to charge it every night when you go to bed then you’re OK. No regrets buying it. I upgraded from a versa 2 but this battery sucks.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690848000000}
{"reviewTitle":"Apple Watch Series 9 announced and released 2 months later","reviewDescription":"It's a good watch but I bought the latest one only to find out that the Apple Watch Series 9 was announced and released 2 months later.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1700352000000}
{"reviewTitle":"Good value for a smart watch","reviewDescription":"I always wanted to Apple Ultra, but almost double the cost and the benefits for the Ultra for me was just longer battery life, then then this is good enough for me.  It has all the features like activity tracker, pulse rate, ECG, apps, and a hosts of other features!  And the best thing of this has a lot of accessories and the battery life isn't an issue for me for most of the day.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"At this time it doesn’t seem much different from my Series 6!","reviewDescription":"It’s probably my own fault for not doing enough research, but I bought this to upgrade from my Series 6 Apple Watch, and unfortunately I am not seeing a difference in performance or applications that is worth the cost of upgrading.  Hopefully there will be some developments in the near future that will help to change my mind, but for now I’m asking myself, “why did I do it!”","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690934400000}
{"reviewTitle":"Watchband is for tiny people","reviewDescription":"I am not a big person.  5 feet five inches and 160 mounds.  The watchband is not even close to fitting.  Had to return the watch and order one with the medium to large band.  Unless you are a slim female I recommend the medium to large band.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694217600000}
{"reviewTitle":"Apple Smart Watch","reviewDescription":"A great watch that has a lot of applications. I especially liked the ECG function.  Clock screen looked great.  Paired great with my iPhone.  It has only an 18 or 24 hour battery life; that was the only thing I didn't like about it soI returned it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695600000000}
{"reviewTitle":"IMEI","reviewDescription":"There should be better description if watch has to be connected to the phone or can it have a separate\/ standalone SIM card. It was very misleading. ATT said to look for the IMEI serial number to have both capabilities to pair with a phone or a separate SIM card.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"Wrist band is too tight.","reviewDescription":"Apple watch Series 8 41 mm, comes only S\/M wrist band, which is too small. My watch is so cumbersome, the botton fits only on the last hole, making it difficult to put on. Some Apps done work because it says it is too tight. Apple or third party do not offer to replace the strap; just return of the whole product.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689292800000}
{"reviewTitle":"Wouldn’t buy","reviewDescription":"This watch dies less then 24 hours.  I used to have a Fitbit, brought it for 100.00.  This Apple Watch was over 300. Yes, i can text and answer call on it. It’s a real inconvenience if it’s always dead.I would rather wear the Fitbit again!Terrible watch.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"must be charged nightly","reviewDescription":"I love the watch. It does some things well, heart rate, some tracking with exercise. It looses out in hiking at altitude and during rainy weather. the battery life is short.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"Missing charger port.","reviewDescription":"The usb cord was present, but nothing to insert it into. How I’m a supposed to charge the watch? 👀‼️😒 Funny thing is, I bought two watches and both were missing.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Watch is great but the charger cable doesn't work it didn't come with a charger block either.","reviewDescription":"Watch is great, not my first Apple Watch but the charger cable doesn't work. It also didn't come with a charging block which is a different connection type from the USB from my I Phone and previous Apple Watch. Purchased the correct charging block and the cable still doesn't work. I would like a replacement but there isn't a way to request one (at least that I can find on Amazon).","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1683504000000}
{"reviewTitle":"I love the watch, but the band keeps coming undone","reviewDescription":"I love the watch, but the band keeps coming undone.  The watch has actually fallen off of my wrist three times so far and I just got it a couple days ago.  Bad band design!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
{"reviewTitle":"No power adaptor. How cheap can  you get.","reviewDescription":"I don't know if I will like this watch or not.  The power adaptor is NOT included with the watch. The charging cord is included.  At this price, how hard would it be to include the power adapter.  Not hard at all.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Good other than battery sucks","reviewDescription":"This is awesome in every way, EXCEPT that the battery life is horrible. It barely lasts a day, sometimes not even. Very disappointed in that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693008000000}
{"reviewTitle":"Does not include brick for charging","reviewDescription":"I like the watch and Prime day deal was great, but what good is the charging cable without the brick to charge it?","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695513600000}
{"reviewTitle":"pretty but not worth the price","reviewDescription":"battery life is minimal.  Watch is constantly parked on a charger.  I like Apple, but this was not a smart purchase","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1692230400000}
{"reviewTitle":"Battery","reviewDescription":"This a great little watch, but it seems like I am charging it all the time. The Di told me to buy this because it monitors the heart. It doesn’t take blood pressure. My last watch did them both and coat 1\/3 of this watch. I am very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"Push-mowed for 2 hours up and down hill in this heat and it said I had 1 minute of exercise!!!","reviewDescription":"About all it's good for is ringing when I get a call provided my phone is close. It is also good if you need the time. The health benefits suck!!!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690502400000}
{"reviewTitle":"Don’t love it","reviewDescription":"Not great. Ok for a fitness tracker, but limited for anything else","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"Battery life is poor","reviewDescription":"Maybe it’s just me but the battery life is so sub-par in comparison to other smartwatches and even older versions of the Apple Watch. Disappointing overall that this can’t last more than a day and a half without battery dying.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"How do I get the refund on a watch I did not order. I never ordered 2 identical Apple Watches & appr","reviewDescription":"Great watch but I did not order 2Apple watches.  Since you say I cannot return it, I will recieve a full watch & appreciate an immediate refund","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690761600000}
{"reviewTitle":"AC Power Adapter","reviewDescription":"AC Power Adapter not included in box. Apparently sold separate. Misleading in description. It came with the magnetic cable, but nothing to plug it into. RIP OFF","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"My Apple Watch is not charging","reviewDescription":"Since I got it I am struggling to charge the Apple Watch.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Device came repackaged nicely however it was Activation Locked.","reviewDescription":"Device came repackaged nicely however it was Activation Locked.This renewed product was still tied to the previous owners Apple ID and was thereforeunusable. Supposedly you can contact Apple and provide the IMEI device information andproof of purchase and they may be able to assist. YMMV - Buyer beware.","isVerified":true,"ratingScore":2,"reviewReaction":"12 people found this helpful","country":"United States","date":1665705600000}
{"reviewTitle":"Not worth the money","reviewDescription":"My watch is already acting up and I cannot hardly ever make a phone call and they can't hear me. I paid too much for it to be acting like this.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1684195200000}
{"reviewTitle":"I love my accountability partner!","reviewDescription":"The Apple Watch is my accountability partner. It reminds me to stand up and move. It monitors my physical activity -- exercise, move, and stand. One of my friends got the Atrial Fibrillation alert and his life was saved, it is a serious condition, the doctor was impressed and had him rushed to the ER to stabilize. That's a powerful motivation to invest in the watch. I have an iPhone and its integration with the watch is seamless. Prime delivery, Amazon rules.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1697932800000}
{"reviewTitle":"Battery life lasts about 2 days","reviewDescription":"The battery life of this watch does not last very long. Other than that, I love this watch.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710547200000}
{"reviewTitle":"Great price for a great product","reviewDescription":"I really wasn't sure I was *that kind of guy* that needed an Apple Watch.  Ever since I got my first iPhone, I stopped wearing a watch altogether other than as jewelry for date-night.  But boy, this is nice.  No more searching for my phone when I hear the 'ting' of a message coming in; I just quickly glance at my watch, I see who sent it, and it's easy and super-fast to ignore and go on with my life.  I now use the activity tracker, and even answer calls with it rather than digging through my pockets looking for my phone.","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1696809600000}
{"reviewTitle":"She love the red color!!","reviewDescription":"I bought this item for my wife, she is very happy with it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"As expected","reviewDescription":"It’s an Apple Watch, as expected. It seems to work just fine. I like how it pairs with my iPhone. The battery lasts me about a day and a half when I have the “utility” face in use. It takes a while to charge, so I usually start that process when I go to take a shower. I mostly use it to track my sleep and my exercise as well as to get notifications from my phone and set timers.  I use a screen protector to keep the face safe from cracks and scratches.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1697500800000}
{"reviewTitle":"Good watch !!","reviewDescription":"Got this for my wife and she absolutely loves it. It was definitely a good buy, we love the walkie talkie feature it almost brings us 90s kids back to our childhood days lol.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705622400000}
{"reviewTitle":"Smart watch","reviewDescription":"It has allowed me keep track of health and fitness","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711497600000}
{"reviewTitle":"Birthday Present","reviewDescription":"Our daughter is a nurse. She uses her watch constantly and enjoys the 45mm size immensely!! She has told me several times how much she likes the new Apple Watch. Going from a Series 2 to an 8 added a ton of features and better battery life. Ordered from Amazon due to price and Amazon’s amazing customer service. I originally ordered the wrong size watch and they were able to arrange a refund and I reordered!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1698796800000}
{"reviewTitle":"So much better than a Fitbit!","reviewDescription":"I used  several different models of a Fitbit for 5 or 6 years.  But, the last time I bought a new Apple iPhone, the Fitbit would not stay connected via bluetooth.  So I bit the bullet and bought this Apple Watch.  This was by far the best price which made this an easy decision.  I am enjoying this Apple Watch so much more than I imagined.  It is so seamless working with my iPhone.  My only complaint is the battery life.  Using the apps takes a lot of power.  I have made some adjustments to only use the apps I really want like Messages, calendar, weather.  I still have to charge about every 24 + hours, but the good news is it only takes about 30 minutes to charge.","isVerified":true,"ratingScore":5,"reviewReaction":"53 people found this helpful","country":"United States","date":1684886400000}
{"reviewTitle":"Like the upgrade","reviewDescription":"I’m glad I upgraded has a few new features. I don’t think the battery is any better but I like the feature that makes the face stays on more. Maybe that’s why the battery seems to be about the same because it uses more battery to stay on. Also, I think it’s new to have a keyboard for texting. The color is kind of hard to tell if it’s silver or gold no it’s the starlight I think it was called. It’s good because I can wear silver or gold jewelry and it still matches. Also gives me more options for bands. I think it supposed to be kind of a rose gold, but it’s really more neutral than that.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Just get it","reviewDescription":"i used to have the 3 that I got a super long time ago and I finally caved and got the new one. I dont know why it took me so long because it's literally the best. It's easier to text people and when people call if you do want to pick it up on your watch the other person can actually hear you. It is super easy to track your sleep and all the new features are very user friendly. If you've been thinking about buying one this is your sign to do it, you can't go wrong with it!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1695686400000}
{"reviewTitle":"Love this Watch!","reviewDescription":"First off it’s a lot cheaper on here than it is buying it from Apple! The size is perfect and it’s preforming very well! I’ve been using an Apple Watch for 3 years and this one has got to be my favorite so far! No damage through the shipping, came in perfect condition! Highly recommend getting an Apple Watch! Makes it easier to tell the time, answer calls, send a text, and perfect for helping me track how much sleep I get every night! The battery life also lasts a very long time. I only have to charge it once a day for about 20 minutes.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1696550400000}
{"reviewTitle":"Upgraded from series 3 and WOW","reviewDescription":"Love all of the features series 8 offers compared to series 3 that I've written for several years! More of my phone apps work on this watch, such as my geenie app so I can turn on and off lights from my watch.  I love the heath features, I have AFib and I'm getting old so it's important to me to keep an eye on my heart rate and blood oxygen even if I'm not at home. ECG could help me know if I need to go to the ER too.  Yes, I know my rate in my pic is high but I'm ok, I was just up and active, it's back down now. This is the 41mm, I considered the big one but as you can see my wrists are tiny and the 45mm would have been too big for me. This one has a much bigger and edge to edge screen than my series 3, much easier for aging eyes to read. I'm very happy with my purchase!! And it was a great price too!","isVerified":true,"ratingScore":5,"reviewReaction":"58 people found this helpful","country":"United States","date":1679788800000}
{"reviewTitle":"Apple Watch Series 8","reviewDescription":"I absolutely love this watch !. I purchased a normal smart watch that had similar functions as the Apple Watch but now that I actually own a Apple Watch I am in love ! Thank you Amazon for providing electronics and accessories at a affordable price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705276800000}
{"reviewTitle":"Works great","reviewDescription":"Easier than lugging a phone with full hands!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1711670400000}
{"reviewTitle":"Worth It","reviewDescription":"I took a chance on used watch to save money, i thought I can always return it if I'm not happy. There was no scratches on the watch, the band not used. I think whoever bought it didn't like the size or the color and returned it, describe 'like new' was accurate.I mainly use it for activity tracking, it's been a week and it is working flawlessly. You can stretch battery life to 2.5 days if you disable features you are not using which I did, you can watch youtube videos on how to do it - happy with the purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1699574400000}
{"reviewTitle":"It Works","reviewDescription":"I like everything about this watch.  It replaced a $26,000 solid gold Cartier Panther watch.  Not nearly as beautiful to look at as the Cartier, but I can see what time it is in pitch dark.  Oh, but I do have to remove it every morning and recharge it—there is that.  Oh, and I see the same kind of watch on every man and women-there is that.  I guess you can call this the Peoples Watch.  Just like we now have the Peoples Telephone and the Peoples Computer.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1696636800000}
{"reviewTitle":"i love it!","reviewDescription":"this is an upgrade since my series 3 doesn’t work with my iphone 14. i was excited to use the new heart health features and to track my sleep much more closely. so far it’s been awesome! the battery life is much better than the s3 was, and the upgraded charger is crucial to limit the amount of time it’s not on my wrist.i really like the ecg option as my husband had a massive cardiac event in may that nearly took him from us, so being able to monitor his heart rate and identify rhythm irregularities has been awesome. it helps with peace of mind.overall it’s very sleek and easy to set up and use.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"Medical watch for me.","reviewDescription":"This watch has been a huge help with diagnosing my sleep apnea and oxygen levels while I sleep. I where the watch at all times to get the history with my sleep, heart rate, O2 monitoring. I also like the emergency alert to contacts if I fall or am in an accident. The ECG has been great also and I do it anytime my heart is racing after exercise or stress. It is very accurate. Glad I got the 45mm and I have a small wrist. It is very light weight. I charge mine every evening after dinner so it will be fully charged for the night while monitoring my sleeping. I did enable the O2 monitoring even when sleeping. A great watch and medical tracking device.","isVerified":true,"ratingScore":5,"reviewReaction":"6 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Wait was worth it !","reviewDescription":"I waited for Prime day to see if there were going to be Apple Watches in on the deal. I checked and it was there. I kept trying to talk myself out of it but didn't get it 1st day . I ordered the next day and couldn't be happier.I got it for almost half off.I now remember my meds in the morning.I make appointments.I have my most favorite watch face ever. Mickey Mouse and if you touch watch face he tells you the time.I have reminders all day long to remember things I need to do. I lose all track of time. So this watch is really good for me !","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Dont waste your money","reviewDescription":"Didnt last a year, and stayed in boot log. Save your money instead.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"LLEGO COMO EMPAQUE DE RENOVADO","reviewDescription":"The product arrived open, as renovated and not new, it arrived without the plastic again, and it arrived dirty... it seems to be a reconditioned product and not new... I do not recommend itel producto llego abierto, como renovado y no nuevo, llego sin el plastico de nuevo, y llego sucio... parece producto de reacondicionado y no nuevo... no lo recomiendo","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"It’s not a Series 8. It’s the new SE.","reviewDescription":"It’s annoyingly misleading to pass this off as the series 8. It took me weeks to figure out why I couldn’t get some of the new features to work on mine, like the blood oxygen app, until I googled the manufacturer number and saw that it’s actually the SE.I was going to return it, but that would leave me without a watch, and honestly, it’s upsetting that I have to go through a whole return and rebuy process due to your mistakes.","isVerified":true,"ratingScore":1,"reviewReaction":"28 people found this helpful","country":"United States","date":1665360000000}
{"reviewTitle":"Battery dies","reviewDescription":"Battery dies after only 8 hours of use. Turned off all notifications.  For the amount of money this costs it’s a rip off.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1713225600000}
{"reviewTitle":"All it Wanted to do was Sync up with an iPhone I don't own","reviewDescription":"Tried it on which was not easy had to connect the straps.  Then turned it on and all it wanted to do was sync up to an iPhone.  I have an Android phone and couldn't get past that point so it's going back.  If you're not drinking all the Apple juice I wouldn't buy it.  In other words if you don't have an iPhone move on.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1689552000000}
{"reviewTitle":"Refund policy","reviewDescription":"I received watch and the feature to swipe did not work.  I tried to pair it several times and it didn’t help.  I tried all methods that Amazon sent to fix the problem but nothing worked.  I had to return watch and now they say it takes up to thirty days to get refund.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1693872000000}
{"reviewTitle":"Can’t Charge Watch","reviewDescription":"Spent almost $400 on the apple watch and  i cant charge it because the end of the charger is not the typical usb port that fits in the numerous cubes we have .  I have nothing this will plug in to, so now i have to make a trip to town to look for something i can plug this in and charge with.  You would think with something this expensive,  they could include everything you need to charge it.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Wristbands and set up","reviewDescription":"So I’ve had 3 Fit bits and I do track my calories in an out at and  my activity so my question is why does this I’ve spent way more money than all my Fitbit‘s to have this wristband that sucks my  my Fitbit at least had like a regular rock watch and I’m struggling to get it set up","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1691798400000}
{"reviewTitle":"ACTIVITY NOT ACCURATE!","reviewDescription":"Ist Pic:  Time to Stand at 2:52 AM despite sleep time registered as 10p - 6a.  2nd Pic:  Danced off and on for 3 hours and received credit for 11 minutes of exercise.  3rd Pic:  Reached Stand Goal of 6 hours at Noon despite the fact that I went back to bed right after breakfast and reached my goal when I woke up from my nap.  #NotAccurate","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1680220800000}
{"reviewTitle":"Item unable to hold charge after 2 months","reviewDescription":"This apple watch was purchased as a new item, however, two months after it was purchased, one month before receiving usable data, the watch no longer charged.Have had a very difficult time with Amazon reimbursing me for the item.Worst experience I have ever had with an Amazon issue.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697587200000}
{"reviewTitle":"Apple watch purchased to months ago","reviewDescription":"Very upset.  Fathers day present.  Took to Best Buy to charge & set up to phone.  Charged 30 minutes.  Absolutely no battery. AKA DEAD BATTERY.  Will be returning & expect a refund","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Locked","reviewDescription":"My Apple Watch was locked. Activation lock still on meaning not even the fbi could open this thing. Amazon was completely unhelpful. Eventually offered me a $25 credit and then just never put it in my account and when I tried to asked about it they just kept transferring me to different associates until I gave up. Not worth buying on here anymore. Customer service is useless if you can even get on a chat or call with anyone. Don’t bother.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703289600000}
{"reviewTitle":"NO CHARGER tons of Trash","reviewDescription":"Sure WISH I could USE my new iwatch.  BUT THERES NO WALL CHARGER. Apple says it’s to reduce their “carbon footprint,” but it’s actually because they are a monopoly and this is capitalism. How is anyone supposed to know you need a different kind of wall plug? Pay 300+ bucks and the only “frequently purchased,” ideas Amazon can offer are 2 different kinds of AirPods. So now, after waiting for my phone through the mail I have to go out of my way to Buy a wall charger. Apple doesn’t even have the respect for us to let us know when we open up their product that you’re going to need a different wall charger. I don’t mind paying for the damn charger…they just don’t let us know! That’s what pisses me off!","isVerified":true,"ratingScore":1,"reviewReaction":"34 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"Horrible Battery life","reviewDescription":"Purchased this watch for me but it was too small so gave it to my wife. She does not like it because battery is dead in less than one day. the purpose of this watch is to have it on monitoring your health but if you need to take it off to charge so often its not worth it. I was going to purchase a larger one for me but changed my mind, i need a watch that battery last for hole week. I am surprised at apple for selling this watch. Horrible do not buy.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Causes radiation pain","reviewDescription":"After wearing my new watch for not even two hours I had incredible deep pain in the core of my wrist for the following three hours even after it was removed.  NO I was not wearing it too tight.  After using a Fitbit for many many years I was super excited for this upgrade.  Unfortunately I just can’t wear this anymore because of the pain in my wrist caused by the much stronger EMF radiation this has compared to my old Fitbit.  I am super bummed.  Yeah, sure I might sound crazy, but trust me the pain was so severe.  I know I am not alone in this.  My original excitement is now saddened that I have to return it.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1690416000000}
{"reviewTitle":"Did not work!! Be very careful.","reviewDescription":"I am not one to write a bad review but I am very disappointed with this apple watch. I just gifted to my wife for her birthday and it does not work. I bought it in December for Christmas but decided to give it to her on her birthday instead. It is past its return date so spent $400 for a product that is faulty! Be aware....","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707264000000}
{"reviewTitle":"Do not buy! Watch did not work! Returned item 17 days ago and still NO REFUND!","reviewDescription":"DO NOT BUY THIS! I received an Apple Watch that was still assigned to previous owner, so it was unusable. I returned it promptly. Amazon said return was received Jan 23 2024 and still have not received my refund. I am currently out $300 dollars. The refund date has been changed twice. This item is not worth the risk of loss of money.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1707350400000}
{"reviewTitle":"Do not purchase","reviewDescription":"When I received my watch it took HOURS to start up my watch, and it only got half way since it wouldn’t charge. I left it on the charger for a full day and it was still dead. I took it to Best Buy and they said they would try to power restart it. After about 5 minutes the guy told me that he couldn’t get the watch to power restart and that it wouldn’t even pop up the right options. I went ahead and purchased another Apple Watch from best buy which was the same price. Just get this watch at your nearest store and not on here.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1690848000000}
{"reviewTitle":"Can't use it and now it's too late to return","reviewDescription":"Couldn't sync to our app because it was hooked up to the previous owner's email.  Took to the Apple Store and they said we'd have to find the former owner and have them unhook it.  They said it's possible but takes a long time and lots of effort.  There was only a 15 day return window.  Bought it early for a birthday gift and now it's too late to return!!!  I'm so disappointed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699401600000}
{"reviewTitle":"Not impressed","reviewDescription":"I misplaced my Fitbit that has a wonderful battery life of over a week and recorded my sleep pattern.  Decided to invest in this Apple Watch which to me is complexed to use.  I have had this for only a few days but so far am not impressed.  Battery lasted only about 10 hours yesterday.  Failed to record my sleep patterns last two nights.  Can’t find my steps recorded which motivated me to move with a Fitbit.  I will research more on the use.  Just not easy to find basic information and am ready to buy another Fitbit which was easy to use.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1693872000000}
{"reviewTitle":"Expensive Toy","reviewDescription":"Expensive high tech watch with 10 cent plastic band. Band fell apart when I tried to use and is extremely uncomfortable to put on.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690243200000}
{"reviewTitle":"It cannot be connected to wifi independantly without the phone","reviewDescription":"Did not realize it cannot be connected to internet directly and independently of phone. disappointed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Nice but got a wrong strap size","reviewDescription":"Got a wrong \/ bigger strap. My wrist is very tiny.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"Quick delivery","reviewDescription":"All is good but the battery dies quick","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Watch and functions are good","reviewDescription":"Strap colour not good as expected!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696464000000}
{"reviewTitle":"The band is small!","reviewDescription":"I’m 6’1 220 pounds and the band barely fits. I’ve got to spend $50 more for the extra large band in the midnight color…","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689120000000}
{"reviewTitle":"Perfect","reviewDescription":"Work perfect","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697500800000}
{"reviewTitle":"Short battery","reviewDescription":"Had an apple watch 7 and it got damaged, order this and was shocked at how my 7 had twice the battery life of a BRAND NEW model.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"Need a USB-c charging cube","reviewDescription":"VERY disappointed this didn’t come with a charging cube. Would’ve been nice if it would’ve been mentioned somewhere or grouped as being sold together had no idea. Now I have to wait two days for one to be shipped.","isVerified":true,"ratingScore":3,"reviewReaction":"6 people found this helpful","country":"United States","date":1681257600000}
{"reviewTitle":"Too small of a screen for men\/medium wrists","reviewDescription":"I bought this originally but felt that it looked very small. I have a medium sized wrist. It might be better for petite arms\/wrists. Plus I prefer the larger watch face and better for visibility\/use.Got the 45mm one and like it MUCH better!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1682985600000}
{"reviewTitle":"Love this watch!","reviewDescription":"This watch is so comfortable on my wrist, I was not expecting that! Love the color as well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Apple Watch","reviewDescription":"I love heart monitor and easy to customization, fast to charge","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Very cool","reviewDescription":"Nice","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great Gift!","reviewDescription":"It was given to a friend for a gift, and they loved it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Life Changing","reviewDescription":"My wife had major heart surgery this last year - and we were told this apple watch was a great way to monitor not only your day to day activities - but does a decent EKG which is quite important for her.  Where is the 6 star button - it deserves a higher rating.  NO BUL","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"New condition","reviewDescription":"I recommend this product. Came brand new in a sealed box. Very easy set up to pair with an iPhone. Lighting fast charge, usually within an hour the watch is charged. This watch saved my life when I passed out the watch detected the crash upon impact and contacted 911 and my emergency contacts, my location was sent to all of them. I highly recommend the Apple Watch.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"Elevate Your Wrist with Apple Watch Series 8  - The Ultimate Companion for a Connected Lifestyle","reviewDescription":"The Apple Watch Series 8 [GPS 45mm] is a true game-changer, combining cutting-edge technology, seamless connectivity, and a host of advanced features to enhance your daily life. From fitness tracking to communication and everything in between, this watch redefines what a smartwatch can do, making it the ultimate companion for a connected and active lifestyle.The standout feature of the Apple Watch Series 8 is its stunning design and larger 45mm display. The edge-to-edge Retina display offers vibrant colors, sharp details, and increased screen real estate. Whether you're checking notifications, tracking your workouts, or glancing at your favorite apps, the display provides a rich and immersive visual experience right on your wrist.With built-in GPS functionality, the Apple Watch Series 8 accurately tracks your outdoor activities, distance, and pace, empowering you to reach your fitness goals. Whether you're running, cycling, or hiking, the watch provides real-time metrics, including heart rate, elevation, and more. The watch's advanced sensors enable precise tracking, allowing you to monitor your progress and stay motivated.The Apple Watch Series 8 features an enhanced electrical heart sensor and ECG app, providing valuable insights into your heart health. It can detect irregular heart rhythms and send notifications, alerting you to potential health concerns. With its ability to monitor heart rate and track trends over time, the watch helps you stay proactive about your cardiovascular well-being.The watch offers a wide range of workout modes, including high-intensity interval training (HIIT), yoga, swimming, and more. With automatic workout detection, the watch seamlessly recognizes when you're engaged in an activity and starts tracking it, ensuring you never miss a beat. The watch also provides personalized coaching and motivation, guiding you towards your fitness targets and encouraging you to achieve your best.Stay connected and organized with the Apple Watch Series 8's communication features. Receive and respond to calls, text messages, and notifications directly from your wrist, even when your iPhone is out of reach. The watch also integrates with popular apps, allowing you to conveniently access information, manage tasks, and control smart home devices, all with a simple tap or voice command.The Apple Watch Series 8 offers a suite of health and wellness features beyond fitness tracking. With the Sleep app, you can establish healthy sleep routines, monitor your sleep patterns, and receive insights to improve your sleep quality. The watch also includes a mindfulness app, helping you take moments of pause and practice mindfulness in your busy day.The watch's battery life ensures you stay powered throughout the day. With its efficient power management, the Apple Watch Series 8 provides all-day usage on a single charge. When it's time to recharge, the watch offers fast charging capabilities, allowing you to get back in action quickly.In conclusion, the Apple Watch Series 8 [GPS 45mm] is a remarkable smartwatch that seamlessly integrates into your connected lifestyle. Its stunning design, larger display, advanced fitness tracking, health features, and seamless connectivity make it the ultimate companion for active individuals. Whether you're striving for fitness goals, staying connected, or prioritizing your well-being, the Apple Watch Series 8 elevates your wrist with its comprehensive features and stylish design. Embrace the future of smartwatches with the Apple Watch Series 8 and unlock a world of possibilities right on your wrist.","isVerified":true,"ratingScore":5,"reviewReaction":"125 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Como nuevo","reviewDescription":"estaba muy bien, como nuevo. excelente estado","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"A Stellar Upgrade: Apple Watch Series 8 [GPS 41mm]","reviewDescription":"I recently had the pleasure of upgrading to the Apple Watch Series 8 with a GPS in the sleek 41mm size, featuring the stunning Starlight Aluminum Case. After using it for a few weeks, I can confidently say that it's a true game-changer in the world of smartwatches.Design:The Starlight Aluminum Case gives the Apple Watch Series 8 a fresh and modern look. It's incredibly lightweight, making it comfortable to wear throughout the day. The 41mm size strikes a perfect balance between functionality and aesthetics, fitting comfortably on my wrist without feeling bulky. The display is sharp and vibrant, making it easy to read notifications, track workouts, or simply check the time, even in bright sunlight.Performance:The Series 8's performance is nothing short of impressive. With its ultra-fast processor, apps open instantly, and navigating through menus feels seamless. It has become an essential part of my daily routine, helping me stay organized, motivated, and connected. The GPS accuracy is spot-on, making outdoor activities like running and hiking even more enjoyable as I can accurately track my routes.Health and Fitness:For those focused on fitness, the Apple Watch Series 8 is a fantastic companion. It offers a wide range of workout modes, including new features like Tai Chi and Pilates. The heart rate monitor is accurate, and the watch can even detect irregular heart rhythms, providing valuable health insights. Sleep tracking has improved, helping me better understand my sleep patterns and make necessary adjustments for a more restful night's sleep.Battery Life:The battery life of the Series 8 is impressive. With moderate use, I easily get through an entire day, sometimes even two, without needing to charge it. It's a relief not to worry about constantly searching for a charger, and the fast charging feature is a lifesaver when I do need a quick top-up.watchOS:The latest watchOS 8 brings several new features and improvements. The redesigned Home app is more intuitive, and the Focus mode helps me stay productive by filtering notifications during work hours. The ability to add my driver's license to the Wallet app is convenient, eliminating the need to carry a physical ID.Overall, the Apple Watch Series 8 has exceeded my expectations. It's a versatile and stylish smartwatch that seamlessly integrates into my daily life. Whether I'm tracking my fitness goals, staying connected, or simply checking the time, it delivers in every aspect. The Starlight Aluminum Case adds a touch of elegance, making it suitable for any occasion. If you're in the market for a smartwatch that offers both form and function, the Apple Watch Series 8 is an excellent choice. It's an investment that you won't regret.","isVerified":true,"ratingScore":5,"reviewReaction":"63 people found this helpful","country":"United States","date":1696032000000}
{"reviewTitle":"Excelente","reviewDescription":"Producto de muy buena calidad original","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Authentic Apple Watch Bought On Sale","reviewDescription":"It is always a hard time decision whether to buy Apple products directly from Apple or through third-party retailers such as Amazon. I would usually say go directly through Apple but sometimes, Amazon has great sales which are hard to pass up.In this case, I was able to purchase the Apple Watch S8 for $225 and it turned out to be just as advertised. It was completely new and authentic as I had no issues with pairing it to my phone or purchasing Apple Care. If you are able to find this watch on sale, I would definitely recommend it over the S9 as the S9 doesn't offer much more in terms of features.Great buy if you love the Apple ecosystem!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1701907200000}
{"reviewTitle":"Love it!!!","reviewDescription":"it's a game-changer! The sleek design with the Midnight Aluminum Case and Midnight Sport Band looks stunning on my wrist.First off, the display is impressive! It's bright, clear, and super responsive to touch. Checking notifications, tracking my workouts, and even just glancing at the time feels effortless and smooth.The GPS functionality is spot-on, and it's been a great companion for my outdoor activities. I love how it accurately tracks my runs and keeps me motivated to stay active.Battery life is reliable too. I can comfortably use it all day, and it still has some juice left by the evening. Charging is a breeze with the included magnetic charging cable.The smart features are top-notch! From answering calls to sending quick messages, I can do it all right from my wrist. Siri is super handy for quick voice commands, too.Overall, I'm loving my Apple Watch Series 8. It's stylish, efficient, and enhances my daily life in so many ways. If you're looking for a top-notch smartwatch, this one won't disappoint!","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1689897600000}
{"reviewTitle":"Works great","reviewDescription":"Got this as a gift for my husband and he loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716076800000}
{"reviewTitle":"Love this watch","reviewDescription":"Awesome watch","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Most updated one and great for exercise","reviewDescription":"The display is larger and more immersive, thanks to slimmer bezels and a rounded-edge design. The overall look and feel are elegant and premium, making it a stylish accessory for any occasion. Additionally, the watch is available in a range of finishes and interchangeable bands, allowing users to personalize their devices to suit their individual styles.One of the standout features of the Apple Watch Series 8 is its enhanced health and fitness capabilities. The introduction of new sensors and algorithms enables more advanced health tracking, including the ability to measure body temperature and blood glucose levels. These additions make the watch even more valuable for those who prioritize their well-being and want to monitor their health on a deeper level.The performance of the Apple Watch Series 8 is noticeably improved compared to its predecessors. Powered by a faster and more efficient processor, the watch operates smoothly, with snappy app launches and seamless navigation. The upgraded processor also contributes to improved battery life, ensuring that the watch can easily last through a full day of use with regular activities and workouts.From fitness tracking and heart rate monitoring to smart notifications and the ability to interact with Siri, the software ecosystem is robust and continuously expanding. The integration with the broader Apple ecosystem is seamless, allowing users to enjoy a unified experience across their Apple devices.","isVerified":true,"ratingScore":5,"reviewReaction":"107 people found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Love the watch","reviewDescription":"I got this as a way to help track my steps and exercise but it’s been so helpful in life. At first I didn’t know which Apple Watch I wanted however this is a great starter watch for anyone.I also find things like the timer and weather app very useful. It also helps as an extender for my phone which is nice.The watch is pretty comfortable I haven’t had many issues with it. It fits well and hasn't slipped off. It’s also very durable however I did get an extra screen protector just in case which as worked great and hasn’t affected the function of the watch.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702771200000}
{"reviewTitle":"Love this watch, will compare to FitBit Sense 2","reviewDescription":"I have been a fit bit customer for over 10 years.  I thought I would try this Apple Watch, since prices is now lower and I could get on prime.  At first I used both for a week, now only using the Apple Watch.  Love it.  Suppose to pick up temp, it does not.  I love the active watch face and app easy to use.  I charged the Fitbit sense every 5 days. The Apple Watch is daily.  That is a negative.  Sometimes I forget and if working and forgot to charge. The battery is zero. And unable to use the watch.  Great exercise workouts automatically connect to the Watch and app.  The Fitbit let me know to get 250 steps an hour, this Watch to stand for 1 minute an hour.  I miss the reminder for the 250 steps an hour","isVerified":true,"ratingScore":5,"reviewReaction":"15 people found this helpful","country":"United States","date":1693008000000}
{"reviewTitle":"Tick tok","reviewDescription":"What a great watch. Love it. Battery life is super. All great features.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1714694400000}
{"reviewTitle":"Love my Apple Watch","reviewDescription":"I had a Series 3 Apple Watch for years and decided I needed an upgrade. This Series 8 Apple Watch has been great! I wear my watch everyday and have the tan line to prove it! I love the ability to receive my phone notifications. It’s easy to glance at during work and know if I need to respond quickly or if it’s something that can wait. One of my favorite features is the fitness tracking, I always want to improve my step count from day to day. I also love to use a watch face that displays the weather. It’s nice to easily see what the outside temperature currently is and the highs\/lows for the day. There are so many features that are great for different people. I will definitely get the useful life out of this watch. Wether you are updating your old Apple Watch or thinking about getting one for the first time, this is a great choice.","isVerified":true,"ratingScore":5,"reviewReaction":"12 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"I love my iwatch!","reviewDescription":"I live with ADHD. This watch has helped me tremendously. I can tell Siri to set a reminder for something I need to do later. I can have to start my workout. I can set timers for time management. I like that it vibrates gently on my arm as well as make an alert sound. I sleep with it on so it records my sleep cycles, body temp, and heart rate. When it is time to wake, it will start gently vibrating on my wrist with a soft sound and then get louder as it wakes me. It connects easily to my iPhone and I can change watch faces as easily as my mood. You can also purchase and change the bands to fit your outfit!I upgraded from the series 3 so it could monitor my health better. I really like all it does and won’t ever be without one again!","isVerified":true,"ratingScore":5,"reviewReaction":"26 people found this helpful","country":"United States","date":1688688000000}
{"reviewTitle":"Underwhelmed","reviewDescription":"Had high expectations for my first apple watch. Was very underwhelmed after discovering I paid over $400 for something that looks worse than an 80s casio wrist calculator, feels bulkier than a G-shock and works less reliably than a Mikey mouse watch.After 7 years I would hope all the kinks would be ironed out in this 8th generation device, but ALL the software functions and apps work poorly and rarely as intended. It's obvious Apple has left this product on a back burner.I guess if you have a gen 7, 6 keep it. Can't imagine it being any worse than this.","isVerified":true,"ratingScore":1,"reviewReaction":"64 people found this helpful","country":"United States","date":1663977600000}
{"reviewTitle":"Defective watch non-returnable","reviewDescription":"I ordered this watch on Prime day, July 13th and by August 11th the watch broke. I went into Apple to see if they could fix and they informed me that the watch was not in their system since it was sold by Amazon. The return window was outside the 30-day return. Prime day closed the return window less than 30 days after purchase on July 28th. Although the Prime deal is tempting, but from Apple.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"Poor information","reviewDescription":"The previous owner did not remove location from their device and you need their password to remove.  Could not link my phone to watch.  Taking so long for return to come through over 30 days?? Was buying new in the first place. Will not buy an I-watch from Amazon.they are vague and Unsure of product and won’t refund as advertised.  Very disappointing buying new, getting used doesnt work, then they won’t refund","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1694995200000}
{"reviewTitle":"DO NOT BUY. NOT NEW, CAME USED","reviewDescription":"Disappointed as I spent nearly $400 on this just to have it come in packages that were already opened and with the watch not wrapped or covered along with obvious smudges all over the front and back and scrapes on the side. This was clearly a used product put into a new box. Really unbelievable. 0 stars. Would not risk it at all, but from Apple. Now I have to wait for usps to supposedly pick it up? And then return and wait for refund.","isVerified":true,"ratingScore":1,"reviewReaction":"34 people found this helpful","country":"United States","date":1682553600000}
{"reviewTitle":"Unusable due to being logged in","reviewDescription":"This item was sent to me already used and logged in by someone else. I have their name, height, weight and location from their medical information I can get to from the lock screen. I can't use it at all because it's logged in by this person. I have to return it. Terrible business and shady as well. Was this stolen?","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1695945600000}
{"reviewTitle":"Amazons website falsely advertised it’s cellular compatible","reviewDescription":"I already have the Apple SE watch that I loved. Was going to upgrade myself with this watch and give my SE to my little one. The watch was delivered while I was out of town for work so I wasn’t afforded a refund. I was told that it’s not customer services fault the website was misleading and that websites make mistakes but I will not be getting a refund. I have no use for this watch as I solely purchased it for cellular for when I run I can leave my phone at home. So now I’m stuck with a watch that doesn’t serve it’s advertised purpose.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1691712000000}
{"reviewTitle":"DOES NOT COME WITH CHARGER AND REGULAR USB SUPPORT WONT WORK!","reviewDescription":"Thoroughly annoyed to pay this much for a phone that doesn’t even come with a damn plug to charge it.  The cords for these use to connect to any usb port but of course apple found a way to make more money off it so now you have to buy a completely separate plug for their cable to work.  Pathetic a company that used to be known for innovation makes their money by forcing customized accessories for their base product.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1692835200000}
{"reviewTitle":"Locked to Someone’s Account","reviewDescription":"Bought the Apple Watch 8. Received opened package and watch was locked to someone else’s account. Returned as I obviously can’t use it. Returning is turning out to be a HUGE hassle as well.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711584000000}
{"reviewTitle":"No support","reviewDescription":"Hello, I just recently bought this apple watch. Not even a month in I have been having problems with it freezing along with delays. I bought it brand new as well, and contacted support with no help. I was told that the refund day has closed after 15 days and that there was nothing they could do to help.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1698105600000}
{"reviewTitle":"Locked","reviewDescription":"Bought apple iWatch series 8 GPS- supposed to be new condition; clearly was used before and still locked. Called tech support and they are sending out a “100% guaranteed” new watch. Customer service was great. 5 stars. Questioning why I was sent a renewed watch instead of a new watch; also why it wasn’t rejected for being locked with the previous owners iCloud info.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"Poor battery life","reviewDescription":"Poor battery life","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"This watch I bought like 50 days but charge doesn’t hold long..","reviewDescription":"I don’t like about bettery","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1689724800000}
{"reviewTitle":"No volume","reviewDescription":"After six weeks the volume stopped working","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Not god","reviewDescription":"Not good","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1676505600000}
{"reviewTitle":"It's about that battery life.","reviewDescription":"I've had my Apple Watch Series 8 for about 8 months. When I bought it the battery charge would last for about 24 hours. Now it barely gets 12. Which means when I go out in the morning, if I don't come back by evening I'm getting warning messages that the watch will turn off soon due to lack off  power.My Apple Care poilicy says I cane send it in for a battery repair--for free. But because my battery still registers at 86%, the rule under my Apple Care is that I can't send it in for repair until the capacity reads 79%. Nice rule for Apple, bad rules for customers. That means I can't go out my house and expect my watch to last for the day. And can't send it in for repair until get worse!Apple Care's \"we'll fix it\" guarantee has conditions that don't favor the customer.  Wouldn't this all be easy if a battery replacement was simple and didn't take  three days to be sent into Apple? Wouldn't it be great if a Genius Bar appointment for 10 minutes meant that an Apple staff member could change the battery? Realize before you buy the watch that the battery will start to go on you in about 8 months.Wouldn't buy this watch again.  Their technology is great on the fancy features and not on the basics.  Battery life and easy battery replacement is essential to any customers needs.  Apple hasn't gotten there yet, even though the watch I bought cost about $800!","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718323200000}
{"reviewTitle":"Battery life sucks.","reviewDescription":"Cool features, what does it matter if it can barely last a day and a half on a charge.","isVerified":false,"ratingScore":2,"reviewReaction":"21 people found this helpful","country":"United States","date":1664409600000}
{"reviewTitle":"Big problems","reviewDescription":"With the iPhone, text messages have may styles and tones available. With the watch, only one text tone is available and you have to have dogs ears to hear it.Worst feature: when paired with my iPhone the watch rings for incoming phone calls but the phone remains silent - sometimes… and other times both devices ring. There’s no way of knowing which event will happen.I called Apple support, they were very nice, but finally admitted that the only solution would be to leave negative reviews and hope to shame Apple into addressing the two issues.One would think that for $800 your world wouldn’t be turned upside down with missed calls, missed text messages, and no support.Everything was fine for the last 30 years of cell phone ownership and now I have the Apple Watch curse.I’m sorry I have one. I’d rather have the money.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694822400000}
{"reviewTitle":"Buyer's Remorse","reviewDescription":"It's a cool gadget, but does nothing more than your phone. I used to use a Fibit to track all of my fitness activity and thought I would be able to to the same with the Apple 8. NOPE: They want you to pay $10 a month for the 'Fitness' app. I already paid over $300 for the watch! Sure it's cool to talk on your watch, but let's be serious - - how often are you going to go somewhere without your phone? Exactly. Would not recommend this product.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694736000000}
{"reviewTitle":"Missing parts","reviewDescription":"Iphone watch delivery was delayed & when i received the item there is no wall charge adapter.","isVerified":false,"ratingScore":2,"reviewReaction":"","country":"United States","date":1695340800000}
{"reviewTitle":"Already hate it","reviewDescription":"Day 1 and watch would not charge using my after market charging station. Series 6 watch didn’t have a problem with it but series 8 decided half way through charging over night that it was going to stop charging and go dead. now charging it with the charger it came with which is slow. Wait for the next one or switch to Android. It is pretty.","isVerified":false,"ratingScore":2,"reviewReaction":"11 people found this helpful","country":"United States","date":1663459200000}
{"reviewTitle":"Ordered & paid for a new watch and was sent someone's old used one!","reviewDescription":"I purchased a NEW Apple Watch but clearly the one that was delivered is used.  The internal box had previously been opened and there were dirty fingerprints all over it.  The watch itself was not as originally packaged and shows signs of wear.  This is extremely disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Got a used watch. I bought a new one😳","reviewDescription":"Bought this to give as a birthday present. Glad I checked it first. Had two different colored bands and the watch cover that protects the face was peeled off of it. Also signs of wear on it. I bout it as a new watch but got a used one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Buyer Beware Fraudulent sales","reviewDescription":"The watch was listed as new. The price was higher than a refurbished item. The Apple Store shipped a refurbished watch.The return procedure is strict. Item can only be picked up at your residence by UPS and someone has to be home. I work every day, and it's impossible to be home to wait on UPS to pick up a return that was the fault of the seller. I'm not sure I can complete the return, with my work schedule. Hours on the phone with Amazon and UPS. No flexibility on returning the item. I guess you have to miss a day of work to return a watch.  Beware of the Apple Store bait and switch.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706918400000}
{"reviewTitle":"Bad programming and glitches","reviewDescription":"First off, the watch hijacks the iPhone's ringer for text messages and replaces it with a tiny single bell tone and a soft haptic. Being an active person, I missed numerous texts as the notifications are too subtle. To correct this you have to disconnect many of the other iPhone-watch communication features. Second, the steps counting data was very inaccurate. I know for a fact I put in between 500 & 1000 steps a day before noon. According to the watch, my step totals for a whole day is less then 300. This error led me to question other statistical feedback. Third, if you use your iPhone for music in your car via bluetooth, the watch will interfere with that link resulting in oscillating on\/off playback. To correct this you have to turn off bluetooth on the watch.  Finally, the 2 week time to return the watch is too short since one doesn't discover many of the shortcomings until the 3rd or 4th week. I'll probably sell mine on Ebay and take a $300 hit.","isVerified":true,"ratingScore":1,"reviewReaction":"23 people found this helpful","country":"United States","date":1685404800000}
{"reviewTitle":"Was sold a locked apple watch","reviewDescription":"When I received my watch, I went to pair it and it was locked due to it still being tied to the previous owners find my iPhone app. Apple requires a long process to try and get it unlocked and they denied the request twice dispite providing copies of the invoice, proof of ownership, serial numbers, etc. now in order to return it, I have to stay at home for a day waiting for UPS to pick the watch up from my house due to “security reasons.”  This is the worst service and experience I could have imagined. I would give zero stars if I could.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Beware of Seller","reviewDescription":"Although this watch was just like described it was too small for the persons wrist.  I have requested a return and mailed this back on Dec 26.  UPS picked up from my house per their instructions. The first refund date was Jan 14 per Amazon site.  Then the date kept extending until their is no date listed.  I requested an Amazon credit thinking this would be faster but nope.  Still waiting. If it doesn't work all I am saying is you might get a refund.  It costs me a lot.  I am a teacher and bought this for a gift.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1706054400000}
{"reviewTitle":"DEFECTIVE BEWARE","reviewDescription":"Make sure you read the reviews. This is not really from Apple. I received the watch and it looked like the box was opened and used. I charged the watch for a whole day and it won’t turn on. Then when I returned it I was told it would take A MONTH for the $300 refund. SCAM. Beware!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Allergies included…ALWAYS every generation ever","reviewDescription":"For whatever reason every generation of Apple I have ever tried for the Apple Watch specifically has always caused allergies. This usually include severe rash in hives minutes after I put on my device. The first time this happened I ended up buying from a third-party, which means I was not able to return it due to the fact that it was from a third-party seller on craigslist. Because I bought this from Amazon, Amazon allowed returns saying that if I did not find the item applicable for use when it comes to items that may not fit your need, Amazon was able to allow a return same day because of the allergies that have happened the Apple Watch is self is extremely cool, however, it is not for people like us who have allergies severely, such as alloy allergies  these allergies should be taken into consideration next time Apple makes the next watch because I really want to buy one of these Apple watches. However, the medication always gives me allergies. Amazon support was extremely helpful and making sure that my return went smoothly and onto the correct card. Please please please Apple make something that does not induce allergies!!!!!!!!!!!!!!!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"62 people found this helpful","country":"United States","date":1666915200000}
{"reviewTitle":"Piece of used crap","reviewDescription":"I thought I was getting a new I watch series 8 since theThing didn’t have a used label on it,  it arrived in an Amazon box but when opening the box, it was just a plain white box inside, apon opening plain white box the watch was wrapped in a clear sandwich type bag with just the watch and straps loose, and triple folded instructions, apon pairing watch withPhone was good but then, watch was locked in which I had to have password to unlock itOf course whoever had this watch before me did reset it, apon resetting it, the little spinning icon spun all day and didn’t reset itself….pos, first and last time I buy appleProduct through amazon","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1699401600000}
{"reviewTitle":"Product is not brand new, and it is defective","reviewDescription":"Wrapper of the box did not look new but the box itself was sealed. Unfortunately the watch did not charge at all. I went to the Apple Store the next day to get it checked and I was told the watch was not brand new. The original purchase date does not match with my purchase date. It was very disappointing since it is a present to someone else and I had to make all the efforts to get it checked. Return process was not very convenient either. Based on my experience I do not recommend purchasing Apple Watch on this platform.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1704153600000}
{"reviewTitle":"stopped working after a month","reviewDescription":"I would buy it only @ Apple store… mine stopped working after a month. Very cute and very accurate but seemed to be a refurbished one… I am happy I got the Applecare for only $3.99 a month. I can get another one that works this time… Never purchasing again Apple products on Amazon!","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1682121600000}
{"reviewTitle":"Watch missing charging block.","reviewDescription":"I spent close to $400 for this watch, and it came without a charging block. Very disappointed in Apple.  Have not tried the watch yet as I could not charge it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691539200000}
{"reviewTitle":"It came in unusable","reviewDescription":"Watch not usable. Difficult to return","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701302400000}
{"reviewTitle":"Apple watch","reviewDescription":"This watch battery drains very quickly! Also gets stuck on certain things have to reboot all the time","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696636800000}
{"reviewTitle":"Advertised new- used product","reviewDescription":"This was advertised as a new Apple Watch and upon receiving this watch had already had an iCloud account linked and a password set on the watch.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1691712000000}
{"reviewTitle":"Paint is dropping quickly after using about a month","reviewDescription":"Everyhing seems OK, but the paint is just dropping quickly after using for about a month, but the return window is only 2 weeks...Unfortuantely, I cannot replace it or return it. I used the silver apple watch S2 for several years without noticing this problem. Maybe I just need to avoid the red color?","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1683158400000}
{"reviewTitle":"Received with 0 battery power, and took 10+ min to charge enough to turn it on.","reviewDescription":"Received with 0 battery power, and took 10+ min to charge enough to turn it on. Almost finished my returning procedure and see the Apple logo started to show up.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"NOT USER FRIENDLY AT ALL","reviewDescription":"Spent 3 days yrying to figure it out had to download other apps to get the steps calculated and another onecould not get used to the band, when I took it to the at&t store they couldnt help me. I have better things to do with my time","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1683590400000}
{"reviewTitle":"Iwatch came opened","reviewDescription":"For some reason the watch came open without shrink wrap the watch its self came without the plastic wrap. And the box was closed back up with double sided tape very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1688601600000}
{"reviewTitle":"BUYER BEWARE!","reviewDescription":"Nothing against the watch itself, but for issues with iOS compatibility, I had to return it.  Per a new Amazon policy, Apple products worth $300+ COULD TAKE UP TO 30 DAYS TO PROCESS A REFUND!!!  I don't see this policy stated anywhere on the webpage or Amazon's return policy page.  I had to find this out from Amazon customer service.","isVerified":true,"ratingScore":2,"reviewReaction":"6 people found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"Missing essential parts","reviewDescription":"Package did not contain the Wrist Band nor the Charger.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"No wall plug","reviewDescription":"They sell this iWatch with unique magnetic charging cable but NO required charger !!  Why ? — I can’t set up the iWatch until I separately buy a relatively inexpensive charger !!!  Stupid Apple !!!  It should be a complete package !!!","isVerified":true,"ratingScore":3,"reviewReaction":"67 people found this helpful","country":"United States","date":1664236800000}
{"reviewTitle":"Welcome to the world of batteries.","reviewDescription":"Battery life is unreliable. Held a charge for only twelve hours.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1685750400000}
{"reviewTitle":"Disappointed","reviewDescription":"Not very accurate. I sit most of my day for work, yet it tells me I stood for 8-10 hours. I doubt the steps tracking is very accurate. The battery life sucks and I don’t keep the screen on.  Overall, I feel like I wasted my money. I can’t stand the rubbery band.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1669248000000}
{"reviewTitle":"Ok","reviewDescription":"Fine","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691107200000}
{"reviewTitle":"Watch Came Used","reviewDescription":"The box was extremely dirty but I thought it was fine because I’ll never look at it again but the watch was dirty as well. When you sweat and have your watch on it leaves residue. That’s what I found on the watch.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1667952000000}
{"reviewTitle":"If it will hook up to your phone. this one did not.","reviewDescription":"I returned the phone back in Oct. just a few days after receiving it. My refund on this date 11-15-22  has not been received.  Have made numerous calls but till keep calling.  Getting the run around.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1668470400000}
{"reviewTitle":"Charging","reviewDescription":"I constantly need to charge! Not happy","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683331200000}
{"reviewTitle":"The band is tiny","reviewDescription":"Just bought it. I don’t have large wrists and this thing can barely fit me. What is this? A wrist band for kids?","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1678924800000}
{"reviewTitle":"Good not great","reviewDescription":"Batter life is half of the previous version. All the new features are cool but now I have to charge daily instead of every couple days.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1669334400000}
{"reviewTitle":"The sleek and stylish wrist gadget","reviewDescription":"The sleek and stylish wrist gadget I recently acquired has truly transformed my daily routine. This innovative timepiece not only tells time but also offers an array of impressive functionalities that have seamlessly integrated into my lifestyle. With its advanced features and user-friendly interface, this device has become an indispensable part of my everyday life.One of the standout features of this smartwatch is its brilliant display. The screen boasts exceptional clarity and vivid colors, making it a pleasure to navigate through various apps and widgets. From checking notifications to monitoring my fitness progress, everything is easily accessible and visually appealing.Moreover, the battery life of this wearable device has surpassed my expectations. It can effortlessly last throughout the day, even with continuous usage. The convenience of not having to worry about frequent charging has been a game-changer for me.Additionally, the device's seamless connectivity with my smartphone has greatly enhanced my productivity. I can effortlessly receive calls, respond to messages, and even control various smart home devices right from my wrist. The synchronization between the watch and my phone is seamless, allowing for a truly connected experience.Overall, this wrist companion has greatly impressed me with its versatility and functionality. It has become an indispensable tool that not only keeps me punctual but also enhances my overall productivity and convenience throughout the day.","isVerified":true,"ratingScore":5,"reviewReaction":"94 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Love it!","reviewDescription":"I purchased my Apple Watch a couple of months ago and love it. There are so many features that I am still learning about them. I love that you can make calls and text from your watch. The fitness trackers are also great and very useful. It’s pricey but with all that it offers I feel that it is worth it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1705017600000}
{"reviewTitle":"*chef’s kiss*","reviewDescription":"i love this watch! battery life is terrific, often lasting 1.5 to 2 days. (i don’t use the “always on display” option.)","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1713744000000}
{"reviewTitle":"I Am Addicted","reviewDescription":"After I retired from the Army, I swore I’d never wear a watch again.  I was even stopped by the Customs Officer in Atlanta Airport who asked me where my watch was; why was I not wearing a watch.  But then Apple came up with the Watch.  I got old and needed to know my heart rate, oxygen saturation rate, minutes of exposure to daylight outdoors, and a thousand other details.  Now I must wear this watch.  I’m working on minutes of REM sleep daily right now.  The one thing I wished this watch could do is fill out a preliminary Coroner’s Report should life functions cease.  This would take a lot of guesswork out of that final chapter.","isVerified":true,"ratingScore":5,"reviewReaction":"7 people found this helpful","country":"United States","date":1698019200000}
{"reviewTitle":"Comfortable band and easy to install","reviewDescription":"I have had several Apple Watches through the years but this one is definitely my favorite yet. The band is comfortable and the watch overall is fairly lightweight. In the past I have struggled wearing my watch because it would irritate me but not with this one.I need larger text because I have trouble reading screens but I opted for the smaller face anyways. The fact that you can adjust the text regardless of the size of the face is great. I have mine fairly large and I don’t feel like it overwhelms the screen so much that I am reading one word at a time.Overall, I think this is a reasonably priced watched for someone looking to get features like the health and fitness tracking!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Great price and practically brand new","reviewDescription":"This was advertised as used, but in excellent condition. It appears that whoever returned it only went as far as to open the box. The watch appeared unused and the accessories were still in their wrappers. It was also never registered, so it comes with the full Apple warranty.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Great product","reviewDescription":"Have been loving having an apple watch. So convenient to not have to constantly reach for my phone for things that I don’t have to get to right away. Only con is that with Apple, it’s another thing to get a specific charger for their products but I can look pass that.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706227200000}
{"reviewTitle":"glad I bought this when I did","reviewDescription":"With all the confusion regarding Apple's withdrawal of a bunch of Apple Watches, I'm glad I bought this when I did. I bought this to replace my Apple Watch 5, whose battery was dying - was no longer lasting an entire day and was out of warranty. I AM sad that they no longer make the rose gold, which I loved. This Starlight color is kind of ugly. I know I can put a cover on it, but that makes the side button hard to push. Anyway, this works well, and the battery lasts all day.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1703462400000}
{"reviewTitle":"Love This Watch","reviewDescription":"This Apple Watch Series 8 (GPS 45 MM) is my first Apple Watch and I love all the features it has. It is the newest version Apple Watch and it is remarkable what all this version offers. I love Apple products and already have Mac computer, I-Pad, I-Phones and this adds a great item to my Apple products. I love the functions of this watch like all the sports and fitness tracking and almost everything my I-Phone offers. I am very happy with this purchase and look forward to learning more on its features and how to use watch. I have ordered a few different Watch bands and that makes this watch a perfect watch for casual or dressier times. I also purchased this  watch during Prime Day and got a great price which Apple rarely offers or allows. I would definitely recommend this Apple Version 8 Watch.","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1689379200000}
{"reviewTitle":"Second Apple Watch","reviewDescription":"This is only my second Apple Watch. I wear this one way more than the first one I purchased. I love the color of this one. It goes with everything. I love the larger face, which makes it easier to see and use especially for older adults. And the price was great on Black Friday ! Great purchase !!","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Ok watch","reviewDescription":"when click an album and choose a song it will not play on my phone and it lowers the volume. Watch also doesn’t like connecting to phone after a while and you will after reset the whole watch and set it up again. Even then the problem will persist and you must keep setting the watch up. Never had this problem with my series 4. Thumbs down 👎🏻","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1678579200000}
{"reviewTitle":"Not compatible. Don’t expect a refund anytime soon!","reviewDescription":"The product description is not clear about iPhone compatibility. It was supposed to work with my iPhone (an XR) but did not. Returned it but the refund process is taking FOREVER! - contacted Amazon and they tell me I have to wait 30 days before they can do anything. They sure took my money faster then that!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"USED NOT NEW!!!!","reviewDescription":"I ordered this for a Christmas gift… opened it today .. no band, it’s dirty, won’t charge and it does not mention that it was REFURBISHED!!!!  It will not give me an option to return!!!!!  I’m beyond ANGRY!!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Bad watch","reviewDescription":"The watch was used and couldn't program to my phone. Even Apple couldn't get it done so I returned it and bought another one from apple","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1711929600000}
{"reviewTitle":"Didn’t turn on. Trouble shooted. Horrible customer support.","reviewDescription":"We were able to get it set up, when we went to charge it to use it again the next day, it would not turn on.Customer care support was absolutely garbage","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704931200000}
{"reviewTitle":"Charger","reviewDescription":"I think spending over $300 dollars it should come with everything you need to at least charge it.  So you know it doesn’t.  Maybe I’ll change the review later once I can charge it.  It comes with cable but no box for outlet, and with it using a mini usb that is needful information","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1683417600000}
{"reviewTitle":"Battery is super super low quality","reviewDescription":"The watch look so nice, perfect and all the functions are working properly, i just fall in love with it. The only thing which is bothering me is the battery life of watch, and by the way that is the most important thing, I expected battery life to be longer than just one day or 20hours. So for me so far very bad experience.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1681689600000}
{"reviewTitle":"1st box no watch.2nd box faulty watch.","reviewDescription":"I  bought this watch as gift. First I recieved a box with only a band. Amazon sent a box the next day that has a non working watch.  I made an appointment with aApple store  next town over thinking I may not understand watch. They said my new watch is faulty & had to send it out. I spent a lot of money & got onlytrouble. This is Wrong!","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1669075200000}
{"reviewTitle":"Not recommended","reviewDescription":"I just received this Apple Watch about two weeks ago and constantly calls 911 without my knowledge!There are other features that do not work properly for a series 8 Apple Watch!My old series 3 work a lot better, but I wanted to upgradeI will try to find one that has good reviews before I buy again!!","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1687478400000}
{"reviewTitle":"BAD BATTERY LIFE","reviewDescription":"I have only had it for (give or take) a week now and the battery performance is not as expected. I use it to track my daily health as well as the time (pun intended) and that’s it. It seems like I’m having to charge it thrice the amount of my iPhone 14. (Mentioning Incase you have the same setup)","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1682294400000}
{"reviewTitle":"So durable","reviewDescription":"It’s so durable. I’ve worn mine for over a year and it is still going strong! Easy to clean too!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Todo llegó OK","reviewDescription":"Todo llegó OK","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Apple Watch for mom","reviewDescription":"Love everything about it. I bought 45 mm Mend) I’m elderly and eye sight is difficult. This size is perfect. Still working on setting up everything and syncing to I phone. My children bought it for me to have fall alert and emergency numbers.Very pleased","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718064000000}
{"reviewTitle":"Just like all apple products","reviewDescription":"Just like all apple products, the watch is slick and fine, battery will start degrading in about a year, which is expected from all apple products. Even if you switch off the \"always on\" option, which I did from the get go. Also it counts way more steps than I take in a day. While walking on a treadmill it undercounts my steps but when running on it, the watch overcounts my steps. It does better with running and walking outdoors","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1716336000000}
{"reviewTitle":"Love it!","reviewDescription":"Love, love. love my I watch series 8. Easy transition from my series 3 and a better face at 41mm instead of 38mm.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Escribo esto 1 año después de la compra...","reviewDescription":"No tengo ninguna queja, el reloj a funcionado de maravilla! La bateria le dura el día completo (duermo con él para trackear el sueño, solo me lo quito para bañarme y es en ese momento en el que lo cargo).La pantalla es muy responsiva y de buena calidad. Recomendado.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716854400000}
{"reviewTitle":"Buy an adapter for the new charger!","reviewDescription":"First this apple watch charging cord uses a smaller usp so it will not fit on regular usb cubes for wall outlets.This is a huge negative!  After waiting a week for delivery of my new apple watch series 8, I find that I must now buy a usb adapter BEFORE I am able to charge the new watch.  So ordered this one on amazon USB C Female to USB A Male Adapter,Compatible with Apple MagSafe Watch 7\/8 to USB Wall Plug,Type-Cand now will wait for another 10-14 days for it to arrive again all this before I will be able to use the new watch!Bach to the watch itself, it had enough battery to synch and set up and it was easy once paired to my iphone to do it.I was happy that my old braided stretchy apple watch band (from series 3) fits the series 8 just fine.The new series 8 is 41 mm and my old series 3 was 40 mm so I do not see a size difference of a silly little mm.The display offers some new backgrounds and clock faces etcFor me, the best thing about the apple watch is its synch with my iphone and ipad and allows me to answer phone calls on my watch, read text messages, etc without needing to go to my iphone or ipad.  I also appreciate the fall detection, accident detection and emergency sos capabilities.Apple watch is probably the one electronic device I did not think I needed until I got one. Now I think its the best electronic device I own.  The series 8 is very nice.Bought it on Prime Days which really made me feel good about this fancy gift to myself!","isVerified":true,"ratingScore":5,"reviewReaction":"28 people found this helpful","country":"United States","date":1689724800000}
{"reviewTitle":"Gift","reviewDescription":"Got it for my wife as a gift after the birth of our son.  Was great for immediate access to her phone when she's busy for other things.  Great gift for a new mom.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Looks nice, perfect for first smart “watch”","reviewDescription":"Very nice looking “watch”. Covers are super inexpensive so if you purchase one go and purchase a few covers in different colors :). You can change the look and the phone will still look great while protecting it. It’s really not a watch “perse” . It’s really a super multi-tool, for health and wetness which is my main reason for purchase. I’m still not handy enough to input the data of the workout with gloves on but the phone and the watch work together to keep data in sync.  I’m sure there are so many things to use it for but I’m still in the learning phase. It comes with it’s own MagSafe charger which is amazing. It’s game changer. It charges quickly as well.  It’s a winner. The problem with all the tech in my view is how quick all these things become obsolete. It’s great tech but the continuous upgrading every other year of the devices is some times overwhelming. At the same time a lot of the upgrades are quite amazing so it’s understandable.","isVerified":true,"ratingScore":5,"reviewReaction":"9 people found this helpful","country":"United States","date":1704758400000}
{"reviewTitle":"Buen precio.","reviewDescription":"Excelente calidad.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"Cannot pairing","reviewDescription":"The problem is that no matter what I try, it doesn't pairing,so I tried all 4 family phones, but it doesn't work. I can use another Apple Watch at home, but this didn't work, so I returned it. The problem is that it's been a month and 18 days, but the rein money hasn't come back yet.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1697760000000}
{"reviewTitle":"Hi-tech watch","reviewDescription":"I found the instructions too difficult to set-up and use. Therefore, I am returning both watches.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1719360000000}
{"reviewTitle":"BEWARE! DO NOT BUY!","reviewDescription":"If I could give less than Zero Stars I would. My wife was so excited to get this and when she goes to set it up, it's registered to someone else. How?! It was brand new! Talk about poor quality control. If you read the other reviews it has happened to others. BEWARE! DO NOT BUY!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1699228800000}
{"reviewTitle":"DO NOT BUY","reviewDescription":"It was logged into the previous owners Apple ID so i couldnt use it or anything! I tried resetting it and that didn’t work! I’m returning and never buying apple products on amazon again because this is the second time this has happened 😡😅😅","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"DO NOT PURCHASE USED WATCH","reviewDescription":"I purchased the used-like new red apple watch series 8 and when it came the apple watch had the activation code on it, and there is absolutely no way round that password without contacting previous owner, which i cannot do, so now i have to wait at least 14 days for refund, and have the inconvenience of having to hand deliver it back to the carrier to return it. Amazon Needs to check that the activation code isn’t needed on the products before selling them.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1681862400000}
{"reviewTitle":"Seller Failed to Process Refund","reviewDescription":"Watch was not compatible with my IPhone so I immediately returned it. No mention of this potential information on seller’s description. Waited 36 days for refund that never came even though return receipt was acknowledged on Amazon site.  I had to call  Amazon Customer Service agent who processed refund manually.  Not good-","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1696982400000}
{"reviewTitle":"Buy it in person!!","reviewDescription":"Love the watch. But it took me a month to get it. Amazon sent me the starlight watch instead of midnight. And then made me wait 30 days for my refund because of their new return policy. Wouldn’t even just let me exchange it. I get why they’re doing it, but it screws honest customers. I like the watch, but just hope you get the right one sent to you or prepare to wait an obnoxiously long time.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1690502400000}
{"reviewTitle":"BUYERS BEWARE: THIS USES A USB-C CHARGING WIRE.","reviewDescription":"I am really disappointed to learn that this Apple Watch uses the new USB-C cord, and it does not come with an adapter. After speaking to Apple, regarding the lack of information provided in the product details that would indicate that this uses a different charger, they accepted that it is not mentioned – and that I could either return it or buy a new adapter. Proceed accordingly, because I wish I would have known this so I could have made a more informed decision in terms of purchasing this watch.","isVerified":true,"ratingScore":1,"reviewReaction":"13 people found this helpful","country":"United States","date":1669420800000}
{"reviewTitle":"No charger included!!","reviewDescription":"This could be a great watch if only I could charge it! I am really pissed the it came with a cable but not the charge module. And the cable has the new usb- c connector. Why not the usb that plugs into other modules? And why not mention in the ad that the module is not included. Very disappointing. I thought Apple was better than this.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"was incompatible with my phone. waiting too long for the refund","reviewDescription":"had to return it because it does not work without an iPhone. It's been a month since I returned the watch (in pristine condition) and still waiting for Amazon to refund my money. They are giving me the runaround whenever I call customer service. Don't expect this from Amazon.Returned the watch on July 24 at their Whole Foods location. It is August 24 and I am still waiting for the refund.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1692144000000}
{"reviewTitle":"Workouts pause","reviewDescription":"Apple Watches are great… My wife has one and it’s been perfect for her. Mine on the other hand, kept pausing my workouts even though I had turned off pinch controls and movement controls as well. I tried everything I could but it was defective. Return it right?Now my real problem is this.I checked my UPS tracking on the return and it says that the return s department received it on 8\/24\/23 but it still reads like it’s still in transit on Amazon.It’s been received for several days now. You’d think that the status at least would have been updated.I’d sure appreciate my refund.","isVerified":true,"ratingScore":1,"reviewReaction":"6 people found this helpful","country":"United States","date":1693440000000}
{"reviewTitle":"Troubled","reviewDescription":"The purchase of this watch was highly anticipated, however, once set up it would not hold a charge. I returned the item within days and to date have not received my refund as promised (now 30 days). I will never purchase another item such as this from Amazon or this vendor. I cannot reach the vendor either. This was a lot of money from my budget and didn’t expect this type of treatment. REFUND MY MONEY NOW!!","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1699833600000}
{"reviewTitle":"Couldn't register  watch through apple","reviewDescription":"Watch was refurbished but previous purchaser registered watch through apple but did not clear apple account when watch was returned. Instructions stated I had to disconnect watch from previous account before I could link the watch to my apple account. Who knows what the previous buyers name was. Incredible that Amazon sells such crappy products.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1709596800000}
{"reviewTitle":"Terrible! Do not buy!!!!","reviewDescription":"I was working in my garden and it went off saying I fell. I could not cancel it. It called emergency and I was totally fine. The police came to my door.I have since returned it and I’m very upset that I’m only being refunded $295 when I paid $329. Shipping is one thing but charging me $34 when it was free shipping and free returns. That’s terrible and they’re not refunding me til two weeks after they’ve received the watch back. Only giving me Amazon credit….I want my credit card refunded the full amount!!!","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Did not work.","reviewDescription":"Would not turn on. Called apple help desk, worked with tech, still didn’t work. Returned item. Received replacement, same problem. Returned both watches, did not get refund from seller. Now trying to get refund from Amazon. Do not buy apple products from Amazon.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Frustration","reviewDescription":"After paying a substantial amount fir the series 8 watch I am disappointed. For this amount of money you think it would include the necessary items to charge the watch but it only came with the cord. In trying to turn it on the watch said I needed to pair it first but that was not possible as it said the ios for the watch was outdated and needed to be updated first, but I couldn’t get pass this pairing to update the watch’s ios. Getting through to their customer service is a joke. Am returning the watch.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Worst apple and Amazon experience ever!!!","reviewDescription":"The Apple Watch was received with a activation lock apple and Amazon will not help!! Amazon keeps sending us to apple, apple won’t unlock. Amazon will not send a replacement. They will only allow us to return for a refund. This is unacceptable it was bought as a prime day deal (I guess prime day deal included defective watches with other peoples Apple ID already on them) there is no mention of refurbished or pre owned! I expected more,  Apple and Amazon I would have thought better of both of you. Back to Fitbit it is. I’m not paying $75-$100 more for this watch because of YOUR mistake","isVerified":true,"ratingScore":1,"reviewReaction":"11 people found this helpful","country":"United States","date":1690243200000}
{"reviewTitle":"Battery drains quickly at 11th month","reviewDescription":"The battery charge life started to shorten significantly. It used to last a whole day and have about 40-50% left. Now it lasts about 4-5 hours. The battery health is at 98%. Went to the Apple store and they couldn't help me figure out the problem. The watch was sent to their repair depot and it was returned to me after 3 days with a note saying they couldn't find the problem. They reinstalled the OS, but that didn't fix the issue. Buyer beware of Apple products.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1697328000000}
{"reviewTitle":"Bad.","reviewDescription":"DO NOT BUY. I got this for my boyfriend for Christmas and when we went to pair and set it up it was “locked by owner” so we weren’t able to get into it. (I was never shown it was a used watch) now trying to rerun it and it’s giving me a hard time doing that also. Don’t waste your time or money. Rip off !!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"Usual Apple YOU HAVE TO BUY AN ATTACHMENT GAME","reviewDescription":"This item requires a charger piece not included with the watch.  The magnetic cable is not enough and I checked everything in the box, plus tried all the powering attachments for my apple phone.  Nothing fits.  The watch tells me it has a low battery and to charge it before doing anything else.  I have no idea if it works.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1700265600000}
{"reviewTitle":"Pretty cool","reviewDescription":"Worth it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Fun watch!","reviewDescription":"I was a bit skeptical at first from all the hype, my daughter convinced me to go ahead and get one. So I did since I am an apple user. I must say amazing lol gadget! Keep me on pace and on schedule ! I had to give my daughter her kiddos! I was def surprised!","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1686182400000}
{"reviewTitle":"Great accessory for iphone","reviewDescription":"Very convenient to silent alarms, reply quickly to texts, & track exercise\/health metrics.  Battery will last a couple days with always on screen turned off (tap to light up).  Love it 1000% more than my old fitbit charge.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693785600000}
{"reviewTitle":"Bluetooth Only!!","reviewDescription":"Of course the watch works fine but it said it was compatible with cellular but it’s not. Bluetooth only. Wish it was clearly written on the description. I’m very upset about it!!! Do I send it back? What do I do?","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"Didn’t receive at first","reviewDescription":"The first order of this watch arrived… with only packaging. No watch inside. So, I contacted support who was amazing and helpful and got the second within a week! Very stressful situation but all was resolved and the watch is great.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691452800000}
{"reviewTitle":"Sturdy good feeling watch band.","reviewDescription":"I used a similar band for my previous watches and they hold up really good. But just like those, this ones black coating starts rubbing off after a short time in the areas it touches something else.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693699200000}
{"reviewTitle":"Great Watch!","reviewDescription":"I use this watch every day and it fits nicely and helps me with work. Definitely would recommend, well worth it. I don't know how accurate the sleep tracking is but I like the feature regardless.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1694044800000}
{"reviewTitle":"Missing part","reviewDescription":"For the price of this Apple Watch, it should have at least included a method to charge it! It only includes the cord, but not the box. And of course, it requires a different plug that other Apple products.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692662400000}
{"reviewTitle":"Exactly what I expected","reviewDescription":"Good watch for keeping track of health. Live the ECG, oxygen levels, and health alerts for low and high heart rates and Afib. Negative is the battery has to be charged every day. Four stars for that reason.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1695686400000}
{"reviewTitle":"I think it’s a good watch","reviewDescription":"It’s been very useful all around tbh, only thing I don’t like is that it doesn’t track sleeping automatically honestly that’s it, you have to set like a set bedtime for it to do it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691971200000}
{"reviewTitle":"Battery life is short","reviewDescription":"Watch only worn during the day and not used when sleeping - watch battery only lasts 1 and a half days max","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698019200000}
{"reviewTitle":"Nada extraordinario!","reviewDescription":"El producto es novedoso pero nada extraordinario, muy sofisticado y poco eficiente, muy caro para lo que representa es solamente marca y publicidad.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693526400000}
{"reviewTitle":"Aware....","reviewDescription":"I like the style it fits to my wrist the main problem battery life not even last for 1 day hhhaaaiiisssttt","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Apple Watch","reviewDescription":"Love the watch, the charging cord does not work and apple will not replace as it is not included in the warranty.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694908800000}
{"reviewTitle":"The watch is fine.","reviewDescription":"The watch was delayed multiple times and was suppose to get a refund. However, Amazon decided to reschedule the refund….","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1695513600000}
{"reviewTitle":"Not crack resistant.","reviewDescription":"It is not crack resistance. Haven’t even had it a month and I have a crack in the top right of the screen. No idea how.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1695859200000}
{"reviewTitle":"Needs to be charged too often","reviewDescription":"Lots of applications, but I don’t know how to use them…thinking about selling it.In other words  I am not happy with it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1696377600000}
{"reviewTitle":"No band","reviewDescription":"The box did not include watch band. Do not want to return but would really like starlite watch band.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698537600000}
{"reviewTitle":"high maintenance battery","reviewDescription":"I waited a long time to buy an Apple watch. The battery on this one does not last 14 hours.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1697155200000}
{"reviewTitle":"Doesn’t matter work that great","reviewDescription":"My SE works better than this one. Have had trouble from day one getting it to do anything. Freezes all the time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694649600000}
{"reviewTitle":"Defective 3 hours after using","reviewDescription":"I was very excited to get this watch for Christmas.  The set up was seemless.  That said, three house after wearing it I received a shock to my wrist that left a mark. When I did my research on this watch I did not see any reference to this being a problem. Apparently this has been a problem for some time.  I returned it the next day. I’m waiting to see how long it will take for the to be processed and my money returned. So far I have heard nothing. An other problem is I used 50 dollars from Amazon from return items and that has not been restored.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1673136000000}
{"reviewTitle":"Do not buy","reviewDescription":"Does not hold a charge","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Was paired to another watch","reviewDescription":"This apple watch that I received was a Christmas gift. When it was opened and he tried to pair it, it was still paired to another Apple ID and was unable to be paired. Since it had been so long and with the options available. We can only get a refund…& have to wait until after the holiday to do anything…","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1703376000000}
{"reviewTitle":"Good watch","reviewDescription":"Love my watch for getting alerts that I would have missed since my phone is on silent in my pocket during work. Only downside is that my charger broke within 2 weeks of use, so now after spending hundreds on a watch I have to spend more on a new charger to use it.Update: watch still isn’t working. Reached out to get a replacement but was told the seller wouldn’t allow it. Guess it’s not a legit apple seller.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1696464000000}
{"reviewTitle":"Not cellular","reviewDescription":"In spite of the description, this one does not have a cellular option. The description is misleading. Ive spent hours trying to connect it only to find out Amazon had it listed wrong and it's too late to return it. I won't buy any other apple products from Amazon. Better to buy directly from Apple and know what I'm getting.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"watch do not hold a charge for the day","reviewDescription":"I bought this  Apple Watch during Amazon Prime Day in July, I put the watch on at 9 a.m. with a full charge of 100%. I do a 30-minute workout on a Peloton bike. At 2 pm the watch has an 11% charge. This is not my first watch so I know that the watch stays charged for most of the day.I guess these watches that were sold on amazon prime day were refurbished.","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1694908800000}
{"reviewTitle":"this was a returned item.I was unable to unlock it and setup to my phone","reviewDescription":"It was locked to previous buyer.  I thought it was a new product. Unfortunately I was 3-4 hours away from an Apple store.  By the time I got home, it was too late to return.  Apple store in Orlando, told me it was locked to someone else previously and they couldn't unlock it.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Beyond upset that there's no power cube","reviewDescription":"I ordered the new Apple Watch Series 8 as a gift for myself for Christmas. I dutifully waited until Christmas to open the package, and then found out that it comes with a power cable but not a power cube. That apparently isn't a problem with earlier Apple Watches, but the Series 8 cable has what I think is a USB-C connector, so it is incompatible with my current iPhone power cube.I now have to run around, find a compatible power cube, pay another $20-40, and wait for it to be delivered before I can use my Apple Watch. I am very, very upset!","isVerified":true,"ratingScore":1,"reviewReaction":"8 people found this helpful","country":"United States","date":1672185600000}
{"reviewTitle":"Watch was registered to someone else","reviewDescription":"This was so disappointing, as I purchased this Apple Watch as a Christmas gift for my son. The watch was still registered under the previous owner’s Apple ID. Needless to say, I had to return the watch because of this and had to pay a restock fee. What a joke.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1706054400000}
{"reviewTitle":"Not for running","reviewDescription":"If you, like me, are thinking of buying this to track your running I highly recommend you not to buy it. It consistently measures distances ~5% shorter than my phone. Same app, same weather conditions, same speed, but still 5% shorter. Same at different trails. Therefore it can not be trusten to give accurate pacing or tracking my performance and improvements. I will buy a different watch to track my running and give this to my kids instead.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Is it really worth the upgrade?","reviewDescription":"Question I have is is it really worth the upgrade? If you have a really old watch then yeah probably is if you have a fairly new one I don’t think it’s worth it to be honest.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693526400000}
{"reviewTitle":"Brand nee","reviewDescription":"I had no problems with it. Everything is great. I did switch the band out for another just because I wanted something a bit more secure. Also, if you want to keep track of your standing hours, don’t. It tracks constant movements within a hour and count it as standing","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690588800000}
{"reviewTitle":"Size of the band","reviewDescription":"So in my case my wrist 🤛🏻 wasn't the barbie's either but it seemed to the person that he wanted the biggest one . Normally my previous watches have come with two sizes, it only came with one and it doesn't give you the option of a big or small one. Sorry, that took away a ⭐️ from you.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Apple Watch 8","reviewDescription":"I just upgraded to series 8 from series 3. I’m loving this watch. Its much clearer to see the face and enjoying the features.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693612800000}
{"reviewTitle":"Good watch not much improvement from 4 generations before","reviewDescription":"Nought to replace the gen 4 my wife had. The battery was finally notably degraded. This gen seems to have a much big battery, nothing else visibly different.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1692403200000}
{"reviewTitle":"Short Battery life","reviewDescription":"Good but battery life is short. Gets easily scratched. Better to but a screen guard or case","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1697414400000}
{"reviewTitle":"Not much diff","reviewDescription":"I don’t see much of a difference from my series 2. The series 2 keeps dying though, I did need it. But I would have liked to see major differences because of  the years between watches.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Excelente","reviewDescription":"Es un reloj que vale la pena , en lo que respecta a la calidad , desde el empaque y lo mas importante lo que son sus funciones y calidad de materiales","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1691884800000}
{"reviewTitle":"Little damage","reviewDescription":"I love my watch but it has a little scratch on it when it arrived","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696550400000}
{"reviewTitle":"Apple watch","reviewDescription":"I’ve wanted an Apple Watch for a while and am happy that I finally bought one, very pleased with my purchase!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1693958400000}
{"reviewTitle":"Battery Replacement","reviewDescription":"I bought this watch in July 2023 and all of a sudden I'm getting a notice to replace the battery! Wow! Wasn't expecting that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1703894400000}
{"reviewTitle":"Love it …..","reviewDescription":"So I started with the series 7 and decided to upgrade. Mainly for the body temperature sensor. So far it’s pretty much the same as the 7 otherwise , the battery life on this one is not as good as the series 7.. but I’ve been on a schedule of charging them while I’m cooking and taking my shower before putting it back on for bed . Over all I’m happy with it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694476800000}
{"reviewTitle":"Bueno pero se descarga rapido","reviewDescription":"Buena calidad pero se descarga rápido","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Watch Strap","reviewDescription":"The watch strap would not stay locked in to the watch and the watch would fall off the band. The release button did not work on the back of the watch for the band to be secure. The watch fell off the band due to insecurity. I purchased another one and the band was secure and the mechanism worked well on the back of the watch. More than 2 weeks have passed and Amazon has not acknowledged that they have received the returned watch.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1688515200000}
{"reviewTitle":"The battery!!!","reviewDescription":"I like the watch. It’s very powerful and I wear it every day and night. Unfortunately it doesn’t have the battery power to track hiking or long workouts. Trying to use it on long hikes uses all of the battery life within hours. I wish it were able to be useful on hikes and I’m looking to sell it over the battery life issues.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1694649600000}
{"reviewTitle":"Great product","reviewDescription":"Everything about the product itself is great. The reason I’m leaving 3 stars is due to the fact the band size I ordered was for the M-L wrist size and the one sent was for the S-M and doesn’t fit. The other issue I had was with the shipping. The product arrived later than it was supposed to.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694390400000}
{"reviewTitle":"Battery life is awful","reviewDescription":"This watch is fine as a fitness watch I guess. But it’s pretty expensive and basically a glorified FitBit. The battery life on this watch is AWFUL. I get notifications from my texts and calls (not a lot every day), and notification from one app for work and this watch has to be charged every day. Definitely not worth the cost.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1693180800000}
{"reviewTitle":"Battery life","reviewDescription":"The battery life is not so good. I like all that it does but an example is sleep tracking if I use it though the night for sleep tracking battery is low the next day. My wife has Fitbit and battery last for days. I have most of the apps closed to help battery life.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694563200000}
{"reviewTitle":"Drains battery life on iPhone","reviewDescription":"It makes my iPhone drain like almost 2x faster. I usually have 40% left on my iPhone at the EOD but with this, I had 40% left by dinnertime. Wish Apple opened up their ecosystem so other watches allow apple music.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1697241600000}
{"reviewTitle":"It sinks up with the phone very easily","reviewDescription":"I don’t like the fact that there are no Watch Faces that I’ve been able to find that show your steps, and the time same size on the face of the watch.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1698969600000}
{"reviewTitle":"Poor battery life and phone-dependent","reviewDescription":"It sure looks nice but the battery life is poor, it doesn’t even last a day, the watch is also very dependent on the phone so what’s the point then? I must say that it only works with iPhone and it has a horrible feature that if you mute notifications it does so to your other devices as well, I missed an important meeting because of it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1711324800000}
{"reviewTitle":"Honest review","reviewDescription":"This review is for anyone wanting to know if they should get an Apple Watch or Fitbit.My main goal of getting a watch was to track exercise, calories, and heart rate.I got a Fitbit versa2 first. Then I got my apple watch. Here are pro and cons.Apple WatchPRO:-Screen is larger and has a scroll wheel-Can reply to texts on the watch-can control your phones music (start\/stop, skip etc)-tracks swim laps very accurately-shows you passive and active calories for an exerciseCONS-battery life is about 1.5 days-I truly didn’t love any of the clock faces-heart rate wasn’t live, it always said “as of xxminutes ago” I wanted to see live right now heart rate-I think it doesn’t vibrate enough for a text. If you don’t feel it then your only clue is a small red dot on the top center.-sleep isn’t very accurate. It won’t show me time spent in each sleep stage-I don’t like the whole rings and such gif the activity app. But this is just me I think.Why Fitbit was better than Apple Watch:-sleep tracking was more in depth-heart rate was live 24\/7-battery life was much longer at 2-3 days-price was much more budget friendly-vibrate and loud enough for texts and reminded you if you didn’t open the notification-I liked the clock face betterBoth calculated speed, distance and calories accurately as far as I can tell.Overall I liked my Apple Watch better than my Fitbit.","isVerified":true,"ratingScore":4,"reviewReaction":"47 people found this helpful","country":"United States","date":1692057600000}
{"reviewTitle":"Battery Life is Really bad....","reviewDescription":"I do love this watch for all it's new features.  I like that I don't have to carry my I-phone around the house or work, the watch will take calls and receive texts & notifications.  Even when I am next door at the neighbors' house.However, I just don't understand why Apple couldn't do better with the battery life.  My Series 1 Watch from 2016 still works and gets 4 days before needing a charge.  My fitbit gets 4-5 days on a charge.  I upgraded to this I-Watch Series 8 and turned off the \"always on\" feature and I still have to charge it every 30 hours or so.It's a bit of an annoyance trying to find a convenient time during the day to keep this watch charged to record workouts and to use the sleep tracker at night.  And then to remember to put the watch back on.As far as fitness and sleep tracking, I still prefer the Fitbit.  It seems to be more accurate and I prefer the Fitbit App's interface for stats and info, especially for the sleep tracking.  So now I put the Watch on the charger every night before bed and I don't have to worry about it going dark in the middle of my workday.","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1693699200000}
{"reviewTitle":"Great Apple product but for usual apple quirks.","reviewDescription":"Apple watch 8 is my first apple watch. As expected, it is a great product, very reliable, has great resolution and is fun to even look at. However, most people buy smart watches to track activity, and in that regard it’s way behind even compared to much cheaper yet reliable watches like Garmin vivoactive tgat I owned. For eg. a regular activity tracking watch would have watch faces with compact display of several activities on the main screen and one doesn’t need to do anything else for it, in an Apple Watch even for stuff as basic as a step count you either have to look on your health app in iPhone or you download a paid app like pedometer and use that as a ‘complication’ for a watch face, what that leads to is the dependence on a third party app which has its own reliability issues like it may not update the steps when you look at the watch face quickly. There are several such small quirks which are annoying but overall considering the number of features it has like fall and crash detection etc it remains a worthwhile purchase. And it looks great. I also wish that the provided strap was magnetic though one can easily but that from apple or from other inexpensive sellers. I also wish they had more apps supported like ring app for security etc.","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1691280000000}
{"reviewTitle":"Easy set up. Annoyed I had to order a wall power plug after I had given the watch as a gift.","reviewDescription":"I gave this as a Christmas gift. Nice looking watch! I was disappointed to find out when the gift was opened that it did not include a wall power plug needed to charge the watch - did not come included with the watch. Apple should include it with the watch and just add the cost to the watch. It's annoying to give someone a gift and they have to order another component to use it. The watch was easy to set up however she says it needs to be charged daily.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1706400000000}
{"reviewTitle":"Alice in Wonderland Meets The Apple Watch Band","reviewDescription":"It is a well-known fact that I'm not Alice, and this ain't Wonderland, but my new wrist band begs to differ. Let me unfold the story of my misadventures with a wrist band fit for the Mad Hatter himself.Upon opening the box, I was greeted with a wrist band that could easily find its place in a Barbie doll accessory kit. Yes, dear reader, it was that tiny!Believe me, I'm no Goliath, but this wrist band clearly was meant for the miniature world. I am certain that even my pet hamster, Sir Fluffington, would struggle with this fashion statement.I jumped in too fast and sync'd my phone before even trying it on - a rookie mistake fueled by caffeine, enthusiasm, and an overly zealous sense of faith in Apple and Amazon. Turns out, my watch now holds every iota of my personal information while snugly attached to a band that wouldn't fit a toddler.Now comes the real predicament: do I return it, risking my personal data, my sanity, and the peaceful coexistence of my coffee machine and me? Or do I keep it and use this wrist band as a constant reminder of my hasty decisions, and an unintentional toy for Sir Fluffington?One would think this mishap would warrant a single-star review. Still, I'm giving it three because the band may be doll-sized, but it sure is pretty. Plus, the hilarity of this episode has given me more laughs than any comedy special on Netflix recently.The silver lining? Next time I'll check the size chart more carefully and if I ever get invited to a tea party in Wonderland, I've got just the accessory to impress the Mad Hatter!Laughing at my own misfortune,Your Fellow Tiny Band Sufferer.","isVerified":true,"ratingScore":4,"reviewReaction":"209 people found this helpful","country":"United States","date":1687996800000}
{"reviewTitle":"Nice watch, customizable face, good exercise tracking, but requires a newer iPhone to work.","reviewDescription":"It took me a couple of weeks for me to even try this because my iPhone was not new enough to unlock the watch.  I was able to buy a newer phone which I was not expecting to do and then I did find I really liked the watch.  Some things I found:1. Make SURE you have the watch band positioned correctly when you put it together.  :)2. Try several of the different faces.  I fell in love with the photos face where I loaded it up with pictures that purposely bring me joy  Every time I tilt my watch to see the time, I'm greeted with one of my kids or my grandbaby or my cat and I smile 100 times a day.3. Sync it with your calendar and your Health app.4. It can be used as a remote for taking pictures with your phone and you can talk to Siri with it.5. It holds a charge for a couple days.6. The watch charger is NOT USB.  I recommend ordering a watch charger that has USB on it.  There are a few very affordable ones on here.  I need USB because all of my chargers and all hotel chargers seem to be USB.7. Once you figure out how to wear the watch band, it's very comfortable.","isVerified":true,"ratingScore":4,"reviewReaction":"86 people found this helpful","country":"United States","date":1687910400000}
{"reviewTitle":"Great value","reviewDescription":"1. Great value: got a pair for 200 + tax each2. The sleep tracker is both accurate and \"stupid\" that you have to turn on and off manually. It stopped tracking after the alarm time3. The better life is between one (heavy use) and two days (light use no GPS)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1707609600000}
{"reviewTitle":"Don't know how I functioned without it!","reviewDescription":"My sister had given me her old Series 4 watch a couple of years ago and I decided to upgrade to the 8 on Prime Day.  I really love everything about the watch except the Stand tracker.  Many times I stand and do something for 10 minutes (cook a meal, wash a sink full of dishes) and the watch doesn't credit me for that hour.  It's silly that you have to stand and mindlessly swing your arm back & forth to get the hour credit, but doing actual activity doesn't register!I like being able to see my Dexcom CGM readings on the watch without having to pull out my insulin pump or my phone.  I like the step tracker, the ability to control my music when I go out for a walk and I use the timer multiple times a day.  All of these things can be done with the phone but having it right on my wrist makes it much easier.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"Perfect for work, Just wish there was more apps","reviewDescription":"This is perfect for my line of work. I work in the construction field and do not have the time or mobility to check my messages or notifications, that's when the watch comes in handy. However, with this Apple Watch, I'm able to do that, and the sleep tracking is the best so far compared to the fit bits I have had in the past. It is also super easy to link your iPhone to your watch only took me 5-8 min. I have been skeptical about purchasing an Apple watch for the longest time, but now after having it on for a few days, I have been using it constantly. My only con is the apps, there's not many apps you can download to the watch that you would have on your phone. That's the only reason to why I rate this a 4\/5 stars.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1696118400000}
{"reviewTitle":"Screen dead","reviewDescription":"The screen is dead within 7 months 😠.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1709164800000}
{"reviewTitle":"Defective watch band that came with my watch","reviewDescription":"I have made several attempts to insert the shorter side into my watch. It is defective when I look at the band closer it is raised in the middle. I would like a replacement of the watch band.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"I love the watch and the fast speed charger","reviewDescription":"I am totally disappointed that I did not get anything to plug my watch into the wall. I have the watch. I have the fast speed charger, but no way to plug it into the wall.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1698192000000}
{"reviewTitle":"Still waiting for refund","reviewDescription":"To my huge surprise this Apple Watch series 8 didn’t satisfy me. Very few appealing watch  faces, unpleasant charts to read sleep and heart but what really made me return the watch was its short battery life. Barely 24h if not less. After almost 1 month I still wait for my refund. I checked with Amazon and the return was well received. So I don’t understand why I didn’t get my money back. Be aware.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1683072000000}
{"reviewTitle":"Difficult for seniors to set up","reviewDescription":"No instructions for set up.  Apple offers an easy user guide for sale!  I never imagined a product would charge a customer for a “user guide.”That’s an insult.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696204800000}
{"reviewTitle":"this is worst experience it says 18 hr charge but only 12 hrs ????????","reviewDescription":"I bought this watch but I am not happy because charging battery is less than 12 hrs what it says 18 hrs I try different way. but docent work and now I can't return. it discharge in 10 to 12 hrs only","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691539200000}
{"reviewTitle":"Don't know if it works!","reviewDescription":"Brought myself this watch for my birthday.  All excited I open it up only to find out the plug to charge it is not included in the almost $400.00 price of the watch..  REALLY you couldn't add a simple charging system with the watch  Now I've had to order that and wait.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Previously owned","reviewDescription":"This was supposed to be a brand new watch and it’s showing a previous owner has it locked.. be careful when you purchase","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1696723200000}
{"reviewTitle":"Battery discharge too fast!","reviewDescription":"I was excited when I received the watch. Charge and setup followed the instructions. Surprisingly the battery can barely hold up charge for 14hours. Three days in a row I get low battery mode at around 11-14hours of removal from the charger.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"Sucks","reviewDescription":"Not intuitive at all. When I’m trying to connect to a Bluetooth device it just doesn’t. I’ve owned a series 5 and had the same issues I figured they would fix all the problems with these devices but I guess not.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1692662400000}
{"reviewTitle":"Disappointed","reviewDescription":"The itself is great. I ordered a black got a white ban instead. Contacted service about exchanging bands said they couldn’t do it. So I have to spend an extra 10-12 dollars to get a black ban. I’m not happy.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690416000000}
{"reviewTitle":"Disappointed","reviewDescription":"Loved my first Fitbit, the second not so much. Since I have an Apple phone and iPad, I thought an Apple Watch made sense. I’m underwhelmed by the Apple 8. It is not as intuitive as I’ve come to expect from Apple products. I’ve had to dedicate considerable time searching out information, learning about the features I’m most interested in and correcting changes I have no idea how they came about. I think it’s too complicated for me and I’m not getting the information I want from it. It needs to be recharged daily. 👎🏼","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1670544000000}
{"reviewTitle":"Not worth the price","reviewDescription":"Its just a rehashing of the old watch but offers nothing new in the look and feel of the watch","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1694995200000}
{"reviewTitle":"battery life poor","reviewDescription":"Looks like Apple is putting too many functions on their watch and the battery is draining too fast. Just want a basic running watch, I don't need it to tell me when I am running low on groceries.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1686528000000}
{"reviewTitle":"Battery lasting less than a day during first week","reviewDescription":"Expensive watch, very short battery life, I have to charge before bed every night if I want it to track my sleep.I bought the watch this week and been using it for about 7 days and it’s consistently had terrible battery life. Sad & upsettingI like being able to change the watch faces so easily","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1682208000000}
{"reviewTitle":"Good watch bad charger","reviewDescription":"Love the watch but the charger that came with it does not continuously charge it I put it on perfectly and it says charging but two hours later I come back and it’s at the same percentage as when I put it on it in the first placr","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1686873600000}
{"reviewTitle":"El producto es bueno, la entrega no tanto","reviewDescription":"5 estrellas para el producto pero en cuanto a la entrega, horrible.tardaron muchísimo, cada vez que trataba de checar donde estaba mi pedido se aplazaba la entrega !!Tardo muchísimo en llegar","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689811200000}
{"reviewTitle":"Like the watch","reviewDescription":"I like the watch a lot but it doesn't stay charged sometimes I have to charge 2 times a day","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692576000000}
{"reviewTitle":"won't link","reviewDescription":"I can't pair it with my iphone because it says my iphone is too old a model.  I am not buying a new iphone too, so....","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Not for cellular","reviewDescription":"Not clear that this was not a cellular watch model. Bought on prime day and now outside of short return window.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1692316800000}
{"reviewTitle":"Complication with wrist tattoos","reviewDescription":"I have a wrist tattoo about the size of a quarter and, apparently, this confuses the watch sensors. It seems to have a  hard time sensing when it's on or not on my wrist. This causes the watch to automatically pause my workouts (even with the feature turned off), and it doesn't keep the time visible in standby mode.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704153600000}
{"reviewTitle":"Love it","reviewDescription":"Pros:-Siri is amazing on this. I just lift my watch and tell Siri to do something. Setting timers for food cooking has never been so easy. Alarms, reminders, etc.- The color and graphics are fantastic- Fitness tracking is what I always wanted. Sometimes I have workouts where I know there’s points in the middle where I’m slacking. The watch will be able to tell if it was active calories burnt vs regular.- Tracking everything with the app is really nice. I can easily access my workouts- Calls come in pretty clear though I don’t use this feature often-Charges so fastCons:- The Sleep app is TERRIBLE. I downloaded a better one than the default and it’s still kind of annoying that I have to pick my bedtime hours to track and if I sleep outside of those hours it doesn’t teach.- Ignoring groups can be tricky. I keep trying to ignore a group and 3 days later, the notifications will be on again- Battery life isn’t the BEST, but still decentOverall, I love this watch. It can charge in like an hour so I’m pretty good at keeping it charged. The only thing I wish is if they could fix the sleep tracking. I really wanted accurate data for that.","isVerified":true,"ratingScore":4,"reviewReaction":"70 people found this helpful","country":"United States","date":1679702400000}
{"reviewTitle":"Glad I bought it","reviewDescription":"I’ve had tii his for about 2 months and  I like this product and enjoy all of its functions.  There’s not much elaboration needed about that, So I’ll just mention the negatives.  The screen IS scratchable so you’ll need to cover it somehow when you get it.  Mine got a very deep CM long scratch just from walking around a building 2 weeks after I bought it.  (Very angry about that). Unfortunately there aren’t any really good screen covers out there like there are for phones so you’ll have to make do with what’s available.  I combined a plastic snap on frame-style “case” (no back) with soft plastic sticker style covers that come in a large pack so that you can replace as needed.  The only other negative so far is that accessories are prohibitively expensive.  If the watchband doesn’t fit exactly the way you want it to, replacing it could cost a third of what the entire watch cost.All that said, I am glad I bought it.  And I’m a tough sell.","isVerified":true,"ratingScore":4,"reviewReaction":"80 people found this helpful","country":"United States","date":1684281600000}
{"reviewTitle":"The ekg is a game changer if you have heart problems","reviewDescription":"I don’t love this watch, but the ekg is fantastic. Allows me to send info to my cardiologist whenever I’m having symptoms and without having to wear a zio. Otherwise, it’s nice to have an easy way to control my music when I’m biking, I can wear it in the pool and record my swims, and I can monitor my heart rate and workouts in real time. I kind of hate how it records sleep, requiring sleep schedules and not recording naps, but seems to do a better job than my other watch with the actual data (when it records)  I like how customizable the faces are and the activity app looks is kind of motivating. Otherwise imo it’s more than I need\/want EXCEPT for the ekg. Totally worth it","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1691884800000}
{"reviewTitle":"Starlight is a good color","reviewDescription":"I went to the Apple Store to look at the silver and starlight, side-by-side.  In low light, the two are indistinguishable. Literally three store employees and myself could not differentiate the difference between the models.  In sunlight, starlight appears a creamy\/gold silver. Still very much a Silver tone.  If you were on the fence like I was because you thought it might end up too gold, just get the star light. It’s a nice watch color.The watch itself is not exciting for me.  It’s basically just a watch with a few additional features.  I’m a little disappointed because so many people go on about how they couldn’t do without their Apple Watch.  I don’t know that there’s anything I could live without, but maybe as time goes on, it will prove more useful.","isVerified":true,"ratingScore":4,"reviewReaction":"21 people found this helpful","country":"United States","date":1689638400000}
{"reviewTitle":"Battery life is only issue","reviewDescription":"I bought this to help track fitness related goals and I've loved it. I'm much more dedicated and the daily encouragement (guilt) from the watch helps me personally.My only complaint is the battery life last about a day which means I charge it at night and don't really use the sleep tracking features.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1703721600000}
{"reviewTitle":"Great, but..","reviewDescription":"It’s nice but it scratches very easily. However, it is extremely waterproof. I didn’t know it had a water mode while I was in vacation in Clearwater, Florida and it somehow had no disfuctions.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Not a fitness watch","reviewDescription":"I guess I should have done more research before buying this. I have had the Fitbit and Amazon halo watches and really loved them both. But they no longer support halo, so I bought this. It is like a mini iPhone. It has some fitness features, but that’s not its primary feature. I wish you could see the steps and total calorie burn right on the watch face. I also wish you could set a step goal. One of my main uses for this is to get enough steps throughout the day. Steps is not included in the circles. Everything else works fine though. The sleep tracking, texts, etc.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1689292800000}
{"reviewTitle":"Sizing is WRONG","reviewDescription":"I measured my wrist, ordered the applicable size watch\/band and I can't even close the band on my wrist.  It is way too small.  Good thing I already had ordered a different band because I don't like any of the Apple bands.  But just wanted to warn people the sizing is off.  Also, if you're wanting to see your step count on the watch face like a Fitbit, you have  to download a third party app, Apple doesn't provide a feature to show steps from the Apple Health app on the watch face.  Either you download a pedometer app and add it, or you open the Apple activity app on the watch and click a bunch of screens to get to your steps.  WOW Apple really, you couldn't make that easier, of course people want to see their steps???","isVerified":true,"ratingScore":4,"reviewReaction":"10 people found this helpful","country":"United States","date":1689120000000}
{"reviewTitle":"Great watch, wish battery lasted longer","reviewDescription":"Pairs great with my iPhone. Use it for tracking steps, sleep and other activity. Have enjoyed using with golf app. Replaced a Garmin watch that I had used for 5 years when its touch screen stopped working.Apple watch is an overall great product, but battery lasts only 24 -32 hours at most; more like 18 if used for a round of golf. Makes me miss my Garmin’s ~ 10+ day battery life!  If I go hiking for more than a day, will have to dust off the Garmin otherwise I’m a convert.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1691020800000}
{"reviewTitle":"Got it on a great sale and happy with the health related features.","reviewDescription":"There are many reviews already giving the best features of this product and a few that don't like what the watch has to offer for various reasons including costs and perhaps in comparison with Fitbit and others.My take - I got this watch on a great sale and because I have some health challenges, the features this watch offers made it a worthy option. Also, as Apple has improved its \"eco system,\" this watch works very well along side my Mac and iPhone.  If there was something I could say negative - it would be that I don't like the watch band and replaced it. There are many 3rd party options for replacing the band \/strap and that made the 3rd party purchase easy as well as finding that removing the old one and adding the new one was a snap.","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1691798400000}
{"reviewTitle":"Why did I wait so long?","reviewDescription":"Awesome product. Never knew what I was missing. Too many useful features to list here but definitely as handy as the iPhone. Very close to the ‘Dick Tracy’ watch with so many other features. Will have one from now on.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706140800000}
{"reviewTitle":"The Best Watch Ever! No Really","reviewDescription":"It took me a while to get used to wearing a watch again.... but it's so nice to just view text messages on your wrist than dig out your cell phone from your pocket, or answer the phone. Anyone with an iPhone you owe it to yourself to get a iWatch as well. So many features and functions. You will wonder why you never had one sooner.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1706486400000}
{"reviewTitle":"I didn’t think I would it…","reviewDescription":"Wife insisted on buying me one for a gift.  Typically don’t wear watches, so wasn’t thrilled about it.  However, after a couple of weeks, I LOVE it!  It is comfortable and does so much.  No need to have your IPhone in your pocket.  You can cruise all over your house and your watch keeps you in contact.  It even acts as a GPS Navigator when driving.It alerts you with directions.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1702080000000}
{"reviewTitle":"Love it!","reviewDescription":"This Apple Watch Series 8 is the second Apple Watch purchase in 5 years. I loved my last one (series 3) but I wanted the upgrade featuring the crash detection and fall detection features. The watch looks great and works great. I was not disappointed. I’m so pleased with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1704412800000}
{"reviewTitle":"Finally brought one. LOl.","reviewDescription":"So far so Good, love it. plus it's fun, and does so much. I am happy with it, and that is what counts. For the price it turn out very well.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1707696000000}
{"reviewTitle":"Great!","reviewDescription":"I’ve been using for months now and I love my watch! Very practical and keeps me on track with my outdoor walks!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1710028800000}
{"reviewTitle":"Love this watch!","reviewDescription":"I was on the edge almost buying the safety bracelet that’s out now , when you fall it calls for help…But that bracelet didn’t even have a watch or digital read out of the time.  To me, it was useless, who’s going to wear two watch bands??I started researching the Apple Watch and I’m sold!The absolute only drawback is the battery life, I’m still adjusting and learning about the apps but I’m thrilled!  I can go anywhere now and know help is only a button away… or if I fallor in a crash… help is coming.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1694476800000}
{"reviewTitle":"THE PRICE IS RIGHT","reviewDescription":"Received the watch in perfect time.  Beautiful features and is working like a charm.  Truly love it !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"Bought as a gift for a friend","reviewDescription":"Ok, so she has used fit bit & other watches but the Apple watch is the shiznit in her opinion.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1709683200000}
{"reviewTitle":"It doesn't come with an adapter!","reviewDescription":"I like the watch so far but it did not come wIth an adapter so I am now waiting for one. It needed to be charged in a few hours...greed is terrible thing.It was relatively to set up using my iphone.I will edit this review after I get the adapter.Sigh.","isVerified":true,"ratingScore":3,"reviewReaction":"3 people found this helpful","country":"United States","date":1679616000000}
{"reviewTitle":"Missing charger block","reviewDescription":"Charger doesn’t come with the block so how I am suppose to charge my Apple Watch","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1689206400000}
{"reviewTitle":"Case Is A Piece Of Junk","reviewDescription":"I’ve had the watch for a day and a half and the paint on the face has already significantly scraped off, the durability of the case is an utter joke. Now I have a shiny new watch with chips in the paint that I now get to be irritated by every time I look at my watch. Functionality and upgrades are cool but the quality of the body of the watch is significantly compromised.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1666051200000}
{"reviewTitle":"Terrible Wrist Band For Medical Professional","reviewDescription":"Two major complaints that made the person stop using it after they were gifted it:1. Why can I not start using the watch on it own without pairing to a phone\/account?2. (Deal Breaker) = The wrist band it came with is terrible for a medical professional working in fast paced hospital settings. Watch fell off twice before they deiced to stop wearing it altogether.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1673568000000}
{"reviewTitle":"Battery life","reviewDescription":"Battery life sucks so bad, other than that I have no issues.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690675200000}
{"reviewTitle":"Good Watch, Not Perfect","reviewDescription":"This is a good watch, not outstanding. I honestly believe it is over priced. It really needs a charge every day. It is a bit clunky and not the most user friendly smart watch I have had. Yes, it has great features but they are not that easy to use. That said, it does what it says it will do.","isVerified":true,"ratingScore":3,"reviewReaction":"7 people found this helpful","country":"United States","date":1667606400000}
{"reviewTitle":"Battery less than 24 hours","reviewDescription":"If you leave face always on your battery will not last an entire day. Love the features but I have to charge twice daily because once daily takes to long to charge and won’t last until next charge. Turn the always on feature off and you can charge once daily just expect to be without your watch a few hours.","isVerified":true,"ratingScore":3,"reviewReaction":"17 people found this helpful","country":"United States","date":1666483200000}
{"reviewTitle":"Battery problem","reviewDescription":"Battery drain to fast.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1691280000000}
{"reviewTitle":"battery was poor","reviewDescription":"I did not like that I had to charge every day","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1690156800000}
{"reviewTitle":"not what I thought I was getting!","reviewDescription":"this phone is not wifi ready!!!! only blue tooth!!!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1689552000000}
