{"reviewTitle":"Great quality, and customer service!","reviewDescription":"For starters; the price on these phones is great. Between having the reassurance of Amazon buyer protection, and the benefit of knowing the device has been tested for performance, it’s well worth it.I needed a new phone fast after my cat knocked mine  into the sink ☹️ Rice fixed it for a while, but it was only temporary before it died altogether.I hate buying phones and avoid it whenever possible. 99% of mine belonged to someone in my family first. And i was good with that. Needless to say, my cat didn’t wait for someone in my family to upgrade. I was on my own this time.Okay.... that’s not entirely true. My grandma had an iPhone 7 sitting around so that held me over in the meantime. Going from an iPhone 11 Pro Max to an iPhone 7 was….bad. It was too dam small, in every possible way.  32 gigs of memory!! I needed an upgrade. Fast. My 11 year old was bullying me relentlessly. And that’s on me. They had my old XR (formerly my dad’s)I scoured FB marketplace. I’d decided upgrade a little, so I could feel better about the switch.  I didn’t want to feel backed me into a corner by my cat’s recklessness. I would get a slightly newer model in a fun colour.Marketplace had plenty.  Sending message after message from my iPhone 7, I worried. “This person seems too eager”, “this one has been posted so long”, “I want a purple, but the only purple one listed has less storage space” and “the pretty green one has a small crack”, “this guy lives 2 hours from me” and “Battery life? Errr last time I checked it was like 74%?….no, I can’t take a screenshot of it, it’s turned off”…. “cash only please” Etc.So much pressure. What happens if the thing doesn’t work? That’s $300+ down the drain. I knew I couldn’t afford new. But I hated the idea of buying something used from a stranger on Facebook. I didn’t want to get scammed, and I also didn’t want to settle.That’s when I remembered good ol’ Amazon. Maybe I’d check there. Just for funsies. Probably out of my budget, but it couldn’t hurt.Sure enough, refurbished devices selling “like new!” Mostly same cost or less than what I’d found so far. Surely there was a catch? I read through everything, tested by Amazon, includes all the specs, unlocked, I can pick the colour, the storage size, the condition, etc. AND I could have it delivered to me tomorrow??! With a warranty?!!I recovered from my brief stint of disappointment after learning the 12’s don’t come in yellow. Then fought hard to decide between mint and lavender. The lavender would take an extra day to arrive. Mint it was!! As promised, it arrived the next day. It was in beautiful shape. 128g’s, mint green, not a single scratch, 86% battery life. All for less than I would have paid to some stranger for a 64g with some “small scratches”Once my case and screen protector arrived I excitedly set it up and synced my data.Oh no.The FACE ID DIDNT WORK 😭After becoming used to facial recognition, having that yanked away, and dealing with a 7 for over 2 weeks—  I was desperate for the convenience of Face ID. I had been using my fingerprint. Like a *caveman*.Not to mention I have Blink 182 tickets, and it specifically states facial recognition is required to access the mobile tickets. Idk if that’s true, but I needed Face ID!!I googled, I contacted apple support. Fixing it could be upwards of $300. That’s almost what I paid for the whole phone!!I realllllly didn’t want to be stuck without a phone again. But I also wanted one fully functioning.So I reached out to Amazon support and explained. The rep was incredibly helpful (as most Amazon reps are) and after bts failed, she advised the ship was a 3rd party seller, and she  send a message to them. “If they don’t fix it by (insert date) contact us back and we’ll make this right” she encouraged.I’m ngl. I was nervous. I didn’t have high hopes, having dealt with 3p sellers on Amazon in the past. At least Amazon had my back, ig. The concert wasn’t till July. Even without facial recognition, it was loads better than the  7. I could make do in the meantime.The seller came in clutch though, and my worry was unwarranted. They responded within minutes. They were receptive, apologetic, and more than willing to help.As I’d anticipated, they offered a refund or exchange, as soon as they received the return. I explained my concern with not having a phone for several days or more; and the merchant offered to overnight a replacement as soon as the return was dropped off.I could deal with one day without a phone! I gratefully accepted. That was Saturday night, we made plans to catch up Monday for the return instructions and for them to overnight it.Monday I reached back out; and they were ready to ship, BUT they *had no more green….* 🫢 SHOCK“…do you have purple”No. :( just blue, white, and black.THIS WAS A HUGE BUMMER.It’s silly I know, and the definition of *first world problems “.. but I mean…. My change of heart about this whole phone thing HINGED ON THE FUN COLOUR. Without it, I was just a person…out $350… because my cat was thirsty while I was watching YouTube while washing dishes. I needed a cool colour. Plus,  I’d already gotten the matching case! Clear with mint green borders.It wasn’t even a fun blue… it was a dark, serious, navy blue. It was pretty and classy, but I wanted something fun. I even asked if he had any older models in yellow 😭😭 no luck,They told me they’d be restocking in a day or so. Still, no greens or purples came in.Ugh. Reality was setting in. I was going to have to settle. It was fine, I thought. At least it would be a fully functioning phone.No. I wasn’t ready to let go. They assured me I could take my time to decide, and I asked if we could wait another week in case one came in. If it didn’t, *then* I would choose from the options available.I messaged them Wednesday afternoon, bracing myself for the answer…. THEY GOT IN PURPLE! YAY.They sent a label, I dropped it off, sent a photo, and had my new phone the next morning.they’d said overnight shipping… but wow! I’d dropped off the return around 3pm, and had the replacement by noon the next day. I didn’t even have my new case yet 😅Despite the Barney-Esque colour scheme my mint green case created, the lavender is GORGEOUS and I’m actually sort of glad the green didn’t work out.Don’t get me wrong, the green is also  gorgeous.. but in the end I’m glad I ended up with the lavender. I was overjoyed when I was prompted to set Face ID during setup. Worked brilliantly, as did everything else.Great packaging, no cosmetic flaws, amazing battery life, customer service was great, and best of all… ITS PURPLE!Can’t wait to pair it with the new case. I’m so glad I went this route where I have some peace of mind as a buyer.I’m grateful to the seller for being so helpful and patient with me as insufferable as I must have seemed making such a fuss over colour preferenceIf you’re nervous buying a phone used or refurbished too, hopefully you can take comfort in knowing- this seller is legit. You receive a good quality product, and, speaking from experience, they’ll gladly help resolve any issues you may run into.","isVerified":true,"ratingScore":5,"reviewReaction":"284 people found this helpful","country":"United States","date":1707523200000}
{"reviewTitle":"Excellent condition","reviewDescription":"My reason for purchasing an iPhone was probably different than most people.  I have a Samsung phone that use daily and I am very happy with it.  It is on a carrier that is not one of the \"big names\".  It suits my purposes fine.My mother invited me to accompany her to Europe.  This is a once in a lifetime trip for me, but I soon realized my inexpensive Samsung phone would not work there.  Believe me, I tried.  The best way to have a working phone while in Europe so I could stay in contact with my business was to invest in an iPhone.  I decided on the iPhone 12 and bought a refurbished one.I researched the sellers and their profiles before ordering.  I finally decided on MOBILESUPPLY because they have an incredibly high rating.  They did not disappoint!The first phone I purchased was purple.  It arrived in excellent condition visually.  No scratches, no marks and actually looked like a brand new phone.  It charged up to 82% which was great.  Everything was wonderful.  Then I set it up (which took me a couple of YouTube tutorials being a long time android user).  I couldn't hear on the phone without using my earbuds or having it plugged into my vehicle.I thought maybe it was me, so I tested it with several people calling them and having them call me and finally I gave it to my husband, then son to get their opinion.  Nope, wasn't me.MOBILESUPPLY answered my question immediately and it was no issue to replace the phone.  They sent a prepaid label and the same day they received my phone they shipped a new one out to me.  The replacement phone was blue, but that isn't an issue.  It charges to 93% and again, appears brand new.  It works great, I can hear and now I am ready to go on my trip with my Mom.This entire experience was a lot of research and I am so glad I bought from Amazon, and picked the seller I did.My advise is to think of your needs for purchasing a \"new\" phone and to do your research on sellers.  Amazon offers an amazing choice to pick from.Hope that helps.","isVerified":true,"ratingScore":5,"reviewReaction":"25 people found this helpful","country":"United States","date":1721692800000}
{"reviewTitle":"Great experience, perfect phone!","reviewDescription":"First phone I received looked great, no scratches and I absolutely loved the green, unfortunately the battery health was 79% which is below what an excellent condition phone is supposed to have. Contacted seller and they were quick to respond and offer a replacement. The replacement was shipped overnight by FedEx the same day they received the first phone. Replacement looked brand new, battery life is great and it setup without any issues. They even upgraded the storage for my inconvenience! Overall an A+ experience! Buy with confidence! You won’t be disappointed!","isVerified":true,"ratingScore":5,"reviewReaction":"10 people found this helpful","country":"United States","date":1722470400000}
{"reviewTitle":"Awesome product","reviewDescription":"I was literally in shock from the quality of this phone!! I bought the “good” option for the quality and the only noticeable things were 2 tiny buffs on a corner and then 2 tiny scratches on the screen. But I expected worse since I picked one of the lower options for the quality! The battery capacity is 86% which I was also surprised by! I genuinely will never buy a new phone after this since this phone is a as good as new and you actually pay for what you’re getting unlike overpriced new iPhones. Definitely recommend!","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Almost brand new!!","reviewDescription":"I purchased the (Product)Red 64GB version Refurbished - Excellent iPhone 12. When I received and unboxed the phone, I realized it looked brand new except what appears to be a small scratch at the bottom of the screen. Do I wish the scratch was on the back or anywhere else other than the screen? Sure but if that's the only blemish, I'm happy with it.Not sure if this is standard but mine came with a screen protector installed which happens to hide the scratch pretty well making it difficult to notice unless you're looking right at it.After I finished setting up and configuring the phone with T-Mobile, I checked the battery health. I would have been perfectly happy with a max capacity around 90% but to my surprise, it's 100%!!I purchased a red set of Samsung Galaxy Buds Live that are refurbished but happen to look new as well to pair with the phone. They work perfectly together and the red color of both the phone and ear buds are a great match.Overall, I really like this phone!! Maybe I got lucky with the condition but this is one of the better purchases I've made recently. I recommend this phone to anyone looking for a decent iPhone that can't afford a current model. I upgraded from an iPhone 8 so this a big leap from that. The differences between the newer models gets  less and less as you move up to the 15 so getting the 12 is a really good option. The 12 even has the same shape and size as an iPhone 15.Hope everyone who buys one gets a phone in like new condition like I did :)","isVerified":true,"ratingScore":5,"reviewReaction":"11 people found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Better than expected!","reviewDescription":"Firstly, I was scared to even consider buying a used\/refurb phone, but I ordered it just to see if it was worth it. If not, I could have just returned it.Some of the things I was originally worried about ended up not being an issue. Was it going to have a lower battery health than anticipated? Was it going to have noticeable scratches? Was it going to be an international version?It came with a charger and the iPhone was completely new. The battery health was 100%. The camera lens was perfect, and so was the screen. The grills were all clean, and so was the lightning port. AND it easily connected to my previous phones SIM card.My only complaint was the lack of a SIM card tray ejector tool. I had one that came with my old phone, but I imagine others ordering this may not.BTW I got the Refurbished Premium 64GB Black sold and fulfilled by Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Refurbished iphone.","reviewDescription":"I am so pleased with my iphone 12 purchased from Amazon.  I had been shopping for an unlocked iPhone on other sites then I decided to see what Amazon had to offer and I'm so glad I did.  Amazon listed all the companies my unlocked phone was compatible with and my company was one of them.  I also felt secure in knowing that if for some reason my cell company could not transfer my info from the old to the new phone, I could return it without any problems.  The phone was a great value even the person at the cellular store asked where I bought it and how much I paid for it.  When I told him, he even said it was a good deal.  I am so very pleased with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great for it being Used","reviewDescription":"Battery health came with 98%. The phone have minuscule dents\/scratches, but nothing excessive and you really had to search for the any prior use\/wear. This was my best experience purchasing a phone not only for the quality but for the price. The phone is unlocked, so I did not need to worry about my coverage. It was easy to transfer and set everything up on my new phone without having to call my coverage provider. The package came with a new charger, so you could set everything up at one’s earliest convenience. It was cheaper than buying a brand new phone from Apple, but the quality I received was practically out of the box new with the 98% battery health and little to no damage to the phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Great Way To Save Some Money","reviewDescription":"I got the renewed for 289. Bought this for my mother who loses things a lot so getting something in pristine condition for under 300 dollars is a great way to avoid the expense of a new phone with features that would go unused\/unnoticed. Mine appeared brand new so was probably immediately placed in an Otter Box at time of original purchase. Battery seems ok but only time will tell but Apple only warranties new batteries for year anyway. Also came unlocked with no SIMM card and wiped clean just like my new 12 I got 3 years ago. Only took about 10 minutes to add to my Spectrum Mobile account. Only think I will add has nothing to do with the device but to keep in mind with a third-party seller. Price dropped around 40 bucks as soon as I received it. Did not expect Amazon to or the seller to honor it but spent about 15 minutes on their chat only to call a live rep. Then was told they have no control over 3rd party pricing as it is up to the seller. Again, not a big deal but just annoying that I could not get this answer in a minute or two though chat. Finally, if something does go wrong, I was told I would have to work with the seller instead of Amazon and discuss warranty with them. All in all 5 star for item and the latter part of this review is really more of a rant on the quality of Amazon Customer Service over the last 12 years of being a member","isVerified":true,"ratingScore":5,"reviewReaction":"4 people found this helpful","country":"United States","date":1721520000000}
{"reviewTitle":"Great experience!","reviewDescription":"I needed a new phone but didn’t want to pay the crazy amount it costs to buy new so I started looking into refurbished options. I was nervous as I read a lot of poor reviews and experiences. I decided to take the plunge with the comfort knowing Amazon's customer service has never failed me before. Thankfully I didn’t have to involve them at all! The phone arrived in perfect condition and I was able to transfer everything over from my old to new seamlessly! I wanted to wait to leave a review to see if something would go wrong along the way but it’s still as perfect as it was when I first got it a couple of months ago!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723334400000}
{"reviewTitle":"Great quality","reviewDescription":"It looks brand new.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Muy biem","reviewDescription":"Todo biem grasias","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Awesome!","reviewDescription":"Really good phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Muy lindo","reviewDescription":"Funciona perfectamente","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Excelente","reviewDescription":"Muy útil","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"good","reviewDescription":"good","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Good product","reviewDescription":"Excellent","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Good phone","reviewDescription":"Amazing phone","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Did not disappoint...","reviewDescription":"First time going with Amazon Renewed. I was a bit apprehensive at first because I've always upgraded through my carrier, but I took the plunge after reading seller reviews. I had a few questions sent through email and by calling the seller's toll free number as I have never swapped and updated my data between phones before. I didn't know if AT&T would flag me for updating my phone without their consent. Both queries were handled by Angela, who reassured me the purchase and upgrade process would go smoothly. The unit shipped immediately and was in excellent condition. I used the Transfer or Reset option on my iPhone 7 to transfer to the new iPhone 12. The process went very smoothly and I was online in about 45 minutes. I waited until I had a new case to transfer my SIM card, which also went very smoothly. I'm now back in action with my 12 with 128G of space and an OS that will accommodate my app updates. My only critique is the phone shipped with Lightning to USB3 adapter, which I don't have, but I'll just use my existing adapter. No biggie. Also I have no experience with battery life on the 12, but this unit seems to hold a charge pretty well. If this phone holds up in the future as well as it does today, then we have a winner. I'm very pleased with this purchase and the savings afforded me. Thanks!","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1713052800000}
{"reviewTitle":"Great quality !","reviewDescription":"I’ve had this phone for over a year now , so glad I didn’t spend a bunch of money on a brand new one .","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Lavender iPhone 12","reviewDescription":"I received my iPhone 12 today & over all I’m loving it. It came looking brand new, no scratches whatsoever. I would recommend getting another one if needed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Wow","reviewDescription":"Just picked up the premium renewed iPhone 12 and 100% battery health, no damage, video and sound is perfect.  I may have been lucky but you can get a flawless device.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Better than a new iPhone","reviewDescription":"It's better because it doesn't cost as much as new. Everything about this phone is good -- great photos, etc. There are way too many good things about this phone to list!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Great Quality For Low Price !","reviewDescription":"The product came fine! No damage other than the camera slightly chipped but it honestly isn’t noticeable. Size is average! Only thing is it came on 10 percent but besides that great phone !","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"QUALITY","reviewDescription":"Amazing phone everything in good condition looks like brand new. I bought it for my mom and I she will love it. That is her first iPhone :) battery is 83% not bad for a iPhone 12 . Thank you","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Perfect Condition","reviewDescription":"Phone was like new condition with a battery showing 100%.  Could not have asked for more. Only thing that could be improved would be to have the latest software installed.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Top notch quality and service","reviewDescription":"I purchased this unlocked phone to replace my iPhone XS. The item arrived in like new condition, battery life was at 100%, no visible scratches or damage.  It was super easy to set up and transferred all of my content seamlessly.Once I received my phone, I was unable to port it to my existing service provider (Xfinity Mobile) because, according to them, the IMEI was not compatible with their network.  I contacted Amazon customer support and they immediately offered to refund my money, but I liked the phone and did not want to exchange it.  They they put me in contact with Apple Support and stayed on the line with me until Apple had answered their line.I ultimately decided to go with another carrier (Mint Mobile) because they confirmed that the IMEI was compatible with their network and they were able to deliver my SIM card virtually, so I was able to use my phone immediately.The problem with my Xfinity was not a problem with the phone itself and I was quite happy that, even though it was not their problem, Amazon was immediately willing to work with me.  Could not be happier with the outcome, especially since Mint is 50% cheaper than Xfinity.","isVerified":true,"ratingScore":5,"reviewReaction":"8 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Must be a hit","reviewDescription":"I bought this for my Teenage Son who is 17 going on older than me. It came in great condition. Everything worked properly, the sound quality was amazing, it charged up great. He was very happy to get a good deal on a Renewed iPhone. It must be a hit, he never puts it down!!","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723248000000}
{"reviewTitle":"iPhone","reviewDescription":"So far I like what I purchased. I have to get more familiar with it, but I really like it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Buy!!","reviewDescription":"Works great using it right now lol I’ve had it for about a year and haven’t had any problems","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"It may freeze on you.","reviewDescription":"It is a personal phone.  I bought the used iPhone 12 unlocked  but I finally had to go to the Boost mobile store and they spent over an hour setting it up.After about a week, the screen froze in the super magnification mode.  The phone wouldn't open.  It wouldn't recognize my face and it wouldn't recognize the lock code numbers.  This happened 2 times and it worked after I let the battery run down and recharged it and I was able to restart it and open it. However the third time, I couldn't seem to run it down.  It doesn't help that the iPhone battery level is unreadable.  There was an Apple store at a nearby mall.  It had a half dozen technicians.  The one I got had me do the recommended things like pressing the side buttons and all and it didn't work.  So I had to reset it.  I noticed that at the other stations, all of the other techs were telling people to reset their phones, too.  Resetting loses your unbackedup data like contacts.  The apps have to be reloaded too.  Fortunately my phone was new and I didn't have many of those.Too bad LG doesn't make a 5G phone.","isVerified":true,"ratingScore":3,"reviewReaction":"15 people found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"SIM Locked by the carrier you chose","reviewDescription":"CAUTION: I chose this refurbished iPhone 12 with T-Mobile as my carrier, which makes changing carriers downstream very difficult as the SIM is locked by that carrier. I just changed from T-Mobile to Mint Mobile (lowered my monthly from $80 down to $30). Had great difficulty getting the SIM lock removed. Visited T-Mobile store, repeated phone calls to incompetent associates at T-Mobile call centers, placed on hold for over 20 minutes, etc. Highly recommend you think it through before you chose a refurbished phone with a specific carrier. You might be better to get one unlocked, and pay the up charge to Amazon Refurb. It is a royal PIA to get the carrier lock removed, as the carrier really doesn’t care - as long as they get their $$$ (that goes for ALL carriers)!","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Not excellent, good if you are balling on a budget!","reviewDescription":"I thought I was getting a refurbished phone in excellent condition? Well I would say that it is not in excellent condition but in okay condition. It is definitely refurbished. Cons: It came in dead, with scuffs and chips all over the paint, a weird little black spot in the screen, and the battery is only at 77% capacity. Pros: Functions fine, holds an alright charge, easy to use, no problems setting up carrier. This phone physically is beat up, and functions as it should. I’m not satisfied with the price I paid for the sheer quality of this phone, somebody definitely over exaggerated its greatness, because it’s PHYSICALLY not in excellent condition. But for now it will do! So if you want a phone for short money that functions fine and don’t care about the physical appearance, this phone is for you! But if you expect a fairly new, barely scratched phone, look elsewhere my friend! 3\/5 phone.","isVerified":true,"ratingScore":3,"reviewReaction":"34 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Decent","reviewDescription":"Arrived today, overall looks great except several groups of scratches on the screen. They look like razor blade marks in clusters. The battery is at 100% health so that’s nice. I haven’t activated it yet so I will update when I do. I have noticed the battery drops significantly randomly while charging which leads me to believe this has a faulty battery or a cheap one installed considering its 100% health. The last two phones I have ordered from this seller were the same way. Bad batteries.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Be safe","reviewDescription":"I wish I would have did a review sooner.. but the battery dies kinda fast and charges slow the screen gives me problems sometimes with the touch like I have to touch a lil harder or something. If the phone not in my hand n I try n use it it won’t work or again I have to touch it really hard I wish I would of did a review sooner but I didn’t use the phone for 2 weeks after I got it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Minor Scratches, Poor Speaker Quality","reviewDescription":"Overall decent condition, but was disappointed to open the packaging to find minor scratches and blemishes on the screen face as well as the back of the case\/phone. Also, upon making use of the phone, found that the speaker volume\/quality is definitely sub-par (quiet, difficult to hear). When playing the same audio next to another phone of the same model, the difference is drastic & highly noticeable. Also verified software configuration and settings were the same - no change.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"um …..","reviewDescription":"i mean the phone is okay…. but not great. there a soooo many scratches around the sides of the phone and the color around the camera is chipping off pretty bad. i was most disappointed about the battery health. 86% even for a refurbished phone is annoying. when i was setting up the phone it got extremely hot, too hot to hold. its a decent phone but i would definitely not buy again.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"79% of Maximum Capacity of Battery Health & Charging","reviewDescription":"The Cellphone is OK, the only problem is that the Battery Health & Charging, Maximum Capacity is just 79%, and It is recommended to change the battery at 80%, and that is another expense that I have to make. ($90.00 plus the waisting time of making appointment, going there to 35' driving time in Best Buy, waiting few days without a phone and then to go again to pick it up)","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"iPhone 12 128gb unlocked (excellent?)","reviewDescription":"I ordered an excellent condition iPhone 12 128gb unlocked device and received a product that more than matches that of an acceptable device. there are clear dents and scratches on all 4 corners with the glass having deep scratches that can be seen from 36 inches away. This is 3 times the distance of their \"acceptable condition.\"  Normally there is a small gap between the glass and the frame, but you can clearly see the glass is up against the frame where the dents are located and you can easily feel the damage to the glass and frame. Nowhere near what i purchased.ORDERED THIS-Excellent condition- Cosmetic condition: Excellent (Screen: no scratches. Body: no signs of cosmetic damage (scratches, dents, etc.) will be visible when the product is held 12 inches away).- Functional condition: Fully Functional (exceeds 80% of original battery life, generic or OEM accessories and packaging provided).GOT SOMETHING CONSIDERED AS THIS (if you would call it that)Acceptable condition- Cosmetic condition: Acceptable (Screen: may have a small number of shallow scratches, invisible when the screen is turned on. Body: light scratches, clearly visible when holding the device 12 inches away and perceptible to touch).- Functional condition: Fully Functional (exceeds 80% of original battery life, generic or OEM accessories and packaging provided).UPDATE -These phones will go through a 3rd party even though it says “Amazon Renewed.” The 3rd party seller took the old phone back and exchanged it for a phone better suited for excellent condition. Battery was, also, at 100% condition which I find odd considering it’s an IPhone 12 and 15s are the new phone. Time will tell of how well this phone works. I’m glad they jumped to fix the original issue though with the wrong quality phone sent. I’ve moved them from 1 to 3 stars at the moment.","isVerified":true,"ratingScore":3,"reviewReaction":"12 people found this helpful","country":"United States","date":1701129600000}
{"reviewTitle":"Good Condition But Non Genuine Screen","reviewDescription":"My iPhone 12 came in Mint Condition as Promised. Battery at 88% which isn't bad. However I keep getting a notification that the screen isn't a Genuine apple part. This means the screen was relaced by a third party. The bezel is clearly way larger at the bottom and almost made me think the phone was a fake. Everything is still functional and the screen works perfectly. Just a bit of an unnerving detail.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Decent iPhone for the money.","reviewDescription":"Like the lightness compared to my Samsung S24 Ultra. No scratches. Looks new. Battery charges to 100%Audio is subpar compared to the Ultra, not as loud and quality not as good.I don't like the lightning port. Wish it was the same as my S24 Ultra.In my case I could not get the Hotspot to work. However I did not take it to ATT to see if they could get it to work. That's not why I bought this phone. Amazon has a relatively new gps wrist band tracker that has no monthly fee and it only works with the iPhone. It does not work with Android and I need it to keep tabs on my friend with dementia. So far it works great. It's better than having to pay as much as $50 a month like some trackers on Amazon. So far I'm happy with the iPhone. It's a keeper and can also serve as a backup phone.Sorry my review is not more in depth.","isVerified":true,"ratingScore":4,"reviewReaction":"27 people found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Do Your Homework","reviewDescription":"My review is that you should do your homework before purchasing. I needed a phone so bad and bought this one. The battery drains rapidly everyday. That was one of the reasons for replacing the phone. With that said, the phone was delivered so rapidly and even got a Saturday delivery into a rural location. Now that's service. The phone is clean and shiny. It does more than my old iPhone, its larger and doesn't fit my hand so well, but I'm getting used to it finally. I love that it has more features than my old iPhone. After much research, I learned this phones battery just drains rapidly. The reviews online are plenty. I changed a few settings and that helped a little.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1723766400000}
{"reviewTitle":"It is a good reliable phone","reviewDescription":"My old iPhone “died” on me and it would have cost me almost as much to repair it as to replace it. This phone works very well. I was able to get most of my stuff back from my iPhone backups. There wasn’t much in the way of instructions and I had a bit of a challenge because my old iPhone had a button at the bottom to select and turn off apps and turning on and off the new iPhone was a bit challenging to figure out but once I got that “swiping “ the screen stopped apps and holding the power button with the volume button brought up the turn off option I was fine. I think the screen is better than my old one and now I’m accustomed to it I like the new iPhone better.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1722729600000}
{"reviewTitle":"Works great","reviewDescription":"I bought this phone for my son and for the most part it works pretty good. It does tend to get hot really easy. That’s one thing he has complained about but other than that the battery last a long time the durability on it is great. It’s easy to use Great quality , The sound quality is exactly what we expected ,Charging great,it is most definitely worth spending the money on if needed to I would buy it again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"Phone Excellent - Cheap Cable NSG","reviewDescription":"Refurbished iPhone 12 received in two days to replace lost iPhone 11.  Received in excellent condition (...no face scratches) as advertised.  Was able to add my old number to the phone (...using tips from Apple Tech Support); then erase all existing Apps & Data on the iPhone 12 (...except for the eSIM!) & then upload my Apps & Data from my old phone using iCloud Backup.  Had to log in and re-establish 2FA with a few of the Apps, but no major issues with that, and was back in business!Only annoying aspect was that the supplied charger cable stopped working after a day, but I had plenty others laying around.Overall, a very gratifying experience, and now I have 5G access.  Tip: If you utilize 2FA for some of your Apps; if they permit, set up the option of BOTH a phone number & an email...from laptop, in case you lose your phone.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Get what you paid for!!","reviewDescription":"Received a phone a day after ordering overall the phone is pretty decent for the price that you pay. There are cosmetic damages here and there, particularly around The charge port and around the frame of the phone little dense here and there, but the phone itself is operational and functional.And also the charger that comes in the box, it’s not even an Apple charger!!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Yes but one issue","reviewDescription":"I really do like the phone, I got the refurbished excellent quality, it charges relatively fast and dies just as fast, the main thing I cannot stand about it though is how fast it overheats, I’m unsure if this is just an iPhone 12 problem or whatever the case may be, but I do despise how due to it overheating it sometimes moves faster than the phone I replaced. Other than that it’s pretty okay. It’s an iPhone it’s everything you’d expect it to be.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Excellent","reviewDescription":"I have been using the phone for around 10 days and it works perfectly fine. It did not have a single scratch. Battery life came with 92%, the only thing is that sometimes when I’m on a call with someone, signals cuts off but it happens when I’m outside my house. I’m still testing the phone to figure out if it’s a problem the phone has or it’s just me not having good signal but so far that’s the only thing I’m still testing so that’s the only why I gave it a 4 out of 5 but other than that I’m impressed and happy with the phone. I mostly think it’s just the place that have bad signal but I want to make sure. I’ll be back to write my final review .","isVerified":true,"ratingScore":4,"reviewReaction":"5 people found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Almost new","reviewDescription":"This might be the most traveled phone this year. Arrived quickly at the drop shipper location in Miami before being forwarded to me, an expat living in Ecuador.Well after long delays at customs here in Ecuador it was returned to Miami. Refurbished phones are not allowed to be imported into Ecuador. Long story short after two trips around the US it was hand delivered yesterday by a helpful traveler.The phone arrived (refurbished premium) in perfect physical shape, not a mark or scratch. It functions flawlessly. Why the 4 stars? I would gladly give 5 save for that premium phones are guaranteed to exceed 90% battery life, sadly this one is at 88% so a bit short. It’s been over two months since ordering so I’m gladly keeping this iPhone 12.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Great phone, perfect condition, however…","reviewDescription":"My phone arrived in pristine condition. It was very easy to set up and transfer data from my old iPhone. So far I am very pleased with my purchase, however the one discrepancy is that it was guaranteed to have a batter health of at least 80%, but mine only has 79%.  I’m upset that I’ll have to spend more money to get a better battery sooner than I expected, but the quality of the phone itself still made it a worthwhile purchase.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Works great","reviewDescription":"Migrating from a Samsung to an iPhone was difficult for me.But once I set up this iPhone it works great.I love it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Like New Phone","reviewDescription":"Ordered an iPhone 12 and received it a couple of days earlier than expected. As for the condition, not a blemish or scratch. Battery health is 100%. Came securely packaged. Excellent product and transaction.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"VERY GOOD","reviewDescription":"I loved this phone, I was very scared based off a few reviews but I was so happy it had no scratches or scuffs, and the phones prices are great. I love it got to me house in 2 days, I came with a charger and a screen protector, I love it and the sound seems okay. Veryyy happy with my new phone!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Came fast, phone is flawless","reviewDescription":"The phone came the next day, the phone has no visible defects and the battery is at 98% health.  Half the price of buying this device from my service provider.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Excellent customer service!","reviewDescription":"The customer service was outstanding!! There was an issue with  the phone I ordered. The seller was fast with a response and a solution (which in my experience is usually not the case with third party sellers on Amazon). So very happy with my new phone! Highly recommended this seller! ⭐️⭐️⭐️⭐️⭐️","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1721865600000}
{"reviewTitle":"Great","reviewDescription":"Phone has been working great. No problems that I can see. Looks brand new.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Good Phone","reviewDescription":"rlly fast phone, there is two scratches but very tiny and the phone battery is at 83%, very fast and nice.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"great phone, works perfect!","reviewDescription":"It's the first time I bought a renewed phone, I hesitate about it because I have quality concerns, luckily, this phone works very well and looks like a new phone from Apple. The price difference is HUGE, I saved a lot money.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"great condition","reviewDescription":"Works great and product was in great condition.  Have purchased before and had great success as well.  So keep it up and I will keep replacing from Amazon.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Amazon rocks 👍","reviewDescription":"The phone is in “excellent” condition and everything works flawlessly. I cannot tell the difference between my brand new iPhone from Apple and Amazon refurbished tagged in “excellent condition”I have also purchased  3 HP refurbished business machines  (CPU) windows 10 pro from Amazon and hooked them up to our 3 large screen smart TVs m.I cannot say enough good things about Amazon, I’ve been ordering just about everything from them including  several subscribe items and a customer for over 20 years for just about everything except my dairy groceries and meats.Outstanding service.  The very BEST!  Thank you Amazon ~","isVerified":true,"ratingScore":5,"reviewReaction":"2 people found this helpful","country":"United States","date":1720396800000}
{"reviewTitle":"Great phone so far","reviewDescription":"Trying to get the most phone for the least money, I got the acceptable version. There are no scratches at all. I'm guessing that it lived in a quality case, upon arrival and inspection I placed it in one right away. The phone works perfectly, I'm a little worried about the battery strength and lasting power. I do play my music constantly so that might be a problem. We will see and I will  update but right now I'm extremely happy.Now that I have had the phone for a while I feel ready to give it a more complete review. I'm still very happy that I saved money with the acceptable version. The battery is still a concern as there are times when it does seem to discharge faster than I think that it should, but it has never left me stranded. The front glass seems to have been replaced by a lesser quality glass as I do have issues reading my fingertips sometimes in comparison to previous iPhones. Again this is an inconvenience not a serious problem. Overall I'm really happy with the phone a so glad to have an iPhone again. I really hated the Android's that I have had to use over the last couple of years. I use this this phone with mint moble and I have been very happy with the quality of service and calls from both mint moble and my phone. I have yet to drop a call or not have service where I expect to. I picked this phone because it was the least expensive iPhone with 5g and most of the time I do have 5g strength of service so that has been great.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1692403200000}
{"reviewTitle":"The phone took long to arrive","reviewDescription":"In excellent condition 1 small scratch but the phone is cute overall","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720224000000}
{"reviewTitle":"iPhone","reviewDescription":"Looks new and works like it’s new.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720742400000}
{"reviewTitle":"Holding a charge","reviewDescription":"This is a great phone but I transferred my old phone 4g to a 5g not sure about the SIM card ? This phone doesn’t hold a charge very long","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717804800000}
{"reviewTitle":"Works well but could be better.","reviewDescription":"We got the phone in excellent condition and there weren’t any scratches or anything but the screen sometimes wouldn’t sense when you were touching it. It stays charged well and has great sound quality.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"Fantastic Phone that that I bought twice!","reviewDescription":"I bought one for my girlfriend that was nearly mint condition! A few months later decided to buy one for myself. It functions great and has a great battery life. Only thing is that it has a scratch at the top of the screen. I want to give 5 stars but had to knock a star off for that. Once I put a screen protector on and put it in a case it’s  is a lot less noticeable. The phone really is a great buy for the price. My old Android phone was a real piece of junk. This phone is a dream in comparison. It's very fast and functions smooth. Easy to type on as well. If I had to buy another phone I would buy a used iPhone from Amazon. Also from now on I am sticking to iPhone. When I was setting it up it recognized my iPad was in the room. It synced with my iPad and mirrored it. My phone is almost an exact copy of my iPad as far as apps. So amazing!","isVerified":true,"ratingScore":4,"reviewReaction":"9 people found this helpful","country":"United States","date":1705104000000}
{"reviewTitle":"Ahh yes a iphone 12 from amazon","reviewDescription":"While thinking about buying this you might want to switch your carrier to AT&T. Get a plan from AT&T because I made the mistake and didn't read this well and bought a locked phone :).While trying to get this phone activated at my original carrier (T-Mobile) The store employees all tried to help me and said it wasn't available due to AT&T strict rules.The battery life on this starts tripping once it get's to 78% at least times did and I took it to the apple store recently and repaired my phone for a low price since nothing much was wrong with it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714003200000}
{"reviewTitle":"Update","reviewDescription":"Update: Phone was originally scheduled to arrive on the June 13th then June 19th.  phone was  delivered on June 14th. Everything ported over to the new phone seamlessly. Phone in excellent condition.I would’ve given four stars, except for the delivery issue.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Worth it!","reviewDescription":"Bought 2 phones both screens looked unused. One of the other phones had a few scratches around the rim of the cameras but not serious.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Renewed but not entirely with genuine parts","reviewDescription":"Although the grade was “excellent”, the renewal process did not use genuine parts in my case (screen replacement). Was expecting otherwise. Also, battery capacity was close to 70%, although I would expect it to be higher since the grade was “excellent”. Otherwise, product performs well, with minor cosmetic defects as expected.","isVerified":true,"ratingScore":4,"reviewReaction":"3 people found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Not an Apple camera that was installed","reviewDescription":"The iPhone appeared in excellent condition as I unpacked it. I had no problem transferring everything from my old phone, BUT when I tried to use the camera to take a picture of a card, I discovered that the picture was not in focus. I tried several more times - each time was the same result. Then, when I went into the 'setting' to do some corrections, I discover a statement that said \"The camera for this iPhone is not recognized. An Apple Authorized Service Provider can repair or replace the camera to restore full functionality.\". Apparently, the 'remanufacturer' has installed a second-rate camera into this phone.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Le faltó el adaptador de corriente","reviewDescription":"La verdad me sorprendió no había tenido iphone antes y se ve cuidado.Es reacondicionado excelenteEstética 9\/10En la pantalla tiene un detalle que sin protector no se notaba, me di cuenta cuando le puse el protector la verdad, es un poco molesta pero esta todo lo demás muy bien.Vi la reseña de otros y se veían maltratado por fuera y el mio llego muy bien y sin rayones en la parte trasera ni en la cámara.No llego el adaptador de corriente eso me molesto porque tuve que comprar uno.Se ve mejor en persona si no tuviera protector puesto y resaltará el detalle de la pantalla pareciera nuevo. Lo recomiendo si estas buscando una opción más económica y por el momento funciona bien,espero y siga así","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"Good purchase","reviewDescription":"The phone is great and everything works just as expected. Battery life was at 83% when I checked. No scratches on the screen. Only thing I could complain about it the little nicks on the edges of the phone as if it were dropped multiple times which was expected knowing that this phone was pre-owned","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Awesome For Price","reviewDescription":"Very happy with my purchase. Looks and acts as if the phone was brand new! My only hiccup was that the first phone sent was stolen and I received an empty box. Amazon rectified that immediately!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Great!","reviewDescription":"I purchased on June 2024.I received the phone in very good physical conditions and 83% of battery.Today August 16th 2024, the phone is still in good conditions but it started to get hot every now and then and when that happens, it works slowly.Other than that I’m happy with what I got. :)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Highly Recommend","reviewDescription":"I am a 19 year old broke college student, but I have had the Iphone XR since my freshman year of highschool... I am a rising junior now. Though my XR did my well over the years,  she recently started shutting off on me at random times, would die after 30 minutes of use after being charged fully. I was just wayyyy past due for a new phone, so I got this one. This was one of my first big girl purchases, so I was a little worried that something was going to be wrong with the phone, seeing as I saw quite a few reviews complaining of issues with their phones, but I haven't had any problems yet. Face ID works perfectly, extremely minor scratches (so unnoticeable I was only able to tell because I was strictly looking for them), easy to switch over to my carrier (literally just inserted the old sim card, and 30 minutes later EVERYTHING transferred over with no issues). Honestly, this is a REALLY good deal if you're looking for a more cheap route than having to buy a phone straight from Apple.Now, the only issue, which I dont fully see as an issue and youll understand why but the battery. The biggest issue with my old phone was how quickly it died. It was impossible to go out for longer than 3 hours without  my phone dying. The first setting I checked on the new phone was the battery capacity, and although I was really really upset when I saw it was also at 80% like my last phone, I dont really know if that number is fully true. I recieved my phone yesterday, and havent charged it since the afternoon of that day, and it is still on 49% which would NEVER happen with my old phone. SO, I put the rating down one star because it does still say that the battery capacity is 80%, but I just havent really seen that as of yet!Hope you guys found my review useful, and I highly HIGHLY recommend buying this product. Just make sure to double-check the ratings of the seller you're buying from. For me, the black color of the iPhone 12 came from a different buyer than the blue color. The black phone color seller has 3.2-star ratings while the blue phone seller has a 4.5-star rating, so I went with a color I wouldn't have usually gone with to higher my chances of receiving a phone in better condition!","isVerified":true,"ratingScore":4,"reviewReaction":"18 people found this helpful","country":"United States","date":1708992000000}
{"reviewTitle":"Good value for the money","reviewDescription":"Satisfied with the quality of product received. The product had few scratches on the edges but with a hard cover, it wouldn’t appear. The battery health is also decent with battery percentage of 87%. I bought it for my mother and she loves using it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Battery Life","reviewDescription":"It was a great price. It’s the second refurbished IPhone that I have bought. I’m only giving it 4 stars because the battery life on it isn’t nearly as good as my last phone. Other than that it looks like a brand new phone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Great iPhone 13 but….","reviewDescription":"Phone was flawless besides one little chip that was barely noticeable. I did pay for renewed premium which was supposed to come with over 90% battery health. Phone came with 87% battery health. Everything worked as expected. Setup was smooth no issues with the display or anything. Will knock one star off for battery not being over 90% health.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"I phone12","reviewDescription":"I like the phone ,but shipping was not the best and it was delivered to my neighbors house","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"Like it… but…..","reviewDescription":"I’m fully aware it’s a refurbished phone, so I didn’t really know what to expect as it’s my first time buying a refurbished. But it works great! Other than the scrapes and the 84% battery life… I really do think it was a good purchase for its price!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Product as described.","reviewDescription":"Good conditions, not excellent. According with the price.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"iphone 12 white , 128gb","reviewDescription":"phone works fine , minimal tiny 2 or 3 scratches not major.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"It’s Ok","reviewDescription":"I bought this phone 5 months ago and it was working fine until it started to struggle to read my sim. I was able to fix it hopefully it doesn’t happen again","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"loved it","reviewDescription":"Tenia unos cuantos detalles de golpes en la carcasa, pero la pantalla y las cámaras estaban en perfecto estado, la batería llegó al 87% y ya después de un año sigue en el mismo porcentaje. Buena compra. Recomiendo comprar renewed siempre que se pueda!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Phone for teen","reviewDescription":"Have had no issues with the phone","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Value for the money!","reviewDescription":"Phone arrived earlier than expected. Phone looks brand new, was easy to set up. Phone works great for my son who is in high school.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Cube","reviewDescription":"The phone didn’t come with a cube. I had to purchase one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Can’t complain!","reviewDescription":"The phone arrived pretty quick! No scratches, dents and works great. Had no issues transferring everything over from the old one to this one.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Used but in good conditions","reviewDescription":"a few little scratches as advertised but worth it...recommended","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Screen does not meet standards","reviewDescription":"The resolution on the screen is clearly below Apples original. Although it was obviously a restored iPhone, it’s a bit of let down. In addition the lower right corner of the screen is lifted a bit so it looks as if I have a screen protector that it’s not sticking to the screen. I’d be ok If I didn’t pay almost $350 for it. Everything else is totally fine though.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Renewed iPhone 12","reviewDescription":"Received this phone as promised.  It is in excellent condition as advertised, but it seems to have a few glitches in the workings. Hopefully I will be able to work them out, but overall it seems to be working pretty well.  Time will tell.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Best Ecofriendly and Budget-friendly Iphone","reviewDescription":"If you don’t mind the quality of ecofriendly electronics (renewed) this is a great option. Keep in mind that this means there might be a few scratches or even dent damage to the physical part of the phone. But it is fully operational and working properly. Great with Charging no problem with a battery health of 84%! Camera quality is great, loved it when filming videos, and it’s a good size for larger hands.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723334400000}
{"reviewTitle":"Recomendado.","reviewDescription":"Buen producto.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Battery is good","reviewDescription":"Battery percentage was good, didn’t have any problem setting it up works perfectly","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Not bad for a refurbished phone","reviewDescription":"Phone came within a week of purchase date. I ordered the phone in “Excellent” condition. It does however have very minor scratches on the screen that aren’t visible unless phone is locked & up close. The back cameras paint is chipped. Battery health is 81%.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"So far so good","reviewDescription":"(iPhone 12) good phone hopefully it will keep going, so far so good. I like it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Affordable Functional Phone","reviewDescription":"The phone arrived on time with minimal damage, like very slight corner dings that are easily covered by the case. I could connect to the Straight Talk network, but I had to order a sim card since the eSim numbers listed on the phone did not work. Overall, I'm highly satisfied with my purchase and would be open to ordering a refurbished phone again. I would advise others to check the reviews of the refurbished seller from which it's coming based on the condition they're buying. Each excellent, good, or acceptable condition may have a different seller listed.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Decent, great storage, however; battery is not great","reviewDescription":"My iPhone XR from 2018 started to really slow down and I replaced it with this phone which is much faster and has way more storage. The camera is great, the speakers are amazing too. The only downside is the battery dies while idle\/resting pretty often compared to my XR. Just the past few nights, it went from 80% to 20% while not in use in Do Not Disturb or Sleep Mode. Last night it went from 40% to dead. The battery is at 87% performance supposedly which is 10% higher than my XR but it holds a battery worse. Definitely keeping the phone but I will have to replace the battery which is an additional $89 cost at Apple and I wish that were refunded to me if possible.","isVerified":true,"ratingScore":4,"reviewReaction":"7 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"Works great with some observations","reviewDescription":"Found out that the phone I purchased had the screen assumed replaced. The reason is that the phone screen has a slight curve that prevented me from ever installing a glass screen protector properly, always leaving me a halo ring on the edges. I had a store attempt to install a screen protector too, and they were not able to get rid of a halo ring on the edges of the screen. The lady suggested to have the screen protected with plastic. There is nothing wrong with the touch functionality and display itself, it's just that I wasted 3 different glass screen protectors from different brands as a result.Aside from that, the phone works properly, although I did notice the battery has been of slight decline.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Hot Phone","reviewDescription":"When the phone was delivered I opened the package to discover the phone itself, not the packaging or even the box containing the phone, but the phone itself was hot to the touch! I contacted them and was directed to Apple. I found it odd that the phone itself was literally hot. I took the phone to my carrier and once the data was transferred and the customer service worker picked it up to give to me, she immediately said this phone is hot, o suggest you take it to the Apple Store. I immediately went to the Apple Store and after diagnostics were ran it was determined I needed a new battery, which after taxes ran close to $100. My advice, never keep a hot phone, especially if you just bought it!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719100800000}
{"reviewTitle":"damaged screen display","reviewDescription":"Have had this phone under a year, like it and know it was refurbished but now everyday the screen lights up 1\/2 way down with bright green pulsing flashes. Can not see to call or text especially. Went into a authorized AT&T store and representative said it was damaged screen pixalation. Would like replaced or some type of help.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Speaker Issue","reviewDescription":"I bought this phone for a Father’s Day gift to my husband. Setup and everything went well, but when a call was made or received the callers could not be heard. If you used speaker or headphones you could have 2 way communication but not hear f you put it to the ear. Took it to Apple and confirmed it had a speaker issue. The cost to repair was quoted as $279 if no warranty. The phone was bought refurbished. Add the repair cost to the cost paid here would have been almost the cost of a new phone.  We ended up trading it in to Apple. Will never make this type of purchase again on Amazon. Would have been better to go straight to Apple. Lesson learned.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719619200000}
{"reviewTitle":"Rated as Excellent, but is only good.","reviewDescription":"Price was good, phone appearance is only \"good\" although rated as \"excellent\".  Battery health is still at 100%, so that is a plus.  Did not buy directly from Amazon, but through a different seller, that was probably where the rating issue came in.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Issues but good customer support","reviewDescription":"Battery is only at 79% which I’m ok with. But, it had a warning that the camera was not recognized as an Apple camera. However, it works. Customer support along with Apple said continue using it. The seller gave me several months to return it for a full refund if it started to go bad. So far after a month it’s working but with the camera warning. Otherwise I am ok with the purchase and feel good about their support team!. I suppose refurbished it with a new non Apple camera.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Very clean nice new phone","reviewDescription":"Was having reception problems but looking now it might have code texts where I am sitting because I actually have a bar of signal. Part of issue may have been an outdated operating system which I have since fixed by downloading the latest.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Decent quality phone but..","reviewDescription":"The battery life is horrid, got it at 84% battery health with a service message. I now have to shell out more cash for a new battery. It’s bittersweet, a nice functioning phone but it surely doesn’t last but for no more than 3 hours.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Battery status was “Service” on arrival","reviewDescription":"The phone functions fine and was free of cosmetic damage. However, it was very disappointing to check the battery status and see “79%” and the indication to “Service” the battery immediately…I assumed an iPhone 12 in summer 2024 would have been replaced.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"iPhone 12","reviewDescription":"3\/5 the phone was in good condition. There was a small crack on the bottom of the front screen and on the camera. Also the camera does not focus properly I can’t really use it and need to get it fixed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Battery health","reviewDescription":"The only thing that I don’t like about this phone is that it came with only 81% battery health so I can never truly charge my phone to 100% and the battery doesn’t last very long. Other than that I love the color.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723161600000}
{"reviewTitle":"Works like a charm","reviewDescription":"I had not purchased \"renewed\" items till last month when I bought one for me. I could not tell it from new. This one is smaller for my wife and she loves it.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Muy buen equipo el IPhone","reviewDescription":"Batería al 87% pero buena calidad, sin ningún detalle estético en perfecto estado","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724716800000}
{"reviewTitle":"Yes","reviewDescription":"My kid loves it & it’s not as much as a new phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"I got it in 6 days !!thllll they in the replacement of the phone and !  snd I love the color !!","reviewDescription":"I loved the phone just what I ordered and it works great !!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Very good products, fast shipping","reviewDescription":"Very good products, fast shipping I hope to acquire more products later","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Omg","reviewDescription":"They weren’t kidding when they said excellent condition, battery capacity was 93%, not a scratch on the phone front or back, not gunna lie I was a little nervous but this was better than expected 10\/10","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722470400000}
{"reviewTitle":"Looks like brand new","reviewDescription":"Although I had to wait a bit for them to build one once I finally got it….It is a wonderful phone and so far works just like brand new …good price excellent unit.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"LIKE BRAND NEW!!!","reviewDescription":"The phone ended coming a few hours earlier, came with screen protector already, didn’t see any damages or scratches, battery at 100%. Phone seems to function completely fine. Very happy with my purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"iPhone 12","reviewDescription":"It was in a lot better shape than I thought it would be! Looks new, battery life was well, works perfect","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"10\/10","reviewDescription":"Item is very high quality and the seller shipped it super quick!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"The screen¡","reviewDescription":"I liked how the phone came with a screen protector but when I tried to put my own screen protector the screen doesn’t let it fully stick so there’s lots of air bubbles and it’s all around the sides so the screen protector can be easily removed the screen probably was replaced but it wasn’t a good replacement the charger stops charging and charges back it hasn’t don’t it for a while now I’ve only had the phone for a week in an half I would have returned it if I didn’t need the phone everyday but overall it works perfectly fine it’s just the screen bothers me so I might get it replaced.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711497600000}
{"reviewTitle":"Wanted a better phone.","reviewDescription":"Sent it back. Going to order a better phone. There was nothing wrong with this phone just not what I wanted.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"Battery constantly hot","reviewDescription":"It’s a beautiful phone and works great but I am returning because the battery constantly is very hot for no reason.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720051200000}
{"reviewTitle":"I purchased in excellent condition","reviewDescription":"MY HONEST REVIEWPhysical Check:• The iPhone is self it’s good no scratches and no damages so far.• The maximum battery capacity is 82%. I expected it to be maybe 90 but this is OK.• When I first picked it up the turn on button was a bit hard to press down and it started to loose up a little while after.• The volume buttons are a little sensitive. When I click down once to turn down the volume it continues to go all the way down same with if I turn up the volume.• The sound that comes from the phone is great.•The Camera Quality is perfect and in working condition\/shapeOVERALL• The phone charger is an off-brand charger. I would prefer you to buy an apple charger and not use this one. The sound that comes from the phone is great. I rate it an OK.","isVerified":true,"ratingScore":3,"reviewReaction":"8 people found this helpful","country":"United States","date":1705708800000}
{"reviewTitle":"Excellent phone, but fragile back","reviewDescription":"I bought this iPhone 12 to replace my iPhone 7. And I liked that it was premium refurbished by Amazon. However, even though it was in a case, the back cracked when I accidentally dropped it. I never heard that you could add an extra protection on the back because it was made of glass. When I purchased it, I also purchased the screen protector from Amazon because I knew it was good practice. This is the first time this happens to a cell phone I own since my first one in 2002. Had I known it, I would have  ought a back screen protector.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1711843200000}
{"reviewTitle":"Screen had scratches initially hidden by a screen protector!","reviewDescription":"Although the functions of the phone were fine, the screen had multiple scratches when I removed the screen protector. At first glance I was happy to have the screen protector already installed, but after purchasing a superior quality product and removing the protector, it was revealed that there were multiple scratches all over the screen. According to the guidelines, excellent quality is meant to have no cosmetic damage visible from arms length however it was clearly visible. I am happy with the phone but disappointed with the dishonesty of the company for trying to hide the scratches.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710201600000}
{"reviewTitle":"Good phone.  Questionable battery life","reviewDescription":"I love the phone and especially the cameras.  Disappointed with the battery life!  Although it meets the criteria promised of 82 percent of the original battery life.  Does not last as long as my old phone (9 year old I phone).  Seems to go from 60 percent to 20 very quickly.  For the price I will probably just pay to replace the battery to avoid the inconvenience of having to charge during the day.  I’m not on it that much so less that a full day charge seems wrong","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"battery was dead, not sure about this product rn","reviewDescription":"the battery was dead when i got the iphone, also scared to use it cause it kinda already glitches a little turning it off when i just got it today but i bought a \"new\" one it said so i hope it's legit tbh","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Battary only last 6 hours dead before I get home from work","reviewDescription":"The phone looks good. But dies after 6 hours does not last long","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1718496000000}
{"reviewTitle":"Battery less than 80%","reviewDescription":"The general condition of the phone is according the description. The seller included an alternative charger and cable. The battery is 78% which i found not enough for a cell phone clasified as “excellent condition” I was expecting it would be around 85% minimun","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715990400000}
{"reviewTitle":"Did not disappoint at all","reviewDescription":"This phone is amazing came perfect and good battery life","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"iPhone","reviewDescription":"My granddaughter is happy with it so far","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"It works","reviewDescription":"Will happily replaced our older iphone 6","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Works great!","reviewDescription":"Great product! Works great. And fast shipping.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Good quality","reviewDescription":"It is good for its price","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Received on time and worked fine","reviewDescription":"Received on time and worked fine","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"❤️❤️❤️❤️❤️❤️❤️❤️❤️","reviewDescription":"Best decision I ever made ❤️❤️❤️❤️❤️❤️❤️","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"I love it","reviewDescription":"My phone is so cute","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Excellent Condition","reviewDescription":"Like new. No issues. Works excellent!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Excellent phone","reviewDescription":"Easy to understand","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"Good for the price.","reviewDescription":"Only complaint is the battery. It dies quickly. Other than that the phone functions as it should.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Iphone 12 excellent condition review.","reviewDescription":"hello, so it's been two days I received my iphone 12, I ordered it in excellent condition. The phone is magnificent, no scratches, in fact there are slight ones but not really remarkable unless you look deeply for them, it's almost invisible. I was really scared to receive a bad phone but I was pleasantly surprised. everything is perfect, the camera, the screen. but on the other hand the only downside is the battery life which is 81%. It disappointed me a little but I think that when the time comes I would simply change the battery. and also the battery lasts almost all day if you do not overuse it. I advise you to order it I really like it. Thank you you did a good job👌🏾","isVerified":true,"ratingScore":4,"reviewReaction":"17 people found this helpful","country":"United States","date":1715904000000}
{"reviewTitle":"Priced Right Great Phone","reviewDescription":"I am changing from a Samsung S22 to a i12 iPhone and ordered a refurbished phone.  Technically the phone has ALL the features. This refurbished phone was listed as 'Good' condition, so the edge had a few scratches and was covered by the case I ordered. Overall, I would use this vendor again. I don't need or want the latest technology, so I always research refurbished phones.  Over the years I have purchased several 'used' phone and have been Very satisfied with the products (usually through Amazon). I got this i12 for less than $300. when the new i12 are still selling for almost $700. It also matches the technology of my S22 and I saved a ton of money & got a Great phone...","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714521600000}
{"reviewTitle":"Pretty good, would recommend","reviewDescription":"I just got my iPhone 12 (\"good\" quality) and it's worked great so far. Only complaints are that the charging cable it came with was USB-C on one end and Lightning on the other and no charging block. Second is that it seems to lose battery fairly fast, so I'll be down to 20% by the end of the day (whereas my old Android was only 60%). But it also charges very fast so it works out. Overall, satisfied. :)","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718409600000}
{"reviewTitle":"iPhone 12 used","reviewDescription":"Arrived as pictured, good shape, no damage, etc. and according to my teen, so far so good.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721606400000}
{"reviewTitle":"Or good 👍","reviewDescription":"All god just a some scratches on the camera","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Great refurbished option","reviewDescription":"Some minor issues with the mic going in and out but i use headphones for everything anyway. Otherwise, perfect condition","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719187200000}
{"reviewTitle":"Totally worth the purchase","reviewDescription":"I bought it as a replacement phone for my son after he broke his iPhone 11 and so far it works great. I was extremely skeptical to purchase a phone but I’m glad I did. It was delivered on time and easy to connect to the phone carrier he uses. I also added the insurance which was cheaper than what I pay for my 12 through At&T.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1716854400000}
{"reviewTitle":"Pretty Much What I Wanted","reviewDescription":"Color, price and a charger included were the pluses as well as quick shipment.  The only issue I had was that there were a few more scratches on the screen than I would have liked.  I had already bought one at Best Buy that I was not happy with so this replaced that one.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Very good quality but battery health not at 100","reviewDescription":"Im very impressed with the quality but the battery health was 87 which is decent but not very good for me choosing the “excellent quality” option.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719964800000}
{"reviewTitle":"Demora en el envio","reviewDescription":"El teléfono está bueno llegó con 96% de vida de batería me parece bien trae un protector de pantalla que se agradece el cable no es original y se demoró en la entrega por el clima pero el móvil todo bien","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"La pantalla no corresponde","reviewDescription":"Tengo una semana con este teléfono que de hecho hemos pedido para mi hijo preadolescente, el funcionamiento ha estado muy bien pero tenemos un detalle con la pantalla, el vidrio o cristal (desconozco realmente el material) es un tanto diferente a lo que tenemos con otros teléfonos comprados realmente nuevos en tienda. Nos dimos cuenta porque decidimos ponerle una mica de cristal templado para proteger la pantalla del teléfono pero hemos usado 3 distintos tipos de micas y ninguna se adhiere, las hemos probado en otros teléfonos y no ha habido problema. Estamos pensando seriamente en regresar el teléfono por dicho detalle. Fijándonos ha detalle en el reflejo de la pantalla cuando está oscura, las cosas se ven ligeramente distorsionadas, cosa que no ocurre con otras pantallas que las reflejan como si fueran un espejo.","isVerified":true,"ratingScore":4,"reviewReaction":"16 people found this helpful","country":"United States","date":1707609600000}
{"reviewTitle":"The screen messed up easily with only one drop","reviewDescription":"Overall great product and came with little to almost no scratches and dents","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Better than the iPhone 12pro","reviewDescription":"It has a few dents but it works far better than the iPhone 12pro","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Good phone","reviewDescription":"Every thing performs as expected, the only thing that I don’t like is that the battery doesn’t last as long as my previous phone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Got one with 100% Battery Health, minor scratching on back","reviewDescription":"Update January 2024: Still running perfectly fine, no lag or anything when using. The battery health has gone down to 89% after a little over a year of having it. Granted, I have a habit of overcharging my phone overnight when I’m asleep so that may be the cause. I still highly recommend this phone in 2024.Update February 2023: I still have the phone and the battery health is still at 100%. The phone is still working fine and I haven’t noticed any slow downs yet. I don’t regret this purchase!I believe I got lucky and got what feels like a brand new iPhone 12. I know the phone is old and I really am under the impression I got a brand new one that was sitting around for a while. Everything works fine and I’m really happy that when checking the battery health, it said 100%! I checked under direct light for scratches and scuffs. There was some minor scratches; very thin which looks like finger nail scratches. But from arm lengths distance, I couldn’t make out where the scratches were and I’m happy with it. My Samsung Galaxy S10e of 2.5 years malfunctioned recently and I needed a new phone but I didn’t want to break the bank.I did a lot of research prior to purchase on which older model was more “bang for your buck.” I found that the iPhone 12 in 2022 was a worthy  purchase considering it has a great camera, pretty display and the potential to see several more years of support from Apple (support being firmware updates which tend to include new features to your phone’s software). Nothing is guaranteed but a lot of people mentioned much older iPhones are still receiving updates. I do have a case on it but I don’t prefer any screen protectors because I want the most out of the display. If I break it, my carrier will fix it for a low cost.From now on, I’m going to buy older models of phones to save money and hope I get a quality phone like this one!","isVerified":true,"ratingScore":4,"reviewReaction":"60 people found this helpful","country":"United States","date":1665964800000}
{"reviewTitle":"Great","reviewDescription":"Nothing","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Buen producto","reviewDescription":"El dispositivo vino sin errores y sin rallones o marcas por desgaste, sólo que vino con 82% de batería pero es lo esperado al comprar este tipo de productos. Todo vino en regla cómo lo proponen en la descripción del producto.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"Excellent condition","reviewDescription":"Phone is in excellent condition and works very well","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718841600000}
{"reviewTitle":"iPhone 12","reviewDescription":"Something was wrong with the sound. Could not get the volume up. Contacted company, it took a few days to hear from them. I had to send it back and they sent a different one toReplace that one! tThey made good on the exchange!!","isVerified":true,"ratingScore":4,"reviewReaction":"4 people found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Shady- do not recommend buying a phone here","reviewDescription":"Very displeased & would not recommend taking a chance on buying a phone here. Specifically ordered an “excellent” condition phone to get the best possible quality but apparently that doesn’t  change anything. First of all, phone came damaged with a large impact to the bezel clear as day seen in pictures. That however is the least of my worries. Placed the phone on the charger & charged to 100% before removing from charger so as to not overcharge. Left phone unused overnight with 0 running apps, 0 screen time, roaming off, & no background apps of any sort. Woke up 5 hours later to a 50% battery. Phone was not updating, was not syncing iCloud, nor was anything else running during this 5 hours at all. After waking up I checked the Time on my screen 3 times (that’s it)…..47%……SERIOUSLY?! Made my 1.5 hr drive into work without touching the phone once not even to check the time (again absolutely 0 programs or apps running in background)…..35%?!?! I can only imagine that if I had been actively receiving calls\/texts & checking social media once in a while that this battery would last maybe 2 hours at best.  It’s clear to me that they must be using fraudulent parts\/batteries as battery health score rates at a 91% in phone settings which makes no sense. With a battery like this you are better off buying a corded house phone…I will be giving the seller one opportunity to correct this before taking further action. All evidence posted in pictures of screen time proof & battery degradation. Shame on Amazon for allowing this (even though this is their MO as of late)","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1718841600000}
{"reviewTitle":"Not working on arrival","reviewDescription":"This phone did not work on arrival. First, it was completely dead so I charged it for over 24 hours and it still wouldn’t turn on. While on the charger, it attempted to start up and would display the apple logo over and over again. Then when trying to do a force restart, it said I needed to connect to my computer to  restore it, but when attempting to do so, removing the cord from the phone and\/or power outlet, it would immediately die and display a dead battery screen.I called Amazon and they would only offer a return via Whole Foods or Amazon Fresh - which I do not have near my home. I was told a return through USPS or ups would not be possible. Amazon said I could contact the seller, which I did, then the seller responded that they were not liable and that Amazon would have to provide resolution. The whole experience with the phone calls and return process was not ideal and very inconvenient. I am still waiting for my refund. Amazon did provided a $20 credit to my account which I appreciate - this compensated for me having to drive 3 towns away to return the phone.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1724198400000}
{"reviewTitle":"DON'T BUY THIS, FAM! 3-MONTH WARRANTY ON PURPOSE BECAUSE THE PHONE MELTS DOWN AT 6 MONTHS.","reviewDescription":"Listen. How excited I was to purchase a refurbished iphone promised to be fully functional and the only difference from new being battery life capacity is at 80% instead of 100% - to be expected, and fine.The warranty for this purchase if 3 months or 90 days.Months 1-3, it works fine. 4, 5, battery draining more quickly - doesn't last through the whole day, but I remind myself this is a refurbished phone so it's not perfect.At the start of month 6 - my phone randomly can no longer do Face ID to open the phone. When you try to fix it in Settings, \"Face ID not available at this time\" - is all you get.Then, the right side of the touch screen stops working. Try texting or messaging without m or n or , or ; or p or o. I was out of town so had to delay getting to the apple store to fix it - and week 2, the left side of the touch screen stops working. I had to change my passcode to numbers in the middle of the keypad cuz face ID is gone and the keys on the right and left won't work.When I message and email Amazon and the manufacturer - both are EXTREMELY unhelpful - \"The 90 day warranty has passed so there is nothing we can do\" from the manufacturer and Amazon when this is an Amazon Renewed product.The warranty is at 3 months because the phone starts to melt at 4 months and craps out on you at 6 months.DON'T BUY IT.After returning from the Genius Bar at the Apple store, they told me it would cost $450 (I bought the phone for $453) to fix the touch screen and the face ID - and they were happy to tell me to buy the iphone 13 or 14.If you want to buy refurbished, buy direct from the Apple store - don't buy on Amazon and don't buy Amazon renewed or from this manufacturer.Don't buy this product. UTTERLY disappointing. And now I have to buy a new phone 6 months after buying a new phone.","isVerified":true,"ratingScore":1,"reviewReaction":"55 people found this helpful","country":"United States","date":1686528000000}
{"reviewTitle":"Bad quality item, had to return two different phones. Bad Business practices Stay Away.","reviewDescription":"Bad Business practices Stay Away. Bad quality item, had to return two different phones.Now being charged for the phone anyway after returning both defective phones.I purchased a “Renewed” iphone from OlympicWireless through Amazon renewed Store.When the phone arrived, it looked ok, but when I attempted to put the screen protector on it the phone screen surface was not flat and the screen protector would not even lay flat against the phone screen.After trying 2 different screen protectors, I realized there was a problem with the phone itself.After looking closer at the phone, the screen was visibly sticking up in several corners, not installed correctly. At this point I packaged the phone back up and returned it for a replacement phone thinking this was just a one-off item.The second phone I received, I immediately checked if the screen protector would work.  Again, the screen protector would not lay flat.I again tested 2 different screen protectors which both had the same result.Examining the second phone, it was again found that the screen was sticking up on two edges, the screen was installed incorrectly.I packed up the second phone and returned the item for a refund.I was given a refund at the time, but now, almost 2 months later I am being charged for the phone again and having to file a dispute.I would highly recommend against doing business with this seller due to Bad quality work refurbishing the phones and for bad business practices.","isVerified":true,"ratingScore":1,"reviewReaction":"15 people found this helpful","country":"United States","date":1714176000000}
{"reviewTitle":"Great product horrible customer service","reviewDescription":"I ordered a blue iPhone 12. It came in great condition, in a timely manner & it is also working great!  The reason I’m only giving it 1 star is due to the customer service.  I ordered my phone on July 30th.  Unknowingly the merchant placed a 10 day hold on my account.  On Aug 1st the merchant took the full amount out of my account & did not lift the hold like most merchants do. In return it left my account in the negative due to the hold.  So when my direct deposit hit it automatically took the money from it. Which makes it seem like I was charged twice for the same product.  Now I’m having to wait 7-14 more days just to get my money back.  You don’t know my situation, so that amount could have placed me in a bind.  Like I said the product itself is great.  So before buying from this merchant speak to your bank beforehand to know the process of how to receive your money back when charged twice from this merchant!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723075200000}
{"reviewTitle":"DEFECTIVE & BROKEN","reviewDescription":"I made a huge mistake purchasing a phone from this seller. I bought an iPhone 12 in “excellent” condition. The phone arrived with scratches all over the screen, and clearly had been dropped because there was a gash in the side of the phone. I was upset but thought whatever for that price- I couldn’t find it that cheap anywhere else. I put a case on it and screen protector, and tried to make sure everything was working. I tried making a call, and when the phone was on speaker I could hear everything clearly; when the phone was off of speaker, I couldn’t hear ANYTHING at ALL. I sent it back two days after it was delivered. It’s been a week and I still haven’t heard anything else from this seller or received my refund on this phone. This was nothing but a headache and waste of my time. It’s depressing because I really wanted\/needed this phone! They still haven’t made this right with me, didn’t offer anything for my trouble, not a discount or anything if I repurchased with them. Don’t make my mistake and buy elsewhere.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"DO NOT purchase unless you ENJOY DEFECTIVE PHONES","reviewDescription":"After setting up the phone and trying to utilize it, we made the terrible discovery that the mic is DEFECTIVE. If we try to make a call, it sounds like we are muted with a ton of static. If we try to record a video or voice message, it sounds like an awful combination of static and being stuck underwater. Imagine making this discovery after you have gone through all the TROUBLE of TRANSFERRING all photos, contacts, apps, etc., from an Android phone. We contacted the seller, and they were COMPLETELY UNHELPFUL. They gave us a series of NO-BRAINER steps to go through (turn the phone off, blow in the mic, etc). After showing them LIVE VIDEO PROOF of how this phone DOES NOT WORK, they then told us we would have to RETURN the phone to them, or they would give us a whopping TWENTY-FIVE DOLLARS to take it to a local repair shop. I do NOT recommend buying a phone from this seller unless you enjoy INCONVENIENCE, DISAPPOINTMENT, UNHELPFUL customer support, and USELESS solutions. I have purchased numerous refurbished iPhones and iPads from OTHER SELLERs and have NEVER had this issue. This phone was defective STRAIGHT OUT OF THE BOX, which lets me know that this seller puts NO CARE or EFFORT into making sure that they are capable of performing BASIC FUNCTIONS and is HAPPY to sell you TRASH. If you are an international purchaser seeking an unlocked phone to use OUTSIDE THE U.S., then I recommend that you buy a phone from ANOTHER SELLER unless you want to deal with the TROUBLE of making RETURNS from OUTSIDE THE US in order to get HUNDREDS OF DOLLARS BACK.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1704240000000}
{"reviewTitle":"I personally feel like I got scammed","reviewDescription":"I read the reviews of everyone saying their phones had no scratches, had 100% battery life, everything was perfect yada yada. That was not the case for me. I got the best option for the phone and it came with scratches and chips all over it.Battery life was 88%. By far nowhere near what was expected. To add to my frustration the seller put a “signature requirement” on my package delivery with no indication I would need to do so. So not only did I miss the first delivery attempt but I had to pretty much watch my front door all day to make sure I didnt miss it again. Aggravating to say the least after feeling like I’ve waisted precious time and money. I’m genuinely unhappy with this entire experience. If I didn’t desperately need this phone due to the current one being destroyed. I’d be sending it back immediately and finding a new device elsewhere. Not recommended.Edit: I’ve just found out that only one speaker works! To top it all off when I’m on a call with someone it sounds like they’re talking to me through a tin can! I can barely hear anything either. Honestly I’m beyond feeling like I was scammed, I’m 100% certain I was. BUYER BEWARE DO NOT BUY FROM THIS SELLER.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"Poor quality replacement parts. Phone didn't work","reviewDescription":"The phone came and it was reporting that both the screen and battery could not be determined to be authentic parts.The screen would lock up on occasion and the battery would lose all charge in a short san of time on occasion.The screen also had a noticable low refresh rate.Using third party replacmeent parts is not necessarily a bad thing, but poor quality is not acceptable.On top of this the phone would not update to the latest ios version, either due to it having a BETA installed or the issues with the screen\/battery.This phone was sent untested to me, it saved the vendor time, but wasted mine.Support when I tried to give feedback and try to get a replacement was a joke.Luckily printing a return label was easy and it is on the way back.Never again, I warn all others who try this vendor.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"The phone battery is the worst! No service! The seller does not care!","reviewDescription":"Stay away! Only had this phone using it for 3 months and the battery is on me all the time! I contacted seller and they don’t care!!!!! So I paid the money for it to have it working ( ornot working) for just 3 months???? I purchased it Nov 2023 just never transferred my info as I use it for work so it took me forever to have time for it!!! Amazon also don’t care! I asked for a replacement not even refund, I need a replacement!! Or Amazon store credit to get a new one. Can’t be without a phone. I am contacting better business bureau and attorney general now! They have to be stopped!!! Amazon sucks toooo!!!!Keep your money and go somewhere else!!!See picture as I write this review I am keeping it charged and it does not go more than 2% see picture!!!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Little to no volume","reviewDescription":"Product came in fair condition. Charging was good, size is small for people that like small phones, ease of use was good, not sure about durability literally had the phone for a few hours before returning. Never used the fingerprint sensors the phones volume is horrible and need fixing before buying. Without volume you will have a lot more phones returning back to the original seller.. other than that with these things being fixed customers will be happy","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Chips in it","reviewDescription":"It had damage to the bottom which I wasn’t so fond of, but when you put a case on cannot see. I would recommend going for an excellent phone instead of good.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"phone randomly shows colored horizontal lines","reviewDescription":"phone works well. it just randomly displays horizontal colored lines across the screen, and i’m not sure what that’s about. it has since i got it, they’re faint, but worrisome. I’ve never dropped it or cracked it. i also have a fool-proof case that extends past the screen, as well as a screen protector. I’m not sure what this is about, or how to fix it. i’m worried there’s an issue with the phone and that it’ll break down before long.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719446400000}
{"reviewTitle":"Not the best","reviewDescription":"Has some cracks on it","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Purchased for a friend new to the iPhone world","reviewDescription":"I've had iPhones for over a decade. This one the sound doesn't seem to be as loud as I'd expect, even when you put it on speaker phone.Touchscreen works really well. We got a protector for it to prevent scratches, as well as a phone cover. I consider those standard accessories for any phone.Overall battery life is fair. It is a reconditioned phone, and for a price you can get a new battery installed by someone else, or do it yourself. I've done both. Thankfully Apple has a way for you to tell if the battery is shot. This one was about 20% used, and won't go above that.Easy enough to have an external battery with you.As my friend is new to the iPhone world, he had some questions. Most things he figured out himself, even though he's not technically apt. At all.Facial recognition works really well. I like that it allows you to put in (2) faces. Either one of you without a mask, and one with ... or another person. It doesn't really care.I also like that Apple doesn't send that facial data anywhere. It stays in the phone.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1703980800000}
{"reviewTitle":"Idk","reviewDescription":"It never really was a good phone. Color was nice battery died to quick and while charging it was extremely hot and would shut down","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Phone looks great but battery at 86%","reviewDescription":"I bought this refurbished phone from Amazon as part of their Renewed Premium plan because they insist in the product description that the max battery will be over 90%. I've had bad experiences with used phones in the past so I thought this would be a good way to guarantee a quality product. The phone arrived last night and I set it up this morning. It looks well-maintained and works pretty well so far, but the battery's max capacity is 86%. This is blatantly the opposite of the product description; when I contacted Amazon customer service, they apologized profusely and offered $50 in \"credit.\" I said that was fine, I just wanted the difference between a Renewed and Renewed Premium item (or close enough) but I realized quickly that this promotional credit was not gift card money. I still haven't even received notification that I have the $50, and it's not showing anywhere in my account. I would strongly, strongly avoid Renewed or Renewed Premium products unless you're really strapped and looking to save a few bucks OR you don't mind rolling the dice with a maybe-fine product. Again, phone seems to work OK but it's Renewed at best, nothing Premium about it.","isVerified":true,"ratingScore":3,"reviewReaction":"5 people found this helpful","country":"United States","date":1698624000000}
{"reviewTitle":"Iphone","reviewDescription":"I bought mine used but payed for the premium and its still came with a few scratches but still a good phone","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Phone screen damaged","reviewDescription":"I take the public bus everyday and i cant afford to not have a phone for any extended amount of time. That being said this phone on the top tight corner is blacked out and the screen is damaged internally besides that the phone is functioning and thats the only reason i didnt return it. Do better on quality inspections!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"NON Original Screen Display with POOR Quality","reviewDescription":"I purchased an iPhone 12 \"Excellent Condition\" from MOBILESUPPLY and it was NOT. The screen display is not a genuine apple part, it says in the information, it has visible scratch all over the display and the colors quality is poor. I enfatize the fact that this is not an \"excellent condition\" iPhone and it came with bad quality parts. This product do not meet the qualifications describe in the page and this is worrying because it happens very often. I think that the third parties seller make sure the iPhone meets the conditions described before shipping. The seller was responsive for resolving the problem but the ideal would be to receive what you pay for.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Battery health average","reviewDescription":"Originally was supposed to come prime delivery on Sunday, didn’t get the phone until Tuesday. Phone has a 80 percent battery health. Not too happy about that, the whole point of getting “excellent condition” was to get a battery in excellent condition.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Apple - iPhone 12, 64GB, azul, totalmente desbloqueado (reacondicionado)","reviewDescription":"El móvil funciona muy bien. La pantala estaba rayada al igual que su estado físico. La mica llego partida.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Sound","reviewDescription":"You have to put the phone on speaker to hear your caller.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Face ID didn’t work","reviewDescription":"Phone looked in great shape for a used phone, all worked well but Face ID was disabled and could not be enabled manually due to issues with the True Depth camera. Thankfully Amazon tech support was able to send me a replacement","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1716940800000}
{"reviewTitle":"Battery not Apple battery","reviewDescription":"Because the battery is not an apple battery we cannot determine the battery strength.Being refurbished we understood the battery strength to be 80% or higher. We have no way of knowing.Otherwise the phone appears to work ok.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"It is ok","reviewDescription":"It hand a lot more scratches than a explains in the title","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Not in excellent condition","reviewDescription":"iphone frame has a scratch on the top and a dent on the bottom corner. screen also has a small scratch. didn’t even come in a protective covering. definitely not what i consider excellent condition.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"You get what you pay for🤷🏾‍♀️","reviewDescription":"Phone overheats very quickly, battery dies within an hour or two even if not constantly using. Price point was good but it’s not an ideal phone compared to a new one ofc.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715472000000}
{"reviewTitle":"Batería horrible","reviewDescription":"No me duro ni 3 meses, se le daño la batería, el botón de encendido, y desde un principio me decía que la batería no estaba bien o que no era original","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1715558400000}
{"reviewTitle":"Weak battery but otherwise good.not excellent referbished","reviewDescription":"Ok but it has a weak battery","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Phone is great but charger isn’t!","reviewDescription":"Overall, the device is in pristine condition and the phone works great but it took me a while to realize that the charger does not work. Had to borrow and original charger to get the phone going.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Great value for iphone upgrade","reviewDescription":"I needed a new phone with more storage and better battery life. This is a good value. There is a small scratch but it’s not in a place that causes any issues. Camera is better than my old iPhone XR, Face ID works great and holds it’s charge. It was super easy to set up. It’s a little smaller than my previous phone. Customer service is very good. I had to return a different phone and it was no problem with Amazon.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1721260800000}
{"reviewTitle":"Low volume","reviewDescription":"Great and fast delivery  .. however the volume jus get low randomly .but pleased with that","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"iPhone","reviewDescription":"Little scratch. But nice phone. I liked it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Great phone for its price.","reviewDescription":"Going on 3 months of usage with no problems. Doesn’t seem like a “fake iPhone” either if you’re wondering. Came with charger. Slight wear on the phone but can’t notice with phone case on top.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"it's an iphone","reviewDescription":"No issues with this, I have been using it for months. I always buy used ones and this one is working as expected. Any cripes I would have would be with apple and not with the seller. Would buy again.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Like New, Except For 🔋","reviewDescription":"I’m very pleased with the cosmetic condition of the iPhone 12. It appears to be cosmetically flawless. However, I’m disappointed with how fast the battery discharged. Setting shows the maximum battery capacity is 86%. Something to consider in the price you pay from this seller. Add on the price of replacing the battery as it will need to be done within the next year. Plus, if like mine at 86% remaining battery life, I have to charge it by evening.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Refurb","reviewDescription":"Has been ok so far. Definetly can tell it's refurbished.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Works fine - Battery 85% and Speaker Quality Meh","reviewDescription":"Most things on this phone seem to be working fine. I needed a phone in a pinch and this was a great deal.The battery capacity health is at 85% right now which is in the advertised range.The speaker quality seems kinda muddy and quiet.  It is not a dealbreaker but something to note.Overall I am happy with it!","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Looks like a new iPhone","reviewDescription":"The phone works great and looks like new. The battery isn’t very good but I’ll get that replaced.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Battery life not good","reviewDescription":"Disappoint","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Blue Vs Purple (electronic deals vs Verizon)","reviewDescription":"For the blue one from electronic deals-Well first I paid for minimal ware and got a phone with multiple scratches all around the phone paint gone each camera has scratches all over them and paint gone looks like the person changed their cases and lens protecters a lot!! The phone freezes up even on newest update I have to force stop multiple times even google it just won’t load and it’s not a wifi issue cause I have a 14 n my other daughter has a 12 both bought same time but this  one came from this seller n one came from Verizon the Verizon one came like brand new and has not one issue! Also this phone only has a 84% battery life and at 75% it will tell you to get a new one! So won’t last long…so long story short I think I will be returning it and buying from another seller unfortunately my daughter isn’t happy with it..For the purple one from Verizon!! I bought it with minimal ware so not new condition but the one down just as I did the blue one idk why it’s putting the review for both together but they are anyways this phone omg looks brand new out the box!!! Not one scratch scuff no issues what so ever we r so happy with it! My daughter is happy it looks n works amazing! Battery life is 92% and that’s really good for a 12 in used condition! Thank u Verizon!  I highly recommend! You could even go with the cheapest option and still get a new phone!!!","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1683244800000}
{"reviewTitle":"Pantalla No original es reemplazada","reviewDescription":"Compra regular , pantalla no es original y la batería Justo en 80% en dos meses hay que cambiarla ya","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Wrong description","reviewDescription":"I’ve purchased refurbished\/reconditioned items before and not had an issue. I purchased an iPhone 12 mini a couple of days ago. The next morning after it was set up and charged the battery dropped to 50% within 2 hours. When I checked the health it showed “service” and said it was 75%. I’ve started the return.I then purchased an iPhone 12 in black. I just received the item and I was sent the blue one. Not a huge deal but after the first mishap this felt a little frustrating. It’s still syncing so I haven’t been able to check the battery yet","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714608000000}
{"reviewTitle":"Mostly good","reviewDescription":"Everything is good except that the charger port seems broken\/loose, it only charges held at an angle","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721692800000}
{"reviewTitle":"It’s okay…..","reviewDescription":"Few scratches on each side. When I get on the phone, I can’t hear anyone unless I put it on speaker. The battery life is 86% but that’s fine. It’s gonna take some time getting used to, but overall it’s good. 7\/10","isVerified":true,"ratingScore":3,"reviewReaction":"4 people found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"Not so good as description","reviewDescription":"The power button died\/stopped working, and I have had to replace it at a cost. Even in saving mode, the battery must be charged two to three times a day. This is the most frustrating thing. And the touch screen malfunctions a lot.I am disappointed and afraid I did not make a good purchase. I wish I could return it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Battery health 82% scratch indention :(","reviewDescription":"Battery maximum capacity 82% and has scratch indention on bottom left :(I know it is not brand new but I figured renewed would mean they fix body issues,still usable and I love my phone just happy I got my purple iPhone I’ve wanted forever. did not come in a big box others have pictureddid not come with and charger cord or wall plug.Overall I love my new phone after upgrading from iPhone 8 definitely worth it if on a budget and in need of a more current phone tho. :)","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Disappointed","reviewDescription":"For it to be sold as excellent it shouldn’t have a battery capacity of 84% at fully charged. It shouldn’t have scratches and dings and it definitely shouldn’t have a scratch across the camera lens. This is not in excellent condition and a refurb should have a new battery!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"This Is My Last Renewed Purchase","reviewDescription":"I have purchased 5 renewed phones over the last couple of years. This one was for my grand-daughter for Christmas. I had originally purchased a red version Iphone 12 but had to return it due to weak screen at full brightness it was only half as bright as her current Iphone 10Xxr which implies to me of heavy usage from previous owner and weak battery.  Still waiting on refund for that phone. I have come to understand that you must wait on the suppliers of the phones to refund your purchase however I think Amazon implies they are guaranteeing your purchase and like all other amazon returns they will refund your money this is not what happens..  I also find Amazon is beginning to slip in customer service areas that were once routinely always taken care of, takes a week to get a package now refunds get the run around etc.  Its a Christmas present so I have to get her another one quickly so I try again with the white Iphone 12 . After getting it  I immediately notice marks on the screen and slight dents on the side of the phone. It slightly  has dull screen too not as bad as the red iphone but not as bright as her current iphone 10.  She is satisfied with it shes 12... If it was for me it would go back too... I will not be purchasing any more renewed phones...  Took five attempts with customer service being told different processes to finally get a refund.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1672444800000}
{"reviewTitle":"Was great! Here’s why it’s not anymore…","reviewDescription":"When I first got this(3 months ago) I was so happy with my purchase. I got a phone that felt and looked like it was brand new for really cheap. The screen that was used to replace it is not an apple made screen. Now I am having issues with it. The screen pops out of the casing itself and I push it back in which is not a big deal and I honestly thought that was kinda cool. But then a random line showed up in the middle of my screen, sometimes it disappears but most of the time it is right in my face. Now the screen is starting to pick up touches that I don’t make. It’ll start doing stuff when I’m not even touching it. And the bottom of the screen(spacebar and home swipe thing) are unresponsive something and very inconsistent. I am very upset with this purchase now and wish I didn’t buy it. It is taking me forever just to write this review because the screen is all messed up. I would not buy this if I were you. Unless you only want a phone for 3 months, in which case this is an awesome deal!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1716681600000}
{"reviewTitle":"Bulging screen","reviewDescription":"I purchase an iPhone 12 a month ago and noticed that the screen has started bulging more and more from the back of the phone to the point where it’s very noticeably poking out from my phone case.  After reading a bit I’ve learned that this can be a bad battery and potentially dangerous.  I contacted the seller and they told me I would have to return the phone and IF they have stock they can replace it for me.  This means Iwill be without a phone and there are no guarantees of a replacement.  I was hoping for a bit more help after receiving a faulty and potentially dangerous product.  I hope I don’t run into the same problem with the replacement, IF they can send me one.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Amazon Cares Little About Supporting Students","reviewDescription":"Bought this phone to make the jump to iphone from android. Was impressed at how clean the phone looked and the professional packaging. After setting up the phone I noticed on my first phone call that the speaker had an unusual rattle. The rattle was confirmed and more noticeable while playing music and videos. Not impressed that a phone that supposedly passed a \"20 point inspection\" was allowed to ship with a noticeable rattle from the speaker. Sure the speakers worked but the sound was distorted which was irritating and unexpected.After calling Amazon support to promptly report the issue, the support staff were incredibly understanding and tried to come up with a solution. But, this is my first new phone in 4 years (my previous phone being a refurbished Android bought from Amazon) and I had upgraded after prompting from my carrier to upgrade due to network changes so I can not just reactivate my old phone in the interim. The only recourse the staff could offer was a refund after returning, not even a replacement after I indicated I liked the phone besides the speaker issue. So to end up with the same iphone I have to ship this phone back, wait for a refund, and then reorder the phone from Amazon!Mind you I would also have to either work without a phone (which isn't an option thanks to two step authentication) or go buy a different phone in the interim that I could receive sooner. I am extremely disappointed in Amazon's ability and willingness to support students and the lack of options the support staff were able to offer despite their best efforts.If you are looking for a phone that might \"look\" great but will probably have a noticeable defect then this is the option for you but don't bother trying to receive adequate assistance from Amazon, especially if you are a student because they will leave you high and dry without any satisfactory options.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1673740800000}
{"reviewTitle":"Extremely disappointed","reviewDescription":"I originally was going to write an amazing review, the product was delivered to my house early, I got an excellent and the minimum battery life is 80%, the one I received was 90%. Everything seemed great until a week later and my battery went from 80% charged to 1% all of the sudden. I thought maybe I left something on and drained it so I put it to charge, and it wasn’t charging. I decided to look at the battery health to see if it dropped and there was a notification saying that the battery in this phone is a non-genuine Apple battery. So basically, they sent me a phone with a fake battery that is now turning off every few minutes and won’t charge. I am now returning it and hope they have the decency to refund it full price. Thank god I still had my old phone because I am leaving the country in a couple of days and can’t afford to get another one before I leave. What is the most upsetting is that I did my research on the seller and it seemed to have very good reviews and the bad ones seemed to not be the seller’s fault. Honestly if you want a refurbished phone just get one from Apple, it’s safer. The seller I got this from is Kanga Supply by the way.","isVerified":true,"ratingScore":1,"reviewReaction":"12 people found this helpful","country":"United States","date":1709942400000}
{"reviewTitle":"Very Disappointed and flustered","reviewDescription":"I was so excited  to upgrade my phone.  I even spent $16.99 to get it ship early.  It did arrive on time. The outside of the phone looked really nice. Only had a couple tiny scratches on it. You really had to look for it to see them. Unfortunately my phone didn’t work.  The phone software wasn’t updated.  When I tried to transfer my phone it wouldn’t work.  Even used apple online to help me troubleshoot.  The phone would start the process then goes to black screen and start over asking to pick a language again.  I am going to take this as a fluke since there are so many positive reviews.  Just wanted to let people know you may get a lemon.  So don’t be overly excited like I was because you may get disappointed.  Even though I am very flustered of the hours wasted to try to get this phone to work.  I may try again once I receive my refund.  I will update update how the phone works out of the box.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Four purchases - all poor quality","reviewDescription":"I bought four refurbished (renewed) iphone 12s and they were all poor quality. Regardless of the condition I selected, each device had issues from four different sellers. It's like the vendors do not even check the phones before selling them and select a random condition to sell them under.I returned all four iPhones I bought.Here are the details of my purchases:#1 was Good condition - ear speaker was blown, it crackled bad on phone calls and listening to music. battery health was at 92%.#2 was Good condition - ear speaker did not work at all. battery health was at 82%.#3 was Excellent condition - case had minor scratches. battery health was at 79%.#4 was Excellent condition - screen had scratches, case had lots of scratches, and battery health was at 79%. It was the worst condition, yet highest priced, refurbished iPhone I purchased. It should have been listed as Acceptable condition.After this experience, I went to the Apple store online to get one of their refurbished iPhone 12's which comes with a new battery, case, and a warranty.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"DO NOT BUY!!!! Poor quality and a waste of time","reviewDescription":"I bought this phone as a quick replacement for a water damaged phone. The phone is supposedly “premium refurbished” well then how did someone miss THE COMPLETELY BLOWN OUT LOUDSPEAKER?!?I messaged the company and their response was to essentially be without a phone for a week and a half because you need to send them the phone first, they receive the phone AND THEN they send the replacement.I don’t think it’s right to charge someone for something that’s defective and then inconvenience them for your mistake.Good luck with their customer service, it’s nothing but canned replies.I ended up having to SPEND ANOTHER $60 to get the speaker fixed locallySpend your money elsewhere","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"unacceptable","reviewDescription":"I ordered this a day ago expecting it to come in excellent condition as i ordered the speakers don't been work its clogged with dust such and such and i cant even return it cause the process is too long and i cant return it in my state (my condition) but as I'm saying i ordered this apple iPhone 12 for it to come not alone did it come damaged as i paid EXTRA money for it to be in excellent condition it came as an mini iPhone which i did not order i paid 344 for this phone i could've gotten an iPhone mini for less cheaper as in 100 dollars left I'm disappointed especially since this is my first time","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Does not last","reviewDescription":"I had the phone for a few weeks and everything seemed fine. It died last night and won't turn on. I've charged it all night and nothing. Tried to reboot it and nothing. Just a black screen, not even a low battery picture when I try to turn it on. I took it to a repair shop today and they tried a new battery and said it was not responding to anything. They said they didn't see any water damage or anything either. Really not satisfied with this as it took me a few months to save up for. Good news, I get a refund for what I paid for it.. So that's appropriate","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"10 months later....","reviewDescription":"I'm not that thrilled with this purchase. The battery is expanding, so that the screen has become loose. I suspect that the battery was not new when I received the phone. I will have to replace this phone a lot sooner than I would have if I had bought a new phone from Apple. So, I'm not sure that buying a refurbished phone has really saved me anything in terms of money or electronics waste. There is very little transparency about what parts are used in these refurbished phones, so you're at the mercy of the company that is reselling.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Excellent condition isn’t very excellent","reviewDescription":"Item came scratched all over front side and on back of phone. Second phone came in an identical state despite being categorized in excellent condition. Phones also came with screen protectors to hide the scratch damage on the front of the phones. Would not recommend at all.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Heats up fast","reviewDescription":"I think it works overall it jus over heats fast- update the battery wouldn't stop dying so I returned it and I've been trying to get refunded for two days now having major issues not happy","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Phone in bad condition instead of a “good” one","reviewDescription":"I ordered iphone 12 “in good condition”, but the one i received I would rather treat as bad or “acceptable”, but far not a “good” one:Scratches and deep dents are all over the body and camera, deep scratch is on the screen. Battery is only 82%. I’m so unsatisfied!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722297600000}
{"reviewTitle":"Trash","reviewDescription":"From day one it would not hold a charge.  Took it and had the battery tested and was told the battery was good and that whatever was wrong with it was internal and that they couldn’t tell me what it was.  Returned it for a refund.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Wasn't so excellent.","reviewDescription":"Don't but it excellent they give you a bad one anyways. Just save the money and get the cheapest one, then when you have enough money just get a new phone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Short Life Span","reviewDescription":"Phone maintained a charge for 3 months, then died. It was tested at U Break I Fix, the phone refuses to even accept the current required to charge it. ABSOLUTELY ZERO EXPOSURE TO WATER OR MISUSE. Did Jem Jem offer to replace it? Of course not!  Stay away from this seller.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"Battery health undetectable….","reviewDescription":"Phone arrived with dead battery. Immediately charged it. Upon turning on the phone there was a message about the battery when clicking on it showed the attached messages about the battery. Wouldn’t go away. Who knows if the battery is bad, or the battery isn’t genuine or if it’s not installed right. It would not show the health of the battery. Couldn’t take a chance to returned it the same day. There were also a couple pictures saved on the phone showing screen shots of the testing of the phone. Phone was not wiped clean ready for new setup.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"I was sent a phone that would not open because it was password protected","reviewDescription":"I was sent a phone that would not open because it was password protected,, I hope the next one doesn't have this issue,, not happy,It would be nice if the new order was sent faster to make up for this,,, please!!! Update,, the phone was returned over a week ago still no refund, the new phone order was supposed to be delivered on 3rd, and still has not checked yet, it's not expected until the 10th now","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719187200000}
{"reviewTitle":"Duplicate Battery Installed","reviewDescription":"After using it for almost a year the sound of my phone was somehow not good. So i took it to the service center. When they opened it they claimed the battery of the phone was duplicate. That feels cheated that too on amazon website.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Not a Happy Customer","reviewDescription":"Phone will not charge or turn on. It tries to power up but nothing happens past the Apple symbol. Waiting on vendor to see where we go from here.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Terrible! Quit working after 3 months!","reviewDescription":"**UPDATE** after taking the phone to be repaired I was told this is bot the Iphone 12 6.1in, but, the Iphone 12 mini 5.4 I was sent the wrong phone altogether! I spent $322 and wasnt even sent he proper phone.  I am beyond disappointed with this Amazon isn't being helpful at the moment to try and gwt it corrected. I bought this phone 3 months ago and the screen completely failed with the \"green screen of death\". I have tried factory resetting, manually resetting, and every other fix possible. Phone needs a new screen. This phone is in mint condition kept in an otter box. Never dropped, never exposed to water. Terrible purchase, I do not recommend.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721260800000}
{"reviewTitle":"Crap","reviewDescription":"This phone is trash..  Iv never been so disappointed in a purchase in my life..  fist of all the phone shows up with a big crack in the glass back.  I think oh well it’s refurbished and I’m just going to put a case on it so who cares.  Then  I power it up and it was never factory reset.  Everything was in a foreign language.  After sorting this out  I find that my batter life is short.  Very short.  System says it has 87% battery life but my experience says otherwise.  I can get maybe 4 hours out of a complete charge only if I don’t use the phone at  all..  iv seen it drain a whole battery in as little time as an hour.  I am completely disappointed an will be buying a screen for my old iPhone and just using that.  And I guess I’ll just toss this pile of junk in the junk drawer.  Big waist of nearly 300$","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1711152000000}
{"reviewTitle":"Problems from the get go","reviewDescription":"Since I’ve purchased this phone, my iMessages come through and I see the notification on my Lock Screen, but when I open the actual message, the message is gone like it never came through. The screen is so sensitive and I’m constantly correcting my typing (itll type doubles when I don’t want doubles), even with the sensitivity setting on the lowest. Now my pictures won’t send through text and I’m not receiving soome of the texts being sent to me. Every now and then while listening to music, the volume will just randomly go lower so I have to restart the app for the volume to go back to normal.This has been so frustrating :(","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720656000000}
{"reviewTitle":"Worthless","reviewDescription":"Purchased the phone for my daughter.  Description says the phone is unlocked.  When Sim card was placed in the phone it says SIM NOT SUPPORTED. Took phone and SIM card to phone carrier as the message says the phone may need to be unlocked or another SIMcard needs to be placed by the carrier.  NOT EVEN THE CARRIER COULD ACCESS THE PHONE.  It was locked! So now I wasted almost $300 and have no phone for my daugther to use.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1723680000000}
{"reviewTitle":"Stay Away!","reviewDescription":"I used this phone for a short time and the battery is always giving problems! The seller doesn't help, and Amazon doesn’t care either! I paid for a product that barely worked. I asked for a replacement, not a refund, just want a new phone or store credit to buy another. I can’t be without a phone. I’m going to report this to the Better Business Bureau and the Attorney General. Amazon is bad too!Keep your money and shop elsewhere!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Very disappointed","reviewDescription":"I have been a fan of and purchased all of my phones in the last few years as amazon renewed phones. I haven’t chosen premium as I’ve been very happy with the condition of the phones as just renewed. I ordered an iPhone 12 a couple weeks ago and was very happy with it so I ordered a second renewed iPhone 12 that should have been in excellent condition. The phone I received was awful. Opening the box you could tell it had been dropped as the case was dented. Thinking I would give it a chance I got my old phone backup loaded only to find the top half of the screen didn’t work and the display jumped around so much it took me two hours to reset the phone so I could return it. This phone could not have been tested. All my other phones had come from New York area and this one came from California so I’m not sure if there’s a severe quality control problem there as this phone should never have been sent out. Now I’m held up weeks as I return the inoperable phone to get a refund so I can order another.","isVerified":true,"ratingScore":1,"reviewReaction":"10 people found this helpful","country":"United States","date":1706832000000}
{"reviewTitle":"Bad Flaw And Impossible To Fix","reviewDescription":"So the phone will not reliably connect to the wifi and stay connected.  Went through all the usual ways to fix it, no good.  It just doesn't work.  The link time is around 30% slower for download but upload is the same compared to the old Iphone 11.But nothing can be done to exchange it.  I bought it as a gift for someone in Thailand, paid the extra shipping and importation fees.  After a ridiculously delayed shipping time (about a month), it simply being placed into shipment, this happens right away and now there is nothing can do to exchange.They won't do a general send a new one and send back the old one.  You're on your own for sending it back, and no exchange possible.  Would have to pay and shipping charges over again, wait at least a week before having it recredited, and then take business elsewhere.Yes it was stupid of me to buy international off of here, but they said their 90 Warranty applies and offered it for international order.In reality it's a ripoff and now going to have to pay for a repair.A flaw this obvious really should have beeb caught for a rebuilt phone.  They should never have released this from the factory.  So naturally this can happen with one you buy.For me, a complete ripoff","isVerified":true,"ratingScore":1,"reviewReaction":"22 people found this helpful","country":"United States","date":1675728000000}
{"reviewTitle":"Face Recognition died, non-genuine parts, poor battery","reviewDescription":"When I first booted it up I got this message:  \"Unknown Part - Unable to determine if your iPhone camera is a genuine Apple part. This could be because the part is non-genuine, not functioning as expected, or the installation is incomplete.\"I was super aggravated but my daughter needed a phone and everything seemed to be working properly.Battery life was pretty weak but she seemed to be dealing well enough. I should have returned it immediately.4 months of decent working condition and now the Face Recognition just stopped working. What a disappointment this Amazon Renewed product has been. 90 Day guarantee... we made it about 120 days but now NO Face Recognition and poor battery performance. I had hoped to get one year out of this phone. I knew it was an older model but I think 1 year on a Renewed product was a more than reasonable expectation.DON'T waste your money on this renewed product.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Disappointed amazon let privi tech sell me this potato.","reviewDescription":"When i bought this photo it said seller was amazon renewed store. Wasn’t true. They then made me go through seller helper bot to customer service to contact refund on behalf of the third party they’re not liable for. Sound didn’t work on the phone hardly at all. Still waiting on it to ship. First phone purchase in 5 years a waste. Beautiful phone came quick setup quick useless for anything but work","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Seller Trying to Rip Me off","reviewDescription":"This phone arrived defective. I could not set it up because it kept turning off even though it was fully charged. I initiated a refund as it was suppose to be covered under Amazons seller-renewed program. this is the response I got from the seller,Hello,  At this time, we have initiated a $1 refund towards your return since the device was received damaged and as you may know, customer damage devices are not covered by Amazons seller-renewed program. Unfortunately, we can't accept this return back for a full refund as it has voided the warranty but, we can offer one of two options.  1. Refund the order with a 20% restocking fee 2. Return the device back with no further resolution In the event, that we do not hear back we will proceed to return the device back to the address we have on file.I did not damage the phone, I returned it in its originally packing. If it was damaged it already had been and it didn’t work. They want to charge me 20% restocking fee for a defective and supposedly now damaged phone?? I think this seller is trying to make money on defective phones!! DO NO BUY. Update: They keep insisting that I damaged it and that they are returning  the phone to me and issue no refund. This seller should be shut down.","isVerified":true,"ratingScore":1,"reviewReaction":"36 people found this helpful","country":"United States","date":1676332800000}
{"reviewTitle":"Good","reviewDescription":"The device was good except bettery. The battery health is only 80. I personally expect atleast 90 or higher It's dissapoint me and there was a Little scratch on the edge of the screen.otherwise everything is in good condition.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1721952000000}
{"reviewTitle":"Battery Health Not as Guaranteed","reviewDescription":"Purchased from this listing 2 different times, from two different sellers. Both times, the item was shipped through Amazon and sold by a seller with a 95% or higher positive rating in the last year. In both instances, I purchased a refurbished, unlocked iPhone 12 with 256g storage that was listed as \"Excellent\" condition.Unfortunately in both instances, the phone's battery health was less than 80% (the listing guarantees battery health of 80% or higher). One was 77% and one was 79%. I read reviews of people getting above 80% so I returned the first one, which was 79%, and paid a higher price for the second one--the 77% one! Otherwise, the devices both seemed to be in great condition.","isVerified":true,"ratingScore":3,"reviewReaction":"9 people found this helpful","country":"United States","date":1714435200000}
{"reviewTitle":"Slow shipping","reviewDescription":"Did not receive for over a week after ordering. Seems to overheat quite easily.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Microphone - Call Quality","reviewDescription":"This iphone was inexpensive and therefore still probably worth the money. The reviews I read warned me about the potential poor battery life and call quality. Unfortunately, I am experiencing both. The battery reads at a maximum capacity of 90%, however, when streaming music or downloading apps, the battery life is dramatically low. As far as the call quality, unfortunately, all calls must be taken with earbuds or kept on speakerphone. Seeing as I own earbuds and often take calls on speaker phone in my home this is not a huge deal breaker but definitely not ideal.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1717372800000}
{"reviewTitle":"Returned","reviewDescription":"64gb I'm this day and age us useless.  128gb should be minimum","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722816000000}
{"reviewTitle":"Performance functionality and appearance.","reviewDescription":"This was a refurbish phone, the unit was ok but no more than that the battery total life was at 80% which is on the low side I also had some issues with the charging system I wish I would have returned it.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1720915200000}
{"reviewTitle":"Cute! & asthetic.","reviewDescription":"Has a tiny scratch on the screen and came dirty with some glue? or sticky substance near the buttons. other than that the phone is great and is functioning properly. i was skeptical but i do not regret it! 🙂","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1720310400000}
{"reviewTitle":"Be careful","reviewDescription":"I bought a refurbished cell phone - excellent, with the promise that the minimum battery would be 80% but when I check the cell phone I find that it is at 79%, some of us hope that it will be more than 80% but I didn't think it would be less than the promise. For this, maybe I would have bought a reconditioned-good one and it was cheaper. The screen is fine but the corners and back of the phone have light scratches. What disappointed me was the battery.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1719014400000}
{"reviewTitle":"Battery is not so good and there is a some crack on back","reviewDescription":"The batter is %78 and there is a crack on back.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"crApple Phone","reviewDescription":"0 stars becuase its a crApple Phone, nothing special here.The 3 stars is for the seller who had it delivered to me extremely fast.It would have been 5 stars, but it is a crApple phone","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Defective Iphone. Seller has a different return policy than Amazon.  Charged restocking fee!","reviewDescription":"Stay away from this seller!!!  I ordered an Iphone 12 from them and it did not work.  The sim card was not recognized by the phone.  I called me carrier and they could not get it to work.  I took it directly to a local carrier location and they tried 2 new sim cards and also the e-sim that is in phone and nothing.  Took the phone to the Apple store and they would not service it because it was from a 3rd party seller.  Called my carrier again and they connected me to their Apple tech support and nothing.  Amazon gave me a 90 day window to return the phone.  The seller has a different return window of 30 days.  I returned the phone and they charged me a restocking fee.  I've purchased many cell phones from Amazon sellers and had to return a few over the years.  I was never charged a restocking fee by any of them.  Stay away from this seller.  There are plenty of good ones out there to do business with.","isVerified":true,"ratingScore":1,"reviewReaction":"9 people found this helpful","country":"United States","date":1710288000000}
{"reviewTitle":"Bueno? Para nada, no lo compres.","reviewDescription":"Necesitaba un celular y decidí comprar este por los buenos comentarios y fue la peor decisión desde que lo recibí se sentía caliente, prendió una sola vez y se apagó el solo pensé que era Por la carga lo puse a cargar y nunca mas me encendió a sido la peor experiencia que he tenido con un producto recomiendo que no lo compres","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Bad Battery water damage","reviewDescription":"The phone wasn’t holding its charge, overheating and  the bottom of the phone was swollen at the edges, took it to a repair shop to check it out, technician informed me that this phone had water damage and the battery was swollen, replaced the battery and it’s still not holding its charge and overheating, not sure about the quality of “Amazon Certified”","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724803200000}
{"reviewTitle":"Became relooked after going to Europe","reviewDescription":"This phone was great until we used a European SIM card. After hours on the phone with Anazon and Apple, (we originally reached out to this seller) we found out that it was relocked and went back to its original carrier, which was  Straight Talk. So unless we bought Straight Talk Service it was unusable. We didn’t want a new carrier so the phone is useless.. Since this happened after the 90 day guarantee this company wouldn’t help us. Amazon finally gave us $100 but we were out a phone for two weeks before it was resolved. So beware if you travel, Amazon and this seller do not honor Anazon  verified, refurbished and fully unlocked.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"Don’t do it! Buy at your own risk!","reviewDescription":"Phone is trash . It could not call or text eith SIM card. It said dos and network unavailable. I googled reason for this and it said likely used in scam, reported as stolen and then sold to some poor person . This was a present for my son. He was so sad when I took it back to return it. This phone was a complete waste of time, money, and energy. I hope they refund all my money because they day they don’t have to","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721952000000}
{"reviewTitle":"I GOT SCAMMED","reviewDescription":"I bought this phone as a Christmas gift for my daughter. It worked for five months and randomly shut off, and directed me to connect it to my MacBook and restore it. I attempted the restoration multiple times. It failed each time, showing “Error 2015.” According to the information I’ve found on the internet, that error indicates a hardware failure issue. I paid $400 for this phone all for it to no work after a few months. THIS IS A HUGE SCAM! DO NOT BUY!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"completely unresponsive after just 2 drops","reviewDescription":"i would not recommend this purchase. the battery of this phone is very poor. fully charged in the morning and dying by noon. i dropped this phone (with a case on) and few times over the span over 2 months and now it is completely unresponsive and the screen has green lines on it. seller didn't respond either.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723766400000}
{"reviewTitle":"Phone Was Reported Stolen","reviewDescription":"I purchased 2 phones one phone I was able to switch the service within 5 minutes and the other phone when I tried to switch service stated that \" Whoops This phone has been reported lost or stolen please contact merchant for further assistance\" would not connect phone is in route for refund will comment after returned...","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Kept freezing","reviewDescription":"I got the black iPhone 12 in \"excellent\" condition. Within 1 day of receiving and setting up the phone, it wouldn't stop freezing up. The screen wouldn't register when I would touch it, and if it was in the middle of something it would just stop. All I could do was turn it off and wait for it to unfreeze which could take up to an hour at times. After a few days I traded it in for a new phone at Verizon.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722038400000}
{"reviewTitle":"Not very happy with my purchase after problems arising 3 months prior to purchase.","reviewDescription":"I ordered this iPhone because I saw that it was a good deal and I believed would be a good alternative to spending hundreds on dollars on a new one. I was WRONG. It’s seems  to be glitchy and the camera lense stoped focusing 3 MONTHS after using it. I called around and was suggested to just order a brand new iPhone instead of buying another one off of Amazon or Walmart. Again so upset in the decision. DONT RECOMMEND!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Have had problems from beginning","reviewDescription":"The phone has on the setting icon a red number beside it. It's because they must have replaced the screen with an after market screen. The iPhone said it didn't recognize the screen. My wife uses it. She wanted a 5g phone so we bought this to replace an XR we bought refurbished and she has never had any problems with it. Then the battery on this 12 ran down quickly. Didn't hold a charge very long at all. When we received it showed around 83% health. But it wasn't very healthy. So we spent $100 to get a new battery. I knew I would have to replace it sooner or later, I just thought it would be later. The sensitive touch is not all that responsive. Not nearly what the iPhone XR has. I use it now. I haven't sent it back but I can't give the phone over a 2. Still trying it out but don't think it's going to smooth out by itself. I have bought a number of refurbished items from Amazon. This is really the first one with problems.  New addition to original Post. OTHER problems. The only way we can hear incoming calls is through speaker. Never through  built in speaker. Returning. I would take an exchange but only refund was offered","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Not “Excellent Quality”","reviewDescription":"Refurbished-backed and supported by Amazon, reviews of Amazon renewed products highly positive. Bought iPhone 12 renewed, received and appeared in excellent condition. Transferred info from my phone, working well except on day 1, after completing a call, screen went black, completely unresponsive to all attempts of changing (unable to turn on, off, or get anything else). But, only lasted 1-2 minutes and suddenly came on.Day 4 same black screen occurred after a call, but not resolving. Just sent old phone in as trade-in, obviously unable to call customer svc, went to online chat on my computer, not an easy task but typing all symptoms then waiting for responses, 1st with assistant, then transferred to someone, repeating some of conversation, transferred to someone else;  all close to 2 hrs just explaining my issue.  During the end of this, the phone suddenly came on, after 4+ hrs of black screen.  Have not tried calling anyone but using text and internet options. If happens again, I could lose all phone data - contacts, photos, subscriptions, invoices, - so much we have on there!My options, per emails with customer service, were to contact seller and see what was proposed but no automatic replacement. Main recommendation was to return phone to Amazon and refund expected usually about 30 days, maybe more.I have already sent in my old phone.  Before returning this new phone I need to purchase another so I can hopefully still get data transferred.  So much for a safe inexpensive option of buying renewed.  Will have to spend another several hundred bucks for yet another phone, hoping this damaged one will last long enough to transfer data, And what does that mean as to my trade in?  Still don’t have all answers from customer svc.This has not been a great experience, especially since I don’t have a phone I can trust to make any calls, and don’t know what the issue is so am nervous I may lose all data in the phone at any point.In Limbo and very disappointed","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1712275200000}
{"reviewTitle":"Great cosmetic condition but cameras would not focus.","reviewDescription":"Would’ve given this transaction a four star if the cameras would’ve worked properly!  Cell phone basically looked brand new with very minor cosmetic flaws that were even hard to see. Battery appeared to last one full day and phone would get warm on the back which may be normal for this model of phone?. I had no problems with the phone on my Verizon account once I inserted the Sim card from my old phone. Was disappointed that the cameras would not work due to not being able to focus which made some of my online accounts useless. I am returning the phone and I will update this review once I see how the seller handles my refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721520000000}
{"reviewTitle":"Glass scratched","reviewDescription":"Under features and details, the listing stated “inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm’s length”I consider the scratches and chip in the glass to be noticeable when held at arms length.  And the tempered glass cover I got for it doesn’t seal around the chips.  I could have returned it, but was a little impatient due to personal need of a “new to me” phone.  That being said, I don’t think I should have been in the position to settle for the screen with three total NOTICEABLE chips\/scratches because this phone passed their inspection.-The battery is at 82%It was unlocked and was surprisingly painless to get set up with my carrier.It’s too soon to tell if I will be happy with the purchase, but it IS better than the iPhone 7 I had to upgrade from.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Battery Problems","reviewDescription":"I bought this phone expecting it to be refurbished but upon arrival, I noticed scratches on the side of the screen. After using it for a day I was wondering why the battery was dying so fast, I looked at the battery health in the settings and it was 70% and it said that I would have to get the battery replaced soon. On the title of the product, it said that the phone was in acceptable condition but it never specified what exactly was wrong with it. I just was under the impression that buying a refurbished phone would mean that it would be good quality.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Something Just ain’t Right","reviewDescription":"This phone has issues: Battery, WiFi, touching screen, Radiation, Getting overheated, jumping, freezes. Always saying I need space and network problems.It jumps around. Times I can’t see my family members on Tracker.Research this phone and man. It’s really 😫😡. I miss my 8plus.Likes:  clearer FaceTime. Some apps work good.Siri can hear.Don’t buy a 12, So the research!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Refurb not as expected","reviewDescription":"Product arrived and was packaged okay, but did not behave as expected. When connected to a charging device the phone would erratically open and close apps as if the device was being touched repeatedly. Would not recommend. I would advise the seller to do Quality checks on this before putting it up for sale.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1725148800000}
{"reviewTitle":"Do not buy","reviewDescription":"I ended up returning this phone. I purchased it under the \"Renewed Premium\" standard, so I thought it would be fine. The battery capacity was at 89%, and when I turned on the phone there was a big warning that the display was not an Apple part. Within a few hours of turning the phone on, there was a big line that went across the entire screen. Overall, it did not meet my expectations, and I would rather buy with something certified like Best Buy.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720656000000}
{"reviewTitle":"Be careful!","reviewDescription":"You kinda get what you pay for with these things. When I received the product there were slight marks on the back lens and the right side of my screen needed extra pressure to click. Thinking this was due to my screen protector I saw no wrong until I took it off months later to see that actually the screen itself seemed to be replaced and wasn't installed properly. Other than that it's a decent phone, the battery deteriorates very fast as time goes on! but again you get what you pay for! I would suggest just buying a brand-new phone.  6 months post- it doesn't hold battery!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715731200000}
{"reviewTitle":"Screen had scratch but was supposed to be in Excellent condition.","reviewDescription":"The phone was in excellent shape except for a nick in the center of the screen, a circular scratch about 2mm in diameter and noticeable at arms length. Since this was for my daughter, who was at camp for two weeks, and I did not want to spend time sending it back and purchased a screen protector anyway. Recommend checking as soon as you get it, if this stuff matters to you.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721779200000}
{"reviewTitle":"Great iPhone 12 in Great condition","reviewDescription":"I was so skeptical about purchasing a used iPhone online i purchased it for my 10 year old daughter because her iPhone 11 stopped working and i needed her to have a phone for emergencies, this iPhone came in perfect condition small scratches that’s hardly noticeable it came with a screen protector and charger adapter and cord and instructions for set up that was so easy we didn’t have to go in store to T-Mobile to switch anything we was able to take her SIM card out of old phone and put it into this iPhone 12 I’m very satisfied with this purchase and my daughter is happy with the upgrade from a iPhone 11 to a 12  I would definitely purchase with this vendor again  if you have doubts don’t take a chance you will be happy that you did","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1718236800000}
{"reviewTitle":"iPhone.","reviewDescription":"My son liked the iPhone very much he needed the phone so he could keep in contact with us.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"I was nervous, but pleasantly surprised!","reviewDescription":"I have been looking into purchasing a refurbished phone for a bit now, and was originally going to buy from backmarket.com but found an article listing out the best places to buy refurbished from. #1 on the list is of course, direct from apple, but also most expensive. The next on the list was Amazon renewed. I gave it a shot, and also saw that the specific seller of the 12 I received had pretty good ratings as well.I received the new device on the day it was expected and the phone is truly in excellent condition. No dents or deep scratches, no evidence of after market parts, battery health at exactly 85%, a scuff on the back of the phone only noticeable in the right lighting, and no visible scratches on the screen itself with a screen protector. There are light scratches on the screen of the phone, but again not visible with a glass screen cover.Overall I am extremely pleased, I realized the possibility of the occasional lemon amongst all the good experiences, but based off this purchase, I would buy from Amazon renewed again!I went from an XR (that was on the fritz!) to a 12 for less than $300. I’m happy! I will note I purchased one in “excellent” condition.","isVerified":true,"ratingScore":5,"reviewReaction":"33 people found this helpful","country":"United States","date":1716508800000}
{"reviewTitle":"Delivered as advertised.","reviewDescription":"Like new condition. Exceeded my expectations as a first time used-phone buyer.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"A very good product, so far so good.","reviewDescription":"For the price its in very good shape. No regrets.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"Excelente Compra","reviewDescription":"Buena Calidad, No Rasguños, o Golpes llego en excelentes condiciones","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724976000000}
{"reviewTitle":"accurate description","reviewDescription":"accurate description and fast shipping, I highly recommend this seller","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723939200000}
{"reviewTitle":"Acceptable = Good","reviewDescription":"No issue with the iphone 12. Would buy again.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724630400000}
{"reviewTitle":"What I expected","reviewDescription":"What I've expected!  No problems thus far! My grandson, loves it and that's all that mattered.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"¡Gran teléfono!","reviewDescription":"¡Llegó en perfectas condiciones! ¡Muy buen equipo! Es un teléfono realmente hermoso, me encantó el color. Llegó a tiempo y todo en perfecto e stado.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723075200000}
{"reviewTitle":"Poorly packaged, poor battery health","reviewDescription":"I picked the most expensive option for an “excellent” condition refurbished iPhone 12. Phone arrived with no padding at all. It was bouncing around inside a small box which was bouncing around in a huge box, which had been crushed in on one side. Saw no apparent damage, and the exterior was clean without scratches, but the battery health was only 85%. According to Apple, that means it would be good for 2-3 months of normal use before it would drop to 80%, at which point they tecommend a battery replacement. Ludicrous.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Battery and screen issues","reviewDescription":"When I first turned the phone on it said it was using a generic phone screen and not apple which at first I thought was fine. But as I started using the phone I realized that the touchscreen didn’t always work.As well the battery is constantly overheats preventing it from being allowed to charge.Disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Poor battery life; replacement never came","reviewDescription":"Condition was great, but poor battery charge. Ordered a replacement, was “lost in transit.” I called to ensure replacement was canceled so I wouldn’t be charged for not returning the original… sure enough still was charged for a replacement that was never delivered and now I’m fighting to get a response and my $344 back.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1713312000000}
{"reviewTitle":"Chipped\/Cracked screen","reviewDescription":"I received my phone in an undamaged package, opened the package, and saw my new phone had a chip\/crack on the bottom left corner of the screen. This was very disappointing. Everything else appears to be fine and the crack is small… I need the phone for work so I will be living with it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"More wear and tear than expected","reviewDescription":"\"Excellent refurbished phone\" several scratches, chiped on corners, screen has discoloration.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Screws","reviewDescription":"When we received the phone the screen was popping up just a tad in the bottom left corner, luckily we knew what to look for and sure enough two screws were missing on the inside.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Developed Ghost Touch issue after 5 months","reviewDescription":"Product was refurbished but has hardware defect that allows ghost touches on the screen. The phone has become unusable. We have gone through all of the troubleshooting steps and fixes and nothing is working.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716422400000}
{"reviewTitle":"Scratched, advertised as excellent!","reviewDescription":"Got an iPhone 12, unlocked and refurbished, paid for the Excellent option. It came a day later from its original promised date, which I don’t mind that much, but its condition was fair at its best! I know it’s a pre owned phone, but if the excellent option comes like this, imagine the good or fair one! The phone was intended as a gift for a cousin from Europe, who is leaving today, otherwise would’ve returned it.Ps, the phone I’m sure it will operate fine.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1709164800000}
{"reviewTitle":"Condition","reviewDescription":"I order the like new condition and got a good condition phone instead every port was filthy I had to take it myself to a pro to clean it deeply other than that the phone worked well just disappointed I didn’t get what I paid for but aye you live in you learn 🤷🏽‍♂️ Not mention my mute button was so stiff to turn on and off 🤦🏽‍♂️Buy at your own risk I guess some people on here get what they actually paid for","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705968000000}
{"reviewTitle":"Battery life","reviewDescription":"I paid extra to get the “excellent” quality phone. It said the battery health would be at least 85-90%…It’s at 80% health…so now I have a battery issue. Buyer beware","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716249600000}
{"reviewTitle":"message of camera defective battery is not maintaining a charge","reviewDescription":"After receiving iPhone 12.Packaging was decent, charged the item to 100% notice that battery was not lasting for a whole day needed to charge it twice in a day while not even using it.As well as receiving a defective camera message from iPhone diagnostics","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719619200000}
{"reviewTitle":"La cámara fue reparada con una pieza no original.","reviewDescription":"La cámara original fue reemplazada por una pieza no original y ahora recibimos una alerta que dice exactamente eso: que la cámara original fue reemplazada por una pieza no original.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"Disappointed","reviewDescription":"Was a refurbished phone. After setting up I realized the pull down control panel does not pull down. I contacted seller and they have approved a return.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Speaker Sensor Broke","reviewDescription":"Speaker sensor broke after 1.5 years and cost to repair is $270.  Apparently a known issue with iPhone 12.  Otherwise has worked well.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"\"good\"  condition here is more like \" fair \" condition","reviewDescription":"there is dents and scratch around the frame, as well as the screen, back glasses is fine but yeah it works, 83 % battery health","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"Not in working condition","reviewDescription":"Purchased an \"Excellent Renewed\" and it came and looked good on the outside. Tried to set up and it started fine, back plate started to get really warm and it would power cycle continually every 2-5 minutes. Assuming the glass was replaced and it was just checked to see if it would power on but not checked for any length of time. Had to return and now have to wait for refund.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Si funciona pero no le dura la batería","reviewDescription":"El teléfono se ve bien y en buenas condiciones, pero la batería no le duró casi nada aunque esté apagado, me decepcionó mucho","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724716800000}
{"reviewTitle":"Muy maltratado","reviewDescription":"Se supone que tiene una excelente condición y está muy rayado, muy maltratado, la batería está al 91% pero físicamente está muy maltratado.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1724457600000}
{"reviewTitle":"Front Camera stuck in un-focused mode","reviewDescription":"Everything seemed to work great EXCEPT for the back camera, which was stuck in a fixed focus mode. So, unless the object is right in front of the camera, the picture will come out blurry. I researched fixes and it sounds like a physical deformity of the phone.It’s unfortunate, but the camera is very important for my usage, so I will be returning this.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"Not a good experience","reviewDescription":"Phone hangs too much and I believe this is not a high quality refurbished product","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Almost perfect","reviewDescription":"I have had this phone for nearly 3 months and think I should return it asap.  On the surface it is as good as new. As reported there was a minor surface scar.  I have used the tech support site to remedy issues.  But I don’t speak the language of tech.  Three functional problems persist: intermittently the screen freezes, including the  pass code screen; “call failed”, the only remedy is shutting the phone down and restart it. (phone set on both data and wifi); the touch screen is frequently insensitive to touch, more often at the upper right periphery of the screen (Are my fingers too cold?). So, these intermittent problems are the reasons I would not purchase again.  Can I expect an Apple to service this phone?  UPDATE: returned the phone within warranty period.  Refund was completed asap!  Happy!","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1706745600000}
{"reviewTitle":"GOOD PURCHASE IF YOUR NEEDING SOMETHING IMMEDIATELY!","reviewDescription":"When the phone came, it was in good condition. I’ve had my phone for 2 days, and I’m already noticing glitching while maneuvering around the screen. Also, my battery percentage is shot. Phone went from 40 to 11 within a 20 minute period. Thank goodness this is for temporary use. If not excellent condition, DONT GET THIS PHONE.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Defective phone","reviewDescription":"Phone camera is broken in the inside and charger isn’t functioning properly","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Disappointed","reviewDescription":"The iphone is pealing off and had issuies reading the sim card.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Was okay til I tried to take a picture","reviewDescription":"The camera is broken in this phone. Does not focus. Very blurry.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722902400000}
{"reviewTitle":"Screen doesn't respond","reviewDescription":"It came and half the screen didn't work, it wouldn't respond to anything, this slowly started getting worse and over the course of 2 days it completely stopped responding. Very disappointed. I hope to switch it out for one that works so I can leave 5 stars because I wad really looking forward to this new phone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Pay Attention","reviewDescription":"Everything was great at first. Then 3 weeks after having this phone, I started to notice it would go mute on its on like when I’m watching a video, or listening to music. It also freezes up, and starts glitching! Please pay attention to the comments before Purchasing anything, especially as expensive as this phone was.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719100800000}
{"reviewTitle":"Disappointed","reviewDescription":"I was super excited about this new phone. My friends convinced me to convert from Android to iPhone. It arrived quickly & looked great. I am not good with tech items, so I took it to my AT&T store for help. They were happy to help, turned it on only to discover it's locked to T-mobile, which means I can't use it as an At&T costumer. In the description this phone clearly states it's an AT&T phone, such a terrible lie. Only thing I am happy about, is that it's returnable.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715558400000}
{"reviewTitle":"Review iPhone 12","reviewDescription":"Everything started out nice the phone appears to be in good condition and work fine it only will work for one week. The phone powered off as if it was dead I charged the phone it came on as if it was going to start up and went right back off","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1718323200000}
{"reviewTitle":"Feels like gambling","reviewDescription":"Unlike the most of the reviewers here, the phone I got showed lots of evidence of its previous owner and no evidence of being refurbished. The phone arrived with scratches deep into the metal and what looked like a circular image burned into the upper half of the screen, centered, about the size of a quarter.  The screen had a greenish tint, and I couldn't get passed the language selection part of setup.  Anyway, it turned out it had some version of iOS on it that was neither factory nor up to date.  You'd think any of these issues would have been noticed by a human being before me, right?  But anyway, I did manage to get the phone updated with itunes and a computer, and it managed to boot up.  The camera is blurry and bright, the backlight is only randomly functional, and it's all so very green looking.  As of writing this, I have ordered the replacement, so please take this with the grain of salt that I may end up being in the group of satisfied customers in a week or so.  However, just be aware that the first phone you get may be a brick.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Perfect condition","reviewDescription":"The battery is good the phone works as expected the phone itself has no scratches I bought the cheapest option and it’s like new ! Love it!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723852800000}
{"reviewTitle":"Very satisfied so far","reviewDescription":"Purchased from Chubbietech in NJ.  Phone described as \"excellent.\"  No visible flaws.  Can be set up quickly, if you know all your passwords (I didn't and was running around looking for them).  Apple care and AT&T were worse than useless in helping me set up the phone.  Even provided wrong information.  When I gave up on receiving assistance, I was able to set it up by myself (though I am totally not knowledgeable about these things).  Phone battery charges to 100%.  This is my first iPhone.  Up to now I have used a Jitterbug phone and will keep that phone for the services it provides.  I obtained the iPhone in order to have fall protection with an Apple Watch (which I also purchased).","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Phone in excellent condition. Battery health 95%.","reviewDescription":"Phone in excellent condition. Battery health 95%. I like that iPhone 12 screen does not have any curved edge so my glass screen protector goes on flawlessly and does start separating at the edge over time. Great camera over prior models. Just a note that home button is replaced by a virtual whit bar at bottom. Easy transition to get used to. Also the phone power turn off is a little different since home button is gone and takes a little to remember the buttons to press to activate.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1721347200000}
{"reviewTitle":"Works perfectly","reviewDescription":"I was scared of getting this but everything was brand new like. I got it in excellent condition. The speaker and camera works great also. All I had to do was take my sim out of my old phone and put it in the new phone! Super easy definitely recommend","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722643200000}
{"reviewTitle":"Iphone 12 unlocked","reviewDescription":"My sister's Iphone 8 plus stopped working,  so I bought this as a replacement.  I was leary about buying \"renewed,\" but it works great.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724112000000}
{"reviewTitle":"Great Phone\/Great Seller","reviewDescription":"Easy to move data from my old phone to this new I Phone 12.  Excellent condition for a renewed phone. No scratches or defects!  I could charge to 100%.  Very pleased with this purchase.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"No complaints","reviewDescription":"Been having since April 2024. Make sure you are home when this item comes or you’ll be waiting the next day or racing to the office to pick it up yourself. It was packaged well. No scratches. A little nitch on the sides where the black is, but nothing I bc would go crazy behind. Screen was fine and so is the speaker. My battery Percent was at 88 no big deal to me if I have to replace it later I will.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1720915200000}
{"reviewTitle":"I Phone 12 refurbished and unlocked","reviewDescription":"Was hesitant about purchasing an unlocked refurbished phone online. Pleasantly surprised! Came with a screen saver already on, was very easy to activate with my provider.You would never know it was refurbished. Would definitely recommend 👍🏼","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Love it!!","reviewDescription":"I just received the phone and it’s beautiful!! Not a scratch or anything. It works wonderfully and my boyfriend is beyond happy! Thank you!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Phone was in Excellent Condition","reviewDescription":"I purchased a good conditioned phone but received a like new phone. It has zero scratches or any signs of use. I'm happy.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723680000000}
{"reviewTitle":"Disappointing Battery Life","reviewDescription":"I was happy with the overall condition of the phone.  It charged to 100% and the body of the phone was in great condition.  However, the battery life is extremely short, approximately 12 hours.  I am used to my iphone XR battery only needing to be charged once a day so was expecting something similar with this phone.  If you don't need a phone to keep a charge more than 12 hours this would be a great buy.  Not sure I will keep this particular phone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714608000000}
{"reviewTitle":"Pretty Good!","reviewDescription":"Everything about the phone is straight, there’s no issue but unfortunately the phone does get hot, really fast. The phone battery life was also 80% which is fine i guess. I can always buy another battery. No scratches on the phone so that’s a plus!","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1719792000000}
{"reviewTitle":"Bad ear speaker","reviewDescription":"Everything about it works so well unfortunately after taking my first call without a Bluetooth device connected I realize the front ear speaker is completely unresponsive. No sound comes out at all. Pretty disappointing. It also was really dirty in that speaker.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717891200000}
{"reviewTitle":"Exaggerated condition","reviewDescription":"Renewed “Excellent” is supposed to be free of defects at an arm’s length. I can see scratches on the screen from further than that.  Also, the battery health for “Excellent” should be better than 86%. I was expecting in the 90s.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Microphone does not work unless you put it on speaker.","reviewDescription":"The microphone does not work unless you put it on speaker.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Make sure your battery is 100%.","reviewDescription":"I like this phone a lot but the battery has never been able to charge over 85%. This is for the Excellent condition. Would have returned it but couldn’t wait for the turn around time.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718150400000}
{"reviewTitle":"Delivery","reviewDescription":"Condition of the phone was good, performance= normal, size =a bit smaller than what i had. Value could be a bit less its a 12 model . My only gripe is that it took almost 2 weeks to get delivered,  i have prime shipping withing 2 days, so i was very upset that i have prime shipping but had to wait 2 weeks to get my phone. It was a delay after delay. Delievery was terrible","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714435200000}
{"reviewTitle":"No era lo que esperaba","reviewDescription":"El dispositivo llegó repintado de los laterales como se puede ver en las fotos , y los pequeños golpes que trae igual pintado de muy mala manera","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1718582400000}
{"reviewTitle":"Good phone however headphone does not work","reviewDescription":"Everything on the phone was fine and looked brand new. I've bought refurbished Iphones from Amazon before and have been terrific. However the earpiece to hear someone talk on the phone does not work on this phone. This was bought as a gift for my dad overseas and he told me he needs use the speakerphone in order to use it.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1714521600000}
{"reviewTitle":"Very nice product.  Low battery.","reviewDescription":"Would have given a 5 if the battery hadn't been below the 80% guaranteed in listing.  The phone's physical appearance is as new.  Beautiful, like new .  Will get the battery replaced and I'll have a new phone.  Tried contacting seller but no response at this time.  Will update review if battery replacement assistance is given.","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1715472000000}
{"reviewTitle":"Love the phone EXCEPT: Speakers were blown out","reviewDescription":"Sadly, chalk up my first experience with buying a used iPhone.  Loved the phone when it arrived.  Condition was good, screen clear.  I was upgrading from an iPhone 8 so you can imagine the delight as I discovered all the new features, the ease of use, and I really loved the mini size.  On the first phone call I made I was surprised at the distorted, gravely sound.  I struggled to hear the caller.  Maximum volume did not improve it.  I tried other calls with different people, same result.  I then tried playing music. The distorted sound was familiar, the sound you get when your old car speakers have been played too loud too long.  I attempted troubleshooting with apple service.  They analyzed the phone (however they do that online) and said it was fine. So, I requested a return.  The Lesson? Don’t break your heart by buying used, and while you’re at it, just get the latest model.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1701907200000}
{"reviewTitle":"Defective","reviewDescription":"Power button was broken. Had to send back.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Disappointed in \"Excellent Condition\"","reviewDescription":"The description listed this I Phone would be in excellent condition. It is not in excellent condition. There is a 1\/4 scratch\/ indentation on the screen and bezel in the upper right corner of this phone. I would rate this phone as average. The battery health was barely above the threshold of 80%. How is that excellent condition? The phone did seem to work as normal. The speaker quality was not 100% clear either. Returning this I Phone. The search continues.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713657600000}
{"reviewTitle":"Would t recommend","reviewDescription":"My phone will only stay charge at most 3-4 hours , I feel like I wasted my $300 and should have just bought a new phone. Would not recommend purchasing refurbish phone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720396800000}
{"reviewTitle":"Only lasted 1 yr","reviewDescription":"I bought four of these iPhones from the seller and after just one year two of them no longer hold a charge.This is the last time I buy a refurbished phone from someone. Wasn’t worth it at all for how much money it cost.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719273600000}
{"reviewTitle":"Glitches","reviewDescription":"Had to update the software at the Apple Store and the battery life is not great. Next update I will be getting my iPhone directly from Apple.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"Low quality refurbished","reviewDescription":"It arrived two weeks ago, everything in good condition, battery at 82% but from one moment to another the screen stopped working and right now I am in another country at this time for vacations and I had to repair it because I have all my information there ...they told me that the screen was not the best, they used the lowest quality one and the pure repair cost me 150 dollars.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1714003200000}
{"reviewTitle":"Foreign camera","reviewDescription":"Be careful ordering this phone. Mine was supposed to be “like new” but as soon as I turned my phone on it said there wasn’t a genuine camera bc the camera had been replaced. I can’t even use my back camera bc it looks distorted.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717113600000}
{"reviewTitle":"Arrived fast but Face ID isn't working","reviewDescription":"The phone arrived quickly. It's an iPhone 12 Renewed. It has small scratches on the bezel but that's ok. the problem is that the Face ID isn't working. I am contacting the seller to see how this can be resolved, will update this review.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"The phone won’t charge","reviewDescription":"Im trying to charge the phone but it won’t charge. Not sure what wrong with it. It’s maybe just the charger or something else","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722124800000}
{"reviewTitle":"Good condition but","reviewDescription":"The item was recieved in good condition, however the screen went out and randomly stops working\/randomly taps things after 5 months.  Honestly, this has been my experiance with alot of used tech, just don't go for it, buy something cheap and new","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"The phone call quality was bad","reviewDescription":"The phone itself was not bad and it worked. Getting connected to my carrier was super easy. The only reason why I’m returning was the sound quality was so bad during the phone calls that I could not hear the other person.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"The battery is terrible.","reviewDescription":"The phone works fine. But the battery lasts too short (half day) and I have to plug in the charger when I get to the office and home. It dies quickly when the power percentage is less than 20%. It dies immediately when 2%. My last phone can run up to 10% mins when 2% battery left.  Note the battery health shows 100%.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719705600000}
{"reviewTitle":"Water Damaged","reviewDescription":"Phone worked for 7 months then started having battery issues took it to a repair shop and they showed us that it had lots of very old water damage internal. The phone has never touched water in our possession.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1722384000000}
{"reviewTitle":"Short battery life","reviewDescription":"The phone arrived quickly and looked great. 4 months later it is getting warm to the touch even when not in use… short battery life and a constantly dimming screen.. i believe the battery is going bad… i thought i had found a great substitute from buying new but i guess not… and unfortunately it looks like i cannot return it.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719878400000}
{"reviewTitle":"Was in Chinese and pictures where taken","reviewDescription":"The phone was accessed and was put in Chinese, also didn’t have a charger box, just a cable with a cnote end so it was a week before I was able to find a compatible charger box to use the phone","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1723507200000}
{"reviewTitle":"Speaker stopped working and Screen stops working","reviewDescription":"Had iphone 12 for 5 months. Seems like screen was replaced with an aftermarket one. Ear speaker stopped working and phone randomly stops responding to input. Im outside of 90 day warranty I have a brick.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1724025600000}
{"reviewTitle":"Excellent Condition? Not even Acceptable in my opinion......","reviewDescription":"Where to Begin? I ordered an \"Excellent\" Condition iPhone 12 128gb in blue to replace a lost phone at work. Needed something to use, so I wanted something inexpensive, and good. I landed on an iPhone 12 due to the good reviews left on it. However, my first experience with this type of \"Renewed\/Refurbished\" service, was less than adequate.Cosmetics: Scratches. Advertises can't see nicks or scratches past 12 inches, but I can see it in a dark room (where it's hard to see scratches to begin with) from over 2 feet away! The screen was full on scratched up underneath a screen protector (which was provided), the sides were full of nicks, and somehow, there's a big white scratch on the back glass of the phone (which is notorious for not being able to be scratched.Outside Cleanliness: The charge port came with dust in it, not letting me charge it. Ontop of that, the speakers sound muffled, leading me to believe there's dust INSIDE the phone. It also came wrapped with multiple fingerprints all over the screen.Battery: Not gonna lie, I got nothing bad on the battery. It came with 87% which is decent and advertised.Overall, yes, I did submit a request for it to be replaced. Although it is fully functional, the speakers and charge port are still dirty, and I heard my mic is also muffled. The scratches and Nicks are something to be tolerable with seeing as how it was pre-owned.I will Update when I get my Replacement","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1680480000000}
{"reviewTitle":"Product review","reviewDescription":"The phone was not fully charged and the back near the camera was slightly peeled off and there was no IPhone case.Although refurbished, it would be nice if the description should be clear on the condition of the phone.Trying to charge it now and hope that there is no battery issues.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"Disappointed","reviewDescription":"We purchased a phone for my daughter which worked fine for the first few months. Then, we found out that my daughter had cracked it on accident and we brought it to a shop to get it fixed. My daughter had complained of the battery but our time frame had expired so we could not reach out to this vendor. We mentioned this issue as well to the shop we brought the phone to fix the crack. They let us know that the battery the phone came with was defective and that there were glass pieces left from previous repairs. This has left a bad experience for us as we basically had to invest what we paid for the phone to get it repairs. Ended spending more and the phone did not last a year. Had the phone not cracked and we brought it in for that we would have never known. I do not believe I will be repurchasing from this vendor again.","isVerified":true,"ratingScore":2,"reviewReaction":"3 people found this helpful","country":"United States","date":1710115200000}
{"reviewTitle":"Excellent an amazing cute phone but..,","reviewDescription":"I really loved this phone when I opened it, everyone else’s “brand new” phone came in an Amazon renewed box and mine just came in a rando weird box that’s blue and grey :\/ I loved the phone but when I set it up and went to the battery health it was at 81%. It’s not like I can get a new phone but it said it was inspected by professionals and if it was it wouldn’t be at 81% battery health I’ve only had it for a week and it’s already at 80%. I really hate the fact that the battery try percentage was that and when it goes to 80% guess what YOU HAVE TO CHANGE IT!! and I can’t do that","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1705536000000}
{"reviewTitle":"Not impressed","reviewDescription":"I purchased recently. I know it is a refurbished phone but I am not impressed with the condition of the phone especially when I selected excellent condition. Additionally, after setting up the phone it seems like the apps are unable to download from the app store.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1714348800000}
{"reviewTitle":"Don't order","reviewDescription":"DO NOT BUY FROM THIS COMPANY, GO ELSEWHEREI barely use this phone as it's my work phone, all in all i probably use it 34-36 hours a week. The battery started to die quickly on me, I contact apple support and they let me know the batter needs service, I was shy a 2 weeks out of my return window and this company denied my request.I don't usually write reviews but if your looking for a decent phone to use, don't order from here as they sold me a phone with a messed up battery, I barely use this phone as is and it needs service.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1707177600000}
{"reviewTitle":"Good","reviewDescription":"This product is good the only thing is that It came with alot of screen cracks and tye phone had 2 dents","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1718409600000}
{"reviewTitle":"Good condition, but bad battery","reviewDescription":"Phone in good condition besides the battery. The screen has no scratches on it, but the battery health is at 81%.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Shannainigans","reviewDescription":"Did not like words used to describe the in accuracy of wat arrived for the commerce tendered I also did not like the words used in conversations  involved with individual retaining the retention of thus commerce arrival process was elongated","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Defected Item","reviewDescription":"Two corners of the iPhone were damaged. How do they advertise such items as in “the excellent condition?”","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1719532800000}
{"reviewTitle":"..","reviewDescription":"I don’t know what it is with this phone a sensitivity issue with the screen or a glitch? It dials people randomly while in a pocket or purse while not actually  using it. Very annoying . Battery sucks too.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"okay but with some imperfections","reviewDescription":"bought this phone for my younger brother who’s about to go to the 7th grade. i was a little hesitant to get it bc of some other reviews but it came mostly fine.it just had two dents in the aluminum sides (disappointing of course but they were small enough to not be dealbreakers) and a scuffed backside. all of this could be covered with a case so we just kept it for now. battery health was at 85% which isn’t too great but above the 80% promised. everything else works fine. all in all you might not be getting a phone that looks brand new but its definitely worth it if you’re just looking for something temporary. also for $390 it’s a steal—Apple sells them for like $600.EDIT 7\/9: so we gave the phone to my brother on his birthday and he hasn’t even used it for six days before one side of the phone screen began peeling off. like PEELING OFF the corners (almost like a screen protector except it’s the actual screen?? changed from 4 stars to 2.","isVerified":true,"ratingScore":2,"reviewReaction":"4 people found this helpful","country":"United States","date":1687564800000}
{"reviewTitle":"no satisfecho","reviewDescription":"el celular traia varios golpes, en las esquinas, no entiendo por que te dan un producto asi, la bateria tan solo el 85%, no estoy muy feliz por eso, no era solo un rayon, conte como 6 rayones","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715299200000}
{"reviewTitle":"Totalmente insatisfecho.","reviewDescription":"Pedí un IPhone 12 con el vendedor ELECTRONIC DEALS en condición “excelente” el cual llegó con un 83% de condición de batería, luego de usarlo unos días su condición a bajado 1% cada 4 días, actualmente se encuentra en 79%. No vivo en los Estados Unidos así que ni siquiera vale la pena devolverlo porque el envío corre por mi cuenta según su política de devolución y es caro. La estética está muy bien a excepción de unos pequeños arañazos sin embargo estoy totalmente insatisfecho.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719705600000}
{"reviewTitle":"Not good","reviewDescription":"Not good nothing like what i expected! Phone has a bunch of scratches around the border and definitely not reading my sim. I don’t know if they put the wrong sim holder but every time I insert my chip it says no sim! Not recommended! First time ordering a phone from here an I’m not satisfied","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Worked great for 1 month...","reviewDescription":"I really liked this phone, even though it was just a small upgrade going from Iphone 11 to 12. It worked fine on my Tmobile account for about one month. The \"5G\" was never fast, and while at work in my office I would have almost no internet connection through cellular data, even though I am on the unlimited max plan. Then recently, the phone stopped recognizing my sim card. I reset the phone, cleaned my sim card, then even physically went to a TMOBILE store and had them make and activate a brand new sim card for me. This worked for about one hour before the phone stopped reading the sim again and only allowed me to make SOS calls.Needless to say, during this entire ordeal where I called T-mobile multiple times thinking it was a sim card error that lasted 2 days (before I gave up hope and got another phone), I missed several important texts and calls. I then asked for a replacement from Amazon, since that's who I bought it from, but it turns out they are not the company the refurbishes and sells these phones as they claim on the listing, its actually some third party \"tek\" company. I will not get a replacement as I wanted and instead am still waiting on my refund. So I hope this helps the next person, DO NOT buy used Iphones from Amazon","isVerified":true,"ratingScore":1,"reviewReaction":"31 people found this helpful","country":"United States","date":1677801600000}
{"reviewTitle":"Quality not as described.","reviewDescription":"Bought this phone advertised as excellent condition only to receive a phone with 82% battery capacity, scratches to the camera, sides of phone, and charging port. Did not receive the charging cable or wall piece and when I requested to just be refunded the price difference between a phone in excellent condition vs one in good condition I was offered $25 at best. I find it ridiculous that there is such a large price gap between the two phone conditions when the seller prices the items, but yet the seller doesn’t believe they are actually worth that when offering a refund for the difference. Poor customer service and a poor quality product. If you’re going to price the phone qualities so far apart at least offer the difference when you give someone a low quality product. I should’ve just requested a full refund instead of wasting my time thinking the company would just make it right by compensating for the difference. I won’t be buying from them because of principle. If they want to sell their merchandise for different prices based upon quality, they should also hold themselves to that standard when offering to make things right, instead of insulting their customers.","isVerified":true,"ratingScore":1,"reviewReaction":"16 people found this helpful","country":"United States","date":1700438400000}
{"reviewTitle":"This phone came disgusting and covered in grime and filth","reviewDescription":"The buttons and the phone camera came covered in this goey black substance. It is inside of the buttons and under them, and it affects the way that they press down. I can’t get this stuff out of the cracks in between the buttons, and I am definitely returning this product because I am pretty sure that this will affect the phone in the future. The speakers also have dirt in them. I’m not sure that the sellers even cleaned this phone before they sent it, and the quality control is terrible. I am pretty sure this phone was dropped in a can of glue by the previous owner, and the fact that they accepted this and resold it still covered in disgusting grime shows that these people have NO QUALITY CONTROL whatsoever. I’ve bought products from Amazon renewed before and they always came clean and completely functional, but ever since then they have dropped in quality greatly. The AirPod pros that I bought a few months ago from Amazon renewed came broken in the box and they were linked to somebody else’s account, and this phone is so visually disgusting I don’t even know how it passed quality control. It’s very possible that amazon renewed just takes returned products, wipes them with a tissue and then resells them for a markup. I will not buy anything from them ever again.","isVerified":true,"ratingScore":1,"reviewReaction":"17 people found this helpful","country":"United States","date":1684108800000}
{"reviewTitle":"Batteries do NOT last.","reviewDescription":"Bought two phones back in May— one for my husband, and one for myself. They both worked well initially, but were VERY scratched up. Regardless, we didn’t really care as they worked well. It is now the end of August, and the batteries on both phones barely last a few hours. Very disappointing.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1724544000000}
{"reviewTitle":"BUYER BEWARE - Not compatible with advertised carriers.","reviewDescription":"Update. The sellers are refusing to fix the issue of the phone not being compatible with US Cellular. It is unlocked, but the model number of the phone they sent does not have an antenna that is compatible with my carrier’s network. The claims that the phone will work with any network is FALSE, and the seller will not resolve.Overall the phone is in good shape. When I tried to get a SIM card to connect it to our family cell plan, we discovered that it was not compatible, even though the description included our cell carrier in the list of compatible carriers. Hopefully the sellers and Amazon will make it right.","isVerified":true,"ratingScore":1,"reviewReaction":"2 people found this helpful","country":"United States","date":1716681600000}
{"reviewTitle":"SPEAKER SOUND DOES NOT WORK","reviewDescription":"Off experience ordered this phone and looked great after I turned service on the phone call on the speaker by the ear is not working. Just the one on the bottom really terrible unnecessary and frustrating. I hope you seller contact me to resolve this issue as soon as possible.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"Do not buy!  Poor quality.  Difficult returns!","reviewDescription":"I purchased two of these phones, and spent extra for the “Premium Refurbished.”  Very disappointed as both phones had scratches and visual blemishes.  These should have been sold as the standard renewed items.  Also, the return process requires UPS to pick up the item while someone is home.  No option to simply return to a UPS location!  Customer service unable to offer a different return process.  So while I am on vacation UPS will be at my house 3 times to attempt pickup but will be unable to do so.  What a waste of time and resources!","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Only Lasted 3 months","reviewDescription":"We received the phone and it had issues in the beginning but my daughter did not want to take the time to return it and be without a phone for a minor inconvenience. After 3 months the screen completely stopped working. We took it to Apple and they said the parts it was refurbished with were not Apple and they could not fix it. Cheap parts were used the screen completely stopped working.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720569600000}
{"reviewTitle":"decent condition - Broken Guarantee","reviewDescription":"Phone was delivered in the wrong color, I ordered the blue... I'm fine with the dent and knicks.. but this phone \"was guaranteed to have a minimum battery capacity of 80%\" and it does not have that.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Crappy deal on a crappy phone","reviewDescription":"I bought this thinking it would be a similar refurbished product to others I’ve had before but it was in bad condition. They promised 80 percent battery life, but the phone had a warning right when I set it up that the battery was critically compromised and was below 80% health. The phone came in a dirty bag and wasn’t even cleaned. Scuffs on the frame, scratches on the screen. Nothing that would prevent you from using it but really disappointing to take a product out of the box and see it looking like it’s not been cleaned or “renewed” in any way. I will be returning it and I suggest no one else buy these.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1716595200000}
{"reviewTitle":"Bad battery life","reviewDescription":"It started with 96% within a week it went down to 86%. It doesn’t last more that 4-5 hours of batter life.  Phone works but it’s not Apple battery it was replace with imitation battery.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723420800000}
{"reviewTitle":"Lots of issues","reviewDescription":"Quickly after buying the phone, lots of issues started to pop up. The location wouldn’t work and it would lose reception at certain times. Then, just after the “return window”, the battery started dying with 20% left in the phone. Then it started dying with 70% left in the phone, and now it is completely not working anymore. Feel like I have been scammed.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721174400000}
{"reviewTitle":"POS","reviewDescription":"The description said “refurbished to excellent”. The battery doesn’t hold a charge, the phone doesn’t work because it overheats!!!! The reason for this purchase is because my phone broke. Now I’m being told I have to send it back for anything to be done. Therefore, I’m phoneless until I receive the new phone!? Never purchasing from this seller again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1721001600000}
{"reviewTitle":"Even after battery replacement - product still doesn’t hold charge\/gets very hot","reviewDescription":"Unfortunately even after replacing the battery, this phone still does not hold a charge and gets very hot when charging. I’m really bummed I spent money on this product and the repairs :(!If the seller can do anything to correct this, please don’t hesitate to reach out - I’ll correct my review if this gets resolved.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720224000000}
{"reviewTitle":"Scam company. Do not use.","reviewDescription":"I bought this iPhone in April 2024. Suddenly, at beginning of July bright bands of light appeared on the face of the phone. Apple did a diagnostic and found that the battery was bad. Do not deal with this 3rd party company. It’s been an endless hassle to resolve this and get a decent iPhone through my carrier.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720137600000}
{"reviewTitle":"A dreadful purchase","reviewDescription":"Definitely not what I expected for the price, I paid a little more for an iphone in better condition and it was not.The iphone comes with so many scratches and bumps on its 4 sides, the cameras equally scratched, the battery at 86%.It was a very bad purchase and the worst thing is that I am outside the USA and I can not return it, I would ask for the money back if possible and I would not buy it again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Sim not working","reviewDescription":"I got a 100% battery really love it, i thought it gonna be so good BUT the battery dies very quickly plus it’s really hot even i didnt do nothing with it? AND its not detecting my SIM, ive tried it on the other phone and it worked i mean the SIM. Really really disappointed!!! Seller: MCEsales","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722297600000}
{"reviewTitle":"iPhone 12 256GB Model (Black)","reviewDescription":"The phone was in good physical condition but don't let that fool you. After spending multiple hours getting the phone set up off an iCloud save, the very first call I made immediately made me realize I was sent a complete dud. The microphone did not work despite various attempts at troubleshooting. BEWARE: Many early iPhone 12 and 12 Pro models had a faulty chip that would cause the microphone to not work. Shame on this seller for claiming that they tested and refurbished their products when the very basic function of making a PHONE CALL on a CELLULAR PHONE does not even work.Only buy from this seller if you're willing to go through a multi-week headache of trying to obtain a functioning phone. You will not get it from them, if my experience means anything.","isVerified":true,"ratingScore":1,"reviewReaction":"7 people found this helpful","country":"United States","date":1711670400000}
{"reviewTitle":"Highly disappointed","reviewDescription":"The phone arrived and you couldnt talk on it without it being on speaker. still my 11 year old wanted to keep it because it was her first phone now here we are 5 months later and the screen goes green. Im highly disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1718582400000}
{"reviewTitle":"You get what you pay for.","reviewDescription":"I will not spend over $1000 on a damn phone. This is an alternative I can live with but it still seems ridiculous.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Great looking phone but stopped working","reviewDescription":"Got this phone and looks great however after a month it stopped working. You can no longer hear calls unless it on speaker.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Not what I expected.","reviewDescription":"I purchased the phone \"renewed\" and as the listing stated in \"excellent\" condition. The phone I received is in anything but renewed\/excellent condition. Take a look at the attached pictures. The phone body is chipped all over the place with a nice dent in the top right corner. The front glass was tacky (some kind of residue build up) and covered in scratches. Either the previous owner didn't use a screen protector or the glass was reconditioned with sandpaper. I charged the phone and went immediately to the battery health indicator . Eighty six percent is not what I'd call \"excellent\"condition. I'm very disappointed in the quality of the phone I received. Against my better judgement, I'm keeping the phone thanks to the ninety day warranty. I was able to clean the phone up and it doesn't look half bad now in it's new case and glass screen protector (last pic). The phone is fully functional and seems to perform well enough.  However, if I purchase another reconditioned iPhone, it will likely be from Black Market or Swappa. Stay away from Amazon \"renewed\".","isVerified":true,"ratingScore":2,"reviewReaction":"5 people found this helpful","country":"United States","date":1692316800000}
{"reviewTitle":"Not the best","reviewDescription":"I’ve bought a couple refurbished iPhones but the light sensor was really dirty on this one and the speaker jokes at the bottom were filthy. I’m still troubleshooting the auto brightness feature but the dirty sensor was part of the problem.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1718928000000}
{"reviewTitle":"Screen issues","reviewDescription":"Had to replace the screen because it went out within the first week.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720828800000}
{"reviewTitle":"Doesn't last","reviewDescription":"I should've returned it right away..It lasted real good for like 2months ! Not a good buy","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Bad Experience","reviewDescription":"I bought this phone for my teenage son came on time but the battery life is no good the power button stopped working after two days and had some scratches on the side not what I expected.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1717718400000}
{"reviewTitle":"Came with speaker blown out and scratches on the screen","reviewDescription":"I bought the phone in “good” condition, but the screen came with a marking at the bottom of the screen and a micro crack, and deep scratches all over the screen. Somehow the exterior looks good but not everything else, plus thank goodness I made it phone call with it recently and found that no matter what the volume for the calls was not being raised, sounds like a whisper. I bought my iPhone 11 refurbished and it was a dream, I think I just got a lemon this one time.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1711065600000}
{"reviewTitle":"Ok but has issues now","reviewDescription":"I purchased the refurbished phone a month ago. I noticed the 2 error messages under settings that there’s an unknown part for the battery and one for the camera. When clicking on more information this is due to being repaired with non-Apple parts or the repair was done incorrectly. I understand it’s a refurbished phone and it was working fine so I didn’t do anything further. Now with a new software update out, I have been unable to update my phone. I’ve tried several times (more than 5) and it still keeps saying unable to verify update. I’m not sure if the unknown parts error in the problem but now it’s frustrating that I have this phone and cannot update it.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1705795200000}
{"reviewTitle":"product not as advertised","reviewDescription":"Bought an iPhone 12 supposed to be fully unlocked and (renewed) the phone is locked and am getting the run around. Bought as a gift was not activated immediately the return window has expired and no one wants to make this right Amazon tells me to contact BuySPRY and BuySPRY tells me to contact Amazon. The bottom line if the phone is advertised as being fully unlocked it should not matter if the phone is activated the day you get it or a year later you should be able to activate it and use the phone . This is just wrong and falls under the catagory of false representation.","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1716940800000}
{"reviewTitle":"Poor health battery","reviewDescription":"AVOID THIS SELLER AT ALL COSTS PLEASE:1) The phone arrived at 86% percent battery health! I thought Amazon refurbished the phone with a new battery but it was its old battery. Not worth the price if it is original battery!2) After you return the phone, the seller does not issue refund, you have to beg them for processing refund and they don't! Eventually you have to file a claim with Amazon, I still haven't got my refund! It sucks","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719446400000}
{"reviewTitle":"Fingerprint ID recognition is Gone!!!! Research your new phone!","reviewDescription":"I cannot express in a sufficient number of words how disappointed I was with the iPhone 12!!!!!!!#1.) when you are required by everybody to change your password every year, or every 6 months, or in the event of a suspected hack you have to either remember all those passwords or keep them in a paper log book or store them in “Notes” along with those secondary security codes they require. I’ve had four fingers logged…2 primary and 2 backup! I never had to remember them!That is why I had a near coronary when Apple said my Apple 8 Plus was no longer supported and I needed to upgrade!And, unfortunately, I trusted Apple!Upgrade my —-, this 12 is a downgrade!!!I was shocked when discovered Apple had eliminated fingerprint recognition!!!!#.2.) When compared to a Samsung,  at about the same price with fingerprint recognition and FAR superior photo quality(!!!), It was a no-brainer! This 12 is going back ASAP!!!!","isVerified":true,"ratingScore":1,"reviewReaction":"4 people found this helpful","country":"United States","date":1705881600000}
{"reviewTitle":"Locked phone.","reviewDescription":"Phone is locked internationally. Someone wanted a phone and I thought this would be the best option for a used phone. The person lives overseas. They receive the phone and it turns out its locked to only be used within the US, for almost no reason. Every phone I have bought in the past from different sellers, I was able to send and it would work fine., but this one does not work outside of US.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718150400000}
{"reviewTitle":"ALL PARTS FAILING!!!","reviewDescription":"DO NOT BUY THESE PHONES!!!!So, when i first recieved the phone, the first alerts i got were that there wasnt an authentic screen\/battery on the phone, I looked it up and looked into it and found articles that say it will do that if its replaced sometimes so i just kept that in the back of my mind and continued to use it. Up until 4 days ago when my wifi\/bluetooth would absolutely NOT work. I wasnt even able to turn either of them on. So i went to the apple store yesterday, to be told that my battery and my screen are failing, and the part that control wifi\/bluetooth had completely stopped working.I would give this phone 0 stars if i could. please save yourself the hassle and buy elsewhere. extremely dissapointed.","isVerified":true,"ratingScore":1,"reviewReaction":"5 people found this helpful","country":"United States","date":1710374400000}
{"reviewTitle":"Not refurbished","reviewDescription":"This product is not as described . Product is damage , used not refurbished to great conditions . Will ask for my money back . Does not look like the pictures .Camera does not work . How does it say to pay for excellent phone and I get a potato.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720137600000}
{"reviewTitle":"Constant Problems","reviewDescription":"Honestly it worked fine until about three weeks in and then the water damage revealed itself. I already have bad luck with phones so I will never purchase an Amazon phone again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1722902400000}
{"reviewTitle":"SCAM. SCAM. SCAM","reviewDescription":"this company is a scam. The phone i recieved was defective, and although i asked for a replacement phone i was told i would recieve a refund. i recieved 1\/2 my purchase price back. THEY KEPT THE REST FOR A RESTOCKING FEE. fOR SOMETHING THAT WAS DEFECTIVE. SCAM. SCAM. SCAM","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1720742400000}
{"reviewTitle":"I was very disappointed to fine out the charger that in the phone can’t fit the phone","reviewDescription":"I’m now going to have to go buy a phone 12 charger because this one that send in the box can’t fits the phone it’s a gift for one off my niece","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1724457600000}
{"reviewTitle":"iPhone Front Speaker doesn’t work!?","reviewDescription":"I got this phone not too long ago and didn’t have time to test it properly until I was trying to take a phone call! I couldn’t hear them UNTIL I put them on speaker. Company refused to give me a replacement item even though I said I would send the damaged phone back. Like come on!? I want a working phone that I payed for in EXCELLENT CONDITION NOT A BROKEN ONE. Amazon couldn’t do anything due to this apparently being a 3rd party seller which I wasn’t aware that that’s where the phone came from as it was listed as a phone being sold BY AMAZON! Now I do not have a working phone thanks to this. Can’t even take calls in private. Thanks Amazon and 3rd party Seller","isVerified":true,"ratingScore":1,"reviewReaction":"3 people found this helpful","country":"United States","date":1712534400000}
{"reviewTitle":"Loved My Purchase!!","reviewDescription":"I was skeptical of buying a used product but the best reviews came from Amazon. The packaging came in great condition, my phone had no scratches, the lighting was amazing, and the camera quality was good. 10\/10. I recommend buying a refurbished phone from Amazon, I hope this helps!","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724544000000}
{"reviewTitle":"Great quality","reviewDescription":"Very pleasantly surprised on how good of shape my iPhone came in. Don’t know if I just got lucky but… it had just one minor scuff on the back that you could barely see and with a case (which I always use) will never see!  Screen in perfect condition, camera works great, battery life is at 99%!! This was the best price I could find for 128g. Very happy with my purchase so far.","isVerified":true,"ratingScore":5,"reviewReaction":"3 people found this helpful","country":"United States","date":1723420800000}
{"reviewTitle":"Surprised","reviewDescription":"I ordered an unlocked iPhone 12, 64GB. There are very minor scratches around some of the edges, everything else is mint. Screen is clean, snappy response, battery health at 100%. Will update if any problems arise, but as of now, it feels like a brand new phone.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724371200000}
{"reviewTitle":"iphone 12 is great!","reviewDescription":"Good deal. I bought \"refurbished\" phone, but it sure looks and feels like new.This cost below 1\/2 the price of a new one, so I don't get why\/how folks will pay $600+ for a cell phone these days, which is ridiculous. Highly recommend a refurbished phone from this seller. Thanks","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724198400000}
{"reviewTitle":"Thinking about upgrading to a refurbished phone?","reviewDescription":"This IPHONE 12 I bought came in 4 days earlier than the original date given. It is in perfect condition, no scratches or defects that I can see. The battery health is at 100% which I never would have expected. It also came with plenty of information to rectify any grievance or just exactly how to return if not satisfied. I will definitely use this source again in the future","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723161600000}
{"reviewTitle":"Item As Described","reviewDescription":"The phone was exactly as described. I use it to FaceTime and text with my granddaughter. It doesn't take long to charge. The battery lasts for 2 days. Sound quality.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1725062400000}
{"reviewTitle":"I have bought at least 10 referbished phones and computers, and they always work well.","reviewDescription":"I purchase all my electronics (mostly phones and computers)  referbished through Amazon.  They always are in great shape and worke very well.. You save so much money.  You do not have worry about the quality or whether they work.  They always do.  Very greateful to Amazon.God Bless,Marshall","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1723593600000}
{"reviewTitle":"Good for its price!","reviewDescription":"Great quality, bought it for my brother and helped him set up his apple account. We ran across no issues. Its a good price for its quality 👍","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1724889600000}
{"reviewTitle":"Great seller.","reviewDescription":"Phone arrived in fantastic shape. Touchscreen was solid? No cracks, chips, or streaks. Battery capacity was all the way at 98% which is amazing. Charge port was clean and solid, speakers were free of any debris or damage. This phone is the perfect size in my opinion and is the best phone Apple has put out in the past few years.","isVerified":true,"ratingScore":5,"reviewReaction":"","country":"United States","date":1722988800000}
{"reviewTitle":"Renewed?  Try \"Like New\"","reviewDescription":"After several unhappy experiences with \"like new\" phones from other sellers that were anything but, I finally gave Amazon's \"renewed\" phones a try.  Not a scratch on the screen or the body, and the battery charges to 100%.  Saying \"highly recommended\" would be an understatement.","isVerified":true,"ratingScore":5,"reviewReaction":"One person found this helpful","country":"United States","date":1723852800000}
{"reviewTitle":"Recomendado pero deben especificar más los detalles para que el cliente lo tenga en cuenta","reviewDescription":"Hola iba a devolver el producto pero no tengo tiempo para ello me quedé con el al final esta 100% operativo lo único es que la mica de la pantalla tiene muchas rayas y me llegó antes de lo esperado","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"Battery health not worth it","reviewDescription":"In my opinion the battery health could have been better . I know it refurbished but 80% is not work it . Also I think that the battery health should be displayed","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1724284800000}
{"reviewTitle":"not 'excellent'","reviewDescription":"described as in 'excellent' condition, but came with knicks around edges of cameral lenses, scratches on screen and only 81% maximum battery capacity (near minimum required to qualify as renewed).","isVerified":true,"ratingScore":3,"reviewReaction":"One person found this helpful","country":"United States","date":1723507200000}
{"reviewTitle":"Quality","reviewDescription":"The phone works fine, the battery was only at 73% and there was a small crack in the upper right corner. But other than that it works fine.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722729600000}
{"reviewTitle":"Bought the phone specifically for T-Moble and it was locked","reviewDescription":"When I got the phone it was in great condition. It had zero scratches, good response, and just over a durable phone for low amount of money. Unfortunately all that was ruined when I found out that my carrier (T-Mobile) couldn't connect my phone to a line due to it being locked. I would suggest if you are planning on buying this phone, make sure to have the service provider set on unlocked.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722211200000}
{"reviewTitle":"Some minor damage near the charging port and stratches around the camera.","reviewDescription":"The phone came on time. But with minor stratches around the camera, and on the charging port. Works okay but didn't like how it came non excellent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Used battery","reviewDescription":"The “refurbished- excellent” iPhone that I purchased came with a battery of 83% capacity. For a renewed phone in excellent condition, you would expect a battery with better capacity than that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1722556800000}
{"reviewTitle":"\"Premium Renewed\" not quite premium","reviewDescription":"Pricing lower than Swappa or Backmarket, with Amazon's return policy another plus.  Shipping delayed a few days, then delivered to an Amazon \"hub\" rather than my home.  I never had anything delivered elsewhere, but maybe that's a new option and I missed it when ordering.  Packed in a nice 'Amazon renewed' box that held contents securely, but that box was then just tossed into a much larger generic Amazon box for shipping--no padding, no airbags, etc.  Flimsy generic lightning cable included, along with a generic and obviously well used 5w charger (these accessories match what the listing indicated, so no problem).  Phone is in generally good cosmetic condition--back and sides seem very good, so was probably in a case; screen though has two distinct scratches toward the bottom.  Both are about a half inch long and both are visible at arm's length.  The plastic protective sticky sheet over the screen was fine, but the one over the camera lens was too sticky and left residue on the lens that I am unable to get off totally.  Phone booted up fine, and Battery Health & Charging in settings says the battery is at 92%.  However, the Battery Stats shortcut which pulls info from Apple Analytics has more accurate and detailed info.  It shows the phone has gone through 320 complete charging cycles and the actual capacity is currently 88.9%.  This is slightly below the 90% battery life that Renewed Premium is supposed to have.  Overall, with the screen scratches, sticky residue and slightly below advertised battery life, I'd give this iPhone 12 about a 7 out of 10.  If I can resolve the camera lens residue, it'd be an 8 or 8.5.  If I can't find a way to safely get the sticky residue off the camera lens, I'll have to return the phone.  :-)","isVerified":true,"ratingScore":3,"reviewReaction":"13 people found this helpful","country":"United States","date":1690329600000}
{"reviewTitle":"Charging issue","reviewDescription":"The iPhone is having trouble charging and holding a charge for longer periods of no use. Out of the seven WORKING chargers I have, only one actually charges the phone and it’s not the one that it came with. There are some scratches on camera outter ring but that is somewhat expected with a refurbished product. Otherwise, it’s a great iPhone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Ok","reviewDescription":"Cons- if you plan on trying to set it up with E-sim, you're sol..carrier said E-sim is unavailable on this phone, but it shouldn't be. Went through heck to get phone set up, had to order a physical sim, so finally after a week, I finally have it set up. I paid for excellent condition, but battery is only 88%.Pro- looks brand new, no scratches or dings.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"High hopes but problems","reviewDescription":"The product was in great condition as described but the ear speaker did not work. I couldn't hear anyone that called me unless I placed them on speaker phone.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717200000000}
{"reviewTitle":"Disappointing","reviewDescription":"This is a story of \"You can't teach an old dog new tricks\". My grandson talked me into purchasing the iPhone. I have been using a Samsung product for years. I noticed some very good advantages in the iPhone. However, the change for me was a shock. I was constantly asking for help on its use, and was stressful to the point I hated to use it. It turned out to be very challenging and confusing to me. I tried and failed to learn to fully use it. Everyone who has one swears by it. I am approaching 80 and and was unable to make the change. I was defeated by the new technology. Sorry I had to write this review. This is a true story.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1704067200000}
{"reviewTitle":"Just a heads up…","reviewDescription":"The phone itself arrived in good used condition as advertised. Many dings and chips around edges. Back and screen however are flawless.But just a heads up, the phone was filthy. I spend about 30 minutes meticulously cleaning crevices, speaker holes and charging port. Not what I expected to get from a “refurbished” phone. Phone also signed out of iCloud but was not completely reset, I had to do that myself.","isVerified":true,"ratingScore":3,"reviewReaction":"2 people found this helpful","country":"United States","date":1713398400000}
{"reviewTitle":"Don’t pay extra for fast shipping!","reviewDescription":"I ordered 2 phones on here for OVERNIGHT shipping for almost $40… and it took 4 days for us to receive the phones and Amazon can’t refund me for it. Why pay that much for overnight shipping if it’s going to take that long anyways ? But anyways the phones are amazing in excellent condition. 90% battery , and 85% battery for the other but there’s no scratches or dents. We are satisfied with the product but NOT with shipping !","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1710806400000}
{"reviewTitle":"Disappointed","reviewDescription":"The volume of the device is strangely low, when using the speakerphone the conversation doesn't flow very wall because there's the need to get too close to the device to listen the other person talking.There are way more dents and scratches then the antecipated by the description of \"good\" quality . The ink is peeling of on severeal parts of the device's body.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712102400000}
{"reviewTitle":"It’s a bit of a gamble","reviewDescription":"Overall the phone works just fine but it seems the screen was replaced by an aftermarket part and the battery health is only at 77% so i wasn’t thrilled. To replace the battery is another $90 and at this point I probably should have bought a new phone of last years model. You’re buying used phones so the condition is always a bit of a gamble.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1712448000000}
{"reviewTitle":"QA not Great","reviewDescription":"The phone works well. The only issue was that the charging port was crammed with pocket lint. Refurbisher should make sure to check that.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1717286400000}
{"reviewTitle":"Aftermarket Screen","reviewDescription":"Bought this as renewed excellent. Out of the box it looked great. Upon closer inspection it is obvious that the screen had been replaced with an aftermarket lower quality screen. The screen displays images darker, with less brilliant color, and more blurry than would be expected. Battery was at 90% health. Definitely not what I expected “excellent” to represent. Disappointed.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711238400000}
{"reviewTitle":"Need instructions.","reviewDescription":"Device arrived timely and in good condition. Please with the way it looks and the size. One thing missingis instructions on how to transfer from my old phone to the new phone. I am a phone user not a phonetechnician. Will take my phones to Phone Shop tomorrow  to have them make the transfer.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711843200000}
{"reviewTitle":"Old Battery and poor paint.","reviewDescription":"The exact same battery as the past user had. Couldnt even replace the battery. The charge health is only at 80% and i have to charge my phone 2-4 times a day.And there are several spots on the phone with scratch marks on the paint. Selected \"excellent\" condition. Condition is NOT excellent.","isVerified":true,"ratingScore":3,"reviewReaction":"","country":"United States","date":1711152000000}
{"reviewTitle":"Low battery life","reviewDescription":"The phone’s battery life\/capacity was only at 81%. Other renewed phones I’ve purchased have been at 90% or higher so this was very disappointing. Otherwise, the phone is in good condition.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Not worth the 50% more for premium","reviewDescription":"I ordered 2 of these for my kids. Both arrived with a ton of adhesive that I needed to clean off. The black one was in decent shape, but the blue one had tons of little nicks and marks. There was paint scratches around the lens and so much adhesive on the lens, I want sure I could clean it enough to be usable. I managed, but it didn't feel like I purchased premium service for what I got. My kids are content and a decent case will cover most of the issues, but for premium I was guaranteed no visible damage at 12 inches away and that is not what I got. Very disappointed.","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1703548800000}
{"reviewTitle":"3rd used phone with issues","reviewDescription":"This one doesn’t connect to WiFiThe last one I got 4 days ago showed up broken5 days before that the phone wouldn’t setup facial recognition","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716508800000}
{"reviewTitle":"Bad battery","reviewDescription":"The phone initially looked beautiful within 2 weeks the battery got super hot and melted inside...I contacted tge company no response I would beware!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715212800000}
{"reviewTitle":"Wrong Description \"Sim Locked\" not Unlocked.","reviewDescription":"Settings > General > AboutI see SIM LOCKED.On the webpage, they say its UNLOCKED with all carriers, but seems its locked.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Battery is at 77% after <6 months of use","reviewDescription":"We’ve had this phone for <6 months, amd it’s already shutting down randomly and needing a new battery","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1715904000000}
{"reviewTitle":"Not a good design.","reviewDescription":"That side button is inconvient and cause problems. Plus it' s harder to use with Apple pay.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716595200000}
{"reviewTitle":"Low battery capacity","reviewDescription":"I got this phone and the battery health is at 75% what’s the point then? I’m very disappointed, I’m probably going to send it back. Will be testing how long the battery last.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1713916800000}
{"reviewTitle":"not what i ordered","reviewDescription":"Package delivered early, condition great, minimal scratches and chips, and battery life at 90%. All good things that were lining up for a 5 star review, if only I had received the green phone color instead of the white one. I was really looking forward to having the green color phone since I thought the shade of green was awesome, but i guess i will never know since i was delivered the white one instead. i wont go through the hassle of returning it since i needed a new phone urgently. not angry just disappointed:(","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1701734400000}
{"reviewTitle":"Requesting return","reviewDescription":"I got the iPhone 12 as a gift… it was the best quality available. It looked great. Great condition. Nothing wrong whatsoever. Maybe a scratch or two. I made the mistake of not testing all features out however. The screen is great but I noticed the audio was bad. The call were quieter than it should be compared to my previous lesser iPhone and YouTube videos were very choppy in regard to sound.that’s the only reason I’m returning it but proceed with caution and test visual and audio out!","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Don't fall for the \"Premium Renewed\" Trap","reviewDescription":"They charge you more to get all these \"Guarantees\", then run you through hoops to use it! You are supposed to get the option of a replacement or return for ONE YEAR. Good luck getting a replacement. My power button stopped working. They wanted me to purchase another one - it's now $46 higher, set it up and then return the bad one for a refund. NO ONE at Amazon knows about this guarantee in fact, after being transferred 5 times on a call today, the guy in tech support told me I have to contact Apple, when the Guarantee is through Amazon. OK....I did a return and will purchase another one for less so they just lost part of a sale. THIS PREMIUM THING IS A DOWNRIGHT SCAM.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1691107200000}
{"reviewTitle":"lasted a month","reviewDescription":"quit allowing calls after a month, neither my carrier or apple could fix it. Luckily the trade in value with my carrier was the same as the purchase price. stick with new phones","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1712620800000}
{"reviewTitle":"Had to replace the premium for “good condition”","reviewDescription":"I had bought the premium refurbished phone first and it was working great for 2 weeks, but then the ear speaker goes out. Therefore, I ordered a replace and they send me an iPhone that is in “good condition” instead of the one I paid for. Additionally the battery life on it was 79% when the one I actually bought had 100%. So, it is up to you if you want to take the chance and buy from this seller.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1702425600000}
{"reviewTitle":"Sound","reviewDescription":"Beautiful phone from the front and back but something that did disappoint me were the scratches on the side. I really needed a phone for the time being so I bought a case to cover those sides up but another thing that bothers me is the fact that when someone calls, the ringing is so low I can barely hear it and the silent button isn’t even on while my volume level is also high so that’s a bummer. Beware y’all","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704585600000}
{"reviewTitle":"A lot of scratches and dings on the phone","reviewDescription":"I was really surprised when I received the phone that there are at least 5 significant scratches on the phone. I was not expecting that for \"Excellent condition\" and still an over $300 phone. It seems to be working ok otherwise but this should not have been listed as excellent condition and then to be received with damages on the phone. The product description should be way more transparent in regards to the actual condition of the phone.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1703548800000}
{"reviewTitle":"Battery life","reviewDescription":"Battery life seems shorter than I expected","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1716768000000}
{"reviewTitle":"Just bad looks great but bad everything else","reviewDescription":"The Bluetooth doesn't work nor does the wifi along with when you try and take a video it makes a static noise do not recommend  😒","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1713139200000}
{"reviewTitle":"No está en excelente condicion","reviewDescription":"A pesar del que producto no es nuevo la publicación decía que era un producto renovado en excelente condición y no fue así pague muy caro por este producto con 80% de batería la pantalla con un rayón bastante visible y un golpe en su carcasa la condición debería ser como se describe el año pasado compre uno similar y estaba como nuevo sin rayones sin daños y 100% de batería","isVerified":true,"ratingScore":2,"reviewReaction":"2 people found this helpful","country":"United States","date":1705449600000}
{"reviewTitle":"Get what you pay for","reviewDescription":"Phone was still registered to another owner and it was dirty(photo provided), the FaceTime barely works and so does the sound. Usually I don't have issues when I purchase refurbished phones but this time I wasn't really pleased with this purchase for my son.","isVerified":true,"ratingScore":2,"reviewReaction":"One person found this helpful","country":"United States","date":1710028800000}
{"reviewTitle":"Renewed is a misnomer","reviewDescription":"Upon initiating my “renewed” phone I discovered the battery health is only at 79%. This means fairly soon I will have to replace the battery.  I am not pleased with this purchase because of the low battery health.  “Renewed” obviously doesn’t include a renewed or new battery.  Last used iPhone I purchased from Swappa the battery health was 99%. My next iPhone purchase will be from Swappa.","isVerified":true,"ratingScore":2,"reviewReaction":"","country":"United States","date":1704499200000}
{"reviewTitle":"Defective product","reviewDescription":"I bought this iPhone in “excellent” condition. After receiving this phone it immediately had pixel deformation and the front screen in its entirety popped off. After requesting a refund I was told that this was from accidental damage. It is clear that this seller is producing inadequate products and hoping that the issues don’t resolve prior to the return period.Do not buy from this seller","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1719532800000}
{"reviewTitle":"Bad Experience- do NOT buy !!","reviewDescription":"I purchased this phone in “excellent” condition and it’s so dented and scratched. I’m so upset. I didn’t expect to look brand new but to have every corner dirty and dented really upsets me. If I wanted a “fair” condition phone I would have bought one. This phone is in bad shape and extremely overpriced. I will be returning.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718755200000}
{"reviewTitle":"Company is dishonest","reviewDescription":"This phone was defective, the volumn on the phone didn't work. I returned it, was assured it would be refunded. I was told that the itunes account was still attached. It wasn't. For a $300 phone I was refunded $26. Buy with caution.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"False description","reviewDescription":"I bought this iPhone 12 in excellent condition and there’s nothing excellent about it. There are bumps and scratches on every end and camera. As well as the glass has scuffs that lead nowhere to the description of an excellent phone.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721865600000}
{"reviewTitle":"Technical issues","reviewDescription":"Since I started using this iphone I’m having a technical issue with WiFi\/bluetooth-airdrop connection. It would gray out for no reason and doesn’t go back to normal. I was not using the phone and the amazon warraty expired. when i realized the phone had this issue i tried to contact the seller and turn out to be no one. No number, No email, nobody to reach and make a complaint. Lost my money on this.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1718064000000}
{"reviewTitle":"Static with phone calls","reviewDescription":"The phone was no good. Everything seemed great until it was time to make a phone call. There was nothing but static and no one could hear anything!","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1723248000000}
{"reviewTitle":"Seller Hybrid IT will not honor the warranty.  Buyer beware, go elsewhere to buy a renewed device.","reviewDescription":"Seller - Hybrid IT will not honor the warranty.  Buyer beware, go elsewhere to buy a renewed device.  I bought a phone from them with a 1 year warranty.  3 months after purchase ,the phones Wi-Fi and Bluetooth stopped working.  They ignored every message sent by me and Amazon Customer Service.  Do not buy anything from this horrible Seller.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"First Horrible Experience","reviewDescription":"I done spent over 1,000s of dollars at Amazon and never complained but I bought this IPhone for Christmas for my son and I just completely crashed in March. I brought this phone to Apple and they even said that this phone isnt worth it and this was bought like that so I contacted the seller and was told it's nothing they can do but give me a discount on the next purchase of a phone lol please this don't make me want to do business with you again.","isVerified":true,"ratingScore":1,"reviewReaction":"One person found this helpful","country":"United States","date":1715644800000}
{"reviewTitle":"Terrible condition","reviewDescription":"Battery max capacity at 81%Sticky dirts at crevicesSticky and stuck side ring\/ silent switch, unable to switch between ring\/ silent at allScratches and dents on edge\/ side of phoneDefinitely not at “excellent” condition as advertised","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721433600000}
{"reviewTitle":"DUMMY PHONE!!! BACK BROKE!!!","reviewDescription":"this wouldn’t not turn on and the back of the phone is cracked. I charged charging it, resetting it. But nothing! I returned it around 2 days ago and haven’t gotten a refund. This is diabolical. I should be getting a refund asap.","isVerified":true,"ratingScore":1,"reviewReaction":"","country":"United States","date":1721001600000}
{"reviewTitle":"Excellent condition with good enough battery health","reviewDescription":"[My review contains 6 photos][My review rating actually is 4.5 stars.]My interest in purchasing an Amazon Renewed iPhone 12 (2020) arose from favorable past experiences with renewed (used) purchases, and a more affordable opportunity to upgrade a first gen iPhone SE (2016).My order was placed on March 31, 2023, and it arrived on May 4, 2023.The unboxing experience was excellent. An unadorned white cardboard box labeled \"Amazon Renewed\" on the top and some device info on the back. Inside, side-by-side, two recessed trays, one for the iPhone (covered by a clear plastic film) and the second for a USB 5V power adapter and 3' Lightning cable. A \"OPEN ME FIRST\" sleeve with several cards inside: HI THERE, WE'VE GOT YOU COVERED, QUICK START GUIDE, SIM REMOVAL TOOL, and INSPECTION TEST CERTIFICATE.Cosmetically the phone looked brand new. No noticeable blemishes (just a tiny scratch near the Lightning connection).So, after powering on and setting up the iPhone 12, I checked a few things. WiFi and Bluetooth were okay. Face ID okay. The battery was at 81% charge, with a Max Capacity (Battery Health) of 89%.  iOS was at version 16.3.1, which I upgraded to 16.4.1, then 16.4.1(a).The back of the box noted \"BH 91%\" and the Inspection Certificate noted that \"Your Device\" – A2172 BH91 – was \"Tested in New Jersey\" on 03\/24\/2023\" and \"Battery Health 90%+ confirmed.\" So, in the time (~6 weeks) between inspection and arrival, this iPhone lost 2% of max battery capacity. Is this typical (as in other reviews)? Is this a big deal?Well, in my case 89% BH probably is good enough. The renewed iPhone 12 is not my primary smartphone. And the fully charged battery lasts longer than my old iPhone SE's. And the 12 has the latest iOS and other more recent hardware and software features (like MagSafe, Precision Finding).The Amazon Renewed Guarantee includes replacement or refund within 1 year of replacement. That's a plus.","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1683676800000}
{"reviewTitle":"Works good","reviewDescription":"This iPhone 12 is super cute.  I love the lavender color. It was unlocked and worked great with my current provider (metro). It did come dinged up a bit on one corner but that was to be expected as it was a used phone.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716336000000}
{"reviewTitle":"Great phone but issue with speaker.","reviewDescription":"I love iPhones! This 12 is great but I cannot get the volume to be as loud as my last iPhone. It’s an issue with the speaker. My wake up alarms barely alert me! It also gives off a little rattle if I turn up the volume to max. I tried many ways to fix it. Maybe it’s just this phone? I don’t live near an Apple store so I’m outta luck. Will just deal with it.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1713052800000}
{"reviewTitle":"Works well","reviewDescription":"Came with sone scratches but everything is functional","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719792000000}
{"reviewTitle":"Would recommend!!!","reviewDescription":"When I first received the phone it was decently packed but when I first took the phone out it was in very good condition.The phone almost looked nearly perfect with some very minor scratches but overall very good.The battery lasted long and the screen looked fantastic.For the price and quality I would recommend it.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1714867200000}
{"reviewTitle":"Excellent Condition, except battery…","reviewDescription":"It’s like new, without scratches, phone itself is fast and flawless. The battery health shows 100 percent of its capacity, however it lasted just 5-6 hours streaming and browsing. Other than the battery issue, all are in excellent condition.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1715731200000}
{"reviewTitle":"Good","reviewDescription":"As a refurnished product, it looks quite good. However, there is an issue with the camera. A small scratch inside the lend. Make some pictures look blurry.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717977600000}
{"reviewTitle":"Good","reviewDescription":"My son loves it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718755200000}
{"reviewTitle":"\"Very Good\"...not \"Excellent\"","reviewDescription":"This renewed phone was labeled as \"excellent\" condition. Perhaps it's just my perception of the word, but there are 3 very clear imperfections on this device...so while I would consider the condition to be \"very good\" or even \"great\", I do not believe \"excellent\" was and accurate description.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1716163200000}
{"reviewTitle":"God aspect","reviewDescription":"It’s very beautiful","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1718236800000}
{"reviewTitle":"Value for Money","reviewDescription":"Not being a slave to marketing, I kept my iPhone 7 until obsolescence, and upgraded to this ‘renewed’ iPhone 12. Apart from some scratches on the housing, which are already covered by an Otter case, it’s physically fine, and although I’m having to learn the differences in the operation (no Home button, Face ID), all the apps are working, and things are faster. A little frustrating, but considering the cost for a new phone, or an Apple “refurbished”, this is certainly value for money.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1717632000000}
{"reviewTitle":"That it works well and easily.","reviewDescription":"The phone looks brand new and was able to set it up.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1719964800000}
{"reviewTitle":"Delivered with Chinese Language Active","reviewDescription":"Phone was in good shape when I received it. However, it had not been reset to original factory settings. The language was in Chinese so I had to watch a YouTube video and try to follow through changing the language and the fonts to English had the phone been reset to factory settings, this would not have been an issue. If they going to refer the phone, they should complete the job. It seems to be working fine, but we’ll see overtime.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1717545600000}
{"reviewTitle":"Goodseller","reviewDescription":"I like it and love it","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720483200000}
{"reviewTitle":"Not water resistant","reviewDescription":"Apparently after renewing the phone it is no longer water resistant. It worked fine until it went into water for a second.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1720569600000}
{"reviewTitle":"Functions Properly-Not Happy with Screen","reviewDescription":"First let me say that given the HUGE savings in buying used over new for an iPhone, to me, is worth a few imperfections. So, overall I am happy with this purchase. But I still wanted to review the imperfections so people know what to expect.I’ve been using this phone for 3 months and it was listed as in “very good” condition. I have no complaints about functionality. It functions properly. The battery life is a little less than ideal, but isn’t bad enough to be a problem.The thing that I was most disappointed with,I didn’t notice right away because this phone came with a screen protector on it. It had some air bubbles behind it, and as much as I hate not having a perfect looking screen, I decided to save money and use it for a while before I bought a new screen protector.However when I removed the screen protector the first time I saw that the iPhone screen was very scratched all around the edges. But what bothers me most is that new screen protectors don’t adhere properly to this phone. There are always air bubbles under my screen protector. It drives me nuts because it looks messy.","isVerified":true,"ratingScore":4,"reviewReaction":"24 people found this helpful","country":"United States","date":1709078400000}
{"reviewTitle":"Great value, shipped fast!","reviewDescription":"My iPhone SE 2nd gen very suddenly bit the dust after 3 years and I needed a new device FAST! I didn’t want to drop close to $1K on a new phone but still wanted to upgrade from my much older previous phone.  My iPhone 12 arrived within a few business days. My only complaints are that the third party charger that was sent along did not work, but thankfully I already had several iPhone compatible chargers in my home. The battery health is at 80% but I expected about that much as it is a used device. So far a full charge with moderate use (listening to music, checking social media and texts) lasts me a whole workday anyways. Besides, even getting a new battery eventually would still be a lot cheaper than buying new from Apple and I felt really confident in Amazon to give me a refund in the event the phone was not in working order. Thankfully, everything functions fantastic! I ordered a T-mobile locked one and then just swapped over my SIM, and it updated on my plan immediately to reflect the new phone. Overall I would absolutely buy from Amazon renewed again!","isVerified":true,"ratingScore":4,"reviewReaction":"11 people found this helpful","country":"United States","date":1703808000000}
{"reviewTitle":"iPhone 12","reviewDescription":"So, the phone itself is a 5\/5⭐️ review. Everything seems to be working great. Storage is great. I had a iPhone XS with 64g of memory. With all the apps I want loaded onto it I’ve filled 25g. My pictures took up a lot of space so I’m happy that I have the room for more. The phone came with a charger which was great for me as I break mine a lot.Now, the reason I gave it a 4\/5⭐️ is due to the shipping aspect. I do understand this is out of the sellers control. I ended up finding it at a neighbors house looking all creepy like. They walked out and began yelling at me till they saw it was mine.","isVerified":true,"ratingScore":4,"reviewReaction":"","country":"United States","date":1712361600000}
{"reviewTitle":"Hm","reviewDescription":"I Like the phone, but the scratches kind of bother me. It’s honestly fine tho I’m kinda sad the battery service was at 80 but it’s okay, it’s a decent phone the display is so good compared to the 11 it’s way more vibrant, shipping was quick and I do not regret getting this phone.","isVerified":true,"ratingScore":4,"reviewReaction":"2 people found this helpful","country":"United States","date":1718668800000}
{"reviewTitle":"As expected","reviewDescription":"I bought an “excellent condition” iPhone 12 64gb. The screen and back of the phone were mint and there was one small chip on the border where it was clearly dropped. This didn’t impact the screen or function of the phone in any noticeable way though. The battery health was 90%.","isVerified":true,"ratingScore":4,"reviewReaction":"One person found this helpful","country":"United States","date":1718928000000}
